{
    "id": "LUCENE-2587",
    "title": "Highlighter picks wrong offset for fragment boundaries",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "modules/highlighter"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "3.0.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I have written  a new Fragmenter since we need fragments for hitlines to be on sentence boundaries and not cross paragraphs. \nWhen using it with org.apache.lucene.search.highlight.Highlighter, I get hitlines that starts with \". \", \"? \", \"! \"...\n\nConsider the text  \"A b c d e. F g h i j! K l m n o. \" \nwhich become the tokenstream : (A) (b) (c) (d) (e) (F) (g) (h)  (j) (K) (l) (m)  (o)  \n\nIf the fragmenter return isNewFragment()  = true on F and K and Highlighter pick the middle fragment, lets say we search on \"g\" the hitline becomes:\n\". F <B>g</B> h i j\"\n\nThe reason, it seems, is that the offset to the fragment boundaries found by taking the endOffset of the last token in a fragment , \nnot the startOffset of the first. \n\nTJ",
    "attachments": {
        "IMSentenceFragmenter.java": "https://issues.apache.org/jira/secure/attachment/12502373/IMSentenceFragmenter.java",
        "TestIMSentenceFragmenter.java": "https://issues.apache.org/jira/secure/attachment/12502374/TestIMSentenceFragmenter.java",
        "LUCENE-2587.patch": "https://issues.apache.org/jira/secure/attachment/12502189/LUCENE-2587.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-11-02T17:37:00+0000",
            "content": "Suppose I have a dummy Fragmenter that returns isNewFragment() = true on F and K. I have the text \"A b c d e. F g h i j! K l m n o. \". I search for \"g\" hence the Highlighter will pick the middle fragment. The fragment it returns is \". F <b>g</b> h i j\". I was wondering if the correct fragment should be \" F <b>g</b> h i j\" or even \"F <b>g</b> h i j\" without the starting whitespace. The starting \".\" is a bug and matches the issue LUCENE-2587. I was wondering if, instead, the starting whitespace at the beginning of the fragment is correct or not. And, in the end, if I understood correctly the issue LUCENE-2587, but I think so. Thanks in advance to anyone who wants to answer. RM ",
            "author": "Roberto Minelli",
            "id": "comment-13142329"
        },
        {
            "date": "2011-11-03T09:00:15+0000",
            "content": "Sorry for the delay in responding, it's been a year since I looked at this...\n\nI don't have a complete test case as of right now, but I'll upload my fragmenter. \nThe code is a bit messy, but works by finding all fragment boundaries on start(text,tokenstream)\nThe algorithm is a s follows\n\n\tfirst find paragraphs (marked as \"\\n\\n\")\n\tthen chop up paragraphs on \".\" as close to max length as possible\n\tif fragments(sentences) are too long, try breaking on \",\" or \";\", else on white space\n\n\n\nThe problem comes since the org.apache.lucene.search.highlight.Highlighter uses the end char offset of the last token in the  previous fragment, +1 , as the start char offset in the TextFragment.textStartPos\nAs I'm rereading the Highligther.java code now, this is \"hidden\" beneath the length calculations of a fragment, which is is calculated as: (end char offset of last token) - (start char offset of first token), hence the stuff in between which is not in a token ultimately gets prepended on the resulting text.\n\nI ultimately did a workaround by replacing leading \".\", \",\", \"?\", \"!\", then a trim() on the String Highlighter.getBestFragment() returns... ",
            "author": "Terje Eggestad",
            "id": "comment-13142967"
        },
        {
            "date": "2011-11-03T09:01:25+0000",
            "content": "My sentence fragmenter ",
            "author": "Terje Eggestad",
            "id": "comment-13142968"
        },
        {
            "date": "2011-11-03T18:09:21+0000",
            "content": "I submit a patch. I do not have time now to test it with your Fragmenter. I think the patch should solve the issue anyway. Waiting some feedbacks. ",
            "author": "Roberto Minelli",
            "id": "comment-13143391"
        },
        {
            "date": "2011-11-03T18:09:57+0000",
            "content": "This patch should solve the issue. ",
            "author": "Roberto Minelli",
            "id": "comment-13143394"
        },
        {
            "date": "2011-11-03T21:04:06+0000",
            "content": "Hi Terje,\n\nCan you upload your IMSentenceFragmenter.java file again, but this time click on the radio button next to \"Grant license to ASF for inclusion in ASF works (as per the Apache License §5)\"?\n\nThanks,\nSteve ",
            "author": "Steve Rowe",
            "id": "comment-13143528"
        },
        {
            "date": "2011-11-04T08:42:54+0000",
            "content": "Sentence Fragmenter ",
            "author": "Terje Eggestad",
            "id": "comment-13143832"
        },
        {
            "date": "2011-11-04T08:43:41+0000",
            "content": "Tests for Sentence Fragmenter ",
            "author": "Terje Eggestad",
            "id": "comment-13143833"
        },
        {
            "date": "2011-11-04T08:51:51+0000",
            "content": "Hi Steve\n\nDone. \nYou want to include it in future releases? Do me a favor and clean it up a bit so I don't look completely incompetent \nYou'd need to add an option for paragraph demarcation. \nAlso added the Test class for the Fragmenter. The test text need to be replaced, it's an excerpt from a copyrighted news paper article...\n(You should have an english text anyway)\n\nTJ ",
            "author": "Terje Eggestad",
            "id": "comment-13143835"
        },
        {
            "date": "2011-11-04T11:56:24+0000",
            "content": "Hi Terje,\n\nThanks for posting your code and a test - I'll take a look.  My initial interest is seeing how your code triggers the highlighting bug.  I think the ideal way to proceed is create a test fragmenter based on but simpler than your fragmenter, to trigger the bug, and then fix the bug.  Roberto may have already essentially done all of this - I haven't had a chance to look at his patch yet.\n\nOnce that's all done, I think it's appropriate to create a new issue for your sentence fragmenter, since that would be a great addition to Lucene!\n\nThanks again,\nSteve ",
            "author": "Steve Rowe",
            "id": "comment-13143938"
        },
        {
            "date": "2011-11-05T12:38:25+0000",
            "content": "Yes. I actually created a dummy Fragmenter on-the-fly in my test case. Did someone looked at the patch?? ",
            "author": "Roberto Minelli",
            "id": "comment-13144672"
        },
        {
            "date": "2011-11-06T18:01:23+0000",
            "content": "Hi Roberto,\n\nI've looked at your patch, and you've done a good job of finding the problem, fixing it, and providing a test that fails before your fix and succeeds afterward.\n\nHowever, I see a problem.  Your fix changes fragments' beginning offsets to exclude preceding inter-fragment non-tokenized characters, but this causes adjacent fragments to be non-contiguous (contiguity is defined as frag1.end==frag2.start).  As a result, your fix prevents adjacent fragments from being merged.  (See mergeContiguousFragments(), which is called from getBestTextFragments().)\n\nIdeally, another test should be added that checks for the problem your current fix causes (adjacency != contiguity), and then your fix should be changed to enable contiguous fragment merging. ",
            "author": "Steve Rowe",
            "id": "comment-13145052"
        },
        {
            "date": "2011-11-06T18:06:43+0000",
            "content": "I was about to report that! Yesterday night I thought about that. If I have some spare time I will look back at the code and fix it. I think the only wrong thing now is the end of a fragment that should include whitespaces and punctuation. ",
            "author": "Roberto Minelli",
            "id": "comment-13145056"
        },
        {
            "date": "2011-11-06T18:19:23+0000",
            "content": "I think the only wrong thing now is the end of a fragment that should include whitespaces and punctuation.\n\n+1 ",
            "author": "Steve Rowe",
            "id": "comment-13145062"
        }
    ]
}