{
    "id": "LUCENE-273",
    "title": "Move IndexReader.delete functionality to IndexWriter",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "1.4",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "I propose moving the functionality of deleting a document from the index from\nIndexReader to IndexWriter, not only because because it is misleading that a\nreader modifies the index, but also because of the following problem:\n\nI have a website index, that should be updated but that should also be available\nfor searching while updating. So I open an IndexReader for searching the index\nfor a specific document and for deleting an outdated document from the index and\nI open an IndexWriter to add updated documents to the index. But there is a\nconflict between the locks of those two instances. If I want to update a\ndocument, I have to close the IndexWriter (because otherwise IndexReader could\nnot obtain the lock for writing to the index) and the IndexReader (because it\nwould complain if the index was modified since opening the reader). Then I have\nto create a new reader to delete the document from the index, and I have to\nclose this reader as it does not release the write lock after deleting a\ndocument, so I would not be able to open an IndexWriter. And now I can open a\nfresh IndexWriter for adding the new document again and a fresh IndexReader for\nsearching the index for the next document.\n\nYou see, in the worst case (every document has been modified) the program is\nonly opening and closing readers and writers all the time.\n\nIf the IndexWriter deleted documents from the index, only this instance would\nneed a write lock and I could only use one IndexReader and one IndexWriter for\nupdating the whole index.\n\nIf you know a better way to update the index, then let me know.\n\nTilman Giese",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2004-09-13T16:00:49+0000",
            "content": "Having delete functionality in IndexReader and not in IndexWriter is a design\ndecision that cannot be changed easily. For an explanation and for a discussion \non updating of documents see developer list around July 16, subject:\n\"Deleting a document with an IndexWriter open\".\n.\nChristoph ",
            "author": "Christoph Goller",
            "id": "comment-12321892"
        }
    ]
}