{
    "id": "LUCENE-4812",
    "title": "missing .fnm file from jira\\index\\ preventing users from viewing any projects data",
    "details": {
        "components": [
            "core/index"
        ],
        "fix_versions": [
            "3.6"
        ],
        "affect_versions": "3.6",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Jira users could not view any projects data due to following error:\n\norg.apache.commons.lang.exception.NestableRuntimeException: java.io.FileNotFoundException: C:\\Jira\\index\\issues\\segments (The system cannot find the file specified)\n\nI copied the segments file from last backup and now the following error is reported in the C:\\Windows\\system32\\Atlassian log\n\norg.apache.commons.lang.exception.NestableRuntimeException: java.io.FileNotFoundException: C:\\Jira\\index\\issues_5zd.fnm (The system cannot find the file specified)\n\nThis missing file is not found in any backups. Please advise on a fix.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-03-05T17:12:52+0000",
            "content": "Bill,\n\nI believe you are attemtping to file a bug with Atlassian about a Lucene related error you are seeing in your local Jira instance...\n\nhttps://www.atlassian.com/resources/support\n\nThis jira instance (issues.apache.org) is the work/bug tracker for changes to the lucene code base – we have nothing to do with atlassian except that we are also users of jira.\n\nFWIW: w/o knowing anything about how Jira uses lucene under the covers – if you have a lucene index that is corrupt in some way and missing the segments file, and you are attempting to restore from a backup – you normally need to restore the entire index dir, since the segments file refers to the other index files on disk.\n\nbut i strongly suggest you contact atlassian and get their recommendations since we can't even speculate which version of Lucene is used in the various versions of atlassian jira, let alone how they use it.\n ",
            "author": "Hoss Man",
            "id": "comment-13593603"
        },
        {
            "date": "2013-03-05T17:54:11+0000",
            "content": "Thank you for the quick response and guidance-was not sure where to go with this as I just took over support for this product!\n\nRegards, \n\nBill\n\nSent from my iPhone\n\n ",
            "author": "Bill",
            "id": "comment-13593671"
        }
    ]
}