{
    "id": "LUCENE-2174",
    "title": "Add new SpatialFilter and DistanceFieldComparatorSource to Spatial",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The current DistanceQueryBuilder and DistanceFieldComparatorSource in Spatial are based on the old filtering process, most of which has been deprecated in previous issues.  These will be replaced by a new SpatialFilter class, which is a proper Lucene filter, and a new DistanceFieldComparatorSource which will be relocated and will use the new DistanceFilter interface.",
    "attachments": {
        "LUCENE-2174.patch": "https://issues.apache.org/jira/secure/attachment/12428583/LUCENE-2174.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-12-20T20:37:42+0000",
            "content": "Attaching patch that adds the SpatialFilter and DistanceFieldComparatorSource, which appropriate tests, and deprecations for old behavior. ",
            "author": "Chris Male",
            "id": "comment-12793039"
        },
        {
            "date": "2010-08-16T15:33:36+0000",
            "content": "One unfortunate behaviour of the SpatialFilter is that AFAIK it can only be \"AND\"-ed onto the query, and not \"OR-ed\"\n\nWe want to make a filter query along the lines of \n{!spatial radius=2 lat=xxx long=yyy}\n: OR street:\"foo street\"   – which AFAIK is impossible, the spatial filter applies to the whole query in an \"AND\" capacity.\n\nRationale: Foo street may be much be longer than 2 kilometers, and at this time all we know is that the user is on \"foo street\".  We want to filter the query for results in a radius from where we've geolocated the user (middle of foo street) but also include results that state textually that they are on \"foo street\".\n\nSimilarly for when we've geolocated the user to a gerrymander-shaped suburb. ",
            "author": "Graham P",
            "id": "comment-12898969"
        },
        {
            "date": "2010-12-01T09:51:48+0000",
            "content": "Closing along with LUCENE-2139. ",
            "author": "Chris Male",
            "id": "comment-12965640"
        }
    ]
}