{
    "id": "LUCENE-3269",
    "title": "Speed up Top-K sampling tests",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/facet"
        ],
        "type": "Test",
        "fix_versions": [
            "3.5",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "speed up the top-k sampling tests (but make sure they are thorough on nightly etc still)\n\nusually we would do this with use of atLeast(), but these tests are somewhat tricky,\nso maybe a different approach is needed.",
    "attachments": {
        "LUCENE-3269.patch": "https://issues.apache.org/jira/secure/attachment/12485128/LUCENE-3269.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-07-04T10:21:45+0000",
            "content": "here's a patch that speeds up the slowest ones a bit (doesn't really solve the problem, but helps as a step) ",
            "author": "Robert Muir",
            "id": "comment-13059378"
        },
        {
            "date": "2011-07-04T11:02:27+0000",
            "content": "Patch looks good. One other idea I think we should try is to create the large indexes once per all Top-K tests extensions. There are several references to FacetTestBase.initIndex(), and I think that the TopK tests can create their indexes (which is the same) at @BeforeClass, perhaps all indexes per partition sizes that are tested, and then proceed with testing. I think that will cut away a large portion of the running time. ",
            "author": "Shai Erera",
            "id": "comment-13059388"
        },
        {
            "date": "2011-07-04T11:26:04+0000",
            "content": "Hi Shai, here is an updated patch that achieves the same thing, now the tests don't create redundant indexes ",
            "author": "Robert Muir",
            "id": "comment-13059395"
        },
        {
            "date": "2011-07-04T11:39:45+0000",
            "content": "One more tweak, this one seems to help a lot, allows subclasses to tweak the IWConfig (we use the same trick here that we use for NRQ tests to prevent really slow behavior for such large indexes) ",
            "author": "Robert Muir",
            "id": "comment-13059396"
        },
        {
            "date": "2011-11-14T09:01:54+0000",
            "content": "Patch introduces the following:\n\n\tHashMap<Integer, SearchTaxoDirPair> which is initialized in beforeClass and maps a partition size to the pair of Directories.\n\tinitIndex first checks the map for the partition size, and creates the indexes only if no matching pair is found.\n\n\n\nThe sampling tests do not benefit from that directly, as they only run one test method, however, if they will run in the same JVM, then they will reuse the already created indexes.\n\nPatch is against 3x and seems trivial, so I intend to commit this later today or tomorrow if there are no objections. ",
            "author": "Shai Erera",
            "id": "comment-13149506"
        },
        {
            "date": "2011-11-14T11:38:59+0000",
            "content": "Hi Shai: a couple suggestions.\n\nWith the current patch we will never close these directories, so we lose some test coverage like the CheckIndex at the end...\nI think these tests caught a serious JRE bug in this checkindex so i'd like to keep it.\n\nAdditionally we have a problem I think if we randomly get a FSDirectory, especially on windows.\n\nSo how about we build up a RAMdir and cache it? when topK tests start up they could do something like this:\n\n\n   Directory dir = newDirectory(random, getCachedDir());\n   ...\n   dir.close();\n\n\n\nwhere getCachedDir is the access to the cache (if it doesnt exist, it builds it, and its always a ramdir).\n(LuceneTestCase already has newDirectory(random, Directory) that copies from an existing directory) ",
            "author": "Robert Muir",
            "id": "comment-13149583"
        },
        {
            "date": "2011-11-14T12:06:17+0000",
            "content": "Sorry Shai, i got myself confused and thought you were trying to cache across-tests...\nthis patch is good in case a test has multiple methods...! ",
            "author": "Robert Muir",
            "id": "comment-13149594"
        },
        {
            "date": "2011-11-14T12:15:07+0000",
            "content": "Right. Caching across tests is very tricky since they can anyway run in different JVMs (with parallel testing) and so we'll gain nothing. And the tests are not really slow - the sampling tests run <12 seconds on my laptop ... not a big deal.\n\nI'll commit shortly. ",
            "author": "Shai Erera",
            "id": "comment-13149597"
        },
        {
            "date": "2011-11-14T12:17:09+0000",
            "content": "Committed revisions 1201677 (3x) and 1201678 (trunk).\n\nThanks Robert ! ",
            "author": "Shai Erera",
            "id": "comment-13149598"
        },
        {
            "date": "2011-11-14T12:19:48+0000",
            "content": "I see what got you confused (it was me, not you):\n\n\nhowever, if they will run in the same JVM, then they will reuse the already created indexes\n\nwhat I wrote is wrong (I got myself confused !) – whatever you do in beforeClass affects only that testcase, not all the ones that will run in the JVM. Perhaps JUnit need to invent two more concepts @StartJVM and @EndJVM, for this to happen  ",
            "author": "Shai Erera",
            "id": "comment-13149600"
        },
        {
            "date": "2011-11-27T12:29:24+0000",
            "content": "Bulk close after release of 3.5 ",
            "author": "Uwe Schindler",
            "id": "comment-13157748"
        }
    ]
}