{
    "id": "LUCENE-7420",
    "title": "SpanishLightStemmer stemming errors",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "modules/analysis"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Minor",
        "status": "Open",
        "type": "Bug"
    },
    "description": "SpanishLightStemmer only applies stemming if the original word is 5 characters or longer. It tries to removing gender and numbers, removing final vowel and s if they exist.\n\nSo, perro, perra, perros and perras (dog, bitch, dogs and bitches) all become 'perr'.\nThe problem arises with shorter words. Gatos and Gatas (cats / female cats) all become 'gat', but the singular forms (gato, gata) are below the 5 character threshold, so they wouldn't be stemmed.",
    "attachments": {
        "SpanishLightStemmer.java.patch": "https://issues.apache.org/jira/secure/attachment/12824525/SpanishLightStemmer.java.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15427888",
            "author": "J Pardos",
            "date": "2016-08-19T09:28:11+0000",
            "content": "The attached patch stems four character words not ending in 's'. "
        },
        {
            "id": "comment-15427968",
            "author": "Robert Muir",
            "date": "2016-08-19T10:24:35+0000",
            "content": "None of these stemmers are 100%. We simply implement the logic here: http://members.unine.ch/jacques.savoy/clef/\n\nHave you done some more formal analysis/measurement of this change? I am worried about overstemming errors. I'm not sure we should change savoy's algorithms without going thru that kind of effort. "
        },
        {
            "id": "comment-15428029",
            "author": "J Pardos",
            "date": "2016-08-19T11:36:28+0000",
            "content": "I see. I understand these stemmers are not perfect; I just proposed a simple logic change which seems likely to be mostly positive (to me, anyway). \n\nI don't have any formal analysis, sorry. Just my common sense as a native spanish speaker, FWIW.\n\nWhat kind of analysis or measurement would you like to have? Do you have any example I could look at, or could you tell me exactly what information do you need? "
        }
    ]
}