{
    "id": "LUCENE-3647",
    "title": "DocValues merging is not associative, leading to different results depending upon how merges execute",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "recently I cranked up TestDuelingCodecs to actually test docvalues (previously it wasn't testing it at all).\n\nThis test is simple, it indexes the same random content with 2 different indexwriters, it just allows them\nto use different codecs with different indexwriterconfigs.\n\nthen it asserts the indexes are equal.\n\nSometimes, always on BYTES_FIXED_DEREF type, we end out with one reader that has a zero-filled byte[] for a doc,\nbut that same document in the other reader has no docvalues at all.",
    "attachments": {
        "LUCENE-3647_test.patch": "https://issues.apache.org/jira/secure/attachment/12507337/LUCENE-3647_test.patch",
        "LUCENE-3647.patch": "https://issues.apache.org/jira/secure/attachment/12507341/LUCENE-3647.patch",
        "LUCENE-3647_multi.patch": "https://issues.apache.org/jira/secure/attachment/12507339/LUCENE-3647_multi.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-12-14T12:14:57+0000",
            "content": "here's the test, run ant test -Dtestcase=TestDuelingCodecs -Dtestmethod=testEquals -Dtests.seed=-40a075cbf2de8088:-42be31e45e2a3e63:-1340cc72c4576f5a -Dtests.multiplier=3 -Dargs=\"-Dfile.encoding=ISO8859-1\" ",
            "author": "Robert Muir",
            "id": "comment-13169278"
        },
        {
            "date": "2011-12-14T12:36:23+0000",
            "content": "hmm my debugging there is a little bogus (just ignore the previous file, you can use the existing test with taht seed), but i think the synopsis is still correct.\n\nI think as a start, don't we need to be careful when handling these fixed types in all places? Here's a patch for MultiDocValues that should fix some bugs related to this (unfortunately the seed still fails).\n\nMultiDocValues isnt actually used during merging so we need to investigate other parts too and probably do the same? ",
            "author": "Robert Muir",
            "id": "comment-13169288"
        },
        {
            "date": "2011-12-14T12:36:52+0000",
            "content": "my first guess is that this comes due to the different IWCs if you don't specify a value for a field in one IW before the segment is flushed it will not write anything out. but if for instance in your second IW the last doc in a seg has a value DV fills it with default values for the other docs.  is that something which could happen here? Same is true if you merge fields ie. if you have slightly different merge policies?\n ",
            "author": "Simon Willnauer",
            "id": "comment-13169289"
        },
        {
            "date": "2011-12-14T12:39:21+0000",
            "content": "updated patch... fixes the test fail, was a missing break in the switch... I promise I won't write any more patches until i wake up with more coffee or beer. ",
            "author": "Robert Muir",
            "id": "comment-13169291"
        },
        {
            "date": "2011-12-14T12:50:44+0000",
            "content": "all 3 failed hudson seeds pass now. ",
            "author": "Robert Muir",
            "id": "comment-13169306"
        }
    ]
}