{
    "id": "LUCENE-5580",
    "title": "Always verify stored fields' checksum on merge",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.8"
        ]
    },
    "description": "I have seen a couple of index corruptions over the last months, and most of them happened on stored fields. The explanation might just be that since stored fields are usually most of the index size, they are just more likely to be corrupted due to a hardware/operating-system failure, but it might be as well a sneaky bug on our side.\n\nLucene recently added checksums to index files, and you can enable integrity verification upon merge, but this comes with a cost since you need to read all index files twice instead of once. If you are merging a very large segment and your merges are I/O-bound, this might be noticeable.\n\nI would like to implement integrity checks for stored fields on merges on the fly, so that the stored fields files need to be read only once.",
    "attachments": {
        "LUCENE-5580.patch": "https://issues.apache.org/jira/secure/attachment/12639164/LUCENE-5580.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13962730",
            "author": "Adrien Grand",
            "content": "Here is a patch that verifies checksums on stored fields when doing bulk merges. ",
            "date": "2014-04-08T09:20:59+0000"
        },
        {
            "id": "comment-13962741",
            "author": "Michael McCandless",
            "content": "+1 to very the checksum on the fly without reading the file twice, and the patch looks good.\n\nWe could pull that anonymous BufferedChecksumIndexInput subclass out (e.g., ForwardOnlySeekingChecksum... or something) and CompressingTermVectors could do the same thing?  Other non-bulk-copying components could also use it, e.g. I think when merging postings we read nearly the entire file already (no actual seeking)...\n\nWe can do that in a separate issue. ",
            "date": "2014-04-08T09:44:01+0000"
        },
        {
            "id": "comment-13962743",
            "author": "Adrien Grand",
            "content": "I agree this would be nice to do that on more index formats. I think I'll open a new issue since I would like to have at least this one in 4.8, and make sure it goes through enough Jenkins builds before the release. ",
            "date": "2014-04-08T09:57:33+0000"
        },
        {
            "id": "comment-13963942",
            "author": "ASF subversion and git services",
            "content": "Commit 1585910 from jpountz@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1585910 ]\n\nLUCENE-5580: Always verify stored fields checksums on bulk merge. ",
            "date": "2014-04-09T08:52:30+0000"
        },
        {
            "id": "comment-13963956",
            "author": "ASF subversion and git services",
            "content": "Commit 1585913 from jpountz@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1585913 ]\n\nLUCENE-5580: Always verify stored fields checksums on bulk merge. ",
            "date": "2014-04-09T09:11:27+0000"
        },
        {
            "id": "comment-13982611",
            "author": "Uwe Schindler",
            "content": "Close issue after release of 4.8.0 ",
            "date": "2014-04-27T23:25:57+0000"
        }
    ]
}