{
    "id": "LUCENE-1737",
    "title": "Always use bulk-copy when merging stored fields and term vectors",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Lucene has nice optimizations in place during merging of stored fields\n(LUCENE-1043) and term vectors (LUCENE-1120) whereby the bytes are\nbulk copied to the new segmetn.  This is much faster than decoding &\nrewriting one document at a time.\n\nHowever the optimization is rather brittle: it relies on the mapping\nof field name to number to be the same (\"congruent\") for the segment\nbeing merged.\n\nUnfortunately, the field mapping will be congruent only if the app\nadds the same fields in precisely the same order to each document.\n\nI think we should fix IndexWriter to assign the same field number for\na given field that has been assigned in the past.  Ie, when writing a\nnew segment, we pre-seed the field numbers based on past segments.\nAll other aspects of FieldInfo would remain fully dynamic.",
    "attachments": {
        "LUCENE-1737.patch": "https://issues.apache.org/jira/secure/attachment/12464788/LUCENE-1737.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-07-09T18:48:04+0000",
            "content": "Clearing 2.9 fix version. ",
            "author": "Michael McCandless",
            "id": "comment-12729382"
        },
        {
            "date": "2010-11-27T22:12:11+0000",
            "content": "This turned out to be very simply – a tiny patch! ",
            "author": "Michael McCandless",
            "id": "comment-12964459"
        },
        {
            "date": "2010-12-14T18:51:03+0000",
            "content": "I realized we should fix a few more cases here to use bulk-copy more often.  First, on opening a pre-4.0 index, we should sweep all segments to union the FieldInfos so newly written segments are congruent with all past segments as much as possible.  Second, when merging we should start from the current FieldInfos.\n\nEven with this, if you addIndexes(Directory[]), which simply copies in new segments, if the fields name->number assignment on those incoming indices doesn't match the current index, then when those segments are merged they can't be bulk copied. ",
            "author": "Michael McCandless",
            "id": "comment-12971369"
        },
        {
            "date": "2010-12-14T18:52:21+0000",
            "content": "The fixes above can only be done once we always merge doc stores on merging segments, which will be done in LUCENE-2814. ",
            "author": "Michael McCandless",
            "id": "comment-12971370"
        },
        {
            "date": "2010-12-14T18:55:51+0000",
            "content": "Patch.\n\nIt has one nocommit which we can remove once LUCENE-2814 is in. ",
            "author": "Michael McCandless",
            "id": "comment-12971374"
        },
        {
            "date": "2011-03-30T15:50:19+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013436"
        }
    ]
}