{
    "id": "LUCENE-5122",
    "title": "DiskDV probably shouldnt use BlockPackedReader for SortedDV doc-to-ord",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Improvement",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "I dont think \"blocking\" provides any benefit here in general. we can assume the ordinals are essentially random and since SortedDV is single-valued, its probably better to just use the simpler packedints directly? \n\nI guess the only case where it would help is if you sorted your segments by that DV field. But that seems kinda wierd/esoteric to sort your index by a deref'ed string value, e.g. I don't think its even supported by SortingMP.\n\nFor the SortedSet \"ord stream\", this can exceed 2B values so for now I think it should stay as blockpackedreader. but it could use a large blocksize...",
    "attachments": {
        "LUCENE-5122.patch": "https://issues.apache.org/jira/secure/attachment/12594753/LUCENE-5122.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-07-19T13:53:22+0000",
            "content": "For SortingMP, we only provide the ability to sort by a NumericDocValues field out of the box because numbers feel more natural to define a static rank.\n\nMaybe another case where BlockPackedReader could help is if almost all documents have the same value. In that case BlockPackedReader will be able to require 0 bits per value for all blocks that contain a single unique value.\n\nBut I agree PackedInts would likely better in general and remove one level of indirection. ",
            "author": "Adrien Grand",
            "id": "comment-13713670"
        },
        {
            "date": "2013-07-19T14:03:16+0000",
            "content": "I think the current setup is just the way it is because it was easy: originally this codec only worked with two primitives of numeric[] and byte[] and built support for Sorted on top of combinations of these.\n\nIts worth a benchmark to see what the overhead really is in practice, ill look at it.\n\nI also suspect we aren't doing the best thing for SortedSet (addressing into a large packedints stream). You guys dug into this for lucene's faceting before and I think the result of that was that delta-encoded vbyte lists per-document was the fastest... so I've been wanting to try to run some benchmarks here with that in mind too... ",
            "author": "Robert Muir",
            "id": "comment-13713685"
        },
        {
            "date": "2013-07-29T18:30:26+0000",
            "content": "here's a patch. Ill do some benchmarking. ",
            "author": "Robert Muir",
            "id": "comment-13722788"
        },
        {
            "date": "2013-08-10T01:02:32+0000",
            "content": "I couldnt get any improvement out of this patch in benchmarks. \n\nIf someone does, let me know and we can reopen. ",
            "author": "Robert Muir",
            "id": "comment-13735633"
        }
    ]
}