{
    "id": "LUCENE-7463",
    "title": "Create a Lucene70DocValuesFormat",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "priority": "Minor",
        "status": "Resolved",
        "type": "Improvement"
    },
    "description": "Even if it is not optimal, I think it would help to create a Lucene70DocValuesFormat now by copying the current Lucene54DocValuesFormat and including some minor changes like making the sparse case use a true iterator API as described in LUCENE-7457 (which should make it to Lucene54DocValuesFormat a well so that merging from an old codec would be efficient) as well as raising the threshold to enable sparse encoding and using nextSetBit operations when iterating bit sets, which cannot be done easily in Lucene54DocValuesFormat because we'd need to add a couple trailing bytes to make sure we can read a long at any valid index.",
    "attachments": {
        "LUCENE-7463.patch": "https://issues.apache.org/jira/secure/attachment/12831337/LUCENE-7463.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15542649",
            "author": "Adrien Grand",
            "date": "2016-10-03T15:17:58+0000",
            "content": "Here is a patch that adds a Lucene70Codec and a Lucene70DocValuesFormat. The latter is mostly the same as Lucene54DocValuesFormat, the two differences are that it uses nextSetBit operations on the bitset representing live docs in order to have faster iteration (instead of testing each bit sequentially), and that it bumps the threshold for sparse encoding to 10% instead of 1%. The goal is not really to make it the final 7.0 codec but rather to have something that we will be able to compare next iterations with. "
        },
        {
            "id": "comment-15543594",
            "author": "Michael McCandless",
            "date": "2016-10-03T22:13:18+0000",
            "content": "+1 "
        },
        {
            "id": "comment-15544810",
            "author": "Adrien Grand",
            "date": "2016-10-04T08:54:24+0000",
            "content": "Here is the commit https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=32446e9 (it did not link here since I did a mistake in the commit message). "
        }
    ]
}