{
    "id": "LUCENE-2305",
    "title": "Introduce Version in more places long before 4.0",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/other"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "We need to introduce Version in as many places as we can (wherever it makes sense of course), and preferably long before 4.0 (or shall I say 3.9?) is out. That way, we can have a bunch of deprecated API now, that will be gone in 4.0, rather than doing it one class at a time and never finish .\n\nThe purpose is to introduce Version wherever it is mandatory now, and also in places where we think it might be useful in the future (like most of our Analyzers, configured classes and configuration classes).\n\nI marked this issue for 3.1, though I don't expect it to end in 3.1. I still think it will be done one step at a time, perhaps for cluster of classes together. But on the other hand I don't want to mark it for 4.0.0 because that needs to be resolved much sooner. So if I had a 3.9 version defined, I'd mark it for 3.9. We can do several commits in one issue right? So this one can live for a while in JIRA, while we gradually convert more and more classes.\n\nThe first candidate is InstantiatedIndexWriter which probably should take an IndexWriterConfig. While I converted the code to use IWC, I've noticed Instantiated defaults its maxFieldLength to the current default (10,000) which is deprecated. I couldn't change it for back-compat reasons. But we can upgrade it to accept IWC, and set to unlimited if the version is onOrAfter 3.1, otherwise stay w/ the deprecated default.\n\nif it's acceptable to have several commits in one issue, I can start w/ Instantiated, post a patch and then we can continue to more classes.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-03-17T16:23:21+0000",
            "content": "While working on LUCENE-2320, I've noticed these two lines in MP:\n\n\n  /* TODO 3.0: change this default to true */\n  protected boolean calibrateSizeByDeletes = false;\n\n\n\nWhich were left out when we upgraded to 3.0. I guess MP just needs a Version, and then we can change that parameter to true if Version is later than 3.1 (or when this change is out)? ",
            "author": "Shai Erera",
            "id": "comment-12846455"
        },
        {
            "date": "2010-03-17T16:39:18+0000",
            "content": "Sigh, yes, adding Version to MP makes sense. ",
            "author": "Michael McCandless",
            "id": "comment-12846461"
        },
        {
            "date": "2010-03-17T16:44:00+0000",
            "content": "Hmm - if I remember right, this is one I brought up before and you said you no longer felt it really made sense to default to true Mike? ",
            "author": "Mark Miller",
            "id": "comment-12846462"
        },
        {
            "date": "2010-03-17T19:16:41+0000",
            "content": "Hmm... I think true is likely the better default (since it will tend, more, to merge segments that have many deletes)?\n\nI had said leave it as false because we missed this TODO in 3.0.\n\nBut... if we add Version to MP (I think that makes sense) then I think we should flip the default? ",
            "author": "Michael McCandless",
            "id": "comment-12846537"
        },
        {
            "date": "2010-03-17T19:25:43+0000",
            "content": "Ah, yes - I didnt remember your comment right:\n\n\nWe could make the change under Version?  (Change to true, starting in 3.1).\n\nOr maybe not make the change.  If set to true, we use pct deletion on\na segment to reduce its perceived size when selecting merges, which\ngenerally causes segments with pending deletions to be merged away\nsooner\n\nSounds like a good move. ",
            "author": "Mark Miller",
            "id": "comment-12846542"
        },
        {
            "date": "2013-01-12T19:31:20+0000",
            "content": "4.0 is out long ago .\nAnd I don't think we need that issue if we want to add Version to more places. ",
            "author": "Shai Erera",
            "id": "comment-13552014"
        }
    ]
}