{
    "id": "LUCENE-2727",
    "title": "simulate out of open files in MockDirectoryWrapper",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/build"
        ],
        "type": "Test",
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "currently we do disk-full tests (in writeBytes), but it would be good to have test coverage for the case\nwhere the machine runs out of open files.",
    "attachments": {
        "LUCENE-2727.patch": "https://issues.apache.org/jira/secure/attachment/12458250/LUCENE-2727.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-10-28T13:54:36+0000",
            "content": "this is likely not the best way to do it, maybe we should actually track this idea separately (like disk full).\n\nBut as a start i thought it might work to maybeThrowDeterministicException in openInput/createOutput... \nthough I'm not sure how many tests will give us coverage here. ",
            "author": "Robert Muir",
            "id": "comment-12925810"
        },
        {
            "date": "2010-10-28T15:58:46+0000",
            "content": "This looks like a great start!\n\nSo any test that has enabled MockDirW's deterministic exceptions will now have a chance to throw on opening input or creating output.\n\nHmm... should we also call maybeThrowIOException?  Maybe make a new method maybeThrowAnyException  ",
            "author": "Michael McCandless",
            "id": "comment-12925850"
        },
        {
            "date": "2010-10-28T16:35:17+0000",
            "content": "Hmm... should we also call maybeThrowIOException? Maybe make a new method maybeThrowAnyException\n\ngood idea  it seems more tests turn on the random IOExceptions than register failOns, so we get more coverage.\n\nJust gotta fix the tests (properly) to ignore/retry on these fake exceptions in certain places. ",
            "author": "Robert Muir",
            "id": "comment-12925866"
        },
        {
            "date": "2010-10-28T17:14:06+0000",
            "content": "ok here's another start, using the idea of maybeThrowIOException too.\n\nthis makes things somewhat tricky, really tests that enable these ioexceptions aren't very prepared to handle them coming from the reader (note: the MockIndexInput etc never throws these, only output!)\n\ni hacked a few of the tests, and _TestUtil.checkIndex, but there are a still a few more that need to be fixed.\n\nThe problem is, these are some of our best tests and I don't want us to actually lose coverage here... ",
            "author": "Robert Muir",
            "id": "comment-12925874"
        },
        {
            "date": "2013-04-10T22:08:04+0000",
            "content": "I just committed LUCENE-4738, which adds MDW.setRandomIOExceptionRateOnOpen to sometimes randomly throw exceptions from openInput and createOutput ...\n\nBut we still need to fix more tests to enable this ... ",
            "author": "Michael McCandless",
            "id": "comment-13628342"
        },
        {
            "date": "2013-05-10T10:33:55+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654069"
        }
    ]
}