{
    "id": "LUCENE-1948",
    "title": "Deprecating InstantiatedIndexWriter",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/other"
        ],
        "type": "Task",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "2.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "http://markmail.org/message/j6ip266fpzuaibf7\n\nI suppose that should have been suggested before 2.9 rather than  \nafter...\n\nThere are at least three reasons to why I want to do this:\n\nThe code is based on the behaviour or the Directory IndexWriter as of  \n2.3 and I have not been touching it since then. If there will be  \nchanges in the future one will have to keep IIW in sync, something  \nthat's easy to forget.\nThere is no locking which will cause concurrent modification  \nexceptions when accessing the index via searcher/reader while  \ncommitting.\nIt use the old token stream API so it has to be upgraded in case it  \nshould stay.\n\nThe java- and package level docs have since it was committed been  \nsuggesting that one should consider using II as if it was immutable  \ndue to the locklessness. My suggestion is that we make it immutable  \nfor real.\n\nSince II is ment for small corpora there is very little time lost by  \nusing the constructor that builts the index from an IndexReader. I.e.  \nrather than using InstantiatedIndexWriter one would have to use a  \nDirectory and an IndexWriter and then pass an IndexReader to a new  \nInstantiatedIndex.\n\nAny objections?",
    "attachments": {
        "LUCENE-1948.patch": "https://issues.apache.org/jira/secure/attachment/12421303/LUCENE-1948.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-11-10T22:47:51+0000",
            "content": "How about this, deprecate or not? I want to do this as soon as possible before 3.0 comes out. ",
            "author": "Uwe Schindler",
            "id": "comment-12776132"
        },
        {
            "date": "2009-11-14T22:15:34+0000",
            "content": "I move this to 3.1. The writer was already transformed to the new TokenStream API (not really effective, but works). We can deprecate it it 3.1 if needed. ",
            "author": "Uwe Schindler",
            "id": "comment-12778002"
        }
    ]
}