{
    "id": "LUCENE-5784",
    "title": "CommonTermsQuery HighFreq MUST not applied if lowFreq terms",
    "details": {
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem",
        "components": [
            "core/query/scoring"
        ],
        "affect_versions": "4.8.1",
        "status": "Closed",
        "fix_versions": []
    },
    "description": "When a CommonTermsQuery has high and low frequency terms,  the highFreq terms Boolean query is always added as a SHOULD clause, even if highFreqOccur is set to MUST:\n\n    new CommonTermsQuery(Occur.MUST, Occur.MUST,0.1);\n\nMy patch sets the top level Boolean query's minimum should match to 1 to ensure that the SHOULD clause must match.  Not sure if this is the correct approach, or if it should just add the highFreq query as a MUST clause instead?",
    "attachments": {
        "common_terms.patch": "https://issues.apache.org/jira/secure/attachment/12651852/common_terms.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14052843",
            "author": "Simon Willnauer",
            "content": "actually the idea here was that the operator for high freq is only to control when / if the score for that query should be taken into account. I personally think we should never make the high freq required otherwise we loose all the performance gains here possibly? Maybe it's actually not that bad though since we have the low freq terms driving the matching... I guess we could say that we let the minimumShouldMatch on the highfreq query control when and if the query is used for scoring and make the terms there always SHOULD clauses and use the highFreq occur as the occur used on the toplevel query? ",
            "date": "2014-07-05T11:41:10+0000"
        },
        {
            "id": "comment-14053735",
            "author": "Clinton Gormley",
            "content": "Having talked to Simon offline, it appears I misunderstood the intent of the high freq occur/minShouldMatch. These are not intended to control matching (bool query already does a good job here) but only to control when the high freq terms should be used for scoring, ie as a tie breaker.\n\nSo if the high freq occur is must, then a document is matched based on the low freq terms, but it's score is affected only if all the high freq terms are present. ",
            "date": "2014-07-07T15:09:52+0000"
        }
    ]
}