{
    "id": "LUCENE-4813",
    "title": "Allow DirectSpellchecker to use totalTermFrequency rather than docFrequency",
    "details": {
        "components": [
            "modules/spellchecker"
        ],
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "4.1",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "we have a bunch of new statistics in on our term dictionaries that we should make use of where it makes sense. For DirectSpellChecker totalTermFreq and sumTotalTermFreq might be better suited for spell correction on top of a fulltext index than docFreq and maxDoc",
    "attachments": {
        "LUCENE-4813.patch": "https://issues.apache.org/jira/secure/attachment/12572349/LUCENE-4813.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-03-06T17:19:48+0000",
            "content": "here is an initial patch that adds this as the default yet optional statistics. ",
            "author": "Simon Willnauer",
            "id": "comment-13594876"
        },
        {
            "date": "2013-03-07T15:19:24+0000",
            "content": "next iteration making the new statistic optional and experts can just pass them in if they want. This patch is bw compatible runtime wise while it breaks some apis since I change floats to double but I think that is a fair game here. I think its close / ready ",
            "author": "Simon Willnauer",
            "id": "comment-13595958"
        },
        {
            "date": "2013-03-08T13:09:16+0000",
            "content": "Can we do without the FieldStatistics/DocFreqStatistics/etc and just change 'freq' to long? ",
            "author": "Robert Muir",
            "id": "comment-13597101"
        },
        {
            "date": "2013-03-08T13:40:26+0000",
            "content": "Can we do without the FieldStatistics/DocFreqStatistics/etc and just change 'freq' to long?\nI really appreciate the fact that this is an object that I can pass in for several reasons. First you can just plug in your own stats if you want to and it pulls a terms object only once that I can provide. In my usecase I call the same instance of DirectSpellChecker in the same request multiple times to generate candidates and that way I can just keep my Terms / TermsEnum instance reused which is a small but yet important cost IMO which can in my expert case help. For the users this that have used this class before nothing really changes unless you want to go to totalTermFreq as their stats but we can make this simple. We can also make these classes package private I am totally ok with this to hide this small complexity here from the average user but enable the expert user. API stays the same and if sumTotalTermFreq is available you also get it in the SuggestWord. I would not want to fork this entire code just for the sake of being able to reuse these statistics etc. if hiding this from the user is the problem then lets move to pkg private. if its just you \"feeling\" this is a too big of a change for the sake then I am not moving sorry. ",
            "author": "Simon Willnauer",
            "id": "comment-13597123"
        },
        {
            "date": "2013-07-23T18:44:30+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716967"
        },
        {
            "date": "2014-04-16T12:54:34+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970804"
        }
    ]
}