{
    "id": "LUCENE-8148",
    "title": "Get precommit Lint warnings out of test code",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Improvement",
        "components": [],
        "fix_versions": []
    },
    "description": "Mostly putting this up for discussion. I'm starting to work on Solr test lint warnings, it seems right to break the Lucene changes and Solr changes into separate JIRAs.\n\nFirst of all, do people have objections to me mucking around in the Lucene test code to do this? The eventual goal here is to get to the point where we can turn on precommit failures on lint warnings. Deprecations maybe as well, but that's a separate issue, as is non-test code.\n\nI expect to see a lot of pretty safe issues, then a series I'm not sure of, I'll ask when I find them if I wind up carrying this forward.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16348066",
            "date": "2018-02-01T06:14:07+0000",
            "content": "Wouldn't it be more prudent to first fix the non-test code?\n\nWe still don't even fail on compiler warnings, which is the most very basic, step zero, of static analysis (I feel inclined to bring this up on every one of these lets do fancy XYZ static analysis issues, because its so sad). ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16349049",
            "date": "2018-02-01T18:26:22+0000",
            "content": "I have no strong preference whether it's the test or non-test code first. Figured working on test code first would let me get my feet wet without risking too much, but it's all the same in the end.\n\nI got all the precommit lint warnings out of Solr's test code last night except a couple so at least that part may not be as daunting as I fear. Just a lot of secretarial work for the most part.\n\nYeah, compiler warnings. Deprecations are next on my list since there are so many of them. From there on to other warnings.... I'm trying to break things into smaller chunks to keep from getting too intimidated by how many of them there are.\n ",
            "author": "Erick Erickson"
        }
    ]
}