{
    "id": "LUCENE-5636",
    "title": "SegmentCommitInfo continues to list unneeded gen'd files",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [
            "core/index"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ]
    },
    "description": "I thought I handled it in LUCENE-5246, but turns out I didn't handle it fully. I'll upload a patch which improves the test to expose the bug. I know where it is, but I'm not sure how to fix it without breaking index back-compat. Can we do that on experimental features?\n\nThe problem is that if you update different fields in different gens, the FieldInfos files of older gens remain referenced (still!!). I open a new issue since LUCENE-5246 is already resolved and released, so don't want to mess up our JIRA...\n\nThe severity of the bug is that unneeded files are still referenced in the index. Everything still works correctly, it's just that .fnm files are still there. But as I wrote, I'm still not sure how to solve it without requiring apps that use dv updates to reindex.",
    "attachments": {
        "LUCENE-5636.patch": "https://issues.apache.org/jira/secure/attachment/12642875/LUCENE-5636.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13986849",
            "author": "Shai Erera",
            "content": "Patch improves the test to expose the bug. ",
            "date": "2014-05-01T18:36:31+0000"
        },
        {
            "id": "comment-13986859",
            "author": "Shai Erera",
            "content": "Hmm, actually I think I can fix it w/o breaking index back-compat, by manually removing the old .fnm files in SegCommitInfo (I'll also improve how this is done in general). Assuming very little apps, if at all, write their own FieldInfosFormat, I think that's acceptable? I'll work on a patch later. ",
            "date": "2014-05-01T18:43:00+0000"
        },
        {
            "id": "comment-13988005",
            "author": "Shai Erera",
            "content": "I chatted with Robert about this. The current situation is that the old .fnm files continue to be referenced even when not needed, however when the segment is merged, they go away (as all gen'd files). Given that there's no way to solve it without breaking back-compat, unless we introduce hacks such as checking for a \".fnm\" suffix, we discussed  how to solve this \"going forward\".\n\nBy \"going forward\" I mean to not change existing segments, but if they contain future updates, write the new information in a better way. Perhaps old .fnm files will still be referenced by those segments, until they're merged away, but new segments will fix that bug.\n\nI think that this might be doable together with LUCENE-5618, by writing per-field gen'd DV file, so I'll try to solve it there and if it works I'll resolve that issue as appropriate. ",
            "date": "2014-05-02T17:52:39+0000"
        },
        {
            "id": "comment-14004644",
            "author": "ASF subversion and git services",
            "content": "Commit 1596570 from Shai Erera in branch 'dev/trunk'\n[ https://svn.apache.org/r1596570 ]\n\nLUCENE-5618, LUCENE-5636: write each DocValues update in a separate file; stop referencing old fieldInfos files ",
            "date": "2014-05-21T13:18:20+0000"
        },
        {
            "id": "comment-14004715",
            "author": "ASF subversion and git services",
            "content": "Commit 1596582 from Shai Erera in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1596582 ]\n\nLUCENE-5618, LUCENE-5636: write each DocValues update in a separate file; stop referencing old fieldInfos files ",
            "date": "2014-05-21T14:36:42+0000"
        },
        {
            "id": "comment-14004720",
            "author": "Shai Erera",
            "content": "Fixed in LUCENE-5618 ",
            "date": "2014-05-21T14:40:08+0000"
        }
    ]
}