{
    "id": "LUCENE-2139",
    "title": "Cleanup and Improvement of Spatial Contrib",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The current spatial contrib can be improved by adding documentation, tests, removing unused classes and code, repackaging the classes and improving the performance of the distance filtering.  The latter will incorporate the multi-threaded functionality introduced in LUCENE-1732.  \n\nOther improvements involve adding better support for different distance units, different distance calculators and different data formats (whether it be lat/long fields, geohashes, or something else in the future).\n\nPatch to be added soon.",
    "attachments": {
        "LUCENE-2139-svnScript.sh": "https://issues.apache.org/jira/secure/attachment/12427704/LUCENE-2139-svnScript.sh",
        "LUCENE-2139.patch": "https://issues.apache.org/jira/secure/attachment/12427487/LUCENE-2139.patch",
        "LUCENE-2139-Java5Only.patch": "https://issues.apache.org/jira/secure/attachment/12427594/LUCENE-2139-Java5Only.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-12-09T11:08:12+0000",
            "content": "cant wait to see you patch - its gonna be huge I guess  \n\nI will be here to help you splitting it apart and get you good work into contrib/spatial ",
            "author": "Simon Willnauer",
            "id": "comment-12788034"
        },
        {
            "date": "2009-12-09T11:13:34+0000",
            "content": "linked related issues ",
            "author": "Simon Willnauer",
            "id": "comment-12788038"
        },
        {
            "date": "2009-12-09T15:32:08+0000",
            "content": "Added patch.\n\nCouple of TODOs still noted in the patch related to distances.  We need to decide what distances we are going to use for the radius and circumference of the Earth and then use them in SpatialConstants.  Currently the SpatialConstants values are taken from Wikipedia and other sites, yet differ from some of the distances in the coded.\n\nAlso the patch doesn't seem to remove a couple of empty packages.  Too many changes in 1 patch confusing the IDE I think.  Help cleaning this up would be appreciated. ",
            "author": "Chris Male",
            "id": "comment-12788122"
        },
        {
            "date": "2009-12-09T15:47:50+0000",
            "content": "I have also included LUCENE-1934 in this, and tried to include LUCENE-1930 but was unable to get 1930 to work. ",
            "author": "Chris Male",
            "id": "comment-12788130"
        },
        {
            "date": "2009-12-09T17:16:57+0000",
            "content": "Chris, I have a couple of issues with your patch. It seems that you renamed a couple of files which doesn't work well with patches for some reason. I will comment on this later again.\nThe other thing is that you use 1.6 classes like [http://java.sun.com/javase/6/docs/api/java/util/concurrent/LinkedBlockingDeque.html|LinkedBlockingDeque] but we should try to keep the contrib 1.5 dependent.\ncould you fix those 1.6 references please.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12788169"
        },
        {
            "date": "2009-12-10T09:42:26+0000",
            "content": "Attached updated version of the patch which is now compiled and tested with Java 5.  Difference is replacing the LinkedBlockingDeque with a LinkedBlockingQueue, and fixing some weirdness with a single threaded ThreadPoolExecutor.\n\nWill tackle the structural problems now. ",
            "author": "Chris Male",
            "id": "comment-12788627"
        },
        {
            "date": "2009-12-10T09:51:50+0000",
            "content": "Thank you Chris!\nLets go with small issues from here. I suggest we start with a svn move / copy issue that bring names and classes in the right place. With the size and the number of changes in patch this make the most sense to me. The good thing with spatial is that we can change class names and locations / packages as all the API is marked experimental. Once we have this in place people can easily apply the patch and join the issues. \nIf this is done I suggest to start from top to bottom package wise which will guarantee that we have a solid package strucuture and will make patches and dependency handling way easier. \nI want to drive towards a solid contrib module (you code is a huge step towards) so making small steps will eventually bring us that way. IMO it will also speed things up as it is easier to review and to commit.\n\nOnce we fix the smaller issues we can add entries to CHANGES.TXT for each one and combine them towards the end into just a couple. That way we do not miss anything which is important for users even if the API is still in flux.\nWe did similar things for moving from Java 1.4 to Java 1.5 and with all the Unicode features.\n\nThoughts? ",
            "author": "Simon Willnauer",
            "id": "comment-12788630"
        },
        {
            "date": "2009-12-10T09:59:07+0000",
            "content": "Hi Simon,\n\nAlright that sounds great.  I will work on creating a list of SVN move / copies commands followed by a patch to get the existing contrib into the structure that I want.  I will then break this big patch down into a handful of smaller patches. ",
            "author": "Chris Male",
            "id": "comment-12788634"
        },
        {
            "date": "2009-12-10T10:10:13+0000",
            "content": "This looks like a great step forward for spatial; thanks Chris! ",
            "author": "Michael McCandless",
            "id": "comment-12788641"
        },
        {
            "date": "2009-12-11T10:40:14+0000",
            "content": "Attaching simple bash script which executes a series of SVN commands to clean out the existing module and rename most of the files to what they will be in the next patch.  The only file that still needs to be renamed later in TestCartesian.java that will be renamed to TestSpatialFilter.java once SpatialFilter exists.\n\nScript assumes you are existing it from the root directory of lucene checkout. ",
            "author": "Chris Male",
            "id": "comment-12789225"
        },
        {
            "date": "2009-12-11T11:48:24+0000",
            "content": "I will now create a version of the patch that does not move, rename or delete any classes as that dilutes the patches.  I will break the patch down into some logical pieces with separate sub issues and link them here. ",
            "author": "Chris Male",
            "id": "comment-12789255"
        },
        {
            "date": "2009-12-11T12:17:05+0000",
            "content": "Linked util issue ",
            "author": "Chris Male",
            "id": "comment-12789272"
        },
        {
            "date": "2009-12-11T13:08:39+0000",
            "content": "Linked Point2D and Rectangle issue ",
            "author": "Chris Male",
            "id": "comment-12789293"
        },
        {
            "date": "2009-12-11T13:40:47+0000",
            "content": "Linked LatLng issue. ",
            "author": "Chris Male",
            "id": "comment-12789309"
        },
        {
            "date": "2009-12-11T14:17:37+0000",
            "content": "Linked distance calculator issue. ",
            "author": "Chris Male",
            "id": "comment-12789322"
        },
        {
            "date": "2009-12-11T15:11:58+0000",
            "content": "Linked in distance filtering and data format issue. ",
            "author": "Chris Male",
            "id": "comment-12789340"
        },
        {
            "date": "2009-12-20T19:53:22+0000",
            "content": "Linked cartesian tier code issue. ",
            "author": "Chris Male",
            "id": "comment-12793029"
        },
        {
            "date": "2009-12-20T20:40:19+0000",
            "content": "Linking SpatialFilter and SortSource issue. ",
            "author": "Chris Male",
            "id": "comment-12793040"
        },
        {
            "date": "2009-12-20T20:44:02+0000",
            "content": "Linking deprecations issue. ",
            "author": "Chris Male",
            "id": "comment-12793042"
        },
        {
            "date": "2010-11-30T08:41:49+0000",
            "content": "Are we still working on this issue? It seems to be somewhat outdated though and I am not sure about the geospatial status in solr - any ideas? If we do not work on this I would like to close as won't fix. ",
            "author": "Simon Willnauer",
            "id": "comment-12965153"
        },
        {
            "date": "2010-11-30T08:54:34+0000",
            "content": "Simon,\n\nI am willing to work on this and i did.\n\nI did post some patches in April that were commited by Grant and then reverted waiting for a global status.\n\nSome isssues are still marked as resolved but the code is not commited anymore (LUCENE-2366).\n\nFact : I did apply the patchs I had proposed to one of my client spatial lucene installtion and it is still in production with success.\n\nI do want help on that spatial subject\n\nJust tell me want you want to be addressed and I ll work on it.\n\nShould I update the patches I did propose ?\nIt is the good way to do ? Grant seemed not to be happy with them back in April. ",
            "author": "Nicolas Helleringer",
            "id": "comment-12965155"
        },
        {
            "date": "2010-11-30T09:08:35+0000",
            "content": "I think the overall direction of Spatial Lucene has changed considerably since this work was done.  There have been considerable issues found with the Cartesian Tier code which this patch doesnt address.  Equally, issues of stateful Filters has brought to attention that the SpatialFilter breaks alot of Filter principals.\n\nI say we close these issues and begin moving what code we feel is salvagable to a spatial module where we can work closely with the Solr code. ",
            "author": "Chris Male",
            "id": "comment-12965161"
        },
        {
            "date": "2010-11-30T17:17:54+0000",
            "content": "I say we close these issues and begin moving what code we feel is salvagable to a spatial module where we can work closely with the Solr code.\nI was actually hoping somebody says that before I write to the list and get my head cut off  I think that is the best idea. we should nuke the spatial contrib entirely and start from zero in the modules area. IMO we should move all existing stuff from solr into there and let glue code reside under solr.\n\nI hope I have time to write that up and propose it on the list.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12965295"
        },
        {
            "date": "2010-11-30T17:27:06+0000",
            "content": "What I do not see today in Solr spatial awareness is spatial indexation with tiers\n\nAs far as I understand the spatial search is done by two range queries ANDed\n\nSuch a search could lead to less performance on big set of data\n\nI am no sure if a two phase filtering is possible on the Solr lvl with phase 1 been a Tier search a phase 2 a distance refining. ",
            "author": "Nicolas Helleringer",
            "id": "comment-12965298"
        },
        {
            "date": "2010-11-30T22:18:38+0000",
            "content": "Nicolas,\n\nIts true that Solr does not support spatial tier search but this was due to the code in spatial lucene being so buggy.  I think everybody is happy to revisit the issue and add spatial tier support to Solr if we can come up with a clear, test and bug-free underlying implementation.\n\nI think whatever work we do we should do in a spatial module.\n\nSimon,\nPerhaps we should @deprecate the contrib in 3x, nuke in 4x and start up the module?  ",
            "author": "Chris Male",
            "id": "comment-12965458"
        },
        {
            "date": "2010-11-30T22:23:38+0000",
            "content": "+1 on deprecation (I thought we already decided that!)\n\nAs for tier search, there is an open issue to the use the more or less standard (or, at least, shall we say the well documented) military grid system. ",
            "author": "Grant Ingersoll",
            "id": "comment-12965459"
        },
        {
            "date": "2010-11-30T22:26:12+0000",
            "content": "+1 on deprecation (I thought we already decided that!)\n\nHa yes quite.  Good to be clear about it again\n\nAs for tier search, there is an open issue to the use the more or less standard (or, at least, shall we say the well documented) military grid system.\n\nLUCENE-2646 ",
            "author": "Chris Male",
            "id": "comment-12965460"
        },
        {
            "date": "2010-12-01T01:47:01+0000",
            "content": "So we're good with closing? I'll close all associated issues too and open a new one for the deprecation/nuking/re-birth work. ",
            "author": "Chris Male",
            "id": "comment-12965531"
        },
        {
            "date": "2010-12-01T02:05:41+0000",
            "content": "As far as I understand the spatial search is done by two range queries ANDed\n\nYep - but they are normally tri-range (i.e. Lucene Numeric) ranges, so pretty efficient anyway.\nFrom what I saw of the existing tier code, I can't say that it would have been more efficient... and I can say that at least for some spatial queries, it would have been less efficient (since it always seemed to use one tier level for a query, not multiple). ",
            "author": "Yonik Seeley",
            "id": "comment-12965540"
        },
        {
            "date": "2010-12-01T02:08:44+0000",
            "content": "I'd say that thats what we want to determine some way as part of a redo of the spatial code.  Maybe we need to include some benchmarking functionality. ",
            "author": "Chris Male",
            "id": "comment-12965541"
        },
        {
            "date": "2010-12-01T08:58:43+0000",
            "content": "Yep - but they are normally tri-range (i.e. Lucene Numeric) ranges, so pretty efficient anyway.\nFrom what I saw of the existing tier code, I can't say that it would have been more efficient... and I can say that at least for some spatial queries, it would have been less efficient (since it always seemed to use one tier level for a query, not multiple).\nFrom personnal experience I do not aggre as I deployed lucene tier spatial to solve performance issue with a double range query on two fields\nBut that is not factual : i do aggree with Chris that the better is to work on benchmarking to 'prove' this and movve forward.\n\n@deprecate the contrib in 3x, nuke in 4x\nPity to remove code before replacing one is still not here : what will the users do ?\n\nThe more important thus is to move forward : I will be pleased to help on trying to port tier support if anybody is interessed in it to the new section where spatial lives ",
            "author": "Nicolas Helleringer",
            "id": "comment-12965621"
        },
        {
            "date": "2010-12-01T09:36:10+0000",
            "content": "Pity to remove code before replacing one is still not here : what will the users do ?\nWhile I can understand you reasons why this is a pity i have to say that the code you are referring to is a big mess currently. In 4.0 we have the possibility to get rid of that stuff an let folks develop something cleaner, maybe better, tested, documented and already integrated (Solr).  AFAIK there is already a whole bunch of stuff in solr related to geo search and we can move that stuff out into a module to make it available to Lucene users too. \n\nso here is my +1 for closing the issues, deprecate everything in 3.0  nuke spatial in 4.0. Chris, do you want to go ahead and create the issues?\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12965631"
        },
        {
            "date": "2010-12-01T09:46:17+0000",
            "content": "I have to echo Simon's comments here.  Furthermore, we are deprecating in 3x so we do give users time to upgrade.\n\nI'll close this out now. ",
            "author": "Chris Male",
            "id": "comment-12965635"
        },
        {
            "date": "2010-12-01T09:48:58+0000",
            "content": "Closing as we will look into improvements in the future spatial module. ",
            "author": "Chris Male",
            "id": "comment-12965636"
        },
        {
            "date": "2010-12-01T10:04:44+0000",
            "content": "See LUCENE-2599 (which I'd opened up awhile back apparently) for work on deprecating / removing the code. ",
            "author": "Chris Male",
            "id": "comment-12965646"
        }
    ]
}