{
    "id": "LUCENE-2952",
    "title": "Make license checking/maintenance easier/automated",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.2",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Instead of waiting until release to check licenses are valid, we should make it a part of our build process to ensure that all dependencies have proper licenses, etc.",
    "attachments": {
        "LUCENE-2952.patch": "https://issues.apache.org/jira/secure/attachment/12473264/LUCENE-2952.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-03-07T14:23:12+0000",
            "content": "+1 to hook this into our 'ant test'. This is more important than if the junit tests pass. ",
            "author": "Robert Muir",
            "id": "comment-13003363"
        },
        {
            "date": "2011-03-10T13:57:15+0000",
            "content": "No where near being ready, but putting up something to flesh this out a little bit.  I don't think it even compiles yet. \n\nIdea:  Add dev-tools/validation and hook in code into it that does work to validate our systems for things like licenses, etc.  It will then be hooked in at compile time for both Lucene and Solr.\n\nIn this particular case, it will look for license files for each jar file and fail if one is missing.  This requires there to be, for every JAR file, a file with the same name and the name of the license.txt appended to it, as in foo.jar.BSD.txt or something like that (still being worked out) ",
            "author": "Grant Ingersoll",
            "id": "comment-13005063"
        },
        {
            "date": "2011-03-11T14:47:59+0000",
            "content": "Here's some real progress on this.  Works in standalone mode, but is not hooked into the build process yet. ",
            "author": "Grant Ingersoll",
            "id": "comment-13005656"
        },
        {
            "date": "2011-03-11T14:57:35+0000",
            "content": "Should note, I've only hooked it up for lucene/lib and solr/lib and not any of the modules or contrib. ",
            "author": "Grant Ingersoll",
            "id": "comment-13005666"
        },
        {
            "date": "2011-03-15T14:05:09+0000",
            "content": "Pretty close to standalone completion.  Next step to hook it in.  I'm going to commit the license naming normalization now but not the validation code yet.\n\nAlso, renamed LicenseChecker to DependencyChecker as it might be useful for checking other things like that all jars have version numbers. ",
            "author": "Grant Ingersoll",
            "id": "comment-13006929"
        },
        {
            "date": "2011-03-15T14:38:24+0000",
            "content": "This hooks it into compile-core, but has the unfortunate side-effect of being called a whole bunch of times, which is not good.  Need to read up on how to avoid that in ant (or if anyone has suggestions, that would be great).\n\nOtherwise, I think the baseline functionality is ready to go. ",
            "author": "Grant Ingersoll",
            "id": "comment-13006944"
        },
        {
            "date": "2011-03-15T21:33:31+0000",
            "content": "This minimizes the number of calls to validate (there is still one extra call via the benchmark module since it invokes the common lucene compile target).  Also splits it out into Lucene, Solr and Modules.\n\nI'd consider it close to good enough at this point. ",
            "author": "Grant Ingersoll",
            "id": "comment-13007207"
        },
        {
            "date": "2011-03-17T15:02:13+0000",
            "content": "latest patch ",
            "author": "Grant Ingersoll",
            "id": "comment-13007942"
        },
        {
            "date": "2011-03-17T15:18:51+0000",
            "content": "I think this is ready to go.  It checks licenses, it checks notices.  It leaves room for other validation tasks (version conflicts, etc.)  It is fast.  It is only called for each top dir: lucene, modules, solr (there is one extra call when modules/benchmark gets called, but I can live with it).\n\nI believe all LICENSE, NOTICE files are properly set now. ",
            "author": "Grant Ingersoll",
            "id": "comment-13007950"
        },
        {
            "date": "2011-03-18T11:45:05+0000",
            "content": "the current situation (with the macros in the root in a common-build.xml, and the code in dev-tools breaks the lucene build when lucene is by itself: lucene-only releases for example, or someone just svn checking out lucene)\n\nI don't think we should be using dev-tools for anything thats integral to the build: the whole point of dev-tools is to be optional, maintained on as-is basis type stuff for developers only.\n\nSo i think the code should go in test-framework or something like that instead? and the ant logic should go in lucene's common-build, which anything can use. ",
            "author": "Robert Muir",
            "id": "comment-13008405"
        },
        {
            "date": "2011-03-18T15:29:05+0000",
            "content": "I'm fine w/ moving it out of dev-tools.  I'm not sure about test-framework, which I see more as something people building applications on Lucene/Solr use to test their applications on.\n\nHow about we put it in modules?  As in modules/validation?  It is, after all, pertinent to both L & S. ",
            "author": "Grant Ingersoll",
            "id": "comment-13008473"
        },
        {
            "date": "2011-03-18T16:52:43+0000",
            "content": "Actually, the more I think about it, it doesn't belong in modules either.\n\nI'm inclined to say a new top level dir called committer-tools (slightly different from dev-tools which are redistributed.  committer-tools are not) ",
            "author": "Grant Ingersoll",
            "id": "comment-13008513"
        },
        {
            "date": "2011-03-18T17:38:38+0000",
            "content": "I'm just going to move to the test-framework.  As Robert points out, if in the future we get more sophisticated about checking the classpath/libs, it will fit well there. ",
            "author": "Grant Ingersoll",
            "id": "comment-13008537"
        },
        {
            "date": "2011-03-18T19:03:29+0000",
            "content": "OK, I shuffled some things around, putting the code in test-framework and made the appropriate changes to the builds.  Will now backport to 3_x (but not 3.1) ",
            "author": "Grant Ingersoll",
            "id": "comment-13008580"
        },
        {
            "date": "2011-03-21T12:32:16+0000",
            "content": "The nightly builds now fail because clover breaks because the checker classes are in test-framework, and clover is not available there. The checker classes should be build through compile-tools task (without clover) and then used.\n\nIn my opinion, this license-checker main() should be in /lucene/dev/src/tools not /lucene/dev/src/test-framework. We already have this folder to e.g. rebuild the files of StandardTokenizer and so on.\n\nAlso executing this in clover would create code coverage which is not really runtime-created.\n\nA quick fix would be to disable the license checker if run.clover=1, but I don't like it how it is now. ",
            "author": "Uwe Schindler",
            "id": "comment-13009113"
        },
        {
            "date": "2011-03-21T15:26:12+0000",
            "content": "Third time is the charm.  I don't really care where it lives and it sounds like tools makes sense.  Not sure why I didn't notice that sooner.  I'll take care of it later today. ",
            "author": "Grant Ingersoll",
            "id": "comment-13009169"
        },
        {
            "date": "2011-03-21T15:32:17+0000",
            "content": "Unfortunately as analyzers moved to modules in trunk, so the tools folder is no longer in trunk's lucene/src. But we should use the same concept, its used at different places, e.g. in ICU contrib, StandarAnalyzer and other autogenerated code. I can help setting it up again. ",
            "author": "Uwe Schindler",
            "id": "comment-13009173"
        },
        {
            "date": "2011-03-24T19:06:50+0000",
            "content": "Eclipse complains for top common-build.xml (trunk, 3x) that default target \"validate\" does not exist in the project:\n\n<project name=\"all-common\" default=\"validate\" basedir=\".\"\n\nTarget \"validate\" was removed in r1083010.\nShould default=\"validate\" be removed as well? ",
            "author": "Doron Cohen",
            "id": "comment-13010850"
        },
        {
            "date": "2011-03-24T19:29:47+0000",
            "content": "I'll fix it, Doron. ",
            "author": "Grant Ingersoll",
            "id": "comment-13010866"
        },
        {
            "date": "2011-06-03T16:37:12+0000",
            "content": "Bulk closing for 3.2 ",
            "author": "Robert Muir",
            "id": "comment-13043472"
        }
    ]
}