{
    "id": "LUCENE-5185",
    "title": "licenses/*.jar.sha1 don't belong in Lucene and Solr binary distributions",
    "details": {
        "components": [
            "general/build"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "On LUCENE-3945, where external dependency checksum verification was put in place, Chris Hostetter (Unused) wrote:\n\nSo i propose that we include checksum files in svn and in our source releases that can be used by users to verify that the jars they get from ivy match the jars we tested against.\n\nThat is, checksum files in binary distributions was not part of the proposal.\n\nAnd in his comment associated with the final patch:\n\n2) fixes the binary releases to exlcude the sha1 files\n\nSomewhere between then and now, *.jar.sha1 files snuck back into the Lucene and Solr binary releases, under the licenses/ directory.  They should not be there.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-08-21T21:57:38+0000",
            "content": "\nSomewhere between then and now, *.jar.sha1 files snuck back into the Lucene and Solr binary releases, under the licenses/ directory. \n\nThere was no sneakiness about it, it was totally intentional: LUCENE-4267\n\n\nThey should not be there.\n\nThats your personal opinion: I disagree (please see the issue for discussion). ",
            "author": "Robert Muir",
            "id": "comment-13746892"
        },
        {
            "date": "2013-08-21T22:25:18+0000",
            "content": "it was totally intentional: LUCENE-4267\n\nThanks for the pointer, I guess I didn't realize at the time that checksums were included.\n\n\nThey should not be there.\n\nThats your personal opinion: I disagree (please see the issue for discussion).\n\nAFAICT, the only discussion that happened there that's applicable to the checksums was your rationale in the issue description:\n\nadditional verification for consumers.\n\nIs there some other discussion I'm missing?\n\nI don't disagree that consumers could theoretically use the checksums to verify 3rd party .jar integrity, but:\n\n\n\tWe don't provide checksums for our own .jars, or for anything else in the binary distributions - why are 3rd party jars special in this regard?\n\tJenkins regularly validates the checksums against the files Ivy downloads, and the smoke checker runs 'ant validate' against the source distribution, which indirectly validates the integrity of the 3rd party jars included in the binary distribution.\n\n\n\nMaybe the smoke tester could be modified to directly test the checksums against the binary artifacts' 3rd party jars?\n\nMy thinking here is that we should keep our distributions lean, including only the things that must be there, and I don't think these checksum files qualify. ",
            "author": "Steve Rowe",
            "id": "comment-13746924"
        },
        {
            "date": "2013-08-21T23:21:48+0000",
            "content": "\nMaybe the smoke tester could be modified to directly test the checksums against the binary artifacts' 3rd party jars?\n\n+1\n\n\nMy thinking here is that we should keep our distributions lean, including only the things that must be there, and I don't think these checksum files qualify.\n\nUnder this line of thinking: then we shouldnt do a binary release at all. But if we are going to do one, one thats filled with over 100 third party dependencies, then I think some \"paperwork\" to go along with those is totally appropriate.  ",
            "author": "Robert Muir",
            "id": "comment-13747006"
        },
        {
            "date": "2013-08-23T04:47:38+0000",
            "content": "I don't think it's useful to have checksums for only some of the files within an archive that is itself checksummed.  But you seem to think it's useful, Robert, so I won't pursue removing them. ",
            "author": "Steve Rowe",
            "id": "comment-13748282"
        }
    ]
}