{
    "id": "LUCENE-4569",
    "title": "Allow customization of column stride field and norms via indexing chain",
    "details": {
        "components": [
            "core/index"
        ],
        "fix_versions": [],
        "affect_versions": "4.0",
        "priority": "Major",
        "labels": "",
        "type": "Improvement",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "We are building an in-memory indexing format and managing our own segments. We are doing this by implementing a custom IndexingChain. We would like to support column-stride-fields and norms without having to wire in a codec (since we are managing our postings differently)\n\nSuggested change is consistent with the api support for passing in a custom InvertedDocConsumer.",
    "attachments": {
        "patch.diff": "https://issues.apache.org/jira/secure/attachment/12554633/patch.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-22T05:04:59+0000",
            "content": "patch for NormsConsumer and DocFieldProcessor ",
            "author": "John Wang",
            "id": "comment-13502589"
        },
        {
            "date": "2012-11-28T08:24:38+0000",
            "content": "John,\n\nI don't really know much about the API you're wanting to change, but to help me understand are you able to explain more what you're trying to do in your custom indexing format / code? \n\nI think one of the major motivation for Codecs is to allow this sort of customization through their API (there is already Codecs for holding this in memory). ",
            "author": "Chris Male",
            "id": "comment-13505294"
        },
        {
            "date": "2012-11-28T17:08:30+0000",
            "content": "sorry john, busy times over here... I will look into that later this week though. seems pretty straight forward to me at a first glance ie. doesn't hurt anyone  ",
            "author": "Simon Willnauer",
            "id": "comment-13505658"
        },
        {
            "date": "2012-11-28T18:02:20+0000",
            "content": "Thanks Simon! No rush, was just wanted some feedback. \n\nDo you think we should do the same for stored fields?\n\nChris: we are building a custom IndexingChain which is at a higher level than Codecs. You are definitely right, and currently I am able to get what I needed via a codec. e.g. our custom indexing chain to handle indexed documents, and then register a codec to intercept the code path for norms and CSF, but this ends up with 2 customization hooks for the same indexer.\n\nThanks!\n\n-John ",
            "author": "John Wang",
            "id": "comment-13505718"
        },
        {
            "date": "2013-05-31T05:04:26+0000",
            "content": "Hey Simon:\n\n    Was wondering if you had a chance to look at this.\n\nThanks\n\n-John ",
            "author": "John Wang",
            "id": "comment-13671164"
        },
        {
            "date": "2013-05-31T14:11:48+0000",
            "content": "John, I looked at the current code and it seems that everything delegates do segmentsInfo.codec and I wonder if you can't just use a FilteredCodec for this and extend it in DWPT? ",
            "author": "Simon Willnauer",
            "id": "comment-13671501"
        },
        {
            "date": "2013-06-03T20:51:07+0000",
            "content": "Hi Simon:\n\n   Looked at the latest code on trunk, it seems that I can just add my own DocValuesConsumer on line 94 in DWPT. Do you think that is the right way of doing this?\n\n   I will resolve this issue since seems that the trunk code is suppor what I need.\n\n-John ",
            "author": "John Wang",
            "id": "comment-13673539"
        },
        {
            "date": "2013-06-03T20:51:35+0000",
            "content": "This seem to be fixed already on trunk. ",
            "author": "John Wang",
            "id": "comment-13673543"
        }
    ]
}