{
    "id": "LUCENE-43",
    "title": "Internationalized search",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "1.2",
        "resolution": "Cannot Reproduce",
        "status": "Closed"
    },
    "description": "I would like Lucene to be able to search content in multiple languages, with\ncanadian French and Spanish being the top two that I am concerned with, by just\nbeing able to specify the locale at the time of the search.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2002-06-29T04:51:24+0000",
            "content": "This is no bug, and Lucene's TODO contains a similar item. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321090"
        },
        {
            "date": "2002-07-04T09:01:52+0000",
            "content": "I opened this as an enhancement request, not as a bug, as anyone can clearly see\nfrom the severity being set to \"Enchancment\".  Based on the below text, which\ncomes directly from the Jakarta project site, this is supposed to be the\nmechanism to request feature enhancements.  I recieved one e-mail saying that\none of my bugs was closed, because you use a TODO list in CVS for enhancements.\n I know that Lucene hasn't been a Jakarta project for very long, but since it\nis, it should follow established Jakarta project methods for such a thing.  I\nfind it much easier to request a feature enhancement through the standard\nJakarta mechanism, because I can use to track my requests against the project. \nIf you want to add my request to the TODO list in CVS from here that is fine,\nbut I would like to track this through this request.\n\nPier Fumagalli has set up the Apache Bug Database. Please use this database\nreport bugs and suggest new features. To suggest a new feature, set the severity\nof the bug to \"enhancement\".\n\nThanks.\n ",
            "author": "Andrig T. Miller",
            "id": "comment-12321091"
        },
        {
            "date": "2004-03-29T16:32:06+0000",
            "content": "I think this request, in its current form, isn't valid anymore. Lucene can search any \nlanguage, as it just works on Strings. If you want to properly normalize the strings just \nuse an Analyzer for that language. Code to detect the language of a text is also freely \navailable.  ",
            "author": "Daniel Naber",
            "id": "comment-12321092"
        },
        {
            "date": "2004-03-29T19:26:34+0000",
            "content": "Correct.  This can already be done with Lucene and an Analyzer designed for\nthose two languages.  Lucene Sandbox features Snowball Analyzers for several\nlanguages. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321093"
        }
    ]
}