{
    "id": "LUCENE-7198",
    "title": "Co-linear points in a convex or concave polygon will not properly detect intersections",
    "details": {
        "resolution": "Won't Fix",
        "affect_versions": "6.0",
        "components": [
            "modules/spatial3d"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Resolved",
        "type": "Bug"
    },
    "description": "When two or more points in a convex or concave polygon are colinear, the polygon won't properly detect intersections.  In order to work, the colinear segments must not interfere with one another during intersection detection.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15234911",
            "author": "Karl Wright",
            "date": "2016-04-11T11:35:14+0000",
            "content": "Some analysis of the problem shows that a series of coplanar points will likely already work.  The reason is that points on an edge are considered to be in-set.  Coplanarity is only approximate, but the convexity check guarantees that even coplanar points are truly convex (or concave).\n\nThe bad cases are as follows:\n\n(1) Two edges are coplanar and one of the two edges is internal while the other isn't.  In that case, if there's enough deviance from coplanarity, the entire edge will be checked for intersection, despite the fact that only part of it should be.  This will cause over-reporting of OVERLAPS situations, which is acceptable.\n\n(2) An intersection point is just outside the edge, and the coplanar edge removes it from consideration.  The convexity guarantee, however, insures that the minimum resolutiion for the point membership in the coplanar edge will be sufficient.\n\nSo I think we're actually good here, and messing with the code is probably not called for.\n "
        },
        {
            "id": "comment-15234912",
            "author": "Karl Wright",
            "date": "2016-04-11T11:35:39+0000",
            "content": "Probably not necessary to address this. "
        }
    ]
}