{
    "id": "LUCENE-3533",
    "title": "Nuke SpanFilters and CachingSpanFilter (maybe move to sandbox)",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "SpanFilters are inefficient and OOM easily (they don't scale at all: Create large Lists of Objects for every match, also filtering deleted docs is a pain). Some talks with Grant on Eurocon and also the fact that caching of them is still broken in 3.x (but fixed on trunk) - I assume nobody uses them, so let's nuke them. They are also in wrong package, so standard statement: \"Die, SpanFilters, die!\"",
    "attachments": {
        "LUCENE-3533.patch": "https://issues.apache.org/jira/secure/attachment/12502615/LUCENE-3533.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-10-25T12:34:07+0000",
            "content": "+1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13134981"
        },
        {
            "date": "2011-11-05T19:17:57+0000",
            "content": "I'm gonna try to work on this: I have a perf improvement to spans and this class prevents it. ",
            "author": "Robert Muir",
            "id": "comment-13144799"
        },
        {
            "date": "2011-11-05T19:55:22+0000",
            "content": "Patch, nuking these, but also removing stupid extra seeks from SpanQueries.\n\nThe problem is currently:\n\n\tseek to every term in every segment to compute IDF/etc\n\tseek to every term again in every segment to get docsAndPositionsEnum\n\t(possibly) seek to every term AGAIN in each segment if it doesn't exist, this is when d&penum returns null, to throw an error message \"positions were not indexed\". if this third seek returns null it will return EMPTY_SPANS\n\n\n\nwith the patch we just do 1 seek ",
            "author": "Robert Muir",
            "id": "comment-13144812"
        },
        {
            "date": "2011-11-12T00:04:24+0000",
            "content": "Robert do you want to take this? Should we nuke it on 3.x, too? ",
            "author": "Uwe Schindler",
            "id": "comment-13148870"
        },
        {
            "date": "2011-11-12T00:20:35+0000",
            "content": "It would be good to get a review on the patch: I think its ok in general.\n\nit removes a lot of stupidity from the spans, except for one case:\n\nthe SpanMultiTermQueryWrapper is still not single pass (it simply throws all termcontexts away).\n\nI thought about how to solve that one too, and I'm convinced its unfixable\nbecause SpanQueries aren't really query trees, its just one query that\ncalls extractTerms on everything underneath it.\n\nFor this reason, even if i made this MTQ one single-pass by allowing TermContexts\nto be passed to e.g. SpanOrQuery, it would work, but if you had that query inside\nanother SpanQuery then it would still do the extra seek like it does now.\n\nBut still, with the patch spans are a little better. ",
            "author": "Robert Muir",
            "id": "comment-13148888"
        },
        {
            "date": "2011-11-13T18:39:01+0000",
            "content": "Patch looks good!  One less query relying on TermsEnum caching... ",
            "author": "Michael McCandless",
            "id": "comment-13149327"
        }
    ]
}