{
    "id": "LUCENE-3070",
    "title": "Enable DocValues by default for every Codec",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Task",
        "fix_versions": [
            "CSF branch"
        ],
        "affect_versions": "CSF branch",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Currently DocValues are enable with a wrapper Codec so each codec which needs DocValues must be wrapped by DocValuesCodec. The DocValues writer and reader should be moved to Codec to be enabled by default.",
    "attachments": {
        "LUCENE-3070.patch": "https://issues.apache.org/jira/secure/attachment/12478230/LUCENE-3070.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-04T23:57:04+0000",
            "content": "first taking a look at the branch, just a really quick hack at a patch adding docsConsumer() and docsProducer() to Codec, with some renaming to fit (DefaultDocValuesConsumer/Producer) and enabling this for all codecs (except preflex)\n\nall tests pass, but there might be some naming/api issues... additionally maybe we should address the TestSort issue, we want to enable this test (without docvalues) on Preflex... maybe we should have an explicit test for that.\n\nalso we need a plain text impl for simpletext  ",
            "author": "Robert Muir",
            "id": "comment-13029056"
        },
        {
            "date": "2011-05-05T08:30:43+0000",
            "content": "Robert patch looks great!\n\nsome comments:\n\n\tthe simpletext nocommit should be a TODO IMO\n\tfor the preflex problem I think we need to add some infrastructure to add tests for 4.0 features somehow I will think about this\n\tone problem we are having here is that our current implementation is somewhat wasteful. Currently on flush we pull a FieldsConsumer for every codec used in the indexing session (per DWPT) regardless if this field is indexed. so we are creating some unneeded files if you use one field for docvalues only. The other thing is that we need to somehow reset the FieldInfo#hasDocValues \"flag\" on an error when we are hitting non-aborting exceptions during indexing before we can actually create the corresponding consumer. That is something we should address in a spin-off issue I think.\n\n\n\noverall I think you should commit the current state and we work from here! ",
            "author": "Simon Willnauer",
            "id": "comment-13029233"
        },
        {
            "date": "2011-05-05T08:37:52+0000",
            "content": "one more think I think preflex should throw UOE instead of returning null... At some point we should also think about a better name for Source, something like InMemoryDocValues or RamResidentDocValues - something more self speaking ",
            "author": "Simon Willnauer",
            "id": "comment-13029237"
        },
        {
            "date": "2011-05-16T10:55:22+0000",
            "content": "This patch adds UOE to PreFlex codec and makes FieldInfo#docValues transactional to prevent wrong flags if non-aborting exceptions occur.\n\nI also added some random docValues fields to RandomIndexWriter as well as some basic checks to CheckIndex. It's not perfect though but it's a start. ",
            "author": "Simon Willnauer",
            "id": "comment-13033964"
        },
        {
            "date": "2011-05-16T11:06:47+0000",
            "content": "Seems like it might be a good idea in RandomIndexWriter to sometimes not add docvalues? ",
            "author": "Robert Muir",
            "id": "comment-13033970"
        },
        {
            "date": "2011-05-16T11:13:14+0000",
            "content": "Seems like it might be a good idea in RandomIndexWriter to sometimes not add docvalues?\n\nyeah I think we should make this per RIW session not per document though since we already have random DocValues Types so some docs might get docvalues_int_xyz and some might get docvalues_float_xyz fields.  ",
            "author": "Simon Willnauer",
            "id": "comment-13033971"
        },
        {
            "date": "2011-05-16T11:32:09+0000",
            "content": "new patch, I added random DocValues to updateDocument and randomly enable / disable docValues entirely on optimize / commit / getReader so we get segments that don't have docValues at all etc. I think I will commit soon if nobody objects. ",
            "author": "Simon Willnauer",
            "id": "comment-13033975"
        },
        {
            "date": "2011-05-16T11:37:14+0000",
            "content": "looks good, i think this will help the test coverage a lot.\n\ncan you rename swtichDoDocValues to switchDoDocValues?  ",
            "author": "Robert Muir",
            "id": "comment-13033977"
        },
        {
            "date": "2011-05-16T11:41:26+0000",
            "content": "fixed typo - I will commit in a second. ",
            "author": "Simon Willnauer",
            "id": "comment-13033979"
        }
    ]
}