{
    "id": "LUCENE-8083",
    "title": "Give similarities better values for maxScore",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Invalid",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Task",
        "components": [],
        "fix_versions": []
    },
    "description": "The benefits of LUCENE-4100 largely depend on the quality of the upper bound of the scores that is provided by the similarity.",
    "attachments": {
        "LUCENE-8083.patch": "https://issues.apache.org/jira/secure/attachment/12901048/LUCENE-8083.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16281734",
            "date": "2017-12-07T11:34:02+0000",
            "content": "Here is a patch that improves BM25's maxScore by taking the maxFreq into account, and implements maxScore on all SimilarityBase impls by passing freq=maxFreq and docLen=1 to the score method. I also added new tests that are specific to this maxScore method.\n\nPractically, this means that the LUCENE-4100 optimizations now work well with similarities whose score saturates quickly with increasing frequencies like all DFR similarities, IBSimilarity with DistributionSPL, AxiomaticF2EXP and AxiomaticF2LOG. It might work well with other similarities as well in the future if we start recording the per-term (or maybe per-field would be a good start) maximum term frequency. ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16282054",
            "date": "2017-12-07T16:00:08+0000",
            "content": "\nIBSimilarity with DistributionSPL, AxiomaticF2EXP and AxiomaticF2LOG\n\nThese similarities can't work with maxScore. We should remove or move them out (LUCENE-8010) so it wont be confusing. They should also not be rotated in tests or they will cause confusion for e.g. booleanquery or phrasequery tests that try to test these optimizations. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16428260",
            "date": "2018-04-06T12:51:25+0000",
            "content": "This has been invalidated by the indexing of impacts. ",
            "author": "Adrien Grand"
        }
    ]
}