{
    "id": "LUCENE-2514",
    "title": "Change Term to use bytes",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Task",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "in LUCENE-2426, the sort order was changed to codepoint order.\n\nunfortunately, Term is still using string internally, and more importantly its compareTo() uses the wrong order [utf-16].\nSo MultiTermQuery, etc (especially its priority queues) are currently wrong.\n\nBy changing Term to use bytes, we can also support terms encoded as bytes such as numerics, instead of using\nstrange string encodings.",
    "attachments": {
        "LUCENE-2514_collatedrange.patch": "https://issues.apache.org/jira/secure/attachment/12451308/LUCENE-2514_collatedrange.patch",
        "LUCENE-2514-MTQPagedBytes.patch": "https://issues.apache.org/jira/secure/attachment/12447998/LUCENE-2514-MTQPagedBytes.patch",
        "LUCENE-2514_qp.patch": "https://issues.apache.org/jira/secure/attachment/12449930/LUCENE-2514_qp.patch",
        "LUCENE-2514.patch": "https://issues.apache.org/jira/secure/attachment/12447954/LUCENE-2514.patch",
        "LUCENE-2514-surrogates-dance.patch": "https://issues.apache.org/jira/secure/attachment/12447968/LUCENE-2514-surrogates-dance.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-06-24T16:31:37+0000",
            "content": "attached is one option: use bytesref behind the scenes but also support String ctors like we do today.\n\ni tried the 'hard cutover' mike suggested, but this is a massive change and I think typically users will just be using String.\n\npersonally I don't see the harm in supporting Strings this way, any perf-sensitive stuff creating a lot of Term objects (e.g. MultiTermQuery) should be using BytesRef anyway.\n\none test fails: the preflex TestSurrogates... does this test create terms with unpaired surrogates? If so this would explain the failures I think. ",
            "author": "Robert Muir",
            "id": "comment-12882210"
        },
        {
            "date": "2010-06-24T17:43:52+0000",
            "content": "one test fails: the preflex TestSurrogates... does this test create terms with unpaired surrogates? If so this would explain the failures I think.\n\nOh man not that one!!\n\nIt is not supposed to create unpaired surrogates (it uses _TestUtil.makeRandomUnicodeString).  I'll dig... ",
            "author": "Michael McCandless",
            "id": "comment-12882239"
        },
        {
            "date": "2010-06-24T17:47:47+0000",
            "content": "its my fault. preflex codec still uses Term.compareTo (and this is expected) in several places.\n\nso, i need to add back UTF8SortedAsUTF16Comparator to bytesref, and add a utf-16 compare to Term that uses it for the old behavior (or accomplish the equiv logic somewhere else) ",
            "author": "Robert Muir",
            "id": "comment-12882241"
        },
        {
            "date": "2010-06-24T18:00:58+0000",
            "content": "i tried to fix the preflex problem like this, but it didnt work... maybe something (sort or other) is still relying on the old utf-16 compareTo() that i didnt find???? ",
            "author": "Robert Muir",
            "id": "comment-12882251"
        },
        {
            "date": "2010-06-24T18:01:57+0000",
            "content": "Ahh sorry I do indeed seek to an unpaired high surrogate – easy to fix (pair it up w/ minimum low surrogate).\n\nBut, there's another problem, which is that the pre-flex codec uses Term.compareTo, and it needs that to be based on UTF16.  We can just fix the preflex codec to use its own (UTF8inUTF16order) comparator.  I think once we fix those two the test should pass again (crossing fingers...). ",
            "author": "Michael McCandless",
            "id": "comment-12882252"
        },
        {
            "date": "2010-06-24T18:06:42+0000",
            "content": "Attached patch to fix (I think) the unpaired surrogate passed to Term... not yet tested. ",
            "author": "Michael McCandless",
            "id": "comment-12882255"
        },
        {
            "date": "2010-06-24T18:24:11+0000",
            "content": "ok i combined my patch with yours, and fixed a typo (thats what i get for copy/paste)...\n\ni think it might be ok ",
            "author": "Robert Muir",
            "id": "comment-12882267"
        },
        {
            "date": "2010-06-24T18:35:30+0000",
            "content": "Looks good!\nMight want to just add a doc on the Term constructor that the provided BytesRef is not copied, and should not be modified after construction (i.e. if you create a Term w/ the BytesRef provided by a TermsEnum or something, you're in trouble). ",
            "author": "Yonik Seeley",
            "id": "comment-12882272"
        },
        {
            "date": "2010-06-24T18:39:15+0000",
            "content": "\nMight want to just add a doc on the Term constructor that the provided BytesRef is not copied, and should not be modified after construction (i.e. if you create a Term w/ the BytesRef provided by a TermsEnum or something, you're in trouble).\n\nYeah, I agree. I'd also like to improve some of the perf sensitive spots to never create strings at all before committing (e.g. MultiTermQuery rewrites).  ",
            "author": "Robert Muir",
            "id": "comment-12882276"
        },
        {
            "date": "2010-06-24T19:37:26+0000",
            "content": "here's an updated patch with yonik's suggested note (might need wording changes).\n\nAlso i started converting some various code to use the bytes(), queries and such... ",
            "author": "Robert Muir",
            "id": "comment-12882298"
        },
        {
            "date": "2010-06-24T19:39:57+0000",
            "content": "Mike, can you review some of the preflex changes to bytes() in the patch? \nI wonder if in some of these places we even need 'scratchBytesRef' at all now... ",
            "author": "Robert Muir",
            "id": "comment-12882300"
        },
        {
            "date": "2010-06-24T20:23:12+0000",
            "content": "preflex changes look good.\n\nI think with this we can eliminate the scratchBytesRef entirely in PreFlexFields and instead just use termEnum.term().bytes()! ",
            "author": "Michael McCandless",
            "id": "comment-12882312"
        },
        {
            "date": "2010-06-24T20:31:36+0000",
            "content": "Robert: I can take MTQ tomorrow. I think we can remove the whole backwards stuff from MTQ and change completely to BytesRef (internally). This makes the steps TermsEnum (bytes) -> TermCollector -> TermQuery which converts all the time simplier. The collector abstract class in the MTQ rewrites will be much nicer.\nI can also remove the rest of pre-BoostAttribute stuff from TopTermsRewrite.\n\nI will go to sleep now, tomorrow more... ",
            "author": "Uwe Schindler",
            "id": "comment-12882315"
        },
        {
            "date": "2010-06-24T20:38:18+0000",
            "content": "Uwe thanks, I would prefer if you did MTQ too.\n\nI agree it should completely use BytesRef... i think it should also not create new Terms even until rewriting.\n\nFor example, currently the priority queue in TopTerms does BytesRef -> String conversion and creates a new Term for each add, but this might be entirely useless as it could fall off the pq, so i think its ScoreTerm or whatever should not hold term at all but just bytesref. ",
            "author": "Robert Muir",
            "id": "comment-12882318"
        },
        {
            "date": "2010-06-24T20:43:58+0000",
            "content": "For example, currently the priority queue in TopTerms does BytesRef -> String conversion and creates a new Term for each add, but this might be entirely useless as it could fall off the pq, so i think its ScoreTerm or whatever should not hold term at all but just bytesref\n\nExactly! We removed support for TermEnum (without s), so field name is never null. You can always take the field from the MTQ when building TermQueries. And for that we create the Term using new Term(field, BytesRef) or with the non-interning placeholder (see also below). This makes MTQ much simplier, I started to do it...\n\nBy the way: we could remove all String interning for field names now? We don't compare fields anymore? ",
            "author": "Uwe Schindler",
            "id": "comment-12882321"
        },
        {
            "date": "2010-06-24T20:49:06+0000",
            "content": "By the way: we could remove all String interning for field names now? We don't compare fields anymore?\n\nYeah, I noticed that too... I think so. ",
            "author": "Yonik Seeley",
            "id": "comment-12882323"
        },
        {
            "date": "2010-06-24T20:50:51+0000",
            "content": "We also need to fix FieldCache/TermRangeQuery, since they now take separate String upper/lower.  We could just add corresponding BytesRef methods?\n\nBy the way: we could remove all String interning for field names now? We don't compare fields anymore?\n\nWe should be careful with this! ",
            "author": "Michael McCandless",
            "id": "comment-12882325"
        },
        {
            "date": "2010-06-24T20:53:35+0000",
            "content": "We also need to fix FieldCache/TermRangeQuery, since they now take separate String upper/lower. We could just add corresponding BytesRef methods?\n\nI'll fix these. I didnt notice them since they don't use Term, but String directly. The patch is also generally incomplete in other ways... mainly I am searching on uses of Term.text() and such to ensure I do not introduce performance regressions. ",
            "author": "Robert Muir",
            "id": "comment-12882326"
        },
        {
            "date": "2010-06-24T21:27:00+0000",
            "content": "Here robert's patch with MTQ changed.\n\nIt currently still uses placeholderTerms to not need to intern every time. If we remove string interning from Term, we can replace this by simple new Term() in MTQ.\n\nI delayed cloning of BytesRef until the BytesRef is put into a TermQuery or PQ or whenever it is set aside. But it no longer clones it e.g. if the term is never accepted by the PQ. Also the PQ reuses its ScoreTerm instances and so, the term bytes are simply copied over \n\nI also removed a Java 1.6 interface override - the Generics Policeman gives a ticket! I don't understand where those come from, Java 1.6 should also fail to compile as the ant build uses -source 1.5...? ",
            "author": "Uwe Schindler",
            "id": "comment-12882339"
        },
        {
            "date": "2010-06-24T21:35:53+0000",
            "content": "\nI also removed a Java 1.6 interface override - the Generics Policeman gives a ticket! I don't understand where those come from, Java 1.6 should also fail to compile as the ant build uses -source 1.5...?\n\nSorry, i am on a mac right now and i dont think i configured it correctly... (though ant test never complained... this is wierd).\nNormallly my IDE does not generate this... but at the same time it is something we should fix the build for, as i think Eclipse\nwill generate these by default if configured for Java 6, which solr uses. ",
            "author": "Robert Muir",
            "id": "comment-12882341"
        },
        {
            "date": "2010-06-24T21:35:56+0000",
            "content": "mainly I am searching on uses of Term.text() and such to ensure I do not introduce performance regressions.\n\nI would temporary remove all String methods from Term and try to compile core. If this works you should find all perf regressions in both directions. ",
            "author": "Uwe Schindler",
            "id": "comment-12882342"
        },
        {
            "date": "2010-06-24T21:44:46+0000",
            "content": "attached is an updated patch, with uwe's changes, plus some additional conversions like TermsFilter and FieldCacheTermsFilter\n\nThe range ones are a bit tricky, mainly because they work with collators with makes no sense with byte[]. but if collator is null then byte[] makes sense.\n\nthe collator stuff is silly in a way, if we switch collation to byte[] it will use less ram than even the original String in lucene 3.x, and sort much faster.\n\none option might be to split the collating range stuff into its own classes or something, i think its a bit confusing how collation is mixed in with 'binary' order... it tricks you into thinking the 'default' is UCA or default locale or something, but is neither.  ",
            "author": "Robert Muir",
            "id": "comment-12882346"
        },
        {
            "date": "2010-06-24T21:46:01+0000",
            "content": "I would temporary remove all String methods from Term and try to compile core. If this works you should find all perf regressions in both directions.\n\ni did this, but there is a lot of unrelated stuff that uses Term string methods and is perfectly fine. especially many tests and things like queryparser. ",
            "author": "Robert Muir",
            "id": "comment-12882347"
        },
        {
            "date": "2010-06-24T21:54:53+0000",
            "content": "\nI would temporary remove all String methods from Term and try to compile core. If this works you should find all perf regressions in both directions.\n\ni did this, but there is a lot of unrelated stuff that uses Term string methods and is perfectly fine. especially many tests and things like queryparser.\n\nYeah tests can use string methods, i meant only core classes should compile without Term's String methods.\n\none option might be to split the collating range stuff into its own classes or something, i think its a bit confusing how collation is mixed in with 'binary' order... it tricks you into thinking the 'default' is UCA or default locale or something, but is neither. \n\nI was always thinking about factoring out collation stuff from TermRangeQuery. I would like to have a pure TermRangeQuery without any collations things and maybe a CollationTermRangeQuery or whatever... ",
            "author": "Uwe Schindler",
            "id": "comment-12882352"
        },
        {
            "date": "2010-06-24T22:16:06+0000",
            "content": "\nYeah tests can use string methods, i meant only core classes should compile without Term's String methods.\n\nOk, i will have another look at this (ignoring tests and queryparser and such). Maybe i will find something interesting.\n\n\nI was always thinking about factoring out collation stuff from TermRangeQuery. I would like to have a pure TermRangeQuery without any collations things and maybe a CollationTermRangeQuery or whatever...\n\nyeah, i think this would be better in the future too. but for now, i can work with what we have. it just means lots of things like String lowerBound; /* only used when collator != null */ and such ",
            "author": "Robert Muir",
            "id": "comment-12882364"
        },
        {
            "date": "2010-06-24T23:21:44+0000",
            "content": "Here an improvement of the MTQ only patch:\n\nThe auto MTQ rewrite mode now collects all terms into a PagedBytes until cutoff. This maybe better memory-wise, not sure if this is really needed. For me it was just some usage training  and the number of objects is lower, especially for large cutoff numbers.\n\nMike? ",
            "author": "Uwe Schindler",
            "id": "comment-12882395"
        },
        {
            "date": "2010-06-25T01:54:44+0000",
            "content": "edit: i added newlines and reformatted so the issue is readable. sorry.\n\n\nWe also need to fix FieldCache/TermRangeQuery, since they now take separate String upper/lower. We could just add corresponding BytesRef methods?\n\nThis actually makes the api ugly and problematic for ctors, because of open-ended values (null). it would be nice to avoid requiring users to cast here...\n\n \nreference to TermRangeQuery is ambiguous, both method \nTermRangeQuery(java.lang.String,java.lang.String,java.lang.String,boolean,boolean) \nin org.apache.lucene.search.TermRangeQuery and method \nTermRangeQuery(java.lang.String,org.apache.lucene.util.BytesRef,\norg.apache.lucene.util.BytesRef,boolean,boolean) \nin org.apache.lucene.search.TermRangeQuery match\n    [javac]     TermRangeQuery query = new TermRangeQuery(\"content\", null, null, true, true);\n\n\n\nattached is my updates to TermRangeQuery etc before realizing this. it also includes updated FieldCacheRangeQuery complete with generics violations.\n\nmaybe when the policeman wakes up he will have ideas. i don't want the api to be ugly. ",
            "author": "Robert Muir",
            "id": "comment-12882422"
        },
        {
            "date": "2010-06-25T10:47:53+0000",
            "content": "Improved version of PagedBytes MTQ cut off collector. It adds a method to PagedBytes.Reader to sequentially read all BytesRefs without a separate offset array.\n\nMike, if you are fine with that, we should add this to the global patch for this issue.\n\nWe should maybe also fix PagedBytes.freeze(boolean), as the parameter is currently unused. For the use case here, reallocating the last block is not really needed, it can stay as is. Maybe we should readd support for this parameter. ",
            "author": "Uwe Schindler",
            "id": "comment-12882526"
        },
        {
            "date": "2010-06-25T13:31:39+0000",
            "content": "This patch only adds a correct trim to PagesBytes.freeze(boolean). The impl was missing, but is important here for performance. ",
            "author": "Uwe Schindler",
            "id": "comment-12882573"
        },
        {
            "date": "2010-06-25T14:11:05+0000",
            "content": "Uwe, thanks for the MTQ updates. i will merge them with my previous patch (not my latest broken one!)\n\nAfter looking at RangeQuery/Filter, i think i would prefer to make a subtask to refactor the collation part out.\nFor example, we could make CollatedRangeQuery.\n\nIn my opinion this is really very different from an ordinary binary-ordered range query and is confusing to both\nusers and the code to be mixed in. I think we should consider fixing the API by splitting these and adding\ndocumentation to the migrate.txt ",
            "author": "Robert Muir",
            "id": "comment-12882588"
        },
        {
            "date": "2010-06-25T14:25:02+0000",
            "content": "+1 ",
            "author": "Uwe Schindler",
            "id": "comment-12882591"
        },
        {
            "date": "2010-06-25T16:58:31+0000",
            "content": "updated patch:\n\n\tdropped the range query/filter changes so we can refactor those separately.\n\tremoved the BytesRef.EMPTY, uwe pointed out this is very dangerous since we cant prevent someone from modifying it.\n\ttried to optimize preflex codec, removing more conversions and removing scratchbytesref copying... i think more can be done here.\n\tmerged in uwe's latest multitermquery changes.\n\n ",
            "author": "Robert Muir",
            "id": "comment-12882635"
        },
        {
            "date": "2010-06-25T18:16:43+0000",
            "content": "ok i added a couple more optimizations to preflex, to avoid creating so many strings.\n\ni still don't like all the conversions for dealing with terms: is the problem just the shared prefixes and surrogate dance? I wonder if we can do something tricky to avoid this. ",
            "author": "Robert Muir",
            "id": "comment-12882666"
        },
        {
            "date": "2010-06-25T23:16:13+0000",
            "content": "Converted the rest of TestSurrogates (removed FieldAnText class, now direktly uses Term, as Term now supports BytesRef directly). Test respects verbose param. ",
            "author": "Uwe Schindler",
            "id": "comment-12882753"
        },
        {
            "date": "2010-06-26T02:35:47+0000",
            "content": "Thanks Uwe. I added some additional changes:\n\n\tnaive switch of MemoryIndex to byte terms (this one can use pagedbytes maybe too)\n\tremoved some more unnecessary byte->string in instantiated, uninvertedfield\n\n ",
            "author": "Robert Muir",
            "id": "comment-12882800"
        },
        {
            "date": "2010-06-27T04:19:33+0000",
            "content": "the term vectors api should be in sync with Term, but still uses String.\nthis patch switches them to bytesref too. ",
            "author": "Robert Muir",
            "id": "comment-12882913"
        },
        {
            "date": "2010-07-04T17:51:05+0000",
            "content": "Updated patch with recent trunk commits (TestTV, TestSurrogates) ",
            "author": "Uwe Schindler",
            "id": "comment-12885059"
        },
        {
            "date": "2010-07-04T18:02:12+0000",
            "content": "We should commit this soon and solve the rest separately?\n\nRobert? Mike? ",
            "author": "Uwe Schindler",
            "id": "comment-12885061"
        },
        {
            "date": "2010-07-04T18:09:53+0000",
            "content": "+1 ",
            "author": "Michael McCandless",
            "id": "comment-12885062"
        },
        {
            "date": "2010-07-04T18:18:29+0000",
            "content": "I don't have a real computer for a few days, so take it if you want! ",
            "author": "Robert Muir",
            "id": "comment-12885065"
        },
        {
            "date": "2010-07-04T19:45:50+0000",
            "content": "I take it and will commit it tomorrow. ",
            "author": "Uwe Schindler",
            "id": "comment-12885074"
        },
        {
            "date": "2010-07-05T08:36:24+0000",
            "content": "Committed this patch revision: 960484\n\nI keep this open, as more improvements may be added (e.g. TermRangeQuery) ",
            "author": "Uwe Schindler",
            "id": "comment-12885141"
        },
        {
            "date": "2010-07-20T16:08:47+0000",
            "content": "With Term as byte, and tokenstreams can encode terms to byte however they want with TermToBytesRefAttribute, it makes sense for queryparsers to consume bytes like the indexer, and build terms without an intermediate String. \n\nThis way non-unicode terms (e.g. collation) work as expected.\n\nThis patch updates the queryparsers, except for contrib/queryparser (which will be more serious and cause API changes), and the range query building AnalyzingQueryParser (we need to fix TermRangeQuery first).\n\nAll tests pass. ",
            "author": "Robert Muir",
            "id": "comment-12890289"
        },
        {
            "date": "2010-07-21T00:12:06+0000",
            "content": "I'd like to commit this queryparser patch tomorrow if no one objects. Then I think we should look at range query, etc. ",
            "author": "Robert Muir",
            "id": "comment-12890509"
        },
        {
            "date": "2010-07-21T09:30:02+0000",
            "content": "+1 to commit\n\nThis would also mean the BOCU-1 encoding could be used drop-in w/ QueryParser for basic (Term, Phrase) queries right? ",
            "author": "Michael McCandless",
            "id": "comment-12890630"
        },
        {
            "date": "2010-07-21T11:18:49+0000",
            "content": "This would also mean the BOCU-1 encoding could be used drop-in w/ QueryParser for basic (Term, Phrase) queries right?\n\nYes, they should then work (or there is a bug!) ",
            "author": "Robert Muir",
            "id": "comment-12890646"
        },
        {
            "date": "2010-07-21T14:40:38+0000",
            "content": "Committed LUCENE-2514_qp.patch revision 966254 ",
            "author": "Robert Muir",
            "id": "comment-12890740"
        },
        {
            "date": "2010-08-05T07:04:48+0000",
            "content": "In order to move forward with collation-keys-as-byte and other improvements, we need to fix TermRangeQuery.\nBut this is difficult when the String-only Collation support exists mixed with the byte-order TermRangeQuery... \n\nAs discussed previously on this issue, here is a patch that splits this into a separate CollatedTermRangeQuery/Filter ",
            "author": "Robert Muir",
            "id": "comment-12895576"
        },
        {
            "date": "2010-08-05T07:17:00+0000",
            "content": "by the way, i was thinking it would be nice to really move this slow collatedtermrangequery stuff either out of lucene alltogether or at least into contrib/queries.\n\nwe could make things even better by removing queryparser's get/setRangeCollator method.\ninstead in its place, it could have something like a boolean 'analyzeRangeQueries' ?\nit could then analyze the endpoints (producing byte collation keys) and use a regular fast term range query.\n\nI think its good to support collation order for people who want it, but we should make it easy to do things the fast way, \nright now we make it easy to do things the slow way and hard to do it fast. ",
            "author": "Robert Muir",
            "id": "comment-12895579"
        },
        {
            "date": "2010-08-05T09:45:05+0000",
            "content": "by the way, i was thinking it would be nice to really move this slow collatedtermrangequery stuff either out of lucene alltogether or at least into contrib/queries.\n\n+1\n\nI agree we have it backwards now.  The \"obvious\" approach should be the performant one. ",
            "author": "Michael McCandless",
            "id": "comment-12895624"
        },
        {
            "date": "2010-08-05T10:02:25+0000",
            "content": "by the way, i was thinking it would be nice to really move this slow collatedtermrangequery stuff either out of lucene alltogether or at least into contrib/queries.\n\n+1\n\nBy the way, the problem BytesRef vs. String is not yet solved for core TRQ. I would prefer to do it like for NRQ/FCRF with static factory methods. Then its also consistent accross all RQ parts. ",
            "author": "Uwe Schindler",
            "id": "comment-12895630"
        },
        {
            "date": "2010-08-05T13:24:54+0000",
            "content": "by the way, i was thinking it would be nice to really move this slow collatedtermrangequery stuff either out of lucene alltogether or at least into contrib/queries. \n\n+1 ",
            "author": "Steve Rowe",
            "id": "comment-12895674"
        },
        {
            "date": "2010-08-05T14:40:05+0000",
            "content": "By the way, the problem BytesRef vs. String is not yet solved for core TRQ. I would prefer to do it like for NRQ/FCRF with static factory methods. Then its also consistent accross all RQ parts.\n\nYes I know! I was leaving this for you, but if you have no time, I can take care of it.\nWhen that too is done, finally I think then I can commit LUCENE-2551 ! ",
            "author": "Robert Muir",
            "id": "comment-12895700"
        },
        {
            "date": "2010-08-18T22:43:59+0000",
            "content": "just checkpointing progress, here's my latest patch.\n\nHere i moved the slow functionality (range,sort) out of core and into contrib/queries.\nSo TermRangeQuery just does byte comparison, nothing fancy.\nAdditionally TermRangeQuery's API is changed to be more like NumericRangeQuery's, with newStringRange and newByteRange.\n\nTODO:\n\n\tQP's newRangeQuery args should be changed to BytesRef, and newRangeQuery should build ranges with newByteRange\n\tcontrib/qp needs a new attribute and some other work, and some of the other queryparsers need more changes too.\n\tneed to add tests (the ones i removed from core) for SlowCollatedRangeQuery and friends.\n\n ",
            "author": "Robert Muir",
            "id": "comment-12900080"
        },
        {
            "date": "2010-08-20T10:40:20+0000",
            "content": "Patch looks good Robert!\n\nI like the TermRangeQuery/Filter.newStringRange static factory.  You need to add the Slow prefix to the class names in MIGRATE.txt, and also mention the slow collated comparator has also moved. ",
            "author": "Michael McCandless",
            "id": "comment-12900661"
        },
        {
            "date": "2010-08-20T10:57:31+0000",
            "content": "Yah, the factory makes it easy for new users to create string ranges (as one exspects, like with NRQ, NRF, FCRF), but as the query itsself works on BytesRef, its ctor takes BytesRef. With the static factory, compile errors when you use null as bounds are not happening.\n\nDo we need a LessString() or should we completely remove the useless static factories named Less in the filter? ",
            "author": "Uwe Schindler",
            "id": "comment-12900663"
        },
        {
            "date": "2010-08-20T11:45:20+0000",
            "content": "I like the TermRangeQuery/Filter.newStringRange static factory. You need to add the Slow prefix to the class names in MIGRATE.txt, and also mention the slow collated comparator has also moved.\n\nYes, i forgot this from my TODO list!\n\nor should we completely remove the useless static factories named Less in the filter?\n\n+1. I didnt see these used anywhere. If we aren't going to remove them, then we should at least deprecate IMO ",
            "author": "Robert Muir",
            "id": "comment-12900673"
        },
        {
            "date": "2010-10-11T21:14:20+0000",
            "content": "I brought the patch up to trunk, it was very out of date.\nWill try to make it committable soon! ",
            "author": "Robert Muir",
            "id": "comment-12919991"
        },
        {
            "date": "2011-02-27T14:24:30+0000",
            "content": "Robert, can you commit your updates if its time to do it? You can assign to youself, if you like! ",
            "author": "Uwe Schindler",
            "id": "comment-12999962"
        },
        {
            "date": "2011-02-27T15:30:15+0000",
            "content": "Uwe, thanks for the reminder. I will try to actually wrap this one up today... needs some tests etc.\n\nIf you get a chance, can you take a quick glance at the Attributes-code in LUCENE-2551 ?\nI would like to resolve both issues together so that no functionality is lost. ",
            "author": "Robert Muir",
            "id": "comment-12999978"
        },
        {
            "date": "2011-02-27T20:55:07+0000",
            "content": "attached is an updated patch. Its ready to go, I plan on committing soon.\n\nUnrelated: i wrote a nasty random test for the SlowCollation stuff, but it fails if you get an executor service (some unrelated synchronization thing). This is some existing problem, I'll open another issue for this. ",
            "author": "Robert Muir",
            "id": "comment-13000037"
        },
        {
            "date": "2011-02-28T00:59:14+0000",
            "content": "I think this patch is fine! Will go to bed now, I just wanted you to know that I am really fine with it! Great work! ",
            "author": "Uwe Schindler",
            "id": "comment-13000074"
        },
        {
            "date": "2011-02-28T05:16:46+0000",
            "content": "Committed revision 1075210. ",
            "author": "Robert Muir",
            "id": "comment-13000111"
        }
    ]
}