{
    "id": "LUCENE-5794",
    "title": "Add a slow random-access ords wrapper",
    "details": {
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid",
        "components": [],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.10",
            "6.0"
        ]
    },
    "description": "Even if you are using an algorithm that requires random access (eg. sorting based on the maximum value), it might still be ok to allow for it occasionally on a codec that doesn't support random access like MemoryDocValuesFormat by having a slow random-access wrapper. This slow wrapper would need to be enabled explicitely. This would allow to have algorithms that are optimized on random-access codecs but still work in the general case.",
    "attachments": {
        "LUCENE-5794.patch": "https://issues.apache.org/jira/secure/attachment/12653169/LUCENE-5794.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14047698",
            "author": "Adrien Grand",
            "content": "Here is a patch to show the idea, I still need to add tests. ",
            "date": "2014-06-30T14:28:24+0000"
        },
        {
            "id": "comment-14048083",
            "author": "Ryan Ernst",
            "content": "The code seems fine, given your description of desired behavior.  If I understand correctly, you would use this in existing code today, which would speed it up if backed by a random access codec? ie, no worse than today? ",
            "date": "2014-06-30T20:17:05+0000"
        },
        {
            "id": "comment-14048851",
            "author": "Adrien Grand",
            "content": "Yes. If you have an algorithm that works better on random-access ords, I'd like to write it using the RandomAccessOrds class and then still make it usable on codecs that don't have random-access ords by using this slow wrapper. If your documents only have a couple of values, this is probably OK anyway. I think we just need to make sure this wrapping is explicit in order to avoid worst-cases? ",
            "date": "2014-07-01T13:15:40+0000"
        },
        {
            "id": "comment-14048855",
            "author": "Robert Muir",
            "content": "Alternatively we could just fix Memory to support random access. ",
            "date": "2014-07-01T13:18:57+0000"
        },
        {
            "id": "comment-16121437",
            "author": "Adrien Grand",
            "content": "Not relevant anymore with the new doc-values API. ",
            "date": "2017-08-10T10:34:15+0000"
        }
    ]
}