{
    "id": "LUCENE-3459",
    "title": "Change ChainedFilter to use FixedBitSet",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/other"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "3.4,                                            4.0-ALPHA",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "ChainedFilter also uses OpenBitSet(DISI) at the moment. It should also be changed to use FixedBitSet. There are two issues:\n\n\tIt exposes sometimes OpenBitSetDISI to it's public API - we should remove those methods like in BooleanFilter and break backwards\n\tIt allows a XOR operation. This is not yet supported by FixedBitSet, but it's easy to add (like for BooleanFilter). On the other hand, this XOR operation is bogus, as it may mark documents in the BitSet that are deleted, breaking new features like applying Filters down-low (LUCENE-1536). We should remove the XOR operation maybe or force it to use IR.validDocs() (trunk) or IR.isDeleted()",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-03-04T22:25:43+0000",
            "content": "Ha!  I was just about to report the reverse problem – make TermsFilter return OpenBitset for optimal compatibility with ChainedFilter.  I'm using TermsFilters with ChainedFilter and the mis-match of OpenBitSet and FixedBitSet is definitely not optimal since I want it to intersect those bitsets together quickly.\n\nI don't understand why there are both.  My IDE says FixedBitSet has 206 usages compared to OpenBitSet's 230.  That's closer than I thought.  I recall Uwe Schindler saying he would like OBS deprecated, but I pointed out that it is OBS that is fully public and FixedBitSet that is marked as @lucene.internal. ",
            "author": "David Smiley",
            "id": "comment-13592740"
        },
        {
            "date": "2013-03-04T22:31:16+0000",
            "content": "If you look into the details of usage, you will see recognize that OpenBitSet is only usd by Solr. Lucene does not use it anymore except at these few places. ChainedFilter needs some additional bit operations, FixedBitSet currently does not support.\n\nPerformance-wise FixedBitSet is better for filters because it has less checks and does not support resize (the bit set size is fixed).  ",
            "author": "Uwe Schindler",
            "id": "comment-13592746"
        },
        {
            "date": "2013-07-23T18:44:35+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716995"
        },
        {
            "date": "2014-02-10T04:30:36+0000",
            "content": "ChainedFilter was changed to use FixedBitSet on LUCENE-5440. ",
            "author": "Shai Erera",
            "id": "comment-13896209"
        },
        {
            "date": "2014-02-10T08:23:35+0000",
            "content": "Cool, thanks! I wanted to do this since 4.0  Many thanks! ",
            "author": "Uwe Schindler",
            "id": "comment-13896308"
        }
    ]
}