{
    "id": "LUCENE-5093",
    "title": "nightly-smoke should run some fail fast checks before doing the full smoke tester",
    "details": {
        "components": [],
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "If something like the NOTICES fail the smoke tester, it currently takes 22 minutes to find out on my pretty fast machine. That means testing a fix also takes 22 minutes.\n\nIt would be nice if some of these types of checks happened right away on the src tree - we should also check the actual artifacts with the same check later - but also have this fail fast path.",
    "attachments": {
        "LUCENE-5093.patch": "https://issues.apache.org/jira/secure/attachment/12590930/LUCENE-5093.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-07-04T18:59:49+0000",
            "content": "Don't laugh, I don't know python at all.\n\nThis adds one fail fast check for the testNotice check. ",
            "author": "Mark Miller",
            "id": "comment-13700305"
        },
        {
            "date": "2013-07-04T19:05:36+0000",
            "content": "awesome! i think a lot of these checks do run on the source tree thats in the release .tar.gz.\n\nso if we can do what you did here, and make a lot of the fast ones accessible directly on the source tree, we could incorporate these kinda things even into every jenkins build (via precommit: rather than just the heavy-duty check that takes 30 minutes and runs once a day or something).\n\nand it makes fixing things locally faster. ",
            "author": "Robert Muir",
            "id": "comment-13700308"
        },
        {
            "date": "2013-07-04T19:09:10+0000",
            "content": "I would prefer to have these checks in plain Ant or Ant-embedded Groovy logic. No need for python here... I can help with implementing those.  ",
            "author": "Uwe Schindler",
            "id": "comment-13700311"
        },
        {
            "date": "2013-07-04T19:10:21+0000",
            "content": "another check we could add in the future like this: the smokeTester checks some things about changes.html.\n\nI've had to respin (30 minutes to see the fail, then fix, then 30 more minutes to make sure it passes) because of a leftout or extra \":\" character in CHANGES.txt before. Really it would be nice if the documentation-lint that runs as part of precommit found that earlier... ",
            "author": "Robert Muir",
            "id": "comment-13700312"
        },
        {
            "date": "2013-07-04T19:20:58+0000",
            "content": "I would prefer to have these checks in plain Ant or Ant-embedded Groovy logic.\n\nI think it depends - unless we rewrite the whole smoke tester, I think it's better that this logic is in one place - the smoke tester script. Otherwise, over time, some checks might be added to the testNotice method of the smoke tester but not to the fast fail check in ant or groovy, and then it doesn't help much with fixing smoke tester fails. Any expansion of tests will have to be done in two places, in two non java languages (yuck and yuck). ",
            "author": "Mark Miller",
            "id": "comment-13700317"
        },
        {
            "date": "2013-07-23T18:44:45+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717049"
        },
        {
            "date": "2014-04-16T12:54:44+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970860"
        }
    ]
}