{
    "id": "LUCENE-1531",
    "title": "contrib/xml-query-parser, BoostingTermQuery support",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/other"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "2.4",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I'm not 100% on this patch. \n\nBooleanTermQuery is a part of the spans family, but I generally use that class as a replacement for TermQuery.  Thus in the DTD I have stated that it can be a part of the root queries as well as a part of a span. \n\nHowever, SpanFooQueries xml elements are named <SpanFoo/> rather than <SpanFooQuery/>, I have however chosen to call it <BoostingTermQuery/>. It would be possible to set it up so it would be parsed as <SpanBoostingTerm/> when inside of a <SpanSomething>, but I just find that confusing.",
    "attachments": {
        "LUCENE-1531.txt": "https://issues.apache.org/jira/secure/attachment/12399078/LUCENE-1531.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-01-30T01:51:12+0000",
            "content": "Previous patch was messed up from cloning SpanTerm.. ",
            "author": "Karl Wettin",
            "id": "comment-12668705"
        },
        {
            "date": "2009-02-04T05:09:00+0000",
            "content": "Any objections to this patch? If not I'll pop in the trunk in a few days from now. ",
            "author": "Karl Wettin",
            "id": "comment-12670240"
        },
        {
            "date": "2009-02-04T15:12:56+0000",
            "content": "Looks good to me. The only thing I would be tempted to add is a very brief description of the BoostingTermQuery in the DTD (i.e. explaining it's dependency on payloads as a differentiator). \nI know this duplicates some of the Javadocs but I have developers who refer to the generated XML syntax docs solely as an abstraction away from the underlying Java classes and on first-read it is not obvious that this tag requires at the least special index support.\n\nI will re-generate the HTML docs using DTDDoc later once I've added support for the new Trie-based queries/filters (Uwe, if you're reading this let me know if you think the Trie API has stabilised).\n ",
            "author": "Mark Harwood",
            "id": "comment-12670341"
        },
        {
            "date": "2009-02-09T11:51:06+0000",
            "content": "Committed revision 742411 ",
            "author": "Karl Wettin",
            "id": "comment-12671816"
        }
    ]
}