{
    "id": "LUCENE-7025",
    "title": "Already open IndexSearcher sees different DVs as commits are happening",
    "details": {
        "resolution": "Not A Problem",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Closed",
        "type": "Bug"
    },
    "description": "I'm hitting an issue in SOLR-5944 whereby I am seeing the dvGen of a reader underlying an open searcher is changing when parallel commits are happening. \n\nThis happens when the reader is opened from a writer, but doesn't happen when the reader is opened directly from a directory.\n\nAlso, I think I am, in Solr, seeing differences in DVs when parallel threads make DV updates and do commits. In the attached test, I couldn't reproduce this scenario, though.\n\nQuestions:\n1) Is it a bug, or by design, that the segment readers of an open indexsearcher has their dvGens changing? (as according to the test attached).\n2) Is it possible, as I think it is happening in Solr's 5944, that the DV values themselves could change as a result of this parallel commit happening?\n\nApologies, if I should have asked this at the user mailing list, instead of opening an issue here.",
    "attachments": {
        "TestIndexSearcherStability.java": "https://issues.apache.org/jira/secure/attachment/12787576/TestIndexSearcherStability.java"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15143770",
            "author": "Ishan Chattopadhyaya",
            "date": "2016-02-12T00:22:01+0000",
            "content": "Test containing a Lucene only test demonstrating the issue I am running into. "
        },
        {
            "id": "comment-15145884",
            "author": "Ishan Chattopadhyaya",
            "date": "2016-02-13T08:56:31+0000",
            "content": "While I am seeing the dvGen (and fieldInfosGen) changing from underneath an open reader, I have been unable to establish any side effect due to this. The issue I was observing in SOLR-5944 turned out to be unrelated. Closing this for now. "
        }
    ]
}