{
    "id": "LUCENE-4323",
    "title": "Add max cfs segment size to LogMergePolicy and TieredMergePolicy",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "affect_versions": "4.0-BETA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Our application is managing thousands of indexes ranging from a few KB to a few GB in size. To keep the number of files under control and at the same time avoid the overhead of compound file format for large segments, we would like to keep only small segments as CFS. The meaning of \"small\" here is in absolute byte size terms, not as a percentage of the overall index. It is ok and in fact desirable to have the entire index as CFS as long as it is below the threshold.\n\nThe attached patch adds a new configuration option maxCFSSegmentSize which sets the absolute limit on the compound file segment size, in addition to the existing noCFSRatio, i.e. the lesser of the two will be used. The default is to allow any size (Long.MAX_VALUE) so that the default behavior is exactly as it was before.\n\nThe patch is for the trunk as of Aug 23, 2012.",
    "attachments": {
        "diskFullFix.patch": "https://issues.apache.org/jira/secure/attachment/12542273/diskFullFix.patch",
        "LUCENE-4323.patch": "https://issues.apache.org/jira/secure/attachment/12542114/LUCENE-4323.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-08-23T11:18:05+0000",
            "content": "Hi, thanks for patch. The only thing: Can you fix your coding style to use no TABS but instead 2 spaces for indentation? For eclipse and idea there are code styles in the checkout (ant eclipse, ant idea). ",
            "author": "Uwe Schindler",
            "id": "comment-13440218"
        },
        {
            "date": "2012-08-23T12:58:59+0000",
            "content": "Sorry about that. I had eclipse do some auto-formatting on save, so the patch included more than it should have. Updated patch is attached (no tabs). ",
            "author": "Alexey Lef",
            "id": "comment-13440264"
        },
        {
            "date": "2012-08-23T14:05:18+0000",
            "content": "Thanks. What think the others committers about this? ",
            "author": "Uwe Schindler",
            "id": "comment-13440306"
        },
        {
            "date": "2012-08-23T15:19:51+0000",
            "content": "+1 ",
            "author": "Michael McCandless",
            "id": "comment-13440370"
        },
        {
            "date": "2012-08-23T16:12:06+0000",
            "content": "+1\n\n(Too bad the useCompoundFile() and the related configuration getters&setters have to be implemented in both LogMergePolicy and TieredMergePolicy, since MergePolicy, their shared superclass, doesn't have a concrete implementation.) ",
            "author": "Steve Rowe",
            "id": "comment-13440408"
        },
        {
            "date": "2012-08-23T17:11:47+0000",
            "content": "Updated patch:\nThe setter had a documentation and overflow problem. I also fixed the other setters in Tiered to behave correctly when Double.POSITIVE_INFINITY is passed. Finally I added tests for the setters.\n\nI will commit this later! ",
            "author": "Uwe Schindler",
            "id": "comment-13440457"
        },
        {
            "date": "2012-08-23T23:19:16+0000",
            "content": "Committed trunk revision: 1376766\nCommitted 4.x revision: 1376767\n\nThanks Alexey! ",
            "author": "Uwe Schindler",
            "id": "comment-13440757"
        },
        {
            "date": "2012-08-24T13:03:15+0000",
            "content": "This does not actually work in megabytes: see my email response on the list to test failures.\n\nstep1: ant test -Dtestcase=TestIndexWriterOnDiskFull -Dtests.method=testAddIndexOnDiskFull -Dtests.seed=17160CAE40DA6C29 -Dtests.slow=true -Dtests.locale=hr_HR -Dtests.timezone=Etc/GMT+12 -Dtests.file.encoding=UTF-8 -Dtests.verbose=true\n\nYou can see all values are 8.796093022207999E12\n\nstep2: apply my patch, which forces this to instead be Double.POSITIVE_INFINITY instead of 8.796093022207999E12. This should really have no effect here, since the directories are tiny (all < 1MB)!\n\nbut now if you run the seed again, it passes! ",
            "author": "Robert Muir",
            "id": "comment-13441121"
        },
        {
            "date": "2012-08-24T13:14:41+0000",
            "content": "Keep in mind we should I think, still apply something like my patch to disk full tests that count MBytes, as we don't want this kicking in here I think.\n\nHowever i want to be absolutely positive we aren't hiding bugs before doing that. ",
            "author": "Robert Muir",
            "id": "comment-13441126"
        },
        {
            "date": "2012-08-24T13:43:24+0000",
            "content": "You fix just hides the problem which is caused by another randomization in LTC:\n\nstep2: apply my patch, which forces this to instead be Double.POSITIVE_INFINITY instead of 8.796093022207999E12. This should really have no effect here, since the directories are tiny (all < 1MB)!\n\nHere is the explanation:\nYour fix - (setting LMP's maxMerge) is not changing anything here - the max size is still Long.MAX_VALUE internally! The change is really that you change the order of newLogMergePolicy(),newIndexWriterConfig() [they were the other order before] -> this changes random numbers completely.\nWhat I changed in my patch was missing randomization in new LogMergePolicy for cfsRatio! Before it was always 0.1, preventing creating CFS on addIndexes at all! In the original seed without your patch, the cfsRatio was then randomized to ~0.8, causing CFS files to be created -> causing disk Full.\n\nThe cause is simply additional randomization, missing before for newLogMergePolicy().\n\nThe correct way to fix this test is to prevent CFS files at all: newLogMergePolicy(false).\n\nShould I commit that fix? ",
            "author": "Uwe Schindler",
            "id": "comment-13441142"
        },
        {
            "date": "2012-08-24T13:46:40+0000",
            "content": "Here the patch that fixes the test bug, explanation (why Roberts fix fixed the bug was just a side effect of his code change, not setting the maxMergeSize). The code committed here as fine! ",
            "author": "Uwe Schindler",
            "id": "comment-13441146"
        },
        {
            "date": "2012-08-24T14:02:30+0000",
            "content": "Thanks for digging Uwe: I just wanted to be sure here. +1 to commit this. I'm not sure if any of the other disk full methods might need this too. ",
            "author": "Robert Muir",
            "id": "comment-13441160"
        },
        {
            "date": "2012-09-10T18:04:38+0000",
            "content": "this is actually fixed, I reopened it because of a jenkins fail, but it was only slightly related (more to Uwe's new test randomization) ",
            "author": "Robert Muir",
            "id": "comment-13452251"
        },
        {
            "date": "2013-05-10T10:33:52+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654053"
        }
    ]
}