{
    "id": "LUCENE-6235",
    "title": "smokeTestRelease.py's regex for TestBackwardsCompatibility is brittle, breaks if user uses ant's ANT_ARGS",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "smokeTestRelease.py has always exec'ed \"ant\" on source releases to smoke check the build - but the changes intorduced in LUCENE-5863 also do a regex over the output of the ant call to run TestBackwardsCompatibility.\n\nThis regex doesn't play nicely however if the user has ANT_ARGS configured to use an alternative logger - in particular i (and i'm guessing i'm not alone among the general ant using populace) have this in my shell...\n\n\n$ env | grep ANT\nANT_HOME=/opt/ant/default/\nANT_ARGS=-logger org.apache.tools.ant.listener.AnsiColorLogger\n\n\n\nThe AnsiColorLogger, and the control characters it outputs to color the output lines, seems to break the regex matching for TestBackwardsCompatibility's output.\n\nWorkarround (seems to be - still testing) for smoke testers to force their environment to specify the DefaultLogger...\n\n\n$ ANT_ARGS='-logger org.apache.tools.ant.DefaultLogger' python3.2 dev-tools/scripts/smokeTestRelease.py http://people.apache.org/~anshum/staging_area/lucene-solr-5.0.0-RC2-rev1658469",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14314556",
            "author": "Hoss Man",
            "date": "2015-02-10T18:09:16+0000",
            "content": "\nFWIW: I tried hacking this particular ant call in smokeTestRelease.py so that it would a command line override for the the logger internally (independent of what the user's env might have) but ant won't allow that...\n\n\nRuntimeError: ant -logger org.apache.tools.ant.DefaultLogger test -Dtestcase=TestBackwardsCompatibility -Dtests.verbose=true failed:\nb'Only one logger class may be specified.\\n'\n\n "
        }
    ]
}