{
    "id": "LUCENE-8140",
    "title": "Checks for coplanarity when creating polygons shows numerical issues",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Closed",
        "type": "Bug",
        "components": [
            "modules/spatial3d"
        ],
        "fix_versions": [
            "6.7",
            "7.3",
            "master (8.0)"
        ]
    },
    "description": "Coplanarity checks in GeoPolygonFactory shows numerical errors when the distance between two points is very small compared to the distance of the other two points. The situation is as follows:\n\nHaving three points A, B, & C and the distance between A & B is very small compared to the distance between A & C, then the plane AC contains all points (co-planar) but the plane defined by AB does not contain C because of numerical issues. This situation makes some polygons fail to build.",
    "attachments": {
        "LUCENE-8140-test.patch": "https://issues.apache.org/jira/secure/attachment/12908298/LUCENE-8140-test.patch",
        "LUCENE-8140.patch": "https://issues.apache.org/jira/secure/attachment/12908299/LUCENE-8140.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16342993",
            "date": "2018-01-29T07:14:19+0000",
            "content": " Looking at the problem, it seems the problem appears when looking for the polygon path. A possible solution is to update the current path to the new coplanar point, something that it is not currently done.  ",
            "author": "Ignacio Vera"
        },
        {
            "id": "comment-16343092",
            "date": "2018-01-29T08:56:06+0000",
            "content": "Ignacio Vera  I'm not sure it's a good idea to make a non-modifiable class with public members become suddenly modifiable.  Can you redo your patch so that we aren't modifying immutable objects? ",
            "author": "Karl Wright"
        },
        {
            "id": "comment-16343250",
            "date": "2018-01-29T11:32:54+0000",
            "content": "This means the algorithm needs to change so SafePath nodes are created after checking for coplanirity.\n\nI have already a new version which is actually not a recursive method but does the job on a loop. It passes all tests but I would like to test it more so hopefully I will have a new version by tomorrow. ",
            "author": "Ignacio Vera"
        },
        {
            "id": "comment-16343334",
            "date": "2018-01-29T13:09:17+0000",
            "content": "Rewriting the \"planar point filter\" is fine with me; never did like that code much. ",
            "author": "Karl Wright"
        },
        {
            "id": "comment-16344708",
            "date": "2018-01-30T09:05:56+0000",
            "content": "Attached is my version for \"planar point filter\" which it seems more accurate.\n\nI have removed recursive methods as I have seen stack overflows when trying to create very large polygons (although we can discuss that we have large polygons for that use case). ",
            "author": "Ignacio Vera"
        },
        {
            "id": "comment-16344971",
            "date": "2018-01-30T12:23:27+0000",
            "content": "Hi Ignacio Vera, first of all if this passes all random tests I'm fine with committing the code as-is.  Please also commit to branch_6x and branch_7x when you do.\n\nSecond, about recursion when there are a lot of edges – beyond a few hundred edges, the performance of GeoComplexPolygon far exceeds the performance of the tiled polygon approach.  That's why it was written.  If your polygons have enough edges to cause stack overflows with recursion  then I suggest you use GeoComplexPolygon instead. ",
            "author": "Karl Wright"
        },
        {
            "id": "comment-16346424",
            "date": "2018-01-31T08:28:32+0000",
            "content": "Ignacio Vera If you would like me to commit on your behalf, I'm happy to do that as well, just as soon as my current sprint is over. ",
            "author": "Karl Wright"
        },
        {
            "id": "comment-16346457",
            "date": "2018-01-31T08:53:25+0000",
            "content": "I think in this case I prefer that you commit on my behalf. I want to open a ticket to change something trivial thing to the random shape generator and I will commit that.  It will help me to build up confidence that I set up my system properly.\n\nThanks! ",
            "author": "Ignacio Vera"
        },
        {
            "id": "comment-16346832",
            "date": "2018-01-31T13:34:16+0000",
            "content": "The commit messages had the wrong issue number; for the record, the relevant commits are:\n\nmaster: ebb346d58204d014f85fe3576ce00a0d000491bb\n\n7x: 505f7b9d56abed389f20d97a16bc5462603b95a3\n\n6x: f419b96687b393989dc0bf25c327ca98498459e1 ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-16346837",
            "date": "2018-01-31T13:36:51+0000",
            "content": "Thanks, Alan Woodward.  Sorry for the typo. ",
            "author": "Karl Wright"
        }
    ]
}