{
    "id": "LUCENE-3381",
    "title": "Sandbox remaining contrib queries",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In LUCENE-3271, I moved the 'good' queries from the queries contrib to new destinations (primarily the queries module).  The remnants now need to find their home.  As suggested in LUCENE-3271, these classes are not bad per se, just odd.  So lets create a sandbox contrib that they and other 'odd' contrib classes can go to.  We can then decide their fate at another time.",
    "attachments": {
        "LUCENE-3381.patch": "https://issues.apache.org/jira/secure/attachment/12490767/LUCENE-3381.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-08-18T08:20:39+0000",
            "content": "Patch which does the following:\n\n\n\tEstablishes a sandbox contrib\n\tMoves the queries from the queries contrib to the sandbox.  FuzzyLikeThisQuery has grown on me so I've given it a clean and pushed it to the queries module.\n\tRemoves the queries contrib\n\n ",
            "author": "Chris Male",
            "id": "comment-13086874"
        },
        {
            "date": "2011-08-18T08:21:22+0000",
            "content": "Command for patch:\n\n\nsvn move lucene/contrib/queries/src/java/org/apache/lucene/search/FuzzyLikeThisQuery.java modules/queries/src/java/org/apache/lucene/queries/FuzzyLikeThisQuery.java\nsvn move lucene/contrib/queries/src/test/org/apache/lucene/search/FuzzyLikeThisQueryTest.java modules/queries/src/test/org/apache/lucene/queries/FuzzyLikeThisQueryTest.java\nsvn move --parents lucene/contrib/queries/src/java/org/apache/lucene/search/* lucene/contrib/sandbox/src/java/org/apache/lucene/sandbox/queries/\nsvn move --parents lucene/contrib/queries/lib/* lucene/contrib/sandbox/lib/\nsvn move --parents lucene/contrib/queries/src/test/org/apache/lucene/search/*  lucene/contrib/sandbox/src/test/org/apache/lucene/sandbox/queries/\nsvn delete dev-tools/idea/lucene/contrib/queries\nsvn delete dev-tools/maven/lucene/contrib/queries\nsvn delete lucene/contrib/queries\n\n ",
            "author": "Chris Male",
            "id": "comment-13086875"
        },
        {
            "date": "2011-08-18T08:55:44+0000",
            "content": "FuzzyLikeThisQuery has grown on me so I've given it a clean and pushed it to the queries module\n\nI have thousands of people using it daily in dozens of different installations so keen to avoid any significant changes/loss. ",
            "author": "Mark Harwood",
            "id": "comment-13086897"
        },
        {
            "date": "2011-08-18T09:00:44+0000",
            "content": "But this query has serious problems:\n\n\tthe fact it caches 'rewrittenQuery' in the QUERY itself, this means the Query is keeping IndexSearcher-dependent state in the Query: this is broken.\n\tthe static similarity, which at the moment must extend TFIDFSimilarity (does not work with other scoring systems)\n\n\n\nSorry, I think these problems should be fixed first! ",
            "author": "Robert Muir",
            "id": "comment-13086899"
        },
        {
            "date": "2011-08-18T09:14:33+0000",
            "content": "\nI have thousands of people using it daily in dozens of different installations so keen to avoid any significant changes/loss.\n\nI have no intention of removing it but as Robert has pointed out in a couple of issues there is huge scope for improvement which we cannot ignore.  I'll make sure to document any changes.\n\n\n\n\tthe fact it caches 'rewrittenQuery' in the QUERY itself, this means the Query is keeping IndexSearcher-dependent state in the Query: this is broken.\n\tthe static similarity, which at the moment must extend TFIDFSimilarity (does not work with other scoring systems)\n\n\n\nGood points.  The cached rewrittenQuery seems like an easy fix (albeit a change that should be documented).  I see your comments in code about averaging out statistics.  That seems like a bigger issue.  Moving away from a static similarity seems like its doable at this stage.  Is the agnostic scoring model support a showstopper? ",
            "author": "Chris Male",
            "id": "comment-13086908"
        },
        {
            "date": "2011-08-18T09:21:55+0000",
            "content": "\nGood points. The cached rewrittenQuery seems like an easy fix (albeit a change that should be documented).\n\nWell its a bug? We document that you can safely reuse Query, so if a system like Solr or ElasticSearch that caches queries caches this query, this stuff won't function correctly?\n\n\nIs the agnostic scoring model support a showstopper?\n\nYes, in my opinion it is, we have to think this through. ",
            "author": "Robert Muir",
            "id": "comment-13086909"
        },
        {
            "date": "2011-08-18T09:36:21+0000",
            "content": "\nWell its a bug? We document that you can safely reuse Query, so if a system like Solr or ElasticSearch that caches queries caches this query, this stuff won't function correctly?\n\nYes its a bug in that it doesn't conform to Query's requirements, but its a change in behaviour for this particular Query impl.  I'm happy to document the change under the bugs section in CHANGES.txt so we cover both bases.\n\n\nYes, in my opinion it is, we have to think this through.\n\nTo sandbox it goes!\n\n ",
            "author": "Chris Male",
            "id": "comment-13086914"
        },
        {
            "date": "2011-08-18T09:42:02+0000",
            "content": "Sorry, I think these problems should be fixed first!\n\nI acknowledge those are issues to be addressed for more general use and (luckily) do not affect my existing usage of this class. I expect the query-caching issue can be fixed relatively simply. The scoring system issue gets interesting because this fuzzy functionality relies on tweaking IDF in particular. To work across different scoring systems generically I expect IDF-tweakage would need to be made a pluggable aspect of all these scoring strategies e.g. through a common interface. Messy.\n\nThe point of my previous comment was to register that this was one of the queries languishing outside of core that was genuinely in active use. I imagined this would be  useful information if folks are in the process of cleaning out some of the \"dead wood\" (including relegation to a \"useless-but-stored-for-historical-purposes\" pile).   ",
            "author": "Mark Harwood",
            "id": "comment-13086915"
        },
        {
            "date": "2011-08-18T09:52:41+0000",
            "content": "\nTo work across different scoring systems generically I expect IDF-tweakage would need to be made a pluggable aspect of all these scoring strategies e.g. through a common interface. Messy.\n\nI don't think think we need to do that?\nI added a comment to the source code:\n\n    // TODO: generalize this query (at least it should not reuse this static sim!\n    // a better way might be to convert this into multitermquery rewrite methods.\n    // the rewrite method can 'average' the TermContext's term statistics (docfreq,totalTermFreq) \n    // provided to TermQuery, so that the general idea is agnostic to any scoring system...\n\n\n\nI don't think this is really that hard, nor messy? \nThen this Query just invokes rewrite() to a BooleanQuery of ordinary fuzzyqueries, setting its custom rewrite methods (it looks like we need to implement 2 here, depending upon configuration) on each.\n\nThe rewrite methods would average docfreq and totaltermfreq (the only two \"collection-wide\" term statistics lucene supports), and set these in the TermContexts that they pass to TermQuery. Then the concept works for all scoring systems.\n\nAs a side benefit, this would give some performance benefits anyway since by doing this, the term rewrite will become single pass instead of doing wasted seeks per-segment * per-term. ",
            "author": "Robert Muir",
            "id": "comment-13086920"
        },
        {
            "date": "2011-08-18T10:31:59+0000",
            "content": "It's more nuanced than averaging IDF of variants (as discussed at length in LUCENE-329).\nTo summarise: the original search term is the closest thing we have to the user's intent. If we average its IDF against all fuzzy variants it is most likely to dilute this value with a set of rare terms (most terms in the termEnum are e.g. typos) that happen to share some characters.\nWhen sitting this sort of expanded fuzzy query alongside other search terms in a BooleanQuery (e.g. robert~ OR muir) we end up making the \"robert~\" branch of the query look comparatively rare compared to the straight \"muir\" term thanks to the IDF dilution from a hundred rare \"robert\" variations. In my view the correct fix is to use the root term's IDF only (assuming \"robert\" actually exists in the index otherwise we must drop back to the average of variants).\n\nThat's the trick employed by FuzzyLikeThis that stops my customers complaining about \"bad fuzzy matches\". ",
            "author": "Mark Harwood",
            "id": "comment-13086936"
        },
        {
            "date": "2011-08-18T12:31:03+0000",
            "content": "New patch that moves FuzzyLikeThisQuery into the sandbox.  DuplicateFilter also goes into the sandbox (incorrectly pushed to the queries module).\n\nEverything passes and is ready to go.\n\nI'll open an issue for the fixes to FuzzyLikeThisQuery. ",
            "author": "Chris Male",
            "id": "comment-13086987"
        },
        {
            "date": "2011-08-18T12:31:30+0000",
            "content": "Command for patch:\n\n\nsvn move --parents lucene/contrib/queries/src/java/org/apache/lucene/search/* lucene/contrib/sandbox/src/java/org/apache/lucene/sandbox/queries/\nsvn move --parents lucene/contrib/queries/src/test/org/apache/lucene/search/* lucene/contrib/sandbox/src/test/org/apache/lucene/sandbox/queries/\nsvn move modules/queries/src/java/org/apache/lucene/queries/DuplicateFilter.java lucene/contrib/sandbox/src/java/org/apache/lucene/sandbox/queries/DuplicateFilter.java\nsvn move modules/queries/src/test/org/apache/lucene/queries/DuplicateFilterTest.java lucene/contrib/sandbox/src/test/org/apache/lucene/sandbox/queries/DuplicateFilterTest.java\nsvn move --parents lucene/contrib/queries/lib/* lucene/contrib/sandbox/lib/\nsvn delete dev-tools/idea/lucene/contrib/queries\nsvn delete dev-tools/maven/lucene/contrib/queries\nsvn delete lucene/contrib/queries\n\n ",
            "author": "Chris Male",
            "id": "comment-13086988"
        },
        {
            "date": "2011-08-18T14:20:29+0000",
            "content": "\nIt's more nuanced than averaging IDF of variants (as discussed at length in LUCENE-329).\n\nMark, yeah but when the term exists providing term B term A's docfreq is trivial.\n\nthe averaging is the part thats a pain in the ass with a TopTermsRewrite  ",
            "author": "Robert Muir",
            "id": "comment-13087027"
        },
        {
            "date": "2011-08-20T04:58:31+0000",
            "content": "Committed revision 1159846. ",
            "author": "Chris Male",
            "id": "comment-13088130"
        }
    ]
}