{
    "id": "LUCENE-2368",
    "title": "stopword files should be versioned; acessor for default(s) should take a Version property",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "2.9.3,                                            3.0.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The existing language specific stopword files on the trunk have no version info in their filenames – this will make it awkward/confusing to update them as time goes on.  LIkewise, many classes have a \"getDefaultStopSet()\" which makes these methods (when called by client code) suffer from the same API back-compat issues that the Analyzers themselves did before we added Version.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-04-06T01:45:05+0000",
            "content": "Yes, we should just go ahead and do this now to prevent future confusion and heartache.\n\nBefore this version there were only 3 stopwords lists as files in lucene, (ar, fa, smartcn). \nI wonder if we should just break now (by renaming these 3) and version all the files so its clean. ",
            "author": "Robert Muir",
            "id": "comment-12853686"
        },
        {
            "date": "2010-04-06T01:47:27+0000",
            "content": "This is something i brought up with Robert on IRC a few days ago, and forgot to file an issue for...\n\n\n\tWe should make all the langauge specific stopword files have something in their name that identifies them so we can add newer versions of them over time with distiguished names.  The simplest convention moving forward would probably be to name the file after the first Lucene version it was added in (ie: \"russian_stop_3_3.txt\") but there is no reason why the names have to directly corrispond to the Lucene Version – they could just as easily have completely sequential names (ie: \"russian_stop_001.txt\" or \"russian_stop_AAA.txt\").\n\n\n\n\n\tAll of the static \"getDefaultStopSet()\" methods in all of the various Analyzers should be changed to take in a Version param which picks the appropriate file (or staticly compiled set) based on the param.  Any Analyzer that already has Version based stopword switching logic in it's constructor should instead just delegate to the getDefaultStopSet() method.\n\n\n ",
            "author": "Hoss Man",
            "id": "comment-12853688"
        },
        {
            "date": "2010-04-06T01:50:26+0000",
            "content": "I wonder if we should just break now (by renaming these 3) and version all the files so its clean.\n\nI didn't realize we even had those.\n\nThe other option is to not rename any of the files, but clearly document what the naming convention is coming forward – as i mentioned in the comment i just added (with more details beyond the summary description) the names don't have to match Lucene Version semantics ... they just have to be something that is unique moving forward.  Specificly: we should never modify the contents of the files, we should just add a new file and \"deprecate\" the old file.\n\nbut the naming convention could easily be...\n\nstopwords_esperanto.txt\nstopwords_esperanto_2.txt\nstopwords_esperanto_3.txt\n...\n ",
            "author": "Hoss Man",
            "id": "comment-12853691"
        }
    ]
}