{
    "id": "LUCENE-7977",
    "title": "LUCENE-7951 broke the maven build",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Cannot Reproduce",
        "affect_versions": "7.1,                                            master (8.0)",
        "status": "Closed",
        "type": "Bug",
        "components": [
            "modules/spatial-extras",
            "modules/spatial3d"
        ],
        "fix_versions": []
    },
    "description": "Trying to build Lucene/Solr using maven currently fails on branch_7x and master.  The spatial-extras module has a dependency on test code from spatial-3d, but the spatial-3d module doesn't produce a test-jar.\n\nant handles this implicitly by allowing the modules to add specific directories to classpaths, but maven requires that all dependent code is in a jar.\n\nI have a patch which I will upload.",
    "attachments": {
        "LUCENE-7977.patch": "https://issues.apache.org/jira/secure/attachment/12889058/LUCENE-7977.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16180656",
            "date": "2017-09-26T12:09:16+0000",
            "content": "This is a patch against master, but it applies cleanly to branch_7x as well.\nThe fix is actually for the spatial3d module to make it build a test-jar. ",
            "author": "Daniel Collins"
        },
        {
            "id": "comment-16180660",
            "date": "2017-09-26T12:13:33+0000",
            "content": "Looks like SOLR-11382 actually had an update to fix this.  Do we mark as a duplicate or just withdraw? ",
            "author": "Daniel Collins"
        },
        {
            "id": "comment-16180793",
            "date": "2017-09-26T13:50:24+0000",
            "content": "Looks like SOLR-11382 actually had an update to fix this.\n\nYeah, I committed the fix with a comment linking to SOLR-11382 without realizing it would have been more appropriately tied to LUCENE-7951.\n\nDo we mark as a duplicate or just withdraw?\n\nI don't think I would mark it as duplicate, since it doesn't actually duplicate (the entirety of) either of the other two issues.  But if you feel differently, I don't think it will hurt to mark it as such. ",
            "author": "Steve Rowe"
        },
        {
            "id": "comment-16180889",
            "date": "2017-09-26T14:57:42+0000",
            "content": "SOLR-11382 had a subsequent fix to correct this, both master and branch_7x are good now. ",
            "author": "Daniel Collins"
        }
    ]
}