{
    "id": "LUCENE-5000",
    "title": "Query serialization using ObjectInput/OutputStream",
    "details": {
        "components": [
            "core/search"
        ],
        "fix_versions": [],
        "affect_versions": "4.3",
        "priority": "Trivial",
        "labels": "",
        "type": "New Feature",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Reads and writes queries on ObjectInput/OutputStream.\n\nNo support for ConstantScoreQuery (no serialization for Filter) nor PayloadNearQuery and PayloadTermQuery (no serialization for PayloadFunction).\n\nI might have missed to implement support for some core Queries. Currently supported are: TermQuery, BooleanQuery, WildcardQuery, PhraseQuery, MultiPhraseQuery, FuzzyQuery, RegexpQuery, TermRangeQuery, NumericRangeQuery, DisjunctionMaxQuery, MatchAllDocsQuery, SpanTermQuery, SpanMultiTermQueryWrapper, SpanNearQuery, SpanNotQuery, SpanOrQuery, FieldMaskingSpanQuery, SpanFirstQuery, SpanPositionRangeQuery, SpanPayloadCheckQuery and SpanNearPayloadCheckQuery.\n\nUsers are allowed to implement and register strategies for their own queries.\n\n\nThis will not allow you to serialize any object graph with aggregated Query instances e.g. Map<String, Query>, that would require a new implementation of ObjectOutputStream (one could base that on the GPL2 code from OpenJDK) or instrument the existing implementations to handle Query in private writeObjectA and similar methods.\n\nThere's a bit of reflection glue in this code in order to read private fields in query implementation. Not too happy about that, but not much to do unless one is to expose a bunch of new getters in all those classes.\n\nThe class is places in o.a.l.search in order to access package visible fields without getters. If moving to another package this would have to be handled using reflection as with above mentioned private fields.",
    "attachments": {
        "LuceneQuerySerializer.java": "https://issues.apache.org/jira/secure/attachment/12583154/LuceneQuerySerializer.java",
        "TestLuceneQuerySerializer.java": "https://issues.apache.org/jira/secure/attachment/12583155/TestLuceneQuerySerializer.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-05-14T17:12:26+0000",
            "content": "Code blessed with ASL2 ",
            "author": "Karl Wettin",
            "id": "comment-13657217"
        },
        {
            "date": "2013-05-14T17:31:19+0000",
            "content": "good to see you around karl!  ",
            "author": "Simon Willnauer",
            "id": "comment-13657247"
        },
        {
            "date": "2014-02-18T12:51:39+0000",
            "content": "Hi Karl, I picked up your patch and have been testing it with Lucene 4.3.1.  It works perfectly, and I'd love to see it committed.  Thank you! ",
            "author": "Greg Visotski",
            "id": "comment-13904010"
        }
    ]
}