{
    "id": "LUCENE-5590",
    "title": "remove .zip binary artifacts",
    "details": {
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "It is enough to release this as .tgz",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13965464",
            "author": "Shawn Heisey",
            "content": "There is no support in a completely vanilla Windows system for extracting a tarfile, gzipped or not.  It requires installing additional software, and some people work in tightly controlled environments where they cannot install anything.  For people who work in that kind of environment, getting a piece of software approved is a process that may take months, and if they are caught subverting security mechanisms to use an unapproved program, their employment could be terminated. ",
            "date": "2014-04-10T15:44:59+0000"
        },
        {
            "id": "comment-13965475",
            "author": "Robert Muir",
            "content": "I dont think this argument applies: you already cannot use this software on a completely vanilla windows system etc. You must at least install a JVM to do anything with it. ",
            "date": "2014-04-10T15:50:18+0000"
        },
        {
            "id": "comment-13965524",
            "author": "Shawn Heisey",
            "content": "Someone who is interested in evaluating Solr and is on a Windows machine is likely to simply move on to another solution like ElasticSearch if they cannot find a .zip download.  Or were you just talking about Lucene itself?\n\nI personally will be OK.  I don't run actual indexes (Solr) on Windows, but I download the .zip fairly frequently because my own computer where I do development work runs Windows 7.  I know what to do, and I don't have any restrictions on what I can install.  There will be people who look at a .tgz and have no idea what to do with it, and others who will be unable to install the required software. ",
            "date": "2014-04-10T16:47:36+0000"
        },
        {
            "id": "comment-13965548",
            "author": "Michael McCandless",
            "content": "Maybe we should ship the .zip and not the .tgz?  Is .zip more \"universal\"?  The .zip compression is a bit worse ... ~16% larger with the 4.7.1 release. ",
            "date": "2014-04-10T17:09:34+0000"
        },
        {
            "id": "comment-13965558",
            "author": "Shawn Heisey",
            "content": "If it came to an official vote, mine would be -0.  I don't oppose this strongly enough to block it, I just think it's a bad idea. ",
            "date": "2014-04-10T17:17:15+0000"
        },
        {
            "id": "comment-13965561",
            "author": "Shawn Heisey",
            "content": "Maybe we should ship the .zip and not the .tgz?\n\nThis might work.  'unzip' is a standard program on every *NIX machine that I use regularly. ",
            "date": "2014-04-10T17:20:13+0000"
        },
        {
            "id": "comment-13965597",
            "author": "Robert Muir",
            "content": "the current artifacts are 600MB in size. This is an easy way to attack this problem.\n\nMaybe i shouldnt have described the issue as \"removing\" something (since its not a mandatory part of an apache release), instead as \"don't create convenience binaries twice\". ",
            "date": "2014-04-10T17:43:32+0000"
        },
        {
            "id": "comment-13965645",
            "author": "Robert Muir",
            "content": "\n The .zip compression is a bit worse ... ~16% larger with the 4.7.1 release.\n\nit seems to already be set optimally, i set it to level 9 and got essentially the same size binary package. ",
            "date": "2014-04-10T18:18:28+0000"
        },
        {
            "id": "comment-13965902",
            "author": "Upayavira",
            "content": "What is the problem that this is attempting to solve? It seems that providing tgz and zip distributions is maximising our ability to help our users.\n\nUnless there is a really good reason to change what we do, then this seems like a sure-fire way to annoy one half of our users. ",
            "date": "2014-04-10T21:49:15+0000"
        },
        {
            "id": "comment-13965917",
            "author": "Robert Muir",
            "content": "I think its adequately described in the parent issue. Our release process generates 600MB of \"stuff\". The size just keeps getting bigger and bigger, and is already difficult to work with (e.g. upload across the internet).\n\nA lot of the size is duplication: the source code is released two ways, once as a tar.gz, also as maven. the .class files are released three ways (two binary formats, then maven). the javadocs are generate and added to the binary distributions (then multiplied twice again, for .tar.gz and .zip), as well as being generated for maven. \n\nIt would be nice if the release was a reasonable size. I don't understand how zip is helping any user. If a user does not know what to do with a .tgz, i do not think I can help them! ",
            "date": "2014-04-10T22:01:20+0000"
        },
        {
            "id": "comment-13965928",
            "author": "Upayavira",
            "content": "I regularly run training courses. I regularly come across delegates who cannot handle tarballs. If tgz was the only form available, I would have to rezip it, and distribute it as a zip file.\n\nIf the issue is the upload time, then we should talk to infra to work out a way to get the zipping work of your own laptops. That'd seem to me a better resolution. ",
            "date": "2014-04-10T22:18:24+0000"
        },
        {
            "id": "comment-13965943",
            "author": "Robert Muir",
            "content": "Training for lucene users who really need a binary dist, not from maven, not the src release, and don't what a tgz is?\n\nI do not care about such users, I don't think they exist. ",
            "date": "2014-04-10T22:38:14+0000"
        },
        {
            "id": "comment-13965956",
            "author": "Anshum Gupta",
            "content": "I think Upayavira is referring to training for 'Solr' users. Let's not add a step for the section of users who're on Windows and just trying to evaluate/get started with Solr. ",
            "date": "2014-04-10T22:49:28+0000"
        },
        {
            "id": "comment-13965989",
            "author": "Robert Muir",
            "content": "Well if its useful for Solr, then keep it there?\n\nBut I see no need for the 72MB lucene zip. ",
            "date": "2014-04-10T23:23:16+0000"
        },
        {
            "id": "comment-13966051",
            "author": "Upayavira",
            "content": "I agree with Anshum. Regarding Lucene zip, I have no opinion. ",
            "date": "2014-04-11T00:14:27+0000"
        },
        {
            "id": "comment-13966534",
            "author": "Mark Miller",
            "content": "If we need Solr to ship a zip, let's stop shipping a tgz then.\n\nIt's really silly to compress in two different ways when any system can uncompress either. ",
            "date": "2014-04-11T14:03:52+0000"
        },
        {
            "id": "comment-13966588",
            "author": "Yonik Seeley",
            "content": "IIRC, the zip and tgz don't result in identical installs.\n\n\tThe official ZIP format does not support file permissions.  Info-ZIP supports with extensions (and ANT supports the same), but not all clients do?\n\tText files have windows line endings\n\n ",
            "date": "2014-04-11T14:43:06+0000"
        }
    ]
}