{
    "id": "LUCENE-7764",
    "title": "Add FindBugs analysis to precommit",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Sub-task",
        "components": [
            "general/build"
        ],
        "fix_versions": []
    },
    "description": "",
    "attachments": {
        "LUCENE-7764.patch": "https://issues.apache.org/jira/secure/attachment/12861618/LUCENE-7764.patch",
        "LUCENE-7764-ivy.patch": "https://issues.apache.org/jira/secure/attachment/12871626/LUCENE-7764-ivy.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15952598",
            "date": "2017-04-02T08:51:27+0000",
            "content": "The attached patch adds Findbugs analysis to precommit. All bugs present at the time of patch generation were added to exclusion filter, so precommit will only fail the build on newly introduced bugs.\n\nThe list of exclusions was autogenerated by ant findbugs-exclude that creates exclusion list based on the current issues.\n\nThe patch also adds ant findbugs target, which generates a HTML file containing all current bugs (no exclusions) under build/findbugs/lucene.html. ",
            "author": "Daniel Jelinski"
        },
        {
            "id": "comment-16039125",
            "date": "2017-06-06T15:50:03+0000",
            "content": "Attaching patch fragment to declare the findbugs dependency and version via ivy.xml and ivy-versions.properties. It downloads the jar to my local ivy cache but beyond that I haven't yet really tried to use it or to combine it with the current patch here.\n\nIs lucene/tools/ivy.xml the correct place to declare the dependency? ",
            "author": "Christine Poerschke"
        },
        {
            "id": "comment-16039161",
            "date": "2017-06-06T16:06:33+0000",
            "content": "Is lucene/tools/ivy.xml the correct place to declare the dependency?\n\nBuild tools generally don't get entries in ivy.xml and ivy-versions.properties.  See e.g. -install-jflex, resolve-groovy, -install-forbidden-apis in lucene/common-build.xml. ",
            "author": "Steve Rowe"
        },
        {
            "id": "comment-16039208",
            "date": "2017-06-06T16:32:18+0000",
            "content": "I think the original patch by Daniel declares findbugs like the other tools in common-build. I had not yet looked at the whole setup, but the fragments look correct. We may at some point in the future move the ANT build tools to a separate IVY file, but the \"tools\" one is for stuff the tools require to compile.\n\nIn addition, the build tools don't need to have License checks, so we don't want the JAR files anywhere in the build tree. According to ASF licensing information, we don't require build tools to be ASF licensed. We had several discussions about this already (svnkit had a crazy, non-ASF compatible license), but we were allowed to use it. ",
            "author": "Uwe Schindler"
        }
    ]
}