{
    "id": "LUCENE-3910",
    "title": "remove special hudson nightly linedocs",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA",
            "4.1"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Hudson has a special huge linedocs file that it sets via a -D parameter,\nbut this means that anything using LineDocs won't reproduce via our home\ncomputers if it fails on hudson.\n\nI think we should disable this.",
    "attachments": {
        "LUCENE-3910.patch": "https://issues.apache.org/jira/secure/attachment/12525666/LUCENE-3910.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-03-25T16:56:14+0000",
            "content": "This one is controversial (at least Mike and I don't agree):\n\nits a reproducibility versus coverage thing.\n\nI'm gonna unset 3.6 because the problem already exists in other\n3.x releases, and it only affects nightly builds: for end users\nthere is no concern. ",
            "author": "Robert Muir",
            "id": "comment-13237925"
        },
        {
            "date": "2012-03-25T18:45:13+0000",
            "content": "I agree with you both. No, it's not a paradox. On one hand – I agree that having larger test files is good and on the other I agree with Robert that not being able to reproduce locally because of different (or inconsistent) data is a pain.\n\nAt Carrot Search we have put all the \"big data\" into a separate git repository and this is simply mirrored across build servers and our local machines. Granted, the first clone takes a while, but then pulls of additional data are much faster and (which is a big plus) git repo has an md5 of the revision so this can be emitted as a log upon failure (we don't do it because we're pretty much sure the checkouts are consistent, but it could be done to ensure testing against exact same test files).\n\nJust thoughts to consider.\n ",
            "author": "Dawid Weiss",
            "id": "comment-13237944"
        },
        {
            "date": "2012-05-04T10:43:01+0000",
            "content": "If we are going to keep this large file, local reproducibility needs to be made easier.\n\nCurrently, if something fails in the nightly build, nobody fixes it because of this problem:\nI know i wont go wasting my time with tests that dont reproduce!\n\nIf we arent going to do this we should disable the linedocs (I will do this in 72 hours,\nif the situation isnt improved)\n\nThere is absolutely no point of finding test fails that no one will debug because its too hard. ",
            "author": "Robert Muir",
            "id": "comment-13268252"
        },
        {
            "date": "2012-05-04T12:38:34+0000",
            "content": "If we are going to keep this large file, local reproducibility needs to be made easier.\n\n+1\n\nI think, first, we should add -Dtests.linedocsfile=XXX to the \"reproduce line\", when that was passed to 'ant test'.\n\nSecond, I think we should put the nightly line file somewhere \"accessible\".  It's currently at http://people.apache.org/~mikemccand/enwiki.random.lines.txt ...\n\nMaybe we can have an ant target, or ivy, to pull down a copy to your local area?  I also like Dawid's idea to have a separate \"big test data\" repository somewhere... ",
            "author": "Michael McCandless",
            "id": "comment-13268297"
        },
        {
            "date": "2012-05-04T12:48:59+0000",
            "content": "\nI also like Dawid's idea to have a separate \"big test data\" repository somewhere...\n\n+1 for some better separation here. Source release and svn checkouts are bloated because of \nall this test data.\nE.g. linefile data is over 5MB, snowball test data is over 3MB, ...\n\nMaybe we should separate this out in svn? its \"artifact\" is a .jar file\nwith all these huge files in the appropriate places or something?\n\nSo basically we could sucker this thing down with ivy and put it in the classpath like\nany other dependency.\n\nThe problems that make it hard though, are versioning and \"releasing\" this thing:\n\n\tif its outside of dev/ SVN that makes versioning the testdata wrt different releases/branches hard.\n  this could easily get annoying and complicated.\n\twhere would we put the resulting \"jar\" to download via ivy? I dont think we should be downloading\n  this from SVN, since our source releases would actually have this as a test dependency.\n\n ",
            "author": "Robert Muir",
            "id": "comment-13268305"
        },
        {
            "date": "2012-05-04T19:20:20+0000",
            "content": "Trivial patch that adds -Dtests.linedocsfile=XXX to the \"reproduce with\" line. ",
            "author": "Michael McCandless",
            "id": "comment-13268640"
        },
        {
            "date": "2012-05-04T19:38:13+0000",
            "content": "Maybe as a baby step (before we figure out how to hold/release test data in a separate repository)... we can add ant/ivy sugar to pull down the nightly line docs file from p.a.o?\n\nWe can then eg improve the patch I put up to give instructions to run that... ",
            "author": "Michael McCandless",
            "id": "comment-13268659"
        },
        {
            "date": "2012-05-07T10:30:07+0000",
            "content": "Improved patch adding the baby step: a new ant target \"get-jenkins-line-docs\", and an additional NOTE on a test failure that you can use this target to download the large line docs file.\n\nI think it's ready... ",
            "author": "Michael McCandless",
            "id": "comment-13269502"
        },
        {
            "date": "2013-05-10T10:32:49+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13653736"
        }
    ]
}