{
    "id": "LUCENE-7021",
    "title": "buildAndPushRelease.py should ensure you have no unpushed git changes",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "I'm just a git newbie so I'm not sure how to add this to our release scripts, but I think it's quite important that we don't up and release something the world containing changes I had only committed locally and then failed to push.  What if I then remove that directory after we've released?\n\nWe should also fix the release smoke tester to confirm the git revision is known ... I'll open a separate issue for that.\n\nI'm trying to be super careful not to do this for 5.5.0, but really the release script should catch this.\n\nI did a bit of googling and found the magic command git cherry -v origin/branch_5_5 seemed to work (at least, it showed my one local commit), but e.g. \"origin\" is just a label I use (others use \"upstream\"), etc., so I'm not sure how to reliably do this... maybe we have to run git remote -v and figure out what label use use for the \"official\" (wip) Apache git instance?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15142997",
            "author": "Michael McCandless",
            "date": "2016-02-11T16:41:43+0000",
            "content": "I opened LUCENE-7022 for the same fix to the smoke tester. "
        },
        {
            "id": "comment-15143028",
            "author": "Dawid Weiss",
            "date": "2016-02-11T16:56:35+0000",
            "content": "> maybe we have to run git remote -v and figure out what label use use for the \"official\" (wip) Apache git instance?\n\nDoesn't matter what the remote is – the commit hash says it all (it will be the same regardless of the origin of the commit tree). "
        },
        {
            "id": "comment-15143111",
            "author": "Alan Woodward",
            "date": "2016-02-11T17:31:05+0000",
            "content": "The output of git status should tell you if you're up-to-date or ahead of your remote tracking branch.  eg:\n{{\n$ git status\nOn branch master\nYour branch is up-to-date with 'origin/master'.\nnothing to commit, working directory clean\n}} "
        }
    ]
}