{
    "id": "LUCENE-4590",
    "title": "WriteEnwikiLineDoc which writes Wikipedia category pages to a separate file",
    "details": {
        "components": [
            "modules/benchmark"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "New Feature",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "It may be convenient to split Wikipedia's line file into two separate files: category-pages and non-category ones. \nIt is possible to split the original line file with grep or such.\nIt is more efficient to do it in advance.",
    "attachments": {
        "LUCENE-4590.patch": "https://issues.apache.org/jira/secure/attachment/12559642/LUCENE-4590.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-12-06T08:59:49+0000",
            "content": "Do you think perhaps that EnwikiContentSource should let the caller know whether the returned DocData represents a content page or category page? In general, for text indexing benchmarks, I don't think that indexing the category pages adds much value, because they are very short and will often not come back as a result to any query. Rather, their content seems to represent the Wikipedia's taxonomy.\n\nSo maybe, if someone wants to generate a line file from the pages only, EnwikiContentSource can support filtering out category pages entirely. That will allow the flexibility that I think you are trying to achieve:\n\n\n\tIf discardCategories = true, WriteLineDocTask will write just the content pages. Otherwise, it will write both.\n\tWriteEnwikiLineDocTask will detect the page type from a specialized DocData and know easily to which file to write it.\n\n ",
            "author": "Shai Erera",
            "id": "comment-13511251"
        },
        {
            "date": "2012-12-06T09:12:51+0000",
            "content": "Do you think perhaps that EnwikiContentSource should let the caller know whether the returned DocData represents a content page or category page?\n\nThat's what I planned at start, but decided to leave WriteLineDoc intact because it is general, that is, not aware of the unique structure of Wikipedia data, where some of the pages represent categories.\n\nSo maybe, if someone wants to generate a line file from the pages only... flexibility that I think you are trying to achieve...\n\nActually I am after the two files...  These category pages are (unique) taxonomy node names, but without the taxonomy structure, which can be deduced from the (parent) categories of the category pages. Having this separate category pages can be useful for deducing that taxonomy. ",
            "author": "Doron Cohen",
            "id": "comment-13511262"
        },
        {
            "date": "2012-12-06T09:21:17+0000",
            "content": "That's what I planned at start, but decided to leave WriteLineDoc intact because it is general, that is, not aware of the unique structure of Wikipedia data, where some of the pages represent categories.\n\nI think that you misunderstood me, or I wasn't clear enough. WriteLineDoc would not change, EnwikiContentSource would. If someone is interested in creating a line file over all Wikipedia pages, he'll put in his .alg something like content.source=EnwikiContentSource and enwiki.source.exclude.categories=false, otherwise enwiki.source.exclude.categories=true. WriteLineDocTask would still write the DocData that the source writes.\n\nEnwikiContentSource will return either DocData or CategoryDocData, or a single object EnwikiDocData with an extra boolean isCategory. WriteLineDoc will still read just the DocData fields it knows about. WriteEnwikiLineDoc will write the DocData to the relevant file, per isCategory.\n\nActually I am after the two files\n\nI know . I don't propose anything different, just discussing how the code could be designed to achieve that, and as a bonus, allow someone to exclude from regular benchmarks the category pages. ",
            "author": "Shai Erera",
            "id": "comment-13511264"
        },
        {
            "date": "2012-12-06T21:36:36+0000",
            "content": "Now I see what you mean. Spooky, it is as if you were looking into the patch I did not post here.. How did you know I chose not to modify EnwikiConentSource...\n\nI agree that if someone wishes to index just the non-category pages, the new WriteEnwikiLineDoc would create the category pages file for no use. Also, if indexing is conducted straight away, not through a line file first, categories will be indexed. But then anyone could check the title and decide not to index those docs. So I see the advantage, just not tempted to add this at the moment, but it can be added. ",
            "author": "Doron Cohen",
            "id": "comment-13514649"
        },
        {
            "date": "2012-12-06T21:59:51+0000",
            "content": "Patch with the new task and a test. ",
            "author": "Doron Cohen",
            "id": "comment-13525799"
        },
        {
            "date": "2012-12-09T09:28:08+0000",
            "content": "[trunk commit] Doron Cohen\nhttp://svn.apache.org/viewvc?view=revision&revision=1418852\n\nLUCENE-4590: Added WriteEnwikiLineDocTask.\n\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527381"
        },
        {
            "date": "2012-12-09T13:52:08+0000",
            "content": "[branch_4x commit] Doron Cohen\nhttp://svn.apache.org/viewvc?view=revision&revision=1418955\n\nLUCENE-4590: Merge from trunk: Add WriteEnwikiLineDoc which writes Wikipedia category pages to a separate file.\n\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527463"
        },
        {
            "date": "2012-12-09T13:53:38+0000",
            "content": "Done. ",
            "author": "Doron Cohen",
            "id": "comment-13527466"
        },
        {
            "date": "2012-12-10T09:59:08+0000",
            "content": "Reopen issue for making the categories file name method public: categoriesLineFile() so that it can easily be modified in the future without breaking apps logic. ",
            "author": "Doron Cohen",
            "id": "comment-13527821"
        },
        {
            "date": "2012-12-10T10:14:07+0000",
            "content": "[trunk commit] Doron Cohen\nhttp://svn.apache.org/viewvc?view=revision&revision=1419317\n\nLUCENE-4590: WriteEnwikiLineDoc \"trailing change\": make categoriesLineFile(File) public.\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527833"
        },
        {
            "date": "2012-12-10T10:22:07+0000",
            "content": "[branch_4x commit] Doron Cohen\nhttp://svn.apache.org/viewvc?view=revision&revision=1419323\n\nLUCENE-4590: WriteEnwikiLineDoc \"trailing change\": make categoriesLineFile(File) public.\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527856"
        },
        {
            "date": "2012-12-10T10:51:59+0000",
            "content": "done. ",
            "author": "Doron Cohen",
            "id": "comment-13527869"
        },
        {
            "date": "2013-03-22T16:10:48+0000",
            "content": "[branch_4x commit] Doron Cohen\nhttp://svn.apache.org/viewvc?view=revision&revision=1418955\n\nLUCENE-4590: Merge from trunk: Add WriteEnwikiLineDoc which writes Wikipedia category pages to a separate file.\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13610447"
        }
    ]
}