{
    "id": "LUCENE-2216",
    "title": "OpenBitSet#hashCode() may return false for identical sets.",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/other"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.9.4",
            "3.0.3"
        ],
        "affect_versions": "2.9,                                            2.9.1,                                            3.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "OpenBitSet uses an internal buffer of long variables to store set bits and an additional 'wlen' index that points \nto the highest used component inside \n{@link #bits}\n buffer.\n\nUnlike in JDK, the wlen field is not continuously maintained (on clearing bits, for example). This leads to a situation when wlen may point\nfar beyond the last set bit. \n\nThe hashCode implementation iterates over all long components of the bits buffer, rotating the hash even for empty components. This is against the contract of hashCode-equals. The following test case illustrates this:\n\n\n// initialize two bitsets with different capacity (bits length).\nBitSet bs1 = new BitSet(200);\nBitSet bs2 = new BitSet(64);\n// set the same bit.\nbs1.set(3);\nbs2.set(3);\n        \n// equals returns true (passes).\nassertEquals(bs1, bs2);\n// hashCode returns false (against contract).\nassertEquals(bs1.hashCode(), bs2.hashCode());\n\n\n\nFix and test case attached.",
    "attachments": {
        "LUCENE-2216.patch": "https://issues.apache.org/jira/secure/attachment/12430511/LUCENE-2216.patch",
        "openbitset.patch": "https://issues.apache.org/jira/secure/attachment/12430504/openbitset.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-01-16T15:10:44+0000",
            "content": "Thanks Dawid!\n\nhashCode and equals probably shouldn't be modifying the state of the object though, right?\nIt's also not thread safe, so a lot of weird things could happen... the simplest example is that two threads could check that the last word is all zeros and both decrement wlen.\n\nI like the spirit of your change though, as it only adds to the cost of hashCode/equals (which are already very expensive with large bitsets and should be avoided if possible anyway). ",
            "author": "Yonik Seeley",
            "id": "comment-12801182"
        },
        {
            "date": "2010-01-16T15:14:59+0000",
            "content": "I haven't tested this patch, but this seems like a simple solution.  Start with a zero hashcode while iterating backward and the trailing zeros won't affect the hashcode. ",
            "author": "Yonik Seeley",
            "id": "comment-12801183"
        },
        {
            "date": "2010-01-16T15:43:35+0000",
            "content": "Hi Yonik,\n\nThis class is not thread-safe anyway (there are no memory barriers of any kind anywhere in the code).\n\nFrom a single-thread perspective, yes, you are modifying the internal state of this object, but it's not really affecting anything other than possibly speeding up further interaction with this object (any other operation no OpenBitSets is affected by the value inside wlen).\n\nYour patch also solves the issue, of course. I just don't see the point in not updating wlen since you're scanning through memory anyway... The implementation of OpenBitSet is different in this regard to java.util.BitSet, which always maintains the last non-empty index. I've been thinking about it a bit and there are pros and cons to both implementations, but lazily moving wlen when memory is scanned anyway seems like a better alternative than keeping wlen unnecessarily large (which affects ORs, ANDs and other set operations).\n\nTo me this implementation cannot be used in a multi-threaded application anyway, am I wrong here?\n\nD. ",
            "author": "Dawid Weiss",
            "id": "comment-12801195"
        },
        {
            "date": "2010-01-16T15:47:49+0000",
            "content": "Perhaps this is for another patch, but BitUtil contains several bit-counting methods (pop, ntz) that have been implemented in the JDK in the same way (Hacker's Delight) and will come with HotSpot intrinsics for the new Intels (http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=6823354). On the other hand, Lucene's implementation may be useful for folks with older VMs... ",
            "author": "Dawid Weiss",
            "id": "comment-12801198"
        },
        {
            "date": "2010-01-16T15:57:26+0000",
            "content": "To me this implementation cannot be used in a multi-threaded application anyway, am I wrong here?\n\nPretty much any mutable object may be safely shared with other threads after it's done being modified.  So one thread could create, and many threads could read.  I don't know how explicitly it's spelled out in Java, but hashCode and  equals shouldn't modify the object's state in any meaningful way. ",
            "author": "Yonik Seeley",
            "id": "comment-12801200"
        },
        {
            "date": "2010-01-16T16:59:18+0000",
            "content": "This is only true if there is happens-before between the reads and the modifications to the object. In any other case other threads may be reading stale values (i.e., from their own cache), at least if my understanding of the jmm is correct here. Whether you want to rely on such a deep semantics of interaction between threads is something to consider deeply, at least in my personal opinion. ",
            "author": "Dawid Weiss",
            "id": "comment-12801221"
        },
        {
            "date": "2010-01-16T17:25:35+0000",
            "content": "This is not entirely what I had in mind (it's not cache, but HotSpot optimisation), but similar situation applies (the value of the field that's never modified from the perspective of the current thread is never re-read).\n\n\npublic class Example10 {\n    private static Holder holder;\n\n    public static void startThread() {\n        new Thread() {\n            public void run() {\n                try { sleep(2000); } catch (Exception e) { /* ignore */ }\n                holder.ready = true;\n                System.out.println(\"Setting ready to true.\");\n            }\n        }.start();\n    }\n\n    public static void main(String [] args) {\n        holder = new Holder();\n        startThread();\n        while (!holder.ready) {\n            // Do nothing.\n        }\n        System.out.println(\"I'm ready.\");\n    }\n}\n\nclass Holder {\n    public boolean ready;\n}\n\n\n\nIf you run it with -server, it will (should... or does on two machines I own) deadlock. Client mode and interpreted mode are not optimized, so it passes. ",
            "author": "Dawid Weiss",
            "id": "comment-12801230"
        },
        {
            "date": "2010-01-16T17:34:43+0000",
            "content": "This is only true if there is happens-before between the reads and the modifications to the object. \n\nOf course... I said \"may be safely shared', not that any method one chooses to share it is correct.\nIt still seems that promoting hashCode and equals to mutating operations is wrong, no? ",
            "author": "Yonik Seeley",
            "id": "comment-12801235"
        },
        {
            "date": "2010-01-16T17:54:32+0000",
            "content": "uff, I started having doubts in my own understanding, thanks for being patient with me.\n\nI agree that having hashCode mutate the object's state is weird. I had some thoughts about it – this particular mutation seems to be \"safe\" even from multi-threaded point of view. If another thread sees a stale value of wlen, then the only thing that is going to happen is it will scan more memory; for ands, ors and other types of operations this will have no effect. So assuming hashCode/equals is the ONLY method you're calling concurrently, it shouldn't break things. A similar kind of trickery goes on in String#hashCode (caching to a non-volatile field), although that object is immutable, so it's a slightly different scenario.\n\nTo be honest, my preference for this would be to either maintain the wlen field during all operations (like java.util.BitSet) or at least to clearly state (JavaDoc?) that trimTrailingZeros() should be invoked prior to publishing the object for other threads for increased performance (in case you fiddle with bits and clear the tail). In the second options, your patch does a fine job of not mutating the object and correcting the bug.\n\nThanks for an interesting discussion. ",
            "author": "Dawid Weiss",
            "id": "comment-12801240"
        },
        {
            "date": "2010-01-16T18:31:36+0000",
            "content": "I agree that having hashCode mutate the object's state is weird. I had some thoughts about it - this particular mutation seems to be \"safe\" even from multi-threaded point of view. If another thread sees a stale value of wlen, then the only thing that is going to happen is it will scan more memory;\n\nThere are still quite a few things that can go wrong I think.  If all threads only called hashCode and equals, then you might be right... it's very specific to the implementation of trimTrailingZeros()\n\n   public void trimTrailingZeros() {\n    int idx = wlen-1;\n    while (idx>=0 && bits[idx]==0) idx--;\n    wlen = idx+1;\n  }\n\n\nWhat could make that work is the fact that wlen is an integer, is never directly used as the loop counter, or as an index into the array.\n\nBut the other big questions: are other read operations tolerant of wlen changing out from under them?  My guess would be no.\nLook at xorCount for example:\n\n    if (a.wlen < b.wlen) {\n      tot += BitUtil.pop_array(b.bits, a.wlen, b.wlen-a.wlen);\n\n\nhashCode and equals changing wlen could cause a negative value to be passed to pop_array.\n\nedit: deleted second example, which isn't different from the first (the issue is safety with other read ops). ",
            "author": "Yonik Seeley",
            "id": "comment-12801249"
        },
        {
            "date": "2010-01-16T20:05:08+0000",
            "content": "Chances of this happening are really slim (this would probably be a single inlined read as soon as the compilation takes place, but you're right in the general case. I am not arguing changing the object in hashCode is good – my argument is that ideally it should be fixed elsewhere (as in my previous suggestion – either updating wlen every time the tail changes, or make explicit changes to the documentation that inform about suboptimal performance for zero-tailed sets). ",
            "author": "Dawid Weiss",
            "id": "comment-12801263"
        },
        {
            "date": "2010-01-16T20:10:04+0000",
            "content": "For what it's worth, I checked the mentioned BitUtil methods – ntz/pop; the same implementation is included from Java 1.5 upward. Do you want me to file another patch for this, Yonik, or are we leaving this as-is? I'd redirect from BitUtil to Long/Integer, deprecate BitUtil methods and replace the places in the code where they are used. ",
            "author": "Dawid Weiss",
            "id": "comment-12801265"
        },
        {
            "date": "2010-01-16T20:23:45+0000",
            "content": "my argument is that ideally it should be fixed elsewhere\n\nThis is an expert-level class... I don't think that every call to clear() should be checking if it completely cleared the last word.  It's easy enough to call trimTrailingZeros after you did a bunch of modifications... but not so easy to regain the lost performance for the code doing redundant checking you didn't want. ",
            "author": "Yonik Seeley",
            "id": "comment-12801266"
        },
        {
            "date": "2010-01-16T20:38:46+0000",
            "content": "Ok, argument accepted. ",
            "author": "Dawid Weiss",
            "id": "comment-12801269"
        },
        {
            "date": "2010-01-16T20:42:31+0000",
            "content": "For what it's worth, I checked the mentioned BitUtil methods - ntz/pop; the same implementation is included from Java 1.5 upward.\n\nHuh - I didn't realize that Java5 had the same pop impl as I did... it will be cool if it finally starts using native POPCNT instructions.\n\nAs far as ntz, I went though a lot of micro-optimizations and different implementations before I settled on the one used in BitUtil, so it would be nice to do some benchmarks to see if it's truly faster now (and also what the performance difference is for users of JVMs before this optimization was implemented). ",
            "author": "Yonik Seeley",
            "id": "comment-12801270"
        },
        {
            "date": "2010-01-16T21:01:34+0000",
            "content": "Ah, ok – I thought ntz in BitUtils is the same as in hacker's delight, but it isn't. Microbenchmarks will always be misleading as they depend a lot on how you test, but I can do it out of sheer curiosity – will report tomorrow. ",
            "author": "Dawid Weiss",
            "id": "comment-12801272"
        },
        {
            "date": "2010-01-16T21:11:03+0000",
            "content": "Microbenchmarks will always be misleading as they depend a lot on how you test, but I can do it out of sheer curiosity - will report tomorrow.\n\nCool.  I'd recommend testing in the context of OpenBitSet (i.e. don't try testing ntz directly).\nPerhaps just create a large random set (~1M bits) with a certain percent of bits set, and then iterate over those set bits. ",
            "author": "Yonik Seeley",
            "id": "comment-12801275"
        },
        {
            "date": "2010-01-16T22:14:33+0000",
            "content": "Committed in trunk.  Thanks for bringing this up! ",
            "author": "Yonik Seeley",
            "id": "comment-12801285"
        },
        {
            "date": "2010-10-29T12:57:41+0000",
            "content": "reopening for possible 2.9.4/3.0.3 backport. ",
            "author": "Robert Muir",
            "id": "comment-12926252"
        },
        {
            "date": "2010-11-23T13:21:34+0000",
            "content": "Backported 3.0 revision: 1038096\nBackported 2.9 revision: 1038098 ",
            "author": "Uwe Schindler",
            "id": "comment-12934826"
        }
    ]
}