{
    "id": "LUCENE-2063",
    "title": "Use thread pool in ConcurrentMergeScheduler",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "2.9.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "Currently it looks like CMS creates a new thread object for each\nmerge, which may not be expensive anymore on Java5+ JVMs,\nhowever we can fairly simply implement the Java5 thread pooling.\nAlso I'm thinking we may be interested in using thread pools for\nother tasks in IndexWriter (such as LUCENE-2047 performing\ndeletes in the background).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2009-11-13T20:40:24+0000",
            "content": "One of the issues with this is that the code depends on Thread instead of Runnable / Callable. I have looked into this class too and figured that simply exchanging the merger threads with runnables would not work. \nA way of doing this is to subclass ExecutorService where we can expose the required functionality on a pooled basis.\nBeside this I'm not sure if there is any benefit performance / resource wise as merge threads are not needed as frequently as other threads. Threadpools make a lot of sense  once you use threads frequently but keeping those merge threads around might not be required. Not sure if this is really needed though.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12777645"
        },
        {
            "date": "2009-11-13T21:22:18+0000",
            "content": "Right, this isn't the highest priority, however try running the\nLUCENE-1313 and you'll see a lot of unique thread objects being\ncreated because of the small segment merges happening quickly on\nthe RAMDir. \n\nIt can also potentially be used for LUCENE-2047, or a follow on\nasync patch. ",
            "author": "Jason Rutherglen",
            "id": "comment-12777666"
        },
        {
            "date": "2011-01-24T21:12:14+0000",
            "content": "Sorry if this spam's things, however it's unlikely that I'll work on these. ",
            "author": "Jason Rutherglen",
            "id": "comment-12985989"
        }
    ]
}