{
    "id": "LUCENE-5556",
    "title": "buildAndPushRelease.py: scp to people.apache.org stalls during transfer",
    "details": {
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved",
        "components": [
            "general/build"
        ],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "When I first tried to build the first RC for 4.7.1 using dev-tools/scripts/buildAndPushRelease.py, after preparing both the Lucene and Solr releases, the scp command to transfer the Lucene release tarball to people.apache.org stalled after about 180MB had transferred out of 220MB.  After an hour or so, I kill -9'd the scp process and started over.  Thankfully, everything went smoothly the second go-around.\n\nBut I'd like to see if we can reduce the likelihood of this happening again.\n\nI did some searching for causes/solutions to this problem and came across this recommendation to use scp's -l option to limit bandwidth in order to prevent stalls: http://www.aixmind.com/?p=1371 - the recommendation there limits bandwidth to 1MB/sec (-l 8192 is 8192Kbit/sec = 8Mbit/sec = 1MB/sec).",
    "attachments": {
        "LUCENE-5556.patch": "https://issues.apache.org/jira/secure/attachment/12637094/LUCENE-5556.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13948067",
            "author": "Steve Rowe",
            "content": "Thankfully, everything went smoothly the second go-around.\n\nActually, I misspoke: the remote chmod command failed after successfully transferring the files.  Maybe we should retry that? ",
            "date": "2014-03-26T16:31:21+0000"
        },
        {
            "id": "comment-13948916",
            "author": "Steve Rowe",
            "content": "I tried some experiments with scp (including with the -l 8192 option), disconnecting my ethernet cable to force a connection loss.  scp didn't fail after 5 minutes or so, but on reconnecting the cable, scp did not resume the transfer, and did not fail either.\n\nHowever, under the same conditions, rsync is capable of resuming transfers.   rsync can also display progress, which is nice. \n\nI'd like to replace scp with rsync in buildAndPushRelease.py.\n\nThe attached patch (against trunk) does this, and also retries remote operations, including file transfers, when they fail.\n\nI'm testing this patch now. An rsync file transfer stalled for some reason, and when I typed Ctrl-C in the terminal running buildAndPushRelease.py, a retry was triggered for the file transfer. \n\nrsync is also capable of resuming partial transfers, though in my testing the option to do so doesn't work unless the target file already exists.  The patch performs a remote touch target-file to bring it into existence first if necessary. ",
            "date": "2014-03-27T05:30:57+0000"
        }
    ]
}