{
    "id": "LUCENE-8409",
    "title": "Cannot delete individual fields from index",
    "details": {
        "components": [],
        "status": "Open",
        "resolution": "Unresolved",
        "fix_versions": [],
        "affect_versions": "None",
        "labels": "",
        "priority": "Major",
        "type": "Bug"
    },
    "description": "This is based upon the following tickets:\n\nhttps://issues.apache.org/jira/browse/SOLR-12185\n\nhttps://issues.apache.org/jira/browse/LUCENE-8235\n\nI'd like a way to be able to clear and recreate a specific field so I don't have to completely reindex if I change a field type.\n\nIt's a real pain if you change a specific field from single valued to multivalued, you have to delete the entire index from disk and start from scratch.\n\nAs being able to modify a field is not an intended feature, It'd be preferable if a field could be at least deleted and recreated to deal with this scenario.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16547308",
            "author": "Erick Erickson",
            "content": "Hmm, we already have UnInvertingblahblah, I wonder if it could be extended? ",
            "date": "2018-07-18T02:33:36+0000"
        },
        {
            "id": "comment-16547319",
            "author": "Alexandre Rafalovitch",
            "content": "I seem to remember the discussion about doing segment-by-segment rewrite with some sort of filtered reader that would clear the remove fields in process. But I cannot find the discussion of whether it was fully relevant.\n\nBut yes I agree that it is quite problematic in terms of index evolution. ",
            "date": "2018-07-18T02:57:05+0000"
        },
        {
            "id": "comment-16547619",
            "author": "Michael McCandless",
            "content": "You should be able to make a FilterDirectoryReader that \"pretends\" your single valued field was in fact multi valued, then wrap that in SlowCodecReaderWrapper then pass that to IndexWriter.addIndexes?  It will be quite costly though, since it's a full rewrite of the index. ",
            "date": "2018-07-18T09:44:52+0000"
        }
    ]
}