{
    "id": "LUCENE-1754",
    "title": "Get rid of NonMatchingScorer from BooleanScorer2",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Over in LUCENE-1614 Mike has made a comment about removing NonMatchinScorer from BS2, and return null in BooleanWeight.scorer(). I've checked and this can be easily done, so I'm going to post a patch shortly. For reference: https://issues.apache.org/jira/browse/LUCENE-1614?focusedCommentId=12715064&page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#action_12715064.\n\nI've marked the issue as 2.9 just because it's small, and kind of related to all the search enhancements done for 2.9.",
    "attachments": {
        "LUCENE-1754-2.patch": "https://issues.apache.org/jira/secure/attachment/12414604/LUCENE-1754-2.patch",
        "LUCENE-1754.patch": "https://issues.apache.org/jira/secure/attachment/12414003/LUCENE-1754.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-07-20T07:00:15+0000",
            "content": "I thought it's going to be easy too soon .\n\nAfter I've made the changes, some tests in TestBooleanMinShouldMatch fail w/ NPE. That's because previously we always returned BS2, which used NonMatchingScorer internally, and now we return null. Therefore this looks like a back-compat issue, but not sure how serious it is. The reason is that BooleanWeight.scorer() already returns null today in some situations, therefore any code that calls BooleanWeight.scorer() directly should already check that it didn't get null. So I'm not sure if it's indeed back-compat problem or not.\n\nWhat do you think? ",
            "author": "Shai Erera",
            "id": "comment-12733145"
        },
        {
            "date": "2009-07-20T10:55:57+0000",
            "content": "It seems like Weight.scorer() in general is allowed to return null to indicate \"no docs will match\" (since some scorers do so, though others do not)?  Though that \"right\" wasn't spelled out anywhere in the javadocs as best I can tell.  So... I don't think this is really a back-compat break?\n\nI think we should allow this, and document it clearly, going forward (in QueryWeight.scorer)?\n\nI suppose we could fix the emulation of Weight on top of QueryWeight (QueryWeightWrapper) to return NonMatchingScorer if it gets null back from QueryWeight.scorer? ",
            "author": "Michael McCandless",
            "id": "comment-12733188"
        },
        {
            "date": "2009-07-20T12:31:26+0000",
            "content": "Patch which removes NonMatchingScorer, fixes tests and tag.\n\nI also agree this is not a back-compat change, since BooleanQuery returns null today already. I just fixed the test to check whether the scorer returned is not null.\n\nI don't think we should return NonMatchingScorer from QueryWeightWrapper, since it will hide the already returned null Scorer. I.e., I think that will cause some apps to break, since if previously they relied on null, now they will get an instance which if they'll call its score() or doc() methods will get UOE. ",
            "author": "Shai Erera",
            "id": "comment-12733208"
        },
        {
            "date": "2009-07-20T12:37:39+0000",
            "content": "It seems like Weight.scorer() in general is allowed to return null to indicate \"no docs will match\"\n\nHmmm, that's a bit of a surprise... I had thought one would always get a scorer instance back .  There's probably a lot of lurking bugs.\nSee ConstantScoreQuery.explain() for instance. ",
            "author": "Yonik Seeley",
            "id": "comment-12733209"
        },
        {
            "date": "2009-07-20T13:10:19+0000",
            "content": "See ConstantScoreQuery.explain() for instance.\n\nCSQ calls its own scorer(), therefore it knows it's going to get an instance back.\n\nIn general, BooleanQuery already returns null today, so all I was saying is that if someone called BQ.weight.scorer(), he had to check for null anyway. If he didn't then his app would be exposed? ",
            "author": "Shai Erera",
            "id": "comment-12733213"
        },
        {
            "date": "2009-07-20T18:54:09+0000",
            "content": "TermWeight.scorer returns null if the termDocs is null (though it looks like DirectoryIndexReader will never return null termDocs).\n\nPhraseQuery and MultiPhraseQuery return null scorer if they have 0 terms.\n\nA number of scorers check for null returns from their sub-scorers and then return null to their caller.  IndexSearcher also handles a null scorer.\n\nIt looks like null is already in general an accepted/possible return from Weight.scorer(). ",
            "author": "Michael McCandless",
            "id": "comment-12733315"
        },
        {
            "date": "2009-07-20T23:47:45+0000",
            "content": "Still surprising that scorer() can return null... I guess it's been a blind spot.\n\nAnother question - from QueryWrapperFilter:\n\n  public DocIdSet getDocIdSet(final IndexReader reader) throws IOException {\n    final QueryWeight weight = query.queryWeight(new IndexSearcher(reader));\n    return new DocIdSet() {\n      public DocIdSetIterator iterator() throws IOException {\n        return weight.scorer(reader, true, false);\n      }\n    };\n  }\n\n\n\nSo is it the case that DocIdSet.iterator() can also return null?  That's what this code does. ",
            "author": "Yonik Seeley",
            "id": "comment-12733402"
        },
        {
            "date": "2009-07-21T06:06:44+0000",
            "content": "That's a good point. IndexSearcher does not protect against this case (it only asserts the filter is not null, but not the DISI returned from it).\n\nI guess it's been a blind spot. \n\nI think that you're right. And more than that, we don't have unit tests that cover these cases (I believe there are some that cover a null Scorer, but not a null DISI). And I wonder how this hasn't come up until now. I mean, the examples Mike gave above do not sound way too extreme to me.\n\nSo does this mean we should document that scorer cannot be null? And if so, we make NonMatchingScorer public and recommend to return it if the query does not expect to return any documents? We can also make NMS not instantiable (is it a word?), with a static instance() method, but that's a minor thing.\n\nOr ... we leave everything as-is, and add some test cases which test this exactly, and change QueryWrapperFilter to return NMS in case the scorer returned by Weight is null.\n\nI think I prefer the first approach. ",
            "author": "Shai Erera",
            "id": "comment-12733493"
        },
        {
            "date": "2009-07-21T12:57:28+0000",
            "content": "If making NonMatchingScorer public, i suggest potentially implementing a NonMatchingQuery as well\n\nthis way, if a query has to rewrite() to null, it could return a NonMatchingQuery instead (which would protect against null pointer exceptions) ",
            "author": "Tim Smith",
            "id": "comment-12733605"
        },
        {
            "date": "2009-07-21T17:49:10+0000",
            "content": "So if we agree that scorer() cannot return null, I think that most of the patch can be reverted, and I'll change the scorer() impls which return null to return NMS instead?\n\nAbout NonMatchingQuery, I don't mind adding it, though why should a Query rewrite to null? ",
            "author": "Shai Erera",
            "id": "comment-12733748"
        },
        {
            "date": "2009-07-21T18:00:47+0000",
            "content": "So if we agree that scorer() cannot return null, I think that most of the patch can be reverted, and I'll change the scorer() impls which return null to return NMS instead? \n\nI haven't looked deeply into it, but at first blush that could simplify client code.\nNeed to watch out if there are any implementations of Weight.explain() that cast to a Specific type of scorer - hence one would get a cast exception if \"return null\" were blindly replaced with \"return NMS\". ",
            "author": "Yonik Seeley",
            "id": "comment-12733753"
        },
        {
            "date": "2009-07-21T18:04:09+0000",
            "content": "Here's a couple of use cases where a Query should rewrite to null/NonMatchingQuery (in my opinion):\n\n\tWildcard query that maps to 0 terms in the index\n\trange query that again maps to 0 terms in the index\n\tboolean query that has 0 clauses\n\tfilter based constant score query that has 0 docs in it\n\t(and thats just in the in the lucene tree, nothing to do with custom query implementations)\n\n\n\nMost of these situations would actually preempt needing to return null from a scorer, since the query would already have been rewritten to a NonMatchingQuery/null prior to asking for a scorer\n\nBooleanQuery could then also do instanceof checks on return from clause rewrite. If a NonMatchingQuery/null is returned for a required clause, the BooleanQuery itself can rewrite to NonMatchingQuery, also, if a prohibited clause rewrites to NonMatchingQuery/null, that clause can be removed entirely, if an optional clause rewrites to NonMatchingQUery/null, that clause can also be removed safely ",
            "author": "Tim Smith",
            "id": "comment-12733756"
        },
        {
            "date": "2009-07-21T18:07:15+0000",
            "content": "hence one would get a cast exception if \"return null\" were blindly replaced with \"return NMS\".\n\nSo this means that that someone is prepared to get a null Scorer right? So I'm confused - are you for returning null or not? Of course, something I just realized, returning null from scorer() does not break back-compat, while returning NMS does (or at least may).\n\nHow about if we fix QueryWrapperFilter to return NMS then? Or we document that Filter.getDocIdSet may return null, and fix IndexSearcher accordingly (this again is not a back-compat thing, while returning NMS is)? ",
            "author": "Shai Erera",
            "id": "comment-12733759"
        },
        {
            "date": "2009-07-21T18:10:13+0000",
            "content": "BooleanQuery could then also do instanceof checks on return from clause rewrite\n\nThat is a good point you raise. Actually today, BQ is quite efficient in that it compares to null. If we change scorer() to return NMS, we'd need to check instanceof which is way more expensive (we'd still need to check for null though, because we cannot enforce NMS).\n\nSo I think I'm still in favor of returning null ... or should I say - keep the currently not documented, but in effect, behavior. ",
            "author": "Shai Erera",
            "id": "comment-12733760"
        },
        {
            "date": "2009-07-22T15:22:03+0000",
            "content": "Any thoughts on that?\n\nIf we keep null, then I'll fix IndexSearcher to check whether filter.getDocIdSet did not return null. If it did, don't execute the query.\n\nI'd like to move on with this, if we have some sort of consensus. ",
            "author": "Shai Erera",
            "id": "comment-12734149"
        },
        {
            "date": "2009-07-22T15:29:42+0000",
            "content": "keeping null should be fine, as long as this is documented and all core query implementations handle this behavior, and all searcher code handles the null return properly\nat this point, NonMatchingScorer could be removed and null returned in its place (being package private, no one writing applications can make any assumptions on a NonMatchingScorer being returned)\n\nhowever, this should also be documented for the rewrite() method (currently this looks to always expect a non-null return value), also the searcher will throw null pointers if a null query is passed to it \n ",
            "author": "Tim Smith",
            "id": "comment-12734154"
        },
        {
            "date": "2009-07-22T15:50:02+0000",
            "content": "I think we continue to allow scorer() and getDocIdSet to return null to mean \"no matches\", though they are not required too (ie, one cannot assume that a non-null return means there are matches).\n\nAnd we should make this clear in the javadocs.\n\nAnd remove NonMatchingScorer. ",
            "author": "Michael McCandless",
            "id": "comment-12734164"
        },
        {
            "date": "2009-07-22T15:54:20+0000",
            "content": "ok then I'll add a test case to the patch which uses QWF w/ a query that it's scorer returns null, and then fix IndexSearcher accordingly. And update the javadocs as needed. ",
            "author": "Shai Erera",
            "id": "comment-12734168"
        },
        {
            "date": "2009-07-22T17:10:13+0000",
            "content": "\n\tAdded a test case to TestDocIdSet which returns a null DocIdSet and indeed IndexSearcher failed.\n\tFixed IndexSearcher and all other places in the code which called scorer() or getDocIdSet() and could potentially hit NPE.\n\tAdded EmptyDocIdSetIterator for use by classes (such as ChainFilter) that need a DISI, but got a null DocIdSet.\n\tUpdated CHANGES.\n\n\n\nAll search tests pass. ",
            "author": "Shai Erera",
            "id": "comment-12734196"
        },
        {
            "date": "2009-07-22T17:19:51+0000",
            "content": "For some reason I can't apply the patch – I get this:\n\n$ patch -p0 < /x/tmp/LUCENE-1754.patch.txt \npatching file CHANGES.txt\npatch: **** malformed patch at line 20: @@ -629,6 +638,11 @@\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12734202"
        },
        {
            "date": "2009-07-22T17:27:54+0000",
            "content": "My fault. After I created it, I manually edited the CHANGES section, which messed up the lines count. ",
            "author": "Shai Erera",
            "id": "comment-12734204"
        },
        {
            "date": "2009-07-22T18:48:05+0000",
            "content": "OK patch looks good, thanks Shai!\n\nI plan to commit in a day or two. ",
            "author": "Michael McCandless",
            "id": "comment-12734245"
        },
        {
            "date": "2009-07-25T10:37:28+0000",
            "content": "New patch attached – sync'd to trunk, and, fixed places to also catch when disi.iterator() returns null. ",
            "author": "Michael McCandless",
            "id": "comment-12735260"
        },
        {
            "date": "2009-07-27T09:50:04+0000",
            "content": "Thanks Shai! ",
            "author": "Michael McCandless",
            "id": "comment-12735545"
        },
        {
            "date": "2009-07-27T10:59:41+0000",
            "content": "EmptyDocIdSetIterator is not necessary as DocIdSet already defines an EMPTY_DOCIDSET member. We should use it. ",
            "author": "Shai Erera",
            "id": "comment-12735556"
        },
        {
            "date": "2009-07-27T10:59:54+0000",
            "content": "Removed EmptyDocIdSetIterator and changed DocIdSet.EMPTY_DOCIDSET to impl iterator() to always return the same, empty, instance. ",
            "author": "Shai Erera",
            "id": "comment-12735557"
        },
        {
            "date": "2009-07-27T11:11:51+0000",
            "content": "New patch looks good Shai, thanks!  I'll commit shortly. ",
            "author": "Michael McCandless",
            "id": "comment-12735563"
        },
        {
            "date": "2009-07-27T11:15:39+0000",
            "content": "There is no need to make this empty DIS a subvclass of SortedVIntList\n\n\n-public static final DocIdSet EMPTY_DOCIDSET = new SortedVIntList(new int[0]) {\n+-public static final DocIdSet EMPTY_DOCIDSET = new DocIdSet() {\n\n\n\nElse is OK! ",
            "author": "Uwe Schindler",
            "id": "comment-12735564"
        },
        {
            "date": "2009-07-27T11:15:44+0000",
            "content": "Wait ! DocIdSet.EMPTY should not do \"new SortedVIntList\", just \"new DocIdSet()\". ",
            "author": "Shai Erera",
            "id": "comment-12735565"
        },
        {
            "date": "2009-07-27T11:16:29+0000",
            "content": "There is no need to make this empty DIS a subvclass of SortedVIntList \n\nWe probably posted at the same time  ",
            "author": "Shai Erera",
            "id": "comment-12735566"
        },
        {
            "date": "2009-07-27T11:22:16+0000",
            "content": "Hihi! Sometimes it is not the best to be too fast  \n\nI am now satisfied with the latest patch, this new DocdSet impl is better than the SortedVInitList (which was OK, too, in my opinion. There was a very lengthly discussion in another JIRA issue about that DIS(I)). ",
            "author": "Uwe Schindler",
            "id": "comment-12735568"
        },
        {
            "date": "2009-07-27T11:23:30+0000",
            "content": "DocIdSet.EMPTY should not do \"new SortedVIntList\", just \"new DocIdSet()\".\n\nOK, committed. ",
            "author": "Michael McCandless",
            "id": "comment-12735569"
        },
        {
            "date": "2009-07-27T11:24:56+0000",
            "content": "I also removed the note about SortedVInitList in the JavaDocs, Mike, should I commit? ",
            "author": "Uwe Schindler",
            "id": "comment-12735570"
        },
        {
            "date": "2009-07-27T11:30:31+0000",
            "content": "I also removed the note about SortedVInitList in the JavaDocs\n\nArgh ... I guess I tried to create the patch too fast (before Mike commits) .\nWhen you do this, the import of SVIL can also be removed. ",
            "author": "Shai Erera",
            "id": "comment-12735572"
        },
        {
            "date": "2009-07-27T11:30:40+0000",
            "content": "I am a little bit confused about the JavaDocs of iterator():\n\n/** Provides a {@link DocIdSetIterator} to access the set.\n * This may (but is not required to) return null if there\n * are no docs that match. */\n\n\n\nIs it really allowed to return null instead of an empty iterator? If not, we should silently remove this part of the docs (and hopefully do not break some filters written by someone).\n ",
            "author": "Uwe Schindler",
            "id": "comment-12735573"
        },
        {
            "date": "2009-07-27T11:34:49+0000",
            "content": "Is it really allowed to return null instead of an empty iterator?\n\nSome iterators already return null as an iterator, perhaps unknowingly. QueryWrapperFilter will do that if the Query produced a null Scorer, which is legal, or at least the de facto impl of some Queries.\n\nI think that the decisions on this issue were made because we observed that returning null \"already exists\", and moving to not return null, or saying that null should not be returned, may break back-compat (e.g. if someone relies on null to mean \"there are no docs to match\"). ",
            "author": "Shai Erera",
            "id": "comment-12735574"
        },
        {
            "date": "2009-07-27T11:37:04+0000",
            "content": "OK, so maybe we change the JavaDoc and state, that optimally a Filter should return the empty DocIdSet instance. This is e.g. how MultiTermQueryWrapperFilter works. ",
            "author": "Uwe Schindler",
            "id": "comment-12735575"
        },
        {
            "date": "2009-07-27T11:46:17+0000",
            "content": "Even though I don't know if it's \"optimal\", I think this makes sense to document, i.e. change the javadoc to something like \"if there are no docs that match, the implementation can return null or DocIdSet.EMPTY_DOCIDSET.iterator()\"?\n\nCan you do this while changing the javadoc of EMPTY_DOCIDSET as well as the unnecessary import? ",
            "author": "Shai Erera",
            "id": "comment-12735576"
        },
        {
            "date": "2009-07-27T12:04:20+0000",
            "content": "DONE! I hope this is the last commit for this issue  ",
            "author": "Uwe Schindler",
            "id": "comment-12735578"
        },
        {
            "date": "2009-07-27T12:27:17+0000",
            "content": "Phew, thanks guys! ",
            "author": "Michael McCandless",
            "id": "comment-12735583"
        }
    ]
}