{
    "id": "LUCENE-2356",
    "title": "Enable setting the terms index divisor used by IndexWriter whenever it opens internal readers",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.9.3",
            "3.0.2",
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Opening a place holder issue... if all the refactoring being discussed don't make this possible, then we should add a setting to IWC to do so.\n\nApps with very large numbers of unique terms must set the terms index divisor to control RAM usage.\n\n(NOTE: flex's RAM terms dict index RAM usage is more efficient, so this will help such apps).\n\nBut, when IW resolves deletes internally it always uses default 1 terms index divisor, and the app cannot change that.  Though one workaround is to call getReader(termInfosIndexDivisor) which will pool the reader with the right divisor.",
    "attachments": {
        "LUCENE-2356.patch": "https://issues.apache.org/jira/secure/attachment/12446064/LUCENE-2356.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-03-29T11:22:06+0000",
            "content": "I won't have any time to take this any time soon   So if anyone has the itch, jump! ",
            "author": "Michael McCandless",
            "id": "comment-12850887"
        },
        {
            "date": "2010-03-29T14:03:54+0000",
            "content": "The above comment was on the wrong issue \n\nWe should only do this issue if the ongoing ideas about refactoring IW/IR don't make controlling the terms index divisor possible, for readers opened by IW. ",
            "author": "Michael McCandless",
            "id": "comment-12850916"
        },
        {
            "date": "2010-03-29T14:36:04+0000",
            "content": "That's likely orthogonal.\nIf you want all IW readers to have same divisor - shove it into IWC and it's all done.\nIf you want to use different divisors when returning SR as a part of NRT reader and using it inside (say, for deletions) - okay, you'll have the ability to do that at the cost of partial SR reload - shove two settings into IWC and it's done. ",
            "author": "Earwin Burrfoot",
            "id": "comment-12850928"
        },
        {
            "date": "2010-06-01T21:29:37+0000",
            "content": "Simple patch – adds IWC.set/getReaderTermsIndexDivisor. ",
            "author": "Michael McCandless",
            "id": "comment-12874244"
        }
    ]
}