{
    "id": "LUCENE-5202",
    "title": "LookaheadTokenFilter consumes an extra token in nextToken",
    "details": {
        "components": [],
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "affect_versions": "4.3.1",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This is a bit hard to explain except by looking at the test case. I've coded a filter that uses LookaheadTokenFilter. The incrementToken method peeks some tokens. Then, it seems, nextToken in the Lookahead class calls peekToken itself, which seems to me to consume a token so that it's not seen when the derived class sets out to process the next set of tokens.\n\nIn passing, this test case can be used to demonstrate that it does not work to try to use the afterPosition method to set up attributes of the token that we're 'after'. Probably that was never intended. However, I'm hoping for some feedback as to whether the rest of the structure here is as intended for subclasses of LookaheadTokenFilter.",
    "attachments": {
        "LUCENE-5202.patch": "https://issues.apache.org/jira/secure/attachment/12601998/LUCENE-5202.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-09-07T20:17:59+0000",
            "content": "First version of test case with 'first token' problem. ",
            "author": "Benson Margulies",
            "id": "comment-13761113"
        },
        {
            "date": "2013-09-07T23:26:23+0000",
            "content": "OK I got the test working ... I had to fix a few things in the test:\n\n\n\tMove the test classes under lucene/core/src/test (\"ant test\" did not want to run tests under lucene/test-framework/src/test)\n\n\n\n\n\tAdd an insertToken() call in afterPosition; this [confusingly] notifies the base class that a new token was inserted.  I also added clearAttributes() call, and set posInc and offsets.\n\n\n\nAnd I also added a missing afterPosition() call in after all tokens are exhausted, in LookaheadTokenFilter. ",
            "author": "Michael McCandless",
            "id": "comment-13761146"
        },
        {
            "date": "2013-09-08T00:40:33+0000",
            "content": "I'm a bit confused here.\n\nI have two cases. In the test case at hand, I'm trying very hard not to create any new tokens, or so I thought. All I wanted to do was to use knowledge from lookahead to influence the values in some attributes.\n\nIn a second case, I want to insert additional tokens into the stream. In fact, in my 'real' code that this test case is cut down from, afterPosition calls insertToken and does pretty nearly precisely what you coded here when, indeed, I want to create a new token.\n\nSo I really don't want a new position-increment 0 token. I want to really just change the values. Did you think that I wanted a new PI=0 token, or are you telling me that I can't do what I want using this class as a base class.\n\n ",
            "author": "Benson Margulies",
            "id": "comment-13761155"
        },
        {
            "date": "2013-09-08T10:25:57+0000",
            "content": "Oh, sorry, I see; I indeed thought you were trying to create new tokens (and, changed the test to do so).\n\nOK, so for your first case (just changing attrs based on looked-ahead tokens), afterPosition is not the right place to do that: this method is effectively called after the last token leaving the current position has been emitted, and before setting attrs to the state for the next token.  It's basically \"between\" tokens.\n\nIf you just want to change the att values, I think you should do that in your incrementToken, i.e. it would first call nextToken(), and if that returned true, it would then futz w/ the attrs and return true.  Would that work? ",
            "author": "Michael McCandless",
            "id": "comment-13761246"
        },
        {
            "date": "2013-09-08T11:35:56+0000",
            "content": "Yes, that's what I have and it works, except for the problem I wrote this test case to demonstrate. There's a call to peekToken in nextToken used to detect the end of the input. When that gets called, a token 'moves' from the input to the positions, so the calls to peekToken in my code never see it.\n\nEither I'm supposed to call restoreState to examine it, or there's a problem here. If I'm supposed to call restoreState, I need to figure out how to notice (by looking at positions?) that I'm in that situation. Or there's some problem in my logic for deciding when to do my next load of peeks, so that nextToken is never supposed to reach that call to peek, but I can't figure out what it is. ",
            "author": "Benson Margulies",
            "id": "comment-13761254"
        },
        {
            "date": "2013-09-08T13:23:57+0000",
            "content": "There's a call to peekToken in nextToken used to detect the end of the input. When that gets called, a token 'moves' from the input to the positions, so the calls to peekToken in my code never see it.\n\nOK I think I see.\n\nSo, your peekSentence has peek'd N tokens, up until it saw a '.' token.  Then, your incrementToken does nextToken() to get through those buffered tokens, tweaking atts before returning, but then on the first nextToken() after the lookahead buffer is exhausted, peekToken() is called directly from nextToken() and you have no chance to intercept that.\n\nBut note that this token doesn't actually move to positions (get buffered); it just \"passes through\", i.e. when nextToken returns the atts of that new token are \"live\" in the attributes and you could examine it \"live\".\n\nOr, maybe, you could use a counter, incremented as you peek tokens in peekSentence, and then decremented as you nextToken() off the lookahead, and once that reaches 0 you peekSentence() again?  Or, maybe LookaheadTF should do this for you, e.g. provide a lookaheadCount saying how many tokens are in the lookahead buffer.\n\nNet/net, it may be a lot easier to just make your own dedicated class   It would have direct control over the buffer, so you wouldn't have to deal with the confusing flow of LookaheadTF. ",
            "author": "Michael McCandless",
            "id": "comment-13761264"
        },
        {
            "date": "2013-09-08T15:39:55+0000",
            "content": "OK, I see.\n\nSo I'll leave it to you to apply this patch to pick up the fix you made.\n\nthanks ",
            "author": "Benson Margulies",
            "id": "comment-13761475"
        },
        {
            "date": "2013-09-08T22:58:17+0000",
            "content": "OK I'll commit this fix ... thanks for iterating here   If you have any ideas on how to make LookaheadTF more useful please keep raising them! ",
            "author": "Michael McCandless",
            "id": "comment-13761544"
        },
        {
            "date": "2013-09-08T23:04:07+0000",
            "content": "Well, it only took me about 10 minutes to code a class that did what I needed once you goosed me into coding it. I suspect that there's something that LTF does that I don't need that explains why it is so complex. The rolling buffer suggests to me that it's supporting some much more flexible idea about lookahead than just 'grab a batch, process them, regurgitate the results (including extra tokens), grab the next batch.'\n\nOr in other words, since there are analyzers in Lucene that are still using pre-AttributeSource methods to handle creating additional tokens, one would think that there would be a use for a base class that could support them easily.\n\nin any case, you're welcome. ",
            "author": "Benson Margulies",
            "id": "comment-13761545"
        },
        {
            "date": "2013-09-09T16:28:56+0000",
            "content": "Commit 1521182 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1521182 ]\n\nLUCENE-5202: allow afterPosition() to insert a token at the end as well ",
            "author": "ASF subversion and git services",
            "id": "comment-13761994"
        },
        {
            "date": "2013-09-09T16:33:00+0000",
            "content": "Commit 1521183 from Michael McCandless in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1521183 ]\n\nLUCENE-5202: allow afterPosition() to insert a token at the end as well ",
            "author": "ASF subversion and git services",
            "id": "comment-13762005"
        },
        {
            "date": "2013-09-09T16:35:27+0000",
            "content": "I suspect that there's something that LTF does that I don't need that explains why it is so complex.\n\nI think it's trying to support arbitrary lookahead, and insertion of new tokens.  Sort of what a SynonymFilter would need.\n\nBut it's obviously not easy to use yet  ",
            "author": "Michael McCandless",
            "id": "comment-13762011"
        },
        {
            "date": "2013-10-05T10:19:23+0000",
            "content": "4.5 release -> bulk close ",
            "author": "Adrien Grand",
            "id": "comment-13787133"
        }
    ]
}