{
    "id": "LUCENE-4060",
    "title": "DirectoryTaxonomyWriter.addTaxonomies does not work well in a multi-threaded environment",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/facet"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA",
            "3.6.1"
        ],
        "affect_versions": "None",
        "resolution": "Cannot Reproduce",
        "status": "Closed"
    },
    "description": "DirTaxoWriter.addTaxonomies may lead to a corrupt taxonomy index if addCategory is called in parallel. While reviewing the code, the following changes seemed to be required:\n\n\n\tFix the bug\n\tSimplify addTaxonomies code – it's very complicated, seems rather inefficient, and seems to take care of more than is needed.\n\tThe intention to support multiple taxonomies is unclear, especially since FacetsPayloadProcessor can handle only one Directory and one OrdinalMap at a time. So I'd like to change the method to addTaxonomy. I anyway don't see the reason to add multiple taxonomies at once, one can call addTaxonomy several times.\n\n\n\nI will post a patch soon.",
    "attachments": {
        "LUCENE-4060.patch": "https://issues.apache.org/jira/secure/attachment/12527574/LUCENE-4060.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-05-16T07:00:30+0000",
            "content": "Patch does:\n\n\n\tFix the bug\n\tRenames addTaxonomies to addTaxonomy\n\tGreatly simplifies addTaxonomy logic\n\tOverhauls TestAddTaxonomies to be simpler and test what it needs to test - for some reason it tested that after addTaxonmy the new categories are sorted in a lexicographic order, which is a side effect of addTaxonomy, but does not need to be like that.\n\n\n\nNOTE: before applying the patch you should run\n\nsvn mv lucene/contrib/facet/src/test/org/apache/lucene/facet/taxonomy/directory/TestAddTaxonomies.java lucene/contrib/facet/src/test/org/apache/lucene/facet/taxonomy/directory/TestAddTaxonomy.java\n\n\n\nOne nice side effect of this improvement is that testBig, with the really huge taxonomy, takes 12 seconds faster to run after the change. While this is not a pure benchmark, it does show that the modified implementation is faster than the older.\n\nI will commit this shortly and port to trunk. ",
            "author": "Shai Erera",
            "id": "comment-13276527"
        },
        {
            "date": "2012-05-16T08:03:04+0000",
            "content": "Committed rev 1339032 (3.6.1) and 1339047 (trunk). Also add CHANGES entry and a concurrency test to TestAddTaxonomy.\n\nThanks Gilad ! ",
            "author": "Shai Erera",
            "id": "comment-13276568"
        },
        {
            "date": "2012-07-22T16:04:55+0000",
            "content": "Bulk close for 3.6.1 ",
            "author": "Uwe Schindler",
            "id": "comment-13420208"
        }
    ]
}