{
    "id": "LUCENE-3228",
    "title": "build should allow you (especially hudson) to refer to a local javadocs installation instead of downloading",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Currently, we fail on all javadocs warnings.\n\nHowever, you get a warning if it cannot download the package-list from sun.com\nSo I think we should allow you optionally set a sysprop using linkoffline.\nThen we would get much less hudson \"fake failures\"\n\nI feel like Mike opened an issue for this already but I cannot find it.",
    "attachments": {
        "LUCENE-3228.trunk.patch": "https://issues.apache.org/jira/secure/attachment/12505182/LUCENE-3228.trunk.patch",
        "LUCENE-3228.patch": "https://issues.apache.org/jira/secure/attachment/12484005/LUCENE-3228.patch",
        "LUCENE-3228.branch_3x.patch": "https://issues.apache.org/jira/secure/attachment/12505181/LUCENE-3228.branch_3x.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-06-22T11:46:30+0000",
            "content": "as a start, i installed the two freebsd ports for java doc on hudson into /usr/local/share/doc/jdk1.5 and jdk1.6\n\nI'll see if i can add the hooks to the build scripts now ",
            "author": "Robert Muir",
            "id": "comment-13053194"
        },
        {
            "date": "2011-06-22T12:00:54+0000",
            "content": "As a partial solution, I setup the 30 minute builds to just directly override javadoc.link (and javadoc.link.java for Solr) for our 30 minute builds... we don't care about the actual javadoc artifacts or where the links actually point to, only that there are no warnings.\n\nThis is in r1138418 ",
            "author": "Robert Muir",
            "id": "comment-13053198"
        },
        {
            "date": "2011-06-22T12:04:36+0000",
            "content": "I noticed also that solr uses an online link for junit javadocs... we should download this one and do the same, too.\nI'll look at this if the link for the sun javadocs \"takes\" for the 30 minute builds. ",
            "author": "Robert Muir",
            "id": "comment-13053200"
        },
        {
            "date": "2011-06-24T21:15:40+0000",
            "content": "+1\n\nI think we should allow you optionally set a sysprop using linkoffline\n\nhell, why bother with the sysprop? .. lets just commit the package-list files for all third party libs we use into dev-tools and completely eliminate the need for net when building javadocs.\n ",
            "author": "Hoss Man",
            "id": "comment-13054679"
        },
        {
            "date": "2011-06-26T12:57:34+0000",
            "content": "lets just commit the package-list files for all third party libs we use into dev-tools and completely eliminate the need for net when building javadocs.\n\n+1\n\nHitting build failures because we can't download these package lists is silly. ",
            "author": "Michael McCandless",
            "id": "comment-13055069"
        },
        {
            "date": "2011-06-26T13:26:24+0000",
            "content": "I agree with hossman too. I'm just a javadocs dummy and was doing what I could to stop the 30minute builds.\n\nI cant figure out this linkoffline (at least with my experiments its confusing)... but this sounds great. ",
            "author": "Robert Muir",
            "id": "comment-13055071"
        },
        {
            "date": "2011-06-27T20:36:15+0000",
            "content": "rmuir: here's a rough patch showing how the link offline stuff works. (as far as i understand it anyway)\n\nsome quick testing didn't turn up any problems, but i didn't test the where modules/contribs usage of invoke-javadoc.  \n\nthere may be cleanup we want to do to - for now i avoided adding more sys properties for the package-list dirs, but maybe we want them? i dunno.  there 's also some existing instances of the \"<link>\" tag that look totally bogus and broken (see the WTF comments i added) but i didn't test what changes if i remove them\n\nthis patch should also fix SOLR-2439 (use relative links for lucene jdocs from solr jdocs. ",
            "author": "Hoss Man",
            "id": "comment-13055735"
        },
        {
            "date": "2011-06-27T23:01:53+0000",
            "content": "I am glad you had the same \"WTF\", although ant docs say its ok to use both, the current tasks in e.g. lucene have both the link attribute and nested link-without-href-wtf, and as i tried mixing linkoffline in different ways, it would appear to work, until i changed the link to javaBROKENURL.sun.com/...., etc.\n\nI think we should go with this patch so we aren't downloading this junk anymore, it causes false build failures, the only trick I can think of is how to ensure lucene source releases build by themself without reaching back to dev-tools (i think this is broken on trunk at the moment, but it does work on 3.x right now) ",
            "author": "Robert Muir",
            "id": "comment-13056084"
        },
        {
            "date": "2011-07-05T07:56:12+0000",
            "content": "I propose switching to the oracle.com link suggested by Chris Male:\n\nhttp://download.oracle.com/javase/6/docs/api/package-list apparently works reliably.\n\nThis would be lots simpler than trying to figure out dev-tools etc., assuming that this link is indeed reliable. ",
            "author": "Steve Rowe",
            "id": "comment-13059709"
        },
        {
            "date": "2011-07-05T08:04:16+0000",
            "content": "+1 ",
            "author": "Chris Male",
            "id": "comment-13059712"
        },
        {
            "date": "2011-07-05T10:18:01+0000",
            "content": "+1 let's try this and see if it is indeed reliable. ",
            "author": "Michael McCandless",
            "id": "comment-13059818"
        },
        {
            "date": "2011-07-05T10:24:27+0000",
            "content": "Just one other idea:\n\n\tWe already have JAVA_HOME set (direct or implicitely set by ANT)\n\tThe Javadocs are always at same location in $JAVA_HOME\n\n\n\nCould we not use this to point to the package list (at least fpr the JDK part). I don't like the hardcoded package list. ",
            "author": "Uwe Schindler",
            "id": "comment-13059820"
        },
        {
            "date": "2011-07-05T13:13:06+0000",
            "content": "The Javadocs are always at same location in $JAVA_HOME\n\nI looked at JAVA_HOME on Windows for 1.5.0_22 and 1.6.0_23 (both 64 bit JDKs), and neither included Javadocs.  Maybe they're separately downloadable? ",
            "author": "Steve Rowe",
            "id": "comment-13059883"
        },
        {
            "date": "2011-07-05T13:26:37+0000",
            "content": "Sorry, you are right. I have it here, but the README.html in JDK's root folder says:\n\n\nJDK(TM) Documentation\n\nThe on-line JavaTM Platform, Standard Edition (Java SE) Documentation contains API specifications, feature descriptions, developer guides, reference pages for JDKTM tools and utilities, demos, and links to related information. This documentation is also available in a download bundle which you can install on your machine. To obtain the documentation bundle, see the download page. For API documentation, refer to the The JavaTM Platform, Standard Edition API Specification This provides brief descriptions of the API with an emphasis on specifications, not on code examples. ",
            "author": "Uwe Schindler",
            "id": "comment-13059894"
        },
        {
            "date": "2011-11-23T23:14:28+0000",
            "content": "sarowe asked about this issue in LUCENE-3587.\n\nFWIW, i thought this issue (LUCENE-3228) had been resolved a long time ago based on some comments i remember people making, but evidently those comments where on irc/mail and folks didn't post them in Jira.\n\nProblems with the patch i attached (that i know of):\n\n1) we don't distribute dev-tools in our releases, so at a minimum we'd need to find a new home for any package-list files we wanted to ship.\n\n2) the Java documentation from Oracle has some licensing/restrictions  that affect redistribution which don't seem to be compatible with ASF 3rd party licensing policy so we can't include the java package-list files in our releases\n\n...we could still use the ideas in this patch to deal with package-list files for non java/oracle distrobutions, but at the time this patch was written the only other extneral javadocs we linked to where that might be useful was junit, and since this patch was created, that link has just been removed outright from our build.xml files.\n\nI don't think there's anything left here but to resolve as Won't Fix ",
            "author": "Hoss Man",
            "id": "comment-13156386"
        },
        {
            "date": "2011-11-25T19:02:42+0000",
            "content": "I don't think there's anything left here but to resolve as Won't Fix\n\nI disagree.\n\n1) we don't distribute dev-tools in our releases, so at a minimum we'd need to find a new home for any package-list files we wanted to ship.\n\nHow does lucene/src/tools/javadoc/ grab you?\n\n2) the Java documentation from Oracle has some licensing/restrictions that affect redistribution which don't seem to be compatible with ASF 3rd party licensing policy so we can't include the java package-list files in our releases\n\nHere is a direct link to the Sun/Oracle documentation redistribution restrictions: http://java.sun.com/docs/redist.html.\n\nWe can include the Java javadoc package-list file in Subversion but exclude it from our source releases, and include a mechanism to download it when it's absent (i.e., in the source release).\n\nThere is an ASF precedent for redistributing Java javadoc package-list files in the Maven project's javadoc plugin: http://jira.codehaus.org/browse/MJAVADOC-315 and https://jira.codehaus.org/browse/MJAVADOC-327 - in Subversion at http://svn.apache.org/viewvc/maven/plugins/trunk/maven-javadoc-plugin/src/main/resources/org/apache/maven/plugin/javadoc/.  I can't find any associated discussion of legal ramifications, though.\n\nI'll put up a patch shortly implementing these ideas. ",
            "author": "Steve Rowe",
            "id": "comment-13157283"
        },
        {
            "date": "2011-11-26T07:56:38+0000",
            "content": "Patch for branch_3x.  Features:\n\n\n\tAdds package-list files for Oracle Java javadocs and JUnit javadocs to subversion.\n\tWhen building Lucene and Solr source releases, the Oracle Java javadocs package-list file is removed.\n\tWhen connected or disconnected from the network, javadocs built from a subversion checkout contain links to Oracle javadocs.\n\tWhen connected to the network, javadocs built from a source release will attempt to download the Oracle Java package-list file.\n\tWhen the Oracle Java package-list file is not present, either because the user is building from a source release while disconnected from the network, or because the package-list file for Oracle Java javadocs is not downloadable for some other reason, javadocs will be built and the build will not fail, though an error will appear in the build log.\n\tLinks from Solr javadocs to Lucene's javadocs are enabled.  When building a non-release version, the links are to the most recently built nightly Jenkins javadocs, as in Hoss's patch on this issue.  When building a release version, links are to the same-versioned Lucene release javadocs.\n\n ",
            "author": "Steve Rowe",
            "id": "comment-13157409"
        },
        {
            "date": "2011-11-26T08:40:08+0000",
            "content": "Trunk for patch with the same changes. ",
            "author": "Steve Rowe",
            "id": "comment-13157414"
        },
        {
            "date": "2011-11-28T14:56:23+0000",
            "content": "If there are no objections I will commit this tomorrow. ",
            "author": "Steve Rowe",
            "id": "comment-13158485"
        },
        {
            "date": "2011-12-03T21:57:12+0000",
            "content": "Committed:\n\n\n\tr1210020: trunk\n\tr1210022: branch_3x\n\n ",
            "author": "Steve Rowe",
            "id": "comment-13162218"
        }
    ]
}