{
    "id": "LUCENE-6234",
    "title": "harden smokeTestRelease.py's expectations regarding CWD",
    "details": {
        "resolution": "Invalid",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Closed",
        "type": "Improvement"
    },
    "description": "smokeTestRelease.py changed at some point to require/expect that you run it from the root of the checkout of the branch you are smoke testing, per rernst's comments in mail...\n\nThat part of the script expects you run from the root of a checkout.  It runs the backcompat tests, and scrapes the test output to check all are tested.\n\nThe context was that i (out of habit from older versions of this script) was trying to do this in my personal tmp space (expecting the script to create it's RC specific tmp dir in the CWD)...\n\n\nhossman@frisbee:~/tmp$ python3.2 ~/lucene/branch_5_0/dev-tools/scripts/smokeTestRelease.py http://people.apache.org/~anshum/staging_area/lucene-solr-5.0.0-RC2-rev1658469\n\n\n\nIf smokeTestRelease.py is going to have expectations about it's CWD, then it should either enforce those expectations (ie: do a simple assert in main() that the CWD meets some expectations, and/or check \"$0\") or it should use \"$0\" to figure out where the root svn checkout is and cd to that directory itself.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14314559",
            "author": "Hoss Man",
            "date": "2015-02-10T18:09:57+0000",
            "content": "This may be a red herring – pretty sure the root error is: LUCENE-6235\n\nmy reading of the code is that it's running TestBackwardsCompatibility in the unpacked directory of a lucene-src release.  I suspect smoke tester doesn't actaully care anywhere about the CWD that the user initially used to run smokeTestRelease.py ... but i still need to test that.\n "
        },
        {
            "id": "comment-14324908",
            "author": "Hoss Man",
            "date": "2015-02-17T21:21:21+0000",
            "content": "confirmed this is not really a problem – you can run smoketers from any CWD.\n\nroot problem causing initially error was entirely LUCENE-6235 "
        },
        {
            "id": "comment-14324931",
            "author": "Ryan Ernst",
            "date": "2015-02-17T21:33:25+0000",
            "content": "thanks for confirming Hoss Man, sorry for creating confusion. "
        }
    ]
}