{
    "id": "LUCENE-6024",
    "title": "Improve oal.util.BitSet's bulk and/or/and_not",
    "details": {
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed",
        "components": [],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.0"
        ]
    },
    "description": "LUCENE-6021 introduced oal.util.BitSet with default impls taken from FixedBitSet. However, these default impls could be more efficient (and eg. perform an actual leap frog for AND and AND_NOT).\n\nAdditionally, SparseFixedBitSet could benefit from some specialization.",
    "attachments": {
        "LUCENE-6024.patch": "https://issues.apache.org/jira/secure/attachment/12676941/LUCENE-6024.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14183046",
            "author": "Adrien Grand",
            "content": "Here is a patch\n\n\tBitSet.and and BitSet.andNot have been improved to perform a leap-frog intersection of the two bit sets. I think this is a better default impl as it performs faster if any of the 2 sets is sparse.\n\tSparseFixedBitSet.or adds specialization for two common cases: union with a rather dense set (used in practice when the cost is greater than maxDoc / 4096) and union with another SparseFixedBitSet\n\tSparseFixedBitSet.and adds a minor specialization for the union with another SparseFixedBitSet\n\tit also fixes a bug that SparseFixedBitSet.clear didn't update the count of non-zero longs (which is used to compute the approximate cardinality).\n\n\n\nI also changed a bit the API/impl to:\n\n\tnot exhaust the iterator eg. in the FixedBitSet specialization. Not all these bulk methods require to completely exhaust the iterator (eg. intersection), so I rather documented that the state of the iterator is undefined after these methods have been called\n\trequire an unpositionned iterator: are there really use-cases for intersection/union with an iteration that was already half consumed? Adding this additional requirement makes things a bit simpler since you don't need to check if the current doc is -1 for certain specialization or if the iterator is not already on NO_MORE_DOCS\n\n\n\nThe main benefits are for SparseFixedBitSet's build time from another DocIdSetIterator since it uses BitSet.or. Here are the numbers reported by DocIdSetBenchmark (can be found in luceneutil) which measures how many instances can be built in one second based on the density of the set (maxDoc is hard-coded to 2^24). For reference, the SparseFixedBitSet is built from a RoaringDocIdSet (since it is our fastest DocIdSet iteration-wise).\n\n\n\n\n Set density \n Without the patch \n With the patch \n\n\n 10e-5 \n 174335 \n 162070 \n\n\n 10e-4 \n 28253 \n 26357 \n\n\n 10e-3 \n 2569 \n 4148 \n\n\n 0.01 \n 303 \n 520 \n\n\n 0.1 \n 39 \n 56 \n\n\n 0.5 \n 10 \n 13 \n\n\n 0.9 \n 7 \n 9 \n\n\n 0.99 \n 7 \n 9 \n\n\n 1 \n 7 \n 9 \n\n\n\n ",
            "date": "2014-10-24T16:59:19+0000"
        },
        {
            "id": "comment-14184962",
            "author": "Adrien Grand",
            "content": "The impact of this change is also noticeable on the charts: http://people.apache.org/~jpountz/doc_id_sets6.html the sparse set is now always almost as fast to build from another DocIdSet as a FixedBitSet. ",
            "date": "2014-10-27T08:46:36+0000"
        },
        {
            "id": "comment-14184968",
            "author": "ASF subversion and git services",
            "content": "Commit 1634478 from Adrien Grand in branch 'dev/trunk'\n[ https://svn.apache.org/r1634478 ]\n\nLUCENE-6024: Speed-up BitSet.or/and/andNot. ",
            "date": "2014-10-27T08:54:43+0000"
        },
        {
            "id": "comment-14184969",
            "author": "ASF subversion and git services",
            "content": "Commit 1634479 from Adrien Grand in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1634479 ]\n\nLUCENE-6024: Speed-up BitSet.or/and/andNot. ",
            "date": "2014-10-27T08:57:06+0000"
        },
        {
            "id": "comment-14332698",
            "author": "Anshum Gupta",
            "content": "Bulk close after 5.0 release. ",
            "date": "2015-02-23T05:01:24+0000"
        }
    ]
}