{
    "id": "LUCENE-7902",
    "title": "Refactoring of IndexSearcher",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Improvement",
        "components": [
            "core/search"
        ],
        "fix_versions": []
    },
    "description": "Hello everyone.\nI was analyzing the modularization of some classes, and I identified that the class IndexSearcher  has an opportunity for cohesion improvement. \nThe class IndexWriter was in the same situation and the problem was solved as follows: The IndexWriterConfig class was created, and several get() and set() methods that were used only to configure the class parameters were moved from IndexWriter to IndexWriterConfig. \nThe new class was then accessed through an instance variable in IndexWriter. This strategy has cleaned and improved IndexWriter cohesion.\nWith this in mind, I would recommend creating a new class: IndexSearcherConfig , and moving the following methods:\nsetDefaultQueryCachingPolicy\ngetDefaultQueryCachingPolicy\ngetQueryCachingPolicy\nsetQueryCachingPolicy\nsetQueryCache\ngetQueryCache\nsetDefaultQueryCache\ngetDefaultQueryCache\nsetSimilarity\ngetSimilarity\nfrom the IndexSearcher.\nThose parameters accessed by an instance variable in the IndexSearcher.\nMoreover, the orthogonality is the design would be enhanced.\n\nWhat do you think about that?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16110215",
            "date": "2017-08-02T03:24:43+0000",
            "content": "Personally I think the IndexWriterConfig thing has a lot of downsides. Its an additional class the user must worry about and more complicated than a POJO: i think it makes something hard to use.\n\nIn the case of IndexWriter there were so many getters and setters that we made this change due to the sheer number, but I don't really see that as a good thing either  ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16121455",
            "date": "2017-08-10T10:55:48+0000",
            "content": "Hi Robert, thanks for the comment. \n\nEven if this is not the right strategy for IndexSeracher, do you think it could benefit from some kind of refactoring? \n\nAnd in the case of IndexWriter what else could have been done? \nWould it be possible without creating another class? ",
            "author": "João Paulo Lemes Machado"
        }
    ]
}