{
    "id": "LUCENE-3944",
    "title": "ant clean should remove pom.xml's",
    "details": {
        "labels": "",
        "priority": "Blocker",
        "components": [
            "general/build"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Currently once the pom.xml's are in place, its hard to get them out.  Having them can be a little trappy when you're trying to debug the bug.  We should facilitate their removal during clean.",
    "attachments": {
        "LUCENE-3944.patch": "https://issues.apache.org/jira/secure/attachment/12521152/LUCENE-3944.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-03T03:37:13+0000",
            "content": "This is currently pretty crazy, we need to fix this to have a reproducible build.\n\nthe problem is 'prepare-release' can pass or fail, depending upon the presence of svn-ignore'd pom.xmls scattered about the source tree.\non top of this, some modules (at least solr/contrib/langid) rely upon the fact you have previous populated svn-ignore'd pom.xml's elsewhere in solr first... but the fact that these are in the source tree svn:ignore'd and not removed on clean basically makes it nearly impossible to debug. ",
            "author": "Robert Muir",
            "id": "comment-13244940"
        },
        {
            "date": "2012-04-03T03:38:12+0000",
            "content": "steps to reproduce current craziness:\n\ncd solr/\nant generate-maven-artifacts\ncd ..\nant clean clean-jars\ncd solr/contrib/langid\nant dist-maven <-- works\nnow go back to the root\nfind . -name pom.xml | xargs rm -f\nant clean clean-jars\nant cd solr/contrib/langid\nant dist-maven <-- fails ",
            "author": "Robert Muir",
            "id": "comment-13244942"
        },
        {
            "date": "2012-04-03T04:39:19+0000",
            "content": "I don't really think ant clean should be nuking things from the source tree,\ninstead, I think just like tests (SOLR-3268), 'dist-maven' should not modify the \nsource tree here but only build and dist with this build output. ",
            "author": "Robert Muir",
            "id": "comment-13244966"
        },
        {
            "date": "2012-04-03T14:46:04+0000",
            "content": "Patch implementing a new target filter-pom-templates, which places the POMs under lucene/build/poms/.  dist-maven pulls POMs from this location instead of from each module's source directory.  generate-maven-artifacts under lucene/ seems to work; I haven't tested much else.\n\nThere is an Ant problem, though: I have attempted to override dist-maven in solr/common-build.xml, but it's being ignored in Solr modules, which are instead using the dist-maven definition in lucene/common-build.xml.  My reading of the Ant docs makes me think this may be the intended behavior: only the running build file's target definitions override those that are imported. ",
            "author": "Steve Rowe",
            "id": "comment-13245365"
        },
        {
            "date": "2012-04-03T15:10:30+0000",
            "content": "New trunk patch.\n\nRobert pointed out on #lucene IRC that the Ant problem (Solr contrib ignoring an overridden dist-maven target definition in solr/common-build.xml) was as a result of the dist-maven specialization in solr/contrib/langid, which depended on the lucene definition instead of the overriding solr definition.  This is fixed in this version of the patch.\n\nAlso fixed in this version of the patch: a typo in the Solr definition of dist-maven that prevented it from finding the appropriate POM.\n\nant generate-maven-artifacts now works (succeeds anyway and puts the right stuff in the right place) under solr/, lucene/, and modules/.\n\nI plan on doing more testing before committing, and then backporting to branch_3x. ",
            "author": "Steve Rowe",
            "id": "comment-13245388"
        },
        {
            "date": "2012-04-03T15:29:38+0000",
            "content": "Patch works for me. A nice improvement in the future would be if solr's common-build\ndefined filtered.pom.templates.dir to be under its own solr/build (rather than lucene's),\nbut that doesnt need to be fixed here... this is really nice since it doesnt do\nthis stuff under the source tree. Thanks for working on this! ",
            "author": "Robert Muir",
            "id": "comment-13245402"
        },
        {
            "date": "2012-04-03T17:21:29+0000",
            "content": "A nice improvement in the future would be if solr's common-build defined filtered.pom.templates.dir to be under its own solr/build (rather than lucene's)\n\nWhere would modules/  POMs go - each under its own build directory?\n\nIf we ever try to do this, I think Maven Ant Tasks' deploy target needs to be able to access the parent and grandparent POMs, which (I think) means either putting them into the user's local maven repository, or putting them at the relative location given in the parent POM section of each POM.  Maybe in order to satisfy this the grandparent POM could be put in both places (or all places if modules/ need their own)? ",
            "author": "Steve Rowe",
            "id": "comment-13245514"
        },
        {
            "date": "2012-04-03T17:26:53+0000",
            "content": "Currently modules/ is bogus in the lucene build, some stuff goes in modules/xxx/build, some in lucene/build/....\n\nSo its a larger problem, thats why I think its a nicer improvement. As far as duplicating any poms in both locations, i think thats ok.\n\nWhen we release, currently lucene and solr are different releases (you run ant prepare-release for both), so they are independent artifacts.\n\nBut yeah, all of this can be a future improvement for a future issue. \n\n+1 for going with this patch (or some refinement on it based on testing, i only did light testing) so that its not changing the source tree. ",
            "author": "Robert Muir",
            "id": "comment-13245522"
        },
        {
            "date": "2012-04-03T18:13:13+0000",
            "content": "I think Maven Ant Tasks' deploy target needs to be able to access the parent and grandparent POMs, which (I think) means either putting them into the user's local maven repository, or putting them at the relative location given in the parent POM section of each POM. \n\nI just recently peeked at Apache ANT's source distribution and this seems to be done this way (separate folder structure just for POMs with relative refs). ",
            "author": "Dawid Weiss",
            "id": "comment-13245554"
        },
        {
            "date": "2012-04-03T18:23:08+0000",
            "content": "I just recently peeked at Apache ANT's source distribution and this seems to be done this way (separate folder structure just for POMs with relative refs).\n\nOn #lucene IRC last night and this morning, Chris Male pointed out Ant's POM setup, and said that he's working on enabling exactly the same setup for Lucene/Solr.  I believe the new filter-pom-templates target included in my patches on this issue could be part of such a change. ",
            "author": "Steve Rowe",
            "id": "comment-13245566"
        },
        {
            "date": "2012-04-03T20:49:04+0000",
            "content": "Final trunk patch.  I ran ant dist-maven on all directories containing a build.xml file.  (Some failed, but in all cases that was due to not having a dist-maven target.)\n\nThe changes from the last iteration:\n\n\n\tincludes CHANGES entry\n\tremoved full Solr duplicate of dist-maven (only dependencies were different from the Lucene version) in favor of new target dist-maven-common, which is depended on by both Lucene's and Solr's dist-maven targets\n\tfixed dist-maven in solr/webapp/ to depend on install-maven-tasks\n\tfixed top-level generate-maven-artifacts so that it functions properly.\n\n\n\nCommitting to trunk shortly, then backporting to branch_3x. ",
            "author": "Steve Rowe",
            "id": "comment-13245717"
        },
        {
            "date": "2012-04-03T22:04:46+0000",
            "content": "Committed to trunk and branch_3x. ",
            "author": "Steve Rowe",
            "id": "comment-13245803"
        }
    ]
}