{
    "id": "LUCENE-5016",
    "title": "Sampling can break FacetResult labeling",
    "details": {
        "components": [
            "modules/facet"
        ],
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "affect_versions": "4.3",
        "priority": "Minor",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "When sampling FacetResults, the TopKInEachNodeHandler is used to get the FacetResults.\n\nThis is my case:\nA FacetResult is returned (which matches a FacetRequest) from the StandardFacetAccumulator. The facet has 0 results. The labelling of the root-node seems incorrect. I know, from the StandardFacetAccumulator, that the rootnode has a label, so I can use that one.\n\nCurrently the recursivelyLabel method uses the taxonomyReader.getPath() to retrieve the label. I think we can skip that for the rootNode when there are no children (and gain a little performance on the way too?)",
    "attachments": {
        "test-labels.zip": "https://issues.apache.org/jira/secure/attachment/12584701/test-labels.zip",
        "LUCENE-5016.patch": "https://issues.apache.org/jira/secure/attachment/12585268/LUCENE-5016.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-05-24T10:53:06+0000",
            "content": "Can you attach a simple testcase exposing the problem? Not sure that I follow what's wrong. About not labeling, I doubt it will gain us anything. Labeling is not very expensive, and labels are LRU-cached. Also, considering all the work that's done during search processing, the labeling part is less than marginal. ",
            "author": "Shai Erera",
            "id": "comment-13666201"
        },
        {
            "date": "2013-05-24T15:45:34+0000",
            "content": "Now that I wrote the tests, I realise that maybe the behaviour of the StandardFacetAccumulator is incorrect, as it labels a FacetResult of a Facet that does not exist in the taxonomy...\n\nThe behaviour of the SamplingAccumulator and the Standard differ.\n\nFor my use case, it is very helpful if all the FacetRequests return a FacetResult with the same label as the request, but I can imagine that this is not desired. ",
            "author": "Rob Audenaerde",
            "id": "comment-13666401"
        },
        {
            "date": "2013-05-24T16:33:10+0000",
            "content": "I am not near the code and actually read the test in Notepad . It looks like you're indexing 100K docs with categories A/docnum and then ask to count the categories \"A\" and \"B\". If I understand correctly, the assert in the end fails?\n\nBasically, the FacetRestult that you get back should have the same label as the request. If it's not like that (and I will validate that when I'm near the code), then it's probably a bug in SamplingAccumulator.\n\nBTW the test actually indexed 200K docs while passing 'j' which is 0 for the first 100K and 1 for the second. But 'j' seems to be unused in addDocument. This shouldn't affect the test behavior but just FYI.\n\nThanks for reporting this, I'll take a deeper look later. ",
            "author": "Shai Erera",
            "id": "comment-13666436"
        },
        {
            "date": "2013-05-29T17:04:31+0000",
            "content": "I checked that and indeed there is inconsistency here. StandardFacetsAccumulator and FacetsAccumulator return an empty result with the root node labeled, while the sampling accumulators return the root node not labeled. There isn't anything technically wrong here, because the category does not exist, but I think we should be consistent.\n\nI was able to reproduce this behavior with an even simpler test Rob: index a single document with category \"A\" and ask to count category \"B\". The problem is as follows:\n\n\tSamplingAccumulator delegates to SFA.\n\tSFA detects this category does not exist and creates an empty FacetResult, which sets the label of the root node to the request's CategoryPath.\n\tSamplingAccumulator receives the results, and potentially runs SampleFixer. Then it labels the result, which then sets the label to null, after not finding it in the taxonomy.\n\n\n\nPerhaps at some point of the code lifecycle this additional labeling was needed, I'm not sure . But I think we should either remove the call to label the results in SamplingAccumulator, or at least not call taxoReader.getPath if the node.label is not null. For instance, if you ask to count \"A\" (which does exist), then labeling happens twice, once by SFA.accumulate and second time by SamplingAccumulator, which is just a waste.\n\nI'll attach later a short test which reproduces this and checks all existing accumulators. ",
            "author": "Shai Erera",
            "id": "comment-13669445"
        },
        {
            "date": "2013-05-29T18:17:15+0000",
            "content": "Patch fixes the following:\n\n\n\tOverSampledFacetRequest sets numLabel=0, as otherwise it will label categories that will be thrown away (over-sample). This was introduced incorrectly in LUCENE-4411.\n\n\n\n\n\tSamplingAccumulator and SamplingWrapper now return an emptyResult() when the ordinal of the root node is INVALID, which makes them consistent with the other accumulators.\n\n\n\n\n\tAdded TestFacetsCollector.testLabeling which ensures all current accumulators behave the same.\n\t\n\t\tThis uncovered a bug in RangeAccumulator when some readers did not have the requested numeric DV field. I fixed that too.\n\t\n\t\n\n\n\nI think it's ready - I intend to commit it tomorrow. ",
            "author": "Shai Erera",
            "id": "comment-13669531"
        },
        {
            "date": "2013-05-30T10:17:59+0000",
            "content": "Patch looks good.\n+1 for commit  ",
            "author": "Gilad Barkai",
            "id": "comment-13670200"
        },
        {
            "date": "2013-05-30T10:40:14+0000",
            "content": "Committed to trunk and 4x. Thanks Rob for reporting this! ",
            "author": "Shai Erera",
            "id": "comment-13670218"
        },
        {
            "date": "2013-07-23T18:37:12+0000",
            "content": "Bulk close resolved 4.4 issues ",
            "author": "Steve Rowe",
            "id": "comment-13716784"
        }
    ]
}