{
    "id": "LUCENE-4048",
    "title": "Move getLines out of ResourceLoader and require Charset",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "ResourceLoader.getLines() is only used by analysis factories.  SolrResourceLoader's implementation does the job well and it's unlikely that another ResourceLoader implementation would handle it differently.\n\nWe should extract the getLines() method out to AbstractAnalysisFactory so it can be used by the factories.  Additionally we shouldn't assume the files are encoded in UTF-8, instead we should allow a Charset to be specified.\n\nThis would take us one step closer to reducing the ResourceLoader interface just to what it says, a loader of resources.",
    "attachments": {
        "LUCENE-4048.patch": "https://issues.apache.org/jira/secure/attachment/12526712/LUCENE-4048.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-05-14T04:53:55+0000",
            "content": "Patch with a bunch of nocommits for things I'm not happy about.  \n\nI've added the line reading functionality from SolrResourceLoader to WordlistLoader but I'm unsure that it belongs there since it's about reading the contents of generic resources, not just those related to stopwords.\n\nWhat I'm thinking of doing is changing ResourceLoader to be an abstract class and putting the contents reading functionality there, and I can also put the boilerplate of integrating it with resources there too. ",
            "author": "Chris Male",
            "id": "comment-13274448"
        },
        {
            "date": "2012-05-16T01:20:01+0000",
            "content": "Patch with all the nocommits fixed.\n\n\n\tResourceLoader has become an abstract class with simple implementations for all its functionality.\n\tgetLines() stays in ResourceLoader but now doesn't need to be re-implemented.  Charset is now required\n\tI tied up some of code in AbstractAnalysisFactory which used ResourceLoader\n\tI nuked a bunch of ResourceLoader overrides since they weren't needed and there is a MockResourceLoader inside Solr's test-framework which does the job nicely.\n\n ",
            "author": "Chris Male",
            "id": "comment-13276375"
        }
    ]
}