{
    "id": "LUCENE-3754",
    "title": "Store generated archive manifests in per-module output directories",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Currently, generated archive manifests are all stored in the same location, so each module's build overwrites the previously built module's manifest.  Locating these files in the per-module build dirs will allow them to be rebuilt only when necessary, rather than every time a module's jar target is called.",
    "attachments": {
        "LUCENE-3754.patch": "https://issues.apache.org/jira/secure/attachment/12514450/LUCENE-3754.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-02-05T23:45:04+0000",
            "content": "LUCENE-3753, which provides individual build directories for lucene core and lucene test framework, is a prerequisite for this issue. ",
            "author": "Steve Rowe",
            "id": "comment-13200966"
        },
        {
            "date": "2012-02-14T05:33:24+0000",
            "content": "Patch that puts each generated manifest in its own place, and also allows modules to have more than one manifest, e.g. modules/facet/, which has a separate manifest for its example jar. ",
            "author": "Steve Rowe",
            "id": "comment-13207524"
        },
        {
            "date": "2012-02-14T05:49:43+0000",
            "content": "My motivation for this issue was to try to get the jar produced by ant generate-maven-artifacts be the exact same as that produced by ant dist, but it is not, even though all file contents, including the manifest, are identical.  The metadata in the jar must be different, because the jars produced by these two are the same size, and all their files' contents are identical.  I tried adding update=\"true\" to the <jar> task used to build the jars, so that the files inside would be updated instead of completely regenerated, and \nwhile the jar file was successfully updated, the two jars still were not identical.\n\nSo I'm not sure whether this should be committed.  ant generate-maven-artifacts will have to take another tack to enable its jars to be identical to those produced by ant dist. ",
            "author": "Steve Rowe",
            "id": "comment-13207530"
        },
        {
            "date": "2012-02-14T18:37:08+0000",
            "content": "This version of the patch only provides per-artifact manifest files - these manifest files are always rebuilt, as is currently the case.  (I'd rather not make manifests the only part of the build that can get stale between ant clean invocations.)\n\nThe patch also contains a new macro <solr-jarify>, which provides Solr-specific default attributes, and then calls <jarify>, so that these values don't have to be specified everywhere in Solr build files - I noticed that one of the Solr <jarify> invocations was missing a Solr-specific value.\n\nThe manifest filename can now have more than one value in a module, though only the facet module uses this capability right now, to provide a different value in the manifest for the examples jar.\n\nUnless there are objections, I will commit this tomorrow. ",
            "author": "Steve Rowe",
            "id": "comment-13207890"
        },
        {
            "date": "2012-02-14T18:41:02+0000",
            "content": "+1 ",
            "author": "Robert Muir",
            "id": "comment-13207892"
        },
        {
            "date": "2012-02-15T15:37:08+0000",
            "content": "Committed to trunk.\n\nBackporting to branch_3x now. ",
            "author": "Steve Rowe",
            "id": "comment-13208544"
        },
        {
            "date": "2012-02-15T22:30:56+0000",
            "content": "Committed to branch_3x. ",
            "author": "Steve Rowe",
            "id": "comment-13208877"
        }
    ]
}