{
    "id": "LUCENE-5789",
    "title": "Fix issue with newsticker and other included stuff on Lucene webpage",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [
            "general/website"
        ],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "When talking to asfinfra today, they told me, that there is a solutions for the problem we have on the Lucene web page:\n\nThe index markdown file includes other files like the newsticker markdown. If you update the newsticker, the main webpage is not updated, unless you do a fake commit on the index markdown.\n\nThe solution is here (Apache Thrift uses this, including example):\n\n\n[18:46]\tjoes4: ThetaPh1: the way to deal with included files is through the %path::dependencies hash\n[18:46]\tThetaPh1: ah there is a solution for that?\n[18:46]\tjoes4: yes see the thrift cms site\n[18:46]\tThetaPh1: the last time we asked there was only the fake commit on the file that includes\n[18:46]\tThetaPh1: in short: how must the link look like?\n[18:47]\tjoes4: $dependencies{\"path_to_base_file\"} = [ @list_of_files_to_be_included ]\n[18:47]\tjoes4: in path.pm\n[18:49]\tThetaPh1: ok, I'll open a lucene issue to fix this on our website\n[18:49]\tThetaPh1: it mainly affects news ticker, which is a separte markdown\n[18:49]\tjoes4: https://svn.apache.org/repos/asf/thrift/cms-site/trunk/lib/path.pm\n[18:49]\tjoes4: they are doing ther state of the art\n[18:50]\tjoes4: dynamicly generated %dependencies hash",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14043787",
            "author": "Joe Schaefer",
            "content": "All paths for the %dependencies hash are rooted in the content/ directory. ",
            "date": "2014-06-25T17:28:12+0000"
        },
        {
            "id": "comment-14047749",
            "author": "Joe Schaefer",
            "content": "Looking at the mechanism behind this... it seems you have certain templates that include files within the content/ dir.\nWould you like me to upgrade your view.pm file so you can use templating constructs from within markdown files?\nYou have a lot of cruft in there that was copied from www.apache.org long ago. ",
            "date": "2014-06-30T15:28:27+0000"
        },
        {
            "id": "comment-14047750",
            "author": "Uwe Schindler",
            "content": "Hi Joe,\nI would be happy if you help me. I had no time to look into this up to now, so any help is appreciated. ",
            "date": "2014-06-30T15:31:03+0000"
        },
        {
            "id": "comment-14047798",
            "author": "Joe Schaefer",
            "content": "Ok you should be good now.  The logic is a little tortured in the way these files are being included, which can be\nmade clearer by passing \"preprocess => 1\" in your view arguments for those files, which will allow you to include\ncontent using template expressions directly in your markdown sources. ",
            "date": "2014-06-30T16:15:35+0000"
        },
        {
            "id": "comment-14047822",
            "author": "Uwe Schindler",
            "content": "Thanks Joe,\nif you just give me a short snippet how to include for example the mainnews.mdtext markdown into the index.mdtext homepage without using the templates. In my opinion, the workaround with the templates to do all includes was horrible to use.\n\nI am verifying the current staging website and check if its identical to the current published one - sor far, looks good. I will go forward and publish the changes done by you later. The code looks much simplier now, because it just includes the official Apache \"View\" perl script. ",
            "date": "2014-06-30T16:35:49+0000"
        },
        {
            "id": "comment-14047836",
            "author": "Joe Schaefer",
            "content": "Ok I'm done converting things.  Try to keep a clean separation between stuff in content/ and stuff in templates/- things will work better that way. ",
            "date": "2014-06-30T16:49:44+0000"
        }
    ]
}