{
    "id": "LUCENE-3978",
    "title": "redo how our download redirect pages work",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "the download \"latest\" redirect pages are kind of a pain to change when we release a new version...\n\nhttp://lucene.apache.org/core/mirrors-core-latest-redir.html\nhttp://lucene.apache.org/solr/mirrors-solr-latest-redir.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-12T22:40:42+0000",
            "content": "when we released 3.6, we ran into a few annoyances...\n\n\n\tthese pages require that you edit the template (not availbale in the bookmarklet) to change the 3.5.0 to 3.6.0 in the final URL\n\tthese pages were in browser caches, so they weren't seeing the cahnges in the javascript redirect (rmuir added some no-cache metadata headers, so hopefully this won't be a problem again)\n\n\n\nMy suggestion for the future...\n\n\n\teliminate these templates and their mdtext pages entirely\n\treplace them with a .htaccess redirect rule that looks like:\n\n/([^/*)/mirrors-(.*)-latest-redir.html /$1/mirrors-$2-redir.html?3.6.0\n\n\n\tupdate the templates for mirrors-solr-redir.mdtext and mirrors-core-redir.mdtext so that the javascript will use the query string when building the final URL\n\n\n\n...that way whenever we release a new version, we can just tweak the .htaccess rule, and the only \"html pages\" that might ever show up in an http or browser caches will have unique URLs per version.\n\n(EDIT: 1. fix fucking code markup, 2. didn't mean for redir rule to include \"latest\" ... sigh: 3. only ment to remove latest from the redir dest) ",
            "author": "Hoss Man",
            "id": "comment-13252940"
        },
        {
            "date": "2012-04-13T05:20:46+0000",
            "content": "Hi Hoss,\nI have seen your commit and I now understand the reason for the redirect pages (to also count downloads by Google Analytics). As I also did GA tracking for webpages not long ago, there is a better/more correct solution to track downloads. The trick is to add some javascript to the source link that tells Google Analytics to create a \"virtual pageview\" when clicking on the link. The virtual pageview is counted on a \"virtual\" URI (e.g., the current URL with the redirect page, without http and hostname): http://support.google.com/googleanalytics/bin/answer.py?hl=en&answer=55529 In fact, the trick is to execute the analytics javascript on the link click and pass a \"custom\" url instead the default one from the current page. ",
            "author": "Uwe Schindler",
            "id": "comment-13253121"
        },
        {
            "date": "2012-04-13T05:29:40+0000",
            "content": "Uwe: if i'm understanding that page correctly, this would only be possible for links where:\n a) link html is on our site\n b) we can control the html used to generate them\n...which isfine for the bug buttons on lucene.apache.org, and any other download links we might want to include on those CMS pages, but not for things like links from wiki.apache.org, or the URLs we include in our plain text release announcement emails (that users just cut/paste) or that we submit to any other site to promote the release. ",
            "author": "Hoss Man",
            "id": "comment-13253126"
        },
        {
            "date": "2012-04-13T06:11:52+0000",
            "content": "Hoss: That's the problem. For links on external pages to our downloads we cannot track, only with a redirect page. But people adding links to their pages will always link-through, so we cannot enforce that they go through analytics code.\n\nBut analytics should track page usage (means the action \"clicking link on our homepage\") and not download usage in general (which is diametral somehow). Tracking of downloads is in Apache's responsibility. ",
            "author": "Uwe Schindler",
            "id": "comment-13253157"
        },
        {
            "date": "2012-07-11T23:03:44+0000",
            "content": "bulk cleanup of 4.0-ALPHA / 4.0 Jira versioning. all bulk edited issues have hoss20120711-bulk-40-change in a comment ",
            "author": "Hoss Man",
            "id": "comment-13412293"
        },
        {
            "date": "2012-08-07T03:41:27+0000",
            "content": "rmuir20120906-bulk-40-change ",
            "author": "Robert Muir",
            "id": "comment-13429710"
        },
        {
            "date": "2013-07-23T18:44:54+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717095"
        },
        {
            "date": "2014-04-16T12:54:38+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970822"
        },
        {
            "date": "2017-01-25T10:58:22+0000",
            "content": "This question also arose as part of the 6.4 release this week:\n\n\tIf a user's browser has it cached then the page redirects potentially to the download page for not-the-latest release (though this can be avoided by doing a 'refresh' in the few seconds before the page redirects to the download page).\n\n\n\nlink into the dev mailing list thread: http://apache.markmail.org/thread/r42bsejhjtbgm3gp ",
            "author": "Christine Poerschke",
            "id": "comment-15837568"
        }
    ]
}