{
    "id": "LUCENE-1472",
    "title": "DateTools.stringToDate() can cause lock contention under load",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "2.3.2",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Load testing our application (the JIRA Issue Tracker) has shown that threads spend a lot of time blocked in DateTools.stringToDate().\n\nThe stringToDate() method uses a singleton SimpleDateFormat object to parse the dates.\nEach call to SimpleDateFormat.parse() is synchronized because SimpleDateFormat is not thread safe.",
    "attachments": {
        "LUCENE-1472.patch": "https://issues.apache.org/jira/secure/attachment/12469338/LUCENE-1472.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-12-01T03:37:33+0000",
            "content": "The following methods would potentially suffer contention as well depending on usage patterns of the particular app:\n\n\tstringToTime()\n\tdateToString()\n\ttimeToString()\n\n ",
            "author": "Mark Lassau",
            "id": "comment-12651899"
        },
        {
            "date": "2008-12-01T03:42:04+0000",
            "content": "SimpleDateFormat javadoc:\n\n\nDate formats are not synchronized.\nIt is recommended to create separate format instances for each thread.\nIf multiple threads access a format concurrently, it must be synchronized externally. ",
            "author": "Mark Lassau",
            "id": "comment-12651900"
        },
        {
            "date": "2008-12-01T18:29:10+0000",
            "content": "Could you try changing the code to create a new object every time and then run your load test again? We original did that but it was slower, at least according to this commit comment from two years ago:\n\n\"Don't re-create SimpleDateFormat objects, use static ones instead. Gives about a 2x performance increase in a micro benchmark.\" ",
            "author": "Daniel Naber",
            "id": "comment-12652085"
        },
        {
            "date": "2008-12-01T23:04:15+0000",
            "content": "ThreadLocal? ",
            "author": "Doug Cutting",
            "id": "comment-12652194"
        },
        {
            "date": "2008-12-02T00:00:58+0000",
            "content": "My original thought was ThreadLocal, but I tend to try and avoid these where possible.\n\nI wanted to test the speed on creating a new Calendar (rather than SimpleDateFormat) for each request, but was worried about the instantiation overhead.\nDaniel's comment above reinforces this concern to some extent, so we'll have to wait and compare benchmarks. ",
            "author": "Mark Lassau",
            "id": "comment-12652206"
        },
        {
            "date": "2008-12-02T00:43:30+0000",
            "content": "If you review the source for SimpleDateFormat you will see that it internally performs some synchronization during initialization anyway (uses some Hashtables), and  also that the initialization cost is pretty high (lots of code), so a static sync'd copy is probably best.\n\nOutside of that, the ThreadLocal is the way to go.\n\nMy tests shows that the instantiation time is 2x longer than the typical parse time.\n ",
            "author": "robert engels",
            "id": "comment-12652220"
        },
        {
            "date": "2008-12-02T00:47:57+0000",
            "content": "The last comment was tested using Java 5.\n\nIt is my understanding that in Java 6, synchronization has become even cheaper - although object creation is cheaper as well - although 99% of the instantiation time of SimpleDateFormat is in the init code, not the object creation.\n\nI know there has been a lot of discussion of the \"problems\" with ThreadLocals... I've been a part of most of them  - but for these very small objects, the typical ThreadLocal memory issues don't really apply.\n ",
            "author": "robert engels",
            "id": "comment-12652221"
        },
        {
            "date": "2008-12-02T11:26:01+0000",
            "content": "I agree: ThreadLocal, despite its problems, is probably the best solution here.  The memory cost ought to be tiny.\n\nWe could also use CloseableThreadLocal (which works around the problems of ThreadLocal), and then allow DateTools to be instantiated, and add a close() method to it (vs the all-static methods we have today).  This way the application could close the DateTools instance and reliably free up the tiny amount of memory used. ",
            "author": "Michael McCandless",
            "id": "comment-12652336"
        },
        {
            "date": "2009-02-16T01:14:56+0000",
            "content": "An update for anyone interested:\n\nThe test run that showed this contention suffered even worse contention in another component of our application.\nSince we have fixed that component, we have no longer observed contention in DateTools.stringToDate(). \n\nFor that reason, this issue is not now considered a priority for us. ",
            "author": "Mark Lassau",
            "id": "comment-12673771"
        },
        {
            "date": "2009-03-18T16:58:33+0000",
            "content": "Removing 2.9 target. ",
            "author": "Michael McCandless",
            "id": "comment-12683076"
        },
        {
            "date": "2011-01-25T21:32:16+0000",
            "content": "This is not longer highest priority, but the fix using ThreadLocal without close seems to be the best possibility. We use this in our local applications, too when we have a pool of DateFormats. I will take care on applying this patch.\n\nIn general, this NumericRangeQuery and NumericField should be used when dates should be indexed. ",
            "author": "Uwe Schindler",
            "id": "comment-12986696"
        },
        {
            "date": "2011-01-25T21:52:33+0000",
            "content": "Here the patch, using one ThreadLocal statically.\n\n(theoretically this class still contains a non-enum which shold in reality an enum. We can change this later or deprecate this class at all)\n\nI will commit tomorrow to trunk and 3.x ",
            "author": "Uwe Schindler",
            "id": "comment-12986706"
        },
        {
            "date": "2011-01-25T22:19:27+0000",
            "content": "Better patch with also the stupid enum declared as enum. Now the constant lookup should even faster (in table-switch statement).\n\nWill commit soon. ",
            "author": "Uwe Schindler",
            "id": "comment-12986723"
        },
        {
            "date": "2011-01-25T22:30:21+0000",
            "content": "Committed trunk revision: 1063493\nCommitted 3.x revision: 1063494 ",
            "author": "Uwe Schindler",
            "id": "comment-12986728"
        },
        {
            "date": "2011-03-30T15:50:31+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013511"
        }
    ]
}