{
    "id": "LUCENE-2151",
    "title": "Abstract the distance calculation process in the Spatial contrib",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The spatial contrib shouldn't tie users to one particular way of calculating distances.  Wikipedia lists multiple different formulas for the great-circle distance calculation, and there are alternatives to that as well.  In a situation where many documents have the same points, it would be useful to be able to cache some calculated values as well (currently this is sort of handled in the filtering process itself).  \n\nThis issue addresses this by abstracting away the distance calculator, allowing the user to provide the implementation of choice.  It would then be possible to swap in different distance calculation strategies without altering the distance filtering process itself.",
    "attachments": {
        "LUCENE-2151.patch": "https://issues.apache.org/jira/secure/attachment/12427725/LUCENE-2151.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-12-11T14:17:02+0000",
            "content": "Attached patch that adds in the GeoDistanceCalculator interface, with 2 impls:\n\n\n\tArcGeoDistanceCalculator (note it was known as ArcDistanceCalculator in previous patches, this addresses this inconsistency) - This calculator emulates the existing distance calculation algorithm.\n\tPlaneGeoDistanceCalculator - This calculator assumes the the earth is flat, and does simple trigonometry.  This obviously includes an error, but it maybe an error that is acceptable to some.\n\n\n\nTests for both impls are included ",
            "author": "Chris Male",
            "id": "comment-12789321"
        },
        {
            "date": "2009-12-18T12:51:47+0000",
            "content": "Updated patch so that it uses the DistanceUnits.convert instance method. ",
            "author": "Chris Male",
            "id": "comment-12792461"
        },
        {
            "date": "2010-12-01T09:54:14+0000",
            "content": "Closing along with LUCENE-2139 ",
            "author": "Chris Male",
            "id": "comment-12965643"
        }
    ]
}