{
    "id": "LUCENE-846",
    "title": "IOExeception can cause loss of data due to premature segment deletion",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.2"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "If you hit an IOException, e.g., disk full, while making a cfs from its constituent parts, you may not be able to rollback to the before-merge process. This happens via addIndexes.\n\nI don't have a nice easy test for this; generating IOEs ain't so easy. But it does happen in the patch for the factored merge policy with the existing tests because the pseudo-randomly generated IOEs fall in a different place.",
    "attachments": {
        "LUCENE-846-test.txt": "https://issues.apache.org/jira/secure/attachment/12354119/LUCENE-846-test.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-03-23T19:59:00+0000",
            "content": "Hmmm, this does not sound good!  I'll apply the patch and track it down. ",
            "author": "Michael McCandless",
            "id": "comment-12483725"
        },
        {
            "date": "2007-03-23T20:11:05+0000",
            "content": "Steve, I applied the patch from LUCENE-847 and all tests ran successfully.  Do I need to do something else to see this issue happen? ",
            "author": "Michael McCandless",
            "id": "comment-12483729"
        },
        {
            "date": "2007-03-23T20:16:28+0000",
            "content": "Ahh ... meant to mention that. I disabled TestIndexWriter#testAddIndexOnDiskFull in the patch by prefixing the name with an underscore. Remove it to reenable the test. ",
            "author": "Steven Parkes",
            "id": "comment-12483732"
        },
        {
            "date": "2007-03-23T20:20:27+0000",
            "content": "OK, thanks.\n\nHurm, I found the _, removed it, but the test still ran successfully.  Now I'm getting nervous! ",
            "author": "Michael McCandless",
            "id": "comment-12483734"
        },
        {
            "date": "2007-03-23T20:33:09+0000",
            "content": "Dang. It used to fail but I've made some updates since then that would change the merge policy (fancy that) and it's no longer happening.\n\nLet me see if I have a snapshot lying around that has the old code where it still happens.\n\n[As as aside, I've been thinking of looking into svk or brz (or whatever its called) that would allow me to version control stuff without it going into svn. All of a sudden I can see why the linux folks like distributed version control ...] ",
            "author": "Steven Parkes",
            "id": "comment-12483738"
        },
        {
            "date": "2007-03-23T21:00:49+0000",
            "content": "Okay, here's an old version of 847 that demonstrates the problem (at least it does for me.)\n\nNo looking at the rest of my half-baked code.\n\nAnd there's a bunch of debugging turned on in the patch, too. ",
            "author": "Steven Parkes",
            "id": "comment-12483747"
        },
        {
            "date": "2007-03-25T10:16:14+0000",
            "content": "Excellent I can repro the problem as well, thanks Steven!\n\nOK I see what's going on here: if you open a writer with\nautoCommit=false, and you call addIndexes, and you hit an exception\n(eg disk full) during the addIndexes, the addIndexes call tries to\nrollback to the index state when it started but in doing so restores\nthe writer's SegmentInfos instance to where it was when addIndexes\nstarted.\n\nThe problem is when autoCommit is false those segments have often\nalready been replaced/merged/etc. and are now gone.\n\nThe good news is this bug was born with the fix for LUCENE-710, so, it\nhas not been released yet.\n\nAlso good news is this is straightforward to fix: the addIndexes calls\njust need to incRef this SegmentInfos' files at the start (and then\ndecRef once done) to protect them from deletion. ",
            "author": "Michael McCandless",
            "id": "comment-12483919"
        }
    ]
}