{
    "id": "LUCENE-6012",
    "title": "AnalyzingSuggester exception because of length restriction: java.lang.IllegalArgumentException: len must be <= 32767; got 38751",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [],
        "affect_versions": "4.10.1",
        "status": "Open",
        "fix_versions": []
    },
    "description": "I want to use a suggester but every time i want to build the index I get an exception.\nAs the exception comes from AnalyzingSuggester all kind of suggesters that are subclasses fail to build.\nBy now I don't understand the code for the suggester well and thus was not able to track the error further down.\n\nOfflineSorter$ByteSequencesWriter tries to write the length of the bytearray which not exceed 32767 because it is a short.\n\n6877 [http-bio-8080-exec-2] ERROR org.apache.solr.core.SolrCore  - java.lang.IllegalArgumentException: len must be <= 32767; got 38751\n        at org.apache.lucene.util.OfflineSorter$ByteSequencesWriter.write(OfflineSorter.java:479)\n        at org.apache.lucene.search.suggest.analyzing.AnalyzingSuggester.build(AnalyzingSuggester.java:496)\n        at org.apache.lucene.search.suggest.Lookup.build(Lookup.java:190)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14176793",
            "author": "Michael McCandless",
            "content": "This is just a [sensible] limitation of this suggester: it refuses to build immensely long suggestions.  Can you describe your use case / why you need such massive suggestions?  Are you storing a huge payload in there or something...? ",
            "date": "2014-10-20T10:30:23+0000"
        },
        {
            "id": "comment-14176822",
            "author": "Daniel Aschauer",
            "content": "Thanks, Michael!\nYes, i recognized that it is a limitation, but i am not aware why it is restricted to a SHORT value. Suggestions in my case are based on the field of the main content, so yes eventually there is a lot of text coming in. Is the limitation of 32767 the length of the text (measured in bytes) in the field, or what is exactly what I would have to shorten in my case? ",
            "date": "2014-10-20T11:33:02+0000"
        },
        {
            "id": "comment-14209633",
            "author": "Michael McCandless",
            "content": "Well, the limitation is 32767 bytes, internally, where the bytes contains the utf8 encoded suggestion, its analyzed form, the payload, the weight, etc.  So the actual limit will be ~1/2 or less of 32767.  But, still: this already seems like a massively long suggestion?  I don't think we should increase it? ",
            "date": "2014-11-13T11:49:25+0000"
        },
        {
            "id": "comment-14640394",
            "author": "Michael Aleythe",
            "content": "does this limitation mean that the main text-field from the index should not be used as the base field for the suggestion component? ",
            "date": "2015-07-24T12:28:28+0000"
        }
    ]
}