{
    "id": "LUCENE-775",
    "title": "Searcher code creating Hits is somewhat messy",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "This patch makes sure all Hits-resulting queries sent to Searcher pass though the same methods, rather than an ad hoc Hits call per method call. Did it so it would be easier for me to implement this decorated searcher cache of mine.\n\nI could not find any implementations overriding the methods I set final, so I think it is allright.",
    "attachments": {
        "searcher.diff": "https://issues.apache.org/jira/secure/attachment/12348902/searcher.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-01-15T07:14:20+0000",
            "content": "I agree that's messy and should be cleaned up .. while we're at it the Hits constructor has just as much redundency.\n\ni don't think it's safe to make those methods final though ... there may not be any subclasses in the tree, but that's no garuntee there aren't users with their own subclasses (consider all the people who might have written a proxy cache like you are but needed to override all of those methods to do so)\n\ncan you explain this...\n\n+  /** Sub class ad hoc IndexReader coupling */\n+  protected IndexSearcher() \n{\n+  }\n\n\"reader\" is package protected, so any out of package subclass that uses this constructor is pretty much screwed right? .. how is would this constructor be useful?\n ",
            "author": "Hoss Man",
            "id": "comment-12464669"
        },
        {
            "date": "2007-01-15T09:36:07+0000",
            "content": "> can you explain this...\n> \n> +  /** Sub class ad hoc IndexReader coupling */\n> +  protected IndexSearcher() \n{\n> +  }\n> \n> \"reader\" is package protected, so any out of package subclass that uses this\n>  constructor is pretty much screwed right? .. how is would this constructor be useful?\n\nSorry, that is an old artifact from a hack, not ment for the patch.  I'll refresh the patch.\n\n> i don't think it's safe to make those methods final though ... there may not be any \n> subclasses in the tree, but that's no garuntee there aren't users with their own subclasses\n> (consider all the people who might have written a proxy cache like you are but needed \n> to override all of those methods to do so) \n\nI personally  think they should change their code to override only the non-final method call. Anything else would be overkill. At least that is what I concluded while making these changes, hence the finals. But if it is final or not does not matter much to me. It is all good as long all Hits-returining method calls pass by that last non-final method in this patch. ",
            "author": "Karl Wettin",
            "id": "comment-12464708"
        },
        {
            "date": "2007-07-28T07:46:05+0000",
            "content": "More nasty old code I'm getting ridth of. ",
            "author": "Karl Wettin",
            "id": "comment-12516148"
        }
    ]
}