{
    "id": "LUCENE-3414",
    "title": "Bring Hunspell for Lucene into analysis module",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "New Feature",
        "fix_versions": [
            "3.5",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Some time ago I along with Robert and Uwe, wrote an Stemmer which uses the Hunspell algorithm.  It has the benefit of supporting dictionaries for a wide array of languages.   \n\nIt seems to still be being used but has fallen out of date.  I think it would benefit from being inside the analysis module where additional features such as decompounding support, could be added.",
    "attachments": {
        "LUCENE-3414.patch": "https://issues.apache.org/jira/secure/attachment/12493112/LUCENE-3414.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-09-05T20:44:39+0000",
            "content": "+1\n\nWe now use Lucene Hunspell for a few customer deployments, and it would be great to have it the analysis module, since it supports some 70-80 languages out of the box, and gives great flexibility since you can edit - or augment - the dictionaries to change behaviour and fix stemming bugs.\n\nAs a side benefit I also expect that when the Ooo dictionaries get more use in Lucene, users will over time be able to extend and improve the dictionaries, and contribute their changes back, benefiting also Ooo users. ",
            "author": "Jan Høydahl",
            "id": "comment-13097318"
        },
        {
            "date": "2011-09-06T04:54:23+0000",
            "content": "Patch with a port of the code.\n\nBecause most of the dictionaries are L/GPL, I've written my own dumb stupid dictionary for test purposes.\n\nDuring testing I discovered a long standing bug to do with recursive application of rules This has now been fixed.\n\nCode now is also version aware, as required by the CharArray* data structures. ",
            "author": "Chris Male",
            "id": "comment-13097741"
        },
        {
            "date": "2011-09-06T09:46:13+0000",
            "content": "Thanks Chris for adding this to Lucene Analysis module. We did lots of work on Google Code, so it should really be in Lucene, except the dictionaries. We should only add links to web pages where to get them. ",
            "author": "Uwe Schindler",
            "id": "comment-13097852"
        },
        {
            "date": "2011-09-06T09:53:14+0000",
            "content": "...so it should really be in Lucene, except the dictionaries.\nhow is OpenOffice dealing with those dictionaries since they are now an ASF incubation project? Maybe the dictionaries are under ASL eventually? ",
            "author": "Simon Willnauer",
            "id": "comment-13097859"
        },
        {
            "date": "2011-09-06T09:59:28+0000",
            "content": "how is OpenOffice dealing with those dictionaries since they are now an ASF incubation project? Maybe the dictionaries are under ASL eventually?\n\nBizarrely, from what I can see in the OpenOffice SVN, they are still under their original license.  I guess thats something they will have to sort out during incubation.\n\nI don't see the licenses changing since the dictionaries tend to be developed by national language organisations, but maybe the ASF will negotiate. ",
            "author": "Chris Male",
            "id": "comment-13097861"
        },
        {
            "date": "2011-09-06T11:41:26+0000",
            "content": "\nBizarrely, from what I can see in the OpenOffice SVN, they are still under their original license. \n\nI don't think we should read too much into that text file: its not even obvious which of the many dictionaries in that folder it applies to!\n\nI know for a fact that some of the files in there are NOT GPL, for example the en_US dictionary: http://svn.apache.org/viewvc/incubator/ooo/trunk/main/dictionaries/en/README_en_US.txt?revision=1162288&view=markup ",
            "author": "Robert Muir",
            "id": "comment-13097916"
        },
        {
            "date": "2011-09-06T12:07:14+0000",
            "content": "Okay good spotting. so how do we want to proceed? Do we want to bring some of the dictionaries in? Should we address that in a later issue once its become clearer in OO what they're doing? ",
            "author": "Chris Male",
            "id": "comment-13097937"
        },
        {
            "date": "2011-09-06T12:12:38+0000",
            "content": "I don't think we should do anything with the dictionaries ever, its much better to make small \"test\" dictionaries that are actually more like unit tests and test certain things, like what you did in the patch. ",
            "author": "Robert Muir",
            "id": "comment-13097945"
        },
        {
            "date": "2011-09-08T09:44:11+0000",
            "content": "Patch now includes a package.html linking to a PDF about hunspell and suggesting dictionaries are sourced from the OpenOffice wiki.\n\nCommitting tomorrow. ",
            "author": "Chris Male",
            "id": "comment-13100183"
        },
        {
            "date": "2011-09-10T06:01:06+0000",
            "content": "Committed revision 1167467. ",
            "author": "Chris Male",
            "id": "comment-13101988"
        },
        {
            "date": "2011-09-10T12:26:59+0000",
            "content": "Reopening for 3x backport. ",
            "author": "Chris Male",
            "id": "comment-13102028"
        },
        {
            "date": "2011-09-10T12:40:51+0000",
            "content": "3x back port:\n\nCommitted revision 1167505. ",
            "author": "Chris Male",
            "id": "comment-13102032"
        },
        {
            "date": "2011-09-14T15:20:34+0000",
            "content": "Is there a JIRA for adding HunspellStemFilterFactory to Solr? ",
            "author": "Jan Høydahl",
            "id": "comment-13104564"
        },
        {
            "date": "2011-09-14T15:26:40+0000",
            "content": "Nope, its on my mental TODO but go for it. ",
            "author": "Chris Male",
            "id": "comment-13104568"
        },
        {
            "date": "2011-09-15T09:00:41+0000",
            "content": "SOLR-2769 ",
            "author": "Jan Høydahl",
            "id": "comment-13105227"
        },
        {
            "date": "2011-11-27T12:29:30+0000",
            "content": "Bulk close after release of 3.5 ",
            "author": "Uwe Schindler",
            "id": "comment-13157778"
        }
    ]
}