{
    "id": "LUCENE-2163",
    "title": "Remove synchronized from DirReader.reopen/clone",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Spinoff from LUCENE-2161, where the fact that DirReader.reopen is\nsync'd was dangerous in the context of NRT (could block all searches\nagainst that reader when CMS was throttling).  So, with LUCENE-2161,\nwe're removing the synchronization when it's an NRT reader that you're\nreopening.\n\nBut... why should we sync even for a \"normal\" reopen?  There are\nvarious sync'd methods on IndexReader/DirReader (we are reducing that,\nwith LUCENE-2161 and also LUCENE-2156), but, in general it doesn't\nseem like \"normal\" reopen really needs to be sync'd.  Performing a reopen\nshouldn't incur any chance of blocking a search...",
    "attachments": {
        "LUCENE-2163.patch": "https://issues.apache.org/jira/secure/attachment/12544666/LUCENE-2163.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-11T16:47:56+0000",
            "content": "We've made awesome progress removing sync'd, now that SR is read-only ... but I found a few remaining sync'd in StandardDirectoryReader that I think are not necessary?\n\nEg doClose is already protected by IR.close (only one thread will decRef to RC=0).\n\nAnd for doOpenIfChanged/noWriter... why do they need to be sync'd?  If it's solely to prevent strange exceptions when one thread is closing while another is reopening ... I don't think we need to do that (it's \"best effort\", and I think likely you'd get ACE anyway since we'd try to incRef an already-closed SR)?\n\nBut then again I suppose the sync'd are not really hurting anything (it won't block searches since nothing else is sync'd...).  Still it's nice to remove them if we can, in case something on the search path does become sync'd at some point ... ",
            "author": "Michael McCandless",
            "id": "comment-13453166"
        },
        {
            "date": "2012-09-11T17:10:21+0000",
            "content": "If doClose is protected by close() it is a no-op, so it does not matter if there is a sync or not \n\nThe other ones I already wanted to remove while refactoring, I just missed to do it. I think this issue is a relict from earlier times... I would just commit that removal. If you sync on reopen, you must sync everything. ",
            "author": "Uwe Schindler",
            "id": "comment-13453180"
        },
        {
            "date": "2013-03-22T16:41:28+0000",
            "content": "[branch_4x commit] Michael McCandless\nhttp://svn.apache.org/viewvc?view=revision&revision=1383887\n\nLUCENE-2163: remove unnecessary sync ",
            "author": "Commit Tag Bot",
            "id": "comment-13610871"
        },
        {
            "date": "2013-05-10T10:33:57+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654078"
        }
    ]
}