{
    "id": "LUCENE-7280",
    "title": "SpatialStrategy impl for GeoPointField",
    "details": {
        "resolution": "Won't Fix",
        "affect_versions": "None",
        "components": [
            "modules/spatial-extras"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Resolved",
        "type": "New Feature"
    },
    "description": "It would be cool if were a SpatialStrategy (an abstraction in spatial-extras module) implementation for GeoPointField (in \"spatial\" module).  In this way code that uses the SpatialStrategy abstraction could leverage this implementation with no code changes, aside from the construction part.  \n\nPerhaps the biggest part of doing this is creating implementations of the Spatial4j abstractions to, ultimately, create Shape impls that are basic POJOs to hold the basic data but otherwise do no calculations (throw exceptions from relate(), etc.).  Then, SpatialStrategy.createQuery can cast the Shape to see what sort of shape it is before calling, e.g. GeoPointInPolygonQuery.  Those Spatial4j abstractions might be used for other future SpatialStrategy wrappers, like for Geo3DPoint, or LatLonPoint.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16184240",
            "author": "Anton R. Yuste",
            "date": "2017-09-28T14:23:05+0000",
            "content": "I would be interested in contribute with this issue. It seems a good way to learn more about lucene and the spatial module. Is it valid yet?\n\nI've been taking a look to the source code but I don't find some classes as GeoPointField in the spatial module or GeoPointInPolygonQuery, are they deprecated?. Some more low level info would be welcomed if possible "
        },
        {
            "id": "comment-16184331",
            "author": "David Smiley",
            "date": "2017-09-28T15:40:19+0000",
            "content": "GeoPointField was removed from lucene/spatial module for 7.x.  LatLonPoint and related fields in the lucene/sandbox module have effectively supplanted it.  So we could file a new issue similar to this one, however I'm not sure if there are committer/PMC members that may object to lucene/spatial-extras depending on lucene/sandbox.  I don't for this case since lucene/spatial-extras has more broad dependencies already (it's essentially the only module with an external dependency).  Adrien Grand I think you may have last expressed comments on sandbox inward dependencies?\n\nI think everyone agrees that the current placement of LatLonPoint in lucene/sandbox is poor but there is disagreement on wether it move to lucene/core or lucene/spatial – LUCENE-7314.  The situation vexes me. "
        },
        {
            "id": "comment-16185425",
            "author": "Anton R. Yuste",
            "date": "2017-09-29T06:45:55+0000",
            "content": "Thanks for the update, David Smiley and sorry for revive a complicated situation. I will continue the search for \"easy-to-start\" issues in the spatial module "
        },
        {
            "id": "comment-16185871",
            "author": "Adrien Grand",
            "date": "2017-09-29T14:06:07+0000",
            "content": "I think that any module depending on sandbox is trappy, as sandbox is supposed to be for the more experimental stuff. Also agree that it is a pity that LatLonPoint remained in sandbox. "
        }
    ]
}