{
    "id": "LUCENE-4150",
    "title": "Change version properties in branch_4x to \"4.0-ALPHA-SNAPSHOT\"",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/build"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "The next release off branch_4x will be named \"4.0-ALPHA\", so the current version string should be \"4.0-ALPHA-SNAPSHOT\".\n\n(Similarly, after 4.0-ALPHA is released, the version string should be changed to \"4.0-BETA-SNAPSHOT\".)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-06-17T03:19:47+0000",
            "content": "Also, shouldn't we have releases 4.0-ALPHA and 4.0-BETA defined in JIRA? ",
            "author": "Steve Rowe",
            "id": "comment-13393425"
        },
        {
            "date": "2012-06-17T11:15:04+0000",
            "content": "I don't think we should do this. The version logic in e.g. Constants is already insanely scary.\nTheres no benefit to making -ALPHA-SNAPSHOT when -ALPHA is already a snapshot. \n\n\nAlso, shouldn't we have releases 4.0-ALPHA and 4.0-BETA defined in JIRA?\n\nNo. We are targeting 4.0, these are just snapshots of that! ",
            "author": "Robert Muir",
            "id": "comment-13393526"
        },
        {
            "date": "2012-06-17T11:25:11+0000",
            "content": "Since 2.9 releases we never change the version numbers in common-build.xml. This is not done, bacuse when anybody builds the release from a SVN checkout or a modified local src.tgz extraction, he will not produce the same artifacts. Because of that we only have the branch name in the default verson string.\n\nWhen a release is prepared, we explicitely set the version number using -Dversion=foobar.\n\nP.S.: This means, when somebody downloads Lucene-3.6.0-src.tgz and then calls ant package, he will get a -dev/-snapshot build unless he uses -Dversion. ",
            "author": "Uwe Schindler",
            "id": "comment-13393529"
        },
        {
            "date": "2012-06-17T11:44:36+0000",
            "content": "Right, i think its correct now. If someone builds a snapshot, they get 4.0-SNAPSHOT.\n\nto make an alpha release we use -Dversion=4.0-ALPHA.\n\nAbout jira, after we release i do think we should make the version in JIRA so people\ncan report bugs against it. But I don't think we should do that now (or people will get\nconfused about what version to terget things).\n\nThe only trick here for alpha/beta is the internal number LUCENE_MAIN_VERSION used\nby IndexWriter only internally must be bumped after alpha to 4.0.0.1 or something,\nso that we know which exact version of lucene wrote the segment. it must be a number\nso that various comparators etc work. but thats totally internal to indexwriter and \nno users see it. ",
            "author": "Robert Muir",
            "id": "comment-13393530"
        },
        {
            "date": "2012-06-18T16:20:31+0000",
            "content": "About jira, after we release i do think we should make the version in JIRA so people can report bugs against it. But I don't think we should do that now (or people will get confused about what version to terget things).\n\nJust to be clear, i think this absolutely MUST be done, and would be total chaos otherwise.\n\nIf we are going to vote and have official \"Alpha\" and \"Beta\" releases that we want end users to actually try out and test thoroughly, then we are going to need a way to record when a bug was found/fixed in 4.0-Alpha vs the 4.0-Beta vs the 4.0-final.\n\nUntil we have a formally voted on Alpha it's not a big deal, but as soon as that moment happens, ever bug that currently says \"Fixed in: 4.0\" should be bulked edited to say \"Fixed in: 4.0-Alpha, 4.0\" – so that 9 months from now when someone says \"I'm still running 4.0-Alpha because there was an API change to fix a bug that made it too hard for me to upgrade to 4.0-Beta\" there is a good clean record of what bug fixes they do/don't have.\n\nNo. We are targeting 4.0, these are just snapshots of that!\n\nCalling the alpha/beta snapshots is extremely missleading and should be avoided.  The only usage of the term \"snapshot\" in apache (that i know of) are for unofficial nightly/jenkins/svn builds.  Since the alpha/beta releases will in fact be official (VOTEd) releases we should not ever imply/refer to them as \"snapshots\" since that would convey lower status on them (and reduce the likely hood of enn users testing them) then they will deserve. ",
            "author": "Hoss Man",
            "id": "comment-13396001"
        },
        {
            "date": "2012-06-18T18:31:29+0000",
            "content": "I agree with Hoss.\n\nI think 4.0-ALPHA and 4.0-BETA should be full-fledged releases in every way. ",
            "author": "Steve Rowe",
            "id": "comment-13396116"
        },
        {
            "date": "2012-06-18T18:47:34+0000",
            "content": "Everyone has the right to his own opinion: but for these alpha/betas to me they are snapshots with additional guarantees: and its better to get them out sooner than later so we can iteratively\nincorporate feedback.\n\nIf some people want these to be \"typical\" lucene solr releases each that take months to finish, good for them, but I strongly disagree (and will not be convinced otherwise!).\n\nFortunately its ok for us to disagree here, I only need to convince 2 other PMC members for us to get these things out there: its been way too long for this release.\n\nMy advice: if you want these alpha/beta releases to be more solid, get your changes in now because next week I will spin RCs every 72 hours until we get something out. \n\nI imagine with enough hassling/bribing it won't be long until 2 other people decide its good to just get the alpha release out there and get people testing it instead of dragging things out. ",
            "author": "Robert Muir",
            "id": "comment-13396129"
        },
        {
            "date": "2012-06-19T13:47:43+0000",
            "content": "and will not be convinced otherwise!\n\nI'm glad your open for discussion \n\nPersonally, I'm not at all concerned about handling these releases as we handle a typical release.\n\nIMHO, snapshot with index back compat attempted promises is the perfect commitment level. Call it a release, call it a snapshot, I'll vote for either one, but I don't think they should be full fledged releases at all.\n\nLet's dump this sucker out, and if anyone else wants to pour around some gravy after, so be it. ",
            "author": "Mark Miller",
            "id": "comment-13396762"
        },
        {
            "date": "2012-06-19T13:59:08+0000",
            "content": "By \"full fledged\" I meant only that these releases should be permanently referable to in all contexts, unlike snapshots. ",
            "author": "Steve Rowe",
            "id": "comment-13396777"
        }
    ]
}