{
    "id": "LUCENE-4089",
    "title": "fix or document termsIndexInterval/Divisor for 4.0",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "There are a few parameters on IndexWriterConfig/DirectoryReader that are going to be confusing unless we do something about it: at least documentation at the minimum:\n\n\n\tIWC.termsIndexInterval: really a codec parameter, actually ignored by 4.0's default impl (BlockTree)\n\tIWC.readerDivisor/DirectoryReader.divisor: really two things, if its -1 it means \"don't load terms index\", and this is respected by the current impls. Otherwise, it means \"sample the terms index\", and this is also actually ignored by 4.0's default impl (BlockTree)\n\n\n\nI think people will be confused if they set these things and they do nothing. As far as fixing, I took a stab at this and its an annoyingly big change. But this is the rough sketch of one idea i had so far:\n\n\tremove interval: its only applicable if you customize codec and select a different terms index/dict impl anyway, so you can just pass this to FixedGap or whatever yourself.\n\tdivisor: generalize this into something simple like a Map<String,String> of codec \"parameters\" that you set on IWC/IR. split divisor from \"don't load terms index\". define these as constants where they belong. I got unhappy here in the \"splitting\" part because I wanted the divisor part in TermsIndexReaderBase, but that doesnt extend FieldsProducer (where i wanted the \"don't load\" part) and wrap the terms dict, instead its backwards and terms dict wraps the TermsIndexReaderBase... maybe we should fix that too? I think this confusing the way it is but I didnt look at how difficult this would be.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-11T23:03:47+0000",
            "content": "bulk cleanup of 4.0-ALPHA / 4.0 Jira versioning. all bulk edited issues have hoss20120711-bulk-40-change in a comment ",
            "author": "Hoss Man",
            "id": "comment-13412319"
        },
        {
            "date": "2012-08-03T15:21:44+0000",
            "content": "I committed some javadocs in r1369022 as a temporary solution. ",
            "author": "Robert Muir",
            "id": "comment-13428180"
        },
        {
            "date": "2012-08-07T03:41:23+0000",
            "content": "rmuir20120906-bulk-40-change ",
            "author": "Robert Muir",
            "id": "comment-13429702"
        },
        {
            "date": "2013-07-23T18:44:52+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717084"
        },
        {
            "date": "2014-04-16T12:54:37+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970818"
        }
    ]
}