{
    "id": "LUCENE-6431",
    "title": "Make extrasfs reproducible",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "5.2",
            "6.0"
        ],
        "priority": "Major",
        "status": "Closed",
        "type": "Bug"
    },
    "description": "Today this is really bad, it can easily cause non-reproducible test failures. Its a per-class thing, but its decisions are based on previous events happening for that class (e.g. directory operations). \n\nEven using the filename can't work, its setup so early in the process, before test framework even ensures java.io.tempdir and similar exist. Even disregarding that, test files use a temp directory facility and those names are not reproducible (they depend on what already exists, e.g. from a previous test run).",
    "attachments": {
        "LUCENE-6431.patch": "https://issues.apache.org/jira/secure/attachment/12726065/LUCENE-6431.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14499229",
            "author": "Robert Muir",
            "date": "2015-04-17T04:36:01+0000",
            "content": "Here is a modification that is reproducible. Decisions are based solely upon target test class name. That means randomly, either a test class does not get impacted at all or gets completely terrorized by extras. And the name of the file added is always \"extra0\" since it happens on creation. "
        },
        {
            "id": "comment-14499244",
            "author": "Ryan Ernst",
            "date": "2015-04-17T04:50:31+0000",
            "content": "+1! "
        },
        {
            "id": "comment-14499400",
            "author": "Dawid Weiss",
            "date": "2015-04-17T07:34:30+0000",
            "content": "I see the problem... You'd like to \"reset\" the state of this thing before every test (and likely after, for hook methods) so that it doesn't rely on any previous calls within the suite. I don't see the point of this though:\n\n+    // a little funky: we only look at hashcode (well-defined) of the target class name.\n+    // using a generator won't reproduce, because we are a per-class resource.\n+    // using hashing on filenames won't reproduce, because many of the names rely on other things\n+    // the test class did.\n+    // so a test gets terrorized with extras or gets none at all depending on the initial seed.\n+    int hash = RandomizedContext.current().getTargetClass().toString().hashCode() ^ seed;\n+    if ((hash & 3) == 0) {\n\n\n\nthe class is going to be the same for every instantiation of the ExtraFS class. You might as well just initialize it in the constructor – it's never going to change for the same suite .\n\nThinking if there's any other way to have it consistently reset its state. "
        },
        {
            "id": "comment-14499409",
            "author": "Dawid Weiss",
            "date": "2015-04-17T07:39:02+0000",
            "content": "Ok. I guess you could do it by combining a static ExtraFs rule (and instance) with a before-test rule that would reset extrafs's random seed before every test. This way every test gets its independent ExtraFs call chain. But it adds complexity and I don't think it buys us anything (or not much). "
        },
        {
            "id": "comment-14499645",
            "author": "Robert Muir",
            "date": "2015-04-17T11:07:05+0000",
            "content": "I'm not worried about \"randomness\" of this thing at all. That's a false economy.\n\nReproducibility has to be number one. I'll commit this and anything else is sugar-on-top. "
        },
        {
            "id": "comment-14499646",
            "author": "ASF subversion and git services",
            "date": "2015-04-17T11:07:47+0000",
            "content": "Commit 1674274 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1674274 ]\n\nLUCENE-6431: make ExtrasFS reproducible "
        },
        {
            "id": "comment-14499647",
            "author": "ASF subversion and git services",
            "date": "2015-04-17T11:08:21+0000",
            "content": "Commit 1674275 from Robert Muir in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1674275 ]\n\nLUCENE-6431: make ExtrasFS reproducible "
        },
        {
            "id": "comment-14499650",
            "author": "Robert Muir",
            "date": "2015-04-17T11:09:51+0000",
            "content": "I opened LUCENE-6434 to simplify the code as you suggested.  "
        },
        {
            "id": "comment-14586890",
            "author": "Anshum Gupta",
            "date": "2015-06-15T21:44:03+0000",
            "content": "Bulk close for 5.2.0. "
        }
    ]
}