{
    "id": "LUCENE-2561",
    "title": "Fix exception handling and thread safety in realtime branch",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "Realtime Branch"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Several tests are currently failing in the realtime branch - most of them due to thread safety problems (often exceptions in ConcurrentMergeScheduler) and in tests that test for aborting and non-aborting exceptions.",
    "attachments": {
        "lucene-2561.patch": "https://issues.apache.org/jira/secure/attachment/12450622/lucene-2561.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-07-27T19:54:11+0000",
            "content": "The patch fixes most of the threading and exception issues.\n\nNow >99% of the core tests pass!  Some failures are expected, because some features aren't implemented yet (e.g. flush by RAM or maxBufferedDeletes).  A test though that I still want to fix with this patch is TestStressIndexing2 - not sure yet what's going on.\n\nOther changes:\n\n\tFactored ReaderPool out of IndexWriter into its own class\n\tAdded a FilterDirectory that forwards all method calls to a delegate\n\tUse an extended FilterDirectory in DW to track all files the consumers and codecs open, so that they can be closed on abort\n\tFixed some more nocommits\n\n\n\nUsing the FilterDirectory might not be the cleanest approach?  Maybe a IndexOutputFactory or something would be cleaner?  Or maybe on abort we should just delete all files that have the prefix of the segment(s) the DWPT(s) were working on?  This should be possible now that the shared doc stores are gone and no files are shared anymore across segments. ",
            "author": "Michael Busch",
            "id": "comment-12892909"
        },
        {
            "date": "2010-07-27T20:35:32+0000",
            "content": "Committed the current patch to the realtime branch. (revision 979856)\n\nLeaving this issue open to fix TestStressIndexing2 and for more cleanup. ",
            "author": "Michael Busch",
            "id": "comment-12892918"
        },
        {
            "date": "2010-07-28T16:22:05+0000",
            "content": "TestStressIndexing2 is not failing because of concurrency problems, so I'm closing this issue.\nAll contrib tests pass now too!  \n\nThe reason why TestStressIndexing2 is failing is that deletes and sequenceIDs aren't fully implemented yet.  The remapDeletes step is still commented out, which results in a wrong behavior as soon as segment merges happen while deletes are buffered.  (I'll use LUCENE-2558 to fix that) ",
            "author": "Michael Busch",
            "id": "comment-12893235"
        }
    ]
}