{
    "id": "LUCENE-3728",
    "title": "better handling of files inside/outside CFS by codec",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Since norms and deletes were moved under Codec (LUCENE-3606, LUCENE-3661),\nwe never really properly addressed the issue of how Codec.files() should work,\nconsidering these files are always stored outside of CFS.\n\nLUCENE-3606 added a hack, LUCENE-3661 cleaned up the hack a little bit more,\nbut its still a hack.\n\nCurrently the logic in SegmentInfo.files() is:\n\nclearCache()\n\nif (compoundFile) {\n  // don't call Codec.files(), hardcoded CFS extensions, etc\n} else {\n  Codec.files()\n}\n\n// always add files stored outside CFS regardless of CFS setting\nCodec.separateFiles()\n\nif (sharedDocStores) {\n  // hardcoded shared doc store extensions, etc\n}\n\n\n\nAlso various codec methods take a Directory parameter, but its inconsistent\nwhat this Directory is in the case of CFS: for some parts of the index its\nthe CFS directory, for others (deletes, separate norms) its not.\n\nI wonder if instead we could restructure this so that SegmentInfo.files() logic is:\n\nclearCache()\nCodec.files()\n\n\n\nand so that Codec is instead responsible.\n\ninstead Codec.files logic by default would do the if (compoundFile) thing, and\nLucene3x codec itself would only have the if (sharedDocStores) thing, and any\npart of the codec that wants to put stuff always outside of CFS (e.g. Lucene3x separate norms, deletes) \ncould just use SegmentInfo.dir. Directory parameters in the case of CFS would always\nconsistently be the CFSDirectory.\n\nI haven't totally tested if this will work but there is definitely some cleanups \nwe can do either way, and I think it would be a good step to try to clean this up\nand simplify it.",
    "attachments": {
        "LUCENE-3728.patch": "https://issues.apache.org/jira/secure/attachment/12512433/LUCENE-3728.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-01-29T12:23:01+0000",
            "content": "I'm gonna slowly iterate on cleaning this up on the branch for \nlucene-3661 (branches/lucene3661: i recreated it), in case anyone \nwants to jump in and help or test out some ideas. ",
            "author": "Robert Muir",
            "id": "comment-13195741"
        },
        {
            "date": "2012-01-30T18:04:36+0000",
            "content": "Attached is a patch showing the differences between branch and trunk.\n\n\n\tseparateFiles() is removed, codecs calculate all of files() themselves.\n\tshared (compound) doc store stuff is almost totally underneath Lucene3xCodec. (with one exception, see below)\n\tindexing code doesn't violate abstractions of the code by reaching into the different components of files(), except indexwriter.copySegmentAsIs (and only for preflex, only in the case of shared doc stores).\n\tlucene3x/lucene4x stored fields implementation is split, so that lucene3x can handle shared docstores itself.\n\tcodec.files is consistent about directory, in fact it doesnt take directory at all, as its unnecessary.\n\thairy code from segmentcorereaders for compound shared docstores is removed, and only in the 3.x impls.\n\n\n\nI think this is ready to go, and a lot easier to see whats happening with files(). \n\nIn my opinion a good future issue here would be to add a heuristic to TieredMP to more aggressively target 3.x segments (at least if they have shared docstores). It could do evil things like check File.length or whatever it wants as part of its heuristic, but only for preflexcodec. ",
            "author": "Robert Muir",
            "id": "comment-13196257"
        },
        {
            "date": "2012-01-30T18:45:14+0000",
            "content": "+1, this is a nice cleanup!  SegmentInfo.files is awesome now  ",
            "author": "Michael McCandless",
            "id": "comment-13196296"
        },
        {
            "date": "2012-01-30T21:04:14+0000",
            "content": "I'll commit this cleanup and help merge to the uschindler branch  ",
            "author": "Robert Muir",
            "id": "comment-13196416"
        }
    ]
}