{
    "id": "LUCENE-3590",
    "title": "minimize bytesref to be a ref to a byte[]",
    "details": {
        "labels": "",
        "priority": "Blocker",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA",
            "3.6.1"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Setting this as blocker for 4.0, as this class is used in every API there.\n\nCurrently this API is a little of a everything, sometimes its like a stringbuffer, it\ndoes numeric conversions, all kinds of stuff.\n\nWe need this to be a ref to a byte[], nothing else. This other stuff can go somewhere else.",
    "attachments": {
        "LUCENE-3590_with_clone.patch": "https://issues.apache.org/jira/secure/attachment/12505022/LUCENE-3590_with_clone.patch",
        "LUCENE-3590_copyCtor.patch": "https://issues.apache.org/jira/secure/attachment/12505016/LUCENE-3590_copyCtor.patch",
        "LUCENE-3590_equals_init.patch": "https://issues.apache.org/jira/secure/attachment/12505198/LUCENE-3590_equals_init.patch",
        "LUCENE-3590_deprecate_comparators.patch": "https://issues.apache.org/jira/secure/attachment/12505114/LUCENE-3590_deprecate_comparators.patch",
        "LUCENE-3590.patch": "https://issues.apache.org/jira/secure/attachment/12530049/LUCENE-3590.patch",
        "LUCENE-3590_offsets.patch": "https://issues.apache.org/jira/secure/attachment/12505255/LUCENE-3590_offsets.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-11-24T14:38:18+0000",
            "content": "First step is to remove the ctor BytesRef(BytesRef other), which is not intuitive\nsince it looks like a copy constructor, but doesn't copy the ref, it creates \na brand new byte array pointing to a complete copy of 'other's bytes, and then\ncreates a pointer to that.\n\nI think its not obvious from the code either when i see new BytesRef(otherBytesRef).\nInstead we should do:\n\n{copy}\nBytesRef copy = new BytesRef();\ncopy.copyBytes(otherBytesRef);{copy}\n\nThis makes it totally clear exactly what is going on. I'll work up a patch ",
            "author": "Robert Muir",
            "id": "comment-13156728"
        },
        {
            "date": "2011-11-24T14:46:23+0000",
            "content": "How about:\n\nBytesRef copy = BytesRef.copyOf(original);\n\n ",
            "author": "Dawid Weiss",
            "id": "comment-13156734"
        },
        {
            "date": "2011-11-24T15:00:31+0000",
            "content": "BytesRef copy = BytesRef.copyOf(original);\n\n+1\n\nWhile we're at it, can we get rid of the final that prevents subclassing?\nMainly I want to be able to change how hashCode works (either the hash itself, or be able to cache like String does). ",
            "author": "Yonik Seeley",
            "id": "comment-13156746"
        },
        {
            "date": "2011-11-24T15:31:05+0000",
            "content": "\nBytesRef copy = BytesRef.copyOf(original);\n\nI still think this is slightly confusing, because in my opinion this method should do:\n\n\nBytesRef copy = new BytesRef();\ncopy.bytes = other.bytes;\ncopy.length = other.length;\ncopy.offset = other.offset;\n\n\n\nI think we should clearly separate these 'deep copies', e.g. deepCopyOf would be better. ",
            "author": "Robert Muir",
            "id": "comment-13156760"
        },
        {
            "date": "2011-11-24T15:33:46+0000",
            "content": "\nWhile we're at it, can we get rid of the final that prevents subclassing?\nMainly I want to be able to change how hashCode works (either the hash itself, or be able to cache like String does).\n\nI think if we clean up the API this would be a safe thing to do. Maybe instead of\nthe whole class being final, only a few methods really need to be final (or maybe none at all). ",
            "author": "Robert Muir",
            "id": "comment-13156761"
        },
        {
            "date": "2011-11-24T15:38:59+0000",
            "content": "Maybe, although this clearly corresponds with Arrays.copyOf(). If you make the contract clear in JavaDocs then I see no problem. People will always make mistakes, no matter how explicitly you name methods and deepCopyOf sounds verbose to me (even if only by 4 keystrokes). ",
            "author": "Dawid Weiss",
            "id": "comment-13156766"
        },
        {
            "date": "2011-11-24T15:52:23+0000",
            "content": "But thats my whole problem with BytesRef, its not supposed to be a StringBuilder, or an array (which are holder classes that you manipulate).\n\nIts a ref to a byte[]... thus the name. If i have a reference or a pointer to something, and i copy that reference, its unexpected to copy what it refers to as well. ",
            "author": "Robert Muir",
            "id": "comment-13156773"
        },
        {
            "date": "2011-11-24T15:57:11+0000",
            "content": "If so then I'd remove copying entirely then and leave a covariant ByteRef clone() (as in: clone the reference only). Although I also admit I did abuse BytesRef as a byte manipulation buffer slightly, my bad. ",
            "author": "Dawid Weiss",
            "id": "comment-13156775"
        },
        {
            "date": "2011-11-24T16:00:33+0000",
            "content": "well here i'm just trying to prevent BytesRef/IntsRef/CharsRef from being crazy classes where its confusing what the methods do... oh wait, its too late.\n\nI think the key issue is sometimes they are used like array/stringbuilder, but other times they are used like bytebuffer?\n\nI'm not going to push the issue so far to say we should remove BytesRef entirely and just use ByteBuffer but i also don't think that should be totally out of the question?\n\nFor now, since we support being a ByteBuffer and also a ByteArrayBuilder, i want to first just distinguish the deep copying from the shallow copying before trying to unbreak stuff.  ",
            "author": "Robert Muir",
            "id": "comment-13156780"
        },
        {
            "date": "2011-11-24T16:05:23+0000",
            "content": "If so then I'd remove copying entirely then and leave a covariant ByteRef clone() (as in: clone the reference only).\n\nMake clone() a shallow copy?  I don't think we should support shallow copying at all - it's normally not going to be what a user really wants.  One can still do a shallow copy by directly setting the members.\n\nIs there even any code in Lucene or Solr that creates a shallow copy? ",
            "author": "Yonik Seeley",
            "id": "comment-13156782"
        },
        {
            "date": "2011-11-24T16:21:53+0000",
            "content": "I don't think we should be supporting deep copying at all, thats why i opened this issue.\n\nThis class is NOT a stringbuilder class!\n ",
            "author": "Robert Muir",
            "id": "comment-13156792"
        },
        {
            "date": "2011-11-24T16:22:41+0000",
            "content": "it's normally not going to be what a user really wants\n\nYou're right, this would be even more confusing.\n\nAll I know is this class is abused because there was/is a need for bits and pieces that ByteBuffers don't fully address – you cannot change the underlying array (must rewrap) and you cannot fiddle with hash code, for example. I like access to internals sometimes. ",
            "author": "Dawid Weiss",
            "id": "comment-13156794"
        },
        {
            "date": "2011-11-24T16:25:35+0000",
            "content": "Attached is a patch for FoosRef, where Foo = \n{ Byte, Int, Char }\n that removes FoosRef(FoosRef other), instead adding FoosRef.deepCopyOf(FoosRef other).\n\nAlso renames FoosRef.copy(FoosRefOther) to FoosRef.copyFoos(FoosRefOther) to make it more obvious that its copying the underlying data in, not just the reference. ",
            "author": "Robert Muir",
            "id": "comment-13156799"
        },
        {
            "date": "2011-11-24T16:29:03+0000",
            "content": "\nAll I know is this class is abused because there was/is a need for bits and pieces that ByteBuffers don't fully address – you cannot change the underlying array (must rewrap) and you cannot fiddle with hash code, for example. I like access to internals sometimes.\n\nRight, the abuse exists... we have to accept this is just the case and deal with it appropriately, step 1 being to make sure the 'abuse use case' and the 'ordinary use case' can be clearly separated. But having a broken API that is sometimes shallow, sometimes deep, trying to support both use cases in whichever way we feel is 'natural' is unacceptable. ",
            "author": "Robert Muir",
            "id": "comment-13156802"
        },
        {
            "date": "2011-11-24T16:32:09+0000",
            "content": "\nMake clone() a shallow copy? I don't think we should support shallow copying at all - it's normally not going to be what a user really wants. One can still do a shallow copy by directly setting the members.\n\nNo, abusers of the reference API can create a deep copy directly by setting the members. The onus is on abusers to have these extra lines of code, not for correct users of the API.\n\n\nIs there even any code in Lucene or Solr that creates a shallow copy?\n\nYes, and its uglier because of the problems above. ",
            "author": "Robert Muir",
            "id": "comment-13156803"
        },
        {
            "date": "2011-11-24T17:42:28+0000",
            "content": "updated patch, changing clone() to be shallow as well.\n\nif consumers want a deep copy they can just call deepCopy explicitly. ",
            "author": "Robert Muir",
            "id": "comment-13156837"
        },
        {
            "date": "2011-11-24T18:54:51+0000",
            "content": "In my opinion, those classes should have no ctors at all (and they don't need as they are final - so make the ctor private). I would make all methods creating new instances of XxxRefs static and named with what they do: BytesRef.newEmptyInstance(), BytesRef.deepCopyOf(), BytesRef.newInstanceFromRef(), BytesRef.copyOf(otherType),... ",
            "author": "Uwe Schindler",
            "id": "comment-13156868"
        },
        {
            "date": "2011-11-25T12:52:52+0000",
            "content": "Uwe: i totally disagree, I'm sorry.\n\nInstead all these stupid ctors and deep-copying should be removed, and this class should be simplified to be a simple Ref API.\n\nThen @lucene.internal should be removed from the class, because its totally broken to call something \"internal\" but pass it around in every API, e.g. its required to use the terms/postings apis.\n\nThats why I marked this issue blocker. ",
            "author": "Robert Muir",
            "id": "comment-13157138"
        },
        {
            "date": "2011-11-25T13:04:55+0000",
            "content": "You should also fix this in 3.x as BytesRef appeared there, too (I have no idea why it is there, but it is). The problem is we already released but as @lucene.internal, so we can still change.\n\nAbout your disagreement, I am fine with that, but then please remove all deep copying, also the new static methods  On the other hand not supplying at least one simple deepCopy function makes it hard to use e.g. in MTQ when you put away terms. ",
            "author": "Uwe Schindler",
            "id": "comment-13157143"
        },
        {
            "date": "2011-11-25T13:13:09+0000",
            "content": "Don't worry, i will fix in 3.x too. Its good that its internal for now, because the api needs cleanup.\n\ni would like to remove deep copying, but again, as i said at least 2 times before here, the first step is to clearly mark what is deep copying and what is normal use.\n\nThis way the uses are not intermixed confusingly in the source code. This makes it at least possible to fix. ",
            "author": "Robert Muir",
            "id": "comment-13157146"
        },
        {
            "date": "2011-11-25T14:35:53+0000",
            "content": "i want to deprecate the utf8InUtf16Order and utf16InUtf8Order comparators. maybe these will get refactored out of bytesref itself and into better places like preflex codec\n\nespecially since the one in bytesref has some funkiness particular to the surrogates dance implementation (it reserves some unassigned bytes). ",
            "author": "Robert Muir",
            "id": "comment-13157171"
        },
        {
            "date": "2011-11-26T13:51:13+0000",
            "content": "patch fixes broken equals() methods and broken ctors in IntsRef and CharsRef.\n\nIntsRef never set ints = EMPTY_INTS in its no-arg ctor, so ints would just be null.\n\nIntsRef and CharsRef never handled the case that 'other == null' in equals().\n\nCharsRef had other brokenness in its equals() method where it would return equals = true sometimes to other CharSequences that are not actually CharsRefs.\n\nThis breaks the contract of equals because its not symmetric, there is no guarantee of this in charsequence. ",
            "author": "Robert Muir",
            "id": "comment-13157492"
        },
        {
            "date": "2011-11-26T13:55:32+0000",
            "content": "updated patch with instanceof checks in the equals, and removing the broken asserts in TestUnicodeUtil that called equals() on charsequence (which is undefined by definition) ",
            "author": "Robert Muir",
            "id": "comment-13157494"
        },
        {
            "date": "2011-11-27T16:24:24+0000",
            "content": "BytesRef.copyBytes and equivalents are also heavily broken if offset != 0, and the javadoc is non-intuitive:\n\n\n   * NOTE: this method resets the offset to 0 and resizes the reference array\n   * if needed.\n\n\n\nThis is ambiguous, its not obvious that it will reset offset to 0 always and then copy, resizing if needed. \n\nThis is in comparison to e.g. append(), which is less broken because it at least tries to append to the \nexisting offset, and if it needs to resize it resets offset to 0, but thats fine as its a new byte[].\n\nThe former will overwrite unrelated data if bytesrefs are pointing to different slices of the same array. ",
            "author": "Robert Muir",
            "id": "comment-13157924"
        },
        {
            "date": "2011-11-27T17:22:13+0000",
            "content": "here's a patch fixing the copyBytes() issue, but copyChars and in general unicodeutil methods are still broken in the same way.\n\nI also clarified some javadocs and other cleanups, trying to get this thing to the point we can remove @experimental (not there yet).\n\nNeed to fix IntsRef and CharsRef in the same way. ",
            "author": "Robert Muir",
            "id": "comment-13157937"
        },
        {
            "date": "2012-05-29T15:11:56+0000",
            "content": "Here's a patch with tests to improve most of the remaining issues:\n\n\tbugs in copy/append when offset !=0 (AIOOBE)\n\toff-by-one in charsequence.subsequence, this just happened to be previously untested.\n\tobey charsequence api completely (including exceptions stated in the spec)\n\tassert offset == 0 in grow(), as it doesnt make sense otherwise.\n\n\n\nI'd like to backport these bugfixes to 3.6.1 as well. ",
            "author": "Robert Muir",
            "id": "comment-13284871"
        },
        {
            "date": "2012-07-22T16:04:55+0000",
            "content": "Bulk close for 3.6.1 ",
            "author": "Uwe Schindler",
            "id": "comment-13420207"
        }
    ]
}