{
    "id": "LUCENE-4895",
    "title": "Implement Spatial \"disjoint\" predicate.",
    "details": {
        "components": [
            "modules/spatial"
        ],
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "New Feature",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The \"IsDisjointTo\" SpatialOperation is not implemented for RecursivePrefixTreeStrategy and some/all others. It has been very low priority because it is simply the inverse of \"Intersects\" which is universally implemented on the SpatialStrategy implementations.  \n\n\n\tShould spatial \"disjoint\" count documents that have no spatial data?\n\tArguably, there should be one implementation amongst the SpatialStrategies implemented in terms of \"Intersects\"; this way each strategy need not deal with it.",
    "attachments": {
        "LUCENE-4895_Spatial_Disjoint_predicate.patch": "https://issues.apache.org/jira/secure/attachment/12576791/LUCENE-4895_Spatial_Disjoint_predicate.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-04-01T21:39:18+0000",
            "content": "Should spatial \"disjoint\" count documents that have no spatial data?\n\nHopefully not – I guess that implies we need a query for IsSpatial() or equivalent so IsDisjointTo() = IsSpatial() && !Intersects()\n\n\n ",
            "author": "Ryan McKinley",
            "id": "comment-13619209"
        },
        {
            "date": "2013-04-02T02:42:46+0000",
            "content": "Yeah, I agree.  Some apps will always have spatial data in a field and so calculating IsSpatial() is redundant, though I suppose that's not a big deal if it's cached.  Where shall that be cached? Hmmm. ",
            "author": "David Smiley",
            "id": "comment-13619462"
        },
        {
            "date": "2013-04-03T14:32:47+0000",
            "content": "Attached is a generic Filter implementing the disjoint predicate in terms of a provided SpatialStrategy's support for intersects, as well as field designated to determine which docs have spatial data via the FieldCache.\n\nI have yet to integrate this with the existing strategies and test it because such things would conflict with an outstanding spatial issue pending to be committed tonight.  So I'll do these things tomorrow. ",
            "author": "David Smiley",
            "id": "comment-13620955"
        },
        {
            "date": "2013-04-08T19:58:58+0000",
            "content": "The attached patch renames the filter to \"DisjointSpatialFilter\" to follow a consistent naming convention with the other filters.  \n\nMore importantly, it includes extensive randomized testing--not just for this filter but for the other predicates supported by RecursivePrefixTreeStrategy too.  That testing is what triggered my discovery of two spatial bugs I recently reported & fixed.\n\nI plan to commit this in a couple days. ",
            "author": "David Smiley",
            "id": "comment-13625731"
        },
        {
            "date": "2013-05-10T10:33:08+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13653839"
        }
    ]
}