{
    "id": "LUCENE-4563",
    "title": "DirTaxoWriter's Codec - rely on default or use custom?",
    "details": {
        "components": [
            "modules/facet"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Not A Problem",
        "status": "Resolved"
    },
    "description": "Today, DirTaxoWriter opens an IndexWriter using the default Codec. While running tests, I noticed that some of them take a veeeeery long time to complete, some times. Debugging, I realized that they use SimpleText codec b/c that's what the test-framework drew at random.\n\nThat got me to think if we should really depend on the default Codec, or use a special codec that is more suitable for the taxonomy index's unique characteristics. Basically, the taxonomy index has two fields:\n\n\n\tOne in which the category path is saved, as StringField, and therefore each term is associated with exactly one document\n\tAnother field with one term, such that a category's parent is written in the position of that term for every document.\n\n\n\nInitially, I thought that we should really be using PulsingCodec. After a brief chat about it w/ Robert, he said that Lucene41 Codec acts like pulsing for fields like that. So I'm thinking that we should either:\n\n\tHard-code to Lucene41, if it's indeed useful.\n\tWrite a completely new Codec, that is special for that case. I.e. Lucene41 may handle these cases efficiently, but its code needs to be prepared for other cases too, therefore we may be able to write something more efficient.\n\n\n\nI open that as a placeholder, I think that we should first come up w/ a decent benchmark test in order to validate the results. The benchmark package now contains some facet related stuff, so I'll take a look if that's enough.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-19T13:51:16+0000",
            "content": "I think you should just stick with the default. \n\nOf course tests run slowly with SimpleText! ",
            "author": "Robert Muir",
            "id": "comment-13500233"
        },
        {
            "date": "2012-11-19T13:59:44+0000",
            "content": "I think you should just stick with the default. \n\nMaybe, but it'll be worth checking that.\n\nOf course tests run slowly with SimpleText!\n\nSure, only in the facets test, this usually doesn't serve any purpose.\n\nAnyway, I don't rule out that this issue will be cancelled in the end, but at least we'll know if the default Codec is good enough, or a more optimized one can have better performance. ",
            "author": "Shai Erera",
            "id": "comment-13500237"
        },
        {
            "date": "2012-11-19T14:08:56+0000",
            "content": "What percentage of the time of a \"typical\" facet request is spent on DTR lookups?  I would think it's relatively small?  Because you only need to lookup after all facets have been counted (I think)? ",
            "author": "Michael McCandless",
            "id": "comment-13500244"
        },
        {
            "date": "2012-11-19T14:21:58+0000",
            "content": "Not much – only the top-K facet ordinals are labeled. Also, the taxo-reader holds a cache, so if you typically label a certain set of categories, the index is likely to never, or very rarely be hit.\n\nI think that maybe during indexing this might help, but not sure. Also, it may result in a smaller size taxonomy index. ",
            "author": "Shai Erera",
            "id": "comment-13500258"
        },
        {
            "date": "2013-07-21T12:18:24+0000",
            "content": "I don't believe anymore that a specialized Codec can help the taxonomy index much ... it is not the bottleneck of indexing (indexing the documents themselves is far more costly than adding categories to the taxonomy index). Also during search it is not expected to yield significant (or any!) improvements. There are more important issues to focus on. ",
            "author": "Shai Erera",
            "id": "comment-13714691"
        }
    ]
}