{
    "id": "LUCENE-3551",
    "title": "Yet another race in IW#nrtIsCurrent",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In IW#nrtIsCurrent looks like this:\n\n\n  synchronized boolean nrtIsCurrent(SegmentInfos infos) {\n    ensureOpen();\n    return infos.version == segmentInfos.version && !docWriter.anyChanges() && !bufferedDeletesStream.any();\n  }\n\n\n\n\n\tthe version changes once we checkpoint the IW\n\tdocWriter has changes if there are any docs in ram or any deletes in the delQueue\n\tbufferedDeletes contain all frozen del packages from the delQueue\n\n\n\nyet, what happens is 1. we decrement the numDocsInRam in DWPT#doAfterFlush (which is executed during DWPT#flush) but before we checkpoint. 2. if we freeze deletes (empty the delQueue) we put them in the flushQueue to maintain the order.  This means they are not yet in the bufferedDeleteStream.\n\nBottom line, there is a window where we could see IW#nrtIsCurrent returning true if we check within this particular window. Phew, I am not 100% sure if that is the reason for our latest failure in SOLR-2861 but from what the logs look like this could be what happens. If we randomly hit low values for maxBufferedDocs & maxBufferedDeleteTerms this is absolutely possible.",
    "attachments": {
        "LUCENE-3551.patch": "https://issues.apache.org/jira/secure/attachment/12501817/LUCENE-3551.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-11-01T19:54:05+0000",
            "content": "here is a patch that checks the flushQueue as a last resort ",
            "author": "Simon Willnauer",
            "id": "comment-13141506"
        },
        {
            "date": "2011-11-01T20:04:19+0000",
            "content": "ups one negation to rule them all  - fixing the prev patch ",
            "author": "Simon Willnauer",
            "id": "comment-13141521"
        },
        {
            "date": "2011-11-01T20:18:59+0000",
            "content": "this seems to have a deadlock.... I need to investigate more how to solve this. ",
            "author": "Simon Willnauer",
            "id": "comment-13141532"
        },
        {
            "date": "2011-11-02T11:42:55+0000",
            "content": "here is a new patch fixing this issue. With this patch I could not reproduce any failure from SOLR-2861 which usually failed fairly quickly. ",
            "author": "Simon Willnauer",
            "id": "comment-13142066"
        },
        {
            "date": "2011-11-03T13:04:08+0000",
            "content": "I isolated the problem in SOLR-2861 into a lucene testcase that fails reproduceable & very very quickly. (passed on 3.x too though) \n\nwith the fixes in this patch it passes reliably. The problem among the others I already explained is that once DW has flushed all threads and put all deletes in the frozenPacketBuffer we have a little window where those changes are not taken into account. This only happens if I only flush deletes (no documents) since we prune the frozenBufferedDeletes before we checkpoint so nrtIsCurrent doesn't see those changes for a little while.  ",
            "author": "Simon Willnauer",
            "id": "comment-13143115"
        },
        {
            "date": "2011-11-04T20:06:57+0000",
            "content": "This seems to fix SOLR-2861 I went through the changes again double checking all conditions. It seems ready, I will commit soon if nobody objects. ",
            "author": "Simon Willnauer",
            "id": "comment-13144290"
        },
        {
            "date": "2011-11-04T20:17:01+0000",
            "content": "Committed in revision 1197742. ",
            "author": "Simon Willnauer",
            "id": "comment-13144298"
        }
    ]
}