{
    "id": "LUCENE-2103",
    "title": "NoLockFactory should have a private constructor",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "core/store"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "3.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "NoLockFactory documents in its javadocs that one should use the static getNoLockFactory() method. However the class does not declare a private empty constructor, which breaks its Singleton purpose. We cannot add the empty private constructor because that'd break break-compat (even though I think it's very low chance someone actually instantiates the class), therefore we'll add a @deprecated warning to the class about this, and add the method in 4.0. I personally prefer to add an empty constructor w/ the @deprecated method, but am fine either way.\n\nDon't know if a patch is needed, as this is a trivial change.",
    "attachments": {
        "LUCENE-2103.patch": "https://issues.apache.org/jira/secure/attachment/12426669/LUCENE-2103.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-12-02T14:12:53+0000",
            "content": "Attached is the patch with javadocs and deprecation.\n\nWill commit in a day. ",
            "author": "Uwe Schindler",
            "id": "comment-12784832"
        },
        {
            "date": "2009-12-02T14:18:07+0000",
            "content": "New patch with CHANGES.txt, thanks Shai! ",
            "author": "Uwe Schindler",
            "id": "comment-12784840"
        },
        {
            "date": "2009-12-02T14:20:00+0000",
            "content": "One addition: In my opinion, this class should be final. With the private ctor it gets automatically final (you cannot extend without ctor), but should we change this for now, too? This would be a (small) BW break. ",
            "author": "Uwe Schindler",
            "id": "comment-12784842"
        },
        {
            "date": "2009-12-02T14:22:23+0000",
            "content": "if we're breaking BW, why not add the private ctor? I'm sure that when 3.1 will be out, that won't be the only BW . Anyway, this is not a serious BW. If somebody relies on the ctor, then that somebody may also rely on the class not being final. ",
            "author": "Shai Erera",
            "id": "comment-12784845"
        },
        {
            "date": "2009-12-02T14:36:45+0000",
            "content": "I think I keep this open for a moment, maybe others also have a comment about that.\n\nI would also like to make it final and private (also the package private inner class). ",
            "author": "Uwe Schindler",
            "id": "comment-12784851"
        },
        {
            "date": "2009-12-07T16:50:27+0000",
            "content": "Committed revision: 887995. Thanks Shai! ",
            "author": "Uwe Schindler",
            "id": "comment-12786983"
        }
    ]
}