{
    "id": "LUCENE-5944",
    "title": "move trunk to 6.x, create branch_5x",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "5.0"
        ]
    },
    "description": "In order to actually add real features (as opposed to just spending 24/7 fixing bugs and back compat), I need a trunk that doesn't have the back compat handcuffs.\n\nIn the meantime, we should rename the current trunk (which is totally tied down in back compat already, without even a single release!) to branch_5x while you guys (i wont be doing any back compat anymore) figure out what you want to do with the back compat policly.\n\nHere is the proposal what to do in this issue: http://mail-archives.apache.org/mod_mbox/lucene-dev/201409.mbox/%3CCAOdYfZUpAbYp-omdw=ngJSdzBKVHn2ZYdoBZvj1gDxK+LRT1SQ@mail.gmail.com%3E",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14135444",
            "author": "Robert Muir",
            "content": "Since there were no objections, I will do the svn move today. ",
            "date": "2014-09-16T13:45:47+0000"
        },
        {
            "id": "comment-14135901",
            "author": "Uwe Schindler",
            "content": "Hi,\ncould you svn copy the branch, so I have some time to change Jenkins? After I reconfigured all jobs, I will delete the branch. An svn move is in fact just a copy + delete.\n\nOtherwise I am fine with the plan. I will also heavy commit backports together with you! ",
            "date": "2014-09-16T18:28:27+0000"
        },
        {
            "id": "comment-14135908",
            "author": "Uwe Schindler",
            "content": "OK, I disabled Policeman Jobs. ASF Jenkins will need a lot of time to run 2 more trunk jobs, so its unlikely that it breaks soon. Go ahead! ",
            "date": "2014-09-16T18:30:46+0000"
        },
        {
            "id": "comment-14138180",
            "author": "Robert Muir",
            "content": "Sorry, i was slow, i was debugging a test failure. I will do this tonight (svn copy).\n\nI am a little worried about keeping branch_4x open, because people may still commit to it. But I don't want to drive jenkins haywire. So I will just watch the commits list. ",
            "date": "2014-09-17T23:13:12+0000"
        },
        {
            "id": "comment-14138771",
            "author": "ASF subversion and git services",
            "content": "Commit 1625934 from Robert Muir in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1625934 ]\n\nLUCENE-5944: move trunk to 6.x, create branch_5x ",
            "date": "2014-09-18T10:32:13+0000"
        },
        {
            "id": "comment-14138823",
            "author": "Uwe Schindler",
            "content": "I renamed all Jenkins Jobs and changed them to use other branch. We now also need to rename the JIRA version and add the new \"5.0\" to all additional backported issues. ",
            "date": "2014-09-18T11:43:08+0000"
        },
        {
            "id": "comment-14138834",
            "author": "ASF subversion and git services",
            "content": "Commit 1625946 from Uwe Schindler in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1625946 ]\n\nLUCENE-5944: delete old branch_4x ",
            "date": "2014-09-18T11:52:07+0000"
        },
        {
            "id": "comment-14138842",
            "author": "Uwe Schindler",
            "content": "OK:´\n\n\tI renamed JIRA version 5.0 to 6.0\n\tI renamed JIRA Version 4.11 to 5.0\n\n\n\nFor all additional backports from trunk to 5.x, we should add the 5.0 JIRA fix version. 4.11 is gone.\n\nbranch_4x is gone, too, please SVN switch branch_4x to branch_5x. We now must bump the version numbers in the build files.\n\nAll Jenkins Jobs were renamed, too (ASF, Policeman, Flonkings). ",
            "date": "2014-09-18T12:00:44+0000"
        },
        {
            "id": "comment-14138919",
            "author": "Shalin Shekhar Mangar",
            "content": "Why did we delete branch_4x? When did we vote on not releasing 4.x anymore? ",
            "date": "2014-09-18T13:27:19+0000"
        },
        {
            "id": "comment-14138925",
            "author": "Robert Muir",
            "content": "I opened this issue 6 days ago and nobody objected.\n\nwe can't support any more 4.x releases in lucene anymore. Each release is plagued by corruptions in the back compat support. Its just not sustainable. ",
            "date": "2014-09-18T13:32:25+0000"
        },
        {
            "id": "comment-14138927",
            "author": "ASF subversion and git services",
            "content": "Commit 1625976 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1625976 ]\n\nLUCENE-5944: Bump version in trunk ",
            "date": "2014-09-18T13:37:16+0000"
        },
        {
            "id": "comment-14138969",
            "author": "ASF subversion and git services",
            "content": "Commit 1625980 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1625980 ]\n\nLUCENE-5944: Bump version in branch_5x ",
            "date": "2014-09-18T13:55:23+0000"
        },
        {
            "id": "comment-14138971",
            "author": "ASF subversion and git services",
            "content": "Commit 1625983 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1625983 ]\n\nLUCENE-5944: Bump Maven POM in branch_5x ",
            "date": "2014-09-18T14:00:42+0000"
        },
        {
            "id": "comment-14138986",
            "author": "ASF subversion and git services",
            "content": "Commit 1625990 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1625990 ]\n\nLUCENE-5944: Remove useless test (will be fixed soon by LUCENE-5952) ",
            "date": "2014-09-18T14:17:04+0000"
        },
        {
            "id": "comment-14138988",
            "author": "ASF subversion and git services",
            "content": "Commit 1625991 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1625991 ]\n\nLUCENE-5944: Remove useless test (will be fixed soon by LUCENE-5952) ",
            "date": "2014-09-18T14:17:36+0000"
        },
        {
            "id": "comment-14138998",
            "author": "Tommaso Teofili",
            "content": "I opened this issue 6 days ago and nobody objected. we can't support any more 4.x releases in lucene anymore. Each release is plagued by corruptions in the back compat support. Its just not sustainable.\n\nwhile I agree with the backcompat trouble it's still not acceptable to just move forward without a vote IMHO, even if the issue has been open for 6 days, there must be explicit consensus on things like moving to major releases. It's like saying that since java 7 will go EOL shortly we just move to java 8 without voting.\nTo make it clear I would've voted +1 for the move, just I don't like the way it's been done. ",
            "date": "2014-09-18T14:29:52+0000"
        },
        {
            "id": "comment-14139018",
            "author": "Robert Muir",
            "content": "I didnt propose any release yet  ",
            "date": "2014-09-18T14:50:56+0000"
        },
        {
            "id": "comment-14139041",
            "author": "Steve Rowe",
            "content": "I agree with Tommaso: there should have been a vote for this.  Lazy concensus is the wrong model for big stuff like \"no more 4.x releases\". ",
            "date": "2014-09-18T15:13:18+0000"
        },
        {
            "id": "comment-14139054",
            "author": "Uwe Schindler",
            "content": "Hi,\nthere is still a release 4.10.1 underway (Mike will just commit one more issue soon). In general there is no problem in releasing 4.10.2 quite soon, too.\n\nThe fact we agreed on was to move to a new backwards model, because the current model prevents us from working effectively. So I don't see a 4.11 release coming anymore. Robert and I added a lot of news for a coming 5.0, which we will hopefully start as RC quite soon (after a few weeks of fine-tuning). The new version will still be able to read 4.x indexes, but 3.x gets removed.\n\nThe branch_4x branch was removed because commit to 4.x should now only go through 4.10 branch and all work for 5.0 will go to branch_5x. The whole thing was just a \"rename\" of branch. Both branches coexisted for a short time to be able to get Jenkins servers up-to-date.\n\nIn addition: SVN never forgets, you can reactivate branch_4x quite easy by reverting the removal commit. But I would not be happy and will spend no time in releasing a 4.11 instead of 5.0. ",
            "date": "2014-09-18T15:23:37+0000"
        },
        {
            "id": "comment-14139058",
            "author": "Robert Muir",
            "content": "All I did was create a branch in svn.\n\nIf you want to restore 4.x branch and keep doing 4.x releases, thats ok with me. ",
            "date": "2014-09-18T15:25:20+0000"
        },
        {
            "id": "comment-14139060",
            "author": "Steve Rowe",
            "content": "The fact we agreed on was to move to a new backwards model, because the current model prevents us from working effectively. \n\n\"We\"? \"agreed\"? \n\nWhere? ",
            "date": "2014-09-18T15:27:43+0000"
        },
        {
            "id": "comment-14139063",
            "author": "Uwe Schindler",
            "content": "LUCENE-5940 ",
            "date": "2014-09-18T15:29:35+0000"
        },
        {
            "id": "comment-14139068",
            "author": "Steve Rowe",
            "content": "Seriously, Uwe?  Robert opens an issue, 4 people comment on it, and that's \"we\" and \"agree\"?\n\nAgain, lazy concensus is the wrong model for big stuff like this. ",
            "date": "2014-09-18T15:36:33+0000"
        },
        {
            "id": "comment-14139071",
            "author": "Robert Muir",
            "content": "I think thats enough to create a branch? thats all it is. Maybe if i named the branch lucene_5944 it would be less controversial? ",
            "date": "2014-09-18T15:39:13+0000"
        },
        {
            "id": "comment-14139084",
            "author": "Yonik Seeley",
            "content": "Maybe if i named the branch lucene_5944 it would be less controversial?\n\nYes, tha'ts a huge difference.  Then it would not officially be \"trunk that is 6x\" and then no one would be forced to commit to 6x, and backport to 5x and 4x (assuming we want to continue the 4x line). ",
            "date": "2014-09-18T15:53:03+0000"
        },
        {
            "id": "comment-14139090",
            "author": "Steve Rowe",
            "content": "I think thats enough to create a branch? thats all it is.\n\nWhen you name branches in a way that controls commits, and delete the branch on which up till now the next release was to be based, it's more than branch creation. ",
            "date": "2014-09-18T15:55:44+0000"
        },
        {
            "id": "comment-14139095",
            "author": "Robert Muir",
            "content": "I didnt delete any branch or control anyone's commits. I just did an svn copy.\n\nAs far as continuing the 4.x line, who will be responsible for the backwards compatibility of those indexes? The current situation is not sustainable. \nI don't see a lot of people jumping up and down to help out with 3.x index back compat issues. ",
            "date": "2014-09-18T15:58:58+0000"
        },
        {
            "id": "comment-14139099",
            "author": "Uwe Schindler",
            "content": "If somebody wants to restore 4.11, please revert my commits. Thanks.\n\nIn fact the removal of branch_4x was just done \"for convenience\" so you don't need to take care of too many branches and not commit to the old branch accidentally. We (Robert and I) proposed that already more than a week ago: to release 4.11 as 5.0 - nothing more - initially it was planned as \"svn move\", but for Jenkins to be happy we decided to do a copy first and then rm (svn move is nothing else than that).\n\nAt this time, branch 5.x is exactly the same as Lucene 4.11 up to today, so there actually was no code change except some version hacks.\n\nThe branch copy/rename was just done to help with this. If you are not happy, take action. I am out. Passwords for Policeman Jenkins can be requested from me. ",
            "date": "2014-09-18T16:01:53+0000"
        },
        {
            "id": "comment-14139125",
            "author": "Uwe Schindler",
            "content": "If you got hit by a 404 not found on committing to branch_4x:\n\n\n$ svn switch https://svn.apache.org/repos/asf/lucene/dev/branches/branch_5x .\n$ svn up\n$ svn commit -m \"...\"\n\n\n\nIf the branch would not be removed, you would have committed to the old one instead, so this was to help you.\n\nUnfortunately, I was commiting the removal just for you. ",
            "date": "2014-09-18T16:16:04+0000"
        },
        {
            "id": "comment-14139130",
            "author": "Uwe Schindler",
            "content": "Robert:\n\nSince there were no objections, I will do the svn move today.\n\nUwe:\n\ncould you svn copy the branch, so I have some time to change Jenkins? After I reconfigured all jobs, I will delete the branch. An svn move is in fact just a copy + delete. Otherwise I am fine with the plan. I will also heavy commit backports together with you! ",
            "date": "2014-09-18T16:18:11+0000"
        },
        {
            "id": "comment-14139150",
            "author": "Anshum Gupta",
            "content": "This is certainly not how I thought Lucene/Solr 5.0 be!\n\nHistorically, trunk has been used to cut a major release but with this, I wonder when would the code in trunk (that already exists, and is different from 4x (now 5x)) be released.  ",
            "date": "2014-09-18T16:47:57+0000"
        },
        {
            "id": "comment-14139152",
            "author": "Robert Muir",
            "content": "I am currently backporting everything to the branch except the controversial stuff that would slow releases e.g. mentioned by shawn heisey on the java 8 thread (means keeping the solr war etc so its not bogged down by that). ",
            "date": "2014-09-18T16:51:14+0000"
        },
        {
            "id": "comment-14139164",
            "author": "Ryan Ernst",
            "content": "I wonder when would the code in trunk (that already exists, and is different from 4x (now 5x)) be released.\n\nWhen 6.0 is released? Part of the reason for this is a lot of very scary changes that were being backported into 4.11, that should have been in a major release.  Having a tighter backcompat policy in the future (now starting with 6.x I guess) would help us do releases more quickly (IMO, around every year or a little more). See LUCENE-5940 that Uwe mentioned earlier here.  Simply releasing 5.0 from trunk would have been more controversial (probably) since it has a lot of changes that still need to be cleaned up (StoredDocument/IndexedDocument, what happens with solr war/nowar, etc).  ",
            "date": "2014-09-18T16:56:04+0000"
        },
        {
            "id": "comment-14139195",
            "author": "Anshum Gupta",
            "content": "I understand the back-compat issue but honestly, people working on Solr side of things have stuff in trunk that they wanted to release as part of the next non-backcompat release (major release). I, and I'll assume others too, had more things planned for the 5.0 release.\nWith none of that happening with 5.0 and users getting a back-compat breaking release there, it'd be bad for the users to receive another release that's reasonably different, and breaks API's just a few months after 5.0 goes out.\n\nI'm proposing that we work together to have releases (and release numbers) that sound reasonable to the users (and developers). ",
            "date": "2014-09-18T17:17:40+0000"
        },
        {
            "id": "comment-14139242",
            "author": "Robert Muir",
            "content": "I'm not proposing to release anything anytime soon.\n\nI just want to branch and work on a 5.x branch (for maybe months out, whatever), that does not have the crazy 3.x backwards compatibility, only requires java 7 (but maybe some breaking changes like NIO.2), and so on.\n\nMeanwhile trunk can be java 8 and have all that fun, but we can't sit here and lie to ourselves that we can continue to issue 4.x minor releases: we cannot support the index backwards compatibility. Every single recent 4.x release has serious corruption issues due to 3.x support: I am seeing these on a near daily basis. with the most recent release, lucene is even corrupting 4.x indexes because of the complexity of 3.x support. its not just a finite set of bugs for us to fix, its just too much complexity.\n\nAnd we shouldn't make 5.0 require java 8... but at the same time developers who want to use java 8 features can have trunk to do that. ",
            "date": "2014-09-18T17:49:39+0000"
        },
        {
            "id": "comment-14139373",
            "author": "ASF subversion and git services",
            "content": "Commit 1626055 from Robert Muir in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1626055 ]\n\nLUCENE-5944: backport changes to branch_5x, except in-flux changes (o.a.l.document change, removal of solr .war), plus merge changes entries, plus fix solr precommit, plus fix docs, plus keep standardtokenizer 4.0 grammar for back compat ",
            "date": "2014-09-18T19:33:24+0000"
        },
        {
            "id": "comment-14140408",
            "author": "ASF subversion and git services",
            "content": "Commit 1626188 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1626188 ]\n\nLUCENE-5944: Remove the version constant. The problem was the broken logic in TestBackwardsCompatibility to detect \"Lucene trunk\" which has an additional unreleased index before Version.LATEST: I will open issue, maybe Ryan has better idea. ",
            "date": "2014-09-19T12:23:25+0000"
        },
        {
            "id": "comment-14140893",
            "author": "ASF subversion and git services",
            "content": "Commit 1626277 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1626277 ]\n\nLUCENE-5944: Fix building TAR with solr WAR (merge error) ",
            "date": "2014-09-19T17:13:12+0000"
        }
    ]
}