{
    "id": "LUCENE-5862",
    "title": "Old segments not deleted on merge",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [],
        "affect_versions": "4.9",
        "status": "Reopened",
        "fix_versions": [
            "4.10",
            "6.0"
        ]
    },
    "description": "After a full rebuild with the dataimport handler on a Solr install upgraded to Solr 4.9.0, I ended up with an index that was considerably larger than the one it replaced (built by 4.7.2), 28GB instead of 20GB.  I also upgraded a third-party component at the same time, to a version which has been tested with Solr 4.9.0.  The config didn't change at all.  Optimizing the index did not shrink it.\n\nAt first I thought there must have been something different about the way the new version worked, or possibly a change/bug in the third-party component.\n\nAfter looking deeper, I discovered that the optimization process had created one segment that was 20GB in size, but there were also a number of other segments on the disk, all of which were several hours older than the large segment.  Another optimize created a new segment of 20GB, and the previous segment of 20GB was deleted, but the older segments remained.",
    "attachments": {
        "LUCENE-5862-infostreams.zip": "https://issues.apache.org/jira/secure/attachment/12659093/LUCENE-5862-infostreams.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14079946",
            "author": "Shawn Heisey",
            "content": "This problem seems more like a Lucene problem than a Solr problem, which is why I opened it in the LUCENE project.  I'm not even sure at this point that it's a bug, I suppose it could have been something that I did.\n\nI will repeat the rebuild with the infoStream enabled and attach at least one of those logs. ",
            "date": "2014-07-30T20:45:43+0000"
        },
        {
            "id": "comment-14079949",
            "author": "Shawn Heisey",
            "content": "I do not know if there is anything in the third-party component that might trigger a problem with segment merging.  I can also run another test without the third-party component enabled. ",
            "date": "2014-07-30T20:48:48+0000"
        },
        {
            "id": "comment-14079993",
            "author": "Shawn Heisey",
            "content": "Somewhat interesting development: I changed the solrconfig to enable infoStream, and when I restarted Solr, all those shards dropped from 28GB to under 20GB - the extra segments got deleted. ",
            "date": "2014-07-30T21:20:31+0000"
        },
        {
            "id": "comment-14080006",
            "author": "Adrien Grand",
            "content": "This sounds like something during your import process opened index readers and didn't close when? The restart released the old readers, that is why associated segments got deleted. ",
            "date": "2014-07-30T21:29:41+0000"
        },
        {
            "id": "comment-14080810",
            "author": "Shawn Heisey",
            "content": "The new rebuild created indexes with the correct size.  The only difference I can think of: This time, before the rebuild started, the build cores contained an index that had been built by 4.7.2 and then modified by 4.9.0, whereas for the last rebuild the build cores contained an index built by 4.7.2 with no changes by 4.9.0.\n\nI have one more thing to try, but I am not supremely confident that it will create the same behavior, so I'm closing this issue.  If others run into this problem, or I can reproduce it, the issue is already here and can be re-opened. ",
            "date": "2014-07-31T12:49:19+0000"
        },
        {
            "id": "comment-14081910",
            "author": "Shawn Heisey",
            "content": "After another rebuild, two of the shards ended up at 25GB instead of 20GB. ",
            "date": "2014-08-01T05:04:22+0000"
        },
        {
            "id": "comment-14081914",
            "author": "Shawn Heisey",
            "content": "By listing one of the files for all segments (*.fdt), restarting Solr, and doing the list again, I discovered which segments were extra for one of those shards.  They were the _cyu and _cys segments in the \"s2build\" core.\n\nAttaching the INFOSTREAM from the core named s2build (which had the problem) and s1build (which did not show the problem).  I couldn't attach the solr log, because the compressed file was larger than the 10MB attachment limit.  I've put it in my dropbox:\n\nhttps://www.dropbox.com/s/sg65prhdgh0i5d1/LUCENE-5862-solr-log.zip\n\nIf these logs are not sufficient, let me know exactly what's needed (and how to turn it on if that's not obvious), and I'll do more rebuilds until the problem reproduces again. ",
            "date": "2014-08-01T05:17:15+0000"
        }
    ]
}