{
    "id": "LUCENE-2200",
    "title": "Several final classes have non-overriding protected members",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "3.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Protected member access in final classes, except where a protected method overrides a superclass's protected method, makes little sense.  The attached patch converts final classes' protected access on fields to private, removes two final classes' unused protected constructors, and converts one final class's protected final method to private.",
    "attachments": {
        "LUCENE-2200.patch": "https://issues.apache.org/jira/secure/attachment/12429824/LUCENE-2200.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-01-09T16:04:08+0000",
            "content": "All tests pass with the attached patch applied. ",
            "author": "Steve Rowe",
            "id": "comment-12798370"
        },
        {
            "date": "2010-01-09T18:44:49+0000",
            "content": "Steve, I briefly looked at your patch. Could we make some of the member vars final too? \nThe reader in CharReader or the defaultAnalyzer in ShingleAnalyzerWrapper for instance.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12798389"
        },
        {
            "date": "2010-01-09T18:57:25+0000",
            "content": "Could we make some of the member vars final too?\n\nDone in the new version of the patch.  Note that I didn't try to look in classes other than those already modified in the previous version of the patch for final class member access modification. ",
            "author": "Steve Rowe",
            "id": "comment-12798392"
        },
        {
            "date": "2010-01-09T20:02:57+0000",
            "content": "FYI, all tests pass for me with the new version of the patch applied. ",
            "author": "Steve Rowe",
            "id": "comment-12798396"
        },
        {
            "date": "2010-01-10T16:01:16+0000",
            "content": "all tests pass and patch looks good to me. will commit at the end of the day. ",
            "author": "Robert Muir",
            "id": "comment-12798495"
        },
        {
            "date": "2010-01-10T17:48:20+0000",
            "content": "Robert, when you commit this make sure you mark  the Attributes in EdgeNGramTokenFilter.java final thanks.\nSteve thanks for the patch, such work is always appreciated.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12798516"
        },
        {
            "date": "2010-01-10T19:33:59+0000",
            "content": "Robert, when you commit this make sure you mark the Attributes in EdgeNGramTokenFilter.java final thanks.\n\nWhoops, I missed those - thanks for checking, Simon.  (minGram and maxGram can also be final in EdgeNGramTokenFilter.java.)\n\nI've attached a new patch that includes these changes – all tests pass. ",
            "author": "Steve Rowe",
            "id": "comment-12798535"
        },
        {
            "date": "2010-01-10T21:11:09+0000",
            "content": "Thanks Steven! ",
            "author": "Robert Muir",
            "id": "comment-12798545"
        }
    ]
}