{
    "id": "LUCENE-779",
    "title": "behaviour of Lucene in tokenizing - causes query problems",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Invalid",
        "status": "Resolved"
    },
    "description": "I recently submitted a problem with queries to Atlassian Support team and they have pointed out that it is an issue with Lucene. I'm copying the contents from my support request to Atlassian. Please help.\n\nQuestion to Atlassian:\n\nWhen I use \"text search\" to query an item from summary it gives me zero match. But when I use query through custom field, I get results displayed properly.\n\nIn the attachment, I did a query for no: 10012363 using text search and I know this entry is part of the summary for several issues. But the result says \"no matching issues found\".\n\nBut when I selected, Vendor name and number, I get proper results. I tried re-indexing, still no help\n\nResponse from Atlassian:\n\nThe reason why you couldn't receive any results from the query is due to the behaviour of Lucene (an Apache-developed search and index library being used in JIRA) in tokenizing.\n\nFor example, Invoice Number-123456-API ASSOCIATES-10012363 is tokenized to:\n\n\nInvoice\nNumber-123456-API\nASSOCIATES-10012363\n\n\nIn this case, Number-123456-API and ASSOCIATES-10012363 are recognized as NUM (e.g. floating point, serial, model numbers, ip addresses, etc.).\n\n(Hope this doesn't sound too technical to you.)\n\nYou can somehow call this a limitation of the third party library. If you are keen to have it improved, feel free to raise a support request at our issue tracker or perhaps try asking it at Lucene's issue tracker.",
    "attachments": {
        "query error.doc": "https://issues.apache.org/jira/secure/attachment/12349268/query%20error.doc"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-01-19T15:43:22+0000",
            "content": "This is not a Lucene limitation/bug.  Atlassian guys could/should change how they handle numbers and solve the problem. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12466084"
        }
    ]
}