{
    "id": "LUCENE-7522",
    "title": "Make the Lucene jar an OSGi bundle",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "6.2.1",
        "components": [
            "general/build"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "Add support for OSGi. LUCENE-1344 added this feature to previous versions, but now lucene jars are not OSGi bundles. There are OSGi bundles from Servicemix, but I think lucene should add this feature.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15606240",
            "author": "Dawid Weiss",
            "date": "2016-10-25T19:29:09+0000",
            "content": "If you search the mailing list I think the last consensus was that we simple are not enough of OSGi experts to maintain the metadata in a reasonable way, so instead the plan was to release plain JARs and leave OSGi (and any other packaging) for downstream maintainers. "
        },
        {
            "id": "comment-15606262",
            "author": "Uwe Schindler",
            "date": "2016-10-25T19:40:23+0000",
            "content": "In addition the current structure of packages inside those JARS is incompatible with OSGI (duplicate package names). This will be an issue with the module system of Java 9, but we are focusing on that instead of OSGI. "
        },
        {
            "id": "comment-15606270",
            "author": "Uwe Schindler",
            "date": "2016-10-25T19:43:55+0000",
            "content": "LUCENE-1344 was closed in the wrong way. I reopened and fixed the status to \"Won't fix\". This was an issue of bulk-closing issues. "
        },
        {
            "id": "comment-15607724",
            "author": "Michal Hlavac",
            "date": "2016-10-26T07:30:02+0000",
            "content": "Ok, thanks for clarification. It will be good to think also about OSGi when you will be working on jigsaw issues. Maybe I can help with something. Is there any jira issue about jigsaw problems? "
        },
        {
            "id": "comment-15607733",
            "author": "Dawid Weiss",
            "date": "2016-10-26T07:34:26+0000",
            "content": "From the latest discussion on the mailing list I don't think even the jigsaw folks know how modules fit together with the OSGi classloader isolation model. "
        }
    ]
}