{
    "id": "LUCENE-5011",
    "title": "MemoryIndex and FVH don't play along with multi-value fields",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "4.3",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "When multi-value fields are indexed to a MemoryIndex, positions are computed correctly on search but the start and end offsets and the values array index aren't correct.\n\nComparing the same execution path for IndexReader on a Directory impl  and MemoryIndex (same document, same query, same analyzer, different Index impl), the difference first shows in FieldTermStack.java line 125:\n\ntermList.add( new TermInfo( term, dpEnum.startOffset(), dpEnum.endOffset(), pos, weight ) );\n\ndpEnum.startOffset() and dpEnum.endOffset don't match between implementations.\n\nThis looks like a bug in MemoryIndex, which doesn't seem to handle tokenized multi-value fields all too well when positions and offsets are required.\n\nI should also mention we are using an Analyzer which outputs several tokens at a position (a la SynonymFilter), but I don't believe this is related.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-05-21T12:49:34+0000",
            "content": "hey Itamar, can you provide a testcase that shows the issue? Providing your analysis chain can be important here as well.  ",
            "author": "Simon Willnauer",
            "id": "comment-13662946"
        },
        {
            "date": "2013-05-21T12:54:01+0000",
            "content": "The actual test case we have now is very tightly coupled with ElasticSearch and our custom analysis chain, it may take me some time to decouple it into a stand-alone Lucene test. Alternatively, I'll be happy to work this out with you via Skype using our existing test case. ",
            "author": "Itamar Syn-Hershko",
            "id": "comment-13662950"
        },
        {
            "date": "2014-07-31T02:49:43+0000",
            "content": "Is this fixed by LUCENE-5444 (in Lucene 4.7?) ",
            "author": "David Smiley",
            "id": "comment-14080411"
        }
    ]
}