{
    "id": "LUCENE-3948",
    "title": "Experiment with placing poms outside of src",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/build"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Recent work in LUCENE-3944 has changed how our generated pom.xml files are handled during release preparation, placing them in build/ instead.  However get-maven-poms still places the poms inside src/ so you can use them to drive a build.  What I think would be ideal is if we could unify the release handling of the poms and the normal building handling, so that the poms can sit outside of src and serve both purposes.  \n\nSome time ago I investigated how the ANT project handles its own Maven integration and it has its poms sitting in their own directory.  They then reference the actual src locations inside the poms.  This works for ANT but with a warning since some of their tests don't work due to how the Maven surefire plugin works, so they skip their tests.\n\nI have done some quick testing of my own and this process does seem to work for our poms and tests.  I now want to take this to a full scale POC and see if it works fully.",
    "attachments": {
        "LUCENE-3948.patch": "https://issues.apache.org/jira/secure/attachment/12521300/LUCENE-3948.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-04T11:48:45+0000",
            "content": "First shot at this.  I've added a <module-path> to most poms which connects them to the location of the module.\n\nI also fixed the solr/webapp build path in its pom.xml.template which pointed to solr/build and nuked the whole contents on mvn clean.\n\nI haven't changed get-maven-poms so first you must execute ant filter-pom-templates from lucene/.  Then go into build/poms and then you can execute mvn commands.\n\nEverything seems to compile now.  Can't see any bad directories being made.\n\nStill TODO: \n\n\n\tMake use of module-directory inside module-path rather than re-specifying that information.  Need to check if all tests pass.\n\tChange get-maven-poms to use filter-pom-templates.\n\n\n\nIf anybody could give this a whirl to see if it works  ",
            "author": "Chris Male",
            "id": "comment-13246187"
        },
        {
            "date": "2012-04-04T21:46:30+0000",
            "content": "Patch, superset of your patch, Chris, fixing just one problem I found: in the smartcn analysis module's POM, the resource directory didn't have module-path in front of it. ",
            "author": "Steve Rowe",
            "id": "comment-13246758"
        },
        {
            "date": "2012-04-04T21:54:09+0000",
            "content": "I applied the patch, ran ant filter-pom-templates under lucene, chdir'd to lucene/build/poms/, and successfully ran the following:\n\n\n\tmvn -N -P bootstrap install\n\tmvn -DskipTests install\n\tmvn test\n\n\n\nI think two things should change:\n\n\n\tant get-maven-poms, the user-level POM acquisition target, should place the POMs in a directory at the same level as lucene/ and solr/ - it could be named maven-build/ or something like that.  (Mixing Lucene and Solr build stuff together under lucene/ is bad.)\n\tThe build output directory should be under maven-build/, rather than the same dirs as those used by the Ant build.\n\n ",
            "author": "Steve Rowe",
            "id": "comment-13246767"
        },
        {
            "date": "2012-04-05T03:54:02+0000",
            "content": "Updated patch based on Steve's last\n\nChanges:\n\n\tget-maven-poms now places all the poms in maven-build/ at the top-level.\n\tAll build directories are now changed to target/ like they are in a traditional Maven project.  This means the build and poms sit next to each other\n\tClasses and test classes now output to target/classes and target/test-classes like in a traditional Maven project.\n\tmodule-path is updated to the new pom location and to leverage module-directory for easier maintainence.\n\n\n\nTODO\n\n\tConnect generate-maven-artifacts to this new process.\n\tAdd mechanism to clean maven-build\n\tAdd maven-build as an svn:ignore dir.\n\tRemove svn:ignore for pom.xml in src directories.\n\n ",
            "author": "Chris Male",
            "id": "comment-13246992"
        },
        {
            "date": "2012-04-11T18:46:29+0000",
            "content": "Patch, updated to current trunk, and also:\n\n\n\tregularizes module-path definitions to always be ${top-level}/${module-path}, where top-level is a separately specified property;\n\tuses top-level in definitions that would otherwise have multiple ../.. path segments;\n\tremoves definitions for project.build.directory, project.build.outputDirectory and project.build.testOutputDirectory, because these values are now the same as their defaults;\n\tadds a new surefire-top-level property based on top-level – since maven-surefire-plugin runs tests with CWD <module>/target/test/, the path to access Solr's testlogging.properties file needs two extra ../'s; and\n\tadds a new target clean-maven-build to the top-level build.xml.\n\n\n\n\nTODO\n\n\n\tConnect generate-maven-artifacts to this new process.\n\n\n\nThis isn't necessary, since generate-maven-artifacts now uses a separate target to filter the POMs for release artifact production: filter-pom-templates; this target and get-maven-poms are now independent of each other.\n\n\n\n\tAdd mechanism to clean maven-build\n\n\n\nDone.\n\n\n\n\tAdd maven-build as an svn:ignore dir.\n\tRemove svn:ignore for pom.xml in src directories.\n\n\n\nThese will need to be done.\n\nI think this is ready to commit. ",
            "author": "Steve Rowe",
            "id": "comment-13251833"
        },
        {
            "date": "2012-04-12T00:22:01+0000",
            "content": "Elegant, I like it.\n\n+1 to committing ",
            "author": "Chris Male",
            "id": "comment-13252083"
        },
        {
            "date": "2012-05-06T13:53:37+0000",
            "content": "Patch, brought up to date with the modules/->lucene/ move.  Also: added info to dev-tools/maven/README.maven, and modified svn:ignore properties, to ignore top-level maven-build/, and to stop ignoring pom.xml files.\n\nI'll commit this tomorrow if there are no objections. ",
            "author": "Steve Rowe",
            "id": "comment-13269219"
        },
        {
            "date": "2012-05-07T02:40:55+0000",
            "content": "+1 to committing ",
            "author": "Chris Male",
            "id": "comment-13269330"
        },
        {
            "date": "2012-05-08T04:34:38+0000",
            "content": "Committed.  Thanks Chris! ",
            "author": "Steve Rowe",
            "id": "comment-13270188"
        },
        {
            "date": "2012-05-08T04:37:43+0000",
            "content": "Oh no, thank you! ",
            "author": "Chris Male",
            "id": "comment-13270190"
        }
    ]
}