{
    "id": "LUCENE-4375",
    "title": "Spatial BBoxIntersects and BBoxWithin are used incorrectly",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "SpatialOperation has two special BBoxIntersects and BBoxWithin choices.  I assumed these where the bounding boxes of the query shape but Ryan McKinley informed me these are supposed to be for the indexed shape.  There is no strategy in Lucene spatial that could use this but there is one externally – JtsGeoStrategy.  Javadocs should be added to clarify, and various places like SpatialArgs.getShape() should be fixed to not use it incorrectly.\n\nThis does remove a feature from the Solr adapters side; the test there will need to change.",
    "attachments": {
        "LUCENE-4375_Fix_use_of_BBoxWithin_BBoxIntersects_and_IsWithin.patch": "https://issues.apache.org/jira/secure/attachment/12544760/LUCENE-4375_Fix_use_of_BBoxWithin_BBoxIntersects_and_IsWithin.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-12T03:19:56+0000",
            "content": "This patch addresses the BBoxWithin and BBoxIntersects misuse.\n\nI also noticed problematic use of IsWithin by PrefixTreeStrategy.  A PrefixTreeStrategy can index all shapes, not just points, so it can't be sure if IsWithin is supported.  It seemed simple enough to remove support for it but in order to make the tests pass I had to change various test references to \"IsWithin\" and make it Intersects, like renaming cities-IsWithin-BBox.txt to use Intersects in its name and content.  Perhaps it wouldn't be too much of a hack for this strategy to have a pointOnly boolean which has the side-effect of making IsWithin synonymous with Intersects? ",
            "author": "David Smiley",
            "id": "comment-13453668"
        },
        {
            "date": "2012-09-12T03:30:46+0000",
            "content": "In the future, once we remove much of the restrictions on the SpatialStrategy interface, we could have implementations of PTS that was limited to Points and supported isWithin.  Till then, I don't think we should include hacks just to support isWithin for Points.  Lets leave the API nice and we'll make improvements when we can. ",
            "author": "Chris Male",
            "id": "comment-13453674"
        },
        {
            "date": "2012-09-12T05:25:59+0000",
            "content": "Committed in r1383773 and r1383783. ",
            "author": "David Smiley",
            "id": "comment-13453720"
        },
        {
            "date": "2013-03-22T16:41:35+0000",
            "content": "[branch_4x commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1383783\n\nLUCENE-4375 Fix use of BBoxWithin BBoxIntersects and IsWithin ",
            "author": "Commit Tag Bot",
            "id": "comment-13610873"
        },
        {
            "date": "2013-05-10T10:34:35+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654263"
        }
    ]
}