{
    "id": "LUCENE-4251",
    "title": "Port Solr's ValueSourceRangeFilter to Lucene query module",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/other"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "Lucene spatial has ValueSourceFilter and Solr has ValueSourceRangeFilter (that has some more features).  And someone asked for this in LUCENE-3875 too.  It should be ported over to the Lucene query module.",
    "attachments": {
        "LUCENE-4251_FunctionRangeQuery.patch": "https://issues.apache.org/jira/secure/attachment/12744076/LUCENE-4251_FunctionRangeQuery.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-24T04:15:21+0000",
            "content": "+1 ",
            "author": "Chris Male",
            "id": "comment-13421160"
        },
        {
            "date": "2012-07-24T04:39:30+0000",
            "content": "For reference:\n\nhttps://svn.apache.org/repos/asf/lucene/dev/trunk/lucene/spatial/src/java/org/apache/lucene/spatial/util/ValueSourceFilter.java\n\nhttps://svn.apache.org/repos/asf/lucene/dev/trunk/solr/core/src/java/org/apache/solr/search/function/ValueSourceRangeFilter.java\n\nThe Lucene spatial util one wraps a Filter whereas Solr's wraps a ValueSource.  Furthermore, even after this refactoring, it's not likely Solr's will go away because it extends SolrFilter.  I like that Solr's has configurable inclusive & exclusivity.\n\nMy initial goal was to move out the one in spatial because it seemed like something useful in the query module, and then I found the Solr one which seemed the same but not quite. ",
            "author": "David Smiley",
            "id": "comment-13421170"
        },
        {
            "date": "2012-08-07T03:41:32+0000",
            "content": "rmuir20120906-bulk-40-change ",
            "author": "Robert Muir",
            "id": "comment-13429719"
        },
        {
            "date": "2013-07-23T18:44:23+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716937"
        },
        {
            "date": "2014-04-16T12:54:50+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970900"
        },
        {
            "date": "2015-07-07T21:28:26+0000",
            "content": "This is a newly written FunctionRangeQuery that I propose be added to the \"query\" module.  It's mostly a wrapper around the method FunctionValues.getRangeScorer (producing a ValueSourceScorer).  Furthermore I enhanced ValueSourceScorer to use the TwoPhaseIterator API.  Obviously this needs to be tested, which I haven't done yet.  getRangeScorer isn't tested either; it's only used by Solr, which I assume is tested but that's irrelevant since it should be tested in Lucene.  This patch adds lucene.internal to ValueSourceScorer since I feel it's internal.\n\nnote: this is being done in part as it relates to LUCENE-6650 (remove dependency of Filter from spatial module).  PointVectorStrategy uses this. ",
            "author": "David Smiley",
            "id": "comment-14617458"
        },
        {
            "date": "2015-08-05T04:08:22+0000",
            "content": "I created a separate issue, LUCENE-6720 instead of hijacking this one, since it doesn't really fit the title, and it wouldn't feel right to me to change the title.  That said, when LUCENE-6720 is completed, this one will be closed as there is then no need to port Solr's impl. ",
            "author": "David Smiley",
            "id": "comment-14654776"
        }
    ]
}