{
    "id": "LUCENE-4916",
    "title": "Spatial WithinPrefixTreeFilter can too eagerly find false-positive",
    "details": {
        "components": [
            "modules/spatial"
        ],
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The recently committed WithinPrefixTreeFilter can sometimes match a false-positive due to the grid approximation technique.  Some of this is normal.  But if an indexed shape has any of its leaf detail levels \"simplified\" (removed) up to a higher level, then a false-positive match can occur that is a little too eager when one of those cells that were simplified-away don't intersect the query shape, and thus shouldn't be considered a match for this predicate. \n\nMarking as \"Minor\" because it should be quite rare, and when it does occur, the answer (a match) will usually appear close-enough due to the grid approximation that it's not a totally inaccurate answer.  I found this problem via extensive randomized testing.  I want to fix it because it should make my new tests pass",
    "attachments": {
        "LUCENE-4916__Spatial_Within_RPT_and_shape_simplification.patch": "https://issues.apache.org/jira/secure/attachment/12577544/LUCENE-4916__Spatial_Within_RPT_and_shape_simplification.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-04-08T15:13:43+0000",
            "content": "The attached patch fixes this issue, and includes a testcase.  The approach has room for further optimization.\n\nAlthough unrelated, I found it possible for AbstractVisitingPrefixTreeFilter to have a minimum configurable scan level of 0 (formerly 1).  I made this change too; it enabled the aforementioned test to be a little more thorough.  ",
            "author": "David Smiley",
            "id": "comment-13625448"
        },
        {
            "date": "2013-05-10T10:34:50+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654340"
        }
    ]
}