{
    "id": "LUCENE-1557",
    "title": "Make constant-score rewrite the default for multi-term queries",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.0"
        ],
        "affect_versions": "2.4.1",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "For queries that expand to multiple terms (PrefixQuery, RangeQuery, FuzzyQuery, WildcardQuery), the default now is to rewrite to a BooleanQuery, which scales poorly, and can hit the dreaded TooManyClauses (ungraceful degradation).\n\nExcept for FuzzyQuery (which we should fix with this issue), they all support setConstantScoreRewrite, which scales better.\n\nIn 3.0 we should make constantScoreRewrite the default, and leave an option to turn it off.\n\nThis is a spinoff from LUCENE-998.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2009-11-10T22:23:10+0000",
            "content": "I take this, will provide a patch soon. ",
            "author": "Uwe Schindler",
            "id": "comment-12776115"
        },
        {
            "date": "2009-11-10T22:25:38+0000",
            "content": "Uwe,  I am a little confused about this issue. The MultiTermQuery now has a lot of smarts with regards to this. I feel it is obselete\n\nIs this kept open just for the FuzzyQuery?  ",
            "author": "Robert Muir",
            "id": "comment-12776120"
        },
        {
            "date": "2009-11-10T22:30:41+0000",
            "content": "It is almost obsolete. Fuzzy is fixed to boolean rewrite. The other queries have no longer any other modes. Only at some places in contrib are fixed rewrite setting, whcih I simply remove.\n\nEverywhere else, the defaults are already correct, RangeQuery & Co are gone (deprecated) and the new ones were already in auto mode. The patch only contains cleanup. We can close this soon.\n\nI want to get out 3.0. ",
            "author": "Uwe Schindler",
            "id": "comment-12776122"
        },
        {
            "date": "2009-11-10T22:33:40+0000",
            "content": "Thats all, will commit as soon as relevant tests were run. ",
            "author": "Uwe Schindler",
            "id": "comment-12776126"
        },
        {
            "date": "2009-11-10T22:34:41+0000",
            "content": "I want to get out 3.0.\n\n+1 ",
            "author": "Robert Muir",
            "id": "comment-12776127"
        },
        {
            "date": "2009-11-10T22:38:19+0000",
            "content": "Sorry, the SpanRegExQuery must stay unmodified, because it relays on BooleanQuery. ",
            "author": "Uwe Schindler",
            "id": "comment-12776128"
        },
        {
            "date": "2009-11-10T22:46:16+0000",
            "content": "This issue is no longer relevant. All classes were deprecated in 2.9 and now removed and there is nothing to change anymore. ",
            "author": "Uwe Schindler",
            "id": "comment-12776131"
        }
    ]
}