{
    "id": "LUCENE-6922",
    "title": "Improve svn to git workaround script",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [
            "-tools"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Minor",
        "status": "Closed",
        "type": "Improvement"
    },
    "description": "As the git-svn mirror for Lucene/Solr will be turned off near the end of 2015, try and improve the workaround script to become more usable.",
    "attachments": {
        "svnBranchToGit.py": "https://issues.apache.org/jira/secure/attachment/12775986/svnBranchToGit.py",
        "LUCENE-6922.patch": "https://issues.apache.org/jira/secure/attachment/12778743/LUCENE-6922.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15043339",
            "author": "Paul Elschot",
            "date": "2015-12-05T15:05:34+0000",
            "content": "This is a spinoff from INFRA-9182.\nThe workaround script  is currently in dev-tools/scripts/svnBranchToGit.py .\n\nThe script maintains a branch named trunk.svn in a local git repository with commits that are quite close to the commits produced by git-svn.\nIt uses and maintains a local svn working copy as source.\nIt does not do binary files, but that is probably easy to add.\n\nOne way for this to become more usable would be to setup a shared git repo (at github?) and pull/push the trunk.svn branch from/to there.\nThis push/pull could also be added, and then using the script would be as easy as doing svn update, or git pull.\n\nOther branches can easily be added as needed. "
        },
        {
            "id": "comment-15043442",
            "author": "Paul Elschot",
            "date": "2015-12-05T18:45:58+0000",
            "content": "To get an impression of what this produces, use this command in a lucene-solr repository:\n\ngit fetch https://github.com/PaulElschot/lucene-solr.git trunk.svn.20151205\n\nThis parallels the last 13 commits on trunk. "
        },
        {
            "id": "comment-15043831",
            "author": "Paul Elschot",
            "date": "2015-12-06T11:37:20+0000",
            "content": "svnBranchToGit.py of 6 Dec 2015.\nThis takes added binary files directly from svn by svn cat.\nUpdated the internal docs, and improved progress output.\n\nI pushed the tag trunk.svn.20151206 to github, this parallels the 319 git-svn commits at the trunk branch from early October 2015.\n\nThis still might fail for a commit with deleted or changed binary files.\nIn case someone knows a commit that has this, please let me know. "
        },
        {
            "id": "comment-15045060",
            "author": "Terry Smith",
            "date": "2015-12-07T15:14:10+0000",
            "content": "Is the announcement of the EOL to the git-svn mirror available publicly?\n\nHow will this affect users that rely on the github mirror to access the Lucene/Solr repository?\n "
        },
        {
            "id": "comment-15045069",
            "author": "Terry Smith",
            "date": "2015-12-07T15:18:18+0000",
            "content": "Oops, I guess I'm behind with the mailing list, just found the discussion and will include the link here for anyone else that misses it: http://mail-archives.apache.org/mod_mbox/lucene-dev/201512.mbox/%3cCAL8PwkbFVT83ZbCZm0y-x-MDeTH6HYC_xYEjRev9fzzk5YXYmQ@mail.gmail.com%3e\n "
        },
        {
            "id": "comment-15045226",
            "author": "Paul Elschot",
            "date": "2015-12-07T16:52:21+0000",
            "content": "How will this affect users that rely on the github mirror to access the Lucene/Solr repository?\n\nI would expect that no more updates will be available after the apache mirror is turned off.\n\nI just realized that the script here could be simpler when the git working tree and the svn working copy are in the same directory. Does anyone have experience with that? "
        },
        {
            "id": "comment-15060771",
            "author": "Paul Elschot",
            "date": "2015-12-16T20:22:35+0000",
            "content": "While testing this I noticed that on the trunk branch there are 37 .java files that are executable:\n\nfind . -name '*.java' -executable | wc\n\nThat is no problem here, but it is unusual. "
        },
        {
            "id": "comment-15060789",
            "author": "Paul Elschot",
            "date": "2015-12-16T20:31:27+0000",
            "content": "Script of 16 December 2015. This was a major overhaul:\n\nAdded a verifyGitFilesAgainstSvn function that is only called when the local git repo is completely up to date with the remote svn repository. This takes almost 20 seconds here, but it might be made faster.\n\nWork by checking out svn revisions instead of by asking svn to provide a patch for each revision. This is a nice speed up (to about 1 second per commit now), and it is also much easier to handle binary files.\n\nAdded setting file protection bits from svn to git for the files that are changed. Svn properties are still completely ignored, except that when there is property change, the file protection bits are also set.\n\nMade the script work under both python 2 and python 3. "
        },
        {
            "id": "comment-15060801",
            "author": "Paul Elschot",
            "date": "2015-12-16T20:37:07+0000",
            "content": "After the git-svn mirror is turned off, this could be used by group of people to push the resulting commits to public repos. Fetching these commits automatically at the start of the script would then allow to reuse this earlier work, but such automatic fetching and pushing still needs to be added.\n\nIn case the resulting branches are not the same, such fetching and pushing would fail, which is actually a nice check that everyone generated the same commits. "
        },
        {
            "id": "comment-15060811",
            "author": "Terry Smith",
            "date": "2015-12-16T20:41:06+0000",
            "content": "Does LUCENE-6933 affect this ticket? "
        },
        {
            "id": "comment-15060823",
            "author": "Dawid Weiss",
            "date": "2015-12-16T20:46:25+0000",
            "content": "LUCENE-6933 is an attempt to clean up and consolidate all the SVN history and, eventually, move to git entirely. "
        },
        {
            "id": "comment-15060830",
            "author": "Terry Smith",
            "date": "2015-12-16T20:49:17+0000",
            "content": "Ah, so I could consider this as a backup plan until LUCENE-6933 is ready? "
        },
        {
            "id": "comment-15060838",
            "author": "Dawid Weiss",
            "date": "2015-12-16T20:53:09+0000",
            "content": "Absolutely! There is actually no promise that we will switch to git... it requires folks to agree to switch over. Paul's script is definitely a good interim solution until anything else emerges (infra fixes the problem with sync, we figure out what to do, etc.). "
        },
        {
            "id": "comment-15060845",
            "author": "Paul Elschot",
            "date": "2015-12-16T20:56:48+0000",
            "content": "LUCENE-6933 could affect this in the sense of the choice of the starting point to generate a git branch. The script here uses the latest git-svn-id: commit for that, but that could be changed.\n\nIn case git-svn picks up again, the script currently restarts the generated branch, which is why the generated branch is called temporary and should normally only be used locally. However when the git-svn mirror is completely turned off, that temporary character will disappear.\n\nI don't know how git-svn is doing for LUCENE-6933. In case git-svn runs into problems, this script might be used instead, with a few changes of course. The script is now mainly for local use. "
        },
        {
            "id": "comment-15060890",
            "author": "Paul Elschot",
            "date": "2015-12-16T21:17:09+0000",
            "content": "To get an impression of what this is currently doing please fetch the trunk.svn.20151216 tag into an existing lucene-solr repository:\n\n\ngit fetch https://github.com/PaulElschot/lucene-solr.git trunk.svn.20151216\n "
        },
        {
            "id": "comment-15061941",
            "author": "Michael McCandless",
            "date": "2015-12-17T11:45:49+0000",
            "content": "Paul Elschot, is your latest patch at a committable point here...? "
        },
        {
            "id": "comment-15062738",
            "author": "Paul Elschot",
            "date": "2015-12-17T20:27:45+0000",
            "content": "The patch is commitable, with the usual guarantees \n\nDo not run this script from an svn working copy or a git working tree, it might overwrite itself there. Copy it to another place first.\n\nI'm planning to make the script also start a new branch from the earliest available revision of an svn branch.\nThe idea is to try this for some svn branches which need their history in git, see LUCENE-6933. "
        },
        {
            "id": "comment-15062980",
            "author": "ASF subversion and git services",
            "date": "2015-12-17T22:32:40+0000",
            "content": "Commit 1720686 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1720686 ]\n\nLUCENE-6922: latest version of svn to git mirror workaround script, from Paul Elschot "
        },
        {
            "id": "comment-15062981",
            "author": "ASF subversion and git services",
            "date": "2015-12-17T22:32:54+0000",
            "content": "Commit 1720687 from Michael McCandless in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1720687 ]\n\nLUCENE-6922: latest version of svn to git mirror workaround script, from Paul Elschot "
        },
        {
            "id": "comment-15062983",
            "author": "Michael McCandless",
            "date": "2015-12-17T22:33:21+0000",
            "content": "OK I committed the last patch (from yesterday) ... thanks Paul Elschot! "
        },
        {
            "id": "comment-15065818",
            "author": "Paul Elschot",
            "date": "2015-12-20T15:56:04+0000",
            "content": "Patch of 20 Dec 2015. This:\n\n\tadds a check that the script is not run from within a known working copy/tree.\n\tfixes a bug which sometimes caused the wrong file to be used as the source for protection bits.\n\tonly changes protection bits of regular files.\n\n\n\nThe bug actually left my git working copy in a state in which git reset --hard failed because some directories were no more executable. "
        },
        {
            "id": "comment-15065821",
            "author": "Paul Elschot",
            "date": "2015-12-20T16:03:05+0000",
            "content": "I pushed tag trunk.svn.20151220 to my github lucene-solr repo as above.\nThis has just over 980 commits from the 17th of June to now in parallel with trunk.\nIt took just over 15 minutes to generate that here, about 1 commit per second. "
        },
        {
            "id": "comment-15089390",
            "author": "ASF subversion and git services",
            "date": "2016-01-08T15:53:38+0000",
            "content": "Commit 1723747 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1723747 ]\n\nLUCENE-6922: more improvements in the svn to git mirror workaround tool "
        },
        {
            "id": "comment-15089392",
            "author": "ASF subversion and git services",
            "date": "2016-01-08T15:53:51+0000",
            "content": "Commit 1723748 from Michael McCandless in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1723748 ]\n\nLUCENE-6922: more improvements in the svn to git mirror workaround tool "
        },
        {
            "id": "comment-15089393",
            "author": "Michael McCandless",
            "date": "2016-01-08T15:54:03+0000",
            "content": "Thanks Paul Elschot, I committed your last patch. "
        },
        {
            "id": "comment-15113694",
            "author": "Paul Elschot",
            "date": "2016-01-23T11:08:05+0000",
            "content": "svnBranchToGit.py script of 23 Jan 2015.\n\nAfter the migration to git the tag for the 5.3.2 release seems to be missing, for the rest the new git repo is looking very good.\n\nThis script creates a local git branch lucene_solr_5_3.svn from the lucene_solr_5_3 branch.\nThe 5.3.2 release is easy to locate there as a commit of 16 Jan for SOLR-8496.\n\nThis also contains some general improvements since the previous patch.\n "
        },
        {
            "id": "comment-15113697",
            "author": "Paul Elschot",
            "date": "2016-01-23T11:13:41+0000",
            "content": "I put the latest result on github:\ngit fetch https://github.com/PaulElschot/lucene-solr.git lucene_solr_5_3.svn "
        },
        {
            "id": "comment-15113786",
            "author": "Dawid Weiss",
            "date": "2016-01-23T15:26:00+0000",
            "content": "Indeed, I overlooked this, thanks for confirming. I'll fix. "
        },
        {
            "id": "comment-15115507",
            "author": "Paul Elschot",
            "date": "2016-01-25T16:43:18+0000",
            "content": "After the move from svn to git there is no more need for this.\n\nThanks for moving, and also thanks for infra for keeping the git-svn connection up longer than announced.\n\nI have reforked the github repo PaulElschot/lucene-solr from apache/lucene-solr. For future reference I pushed the above .svn tags into there, however please expect these tags to disappear again in a few months. "
        }
    ]
}