{
    "id": "LUCENE-1845",
    "title": "if the build fails to download JARs for contrib/db, just skip its tests",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Every so often our nightly build fails because contrib/db is unable to download the necessary BDB JARs from http://downloads.osafoundation.org.  I think in such cases we should simply skip contrib/db's tests, if it's the nightly build that's running, since it's a false positive failure.",
    "attachments": {
        "LUCENE-1845.patch": "https://issues.apache.org/jira/secure/attachment/12417640/LUCENE-1845.patch",
        "LUCENE-1845.txt": "https://issues.apache.org/jira/secure/attachment/12417396/LUCENE-1845.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-08-23T11:34:23+0000",
            "content": "I set the property \"ignoreerrors\" to true on the get task. This should print out if there is a problem with the download and continue. The sanity check will fail if the jar is not present and unit-test will be skipped.\ni guess that should do the job though. ",
            "author": "Simon Willnauer",
            "id": "comment-12746590"
        },
        {
            "date": "2009-08-23T15:29:34+0000",
            "content": "Hmm – I tried applying the patch, then changing the download URL to something bogus that fails, and then \"ant test\" hits errors during the \"compile-core\" target.  It seems like we have to somehow skip compile-core if the sanity check fails? ",
            "author": "Michael McCandless",
            "id": "comment-12746618"
        },
        {
            "date": "2009-08-23T17:23:40+0000",
            "content": "Weird! - I changed the URL to http://foo.bar and ant.test succeeds with the expected message. I guess you changed the get url in bdb-je/build.xml but this file (the je.jar) is not the cause of this issue unless I got something wrong. I thought this issues is caused by the fact that http://downloads.osafoundation.org/db/db-${db.version}.jar is not available on a regular basis. Thats why I did not patch this sub-module.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12746640"
        },
        {
            "date": "2009-08-23T17:33:16+0000",
            "content": "Aha, you're right!  Sorry about the confusion.\n\nOK so this is good to go.  Can you commit? ",
            "author": "Michael McCandless",
            "id": "comment-12746642"
        },
        {
            "date": "2009-08-23T17:50:49+0000",
            "content": "OK so this is good to go. Can you commit?\n\nwill do! ",
            "author": "Simon Willnauer",
            "id": "comment-12746646"
        },
        {
            "date": "2009-08-23T19:35:13+0000",
            "content": "Mike, I attached a new patch. The old one had some problems with the sanity check as the check needs the jar though. \nThis one will work for unit-tests but it will fail if ant tries to run compile-core during a build,jar, release etc. \n\nhow should we handle if the jar can not be obtained? I would rather say the build must fail asif we du a release build the jar will not be included. \nWould it be an option to put the jar to some other location maybe on a commiter page on people.apache.org?! \n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12746664"
        },
        {
            "date": "2009-08-23T19:36:13+0000",
            "content": "this time with ASF licence grant ",
            "author": "Simon Willnauer",
            "id": "comment-12746665"
        },
        {
            "date": "2009-08-24T09:49:06+0000",
            "content": "The old one had some problems with the sanity check as the check needs the jar though. \n\nAhh OK.\n\nhow should we handle if the jar can not be obtained? I would rather say the build must fail asif we du a release build the jar will not be included. \n\nI think, ideally, If it's the nightly build that's running, the disposition should be robust (ignored), else it should be brittle (like it is today).\n\nI'm not sure about hosting the JARs.  The license for bdb-je is at http://www.oracle.com/technology/software/products/berkeley-db/htdocs/jeoslicense.html and for bdb http://www.oracle.com/technology/software/products/berkeley-db/htdocs/oslicense.html.  I think these libs were LGPL'd before Oracle acquired Sleepycat, which was why we could not host them, but I have no idea if Oracle's licensing would permit us to host/redistribute them.  Maybe an inquiry on legal@ is the next step?  If the licensing allows it, I think the simplest solution would be to check them in to our svn repository.... ",
            "author": "Michael McCandless",
            "id": "comment-12746793"
        },
        {
            "date": "2009-08-24T12:54:50+0000",
            "content": "Checking it into svn would be an option as far as I know just having something in SVN would not violate licenses as we do not distribute it but I will check with legal.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12746851"
        },
        {
            "date": "2009-08-25T09:36:23+0000",
            "content": "Last 3 builds were broken because of this... can we \"improve\" the sanity checking to check for lack of existence of the JAR, and then skip everything? ",
            "author": "Michael McCandless",
            "id": "comment-12747328"
        },
        {
            "date": "2009-08-25T17:47:10+0000",
            "content": "The current patch disables every build (jar, compile-core, compile-test) if the jar can not be downloaded. It will print a message in the following cases:\n\n\tif the file can not be downloaded\n\tif the sanity check does not succeed\n\n\n\n@mike could you have a look at it and try to run it with the <get> commented out as the jar is now available again :/\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12747515"
        },
        {
            "date": "2009-08-25T17:59:02+0000",
            "content": "Looks great Simon!  I removed the JAR, changed the <get> to a bogus host, and confirmed that it did not fail.\n\nNow the only question is how to not fail only if it's the nightly build.  Note that the nightly build runs \"ant nightly\", so can we somehow set something under the \"nightly\" target, that contrib/db/bdb's build.xml could access, to know it's the nightly build? ",
            "author": "Michael McCandless",
            "id": "comment-12747523"
        },
        {
            "date": "2009-08-25T18:23:54+0000",
            "content": "I was not aware of the \"nightly\" target. Thanks for pointing it out.\n\nI added a \"nightly\" property to trunk/build.xml and let the jar-check always succeed if the nightly property is NOT set. I also changed the name of the property from \"db-jar-check-success\" to \"execute-build\".\n\nI can not commit /trunk/build.xml can you do once I have the bdb/build.xml in?\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12747537"
        },
        {
            "date": "2009-08-25T19:05:06+0000",
            "content": "For some reason I get hunk #3 failing when I try to apply the patch:\n\n\nHunk #3 FAILED at 66.\n1 out of 3 hunks FAILED -- saving rejects to file contrib/db/bdb/build.xml.rej\n\n\n\nBut the approach sounds good.  So if \"ant nightly\" is the target, and it fails to download the JAR, it'll just warn and continue.  But if it's any other target, it'll fail.\n\nOK, I'll commit the toplevel build.xml changes shortly.  They are fully independent (just sets the \"nightly\" property). ",
            "author": "Michael McCandless",
            "id": "comment-12747578"
        },
        {
            "date": "2009-08-25T19:07:34+0000",
            "content": "OK I committed the top-level build.xml.  Thanks Simon! ",
            "author": "Michael McCandless",
            "id": "comment-12747582"
        },
        {
            "date": "2009-08-25T19:14:02+0000",
            "content": "For some reason I get hunk #3 failing when I try to apply the patch:\nHmm... works for me on a clean checkout. did you revert the last changes?! \n\nI plan to commit shortly - if anybody does not feel comfortable with it speak up.\n ",
            "author": "Simon Willnauer",
            "id": "comment-12747585"
        },
        {
            "date": "2009-08-25T21:23:41+0000",
            "content": "Reopening based on java-dev discussion... ",
            "author": "Michael McCandless",
            "id": "comment-12747656"
        },
        {
            "date": "2009-08-26T08:38:58+0000",
            "content": "I added the short discussion I had on legal-discuss for the record.\nOne person confirmed that we could add the jar to SVN if we do not redistribute them. I'm not a license guy but I guess we should first figure out what license this particular jar has. It is not a download from the oracle page (you can only get the sources for this particular jar not the binary as a download) but something from  http://downloads.osafoundation.org/db/ without any license notice.\n\nI would suggest to try to build the jar from source with the latest release on the oracle page so we can be sure about the license. Once I have done this I will send another request to legal to confirm tha we are not violating anything.\n\nThe discussion from legal-discuss\n\n> Hey there,\n> We (lucene) have a contrib project that provides a Index-Directory\n> implementation based on BerkleyDB. This code downloads a jar file from\n> http://downloads.osafoundation.org/... to build and test the code.\n> This jar-file is not included in any distribution and we do not plan\n> to do so. The problem is that the download site is down very\n> frequently so we are looking for another way to obtain the jar. Here\n> is the question do we violate the license if we add the jar-file to\n> the svn repository but not distributing it at all? Another way would\n> be to add the jar to a commiter page on people.apache.org and download\n> it from there.\n> The license is here:\n> http://www.oracle.com/technology/software/products/berkeley-db/htdocs/oslicense.html\n\nComplicated matter.\nBDB seems viral in that anything that uses must be made available in\nsource form. So, ASF has no problem fulfilling that requirement, but\ndownstream users may. OTOH, you say that the BDB is only used to build\n(do you really need it to build?) and test your implementation, BUT\nyou say that you have an implementation based on BDB, so I presume\nthat it requires it to run.\n\nMy interpretation is;\n * IFF your component is purely optional, having a dependency on BDB\nis Ok, provided it is not shipped with the release and that the user\nis provided with the information that the BDB needs to be downloaded\nseparately and advised to review their license.\n\nFor your second part; Can you stick the BDB jar(s) somewhere more\nreliably available?\n * Yes, I think so. The license allows distribution in any form,\nsource or binary... So, I suggest that you upload it to a dependable\nhost, such as SF, ibiblio.org or similar. people.apache.org --> I\nwouldn't recommend it. ASF SVN --> yes, that should be Ok, but there\nis a strong recommendation of not putting JARs in there... Also there\nis a risk that the encumbrance around BDB is forgotten and used beyond\nwhat is acceptable if it is 'laying around'.\n\n\nCheer\n\n ",
            "author": "Simon Willnauer",
            "id": "comment-12747836"
        },
        {
            "date": "2009-08-26T12:26:30+0000",
            "content": "OK I think we should simply revert our changes to the build.xml's, now, and then sort out how to host the JAR more reliably...\n\nI'll go revert the changes. ",
            "author": "Michael McCandless",
            "id": "comment-12747913"
        },
        {
            "date": "2009-08-26T12:40:52+0000",
            "content": "Moving to 3.0... this need not block 2.9. ",
            "author": "Michael McCandless",
            "id": "comment-12747919"
        },
        {
            "date": "2009-11-11T07:19:45+0000",
            "content": "Moving out for 3.1 ",
            "author": "Simon Willnauer",
            "id": "comment-12776336"
        },
        {
            "date": "2010-01-17T13:27:32+0000",
            "content": "I haven't looked at this issue for a while now but I figured today that the version we are using is \"not available for download\" anymore on the oracle pages. If you follow the link in the build file you will be able to download the zip file but I guess we should upgrade to the latest 3.3 version of BDB-JE.\n(see http://www.oracle.com/technology/software/products/berkeley-db/je/index.html - version 3.3.69)\nThere is also another mirror that serves the jar directly (a maven repository) that might be more reliable.\nI updated the patch to load the 3.3.93 version of the jar directly and skip the unzip step as we now download only the jar file. I also updated the maven pom template files to reference the right version of BDB-JE which wasn't the case though.\n\nI think we should give the maven-repo mirror a chance though.\n ",
            "author": "Simon Willnauer",
            "id": "comment-12801395"
        },
        {
            "date": "2010-01-17T13:50:24+0000",
            "content": "Looks good Simon!  Getting the JAR directly is a good savings (it's roughly 1 MB, but the full .zip distribution is roughly 6 MB.  I agree we should give maven a shot... hopefully it's more reliable than the direct download we do now. ",
            "author": "Michael McCandless",
            "id": "comment-12801402"
        },
        {
            "date": "2010-01-17T14:10:28+0000",
            "content": "mike, can you take this issue it unfortunately touches core stuff :/\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12801404"
        },
        {
            "date": "2010-01-17T14:32:03+0000",
            "content": "OK... ",
            "author": "Michael McCandless",
            "id": "comment-12801409"
        },
        {
            "date": "2010-01-17T14:52:23+0000",
            "content": "Resolving this... if we still have reliability problems download the JAR from Oracle, let's open a new issue to find a better way to host the jar. ",
            "author": "Michael McCandless",
            "id": "comment-12801411"
        },
        {
            "date": "2010-01-17T15:08:17+0000",
            "content": "mike, thanks for resolving this. I already replied to the commit mail but mention it here again for completeness....\nWe should add a changes.txt entry to notify users that we upgraded the version.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12801416"
        },
        {
            "date": "2010-01-17T15:11:46+0000",
            "content": "We should add a changes.txt entry to notify users that we upgraded the version.\n\nAhh right – will do. ",
            "author": "Michael McCandless",
            "id": "comment-12801417"
        }
    ]
}