{
    "id": "LUCENE-7531",
    "title": "Remove packing support from FST",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "priority": "Minor",
        "status": "Resolved",
        "type": "Task"
    },
    "description": "This seems to be only used for the kuromoji dictionaries, but we could easily rebuild those dictionaries with packing disabled.",
    "attachments": {
        "LUCENE-7531.patch": "https://issues.apache.org/jira/secure/attachment/12836158/LUCENE-7531.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15622238",
            "author": "Adrien Grand",
            "date": "2016-10-31T14:04:08+0000",
            "content": "Here is a patch. "
        },
        {
            "id": "comment-15623675",
            "author": "Michael McCandless",
            "date": "2016-10-31T22:46:09+0000",
            "content": "+1 "
        },
        {
            "id": "comment-15624116",
            "author": "David Smiley",
            "date": "2016-11-01T02:35:12+0000",
            "content": "I like the reduction in complexity.  What's the motivation?  Does the packing feature just seem not worth it? "
        },
        {
            "id": "comment-15625244",
            "author": "Dawid Weiss",
            "date": "2016-11-01T12:00:42+0000",
            "content": "Well, it's sad to see the stuff I came up with (and Mike implemented) go away...  But more seriously – this does seem to impact large automata. Can you recode the existing automata and see how much we lose by removing packing? Looking at the patch target addresses are still vint-encoded; if I recall right the compression ratio gained by packing was significant (compared to baseline fst), but a small fraction of overall input size. So a fst gain of a few megabytes for data size that is several hundred megabytes is indeed worth cutting the additional complexity of fst construction.\n\n+1 to remove it, but some stats on dictionary sizes before/after would be nice. "
        },
        {
            "id": "comment-15625584",
            "author": "Adrien Grand",
            "date": "2016-11-01T14:37:31+0000",
            "content": "The thing that made me open that issue is not really that I think packing is not a good idea: actually I have no idea. But I'd like to clean up PackedInts a bit, and FST packing is one user of this API. And I noticed there is nothing in the code base that enables packing on FSTs, except the kuromoji dictionaries, which are smaller with packing disabled than with packing enabled. "
        },
        {
            "id": "comment-15625990",
            "author": "Dawid Weiss",
            "date": "2016-11-01T16:55:51+0000",
            "content": "The code may not call for packed dictionaries, but there may be existing dictionaries that are already packed. Anyway, I don't think this is that crucial, really. \n\nexcept the kuromoji dictionaries, which are smaller with packing disabled than with packing enabled.\n\nThis should never happen, something is wrong. The way automata compression was implemented in Morfologik would nearly always decrease the size of the automaton, especially in the first few optimization/ reshuffling steps. [1].\n\n[1] http://www.cs.put.poznan.pl/dweiss/site/publications/download/fsacomp.pdf "
        },
        {
            "id": "comment-15636391",
            "author": "Michael McCandless",
            "date": "2016-11-04T13:54:14+0000",
            "content": "This should never happen, something is wrong. \n\nI also confirmed that with packing enabled, the Kuromoji FSTs got bigger, which I agree is messed up!  Net/net I must not have implemented it properly \n\nI even tested having the terms index for the default postings format do packing, indexing Wikipedia English docs, and it also increased the FST size!\n\nNet/net it's hairy complex code with apparently dubious value at this point. "
        },
        {
            "id": "comment-15636402",
            "author": "Dawid Weiss",
            "date": "2016-11-04T13:58:39+0000",
            "content": "Fair enough. +1 for simpler implementation. "
        },
        {
            "id": "comment-15654146",
            "author": "ASF subversion and git services",
            "date": "2016-11-10T14:14:34+0000",
            "content": "Commit c4c5e868d2304148c146d52833ac2c80b0541dc3 in lucene-solr's branch refs/heads/master from Adrien Grand\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=c4c5e86 ]\n\nLUCENE-7531: Removed packing support from FST. "
        },
        {
            "id": "comment-15654228",
            "author": "Adrien Grand",
            "date": "2016-11-10T14:44:33+0000",
            "content": "Thanks all for having a look! "
        }
    ]
}