{
    "id": "LUCENE-3009",
    "title": "binary packaging: lucene modules/contribs that depend on jars are confusing",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "3.2",
            "3.3",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In the binary release, i noticed lucene contribs (for example benchmark)\nthat rely upon jar files, don't include them, nor do they have a README telling\nyou they depend upon them, nor is there any hint they actually have any dependencies at all!\n\nwe should improve this either by including the jars you need or by including a README.txt telling you what a particular module/contrib depends upon.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-03-31T01:59:11+0000",
            "content": "I checked some older lucene binary releases (e.g. lucene-2.4.0.tar.gz) and i noticed they had the same problem,\nso I think its always been an issue, not something we recently introduced, but I think we should fix for the next release. ",
            "author": "Robert Muir",
            "id": "comment-13013788"
        },
        {
            "date": "2011-04-01T02:05:50+0000",
            "content": "I question if we really need to bother with binary lucene / module tar/zip artifacts – if we only had source release packages, then the build.xml files make it clear exactly what the dpeendencies for each piece of code are.\n\nfor Solr, a large percentage of hte user base doesn't know anything about java – so it definitely makes sense to have artifacts with precompiled jars; but if you're using the java libraries directly, you're a java programer, and you should be able to run \"ant compile\" on a src release (or use the maven to fetch the published jars with poms that link to the appropriate dependencies) ",
            "author": "Hoss Man",
            "id": "comment-13014355"
        },
        {
            "date": "2011-04-01T02:08:43+0000",
            "content": "When i brought up the idea of source code only, it didn't seem too popular.\n\nThat being said, if we go source code only, the maven stuff should be source-code only too. ",
            "author": "Robert Muir",
            "id": "comment-13014357"
        },
        {
            "date": "2011-04-01T02:12:40+0000",
            "content": "bq, the maven stuff should be source-code only too.\n\n-1.  (mutually exclusive concepts) ",
            "author": "Steve Rowe",
            "id": "comment-13014362"
        },
        {
            "date": "2011-05-31T02:33:04+0000",
            "content": "I'm going to fix this bug in our binary release.\n\nIf we want to remove the lucene binary releases, this is a more complicated discussion and we can do this in a separate email or issue. ",
            "author": "Robert Muir",
            "id": "comment-13041387"
        },
        {
            "date": "2011-05-31T02:35:50+0000",
            "content": "Committed revision 1129472 (branch32), 1129473 (branch3x), 1129474 (trunk) ",
            "author": "Robert Muir",
            "id": "comment-13041389"
        },
        {
            "date": "2011-06-03T16:37:12+0000",
            "content": "Bulk closing for 3.2 ",
            "author": "Robert Muir",
            "id": "comment-13043477"
        }
    ]
}