{
    "id": "LUCENE-5100",
    "title": "BaseDocIdSetTestCase",
    "details": {
        "components": [],
        "fix_versions": [
            "4.5"
        ],
        "affect_versions": "None",
        "priority": "Trivial",
        "labels": "",
        "type": "Improvement",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "As Robert said on LUCENE-5081, we would benefit from having common testing infrastructure for our DocIdSet implementations.",
    "attachments": {
        "LUCENE-5100.patch": "https://issues.apache.org/jira/secure/attachment/12591730/LUCENE-5100.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-07-10T21:30:07+0000",
            "content": "Patch. This is mostly a factorization of the tests of EliasFanoDocIdSet and WAH8DocIdSet. It is hard to factor the tests of FixedBitSet and OpenBitSet since they don't share a common interface for prevSetBit and nextSetBit for instance. Nothing that we can't improve but I am wondering why we need OpenBitSet? Are there any cases where we need the bit set to grow on demand? I have checked a few places where it was used (it is used all over the code base) and every time it seemed to me that it could have been advantageously replaced with a FixedBitSet? ",
            "author": "Adrien Grand",
            "id": "comment-13705090"
        },
        {
            "date": "2013-07-10T22:10:06+0000",
            "content": "I know of a few places where I used this in lucene-core where FixedBitSet cannot currently be used:\nAnything having to do with SortedSetDocValues, where ordinals can exceed > 2B, because OpenBitSet can do that. FixedBitSet is limited to int.\n\nHowever use for example, in SloppyPhraseScorer seems unnecessary. ",
            "author": "Robert Muir",
            "id": "comment-13705142"
        },
        {
            "date": "2013-07-11T11:32:55+0000",
            "content": "Thanks for the explanation, Robert. I tried to factorize some code between TestFixedBitSet and TestOpenBitSet by adding an abstraction level on top of both FixedBitSet and OpenBitSet but its complexity made the tests even harder to read, so I think I won't touch the prevSetBit/nextSetBit/flip/... tests and just add the tests from BaseDcIdSetTestCase.\n\nUpdated patch. The modification in EliasFanoEncoder is here to always be able to pass maxDoc - 1 as an upper bound even when the set is empty (an assertion would trip otherwise). I think it is ready? ",
            "author": "Adrien Grand",
            "id": "comment-13705716"
        },
        {
            "date": "2013-07-11T12:04:21+0000",
            "content": "Patch looks good. I would also keep the non-DocIdSet testing separate: prevSetBit/nextSetBit/flip/... are not part of the main DocIdSet API, so they should not be in the base test case. But you can still use methods from the base class to check what happend after you did a flip(), so implementing a test for flip() should be easy. ",
            "author": "Uwe Schindler",
            "id": "comment-13705738"
        },
        {
            "date": "2013-07-11T21:28:35+0000",
            "content": "The patch provides independent tests for EliasFanoDocIdSet and does not change the existing TestEliasFanoSequence for the Elias-Fano special cases, great. ",
            "author": "Paul Elschot",
            "id": "comment-13706258"
        },
        {
            "date": "2013-07-12T07:13:48+0000",
            "content": "Commit 1502448 from Adrien Grand\n[ https://svn.apache.org/r1502448 ]\n\nLUCENE-5100: BaseDocIdSetTestCase. ",
            "author": "ASF subversion and git services",
            "id": "comment-13706736"
        },
        {
            "date": "2013-07-12T07:15:45+0000",
            "content": "Commit 1502450 from Adrien Grand\n[ https://svn.apache.org/r1502450 ]\n\nLUCENE-5100: BaseDocIdSetTestCase (merged from r1502448). ",
            "author": "ASF subversion and git services",
            "id": "comment-13706739"
        },
        {
            "date": "2013-10-05T10:18:56+0000",
            "content": "4.5 release -> bulk close ",
            "author": "Adrien Grand",
            "id": "comment-13787049"
        }
    ]
}