{
    "id": "LUCENE-7348",
    "title": "Add dynamic stemmer for Ukrainian",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "modules/analysis"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Minor",
        "status": "Open",
        "type": "New Feature"
    },
    "description": "We're adding a dictionary based lemmatizing analyzer for Ukrainian in https://issues.apache.org/jira/browse/LUCENE-7287.\nIt would be nice to have a dynamic stemmer that can handle words that are not in the dictionary.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15341014",
            "author": "Andriy Rysin",
            "date": "2016-06-21T03:52:51+0000",
            "content": "Michael McCandless Hey Michael,\nI've analyzed the inflection rules we have in dict_uk project (https://github.com/arysin/dict_uk) and it has ~4500 inflection rules (most of those are simple match but some are regexps). Those rules cover almost all possible affixes. I can probably drop rare and homonimic ones to make it below 4k but then the question comes up where to go next?\n1) having all the rules would be nice as it'll provide high accuracy and high level of compatibility with the dictionary-based lemmatizer created in LUCENE-7287 (we could probably even make a hybrid solution)\n2) having smaller/simpler will benefit the performance (but to simplify it properly we would have to analyze the frequency/importance of each rule)\n3) is lemmatizing analysis good or stemming is preferred? for real stemming we would have to work more on the rules to find the (pseudo)roots for each inflection rule\n\nI tried to look at existing light stemmers and many are very basic. It looks like we're going in reverse and I am trying to understand if already having complex solution we want to make it simpler (it looks that the only benefit will be performance)? I also tried to google on how to do the stemming \"right\" but nothing serious jumped at me especially applicable for Slavic languages.\n\nThanks. "
        }
    ]
}