{
    "id": "LUCENE-3349",
    "title": "Place warning about today's released Java7 version on Lucene/Solr/Root webpage's news and send mail to java-user",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/test"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Today, JDK/JRE 1.7.0 GA was released by Oracle. Unfortunately they didn't fix the Hotspot problems affecting loops to be miscompiled (LUCENE-3335, LUCENE-3346). This can lead to Solr crashing with default configuration on startup or sudden index corrumption depending on configuration.\n\nWe should send an email to the java-user and solr-user list describing the problem. Also place a note in the news section of Solr, Lucene Core and top-level website.\n\nI propose the following text:\n\n\nJul 28th, 2011: WARNING: Index corruption and crashes in Apache Lucene Core / Apache Solr with Java 7\n\nOracle released Java 7 today. Unfortunately it contains hotspot compiler optimizations, which miscompile some loops. This can affect code of several Apache projects. Sometimes JVMs only crash, but in several cases, results calculated can be incorrect, leading to bugs in applications (see Hotspot bugs http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=7070134, http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=7044738, http://bugs.sun.com/bugdatabase/view_bug.do?bug_id=7068051).\n\nApache Lucene Core and Apache Solr are two Apache projects, which are affected by these bugs, namely all versions released until today. Solr users with the default configuration will have Java crashing with SIGSEGV as soon as they start to index documents, as one affected part is the well-known Porter stemmer (see LUCENE-3335). Other loops in Lucene may be miscompiled, too, leading to index corruption (especially on Lucene trunk with pulsing codec; other loops may be affected, too - LUCENE-3346, ).\n\nThese problems were detected only 5 days before the official Java 7 release, so Oracle had no time to fix those bugs, affecting also many more applications. In response to our questions, they proposed to include the fixes into service release u2 (eventually into service release u1, see http://mail.openjdk.java.net/pipermail/hotspot-compiler-dev/2011-July/005971.html). This means you cannot use Apache Lucene/Solr with Java 7 releases before Update 2! If you do, please don't open bug reports, it is not the committers' fault! At least disable loop optimizations using the -XX:-UseLoopPredicate JVM options to not risk index corruptions.\n\nPlease note: Also Java 6 users are affected, if they use one of those JVM options, which are not enabled by default: -XX:+OptimizeStringConcat or -XX:+AggressiveOpts\n\nIt is strongly recommended not to use any hotspot optimization switches in any Java version without extensive testing!\n\nIn case you upgrade to Java 7, remember that you may have to reindex, as the unicode version shipped with Java 7 changed and tokenization behaves differently (e.g. lowercasing). For more information, read JRE_VERSION_MIGRATION.txt in your distribution package!",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-07-28T17:22:36+0000",
            "content": "+1 ",
            "author": "Robert Muir",
            "id": "comment-13072425"
        },
        {
            "date": "2011-07-28T17:26:02+0000",
            "content": "Uwe asked me to edit the typos, too bad because i really liked corrumption!!!! ",
            "author": "Robert Muir",
            "id": "comment-13072429"
        },
        {
            "date": "2011-07-28T17:37:06+0000",
            "content": "+1 scary! ",
            "author": "Michael McCandless",
            "id": "comment-13072435"
        },
        {
            "date": "2011-07-28T17:40:11+0000",
            "content": "Should I also send this mail to announce@apache.org, so press/journalists also get the information? This would maybe make Oracle work faster  ",
            "author": "Uwe Schindler",
            "id": "comment-13072437"
        },
        {
            "date": "2011-07-28T17:45:42+0000",
            "content": "Should I also send this mail to announce@apache.org\n\nYes, this is exactly the type of thing that list is for...\n\nhttp://www.apache.org/foundation/mailinglists.html\n\nThe Apache Announcements list contains news and announcements about the foundation and its projects. Announcements of major software releases, new projects, and other important news are included. Messages are posted only by the Foundation; there is no discussion.\n\n(emphasis mine) ",
            "author": "Hoss Man",
            "id": "comment-13072440"
        },
        {
            "date": "2011-07-28T17:49:00+0000",
            "content": "I might even suggest tweaking the wording so that the initial para is generic info about how this is a potentially serious problem for all java applications (at least: ones that use loops) and then in the subsequent paragraphs mention specificly how it is known to affect Lucene/Solr.\n\nthat way it will be more visible to people who may not particularly care about Lucene/Solr (but do care about java) ",
            "author": "Hoss Man",
            "id": "comment-13072444"
        },
        {
            "date": "2011-07-28T18:04:41+0000",
            "content": "In the case you upgrade to Java 7, remember that you have to reindex everything, as the unicode version shipped with Java 7 changed and tokenization behaves differently!\n\nStandardTokenizer is not dependent on JVM Unicode version, so this statement is neither true in the strict sense nor in the \"average\" sense, assuming the \"average\" user employs StandardTokenizer/Analyzer.\n ",
            "author": "Steve Rowe",
            "id": "comment-13072452"
        },
        {
            "date": "2011-07-28T18:11:34+0000",
            "content": "LowercaseFilter is dependent on unicode version...\n\nMaybe we make it a little bit softer with \"may need to reindex\". ",
            "author": "Uwe Schindler",
            "id": "comment-13072458"
        },
        {
            "date": "2011-07-28T18:58:37+0000",
            "content": "I changed the text a little bit taking Hoss' and Steven's comments into account. ",
            "author": "Uwe Schindler",
            "id": "comment-13072483"
        },
        {
            "date": "2011-07-28T19:17:31+0000",
            "content": "I would say maybe we should remove the advice about 'In case you upgrade to java 7', instead recommending that you do not use java 7. ",
            "author": "Robert Muir",
            "id": "comment-13072493"
        },
        {
            "date": "2011-07-28T21:01:41+0000",
            "content": "Sites updates in SVN and people.apache.org. ",
            "author": "Uwe Schindler",
            "id": "comment-13072529"
        },
        {
            "date": "2011-07-28T21:15:07+0000",
            "content": "Mail sent to announce@apache.org; general@lucene.apache.org; java-user@lucene.apache.org; solr-user@lucene.apache.org ",
            "author": "Uwe Schindler",
            "id": "comment-13072533"
        },
        {
            "date": "2011-07-31T15:25:16+0000",
            "content": "I posted an article in my (new) blog about the whole Java 7 issue: http://blog.thetaphi.de/2011/07/real-story-behind-java-7-ga-bugs.html ",
            "author": "Uwe Schindler",
            "id": "comment-13073361"
        }
    ]
}