{
    "id": "LUCENE-4508",
    "title": "Stored fields should require as little resources as possible when no field is stored",
    "details": {
        "components": [],
        "fix_versions": [
            "4.1"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Wish",
        "resolution": "Not A Problem",
        "status": "Closed"
    },
    "description": "Currently, stored fields may require a non-negligible amount of memory and/or disk space even if no field is actually stored. We should find a way to reduce these requirements.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-10-26T14:45:40+0000",
            "content": "I think the way is to just add a \"NoStoredFieldsFormat\".\n\nI looked at doing this as part of general purpose codecs and it gets really hairy, and the use case is very atypical.\n\nLUCENE-2025 ",
            "author": "Robert Muir",
            "id": "comment-13484967"
        },
        {
            "date": "2012-10-26T14:52:09+0000",
            "content": "Thanks for the link, I didn't know about this issue.\n\nI am not sure the use-case is that atypical. For example, I think it would make sense for someone who just needs to store an ID and a few scoring factors to only use doc values? ",
            "author": "Adrien Grand",
            "id": "comment-13484971"
        },
        {
            "date": "2012-10-26T14:56:45+0000",
            "content": "That may be, but i think thats still atypical. \n\nWhy not just add this \"null\" or \"no\" implementation to give these people the choice? \n\nThis is a great example of where flexible indexing wins out, its very tricky to incorporate this kinda stuff into a one-size-fits-all format.\nInstead we can just provide alternatives.\n\nThink about bulk merge and only having one doc with stored fields, then that doc getting deleted, and all those kinda cases. ",
            "author": "Robert Muir",
            "id": "comment-13484973"
        },
        {
            "date": "2012-10-26T15:04:03+0000",
            "content": "You convinced me.  ",
            "author": "Adrien Grand",
            "id": "comment-13484977"
        },
        {
            "date": "2012-10-26T15:07:05+0000",
            "content": "Well I still think we could offer the option as a start (either this issue, or on LUCENE-2025) ?\n\nMaybe, one day later we figure out how to do this cleanly and safely in the default impl, but for now it would be a nice\nstep to offer the option? ",
            "author": "Robert Muir",
            "id": "comment-13484979"
        },
        {
            "date": "2012-10-26T16:14:12+0000",
            "content": "Well I still think we could offer the option as a start\n\nHow do you imagine it? A new StoredFieldsFormat impl where StoredFieldsReader.visitDocument has an empty body and StoredFieldsWriter.writeField throws UnsupportedOperationException? ",
            "author": "Adrien Grand",
            "id": "comment-13485026"
        },
        {
            "date": "2012-10-26T16:16:33+0000",
            "content": "actually we can just throw exception when startDoc and n > 0... i wrote this up on 2025  ",
            "author": "Robert Muir",
            "id": "comment-13485029"
        },
        {
            "date": "2012-10-26T16:40:35+0000",
            "content": "oh right, sorry!\n ",
            "author": "Adrien Grand",
            "id": "comment-13485037"
        }
    ]
}