{
    "id": "LUCENE-1156",
    "title": "Wikipedia Document Generation Changes",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/benchmark"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "The EnwikiDocMaker currently produces a fair number of documents that are in the download, but are of dubious use in terms of both benchmarking and indexing.  \n\nThese issues are:\n\n\n\tRedirect (it currently only handles REDIRECT and redirect, but there are documents as Redirect\n\tTemplate files appear to be useless.  These are marked by the term Template: at the beginning of the body.  See for example: http://en.wikipedia.org/wiki/Template:=)\n\tImage only pages, as in http://en.wikipedia.org/wiki/Image:Sciencefieldnewark.jpg.jpg  These are about as useful as the Redirects and Templates\n\tFiles pending deletion:  This one is a bit trickier to handle, but they are generally marked by \"Wikipedia:Votes for deletion\" or some variation of that depending where along it is in being deleted\n\n\n\nI think I can implement this such that it is backward compatible, if there is such a need when it comes to the contrib/benchmark suite.",
    "attachments": {
        "LUCENE-1156.patch": "https://issues.apache.org/jira/secure/attachment/12374263/LUCENE-1156.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-01-25T21:04:24+0000",
            "content": "I should amend the Template item.  They are not useless, but I am not exactly sure how to incorporate them.  From what I can understand, they are used for transclusion (Wikipedia's term) in other documents.  Something like an import statement, if you will.  They can thus be reused across many articles.  So, technically, in order to properly index, one should resolve all the transclusions first, then index.  This doesn't seem worthwhile to do from a parsing standpoint. ",
            "author": "Grant Ingersoll",
            "id": "comment-12562674"
        },
        {
            "date": "2008-01-29T15:00:27+0000",
            "content": "This patch fixes the redirect problem and the adds an option to discard image only documents (default is to keep them).\n\nIt does not strip the template pages, nor does it expand them.\n\nPatch applies from contrib/benchmark ",
            "author": "Grant Ingersoll",
            "id": "comment-12563542"
        },
        {
            "date": "2008-01-30T16:16:49+0000",
            "content": "This version alters the ExtractWikipedia class to use the EnwikiDocMaker, such that we don't have to maintain two doc producers.\n\nDoesn't do templates or pending deletions. ",
            "author": "Grant Ingersoll",
            "id": "comment-12564072"
        },
        {
            "date": "2008-01-30T16:36:43+0000",
            "content": "catch the no more data exception in ExtractWikipedia ",
            "author": "Grant Ingersoll",
            "id": "comment-12564085"
        },
        {
            "date": "2008-01-31T02:00:33+0000",
            "content": "committed ",
            "author": "Grant Ingersoll",
            "id": "comment-12564268"
        }
    ]
}