{
    "id": "LUCENE-2405",
    "title": "Benchmark DocMaker no longer allows \"off prescription\" usage",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/benchmark"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The EnwikiDocMaker was a pretty handy tool for indexing wikipedia for demos.  Since LUCENE-1595, it is now much harder to create Lucene documents programmatically using the EnwikiContentSource and DocMaker b/c the DocMaker doesn't allow one to programmatically set the properties and ContentSource.\n\nPerhaps, we should refactor the Enwiki stuff a little bit out to the Wikipedia package.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-04-20T13:48:17+0000",
            "content": "Perhaps I'm missing something, but one can still write an EnwikiDocMaker which consumes EnwikiContentSource and sets whatever properties the latter outputs? The whole idea behind the refactoring was to allow such combinations - you should be able to construct the documents however you want, without depending too much on the content source. If you know a certain CS outputs some things you want to refer to directly, write a dedicated DocMaker. Although perhaps we can allow DocMaker itself be more properties-aware?\n\nI've done what I did in 1595 because of exactly that purpose - I create docs on a special way, adding all sorts of things like facets and sorting over date etc. But I don't want to duplicate that code so that it can work on multiple content sources ... ",
            "author": "Shai Erera",
            "id": "comment-12858889"
        },
        {
            "date": "2010-04-21T13:32:55+0000",
            "content": "Grant was this really \"Won't Fix\"?  Or \"Invalid'?  Ie is there really a regression here? ",
            "author": "Michael McCandless",
            "id": "comment-12859352"
        }
    ]
}