{
    "id": "LUCENE-477",
    "title": "Build an index which allows me to broswe by category.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "1.4",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Hello there,\n\nI have a collection of documents that I am using lucene to build an index for, and then I have a jsp app to search my documents. This all works great. I believe lucene is such an amazing product, but thats a whole other topic. Anyway, maybe it's my lack of experience in building indexes, but I am have trouble coming up with an index that kind of mimics verity's parametric index.  You see my documents all have a category path (I have over 50,000 docs).  A document can be at any level of the category path, and that same path can have many different documents. IE. Document x, has a category path USA//New Jersey//Trenton//09890 and Document y has a category path USA//New Jersey//Trenton//09890.  \n\nBasically, I would like to build an index using lucene, where when I search, if my results were to bring back those two documents, I would like to retrieve the distinct category path for those two documents.  Of course I can loop through and build a vector with only the unique paths that come in the search results, but that obviously would take to long when I get lets say 10000 results from my search.\n\nSo the question I guess is, how can I build an index that would facilitate this functionality for me.  If anyone has any suggestions I would greatly appreciate it.\n\nThanks,\nMark",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2005-12-07T08:10:16+0000",
            "content": "This isn't a \"bug\" or a \"feature\" or a \"task\" as much as it is a \"question\" about using lucene in a particular way.  Questions generally recieve more comment on the java-user at lucene dot apache dot org then they do when posted in JIRA.\n\nIn particular, you should search the mailing list archive for \"facet\" or \"faceted\" before you ask teh question, previous discussions may give you enough info to solve your problem. ",
            "author": "Hoss Man",
            "id": "comment-12359495"
        },
        {
            "date": "2005-12-07T09:11:09+0000",
            "content": "Yes, please bring this topic to the user list rather than JIRA ",
            "author": "Erik Hatcher",
            "id": "comment-12359501"
        }
    ]
}