{
    "id": "LUCENE-4267",
    "title": "binary packaging should include licenses/",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I heavy-committed LUCENE-4262 to enable ivy's sync=true (which means not just get the right jars, but delete shit that shouldnt be there) to end the whole \"clean-jars\" issue.\n\nIts working except for the solr/lib (SOLR-3686) which we must fix for a number of reasons.\n\nAnyway, because of this I made a lucene/licenses and solr/licenses directories respectively that contain all the .sha1/license/notice for 3rd party jars, so ivy wouldnt delete them.\n\nwe should update build patterns so these directories are in the binary release, its valuable information on our 3rd party licensing and additional verification for consumers.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-27T23:49:03+0000",
            "content": "we should update build patterns so these directories are in the binary release, its valuable information on our 3rd party licensing and additional verification for consumers.\n\n\"valuable\" seems like an understatement ... Unless i'm missing something it's absolutely critical that we include these licenses.  If we include some third party jar in our binary pacakges, we damn well better include the license/NOTICE for those jars, or we are probably violating those licenses.\n\nPersonally: i think we should revamp the \"licenses/sha checker code\" in our build so that it not only compares the jars with what it finds in /licenses, it should also copy what it finds in /licenses into the same directory as those jars – that way our binary packaging logic in ant should continue to work the same as it did in 4.0.0-ALPHA, and users can always see at a glance what hte license/NOTICE is for any thirdy-party jar, because it will be sitting right there next to it in the same directory.\n\nIf we don't do this, if thye have to hunt in a special directory in the pacakge to find these license files, they might not realize that's where they are, and could assume they are ASL2.0 since they are included in an ASF release. ",
            "author": "Hoss Man",
            "id": "comment-13424219"
        },
        {
            "date": "2012-07-28T03:36:55+0000",
            "content": "\n\"valuable\" seems like an understatement ... Unless i'm missing something it's absolutely critical that we include these licenses. If we include some third party jar in our binary pacakges, we damn well better include the license/NOTICE for those jars, or we are probably violating those licenses.\n\nNope, thats the responsibility of LICENSE.txt, NOTICE.txt. Of course the hilarious thing is nobody in apache can actually agree on the format of these files, so they could be ascii-art of my ass and still be legit \n\n\nPersonally: i think we should revamp the \"licenses/sha checker code\" in our build so that it not only compares the jars with what it finds in /licenses, it should also copy what it finds in /licenses into the same directory as those jars – that way our binary packaging logic in ant should continue to work the same as it did in 4.0.0-ALPHA, and users can always see at a glance what hte license/NOTICE is for any thirdy-party jar, because it will be sitting right there next to it in the same directory.\n\nIf we don't do this, if thye have to hunt in a special directory in the pacakge to find these license files, they might not realize that's where they are, and could assume they are ASL2.0 since they are included in an ASF release.\n\nI dont think we should copy anything, it makes our packaging more confusing. Its fine to have a licenses/ folder, this is actually additional \"extra\" to apache's minimum NOTICE.txt (which can contain a picture of my ass, again, nobody truly knows for sure the format, see the incufuckubator list for more details on that).\n\nThe licenses/ stuff is additional for us, as a PMC, since we know apache is totally fucked up on this, to be able to properly manage our 100+ third party licenses.\n ",
            "author": "Robert Muir",
            "id": "comment-13424260"
        },
        {
            "date": "2013-08-22T18:53:58+0000",
            "content": "This can be resolved, fix version 4.0, no? ",
            "author": "Steve Rowe",
            "id": "comment-13747771"
        }
    ]
}