{
    "id": "LUCENE-3878",
    "title": "CheckIndex should check deleted documents too",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In 4.0 livedocs are passed down to the enums, thus deleted docs are not so special.\n\nSo I think checkindex should not pass the livedocs down to the enums when checking,\nit should pass livedocs=null and check all the postings. It already does this separately to \ncollect stats i think to compare against the term/collection statistics? But we should\njust clean this up and only use one enum.\n\nFor example LUCENE-3876 is a case where we were actually making a corrumpt index,\n(a position was negative) but because the document in question was deleted, CheckIndex \ndidn't detect this.\n\nThis could have caused problems if someone just passed null for livedocs (maybe they \nare doing something where its not so important to take deletions into account)",
    "attachments": {
        "LUCENE-3878.patch": "https://issues.apache.org/jira/secure/attachment/12518688/LUCENE-3878.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-03-16T15:35:46+0000",
            "content": "+1 ",
            "author": "Michael McCandless",
            "id": "comment-13231296"
        },
        {
            "date": "2012-03-16T15:40:23+0000",
            "content": "Actually if we are willing to add SegmentReader.rawTermPositions() to match SegmentReader.rawTermDocs() \nwe could do this in 3.x too... ",
            "author": "Robert Muir",
            "id": "comment-13231303"
        },
        {
            "date": "2012-03-16T15:59:44+0000",
            "content": "patch for trunk. ",
            "author": "Robert Muir",
            "id": "comment-13231314"
        },
        {
            "date": "2012-03-16T16:20:46+0000",
            "content": "updated patch with separate liveDocs validation for each segment... checking the number of set bits etc. ",
            "author": "Robert Muir",
            "id": "comment-13231336"
        },
        {
            "date": "2012-03-16T16:27:50+0000",
            "content": "I'm still nervous about the patch losing coverage for postings.\n\nThe problem with the previous second-pass was we only did minimal checks with a null liveDocs.\n\nI think ideally we factor these checks into separate methods that take liveDocs, and return stats.\nif there are deletions we do the full check with the real liveDocs too, and assert stats <= rawStats\n\nIt will be heavy but i think we can do it from this patch. ",
            "author": "Robert Muir",
            "id": "comment-13231347"
        },
        {
            "date": "2012-03-16T19:18:07+0000",
            "content": "ok this was pretty easy as a start. I didnt add any extra assertions just moved the logic into checkFields(Fields).\nwe should be able to refactor testVectors to use this too, just like norms and docValues both share the same logic.\n\nI will mark this issue resolved now. ",
            "author": "Robert Muir",
            "id": "comment-13231542"
        },
        {
            "date": "2012-03-16T20:45:45+0000",
            "content": "Patch, cutting over testTermVectors to checkFields, making it also check deleted docs.\n\nThis found a bug!  In Lucene40 codec's term vectors seekCeil... fixed. ",
            "author": "Michael McCandless",
            "id": "comment-13231608"
        },
        {
            "date": "2012-03-16T20:53:00+0000",
            "content": "Thanks for the help! I like it much better with the shared method/testing also deleted docs. ",
            "author": "Robert Muir",
            "id": "comment-13231615"
        },
        {
            "date": "2012-03-16T20:58:28+0000",
            "content": "Heavy bug fixing! That separation of liveDocs in CheckIndex is a very good idea.\nI hope you are not annoyed by my vLong nitpicking... ",
            "author": "Uwe Schindler",
            "id": "comment-13231623"
        },
        {
            "date": "2012-03-16T21:02:13+0000",
            "content": "Not annoyed only confused (I think i dont totally understand your comment).\n\nSo i was just waiting for your patch, then I would know for sure\nwhat you meant. ",
            "author": "Robert Muir",
            "id": "comment-13231628"
        }
    ]
}