{
    "id": "LUCENE-5211",
    "title": "StopFilterFactory docs do not advertise/explain hte \"format\" option",
    "details": {
        "components": [],
        "fix_versions": [
            "4.6",
            "6.0"
        ],
        "affect_versions": "4.2",
        "priority": "Minor",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "StopFilterFactory supports a \"format\" option for controlling wether \"getWordSet\" or \"getSnowballWordSet\" is used to parse the file, but this option is not advertised and people can be confused by looking at the example stopword files include in the releases (some of which are in the snoball format w/ \"|\" comments) and try to use them w/o explicitly specifying format=\"snowball\" and silently get useless stopwords (that include the \"| comments\" as literal portions of hte stopwrds.\n\nwe need to better document the use of \"format\" and consider updating all of the example stopword files we ship that are in the snowball format with a note about the need to use format=\"snowball\" with those files.\n\nInitial Bug Report\nThe StopFilterFactory builds a CharArraySet directly from the raw lines of the supplied words file. This causes a problem when using the stop word files supplied with the Solr/Lucene distribution. In particular, the comments in those files get added to the CharArraySet. A line like this...\n\nceci           |  this\n\nShould result in the string \"ceci\" being added to the CharArraySet, but \"ceci           |  this\" is what actually gets added.\n\nWorkaround: Remove all comments from stop word files you are using.\n\nSuggested fix: The StopFilterFactory should strip any comments, then strip trailing whitespace. The stop word files supplied with the distribution should be edited to conform to the supported comment format.",
    "attachments": {
        "LUCENE-5211.code.patch": "https://issues.apache.org/jira/secure/attachment/12603683/LUCENE-5211.code.patch",
        "LUCENE-5211.stopfilecomments.patch": "https://issues.apache.org/jira/secure/attachment/12603682/LUCENE-5211.stopfilecomments.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-09-13T23:17:56+0000",
            "content": "The StopFilterFactory supports two different \"formats\" of stop word files, the default format that has been supported since day #1 allows comments using \"#\", but more recently support was added for the \"snowball\" stopword format which is what is used in the stopwords_fr.txt file you seem to be refering to.\n\nthe example usage of stopwords_fr.txt in solr explicitly configures the StopFilterFactory so that it knows the file is in the \"smowball\" format...\n\n\n<filter class=\"solr.StopFilterFactory\" ignoreCase=\"true\" words=\"lang/stopwords_fr.txt\" format=\"snowball\" />\n\n\n\nSo there doesn't seem to any functionaly bug here – just a documntation issue: when support was added for the \"snowball\" format, it appears that nothing was added to the class javadocs of hte factory to make this clear.\n\nIf no one beats me to it, i'll clean this up next week. ",
            "author": "Hoss Man",
            "id": "comment-13767145"
        },
        {
            "date": "2013-09-14T00:31:58+0000",
            "content": "Ah, very good. I was a bit shocked when my French stop words weren't working. This seemed like too big of a functionality bug to be easily missed. ",
            "author": "Hayden Muhl",
            "id": "comment-13767238"
        },
        {
            "date": "2013-09-17T21:38:51+0000",
            "content": "two patches to make it easier to review...\n\n\n\tpatch that improves the StopFilterFactory javadocs to mention format, as well as improves the error handling of the format param (includes tests)\n\tpatch that updates all the snowball formatted files with a comment pointing out hteneed to use format=\"snowball\" with those files.\n\n\n\nFWIW: the second patch was generated by the following perl script...\n\n\n#!/usr/bin/perl -i -n\n\nmy $msg = q{NOTE: To use this file with StopFilterFactory, you must specify format=\"snowball\"};\nprint $_;\nif (m/This notice was added./) {\n    print \" |\\n | $msg\\n\";\n}\n\n\n\nRun as...\nfind -name *.txt | xargs grep -l \"This notice was added\" | xargs ~/tmp/lucene5211.note.in.snowballfiles.pl ",
            "author": "Hoss Man",
            "id": "comment-13770017"
        },
        {
            "date": "2013-09-19T19:06:38+0000",
            "content": "Commit 1524809 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1524809 ]\n\nLUCENE-5211: Better javadocs and error checking of 'format' option in StopFilterFactory, as well as comments in all snowball formated files about specifying format option ",
            "author": "ASF subversion and git services",
            "id": "comment-13772174"
        },
        {
            "date": "2013-09-19T21:35:20+0000",
            "content": "Commit 1524848 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1524848 ]\n\nLUCENE-5211: Better javadocs and error checking of 'format' option in StopFilterFactory, as well as comments in all snowball formated files about specifying format option (merge r1524809) ",
            "author": "ASF subversion and git services",
            "id": "comment-13772352"
        }
    ]
}