{
    "id": "LUCENE-5698",
    "title": "Evaluate Lucene classification on publicly available datasets",
    "details": {
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [
            "modules/classification"
        ],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "The Lucene classification module need some publicly available dataset for keep track on the development.\n\nNow it woud be nice to have some generated fast test-sets, and some bigger real world dataset too.",
    "attachments": {
        "0810-test.patch": "https://issues.apache.org/jira/secure/attachment/12660844/0810-test.patch",
        "0803-test.patch": "https://issues.apache.org/jira/secure/attachment/12659572/0803-test.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14084112",
            "author": "Gergő Törcsvári",
            "content": "I separated the assertions and the data preparator functions. It's need some renaming! ",
            "date": "2014-08-03T19:45:01+0000"
        },
        {
            "id": "comment-14090487",
            "author": "Tommaso Teofili",
            "content": "I like the idea of creating TestDataset implementations to be used, the TestAssertion seems a bit duplicated of ClassificationTestBase.\nPerhaps what we can do is add the TestDataset as a further parameter of ClassificationTestBase methods.\nThen I'd merge, for example, KNNTest (from your patch) and KNearestNeighborClassifierTest (from existing code base) together. ",
            "date": "2014-08-08T08:46:14+0000"
        },
        {
            "id": "comment-14090488",
            "author": "Tommaso Teofili",
            "content": "Also, as this is part of what we aim to do in this issue, we would need a way to:\n1. plug publicly available datasets in\n2. evaluate classification of a certain Classifier against different TestDatasets ",
            "date": "2014-08-08T08:48:28+0000"
        },
        {
            "id": "comment-14090547",
            "author": "Gergő Törcsvári",
            "content": "Yes, I cut the ClassificationTestBase to TestDataset and TestAssertion thats why they duplicating, It is a working progress idea, I think it could be a good direction, but it needs some suggestion. I'm working on the publicly available datasets.\n\nI have a question for that:\nWhat is the preferd way for the public test set. I could build a separated project, with example code snippets for training and evaluating (and maybe some measurement summary). Or I can make a project what is making the index, what can be plug into the Lucene tests. The second method have some cons like the test need fail if it classifying badly, and some question like; where I need to put the initial indexes (or source documents).\n\n(I started a separated project but of course it can be merged.)   ",
            "date": "2014-08-08T09:47:38+0000"
        },
        {
            "id": "comment-14090983",
            "author": "Gergő Törcsvári",
            "content": "https://github.com/tg44/Lucene_20news\n\n20news dataset in a small project. ",
            "date": "2014-08-08T17:15:18+0000"
        }
    ]
}