{
    "id": "LUCENE-4516",
    "title": "Suggesters: allow to associate a user-specified key (int) with a string",
    "details": {
        "components": [
            "core/FSTs"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "New Feature",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "As a user, I'd like to associate a “foreign key” with a string (rather: final node) in the suggester index (in addition to the rank). For example, I’d like to add “Lucene in Action” with key 1933988177 (the ISBN) and some rank to a WFST or AnalyzingSuggester. A completion would return the completed string and the key associated with each entry (i.e. final nodes get a “key” field (int), which is returned in the LookupResult). That foreign key could also be used for fast de-duping (no more string/byte array comparisons).\n\nThere may be workarounds for the “foreign key” use case –it seems that lots of data structures would be affected by storing a user-provided key with final nodes, which therefore may not be a viable path. It may be possible to encode the foreign key in the transducer’s output instead.\n\nDiscussion on java-user@lucene:\n\nMike McCandless: \n\nThis is maybe the same idea as\nLUCENE-4491 ?  Could you simply stuff your ISBN onto the end of the suggestion (ie enroll Lucene in\nAction|1933988177)?\n\nDawid Weiss:\n\nJust remember that if your suffixes are unique then you'll be expanding the automaton quite a bit (unique suffix paths).\n\nD.\n\nMike:\n\nThat's a good point... encoding into the FST's output may be better.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-10-31T12:19:49+0000",
            "content": "I don't think we should add an option to do this, instead you would just make your own suggester tailored to your use case?\n\nFor you it might be an int, for me maybe i have 6 long values, for another guy 2 bytes, and so on.\n\nSo I think someone should just fork one of our suggester impls and e.g. change the Outputs impl to suit their needs. ",
            "author": "Robert Muir",
            "id": "comment-13487703"
        },
        {
            "date": "2012-10-31T13:28:40+0000",
            "content": "I agree with robert that this is maybe tailored. In general I think with the ideas in LUCENE-4491 we can make a good step forward to this and maybe enable it in a specialized suggester. ",
            "author": "Simon Willnauer",
            "id": "comment-13487766"
        }
    ]
}