{
    "id": "LUCENE-6789",
    "title": "change IndexSearcher default similarity to BM25",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "priority": "Major",
        "status": "Resolved",
        "type": "Improvement"
    },
    "description": "Since Lucene 4.0, the statistics needed for this are always present, so we can make the change without any degradation.\n\nI think the change should be a 6.0 change only: it will prevent any surprises. DefaultSimilarity is renamed to ClassicSimilarity to prevent confusion. No indexing change is needed as we use the same norm format, its just a runtime switch. Users can just do IndexSearcher.setSimilarity(new ClassicSimilarity()) to get the old behavior.  I did not change solr's default here, I think that should be a separate issue, since it has more concerns: e.g. factories in configuration files and so on.\n\nOne issue was the generation of synonym queries (posinc=0) by QueryBuilder (used by parsers). This is kind of a corner case (query-time synonyms), but we should make it nicer. The current code in trunk disables coord, which makes no sense for anything but the vector space impl. Instead, this patch adds a SynonymQuery which treats occurrences of any term as a single pseudoterm. With english wordnet as a query-time synonym dict, this query gives 12% improvement in MAP for title queries on BM25, and 2% with Classic (not significant). So its a better generic approach for synonyms that works with all scoring models.\n\nI wanted to use BlendedTermQuery, but it seems to have problems at a glance, it tries to \"take on the world\", it has problems like not working with distributed scoring (doesn't consult indexsearcher for stats). Anyway this one is a different, simpler approach, which only works for a single field, and which calls tf(sum) a single time.",
    "attachments": {
        "LUCENE-6789.patch": "https://issues.apache.org/jira/secure/attachment/12754824/LUCENE-6789.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14736447",
            "author": "Michael McCandless",
            "date": "2015-09-09T08:31:33+0000",
            "content": "+1 "
        },
        {
            "id": "comment-14736472",
            "author": "Adrien Grand",
            "date": "2015-09-09T08:48:31+0000",
            "content": "There are still some changes that refer to ClassicSimilarity as the default similarity instead of BM25Similarity, eg.\n\n\n- * just tweaking the default implementation: {@link DefaultSimilarity}.\n+ * just tweaking the default implementation: {@link ClassicSimilarity}.\n\n\n\nShould we change it?\n\nAlso can we make SynonymQuery final? "
        },
        {
            "id": "comment-14736520",
            "author": "Ishan Chattopadhyaya",
            "date": "2015-09-09T09:15:26+0000",
            "content": "+1\nLucene's BM25 competes very well against other search engines in terms of retrieval effectiveness and speed.\nHere are benchmarks from the IR reproducibility track of SIGIR 2015 (Santiago, CL): https://github.com/lintool/IR-Reproducibility/blob/master/Gov2.md "
        },
        {
            "id": "comment-14744370",
            "author": "ASF subversion and git services",
            "date": "2015-09-14T22:03:37+0000",
            "content": "Commit 1703070 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1703070 ]\n\nLUCENE-6789: change IndexSearcher default similarity to BM25 "
        },
        {
            "id": "comment-14744373",
            "author": "Robert Muir",
            "date": "2015-09-14T22:04:20+0000",
            "content": "Thanks Adrien: I applied those fixes. "
        }
    ]
}