{
    "id": "LUCENE-1625",
    "title": "openReaderPassed not populated in CheckIndex.Status.SegmentInfoStatus",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "2.4",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "When using CheckIndex programatically, the openReaderPassed flag on the SegmentInfoStatus is never populated (so it always comes back false)\n\nlooking at the code, its clear that openReaderPassed is defined, but never used\n\nfurthermore, it appears that not all information that is propagated to the \"InfoStream\" is available via SegmentIinfoStatus\n\nAll of the following information should be able to be gather from public properties on the SegmentInfoStatus:\ntest: open reader.........OK\ntest: fields, norms.......OK [2 fields]\ntest: terms, freq, prox...OK [101 terms; 133 terms/docs pairs; 133 tokens]\ntest: stored fields.......OK [100 total field count; avg 1 fields per doc]\ntest: term vectors........OK [0 total vector count; avg 0 term/freq vector fields per doc]",
    "attachments": {
        "CheckIndex.patch": "https://issues.apache.org/jira/secure/attachment/12410969/CheckIndex.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-05-09T10:22:34+0000",
            "content": "OK I committed a fix for openReaderPassed.  Thanks Tim!\n\nCould you (or, anyone, but since you seem to have the itch...) create a patch for the further details you'd like returned? ",
            "author": "Michael McCandless",
            "id": "comment-12707650"
        },
        {
            "date": "2009-05-11T12:44:22+0000",
            "content": "I will work up a patch if i am able to find the time, currently, as a workaround, i am just setting the infostream to System.stderr when a \"verbose\" output is needed (which is acceptable for my current use) ",
            "author": "Tim Smith",
            "id": "comment-12708002"
        },
        {
            "date": "2009-06-17T18:48:27+0000",
            "content": "Attached patch for exposing all collected stats\n(created with svn diff > CheckIndex.patch (please correct me if this is not the right way (this is my first patch)))\n\n\nThis patch breaks out the testing of field norms, terms, stored fields, and term vectors into their own methods\nit also creates a status object for each one of these tests to make the results transparent\n\nthis status object exposes:\n\n\tstats previously only available from infoStream\n\texception thrown if test fails (null if test was successful)\n\n\n\neach SegmentInfoStatus will have these status objects attached\n\nNOTE:\nThis patch allows that if one of the above tests fails, it will attempt to keep testing (to find all failures)\nany failure will still result in the overall segment being rejected ",
            "author": "Tim Smith",
            "id": "comment-12720826"
        },
        {
            "date": "2009-06-25T14:31:47+0000",
            "content": "This patch is awesome, Tim; thanks!  I will commit in a day or two. ",
            "author": "Michael McCandless",
            "id": "comment-12724106"
        },
        {
            "date": "2009-06-26T18:10:35+0000",
            "content": "Thanks Tim! ",
            "author": "Michael McCandless",
            "id": "comment-12724640"
        }
    ]
}