{
    "id": "LUCENE-2599",
    "title": "Deprecate Spatial Contrib",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.6"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The spatial contrib is blighted by bugs.  The latest series, found by Grant and discussed here shows that we need to re-think the cartesian tier implementation.\n\nGiven the need to create a spatial module containing code taken from both lucene and Solr, it makes sense to deprecate the spatial contrib, and start from scratch in the new module.",
    "attachments": {
        "LUCENE-2599.patch": "https://issues.apache.org/jira/secure/attachment/12465038/LUCENE-2599.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-12-01T10:07:14+0000",
            "content": "chris, wanna come up with a patch against trunk that deprecates things and I go and port it to 3.x - once we are done we can nuke it from trunk \n ",
            "author": "Simon Willnauer",
            "id": "comment-12965648"
        },
        {
            "date": "2010-12-01T10:10:59+0000",
            "content": "On it. ",
            "author": "Chris Male",
            "id": "comment-12965649"
        },
        {
            "date": "2010-12-01T11:07:42+0000",
            "content": "Attached patch for deprecating the contrib.  Each class is deprecated, and a message is left in the package.html. ",
            "author": "Chris Male",
            "id": "comment-12965659"
        },
        {
            "date": "2010-12-01T11:46:00+0000",
            "content": "Attaching a patch that includes the creation of a new spatial module.  Definitely needs someone to look at the build.xml (Robert?) but I think it works. ",
            "author": "Chris Male",
            "id": "comment-12965670"
        },
        {
            "date": "2010-12-06T02:02:31+0000",
            "content": "Chris, I think we should not add an empty modules sub though. I plan to commit the deprecation part to 3.x and nuke spatial from 4.0 entirely. Would you want to move forward and open an issue to fill the module with some solr spatial logic?\n\nObjections anybody?\n ",
            "author": "Simon Willnauer",
            "id": "comment-12967063"
        },
        {
            "date": "2010-12-06T02:15:07+0000",
            "content": "I just noticed that Solr depends upon some methods in DistanceUtils.  We'll need to move that into the module before removing the contrib from 4x. ",
            "author": "Chris Male",
            "id": "comment-12967064"
        },
        {
            "date": "2011-02-28T05:23:44+0000",
            "content": "I am in favor of nuking spatial contrib (FYI I'm the author of SOLR-2155).  Solr 3.1 will be released soon so I suggest that committers here act now while there's time. ",
            "author": "David Smiley",
            "id": "comment-13000115"
        },
        {
            "date": "2011-02-28T05:28:20+0000",
            "content": "The nuking will occur in trunk so its unaffected by the Solr 3.1 release.  However some of Solr's spatial code depends on the contrib so its too late to make the deprecations in 3.1. ",
            "author": "Chris Male",
            "id": "comment-13000118"
        },
        {
            "date": "2011-02-28T05:35:43+0000",
            "content": "Please don't remove remove any lucene spatial capabilities until there is a suitable replacement.\n\nIts absurd to tell users they should have to use Solr to use spatial, this makes no sense. ",
            "author": "Robert Muir",
            "id": "comment-13000121"
        },
        {
            "date": "2011-02-28T06:00:55+0000",
            "content": "Thats a fair point and there is every intention to do that.  But its also dangerous to continue to offer code with known (and probably many unknown) bugs. ",
            "author": "Chris Male",
            "id": "comment-13000127"
        },
        {
            "date": "2011-09-01T14:08:50+0000",
            "content": "I'd like to come to an agreement here and finish this off as to make a clear statement about spatial in Lucene 4.\n\nIt seems we have a few options in front of us now:\n\n\n\tDeprecate in 3x, nuke fully in trunk\n\tDeprecate in 3x and in trunk, moving the code to the sandbox\n\tDeprecate in 3x and in trunk and leave the code where it is\n\tDo nothing\n\n\n\nRobert's concern that removing the contrib entirely without providing an alternative seems very reasonable.  But as I said in February, I'm very wary of continuing to release code which has so many problems.  As such, I favour deprecating in 3x and in trunk and sandboxing the code wit big warnings that it'll go when we have a better solution.\n\nAny opinions? Robert? David? ",
            "author": "Chris Male",
            "id": "comment-13095303"
        },
        {
            "date": "2011-09-01T14:17:17+0000",
            "content": "Deprecate in 3x, absolutely. We know it's broken and we need to send a message to folks who don't know any better. I hope we can at least get consensus on this part.\n\nI don't see any point in this bad code moving forward into Lucene 4, whether there is a replacement or not. ",
            "author": "David Smiley",
            "id": "comment-13095309"
        },
        {
            "date": "2011-09-08T03:27:42+0000",
            "content": "Deprecate in 3x and in trunk, moving the code to the sandbox\n+1\n\nand then decide what to do one something better gets up-to-speed ",
            "author": "Ryan McKinley",
            "id": "comment-13099734"
        },
        {
            "date": "2012-03-16T17:14:59+0000",
            "content": "This contrib module was eliminated from trunk as part of LUCENE-3795. So what to do about 3x?: Add a @Deprecated annotation to all classes in the contrib?  And add a CHANGES.txt entry? ",
            "author": "David Smiley",
            "id": "comment-13231398"
        },
        {
            "date": "2012-03-17T02:21:34+0000",
            "content": "+1 ",
            "author": "Chris Male",
            "id": "comment-13231806"
        },
        {
            "date": "2012-03-26T20:52:59+0000",
            "content": "I'm about to commit a bunch of deprecations and the following edit to the overview.html javadoc:\n\n<h2>DEPRECATED</h2>\n<p>\n  The Lucene 3.x spatial contrib module is deprecated as of Solr 3.6. In Solr 4 there is a new spatial\n  module that should be used instead.\n  <br/>\n  For further information, see \n  <a href=\"https://issues.apache.org/jira/browse/LUCENE-2599\">LUCENE-2599</a>.\n  <br/>\n  The old documentation follows below:\n</p>\n\n ",
            "author": "David Smiley",
            "id": "comment-13238806"
        },
        {
            "date": "2012-03-26T20:58:02+0000",
            "content": "I think thats confusing. It should say Lucene 3.6, Lucene 4. Your current wording\nmakes people think that they have to use Solr to do spatial queries, and thats not\ntrue, correct? ",
            "author": "Robert Muir",
            "id": "comment-13238819"
        },
        {
            "date": "2012-03-26T21:07:14+0000",
            "content": "Marking as fixed. The javadoc & changes.txt were revision 1305595. ",
            "author": "David Smiley",
            "id": "comment-13238830"
        },
        {
            "date": "2012-03-26T21:07:50+0000",
            "content": "Woops Robert; you are right.  I will fix this right away. ",
            "author": "David Smiley",
            "id": "comment-13238832"
        }
    ]
}