{
    "id": "LUCENE-1408",
    "title": "DocumentsWriter.init() doesn't grow fieldDataHash array at same rate as allFieldData array, leading to OOM errors",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.3.2",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "See DocumentsWriter.init() – line 787ish\n\nWhen a new field is encountered, and arrays need to be resized, the allFieldDataArray is resized to be 50% larger, and the hashArray is resized to be twice as large.  Everytime.  The hashArray grows much faster than the fieldData array.\n\nIn addition, the fieldDataHashMask is set to be one less than the fieldDataArray size, rather than the hashArray.\n\nThe latter problem obviously leads to under/bizarre utilization of the hash array, while the former can, under circumstances where you are using an excessive number of field columns, lead to premature OOMs (30k field columns is something like 30 million entry placeholders in the hash array, or about 120M per ThreadState).\n\nTrivial fix for both would be to change *1.5 to *2, and reset the Mask based on newHashSize, not newSize.  Given you are using a mask, it looks like you want a power of two, so you can't use *1.5 everywhere, but you could resize the hash only when needed, rather than each time you resize the data array, though that would be somewhat more difficult.\n\nI made this Minor as it only affects extreme field use.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2008-10-01T10:23:45+0000",
            "content": "Whoa, good catch!  We are growing the hash too quickly, and, under utilizing it.\n\nThis is actually already fixed in 2.4 – DocumentsWriter.java was refactored into an [internal only] indexing chain.  This code moved to DocFieldProcessorPerThread.java:\n\n    https://svn.apache.org/repos/asf/lucene/java/trunk/src/java/org/apache/lucene/index/DocFieldProcessorPerThread.java\n\nWith the refactoring we no longer have 2 arrays (we just have the hash) and the hash \"properly\" doubles its size and sets mask = size-1 when it needs to grow.  Can you look at the code above and see if it looks right?  If so, I'm leaning towards resolving this as WONTFIX (on 2.3.x) since it's already fixed in 2.4. ",
            "author": "Michael McCandless",
            "id": "comment-12635991"
        },
        {
            "date": "2008-10-12T18:14:49+0000",
            "content": "Won't fix on 2.3, since it only happens with very very large number of fields, and, it's fixed in 2.4. ",
            "author": "Michael McCandless",
            "id": "comment-12638879"
        }
    ]
}