{
    "id": "LUCENE-6366",
    "title": "\"cz\" (vs ISO langauge code \"cs\") for Czech analysis package?",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "As noted by Eduard Moraru on the solr-user mailing list, the sample fieldtypes Solr provides for dealing with the Czech use \"cz\" as a fieldType, dynamicField, and stopwords file naming convention – but \"cz\" isn't the language code for Czech – the correct langauge code is \"cs\".\n\nSolr's naming convention here comes directly from the lucene analysis package name for the Czech analysis classes: org.apache.lucene.analysis.cz; so before making any changes in the Solr sample configs (SOLR-7267), we should probably clarify if/why the lucene package name is like this.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14367590",
            "author": "Robert Muir",
            "date": "2015-03-18T18:10:59+0000",
            "content": "some of these older ones just dont follow any ISO system. \n\nchinese stuff is also under .cn and brazilian portuguese is under .br\n "
        },
        {
            "id": "comment-14367603",
            "author": "Hoss Man",
            "date": "2015-03-18T18:16:33+0000",
            "content": "Should we fix/move these to match the country code and deprecate the old packages & classes?\n "
        },
        {
            "id": "comment-14367629",
            "author": "Robert Muir",
            "date": "2015-03-18T18:35:48+0000",
            "content": "Its not exactly obvious what they should be. keep in mind some languages don't have ISO-639-1 or ISO-639-* at all (e.g. brazilian portuguese, sorani kurdish) so adhering to that will just not work. Language tags (e.g. pt-BR) mean packages would have to have underscores, hyphen is not even allowed in the package name.\n\n "
        },
        {
            "id": "comment-14368027",
            "author": "Hoss Man",
            "date": "2015-03-18T22:10:30+0000",
            "content": "Its not exactly obvious what they should be. keep in mind some languages don't have ISO-639-1 or ISO-639-* at all (e.g. brazilian portuguese, sorani kurdish) so adhering to that will just not work.\n\nSo let me rephrase/correct my question(s):\n\n1) For languages which do have an ISO-639-1 code, should we \"fix\" the existing java package names?\n\n2) For languages which do not have an ISO-639-1 code, should we adopt & document some sort of specific rule for how we namespace these sorts of things? "
        },
        {
            "id": "comment-14368119",
            "author": "Robert Muir",
            "date": "2015-03-18T23:21:29+0000",
            "content": "I don't think thats any less confusing than just having no system at all like today. Either they are consistent or they are not, and you just can't make assumptions about what the code means. "
        },
        {
            "id": "comment-14368676",
            "author": "Uwe Schindler",
            "date": "2015-03-19T08:07:01+0000",
            "content": "I don't think it is a good idea to rename packages or classes, just because they are not consistent. "
        }
    ]
}