{
    "id": "LUCENE-517",
    "title": "norm compression breaks ranking for small fields",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index",
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "1.9",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "The scheme of compressing document norms to one byte loses a lot of information.  This completely breaks search ranking on small fields because there is no way to see the difference between documents with shorter and longer fields that contain the same number of matching query terms.  Unfortunately the export of norms as a byte array seems to be pretty well embedded in the code base so a fix would seem to require a major rev.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2006-03-11T05:50:16+0000",
            "content": "Yes, the error bars seem kind of large for the normal usage of norms, which is just length normalization if you don't include boosts.  You could still use a single byte, but increase the number of bits dedicated to the mantissa to get better resolution (but with less range).\n\nhttp://lucene.apache.org/java/docs/api/org/apache/lucene/util/SmallFloat.html\n\nYou could easily make the change for your index, but if would break existing indexes if we changed the default in Lucene. ",
            "author": "Yonik Seeley",
            "id": "comment-12369928"
        },
        {
            "date": "2006-03-11T06:11:23+0000",
            "content": "Thanks Yorik, this could work for my purposes; it'd be nice to have a choice on a per-field basis don't you think? ",
            "author": "Randy Puttick",
            "id": "comment-12369936"
        },
        {
            "date": "2009-11-21T03:05:24+0000",
            "content": "LUCENE-1360 is a more complete version of this problem. Please close this in favor of 1360. ",
            "author": "Lance Norskog",
            "id": "comment-12780901"
        },
        {
            "date": "2009-11-21T09:55:02+0000",
            "content": "DUP of LUCENE-1360. ",
            "author": "Michael McCandless",
            "id": "comment-12780939"
        }
    ]
}