{
    "id": "LUCENE-6573",
    "title": "make all of lucene modules lucene-contrib.jar in 6.0",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "When we added modules, there was a big effort to make sure that there was not stupid dependencies between them. I remember spending a lot of time adding components like MockAnalyzer and switching all tests over to them so that this could be successful.\n\nDespite that work, people just CANT RESIST DOING THIS but it makes things impossible to use. So I'd rather just make a big lucene-contrib.jar, since folks are unable to be mature about it.",
    "attachments": {
        "LUCENE-6573.patch": "https://issues.apache.org/jira/secure/attachment/12741297/LUCENE-6573.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14597741",
            "author": "Adrien Grand",
            "date": "2015-06-23T14:36:18+0000",
            "content": "Having all modules separated is very valuable, I think we should keep them separated. The only notable exception is Solr since Solr integrates all functionality together on purpose. Maybe we could add a scary warning to the build.xml to discourage adding more dependencies between modules (example attached).\n\nI looked at recent changes to our build.xml files, and it seems to me like the only recent change was LUCENE-6445 which added a dependency from lucene/highlighter to lucene/analysis. David Smiley Do you think you could remove the dependency from lucene/highlighter to lucene/analysis that was added in LUCENE-6445. "
        },
        {
            "id": "comment-14598776",
            "author": "David Smiley",
            "date": "2015-06-24T02:54:12+0000",
            "content": "I like modules for the purpose of decomposing the large codebase.\n\nRE highlighter – see LUCENE-6572 "
        }
    ]
}