{
    "id": "LUCENE-4382",
    "title": "Unicode escape no longer works for non-suffix-only wildcard terms",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/queryparser"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "4.0-BETA",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "LUCENE-588 added support for escaping of wildcard characters, but when the de-escaping logic was pushed down from the query parser (QueryParserBase) into WildcardQuery, support for Unicode escaping (backslash, \"u\", and the four-digit hex Unicode code) was not included.\n\nTwo solutions:\n\n1. Do the Unicode de-escaping in the query parser before calling getWildcardQuery.\n2. Support Unicode de-escaping in WildcardQuery.\n\nA suffix-only wildcard does not exhibit this problem because full de-escaping is performed in the query parser before calling getPrefixQuery.\n\nMy test case, added at the beginning of TestExtendedDismaxParser.testFocusQueryParser:\n\n\n    assertQ(\"expected doc is missing (using escaped edismax w/field)\",\n        req(\"q\", \"t_special:literal\\\\:\\\\u0063olo*n\", \n            \"defType\", \"edismax\"),\n        \"//doc[1]/str[@name='id'][.='46']\"); \n\n\n\n\nNote: That test case was only used to debug into WildcardQuery to see that the Unicode escape was not processed correctly. It fails in all cases, but that's because of how the field type is analyzed.\n\nHere is a Lucene-level test case that can also be debugged to see that WildcardQuery is not processing the Unicode escape properly. I added it at the start of TestMultiAnalyzer.testMultiAnalyzer:\n\n\n    assertEquals(\"literal\\\\:\\\\u0063olo*n\", qp.parse(\"literal\\\\:\\\\u0063olo*n\").toString());\n\n\n\nNote: This case will always run correctly since it is only checking the input pattern string for WildcardQuery and not how the de-escaping was performed within WildcardQuery.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-15T12:48:28+0000",
            "content": "Unassigned issues -> 4.1 ",
            "author": "Robert Muir",
            "id": "comment-13456389"
        },
        {
            "date": "2013-07-23T18:44:46+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717053"
        },
        {
            "date": "2014-04-16T12:54:46+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970876"
        }
    ]
}