{
    "id": "LUCENE-6018",
    "title": "move libversions check out of precommit to another target?",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "The libversions check can be especially heavy (taking minutes and downloading a lot?). Lately, i cannot get it to finish. To run precommit checks i have to hack build.xml and then revert it.\n\nCan we move this from precommit to another target? A few things:\n1. i dont think most commits contain changes to third party dependencies, so it discourages precommit, which is already hard to get people to run.\n2. most commits that DO contain changes to third party dependencies, the people committing them don't run precommit before doing so. We know this from the jenkins fails that happen.\n3. really, for a \"packaging\" change like dependencies nightly-smoke is the one to run to get best verification.\n\nWe should do the same for other problematic targets, I know i opened an issue for the jtidy one... that is still unresolved.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14179851",
            "author": "Uwe Schindler",
            "content": "+1\nI think its enough if \"ant jenkins-hourly\" indirectly or directly depends on that. ",
            "date": "2014-10-22T12:31:59+0000"
        },
        {
            "id": "comment-14179945",
            "author": "Steve Rowe",
            "content": "+1 ",
            "date": "2014-10-22T14:23:14+0000"
        },
        {
            "id": "comment-14179950",
            "author": "Robert Muir",
            "content": "\nI think its enough if \"ant jenkins-hourly\" indirectly or directly depends on that.\n\nBut i think committers should still have a simple target (even if its called via smoketester, thats fine) to do this? I know i rarely change dependencies, but when I do, i am fine with it taking extra time to be correct before committing. ",
            "date": "2014-10-22T14:25:31+0000"
        }
    ]
}