{
    "id": "LUCENE-2236",
    "title": "Similarity can only be set per index, but I may want to adjust scoring behaviour at a field level",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/query/scoring"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "3.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Similarity can only be set per index, but I may want to adjust scoring behaviour at a field level, to faciliate this could we pass make field name available to all score methods.\nCurrently it is only passed to some such as lengthNorm() but not others such as tf()",
    "attachments": {
        "LUCENE-2236.patch": "https://issues.apache.org/jira/secure/attachment/12468477/LUCENE-2236.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-01-16T08:35:49+0000",
            "content": "attached is a patch to enable per-field similarity.\n\nit includes the prerequisite patch to LUCENE-2869, which i separately plan to commit soon (then update my local).\n\nthe patch creates two new classes:\n\n\tSimilarityProvider: contains the field-independent methods like coord(). also has a get(String field) that returns a FieldSimilarity\n\tFieldSimilarity: all the field-specific stuff like tf, etc.\n\n\n\nthe old Similarity is deprecated, it is a FieldSimilarity and also a SimilarityProvider, that always returns itself.\nMaybe it could be removed since i tried to cutover all code, I didnt check.\nRemoving it would allow us to remove the redundant field arguments from the FieldSimilarity methods easily.\n\nAdditionally Scorer's \"Similarity\" is removed. This is useless and most scorers ignored it or populated it with garbage.\nScorers themselves, know if they need a sim or not (e.g. BooleanScorer uses only the top-level SimilarityProvider for coord).\n\nall lucene/contrib/solr tests pass, i also added a simple unit test. ",
            "author": "Robert Muir",
            "id": "comment-12982251"
        },
        {
            "date": "2011-01-16T08:37:19+0000",
            "content": "also, i removed Similarity.get/setDefault in this patch.\n\nInstead we have a private @lucene.internal method (in IndexSearcher, for lack of a better place). \nThis is only needed for things like Instantiated, MemoryIndex, etc.\n\nIn general things shouldn't rely upon some global static if we want to make scoring more flexible. ",
            "author": "Robert Muir",
            "id": "comment-12982254"
        },
        {
            "date": "2011-01-16T10:59:46+0000",
            "content": "Nice work robert, while I only looked briefly at this patch but I wonder why SimilarityProvider is an interface while it could be an abstract class. Adding methods later to an abstract class is much easier than to an interface though. I hope I can have a closer look at this patch soon!\n ",
            "author": "Simon Willnauer",
            "id": "comment-12982279"
        },
        {
            "date": "2011-01-16T13:31:45+0000",
            "content": "I wonder why SimilarityProvider is an interface while it could be an abstract class\n\nThis is an expert API and we already agreed we can \"use interfaces without fear\". ",
            "author": "Robert Muir",
            "id": "comment-12982299"
        },
        {
            "date": "2011-01-17T13:04:54+0000",
            "content": "I like this flexibility - allowing different scoring parameters for different fields. \n\nWondering though - would it be nicer to keep original name Similarity and just change the way it is created and used to be field specific...?\n\nFor this, should deprecate Similarity methods taking a field/name param and introduce new ones without it - hmm.. the class would then have 3 deprecated methods: \n\n\n\tscorePayload()\n\tlengthNorm() (which anyway is already deprecated)\n\tcomputeNorm()\n\n\n\nIs that too bad?\n\nFor FieldSimilarity (and for the new method in Similarity if deciding to keep that name after all) can we get rid of the first parameter fieldName from computeNorm() and scorePayload(), or are they used in a way I am missing even when one knows that the similarity is for certain (or all) field?\n\nIn the new class FS (if kept) I think the deprecated lengthNorm() can be removed?\n\nAlso, since Similarity (or FS) is becoming field aware, perhaps add a method getFieldName() - it can return null or ANY in case there is no dedicated similarity for that field... Hmm... If the logic employed is this \"For fields F1, F2 return Sim1, for F3, F4 return Sim2, for all other fields return Sim3, then it is less simple, still, the similarity provider called with a field name can pass it to the Similarity object created and that in turn would be able to return it... just thinking out loud here... should Sim be aware of for which field it was created, so that no need to pass it as parameter in its methods in case this is ever important? ",
            "author": "Doron Cohen",
            "id": "comment-12982623"
        },
        {
            "date": "2011-01-17T13:42:10+0000",
            "content": "Is that too bad?\n\nwell my concern about the deprecated methods is we get into the hairy backwards compat situation...\nwe already had issues with this with Similarity.\n\nIt might be ok to essentially fix Similarity to be the way we want for 4.0 (break it) since its an expert API anyway.\nThis patch was just a quick stab...\nI definitely agree with you about the name though, i prefer Similarity.\n\nshould Sim be aware of for which field it was created, so that no need to pass it as parameter in its methods in case this is ever important?\n\nWell honestly I think what you are saying is really needed for the future... but I would prefer to actually delay that until a future patch \n\nMaking an optimized TermScorer is becoming more and more complicated, see the one in the bulkpostings branch for example. Because of this,\nits extremely tricky to customize the scoring with good performance. I think the score caching etc in term scorer needs to be moved out of TermScorer,\ninstead the responsibility of calculating the score should reside in Similarity, including any caching it needs to do (which is really impl dependent).\nBasically Similarity needs to be responsible for score(), but let TermScorer etc deal with enumerating postings etc.\n\nFor example, we now have the stats totalTermFreq/totalCollectionFreq by field for a term, but you can't e.g. take these and make a \nLanguage-modelling based scorer, which you should be able to do right now, except for limitations in our APIs.\n\nSo in a future issue I would like to propose a patch to do just this, so that TermScorer, for example is more general. Similarity would need to be able\nto 'setup' a query (e.g. things like IDF, building score caches for the query, whatever), and then also score an individual document.\n\nIn the flexible scoring prototype this is what we did, but we went even further, where a Similarity is also responsible for 'setting up' a searcher, too.\nSo that means, its responsible for managing norm byte[] (in that patch, you only had a byte[] norms, if you made it in your Similarity yourself).\nI think long term that approach is definitely really interesting, but I think we can go ahead and make scoring a lot more flexible in tiny steps \nlike this without rewriting all of lucene in one enormous patch... and this is safer as we can benchmark performance each step of the way. ",
            "author": "Robert Muir",
            "id": "comment-12982635"
        },
        {
            "date": "2011-01-17T21:17:32+0000",
            "content": "\nwell my concern about the deprecated methods is we get into the hairy backwards compat situation...\nIt might be ok to essentially fix Similarity to be the way we want for 4.0 (break it) since its an expert API anyway.\nThis patch was just a quick stab...\nI definitely agree with you about the name though, i prefer Similarity.\n\nSo let's keep that name (Similarity) \n\n\nWell honestly I think what you are saying is really needed for the future\n\nOk one step at a time makes sense.. so it means that fieldName parameters remain, although the Similarity object is created per given field, well, ok, another day...\n\n\nSimilarity would need to be able to 'setup' a query (e.g. things like IDF, building score caches for the query, whatever), and then also score an individual document.\n\nInteresting... \n(flexible-scoring and bulk-postings works are still unknowns to me.) \nSo Similarity is not only per field but also per query/scorer..  \nand Query would have an abstract method getSimilarityProvider(fieldName) which would be implemented by each concrete query, neatly separating finding matches from scores computation, and allowing more extendable scoring. Nice.\nAlso, perhaps what seems to be like an inflation of Similarity objects (per query per field) is one more good reason to keep the field name params for now. ",
            "author": "Doron Cohen",
            "id": "comment-12982872"
        },
        {
            "date": "2011-01-17T21:47:25+0000",
            "content": "So let's keep that name (Similarity) \n\nOK, I'll fix the patch, to rename FieldSimilarity->Similarity\n\n\nSo Similarity is not only per field but also per query/scorer.. \nand Query would have an abstract method getSimilarityProvider(fieldName) which would be implemented by each concrete query, neatly separating finding matches from scores computation, and allowing more extendable scoring. Nice.\nAlso, perhaps what seems to be like an inflation of Similarity objects (per query per field) is one more good reason to keep the field name params for now.\n\nWell I'm not totally sure how we want to do it, but definitely I think we want to split Scorer's calculations and finding matches as you say,\nand also split Weight's calculations and \"resource management\"\n\nFor example, TermWeight today has a PerReaderTermState, which contains all the information you need to calculate the \"setup\" portion\nwithout doing any real I/O (e.g. docFreq, totalTermFreq, totalCollectionFreq, ...) So maybe this is the right thing to pass to Similarity's \"query setup\".\n\nThe Weight then would just be responsible for managing termstate and creating a Scorer...\n\nI think also the Similarity needs to be fully responsible for Explanations... but most users wouldn't have to interact with this I think.\nInstead I think typically their \"base class\" (TFIDFSimilarity or whatever it is) would typically provide this, based on the methods and API\nit exposes: tf(), idf(), but this would allow us to also have other fully-fleshed out base classes like BM25Similarity, that you can extend\nand tune based on the parameters that make sense to it.\n\nAnyway these are just some thoughts, first I'm going to adjust the patch to keep our existing name \"Similarity\". ",
            "author": "Robert Muir",
            "id": "comment-12982888"
        },
        {
            "date": "2011-01-21T20:01:11+0000",
            "content": "Here's an updated patch, now that some cleanup work has been committed separately, its easier to manage.\n\nI kept the original name Similarity: I definitely like this better, and tried to clean up the patch to make it committable.\n\nIf this patch is ok, I would prefer to make a follow-up issue to make it easier to use per-field Similarity with a Solr schema file.\nCurrently Solr lets you specify the index-wide Similarity; with this patch, this can be customized per-field, but you have to\nmanage this in your java implementation.\n\nIn my opinion, it would be better to have more declarative schema integration, especially if we get scoring going with more flexibility. ",
            "author": "Robert Muir",
            "id": "comment-12984903"
        },
        {
            "date": "2011-01-23T15:57:44+0000",
            "content": "Robert, thanks for renaming back to Similarity.\nI reviewed the patch - it looks good to me, just technical simple comments here (it may seem a long list but these are really just simple changes)\n\n\tSimilarity:\n\t\n\t\tline 365: should be\n\t\t\n\t\t\t{@link SimilarityProvider#coord(int, int) coord(q,d)}\n\t\t\n\t\t\n\t\tline 565: should be:\n\t\t\n\t\t\t@see org.apache.lucene.index.IndexWriterConfig#setSimilarityProvider(SimilarityProvider)\n\t\t\t@see IndexSearcher#setSimilarityProvider(SimilarityProvider)\n\t\t\n\t\t\n\t\n\t\n\tInstantiatedIndexWriter & MemoryIndex & DocumentWriter & DocState & BooleanQuery\n\t\n\t\tmethods and member should be named similar to IndexSearcher:\n\t\t\n\t\t\tsimilarityProvider\n\t\t\tgetSimilarityProvider()\n\t\t\tsetSimilarityProvider(SimilarityProvider similarityProvider)\n\t\t\n\t\t\n\t\n\t\n\tMIGRATE.txt - I think it should read like this:\n\t\n\t\tDefaultSimilarity can no longer be set statically (and dangerously) for the entire JVM.\n  Instead, IndexWriterConfig and IndexSearcher now take a SimilarityProvider. \n  Similarity can now be configured on a per-field basis. \n  Similarity retains only the field-specific relevance methods such as tf() and idf(). \n  Methods that apply to the entire query such as coord() and queryNorm() exist in SimilarityProvider.\n\t\n\t\n\tIndexWriterConfig javadocs lines 240-241 should discuss SimilarityProvider (not Similarity)\n\tWould it be cleaner to have a new class DefaultSimilarityProvider which would return DefaultSimilarity? not sure, but thought it's worth mentioning.\n\tIndexSearcher\n\t\n\t\tjavadoc in line 78:\n   \"In general, this should not be used.\"\n   Is that so? I would like to believe that in general the default is pretty good.\n\t\n\t\n\tTestIndexReaderCloneNorms the \"TODO\" added there can be fixed (not too efficiently, but okay for the test I think) like this:\n\nprivate Document newDoc() {\n  Document d = new Document();\n  for (int i = 0; i < 10; i++) {\n    String fname = \"f\" + i;\n    Field f = newField(fname, \"v\" + i, Store.NO, Index.NOT_ANALYZED);\n    float boost = nextNorm(fname);\n    f.setBoost(boost);\n    d.add(f);\n  }\n  return d;\n}\n\n// return unique norm values that are unchanged by encoding/decoding\nprivate float nextNorm(String fname) {\n  float norm = lastNorm + normDelta;\n  do {\n    Similarity sim = new DefaultSimilarity().get(fname);\n\n\n\tTestNorms - can fix the \"bogus\" TODO similar to the above code snippet.\n\n ",
            "author": "Doron Cohen",
            "id": "comment-12985349"
        },
        {
            "date": "2011-01-23T16:45:06+0000",
            "content": "attached updated patch according to last comments. ",
            "author": "Doron Cohen",
            "id": "comment-12985361"
        },
        {
            "date": "2011-01-23T17:04:28+0000",
            "content": "note: with last patch both tests fail - TestNorms and TestIndexReaderCloneNorms. ",
            "author": "Doron Cohen",
            "id": "comment-12985364"
        },
        {
            "date": "2011-01-23T17:31:22+0000",
            "content": "Attaching fixed patch - these two tests fixed to pass again (I shouldn't have taken nextNorm() out of the loop...) - all Lucene (core) tests pass, Solr ones failed to compile as (from command line) JAVA_HOME pointed to Java 5, - will complete the run later. ",
            "author": "Doron Cohen",
            "id": "comment-12985368"
        },
        {
            "date": "2011-01-23T20:02:55+0000",
            "content": "OK with java 6 all tests passed. ",
            "author": "Doron Cohen",
            "id": "comment-12985401"
        },
        {
            "date": "2011-01-23T20:34:37+0000",
            "content": "Hi Doron, thanks for the cleanups here!\n\nWould it be cleaner to have a new class DefaultSimilarityProvider which would return DefaultSimilarity? not sure, but thought it's worth mentioning.\n\nI went back and forth on this one... it could go either way? But since the default does the same thing for every field, I thought\nit made sense... what do you think? We could always revisit it too later, if we later prefer these to be separate.\n\n\njavadoc in line 78:\n\"In general, this should not be used.\"\nIs that so? I would like to believe that in general the default is pretty good.\n\nIn this case, I should have been more verbose... what I meant here is that 'in general, code should not call this static method, instead it should \nrespect the SimilarityProvider set on IndexSearcher [getSimilarityProvider()]...'. This is just the default exposed for internal purposes: just to\nhave a single immutable default instance for MemoryIndex, InstantiatedIndex, IndexWriterConfig, IndexSearcher... but if someone writes\na custom Query for example, they should be using IndexSearcher.getSimilarityProvider(), and not this static.\n\nI can update the javadocs to be a little bit more verbose for this method, as I would like to discourage its use... its essentially just like\nusing Similarity.getDefault() before, which I tried to cleanup across lucene. ",
            "author": "Robert Muir",
            "id": "comment-12985403"
        },
        {
            "date": "2011-01-23T21:09:20+0000",
            "content": "Hi Robert,\n\n\nI can update the javadocs to be a little bit more verbose for this method, as I would like to discourage its use... its essentially just like\nusing Similarity.getDefault() before, which I tried to cleanup across lucene\n\nYes I was confused by this, it is really an accessor method for the constant, and indeed with this change it is no more possible for users to modify the default behavior regarding similarity JVM wide - as they can still do for e.g. BQ.setMaxClauseCount(). \n\nI read it wrongly, as if it said \"in general, this setting should not remain... \" maybe it is just me. \nI agree something as you propose like this would be probably clear on first reading: \n\n  /**\n  * Expert: returns a default SimilarityProvider instance.\n  * In general, this method is only called to initialize searchers and writers.\n  * User code and query implementations should respect e.g.\n  * {@link ..... IndexSearcher#getSimilarityProvider()}.\n  * @lucene.internal\n  */\n\n\nor something similar (I am sure you'll write it better...) ",
            "author": "Doron Cohen",
            "id": "comment-12985415"
        },
        {
            "date": "2011-01-24T03:06:45+0000",
            "content": "Updated patch, with Doron's suggested wording for IndexSearcher.getDefaultSimilarityProvider\n\nI also corrected a javadocs warning in Weight (bad reference to queryNorm).\n\nI think we are ready to commit unless there are any objections. ",
            "author": "Robert Muir",
            "id": "comment-12985498"
        },
        {
            "date": "2011-01-24T19:18:48+0000",
            "content": "Committed revision 1062927.\n\nThanks Doron! ",
            "author": "Robert Muir",
            "id": "comment-12985914"
        }
    ]
}