{
    "id": "LUCENE-3916",
    "title": "Consider different query and index segmentation for Japanese",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Kuromoji today uses search mode segmentation both at query and index time.\n\nThe benefit with search mode segmentation is that it segments compounds such as 関西国際空港 (Kansai International Airport) into 関西 (Kansai), 国際 (international), 空港 (airport), and leaves the compound 関西国際空港 as a synonym to 関西.\n\nThis segmentation allows us to get a match for 空港 (airport), which is good for recall and we'd get good precision when searching for the compound 関西国際空港 because of IDF.\n\nHowever, if we search for the compound 関西国際空港 (Kansai International Airport) our query becomes (by default) an OR-query with terms 関西 (Kansai), 関西国際空港 (Kansai International Airport), 国際 (international) and 空港 (airport).\n\nThis behaviour is by-design when using OR as the default operator, but this also has the effect of returning generic hits like 空港 (airport) when the user searches for something very specific like 関西国際空港 (Kansai International Airport) – and these hits are also highlighted.\n\nThis doesn't necessarily mean that ranking is flawed per se, but a user or application might prefer precision over recall.  In order to favour precision, we can consider using normal mode segmentation for queries, but retain search mode segmentation on the indexing side.\n\nDoes anyone have any general opinion on this?  What would we do for other language in the case of compound splitting?\n\nPerhaps this can be dealt with as a documentation issue with a comment in schema.xml while keeping the current behaviour?\n\nMany thanks for any input.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-03-25T14:27:01+0000",
            "content": "For the case of compound splitting, split-and-keep is better then just splitting \n(what kuromoji did until recently), and I think the issues you see are mainly highlighting issues.\n\nAnd yes, its true that using search mode at index time is really no different than\nadding synonyms for the compounds, but I don't think we should change the default\nconfiguration for japanese to one that uses different index and search analysis:\nthats not ideal for an example.\n\nUsing different index and search analysis is really expert: I know the solr example\ndoes this with its english field type, and 90% of the time I think users will just\nscrew things up worse, I see this in crazy examples on the user lists all the time.\n\nA commented out note about how this acts just like synonyms and can be done purely\nonly at index-time might be good though.\n\nIn the future, now that we can split-and-keep, we could also consider at adding support\nfor LUCENE-2892 (SOLR-2477), where if a user asks for a phrase explicitly, we don't decompound.\n\nBut still the tradeoff for this stuff is that if we make sophisticated examples\nwith different chains, chances are that any time a user modifies these chains\nthey are just gonna screw up their analysis badly.  ",
            "author": "Robert Muir",
            "id": "comment-13237878"
        },
        {
            "date": "2012-03-28T18:32:03+0000",
            "content": "Thanks a lot, Robert.\n\nI've added a comment about about this in schema.xml as part of SOLR-3276.  I'm resolving this issue.\n ",
            "author": "Christian Moen",
            "id": "comment-13240610"
        }
    ]
}