{
    "id": "LUCENE-7362",
    "title": "Implement FieldInfos and FieldInfo toString()",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "core/index"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "FieldInfos and FieldInfo ought to override toString().  Perhaps FieldInfo.toString() can look like the pattern popularized by Luke, also seen in Solr?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15355210",
            "author": "Robert Muir",
            "date": "2016-06-29T13:10:35+0000",
            "content": "I do not think they should. These are low level structures: i think the current toString is just fine, e.g. to know you have the right one in indexwriter and so on.\n\nI think this is also relevant to LUCENE-7361. MemoryIndex is a toy 1 document thing, we should not add dangerous things to low level lucene structures (like loops over fields) that will blow up. \n\nI also do not care at all for the magical coded flags that solr uses here. The current toString is more useful to me than that, so it would just lose usefulness. If we want FieldInfo not plural to have a different toString it should simply print out all of the flags by name and value with no screwing around. "
        },
        {
            "id": "comment-15356298",
            "author": "David Smiley",
            "date": "2016-06-30T01:31:00+0000",
            "content": "RE FieldInfos: okay\n\nRE FieldInfo:\n\nThe current toString is more useful to me than that, so it would just lose usefulness.\n\nThat needn't go away if it's improved – it can be the prefix.  \n\nIf we want FieldInfo not plural to have a different toString it should simply print out all of the flags by name and value with no screwing around.\n\nSounds good to me. "
        }
    ]
}