{
    "id": "LUCENE-3307",
    "title": "don't require an analyzer, if all fields are NOT_ANALYZED",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.4",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This seems wierd, if you analyze only NOT_ANALYZED fields, you must have an analyzer (null will not work)\nbecause documentsinverter wants it for things like offsetGap",
    "attachments": {
        "LUCENE-3307.patch": "https://issues.apache.org/jira/secure/attachment/12486213/LUCENE-3307.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-07-12T19:17:52+0000",
            "content": "+1 ",
            "author": "Uwe Schindler",
            "id": "comment-13064079"
        },
        {
            "date": "2011-07-13T03:22:30+0000",
            "content": "+1 !\n\nThis is also weird if you index only NumericFields. You need to pass whatever random analyzer that crosses your mind at the moment, just so that it's used to get the offset gap and posIncr.\n\nRobert, perhaps we should add an explicit test, in core, which ensures we can pass a null Analyzer to IWC when we index only NOT_ANALYZED and NumericFields? ",
            "author": "Shai Erera",
            "id": "comment-13064318"
        },
        {
            "date": "2011-07-13T10:11:06+0000",
            "content": "\nRobert, perhaps we should add an explicit test, in core, which ensures we can pass a null Analyzer to IWC when we index only NOT_ANALYZED and NumericFields?\n\nI don't like the idea of any kind of test or documentation that says we explicitly support null.\nThen, suddenly null is an officially supported value for Analyzer and people start wanting it in other places.\n\nIf we must have a test here to proceed, I would instead prefer to cancel as Won't fix. ",
            "author": "Robert Muir",
            "id": "comment-13064467"
        },
        {
            "date": "2011-07-13T10:17:59+0000",
            "content": "Also, remember we are wanting to fully decouple indexing from analysis (LUCENE-2309) at which point IndexWriter(Config) will no longer even see an Analyzer; the use of an Analyzer (or any other app-specific pipeline/capability/etc.) will be hidden to IW under the IndexableField API.  At that point this \"problem\" of having to pass some random Analyzer or null should go away, because you should then only be required to pass an Analyzer to FieldTypes that do analyze their field text. ",
            "author": "Michael McCandless",
            "id": "comment-13064470"
        },
        {
            "date": "2011-07-13T10:35:50+0000",
            "content": "\nAt that point this \"problem\" of having to pass some random Analyzer or null should go away, because you should then only be required to pass an Analyzer to FieldTypes that do analyze their field text.\n\nRight, and the last thing i want to see is some sophisticated backwards layer / crappy hacks because we enabled null on this issue!\n\nBasically, I think we should make it work right now, but undocumented and unspecified. If you pass Analyzer=null to IW you need to be prepared for NPE. ",
            "author": "Robert Muir",
            "id": "comment-13064473"
        },
        {
            "date": "2011-07-13T10:48:55+0000",
            "content": "Ok I agree. +1 to commit. ",
            "author": "Shai Erera",
            "id": "comment-13064476"
        },
        {
            "date": "2011-07-14T18:46:26+0000",
            "content": "Shai you want to take this? I am working on something else at the moment! ",
            "author": "Robert Muir",
            "id": "comment-13065452"
        },
        {
            "date": "2011-07-14T18:48:07+0000",
            "content": "Yes, I'll commit this. Thanks ! ",
            "author": "Shai Erera",
            "id": "comment-13065454"
        },
        {
            "date": "2011-07-17T05:39:01+0000",
            "content": "Committed revision 1147530 (trunk).\nCommitted revision 1147532 (3x).\n\nI did not include a CHANGES entry, because we don't want to advertise null as a supported value for IW.\n\nThanks Robert ! ",
            "author": "Shai Erera",
            "id": "comment-13066589"
        }
    ]
}