{
    "id": "LUCENE-1439",
    "title": "Inconsistent API",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "3.0",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The API of Lucene is totally inconsistent:\n\n1)\nThere are a lot of containers which don't implement an interface which indicates this fact\n(for pre-java-1.5 Lucene it could be Collection, for post-ajva-1.5 Lucene it could be more general Iterable)\n\nExample:\n IndexSearcher: \"int maxDoc()\" and \"doc(int i)\"\n\n2)\nThere are a lot of classes having non-final public accessible fields.\n\n3)\nSome methods which return values are named something() others are named getSomething()\n\nBest one is: Fieldable:\nwithout get: String stringValue(), Reader readerValue(), byte[] binaryValue(), ...\nwith get: byte[] getBinaryValue(), int getBinaryLength(), ...",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2008-11-07T14:51:31+0000",
            "content": "Patch coming?\n\nI'd classify as improvement rather than bug to start. Also, keep in mind that everything will have to be backward compatible (though that gets fuzzier as we approach version 3) ",
            "author": "Mark Miller",
            "id": "comment-12645778"
        },
        {
            "date": "2008-11-07T14:59:46+0000",
            "content": "I agree that there are several APIs that could be improved in Lucene. However, opening an issue like this is not very helpful.\n\nPlease open a more specific issue for a particular API you'd like to fix, attach a patch that deprecates the old one, introduces a new one, maintains backwards-compatibility and provides unit tests. (see LUCENE-1422 as a current example).\n\nIf you don't want to provide such a patch then you can also start a discussion on the mailinglists and suggest API improvements. ",
            "author": "Michael Busch",
            "id": "comment-12645781"
        },
        {
            "date": "2008-11-07T15:16:48+0000",
            "content": "In my opinion, these are things that are really not nice currently. The next major version of Lucene should really fix these annoying inconsistencies (especially for beginners).\n\nI would be happy to help cleaning the API through 2.9 / 3.0 after some discussion about this! ",
            "author": "Uwe Schindler",
            "id": "comment-12645787"
        },
        {
            "date": "2008-11-07T17:16:13+0000",
            "content": "I was thinking about this issue as a \"request\". Sadly, I currently don't have time to crawl through an unknown API and search for all inconsistencies.\nThe comments imply, that other people know what I'm talking about. So perhaps, instead of closing the issue as 'incomplete', someone (who already KNOWS this API) could list most frequent 'inconsistent' classes?\nThe fact that I'm new to Lucene makes it very probable that my proposed patches will be rejected anyway (because they would just \"not fit\" somehow).\nSecond thing is: I read few comments about java-1.5-only vs not-java-1.5-only policy for future Lucene. It seems that even the developers can't agree on this issue. How could I? ",
            "author": "Ivan.S",
            "id": "comment-12645826"
        },
        {
            "date": "2008-11-07T17:27:26+0000",
            "content": "Ivan,\n\nI'm sorry to hear that you don't have time to devote to this issue.  Patches regularly go through a vetting process, so don't assume that yours would be rejected, as long as you are willing to accept guidance concerning the \"not fitting\".  In fact, you are in a perfect position to help, since your fresh take on the issues reflect a very common user experience.  Please don't give up.  \n\nMy suggestion, like Michael's: open a new issue with a focused suggestion, and provide a patch. ",
            "author": "Steve Rowe",
            "id": "comment-12645829"
        },
        {
            "date": "2008-11-14T08:59:45+0000",
            "content": "Can anyone open an umbrella bug for this?\nI think we should first collect all inconsistencies, then someone (including me) start to make patches.\n\nBTW one more thing I've noticed: some methods even start with uppercase.\nCommon, there are books written about Lucene, such things are just painful \nIt needs a clear API.\n\nI'm now using Lucene in a project, it helps, I like it. So I would like to contribute (my time and) patches after\nwe've sorted out, what the inconsistencies are, sort them by priority, and collect their locations.\n\nUmbrella bug or not? ",
            "author": "Ivan.S",
            "id": "comment-12647548"
        },
        {
            "date": "2008-11-14T17:30:21+0000",
            "content": "Wiki may be more suitable for that.\nNote that it may be better to work on getting more of the pending patches reviewed and tested, so they can be committed faster.  That way we can then proceed to making API changes that won't break existing/pending patches. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12647672"
        },
        {
            "date": "2008-11-16T18:35:39+0000",
            "content": "I created a Wiki page for this issue\nhttp://wiki.apache.org/jakarta-lucene/MakingApiConsistent\n\nI hope that many people will find this issue important and help with this. ",
            "author": "Ivan.S",
            "id": "comment-12648008"
        },
        {
            "date": "2008-11-19T22:33:33+0000",
            "content": "No one seems to care about this issue since it is closed, so I dare to reopen it (after I created a Wiki page as proposed by others).\nPlease, everyone who knows inconsistencies in Lucene API (there seems to be plenty of)\nplease report to Wiki page: http://wiki.apache.org/jakarta-lucene/MakingApiConsistent\nThank you. ",
            "author": "Ivan.S",
            "id": "comment-12649187"
        }
    ]
}