{
    "id": "LUCENE-938",
    "title": "I/O exceptions can cause loss of buffered deletes",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.3"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Some I/O exceptions that result in segmentInfos rollback operations can cause buffered deletes that existed before the rollback creation point to be incorrectly lost when the IOException triggers a rollback.",
    "attachments": {
        "LUCENE-938.txt": "https://issues.apache.org/jira/secure/attachment/12360326/LUCENE-938.txt",
        "LUCENE-938.take2.patch": "https://issues.apache.org/jira/secure/attachment/12361151/LUCENE-938.take2.patch",
        "LUCENE-938.patch.txt": "https://issues.apache.org/jira/secure/attachment/12361722/LUCENE-938.patch.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-06-21T21:51:02+0000",
            "content": "Patch that fixes the two relevant rollback mechanisms in IndexWriter: the rollback support in mergeSegments around maybeApplyDeletes and the rollback support in  the *Transaction methods. For the later, I had to promote the transaction routines from private to package protected so that I could write the tests, which are also in the patch. ",
            "author": "Steven Parkes",
            "id": "comment-12507043"
        },
        {
            "date": "2007-06-21T22:11:46+0000",
            "content": "Wow, good catch and nice unit test! ",
            "author": "Michael McCandless",
            "id": "comment-12507050"
        },
        {
            "date": "2007-06-21T22:16:03+0000",
            "content": "Only it's broke. Mixing a couple of things, I missed a couple of tests that I broke. That's what I get for coding with a cold. Another fix soon.\n\nAnd I was going to mention that I added support in the mock directory stuff for injecting deterministic I/O errors. Should help us capture tricky corner cases where we need to. ",
            "author": "Steven Parkes",
            "id": "comment-12507052"
        },
        {
            "date": "2007-06-21T22:51:31+0000",
            "content": "This version has the missing fixes that got tossed when I tried to clean up that patch. ",
            "author": "Steven Parkes",
            "id": "comment-12507063"
        },
        {
            "date": "2007-07-04T19:19:59+0000",
            "content": "Steve, I re-worked this patch now that LUCENE-843 is committed (it\nconflicted) and am attaching it (LUCENE-938.take2.patch).  It's the\nsame logic as before.  If it looks good to you I can commit it! ",
            "author": "Michael McCandless",
            "id": "comment-12510234"
        },
        {
            "date": "2007-07-04T19:26:57+0000",
            "content": "Thanks. I figured there'd be conflicts.\n\nI won't be able to look at this until next week ... ",
            "author": "Steven Parkes",
            "id": "comment-12510235"
        },
        {
            "date": "2007-07-05T17:47:23+0000",
            "content": "Good catch, Steven!\n\nOne thing though: I thought we had assumed that there wouldn't be any buffered docs or delete terms when startTransaction(), so no local copies are necessary. That means no change to startTransaction() and rollbackTransaction(). If there could be buffered docs and delete terms when startTransaction(), then local copies should be made for buffered docs and localNumBufferedDeleteTerms should clone numBufferedDeleteTerms instead of just copying the reference. ",
            "author": "Ning Li",
            "id": "comment-12510422"
        },
        {
            "date": "2007-07-12T20:33:55+0000",
            "content": "Easy first: there's a comment in the code about cloning the buf delete term hash with a clear vs. copying the reference and creating a new hash. I've gone back and forth. I don't have a strong opinion.\n\nI did notice that every call to startTransaction had flushed the deletes ahead but I didn't see that it was required to be so. I can go either way on this, too. I'd vote for making startTransaction safer.  I think, in theory, it could be opened to users at some point, if it were to help people trying to use Lucene in certain transactional contexts.\n\nOf course, that violates YAGNI.\n\nBut I hadn't looked at the ram segments. Does look like if there are any at the start of a trans. and they get flushed, they would/might get lost? Since that touches on the index file deleter, it strikes me as more complex. ",
            "author": "Steven Parkes",
            "id": "comment-12512249"
        },
        {
            "date": "2007-07-12T21:45:37+0000",
            "content": "I didn't make myself clear. Let me try again. The patch includes two parts of changes to IndexWriter: one adds localNumBufferedDeleteTerms and localBufferedDeleteTerms and uses them in startTransaction() and rollbackTransaction(); the other fixes loss of buffered deletes in flush() (and applyDeletes() which is used by flush()).\n\nThe second part is good and that's where you had the comment on cloning.\n\nI was referring to the first part. In startTransaction(), \"localBufferedDeleteTerms = bufferedDeleteTerms\" reference-copies bufferedDeleteTerms. Then more delete terms are buffered into bufferedDeleteTerms... so localBufferedDeleteTerms would have the delete terms buffered between startTransaction() and the first flush()...  ",
            "author": "Ning Li",
            "id": "comment-12512271"
        },
        {
            "date": "2007-07-12T21:59:20+0000",
            "content": "Okay. Got it.\n\nBut your earlier note got me thinking. Mike, as far as I can tell, the 843 buffered docs stuff isn't getting restored around a transaction? Or am I missing something? Are you assuming flush is called before startTransaction? ",
            "author": "Steven Parkes",
            "id": "comment-12512274"
        },
        {
            "date": "2007-07-12T22:21:50+0000",
            "content": "Ahh, right, we are not protecting buffered doc state inside the local\ntransaction.  And actually doing so would not be very easy.\n\nI would say we require that there are no buffered docs nor deletes\nwhen startTransaction() is called.  The code guarantees that now but\nhow about we doc this limitation and put an assert in there to make\nsure?\n\nThese methods were added only for protecting the index during the\naddIndexes* calls; if in the future we somehow want to make them more\npowerful I think we can fix it then... ",
            "author": "Michael McCandless",
            "id": "comment-12512287"
        },
        {
            "date": "2007-07-12T22:25:29+0000",
            "content": "Works for me. I'll submit a new patch. ",
            "author": "Steven Parkes",
            "id": "comment-12512289"
        },
        {
            "date": "2007-07-12T22:55:14+0000",
            "content": "New patch. Removes support for buf deletes around transactions but documents and asserts this.\n\nFixes a few typos in the comments. ",
            "author": "Steven Parkes",
            "id": "comment-12512298"
        },
        {
            "date": "2007-07-13T14:20:32+0000",
            "content": "This patch looks great!  Thanks Steve.  I'll commit it shortly. ",
            "author": "Michael McCandless",
            "id": "comment-12512494"
        }
    ]
}