{
    "id": "LUCENE-1034",
    "title": "Add new API method to retrieve document field data in a batch",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "2.2",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "I've read in many forums about people who need to retrieve document data for a large number of search results. In our case, we need to retrieve up to 10,000 results (sometimes more) from an index of over 100 million documents (our index is about 65 GB).   This can sometimes take a couple minutes. \n\nIn one of my attempts to improve performance, I modified the IndexReader interface to provide a method which looks like:\n\npublic Document[] documents(int[] n, FieldSelector fieldSelector);\n\nInstead of retrieving document data one at a time, I would request data for many document numbers in one shot.   The idea was to optimize the seeks on disk so that in the FieldsReader, the seeks for the indexStream would be done first, then all the seeks in the fieldStream would be completed.   For a large number of documents, this yielded a 20% speed improvement.  The improvement was not as much as I was looking for, but I felt that the improvement was significant enough that I would request changes to the IndexReader interface.\n\nI'm providing patches for the files that I needed to change for our application.    These patches are against the 2.2 release.",
    "attachments": {
        "LUCENE-1034.patch": "https://issues.apache.org/jira/secure/attachment/12394028/LUCENE-1034.patch",
        "FieldsReader.java.patch": "https://issues.apache.org/jira/secure/attachment/12368422/FieldsReader.java.patch",
        "SegmentReader.java.patch": "https://issues.apache.org/jira/secure/attachment/12368424/SegmentReader.java.patch",
        "IndexReader.java.patch": "https://issues.apache.org/jira/secure/attachment/12368421/IndexReader.java.patch",
        "MultiReader.java.patch": "https://issues.apache.org/jira/secure/attachment/12368423/MultiReader.java.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-10-26T10:44:22+0000",
            "content": "Sounds like a reasonable idea.  In order to get this reviewed, please provide a single patch against trunk. ",
            "author": "Grant Ingersoll",
            "id": "comment-12537917"
        },
        {
            "date": "2008-11-17T00:15:22+0000",
            "content": "I've patched it altogether into one file. I like the idea, but right now, I don't like the amount of code duplication. Arguably, this could also be moved to the Searcher family, but could prob live without that. Also still needs a test, but I've lost interest unless the code dupe can be resolved while maintaining the speed gain. ",
            "author": "Mark Miller",
            "id": "comment-12648052"
        },
        {
            "date": "2013-03-10T13:24:41+0000",
            "content": "SPRING_CLEANING_2013 We can reopen if necessary. ",
            "author": "Erick Erickson",
            "id": "comment-13598240"
        }
    ]
}