{
    "id": "LUCENE-1261",
    "title": "Impossible to use custom norm encoding/decoding",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/query/scoring"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.3.1",
        "resolution": "Duplicate",
        "status": "Closed"
    },
    "description": "Although it is possible to override methods encodeNorm and decodeNorm in a custom Similarity class, these methods are not actually used by the query processing and scoring functions, not by the indexing functions. The relevant Lucene classes all call \"Similarity.decodeNorm\" rather than \"similarity.decodeNorm\", i.e. the norm encoding/decoding is fixed to use that of the base Similarity class. Also index writing classes such as DocumentWriter use \"Similarity.decodeNorm\" rather than \"similarity.decodeNorm\", so we are stuck with the 3 bit mantissa encoding implemented by SmallFloat.floatToByte315 and SmallFloat.byte315ToFloat.\n\nThis is very restrictive and annoying, since in practice many users would prefer an encoding that allows finer distinctions for boost and normalisation factors close to 1.0. For example. SmallFloat.floatToByte52 uses 5 bits of mantissa, and this would be of great help in distinguishing much better between subtly different lengthNorms and FieldBoost/DocumentBoost values.\n\nIt hsould be easy to fix this by changing all instances of \"Similarity.decodeNorm\" and \"Similarity.encodeNorm\" to \"similarity.decodeNorm\" and \"similarity.encodeNorm\" in the Lucene code (there are only a few of each).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2008-04-08T16:53:46+0000",
            "content": "Hi John,\n\nsee LUCENE-1260\n\n    karl ",
            "author": "Karl Wettin",
            "id": "comment-12586880"
        },
        {
            "date": "2008-05-17T02:30:27+0000",
            "content": "John, do you want to keep this open, or can I close this now that Karl is making progress on LUCENE-1260? ",
            "author": "Otis Gospodnetic",
            "id": "comment-12597689"
        },
        {
            "date": "2008-05-19T13:05:07+0000",
            "content": "This issue is a near duplicate of LUCENE-1260 (see https://issues.apache.org/jira/browse/LUCENE-1260) ",
            "author": "John Adams",
            "id": "comment-12597940"
        }
    ]
}