{
    "id": "LUCENE-3105",
    "title": "String.intern() calls slow down IndexWriter.close() and IndexReader.open() for index with large number of unique field names",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "3.1",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "We have one index with several hundred thousand unqiue field names (we're optimistic that Lucene 4.0 is flexible enough to allow us to change our index design...) and found that opening an index writer and closing an index reader results in horribly slow performance on that one index. I have isolated the problem down to the calls to String.intern() that are used to allow for quick string comparisons of field names throughout Lucene. These String.intern() calls are unnecessary and can be replaced with a hashmap lookup. In fact, StringHelper.java has its own hashmap implementation that it uses in conjunction with String.intern(). Rather than using a one-off hashmap, I've elected to use a ConcurrentHashMap in this patch.",
    "attachments": {
        "LUCENE-3105.patch": "https://issues.apache.org/jira/secure/attachment/12479394/LUCENE-3105.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-16T22:18:52+0000",
            "content": "Patch file to eliminate String.intern() calls while opening indexReaders and closing indexWriters. ",
            "author": "Mark Kristensson",
            "id": "comment-13034380"
        },
        {
            "date": "2011-05-17T09:24:27+0000",
            "content": "StringInterner is in fact faster than CHM. And is compatible with String.intern(), ie - it returns the same String instances. It also won't eat up memory if spammed with numerous unique strings (which is a strange feature, but people requested that).\nIn Lucene 4.0 all of this is moot anyway, fields there are strongly separated and intern() is not used. ",
            "author": "Earwin Burrfoot",
            "id": "comment-13034639"
        },
        {
            "date": "2011-05-17T09:26:56+0000",
            "content": "Hmm.. Ok, it is still used, but that's gonna be fixed, mm? ",
            "author": "Earwin Burrfoot",
            "id": "comment-13034640"
        },
        {
            "date": "2011-05-17T11:23:59+0000",
            "content": "Yes it's gonna fixed, see linked issue LUCENE-2548. The biggest problem is Solr at the moment. The other things are minor identity vs. equals in FieldCache. ",
            "author": "Uwe Schindler",
            "id": "comment-13034723"
        },
        {
            "date": "2011-07-15T03:16:39+0000",
            "content": "fixed as of lucene-2548 ",
            "author": "Robert Muir",
            "id": "comment-13065691"
        }
    ]
}