{
    "id": "LUCENE-7498",
    "title": "More Like This to Use BM25",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "modules/other"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "BM25 is now the default similarity, but the more like this is still using the old TF/IDF .\n\nThis issue is to move to BM25 and refactor the MLT to be more organised, extensible and maintainable.\n\nFew extensions will follow later, but the focus of this issue will be :\n\n\tBM25\n\tcode refactor + tests",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15595420",
            "author": "Michael McCandless",
            "date": "2016-10-21T15:27:16+0000",
            "content": "+1 "
        },
        {
            "id": "comment-15632601",
            "author": "Alessandro Benedetti",
            "date": "2016-11-03T12:34:30+0000",
            "content": "Started the implementation and tests.\nThe refactor will break down the big MoreLikeThis monolithic class in more cohesive classes with separate tests.\nI will keep this ticket up to date. "
        },
        {
            "id": "comment-15967404",
            "author": "Alessandro Benedetti",
            "date": "2017-04-13T10:52:39+0000",
            "content": "Design and development is finished, I will merge current trunk and open a pull request from my fork to review here.\nIt is a huge PR as it contains a big refactor and testing of the More Like This ( from a monolith to structured cohesive classes).\nI will update the Jira issue with the PR and brief description of modification and benefits. "
        },
        {
            "id": "comment-15972833",
            "author": "ASF GitHub Bot",
            "date": "2017-04-18T14:49:04+0000",
            "content": "GitHub user alessandrobenedetti opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/191\n\n    Lucene-7498\n\n    This Pull Request related to the JIRA issue : LUCENE-7498\n\n    It involves the introduction of a big refactor of the More Like This module and the introduction of the BM25 similarity.\n\n    It is not supposed to be a final patch but to put the basis for a big improvement in the More Like This code base.\n    Any feedback is welcome\n\n    *Summary*\n    MoreLikeThis becomes a facade, just to expose the main More Like This functionality.\n    Responsibility are now separated in :\n\n\tInteresting Terms retriever ( from a docId in the index or from a Lucene Document passed in input)\n\tScorer ( to identify how much a term is interesting : BM25 and TFIDF supported\n\tMlt query builder ( to build the query from the interesting terms)\n\n\n\n    Every component is specifically tested.\n\n    The modification impact as a side effect : \n\n    *Classification*\n    Knn CLassifiers to use the refactored More Like This\n    Knn query in Lucene will be slightly different\n\n    *Single Solr Instance*\n    The refactored MLT usage by Solr\n\n    *SolrCloud*\n    The refactored MLT usage by SolrCloud\n\n\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/alessandrobenedetti/lucene-solr lucene-7498\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/191.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #191\n\n\ncommit 5c2648aff8258472105fd1e85df806f4871d8c98\nAuthor: Alessandro Benedetti <benedetti.alex85@gmail.com>\nDate:   2017-02-06T22:48:41Z\n\n    LUCENE-7498 initial patch\n\ncommit 562fb48acfe3cbf5df62c3818b89ab7904aa52a9\nAuthor: Alessandro Benedetti <benedetti.alex85@gmail.com>\nDate:   2017-02-06T23:09:57Z\n\n    LUCENE-7498 minor fix in field names with boost analysis\n\ncommit 061ca863a9f2fadd0ba996c9041cc720128a127b\nAuthor: Alessandro Benedetti <benedetti.alex85@gmail.com>\nDate:   2017-02-06T23:32:56Z\n\n    LUCENE-7498 original test was not correct, fixed\n\n "
        },
        {
            "id": "comment-15972848",
            "author": "Alessandro Benedetti",
            "date": "2017-04-18T14:54:35+0000",
            "content": "Tommaso Teofili as mentioned in the other Jira this is the patch.\nIt is quite big, and a summary is attached to the Pull Request.\n\nFor everyone, I would be happy to improve the patch and evaluate feedback.\nMain target of this work is to introduce BM25 and improve the structure of MLT to make it easier to extend and maintain. "
        },
        {
            "id": "comment-15974452",
            "author": "Robert Muir",
            "date": "2017-04-19T11:07:53+0000",
            "content": "Because this class is doing query expansion, I think before changing its algorithm, it should be measured with a relevance test. There is a lot more going on here than \"switching from tf/idf to bm25\", e.g. length normalization was never involved here in any way before.\n\nSeparately, this change makes things in the guts of the core lucene scoring system public that IMO should remain private. It also adds new public methods to these classes just for the purpose of MoreLikeThis. I think that formulas used here are usually different beasts than core scoring systems and we don't need to tie them together at all. E.G. MLT is doing something different than TFIDFSimilarity today: its a different formula.\n\nFinally, I think it needs to be split up, the change is thousands of lines and a ton of stuff happening at once that should be maybe considered separately?:\n\n\tMLT internals broken into many many classes\n\tChanging the default scoring algorithm of BM25\n\tModification of core scoring systems to allow MLT to interact with it in a different way\n\tChanges of Solr cloud classes, classification module, etc (maybe because of api changes).\n\n\n "
        },
        {
            "id": "comment-15976654",
            "author": "Alessandro Benedetti",
            "date": "2017-04-20T13:08:13+0000",
            "content": "Hi Robert Muir, thank you for your feedback, I agree on your points, let's identify the next steps :\n\n1) I will split up the patch \n\n\tMLT internal broken up in more maintainable classes, as much as back compatible as possible ( scoring refactor allow to introduce new scorers in the future with ease)\n\tintroduction of BM25 term scorer ( possibly involving BM25 to become public or partial duplicated code) -> this will remain in this JIRA\n\tChanges of Solr cloud classes, classification module, etc (maybe because of api changes)\n\n\n\n2) generate related JIRAs\n3) proceed with review in order to reduce complexity ( first review will be big, but much smaller and cohesive than this one \n\nI will keep you updated,\n\n "
        },
        {
            "id": "comment-15981418",
            "author": "Alessandro Benedetti",
            "date": "2017-04-24T16:05:28+0000",
            "content": "It requires the structural change first "
        }
    ]
}