{
    "id": "LUCENE-2785",
    "title": "TopFieldCollector throws AIOOBE if numHits is 0",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "See solr-user thread \"ArrayIndexOutOfBoundsException for query with rows=0 and sort param\".\n\nI think we should just create a null collector (only tallies up totalHits) if numHits is 0?",
    "attachments": {
        "LUCENE-2785.patch": "https://issues.apache.org/jira/secure/attachment/12464982/LUCENE-2785.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-11-30T09:38:43+0000",
            "content": "+1, I needed the same. Its often a use case to simply get number of results. And a PQ with one entry and all the logic does not make sense here. We should just count hits. ",
            "author": "Uwe Schindler",
            "id": "comment-12965172"
        },
        {
            "date": "2010-11-30T10:01:40+0000",
            "content": "It would be good if we could have a TotalHitsCollector which just counts total hits (as a standalone Collector). Problem is, we need to return a TDC from the static create() of TFC and TSDC, and a TotalHitsCollector shouldn't have topDocs() ...  ",
            "author": "Shai Erera",
            "id": "comment-12965180"
        },
        {
            "date": "2010-11-30T10:26:15+0000",
            "content": "So... IndexSearcher.search (the one that sorts by score) throws an EXC if numHits is 0...\n\nMaybe... we should do the same for the sort-by-field case?\n\nAnd, also make this new Collector that only counts hits?  The exception message can then point users to this new Collector?\n\nI'm all for not making the app handle corner cases... but, then, I don't like that you silently get bad performance.  It's better to steer the apps to use the right Collector for the job? ",
            "author": "Michael McCandless",
            "id": "comment-12965188"
        },
        {
            "date": "2010-11-30T10:52:46+0000",
            "content": "So... IndexSearcher.search (the one that sorts by score) throws an EXC if numHits is 0... Maybe... we should do the same for the sort-by-field case?\n\nI think IndexSearcher should not only throw the exception, in my opinion the create() method in TSDC and TFDC should also check this and throw the exception? A lot of people, also solr are instantiating the collectors themselves (although not recommeneded, because they dont know the correct booleans passed in).\n\n+1 for TSDC and TFDC throw exception if hitcount <1\n\nAnd, also make this new Collector that only counts hits? The exception message can then point users to this new Collector?\n\n+1 to the new collector that simply counts. I have such a collector also sometimes in my code. Misusing TFDC or TSDC is wrong and uses too much resources. ",
            "author": "Uwe Schindler",
            "id": "comment-12965192"
        },
        {
            "date": "2010-11-30T11:23:12+0000",
            "content": "\"A Collector, that counts\" - priceless.\nAnd, yes, I have one of these too. ",
            "author": "Earwin Burrfoot",
            "id": "comment-12965202"
        },
        {
            "date": "2010-11-30T19:49:35+0000",
            "content": "Patch.\n\nI moved the numHits > 0 check down into TFC.create an TSDC.create, out of IndexSearcher.\n\nAnd I added a new TotalHitCountCollector. ",
            "author": "Michael McCandless",
            "id": "comment-12965384"
        },
        {
            "date": "2011-03-30T15:50:09+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013384"
        }
    ]
}