{
    "id": "LUCENE-7631",
    "title": "Enforce javac warnings",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Bug",
        "components": [
            "general/build"
        ],
        "fix_versions": []
    },
    "description": "Robert's comment on LUCENE-3973 suggested to take an incremental approach to static analysis and leverage the java compiler warnings. I think this is easy to do and is a reasonable change to make to protect the code base for the future.\n\nWe currently have many fewer warnings than we did a year or two years ago and should ensure that we do not slide backwards.",
    "attachments": {
        "LUCENE-7631.patch": "https://issues.apache.org/jira/secure/attachment/12847463/LUCENE-7631.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15822603",
            "date": "2017-01-14T01:29:58+0000",
            "content": "Patch that ensures we won't add any new compiler warnings in several categories (that we're pretty good on already) in the future. We can deal with fixing existing rawtypes or a few other classes of warning in the future.\n\nDavid Smiley - you seemed interested in this conversation last time it came up. ",
            "author": "Mike Drob"
        },
        {
            "id": "comment-15824253",
            "date": "2017-01-16T16:41:44+0000",
            "content": "Thanks for filing this issue!  Are all the changes in this patch necessary to get the build to pass?  So to clarify... no code (outside what the patch touches) needs adjustments? ",
            "author": "David Smiley"
        },
        {
            "id": "comment-15824347",
            "date": "2017-01-16T17:38:01+0000",
            "content": "Yes, the build passes for me with only the two additional changes in WordDictionary and SimpleServer.\n\nWarnings for -Xlint:-auxiliaryclass -Xlint:-deprecation -Xlint:-rawtypes -Xlint:-serial -Xlint:-unchecked are all disabled. Each of those causes a lot of errors that I'd like to see eventually followed up on. The auxiliary class warnings are the easiest of those, but still enough work that I felt like it should be a separate task.\n\nI also have a sneaking suspicion that this only affects lucene and solr is somehow ignoring it, but couldn't find anything to confirm that. ",
            "author": "Mike Drob"
        },
        {
            "id": "comment-15824415",
            "date": "2017-01-16T18:43:03+0000",
            "content": "Thanks Mike!\nI am for using this patch. Robert's suggestion was to enable \"all\" warnings, but IMHO this is a bad idea, because if somebody compiles with a later Java version, the build may suddenly fail (because a later version of the compiler added a new warning type).\n\nI am not sure if the warning exclusions are really needed, because we no longer have the general -Xlint. But it's good to have them listed!\n\nThe only downside of this patch is that we no longer get any warnings displayed that are currently disabled (rawtypes, unchecked). So we should fix them asap (in a separate issue).\n\nBTW: Maybe we can enable rawtypes and unchecked errors earlier in Lucene and leave them disabled in Solr. As far as I remember we already have a separate warning setting for Solr. This may be the reason why Solr does not show any problems!? ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15824417",
            "date": "2017-01-16T18:44:55+0000",
            "content": "Yes on Solr your change is not enabled: https://github.com/apache/lucene-solr/blob/master/solr/common-build.xml#L30\n\nWe should also review Solr (maybe in a separate issue). ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15832566",
            "date": "2017-01-20T22:58:44+0000",
            "content": "I am not sure if the warning exclusions are really needed, because we no longer have the general -Xlint. But it's good to have them listed!\nYea, I like having them listed because it makes it easier to go back and look at them and decide which ones to add.\n\nI don't have access to an IBM jdk to check if that produces different output or not. Uwe Schindler - do you think this is fine to commit or we should tackle more work in this issue? ",
            "author": "Mike Drob"
        },
        {
            "id": "comment-15832892",
            "date": "2017-01-21T08:51:03+0000",
            "content": "Hi,\nIBM JDK8+ should also use OpenJDK internally, so I dont't think hit has much different options. I can try later, I have one installed.\n\nWhat do we do with Solr? Keep it as it is (it overrides to do no Xlint warnings at all and don't fail on warning). Otherwise I am fine with committing this. But we should really work on removing unsafe and rawtypes warnings from functions module. Now those are completely undetected (no warning, no error). ",
            "author": "Uwe Schindler"
        }
    ]
}