{
    "id": "LUCENE-1719",
    "title": "Add javadoc notes about ICUCollationKeyFilter's advantages over CollationKeyFilter",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "modules/other"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "2.4.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "contrib/collation's ICUCollationKeyFilter, which uses ICU4J collation, is faster than CollationKeyFilter, the JVM-provided java.text.Collator implementation in the same package.  The javadocs of these classes should be modified to add a note to this effect.\n\nMy curiosity was piqued by Robert Muir's comment on LUCENE-1581, in which he states that ICUCollationKeyFilter is up to 30x faster than CollationKeyFilter.\n\nI timed the operation of these two classes, with Sun JVM versions 1.4.2/32-bit, 1.5.0/32- and 64-bit, and 1.6.0/64-bit, using 90k word lists of 4 languages (taken from the corresponding Debian wordlist packages and truncated to the first 90k words after a fixed random shuffling), using Collators at the default strength, on a Windows Vista 64-bit machine.  I used an analysis pipeline consisting of WhitespaceTokenizer chained to the collation key filter, so to isolate the time taken by the collation key filters, I also timed WhitespaceTokenizer operating alone for each combination.  The rightmost column represents the performance advantage of the ICU4J implemtation (ICU) over the java.text.Collator implementation (JVM), after discounting the WhitespaceTokenizer time (WST): (JVM-ICU) / (ICU-WST). The best times out of 5 runs for each combination, in milliseconds, are as follows:\n\n\n\n\nSun JVM\nLanguage\njava.text\nICU4J\nWhitespaceTokenizer\nICU4J Improvement\n\n\n1.4.2_17 (32 bit)\nEnglish\n522\n212\n13\n156%\n\n\n1.4.2_17 (32 bit)\nFrench\n716\n243\n14\n207%\n\n\n1.4.2_17 (32 bit)\nGerman\n669\n264\n16\n163%\n\n\n1.4.2_17 (32 bit)\nUkranian\n931\n474\n25\n102%\n\n\n1.5.0_15 (32 bit)\nEnglish\n604\n176\n16\n268%\n\n\n1.5.0_15 (32 bit)\nFrench\n817\n209\n17\n317%\n\n\n1.5.0_15 (32 bit)\nGerman\n799\n225\n20\n280%\n\n\n1.5.0_15 (32 bit)\nUkranian\n1029\n436\n26\n145%\n\n\n1.5.0_15 (64 bit)\nEnglish\n431\n89\n10\n433%\n\n\n1.5.0_15 (64 bit)\nFrench\n562\n112\n11\n446%\n\n\n1.5.0_15 (64 bit)\nGerman\n567\n116\n13\n438%\n\n\n1.5.0_15 (64 bit)\nUkranian\n734\n281\n21\n174%\n\n\n1.6.0_13 (64 bit)\nEnglish\n162\n81\n9\n113%\n\n\n1.6.0_13 (64 bit)\nFrench\n192\n92\n10\n122%\n\n\n1.6.0_13 (64 bit)\nGerman\n204\n99\n14\n124%\n\n\n1.6.0_13 (64 bit)\nUkranian\n273\n202\n21\n39%",
    "attachments": {
        "LUCENE-1719.patch": "https://issues.apache.org/jira/secure/attachment/12412009/LUCENE-1719.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-06-28T04:51:57+0000",
            "content": "Patch containing notes to add to collation key filter/analyzer classes' javadocs. ",
            "author": "Steve Rowe",
            "id": "comment-12724922"
        },
        {
            "date": "2009-06-28T05:05:03+0000",
            "content": "I also tested ICU4J version 4.2 (released 6 weeks ago), and the timings were nearly identical to those from ICU4J version 4.0 (the one that's in contrib/collation/lib/).\n\nThe timings given in the table above were not produced with the \"-server\" option to the JVM.  I separately tested all combinations using the \"-server\" option, but there was no difference for the 32-bit JVMs, though roughly 3-4% faster for the 64-bit JVMs.  I got the impression (didn't actually calculate) that although the best times of 5 runs were better for the 64-bit JVMs when using the \"-server\" option, the average times seemed to be slightly worse.  In any case, the performance improvement of the ICU4J implementation over the java.text.Collator implementation was basically unaffected by the use of the \"-server\" JVM option. ",
            "author": "Steve Rowe",
            "id": "comment-12724923"
        },
        {
            "date": "2009-06-28T11:08:12+0000",
            "content": "steven, you are correct. \n\ni should have clarified, the gain is not as much when generating keys. but there is still huge gains for runtime comparison. see recent numbers here for a few languages:\n\nhttp://site.icu-project.org/charts/collation-icu4j-sun\n\nbut you should also mention that key size is smaller too!  (smaller term dictionary) ",
            "author": "Robert Muir",
            "id": "comment-12724941"
        },
        {
            "date": "2009-06-28T17:35:10+0000",
            "content": "Cool! Thanks for the link, Robert.\n\nKey comparison under Lucene when using *CollationKeyAnalyzer will utilize neither ICU4J's nor the java.text incremental collation facilities - the base-8000h-String-encoded raw collation keys will be directly compared (and sorted) as Strings.  So key generation time and, as you point out, key length are the appropriate measures here.\n\nI'll post a patch shortly that includes your ICU4J link, and mentions the key length aspect as well.  I'll also remove specific numbers from the javadoc notes - people can follow the ICU4J link if they're interested. ",
            "author": "Steve Rowe",
            "id": "comment-12724974"
        },
        {
            "date": "2009-06-28T18:13:20+0000",
            "content": "Edited title to reflect addition of key length concerns, and switched performance improvement column to be percentage improvements rather than multipliers. ",
            "author": "Steve Rowe",
            "id": "comment-12724978"
        },
        {
            "date": "2009-06-28T19:28:28+0000",
            "content": "steven, no thank you for running the calculations!\n\nyeah i think the sort key length is worth mentioning. in practice i wonder how much it helps lucene at runtime, maybe for things like SORT at least it would improve runtime performance by some small amount. ",
            "author": "Robert Muir",
            "id": "comment-12724986"
        },
        {
            "date": "2009-06-28T20:53:27+0000",
            "content": "steven, another note i thought i would mention.\n\nalong these same lines i searched lucene source code for java.text.Collator and found some uses of it (the incremental facility). I wonder if in the future we could find a way to allow usage of com.ibm.icu.text.Collator in these spots.\n\nthis could give some healthy performance improvements. I found it in:\n\nQueryParser (for localized RangeQuery)\nRangeQuery/RangeFilter/RangeTermEnum/ConstantScoreRangeQuery\nFieldComparator/FieldSortedHitQueue/FieldDocSortedHitQueue\n ",
            "author": "Robert Muir",
            "id": "comment-12724996"
        },
        {
            "date": "2009-06-29T03:55:17+0000",
            "content": "[...] i searched lucene source code for java.text.Collator and found some uses of it (the incremental facility). I wonder if in the future we could find a way to allow usage of com.ibm.icu.text.Collator in these spots.\n\n+1\n\nI guess the way to go would be to make the implementation pluggable. ",
            "author": "Steve Rowe",
            "id": "comment-12725023"
        },
        {
            "date": "2009-06-29T03:57:44+0000",
            "content": "Updated patch including information about ICU4J's shorter key length; adding a link to the ICU4J documentation's comparison of ICU4J and java.text.Collator key generation time and key length; and removing specific performance numbers. ",
            "author": "Steve Rowe",
            "id": "comment-12725024"
        },
        {
            "date": "2009-06-30T14:37:59+0000",
            "content": "Steven, patch looks good to me. I will look at it again in a day or two.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12725648"
        },
        {
            "date": "2009-07-01T16:52:11+0000",
            "content": "I committed your patch and removed the last \"NB:\" in the ICUCollationKeyFilter.java for consistency.\n\nThanks Steven! ",
            "author": "Simon Willnauer",
            "id": "comment-12726129"
        }
    ]
}