{
    "id": "LUCENE-7001",
    "title": "Update Lucene + Solr website's \"develop-resources\" pages to show Git/Github URLs instead of the outdated SVN ones",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "general/website"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Task"
    },
    "description": "When clicking through the http://lucene.apache.org website, I found the \"Developer Resources\" pages that still mention SVN. We should update those pages with links to our primary Git page (and of course also Github mirror for easy forking).\n\nIt may also be the time to replace any instances of the \"feather\" and the ASF logo by the new one. We have a feater in the green title bar. Unfortunately the new logo does not really fit the colors...",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15123361",
            "author": "Jan Høydahl",
            "date": "2016-01-29T11:25:04+0000",
            "content": "See also SOLR-8579 for more bullets related to upgrading the TLP site "
        },
        {
            "id": "comment-15123420",
            "author": "Uwe Schindler",
            "date": "2016-01-29T12:30:01+0000",
            "content": "Hi,\nI have seen this issue. I just wanted to open a more genera LUCENE one, because this one is just about replacing the Solr Logo.\nI have also seen that you removed the ASF Logo comment, was this because on the Solr homepage there is no ASF logo?\n\nOn Lucene's site we have several \"feather\" logos, also in the title. "
        },
        {
            "id": "comment-15126035",
            "author": "Jan Høydahl",
            "date": "2016-02-01T09:57:03+0000",
            "content": "I intended the issue to cover the TLP site for both Lucene and Solr. Removed the ASF logo comment simply because it is already mentioned in the issue description. "
        }
    ]
}