{
    "id": "LUCENE-2964",
    "title": "Allow benchmark tasks from alternative packages",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/benchmark"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.2",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Relax current limitation of all tasks in same package - that of PerfTask.\nAdd a property \"alt.tasks.packages\" - its value are comma separated full package names.\nIf the task class is not found in the default package, an attempt is made to load it from the alternate packages specified in that property.",
    "attachments": {
        "LUCENE-2964.patch": "https://issues.apache.org/jira/secure/attachment/12473292/LUCENE-2964.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-03-10T17:14:00+0000",
            "content": "Patch implements this relaxation.\nIt is working for me conveniently.\nTo do:\n\n\tadd a test\n\tupdate the package documentation about this property\n\n ",
            "author": "Doron Cohen",
            "id": "comment-13005170"
        },
        {
            "date": "2011-03-10T18:19:10+0000",
            "content": "Big +1 !\n\nWhat a nice addition Doron. Now I can change my benchmark code to stop looking like I hack Lucene w/ those package names.\n\nAbout the patch, looks good. I have two questions:\n\n\n\tCan you pass 'null' to config.get() and then just compare the 'alt' to null in the next line?\n\tMaybe instead of this 'fallback' logic, you always create a packages[] array with the first package being that of PerfTask? Then you can loop over all packages until the first one succeeds. Since this is not a hotspot section (executed once when algorithm is parsed), I think perf-wise we should be ok. It will also mean looking up the alt package names in the config before this method is invoked ...\n\tI'd add a comment to the javadocs that if someone uses the same task name by two packages, then whichever is found first is used.\n\n ",
            "author": "Shai Erera",
            "id": "comment-13005220"
        },
        {
            "date": "2011-03-20T22:41:12+0000",
            "content": "Thanks Shai for the review!\nFollowed all your suggestions, it indeed made the code simpler. \nAlso added a test case and a Changes entry, ",
            "author": "Doron Cohen",
            "id": "comment-13008981"
        },
        {
            "date": "2011-03-21T04:23:58+0000",
            "content": "Patch looks good and nice updates to package.html !\n\nIn Algorithm.taskClass, I see that you store the CNFE and later reference it in the thrown CNFE (if the class wasn't found in all package). I think it's redundant? Because if I specify 4 alt packages and the task is not in any of them, the referenced error will be of the last one, which is just confusing. The CNFE message that you pass is already descriptive enough, IMO.\n\nCan we put AltTestTask an inner public static member of AltPackageTaskTest? ",
            "author": "Shai Erera",
            "id": "comment-13009020"
        },
        {
            "date": "2011-03-21T08:59:50+0000",
            "content": "Thanks for reviewing.\n\nThe CNFE message that you pass is already descriptive enough, IMO.\n\nAgree, I'll change that.\n\nput AltTestTask an inner public static member of AltPackageTaskTest\n\nThis makes sense - but is tricky, as the alg line should now look like this:\n\n\nString altTask = \"{ AltPackageTaskTest$AltTest }\"; // inner class peculiarities - '$' as separator\n\n\n\nWhich is rather not too nice (took me some time to figure why just AltPackageTaskTest.AltTest fails).\nBut in addition, $ causes the Algorithm's tokenizer to break that into two task names, I am not sure it is worth to modify it for removing that test class, but I'll give it a few more minutes.  ",
            "author": "Doron Cohen",
            "id": "comment-13009060"
        },
        {
            "date": "2011-03-21T09:11:32+0000",
            "content": "Apparently using '$' is safe in that it is always correct as this is the standard definition for inner class separator - see Inner Classes Specification .\n\nThe required change to the Benchmark Algorithm is to define '$' as a word part, by adding this to the Algorithm's tokenizer intialization:\n\nstok.wordChars('$','$');\n\n\n\nI am not sure about this.\nIt would allow easier creation of tasks as inner classes.\nBut this is mainly for tests I assume, because for real tasks one would want them to read nicely - without that '$' and to have their own class file. \nAnd making '$' a regular word char just for this test need, will prevent us from adding some semantics to it in the future, should the need arise,\n\nSo, I rather keep the additional class file in the test package. ",
            "author": "Doron Cohen",
            "id": "comment-13009062"
        },
        {
            "date": "2011-03-21T09:37:54+0000",
            "content": "Updated patch, fixing per Shai suggestion on the exception. \nPlanning to commit shortly. ",
            "author": "Doron Cohen",
            "id": "comment-13009073"
        },
        {
            "date": "2011-03-21T09:57:31+0000",
            "content": "So, I rather keep the additional class file in the test package.\n\nI'm fine with it. ",
            "author": "Shai Erera",
            "id": "comment-13009080"
        },
        {
            "date": "2011-03-21T12:05:13+0000",
            "content": "Committed:\n\n\tr1083726 - 3x\n\tr1083731 - trunk\n\n\n\n(Hudson's Lucene-Solr-tests-only-trunk #6185 passed the new Benchmarks tests.) ",
            "author": "Doron Cohen",
            "id": "comment-13009107"
        },
        {
            "date": "2011-06-03T16:37:17+0000",
            "content": "Bulk closing for 3.2 ",
            "author": "Robert Muir",
            "id": "comment-13043507"
        }
    ]
}