{
    "id": "LUCENE-1575",
    "title": "Refactoring Lucene collectors (HitCollector and extensions)",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This issue is a result of a recent discussion we've had on the mailing list. You can read the thread here.\n\nWe have agreed to do the following refactoring:\n\n\tRename MultiReaderHitCollector to Collector, with the purpose that it will be the base class for all Collector implementations.\n\tDeprecate HitCollector in favor of the new Collector.\n\tIntroduce new methods in IndexSearcher that accept Collector, and deprecate those that accept HitCollector.\n\t\n\t\tCreate a final class HitCollectorWrapper, and use it in the deprecated methods in IndexSearcher, wrapping the given HitCollector.\n\t\tHitCollectorWrapper will be marked deprecated, so we can remove it in 3.0, when we remove HitCollector.\n\t\tIt will remove any instanceof checks that currently exist in IndexSearcher code.\n\t\n\t\n\tCreate a new (abstract) TopDocsCollector, which will:\n\t\n\t\tLeave collect and setNextReader unimplemented.\n\t\tIntroduce protected members PriorityQueue and totalHits.\n\t\tIntroduce a single protected constructor which accepts a PriorityQueue.\n\t\tImplement topDocs() and getTotalHits() using the PQ and totalHits members. These can be used as-are by extending classes, as well as be overridden.\n\t\tIntroduce a new topDocs(start, howMany) method which will be used a convenience method when implementing a search application which allows paging through search results. It will also attempt to improve the memory allocation, by allocating a ScoreDoc[] of the requested size only.\n\t\n\t\n\tChange TopScoreDocCollector to extend TopDocsCollector, use the topDocs() and getTotalHits() implementations as they are from TopDocsCollector. The class will also be made final.\n\tChange TopFieldCollector to extend TopDocsCollector, and make the class final. Also implement topDocs(start, howMany).\n\tChange TopFieldDocCollector (deprecated) to extend TopDocsCollector, instead of TopScoreDocCollector. Implement topDocs(start, howMany)\n\tReview other places where HitCollector is used, such as in Scorer, deprecate those places and use Collector instead.\n\n\n\nAdditionally, the following proposal was made w.r.t. decoupling score from collect():\n\n\tChange collect to accecpt only a doc Id (unbased).\n\tIntroduce a setScorer(Scorer) method.\n\tIf during collect the implementation needs the score, it can call scorer.score().\nIf we do this, then we need to review all places in the code where collect(doc, score) is called, and assert whether Scorer can be passed. Also this raises few questions:\n\tWhat if during collect() Scorer is null? (i.e., not set) - is it even possible?\n\tI noticed that many (if not all) of the collect() implementations discard the document if its score is not greater than 0. Doesn't it mean that score is needed in collect() always?\n\n\n\nOpen issues:\n\n\tThe name for Collector\n\tTopDocsCollector was mentioned on the thread as TopResultsCollector, but that was when we thought to call Colletor ResultsColletor. Since we decided (so far) on Collector, I think TopDocsCollector makes sense, because of its TopDocs output.\n\tDecoupling score from collect().\n\n\n\nI will post a patch a bit later, as this is expected to be a very large patch. I will split it into 2: (1) code patch (2) test cases (moving to use Collector instead of HitCollector, as well as testing the new topDocs(start, howMany) method.\nThere might be even a 3rd patch which handles the setScorer thing in Collector (maybe even a different issue?)",
    "attachments": {
        "LUCENE-1575.2.patch": "https://issues.apache.org/jira/secure/attachment/12404317/LUCENE-1575.2.patch",
        "sortCollate5.py": "https://issues.apache.org/jira/secure/attachment/12404631/sortCollate5.py",
        "LUCENE-1575.4.patch": "https://issues.apache.org/jira/secure/attachment/12404334/LUCENE-1575.4.patch",
        "LUCENE-1575.5.patch": "https://issues.apache.org/jira/secure/attachment/12404418/LUCENE-1575.5.patch",
        "LUCENE-1575.3.patch": "https://issues.apache.org/jira/secure/attachment/12404331/LUCENE-1575.3.patch",
        "LUCENE-1575.9.patch": "https://issues.apache.org/jira/secure/attachment/12405144/LUCENE-1575.9.patch",
        "LUCENE-1575.1.patch": "https://issues.apache.org/jira/secure/attachment/12404314/LUCENE-1575.1.patch",
        "PerfTest.java": "https://issues.apache.org/jira/secure/attachment/12404676/PerfTest.java",
        "sortBench5.py": "https://issues.apache.org/jira/secure/attachment/12404630/sortBench5.py",
        "LUCENE-1575.7.patch": "https://issues.apache.org/jira/secure/attachment/12404651/LUCENE-1575.7.patch",
        "LUCENE-1575.6.patch": "https://issues.apache.org/jira/secure/attachment/12404438/LUCENE-1575.6.patch",
        "LUCENE-1575.8.patch": "https://issues.apache.org/jira/secure/attachment/12404704/LUCENE-1575.8.patch",
        "LUCENE-1575.patch": "https://issues.apache.org/jira/secure/attachment/12404311/LUCENE-1575.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-03-27T20:43:51+0000",
            "content": "Looks good!  Thanks Shai.  Some responses:\n\nCreate a final class HitCollectorWrapper, and use it in the deprecated methods in IndexSearcher, wrapping the given HitCollector.\n\nThis turns deprecated HitCollector into a Collector?  Seems like it\nshould be package private?\n\nChange TopFieldDocCollector (deprecated) to extend TopDocsCollector, instead of TopScoreDocCollector. Implement topDocs(start, howMany)\n\nThis is deprecated, so we shouldn't add topDocs(start, howMany)?  I\nthink just switch it back to extending the deprecated TopDocCollector\n(like it does in 2.4)?\n\nWhat if during collect() Scorer is null? (i.e., not set) - is it even possible?\n\nI think Lucene should guarantee not to do that?\n\nI noticed that many (if not all) of the collect() implementations discard the document if its score is not greater than 0. Doesn't it mean that score is needed in collect() always?\n\nHmmmm good point.  I would love to stop screening for 0 score in the\ncore collectors (like Solr).  Maybe we fix the core collectors to not\nscreen by zero score, but we add a new \"only keep positive scores\"\ncollector chain/wrapper class that does the filtering and the forwards\ncollection to another collector?  This way there's a migration path if\nsomehow users are relying on this.\n\nAnd we should note this difference clearly in the javadocs for the new\nhierarchy.\n\nThere might be even a 3rd patch which handles the setScorer thing in Collector (maybe even a different issue?) \n\nI think it's fine if it's the same issue, though doing it as 2 patches\nis going to make life difficult.  I think a single patch covering\nchanges to src/java, and one to src/test is OK, though I'd personally\nprefer just one patch overall. ",
            "author": "Michael McCandless",
            "id": "comment-12690094"
        },
        {
            "date": "2009-03-28T14:17:12+0000",
            "content": "\nThis turns deprecated HitCollector into a Collector? Seems like it\nshould be package private?\n\nInitially I wrote it but then deleted. I decided to make the decision as I create the patch. If this will be used only in IndexSearcher, then it should be a private static final class in IndexSearcher, otherwise a package private one. However, if it turns out we'd want to use it for now in other places too where we deprecate the HitCollector methods, then it will be public.\nAnyway, it will be marked deprecated, and I have the intention to make it as 'invisible' as possible.\n\n\nThis is deprecated, so we shouldn't add topDocs(start, howMany)? I\nthink just switch it back to extending the deprecated TopDocCollector\n(like it does in 2.4)?\n\nThat's a good idea.\n\n\nHmmmm good point. I would love to stop screening for 0 score in the\ncore collectors (like Solr). Maybe we fix the core collectors to not\nscreen by zero score, but we add a new \"only keep positive scores\"\ncollector chain/wrapper class that does the filtering and the forwards\ncollection to another collector? This way there's a migration path if\nsomehow users are relying on this.\n\nI can do that. Create a FilterZeroScoresCollector which wraps a Collector and passes forward only documents with score > 0. BTW, how can a document get a zero score?\n\nI thought to split patches to code and test since I believe the code patch can be ready sooner for review. The test patch will just fix test cases. If that matters so much, I can create a final patch in the end which contains all the changes for easier commit? ",
            "author": "Shai Erera",
            "id": "comment-12693443"
        },
        {
            "date": "2009-03-28T14:51:00+0000",
            "content": "> BTW, how can a document get a zero score?\n\nAny number of ways, since Query and Scorer are extensible.  How about a RandomScoreQuery that uses floor(rand(1.9))?  Or say that you have a bitset of docs which should match and you use that to feed a scorer.  What score should you assign?  Why not 0?  Why not -1?  Should it matter? ",
            "author": "Marvin Humphrey",
            "id": "comment-12693448"
        },
        {
            "date": "2009-03-28T15:59:45+0000",
            "content": "I thought to split patches to code and test since I believe the code patch can be ready sooner for review. The test patch will just fix test cases. If that matters so much, I can create a final patch in the end which contains all the changes for easier commit?\n\nOK that sounds great.  The back-compat tests will also assert nothing broke.\n\nAnyway, it will be marked deprecated, and I have the intention to make it as 'invisible' as possible.\n\nOK.\n\nBTW, how can a document get a zero score?\n\nI've wondered the same thing.  There was this thread recently:\n\n   http://www.nabble.com/TopDocCollector-td22244245.html ",
            "author": "Michael McCandless",
            "id": "comment-12693462"
        },
        {
            "date": "2009-03-28T16:30:22+0000",
            "content": "After I posted the question on how can a document get a 0 score, I realized that it's possible due to extensions of Similarity for example. Thanks Marvin for clearing that up. I guess though that the Lucene core classes will not assign <= 0 score to a document?\n\nAnyway, whether it's true or not, I think I agree with Mike saying we should remove this screening from the core collectors. If my application extends Lucene in a way that it can assign <= 0 scores to documents, and it has the intention of screening those documents, it should use the new FilterZeroScoresCollector (maybe call it OnlyPositiveScoresCollector?)\n\nI don't think that assigning <= 0 score to a document necessarily means it should be removed from the result set. \n\nHowever, Mike (and others) - isn't there a back-compatibility issue with changing the core collectors to not screen on <=0 score documents? I mean, what if my application relies on that and extended Lucene in a way that it sometimes assigns 0 scores to documents? Now when I'll switch to 2.9, those documents won't be filtered. I will be able to use the new FilterZeroScoresCollector, but that'll require me to change my app's code.\n\nMaybe just do it for the new collectors (TopScoreDocCollector and TopFieldCollector)? I need to change my app's code anyway if I want to use them, so as long as we document this fact in their javadocs, we should be fine? ",
            "author": "Shai Erera",
            "id": "comment-12693469"
        },
        {
            "date": "2009-03-28T17:07:10+0000",
            "content": "\nHowever, Mike (and others) - isn't there a back-compatibility issue with changing the core collectors to not screen on <=0 score documents? \n\nHmm right there is, because the search methods will use the new collectors.\n\nI need to change my app's code anyway if I want to use them, so as long as we document this fact in their javadocs, we should be fine?\n\nActually there's no change to your code required (the search methods should use the new collectors).  So we do have a back-compat difference.\n\nWe could make the change (turn off filtering), but put a setter on IndexSearcher to have it insert the \"PositiveScoresOnlyCollector\" wrapper?  I think the vast majority of users are not relying on <= 0 scoring docs to be filtered out. ",
            "author": "Michael McCandless",
            "id": "comment-12693470"
        },
        {
            "date": "2009-03-28T18:22:18+0000",
            "content": "We could make the change (turn off filtering), but put a setter on IndexSearcher to have it insert the \"PositiveScoresOnlyCollector\" wrapper?\n\nThen why do that at all? If I need to call searcher.setKeepOnlyPositiveScores, then it means a change to my code. I could then just pass in the PositiveScoresOnlyCollector to the search methods instead, right?\n\nI guess you are referring to the methods which don't take a collector as a parameter and instantiate a new TopScoreDocCollector internally? I tend to think that if someone uses those, it is just because they are simple, and I find it very hard to imagine that that someone relies on the filtering. So perhaps we can get away with just documenting the change in behavior?\n\nI think the vast majority of users are not relying on <= 0 scoring docs to be filtered out.\n\nI tend to agree. This has been around for quite some time. I checked my custom collectors, and they do the same check. I only now realize I just followed the code practice I saw in Lucene's code, never giving it much thought of whether this can actually happen. I believe that if I'd have extended Lucene in a way such that it returns <=0 scores, I'd be aware of that and probably won't use the built-in collectors. I see no reason to filter <= 0 scored docs anyway, and if I wanted that, I'd probably write my own filtering collector ...\n\nI think that if we don't believe people rely on the <= 0 filtering, let's just document it. I'd hate to add a setter method to IndexSearcher, and a unit test, and check where else it should be added (i.e., in extending searcher classes) and introduce a new API which we might need to deprecate some day ...\nPeople who'll need that functionality can move to use the methods that accept a Collector, and pass in the PositiveScoresOnlyCollector. That way we also keep the 'fast and easy' search methods really simple, fast and easy.\n\nIs that acceptable? ",
            "author": "Shai Erera",
            "id": "comment-12693474"
        },
        {
            "date": "2009-03-28T18:49:20+0000",
            "content": "Then why do that at all? If I need to call searcher.setKeepOnlyPositiveScores, then it means a change to my code. I could then just pass in the PositiveScoresOnlyCollector to the search methods instead, right?\n\nOK, I agree.  Let's add an entry to the top of CHANGES.txt that states this [minor] break in back compatibility, as well as the code fragment showing how to use that filter to get back to the pre-2.9 way? ",
            "author": "Michael McCandless",
            "id": "comment-12693478"
        },
        {
            "date": "2009-03-29T03:54:55+0000",
            "content": "Great ! ",
            "author": "Shai Erera",
            "id": "comment-12693513"
        },
        {
            "date": "2009-03-29T06:15:21+0000",
            "content": "BooleanScorer defines an internal package private static final Collector class. Two questions:\n\n\tMay I change it to BooleanCollector? (the name conflicts with the Collector name we want to give to all base collectors)\n\tMay I change it to private static final? It is used only in BooleanScorer's newCollector() method.\nI think the two are safe because it's already package-private and there's no other Lucene code which uses it.\n\n\n\nBTW, we might wanna review BooleanScorer's internal classes visibility. They are all package-private, with some public methods, however used by BooleanScorer only ... But that's something for a different issue. ",
            "author": "Shai Erera",
            "id": "comment-12693524"
        },
        {
            "date": "2009-03-29T09:31:07+0000",
            "content": "May I change it to BooleanCollector? (the name conflicts with the Collector name we want to give to all base collectors)\n\nMay I change it to private static final? It is used only in BooleanScorer's newCollector() method.\n\nI think these are fine. ",
            "author": "Michael McCandless",
            "id": "comment-12693533"
        },
        {
            "date": "2009-03-30T11:28:53+0000",
            "content": "I think as part of this we should allow TopFieldCollector to NOT get the score of each hit?  EG another boolean to the ctor? ",
            "author": "Michael McCandless",
            "id": "comment-12693729"
        },
        {
            "date": "2009-03-30T11:37:20+0000",
            "content": "I am not sure what you mean - score is used all over the place in collect() as well as other methods. updateBottom for example takes a score, updates bottom.score and then calls adjustTop(). Do you mean that if ignoreScore is true (in ctor), then setScorer should not save the Scorer and not call scorer.score()? If so, what should I do with all the methods that accept score? Create another code path in TopFieldCollector which ignore the score?\n\nAlso, what should the default value be? true (for ignoring scores)? ",
            "author": "Shai Erera",
            "id": "comment-12693732"
        },
        {
            "date": "2009-03-30T12:06:38+0000",
            "content": "Ok I now understand better where score is used in TopFieldCollector ... It is used in a number of places, two important are:\n\n\tMaintain maxScore for returning in TopFieldDocs.\n\tPassed to FieldComparator.compareBottom which takes a doc and score parameters. There is one comparator RelevanceComparator which makes use of the score passed, however that's part of the method signature.\n\tPassed to FieldComparator.copy - again used by RelevanceComparator only.\n\tPassed to updateBottom, which updates the score of the least element in the queue and then calls adjustTop().\n\n\n\n\n\tNumber 2, 3 and 4 can be resolved by adding a setScorer to FieldComparator (as empty implementation) which TopFieldCollector will call in each collect() call, passing the Scorer that was given to it in its setScorer.\n\tThen, we override that in RelevanceComparator, saving the Scorer and using it whenever the score is needed. Of course we'll need to save the current score, so that we don't call score() too many times for the same document.\n\tThis eliminates the need to define on TopFieldCollector whether scores should be saved. The reason is that the Sort parameter may include a SortField.SCORE field, which will invoke the RelevanceComparator.\n\n\n\nThe question is what to do with maxScore? It is needed for TopDocs / TopFieldDocs. It may also be important to know the maxScore of a query, even if you sort it by something which is not a score.\n\nQuestion is - if the steps above make sense, why should we do them at all? \nNow the score is computed and passed on to every FieldComparator we received in Sort. Cleaning the method signature means additional code overhead in RelevanceComparator. If we want to compute maxScore as well, it means the score will be computed twice, once in collect() and once in RelevanceComparator.\n\nWe can solve the double score() computation by using an internal ScoreCacheScorer which keeps the score of the current document and returns it whenever score() is called, unless it's a new document and then it delegates the call to the wrapped Scorer. TopFieldCollector can instantiate it in setScorer.\n\nBut this looks quite a lot for cleaning a method signature, don't you think? Of course if you can suggest how we somehow remove the maxScore computation, then it might be a good change, since only if SortField.SCORE is used, will the score be computed. ",
            "author": "Shai Erera",
            "id": "comment-12693743"
        },
        {
            "date": "2009-03-30T14:12:43+0000",
            "content": "The question is what to do with maxScore? It is needed for TopDocs / TopFieldDocs. \n\nThis is why I was thinking you'd have to tell TopFieldCollector whether or not it should track scores.  Furthermore, even if SortField.SCORE is not in your SortFields, an app may still want the scores to be enrolled in the TopFieldDocs, for presentation.\n\nTurning off scoring in TopFieldCollector's ctor just means 1) TopFieldCollector won't track max score, and 2) TopFieldCollector will leave score at 0 in the returned ScoreDoc array.\n\nNumber 2, 3 and 4 can be resolved by adding a setScorer to FieldComparator (as empty implementation) which TopFieldCollector will call in each collect() call, passing the Scorer that was given to it in its setScorer.\n\n+1\n\nIt makes sense to push the same improvement (not always passing a score; instead, you ask the scorer for score if you need it) down into the FieldCollector API.\n\nWe can solve the double score() computation by using an internal ScoreCacheScorer which keeps the score of the current document and returns it whenever score() is called, unless it's a new document and then it delegates the call to the wrapped Scorer. TopFieldCollector can instantiate it in setScorer.\n\n+1 ",
            "author": "Michael McCandless",
            "id": "comment-12693778"
        },
        {
            "date": "2009-03-30T14:30:34+0000",
            "content": "Turning off scoring in TopFieldCollector's ctor just means 1) TopFieldCollector won't track max score, and 2) TopFieldCollector will leave score at 0 in the returned ScoreDoc array.\n\nJust to be clear - TopDocs as well as TopFieldDocs require a maxScore parameter in their ctor. So are you suggesting to pass something like Float.NaN as maxScore if scoring is turned off? Or introducing a new ctor which does not require maxScore, and defaults to Float.NaN? (or both?)\n\nFurthermore, even if SortField.SCORE is not in your SortFields, an app may still want the scores to be enrolled in the TopFieldDocs, for presentation.\n\nRight - we should separate between getting score out of the FieldComparator API and tracking scores in TFC. If I don't have SortField.SCORE in my list of sort fields, then scorer.score() will not be called at all from the FieldComparators layer.\n\nTracking scores in TFC is what I'm having troubles with. Turning it off does not necessarily improve anything .. Might be, and might not. In setScorer() I'd still need to register Scorer for passing on to FieldComparator. In collect() I'd still need to check whether score tracking is on, and if so, call scorer.score() and track maxScore. Note that if ScoreCacheScorer is used, then calling scorer.score() in collect does not have too much overhead.\n\nAlso, what will be the default from a Lucene perspective? true - i.e., always keep track of scores? ",
            "author": "Shai Erera",
            "id": "comment-12693787"
        },
        {
            "date": "2009-03-30T15:04:23+0000",
            "content": "Or introducing a new ctor which does not require maxScore, and defaults to Float.NaN?\n\nI think that's a good approach, though for TopDocs the ctor should be package private I think (only called from TopFieldDocs' ctor)?  And the javadocs should clearly spell out that this could happen (so people don't get scared on seeing Float.NaN coming back).\n\nTurning it off does not necessarily improve anything .. Might be, and might not. In setScorer() I'd still need to register Scorer for passing on to FieldComparator. In collect() I'd still need to check whether score tracking is on, and if so, call scorer.score() and track maxScore. Note that if ScoreCacheScorer is used, then calling scorer.score() in collect does not have too much overhead.\n\nI think this is an improvement?  (Scorer.score() will not have been called... that's the goal here).\n\nI guess we could also consider making a separate TopFieldCollector (NonScoringTopFieldCollector or some such), instead of sprinkling if statements all over the place.\n\nAlso, what will be the default from a Lucene perspective? true - i.e., always keep track of scores?\n\nGood question... we have the freedom to choose.  Perhaps default to off?  But say clearly in the migration javadocs that you have to set that to true to get same behavior as TSDC? ",
            "author": "Michael McCandless",
            "id": "comment-12693796"
        },
        {
            "date": "2009-03-30T15:52:38+0000",
            "content": "ok I'll add another package-private ctor to TopDocs which does not get maxScore and defaults to NaN, as well as update the javadocs. No back-compat here since the only code that will use it is TFC, which is new.\n\nI think this is an improvement? (Scorer.score() will not have been called... that's the goal here).\n\nWell, if we use ScoreCacheScorer, then this call is really fast, returning immediately and w/o computing the score.\n\nI guess we could also consider making a separate TopFieldCollector (NonScoringTopFieldCollector or some such), instead of sprinkling if statements all over the place.\n\nI always like such approaches. How's that sound:\n\n\tCreate a base NSTFC, which has a protected score member, initialized to 0, and is exactly like the current TFC, only w/o maxScore.\n\tHave TFC extend NSTFC, override collect() and:\n\t\n\t\tSet super.score = scorer.score(). That is required for updateBottom which updates the score on the ScoreDoc in pq.\n\t\tCompute maxScore.\n\t\tCall super.collect().\n\t\tOverride topDocs(start, howMany) to provide one with maxScore.\n\t\n\t\n\n\n\nGood question... we have the freedom to choose. Perhaps default to off? But say clearly in the migration javadocs that you have to set that to true to get same behavior as TSDC?\n\nSo you suggest the methods on IndexSearcher today that take a Sort as parameter will default to NSTFC? As long as we document it it's ok? Are all of these new? ",
            "author": "Shai Erera",
            "id": "comment-12693812"
        },
        {
            "date": "2009-03-30T16:19:08+0000",
            "content": "How's that sound:\n\nThat sounds good!  So to be consistent maybe we create ScoringTopFieldCollector and NonScoringTopFieldCollector?\n\nThis means we don't need ScoreCacheScorer?  (because ScoringTopFieldCollector will always grab the score).  Though how do we change FieldComparator API so as to not pass score around?  All comparators except RelevanceComparator don't use it.\n\nWell, if we use ScoreCacheScorer, then this call is really fast, returning immediately and w/o computing the score.\n\nI'm actually torn on how fast this will be: I think that will be an if statement that's hard for the CPU to predict, which is costly.\n\nSo you suggest the methods on IndexSearcher today that take a Sort as parameter will default to NSTFC? As long as we document it it's ok? Are all of these new?\n\nHmmm... actually, no, I think those must continue to use NSTFC for the existing methods (to remain back compatible), but add a new search method that takes a boolean trackScore? ",
            "author": "Michael McCandless",
            "id": "comment-12693822"
        },
        {
            "date": "2009-03-30T16:59:41+0000",
            "content": "So to be consistent maybe we create ScoringTopFieldCollector and NonScoringTopFieldCollector?\n\nAnd have STFC extend NSTFC? I see no reason to create an abstract TopFieldCollector.\n\nThis means we don't need ScoreCacheScorer? (because ScoringTopFieldCollector will always grab the score). Though how do we change FieldComparator API so as to not pass score around? All comparators except RelevanceComparator don't use it.\n\nI was actually thinking of that class for RelevanceComparator. So perhaps I can implement the logic inside RelevanceComparator? Although this sounds like a nice utility class, now that we have a setScorer on Collector - others may find it useful too.\nRemember that score-tracking is done for maxScore and ScoreDoc purposes (inside STFC). The score in the FieldComparator API is used only in RelevanceComparator, whether it's STFC or NSTFC.\n\nI think those must continue to use NSTFC for the existing methods (to remain back compatible)\n\nDid you mean continue to use STFC? The current behavior is that scoring is tracked, I think.\n\nadd a new search method that takes a boolean trackScore?\n\nI actually prefer not to expose any more methods. IndexSearcher already has plenty of them. Instead, one can use the very generic, simple and useful method search(Query, Collector) and pass in a NSTFC instance. Otherwise we'll end up adding many search() methods to IndexSearcher, if we continue with that approach going forward. ",
            "author": "Shai Erera",
            "id": "comment-12693843"
        },
        {
            "date": "2009-03-30T17:16:42+0000",
            "content": "And have STFC extend NSTFC? I see no reason to create an abstract TopFieldCollector.\n\nYes.\n\nAlthough this sounds like a nice utility class, now that we have a setScorer on Collector - others may find it useful too.\n\nOK I agree, it would be useful to have for general usage (eg chaining collectors).\n\nBut what is the plan now for the FieldComparator API?  We no longer pass score all around, but expose access to scorer, which only RelevanceComparator (in core) will use?\n\nDid you mean continue to use STFC? The current behavior is that scoring is tracked, I think.\n\nSorry, yes, STFC.  Beginning to lose mind...\n\nI actually prefer not to expose any more methods. IndexSearcher already has plenty of them. Instead, one can use the very generic, simple and useful method search(Query, Collector) and pass in a NSTFC instance. Otherwise we'll end up adding many search() methods to IndexSearcher, if we continue with that approach going forward.\n\nI think that'd be OK... the only thing that bothers me is I think the natural default when sorting by field is to not gather the score.  Ie I don't want someone evaluating Lucene in the future to say our field sort is too slow when they didn't realize they had to go use this advanced API that turns off scoring.\n\nWhat if we add a new method, and deprecate the old one?  This way come 3.0 we will not have added any methods, and then when sorting by field you see that you have to choose with or without scores. ",
            "author": "Michael McCandless",
            "id": "comment-12693847"
        },
        {
            "date": "2009-03-31T05:57:49+0000",
            "content": "But what is the plan now for the FieldComparator API? We no longer pass score all around, but expose access to scorer, which only RelevanceComparator (in core) will use?\n\nYes. FieldComparator will have a default empty setScorer() method, which will be overridden by RelevanceComparator. In TopFieldCollector (forget the final name now) setScorer() method we set the Scorer on all FieldComparators. During collect(), only RelevanceComparator, if it exists, will compute the score.\n\nWhat if we add a new method, and deprecate the old one?\n\nThe current methods are:\n\n\tSearchable - search(Weight, Filter, int, Sort)\n\tSearcher - search(Query, Filter, int, Sort)\n\tIndexSearcher - search(Weight, Filter, int, Sort, boolean /* fillFields */)\n\n\n\nDeprecate all three, and add the same but take another boolean as a parameter? I have two comments regarding that:\n\n\tThe current methods need to call the new ones with trackScores = true since that's the current behavior.\n\tWhen we are left with only the new versions, I'm afraid those methods will not look 'simple fast' to a user - I now have to decide whether I want to track scores or not, something I haven't given much thought to before. I kind of like the current signature, but I understand your concern regarding defaults.\n\n\n\nBTW, Searchable is an interface, so we cannot add it there. Searcher is an abstract class and we cannot add the method to it with default implementation (as I believe the other search methods will call the new one with default=true). So it only leaves IndexSearcher as an option. But then what if someone uses MultiSearcher? ParallelMultiSearcher? etc.\n\nIs it possible to deprecate a method, documenting that its runtime behavior will change in 3.0 and then in 3.0 change to not track scores?\n\nIf we're touching TopFieldCollector in such a way, I'd like to propose the following refactoring. It stems from the current complex implementation in collect() which checks in every collect call if we have just one Comparator or Multi, and we're talking about having two versions w/ and w/o score tracking:\n\n\tKeep TopFieldCollector as abstract class with a static create() factory method, and an abstract updateBottom() method. It will still implement topDocs(start, howMany).\n\tHave the factory method create one of 4 instances, all extend TFC, but are private internal classes, which do not concern the user:\n\t\n\t\tOneComparatorNonScoringTopFieldCollector - assumes just one FieldComparator exists as well as scoring should not be tracked.\n\t\tOneComparatorScoringTopFieldCollector - assumes just one FieldComparator exists as well as scoring should be tracked.\n\t\tMultiComparatorNonScoringTopFieldCollector - assumes more than one FieldComparator exists, as well as scoring should not be tracked.\n\t\tMultiComparatorScoringTopFieldCollector - assumes more than one FieldComparator exists, as well as scoring should be tracked.\n\t\n\t\n\n\n\nThe advantages are:\n\n\tWe simplify the API - the user is only aware of TopFieldCollector, and instead of calling a ctor it calls a static create method, which takes all the arguments as the ctor takes.\n\tWe are free to create whatever instance is the right and most optimized one given the input parameters. The user does not care how the instance is called. Hence the long names - they are internal anyway.\n\tThe code is much cleaner and easy to understand. It also does not need to check if we have just one comparator or more in every call to collect.\n\tWe don't need to add a protected score to a NonScoring collector (read above about code readability) just because a Scoring one extends it and will make use of it.\n\n\n\nSince TopFieldCollector is new, we have the freedom to do it right w/o deprecating anything. I think it's a much cleaner design. It is orthogonal to the discussion we're having regarding the search methods and parameters. They will use the create() factory method instead of creating a collector, passing whatever arguments they have. So let's not confuse the two.\n\nThe patch for this issue is ready. As soon as we agree on how to proceed with TFC, I'll add the changes and submit the patch. ",
            "author": "Shai Erera",
            "id": "comment-12693997"
        },
        {
            "date": "2009-03-31T11:17:10+0000",
            "content": "If we're touching TopFieldCollector in such a way, I'd like to propose the following refactoring\n\n+1.  That looks great.\n\nWhen we are left with only the new versions, I'm afraid those methods will not look 'simple fast' to a user \n\nI agree, which is why I'd like in 3.0 for the default to be \"don't score when sorting by fields\".\n\nIs it possible to deprecate a method, documenting that its runtime behavior will change in 3.0 and then in 3.0 change to not track scores?\n\nI think this may in fact be our best option: don't deprecate the method, but document that in 3.0 this method will no longer do scoring.  There is a precedent here: in 3.0, IndexReader.open is going to return readOnly readers by default (vs read/write today).  We have also done similar fixes within a minor release, eg fixes to StandardAnalyzer.  I think there are other things we should do (eg, StopFilter should enable position increment by default, which it doesn't today – LUCENE-1258).  If we do this approach, on committing this issue you should open a new one w/ fix version 3.0 to switch up the default.\n\nI think, with 3.0, if we clearly document in CHANGES, as well as on the particular APIs, the changes to Lucene's defaults, that's sufficient? ",
            "author": "Michael McCandless",
            "id": "comment-12694068"
        },
        {
            "date": "2009-03-31T11:59:26+0000",
            "content": "If we do this approach, on committing this issue you should open a new one w/ fix version 3.0 to switch up the default.\n\nOk then let's do that. I'll add a TODO to these methods that it should be changed in 3.0, and also open another issue. (The TODO is in case I forget to open the issue).\n\nI'll also add documentation to the CHANGES file as well as the API.\n\nOk, I think the patch should be ready soon then. Just need to complete the refactoring to TopFieldCollector. ",
            "author": "Shai Erera",
            "id": "comment-12694074"
        },
        {
            "date": "2009-03-31T15:26:20+0000",
            "content": "When I was about to make the changes to FieldComparator (add setScorer and calling scorer.score() when necessary) I noticed that scorer.score() declares it throws IOException, while the FieldComparatro methods don't. So two ways to handle it:\n\n\tcatch the IOException and ignore it, assuming a 0 score. This is if we think no Scorer will actually throw an IOException.\n\tChange FieldComparator APIs to declare throwing IOE, which will give us flexibility in the future. Since the Lucene code throws IOE in many places, I don't think it's a problem.\n\n\n\nI'm in favor of (2) (I had to add IOE to Collector.collect() for that reason). ",
            "author": "Shai Erera",
            "id": "comment-12694151"
        },
        {
            "date": "2009-03-31T15:31:03+0000",
            "content": "I like 2 as well.  I find reserving that freedom to be very helpful, while preventing it to be a real hassle later on... ",
            "author": "Michael McCandless",
            "id": "comment-12694155"
        },
        {
            "date": "2009-04-01T08:49:56+0000",
            "content": "Eventually I decided to include just one patch file (instead of code and test) since it was simpler after all. Please be sure to review the following:\n\n\tCollector class and documentation.\n\tNew TopDocsCollector class.\n\tTopFieldCollector refactoring.\n\tMethods deprecation.\n\tNew TestTopDocsCollector as well as test cases in TestSort.\n\n ",
            "author": "Shai Erera",
            "id": "comment-12694426"
        },
        {
            "date": "2009-04-01T09:09:45+0000",
            "content": "I just wonder, why HitCollectorWrapper implements:\n\npublic void collect(int doc, float score) {\n    collector.collect(doc + base, score);\n}\n\n\nThis is not needed by Collector abstract class and never called. ",
            "author": "Uwe Schindler",
            "id": "comment-12694432"
        },
        {
            "date": "2009-04-01T09:15:22+0000",
            "content": "oops  leftovers from when it extended MultiReaderHitCollector (now called Collector) ",
            "author": "Shai Erera",
            "id": "comment-12694438"
        },
        {
            "date": "2009-04-01T09:17:19+0000",
            "content": "Shai, it looks like you \"svn copy\"'d MultiReaderHitCollector.java --> Collector.java?  It causes \"patch\" to be confused when applying the patch.  The simple workaround is to pre-copy that file yourself, manually, before appying the patch. ",
            "author": "Michael McCandless",
            "id": "comment-12694439"
        },
        {
            "date": "2009-04-01T09:25:01+0000",
            "content": "oops  leftovers from when it extended MultiReaderHitCollector (now called Collector)\nThis is why we really should move to Java 1.5 soon and its @Override annotation... ",
            "author": "Uwe Schindler",
            "id": "comment-12694442"
        },
        {
            "date": "2009-04-01T09:27:21+0000",
            "content": "I did not do any \"svn copy\", just used Eclipse refactoring to change the name of the class to Collector. I did not understand though from your comment if I should do it differently and post another patch, or is that a hint to how someone can still apply the patch? ",
            "author": "Shai Erera",
            "id": "comment-12694443"
        },
        {
            "date": "2009-04-01T09:34:19+0000",
            "content": "JavaDoc errors:\n\n\tThe Collector javadoc example still contains the score in its collect() method.\n\tThe javadocs of ParallelMultiSearcher's new Collector's \n\npublic void search(Weight weight, Filter filter, final Collector collector)\n\n has still HitCollector in its JavaDocs.\n\n\n\nThis is what I found out when reading the new generated Javadocs. ",
            "author": "Uwe Schindler",
            "id": "comment-12694445"
        },
        {
            "date": "2009-04-01T09:47:02+0000",
            "content": "Thanks Mike. I ran the javadocs task and found other mentions of MultiReaderHitCollector as well as fixed some more javadocs. BTW, the javadoc Ant task outputs many errors on missing files/names, but that something for another issue. ",
            "author": "Shai Erera",
            "id": "comment-12694448"
        },
        {
            "date": "2009-04-01T09:56:08+0000",
            "content": "I'm late to this discussion, so I may have missed something. Is there any provision in the new API for the early termination of hit collection? Currently the (time | count)-limited collectors that are used in Nutch and Solr have to throw RuntimeException to break the loop. It would be much more elegant if the new Collector.collect() had a way to signal the caller that it should stop looping without incurring the cost of throwing an Exception. E.g. by returning a boolean, or setting a flag in the caller. ",
            "author": "Andrzej Bialecki",
            "id": "comment-12694452"
        },
        {
            "date": "2009-04-01T10:01:11+0000",
            "content": "Thanks Mike.\n\nThat was Uwe  ",
            "author": "Michael McCandless",
            "id": "comment-12694455"
        },
        {
            "date": "2009-04-01T10:02:08+0000",
            "content": "Looks great!  Thanks Shai.\n\nMy biggest question/issue is how TopDocsCollector now (still?)\nrequires that the PQ you give it is sorting primarily by score (eg\ngetMaxScore() assumes the max is in the PQ; topDocs() uses\nresults[0]'s score when start == 0).  We've sort of come full circle\n(a \"hidden assumption\" that you are sorting by score was what started\nthe whole thread in the beginning) \n\nWe get away with that with TopFieldCollector because that overrides\nall the score-related processing.\n\nI'm not sure how to cleanly fix this... maybe TopDocsCollector should\nmake maxScore() abstract?  Or... it's as if we need the\nscoring/non-scoring bifurcation up higher (moved out of\nTopFieldCollector to above TopDocsCollector)?\n\nEG say I provide my own PQ that's sorting by date (by loading date\nfrom some external source, say); I may or may not care for score.\n\nMaybe we make a ScoringWrapperCollector that grabs score in its own\ncollect, then calls collect() on its child?\n\nA few other small things:\n\n\n\tIn the private final static classes inside TopFieldCollector, you\n    can make the members final too (eg reverseMul, comparator), in\n    case it helps compiler.\n\n\n\n\n\tCan you add a paragraph @ top of CHANGES stating the pending\n    default swap in 3.0 (ie the same note you added to\n    IndexSearcher.search).  Add a new \"Changes in backwards\n    compatibility policy\" section at the very top (look at how 2.4.0\n    release did it).  And can you give explicit code fragment showing\n    how to get back to the old way (ie show that you must pass in\n    \"true\" for trackDocScores).\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12694456"
        },
        {
            "date": "2009-04-01T10:12:07+0000",
            "content": "It would be much more elegant if the new Collector.collect() had a way to signal the caller that it should stop looping without incurring the cost of throwing an Exception. E.g. by returning a boolean, or setting a flag in the caller.\n\nI agree: we should work into this new collection API a way to stop early.\n\nBut I'm nervous about the cost of checking a returned boolean on every collect call vs the cost of throwing/catching an exception.  Adding the boolean check slows down every single collect() call (by just a bit, but bits really count here), even those that never use stop early (the majority of apps today).   Throwing an exception adds a clear cost when you actually throw & catch it, but presumably that cost is proportionally tiny because you only throw it on searches that have been running for a long time, anyway.\n\nWe could upgrade the exception to a checked exception; then we'd need to add \"throws XXX\" to the search methods in 3.0 (perhaps wrapping as RuntimeException until 3.0).  But then I also wonder if the checked exception logic would add instructions in the collect() path. ",
            "author": "Michael McCandless",
            "id": "comment-12694459"
        },
        {
            "date": "2009-04-01T11:03:57+0000",
            "content": "I think, a checked Exception to stop collecting would be the best. The \"cost\" of the exception is very minimal (it is only thrown once in the collector and catched somewhere at top level). So where would be the costly part? Microseconds per search? ",
            "author": "Uwe Schindler",
            "id": "comment-12694469"
        },
        {
            "date": "2009-04-01T11:23:15+0000",
            "content": "Sorry  – thanks Uwe \n\nOn Wed, Apr 1, 2009 at 1:01 PM, Michael McCandless (JIRA)\n ",
            "author": "Shai Erera",
            "id": "comment-12694474"
        },
        {
            "date": "2009-04-01T11:36:27+0000",
            "content": "I think, a checked Exception to stop collecting would be the best.\n\nI actually think a RuntimeException is better for the following reasons:\n\n\tThe effects of a checked exception added to collect() will not touch IndexSearcher only, but also some Scorer implementations.\n\tThat only exists in the TimeLimitedCollector, which is not instantiated by Lucene code, but rather by my application code. Therefore, reading its javadocs, I know I should wrap the searcher.search with a try-catch. On the other hand, the rest of the Lucene users will not need to do that since they don't use it.\n\tGoing forward, someone may come up with another limiting Collector implementation, for example \"I want to stop collecting and searching as soon as I hit 10 documents\" - what would we do then - add another checked exception?\n\n\n\nMy point is - since such Collectors (at least now) are now instantiated by the search application and not by the Lucene code itself, RuntimeException is as good as checked exception, only they don't require any changes to the methods signature. ",
            "author": "Shai Erera",
            "id": "comment-12694483"
        },
        {
            "date": "2009-04-01T12:03:05+0000",
            "content": "Maybe we make a ScoringWrapperCollector that grabs score in its own collect, then calls collect() on its child?\n\nHow about this:\n\n\tI remove maxScore() completely from TopDocsCollector.\n\tI define newTopDocs to return a TopDocs() w/o a maxScore (like we said, defaulting to Float.NaN). Also change the method signature to receive the start as well as ScoreDoc[] that was collected so far.\n\tTopScoreDocCollector will override it, fetching maxScore and returning a TopDocs.\n\t\n\t\tTopFieldCollector will do the same, but returning TopFieldDocs.\n\t\n\t\n\n\n\nCan you add a paragraph @ top of CHANGES stating the pending default swap in 3.0\n\nDone.\n\nIn the private final static classes inside TopFieldCollector, you can make the members final too\n\nDone. ",
            "author": "Shai Erera",
            "id": "comment-12694494"
        },
        {
            "date": "2009-04-01T12:06:32+0000",
            "content": "Includes the latest comments from Mike. ",
            "author": "Shai Erera",
            "id": "comment-12694496"
        },
        {
            "date": "2009-04-01T12:37:23+0000",
            "content": "How about this:\n\nOK that looks good!\n\nThough we now don't have a single shared ancestor class that can give\nyou a maxScore() when sorting by score or when sorting by fields.  Not\nsure how big a loss that is though...\n\nMore comments:\n\n\n\tShould we implement a default\n    TopDocsCollector.collect/setScorer/setNextReader?  Ie,\n    TopDocsCollector is supposed to be the \"you provide the PQ and we\n    do the rest\" collector, most closely matching TopDocCollector.\n    Or.... maybe we don't, because we don't know if we should compute\n    the score for you, you may want to put something other than\n    ScoreDoc into the queue, etc.  Who knows what your class\n    considers \"top\".\n\n\n\n\n\tWhat happened to OnlyPositiveScoresFilter?  (I don't see it).\n\n\n\n\n\tIt's a bit of a trap on calling either topDocs method in\n    TopDocsCollector (or its subclasses) that it has popped everything\n    from your PQ as a side-effect.  This is technically a pre-existing\n    issue, but the new bracketed version makes the trap more \"trappy\".\n    For example, I can't call it N times once for each page – I have\n    to re-run the search to get another page's worth of results.  Can\n    you update javadocs eg something like \"NOTE: you cannot call this\n    method more than once\" .\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12694502"
        },
        {
            "date": "2009-04-01T12:44:24+0000",
            "content": "I did not understand though from your comment if I should do it differently and post another patch, or is that a hint to how someone can still apply the patch?\n\nThe patch command gets confused because it sees set of diffs against what looks to be a pre-existing Collector.java, but of course I have no Collector.java locally.  \"svn diff\" did this because it knows you had renamed MRHC --> C.\n\nI think for now it's fine if those of us that need to apply the patch simply first copy MultiReaderHitCollector.java --> Collector.java.\n\nThis is yet another example of how \"patch\" needs to be better integrated with svn: there needs to be a mirror \"svn patch\" to \"svn diff\" that's able to properly carry over all svn changes, perhaps do a 3way merge, etc. ",
            "author": "Michael McCandless",
            "id": "comment-12694505"
        },
        {
            "date": "2009-04-01T13:20:11+0000",
            "content": "Though we now don't have a single shared ancestor class that can give you a maxScore() when sorting by score or when sorting by fields\n\nI don't think it's a big issue. We have just two extensions to TopDocsCollector, each tracking maxScore differently. Perhaps later on if more extensions are created, or a demand comes from users, we add a ScoringTopDocsCollector class?\n\nShould we implement a default TopDocsCollector.collect/setScorer/setNextReader?\n\nI actually think that TopDocsCollector gives you exactly what I had in mind. When I started it, there was only collect(doc, score) method, and I wanted to have a base class that will implement getTotalHits and topDocs for you, while you only need to provide an implementation to collect(). Now collect has really become setNextReader, setScorer and collect. Meaning, you know what you want to do, TDC just takes care of creating the TopDocs for you, and you can even override topDocs(start, howMany) if you want to return a different TopDocs instance.\n\nI think now it's clean and simple.\n\nWhat happened to OnlyPositiveScoresFilter? (I don't see it).\n\nWell ... you don't see it because I forgot to implement it .\nFunny thing - all the tests pass without it, meaning all that time, we were filtering <= 0 scored documents, but never really tested it ... I guess if it's because we never really believed it'll happen?\n\nAnyway, I'll add such a class and a suitable test class (make sure it fails w/o using that wrapper first).\n\nCan you update javadocs eg something like \"NOTE: you cannot call this method more than once\" .\n\nThat has always been the case. Previously if you called topDocs() everything has been popped out of the queue for you. I understand what you say though, since we have the topDocs(start, howMany) API, nothing prevents a user from calling topDocs(0, 10) and topDocs(10, 10), only the second call will fail. However, I don't really think that's how people will use it ... and if they do, then perhaps they should just call topDocs() and do whatever they need on these ranges using the TopDocs object?\nI'll add that to the documentation as well. ",
            "author": "Shai Erera",
            "id": "comment-12694519"
        },
        {
            "date": "2009-04-01T13:51:35+0000",
            "content": "Adds:\n\n\tPositiveScoresOnlyCollector and TestPositiveScoresOnlyCollector.\n\tRelevant comments in CHANGES\n\tComments to TopDocsCollector.topDocs(start, howMany) and topDocs(start)\n\n ",
            "author": "Shai Erera",
            "id": "comment-12694531"
        },
        {
            "date": "2009-04-01T15:59:03+0000",
            "content": "\nFunny thing - all the tests pass without it, meaning all that time, we were filtering <= 0 scored documents, but never really tested it\n\nHmmm!\n\nI actually think that TopDocsCollector gives you exactly what I had in mind.\n\nOK let's keep the current approach.\n\nPerhaps later on if more extensions are created, or a demand comes from users, we add a ScoringTopDocsCollector class?\n\nOK.\n\nI think patch looks good – I don't have any more comments now. ",
            "author": "Michael McCandless",
            "id": "comment-12694595"
        },
        {
            "date": "2009-04-01T16:07:49+0000",
            "content": "I think patch looks good - I don't have any more comments now.\n\nGreat !\n\nWill you be committing it (perhaps after we give some more time for people to review it)? ",
            "author": "Shai Erera",
            "id": "comment-12694600"
        },
        {
            "date": "2009-04-01T16:17:40+0000",
            "content": "Will you be committing it (perhaps after we give some more time for people to review it)?\n\nYes... but let's let it age some so others can review.  Plus, I find coming back and looking at something again after just a couple of days results in a fresh perspective. ",
            "author": "Michael McCandless",
            "id": "comment-12694603"
        },
        {
            "date": "2009-04-01T16:28:47+0000",
            "content": "Shai, some contrib tests fail to compile (still using MultiReaderHitCollector), eg:\n\n\n[javac] /lucene/lucene.collector/contrib/miscellaneous/src/test/org/apache/lucene/index/TestFieldNormModifier.java:26: cannot find symbol\n[javac] symbol  : class MultiReaderHitCollector\n[javac] location: package org.apache.lucene.search\n[javac] import org.apache.lucene.search.MultiReaderHitCollector;\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12694608"
        },
        {
            "date": "2009-04-01T20:27:14+0000",
            "content": "Perhaps you can help me here - I tried to run the test Ant task and all\ntests passed. Then it got to building contrib's db and failed on sleepycat\nwith a major/minor version 49.0. Does this require Java 1.5? Should I run\nthe task with a 1.5 JDK?\nThe task stopped at this point with a BUILD FAILED message and did not\ncontinue to other modules.\n\nI don't have the entire contrib in my build path, only a handful of them\nwhich were not affected by these changes. Anyway, I'll take a look at it\ntomorrow and submit another patch.\n\nOn Wed, Apr 1, 2009 at 7:29 PM, Michael McCandless (JIRA)\n ",
            "author": "Shai Erera",
            "id": "comment-12694719"
        },
        {
            "date": "2009-04-02T00:52:53+0000",
            "content": "Does this require Java 1.5? Should I run the task with a 1.5 JDK?\n\nYes, likely contrib/db (and others) require 1.5.\n\nYou should be able to just do \"ant test-contrib\" in the toplevel dir. ",
            "author": "Michael McCandless",
            "id": "comment-12694849"
        },
        {
            "date": "2009-04-02T06:49:05+0000",
            "content": "Fixed TestFieldNormModifier and TestLengthNormModifier.\nAll tests pass now (including contrib) ",
            "author": "Shai Erera",
            "id": "comment-12694895"
        },
        {
            "date": "2009-04-02T08:58:39+0000",
            "content": "Could you also run \"ant test-tag\" (which tests JAR-drop-in back-compatibility)?  EG I'm getting this compilation error:\n\n[javac] /lucene/src/lucene.collection/tags/lucene_2_4_back_compat_tests_20090320/src/test/org/apache/lucene/search/TestTimeLimitedCollector.java:136: incompatible types\n[javac] found   : org.apache.lucene.search.TimeLimitedCollector\n[javac] required: org.apache.lucene.search.HitCollector\n[javac]     return res;\n[javac]            ^\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12694919"
        },
        {
            "date": "2009-04-02T09:22:55+0000",
            "content": "I thought that ant test runs all tests. Thanks for the education.\n\nThe reason is that TimeLimitedCollector now extends Collector, which does not extend HitCollector. Therefore the method attempts to return an invalid type. I'm not sure how to fix it, because I cannot change the 2.4 test code, since Collector is not there.\n\nSo the only reasonable solution I see here is to:\n\n\tChange TimeLimitedCollector to extend HitCollector, document that in 3.0 it will change to extend Collector and that in the meantime use HitCollectorWrapper if you want.\n\tComment out all the Collector related methods, including the new ctor, with a TODO to reenstate in 3.0.\n\tFix the TestTimeLimitedCollector wrap it with a HCW as well as using only HitCollector as the wrapped collector.\n\n\n\nOther solutions which I don't like are:\n\n\tdeprecate TLC and create a new one NewTimeLimitedCollector - I hate the name \n\tHave Collector extend HitCollector - I hate to even consider that.\n\n\n\nWhat do you think? ",
            "author": "Shai Erera",
            "id": "comment-12694927"
        },
        {
            "date": "2009-04-02T09:43:36+0000",
            "content": "I thought that ant test runs all tests. Thanks for the education.\n\nProbably, it should.  I'll raise this on java-dev.\n\nChange TimeLimitedCollector to extend HitCollector, document that in 3.0 it will change to extend Collector and that in the meantime use HitCollectorWrapper if you want.\n\nI think I like this solution best (though this is very much a lesser of all evils situation).\n\n<lament>\nAhh the contortions we must go through because of Lucene's success.  Marvin over on Lucy can happily make major changes without batting an eye. The sad reality is that the ongoing growth rate of a thing is inversely proportional to its popularity.\n</lament> ",
            "author": "Michael McCandless",
            "id": "comment-12694938"
        },
        {
            "date": "2009-04-02T11:54:30+0000",
            "content": "Changes:\n\n\tTimeLimitedCollector, TestTimeLimitedCollector and CHANGES.\n\tI also fixed a bug in TestTermScorer, which was discovered by the test-tag task, and existed since 1483 and propagated into HitCollectorWrapper as well: docBase was set to -1 by default, relying on setNextReader to be called. However if it's not called (as in TestTermScorer, or if someone called Scorer.score(Collector)), all document Ids are shifted backwards by 1. The test had a bug which asserted on the unshifted doc Id, and after I fixed the Ids to shift, it failed. Anyway, the test now works correctly, as well as HCW.\n\tI checked all other Collector implementations and changed the default base to 0, unless in some test cases, where -1 had a meaning.\n\n\n\nAll tests (contrib, core and tags) pass. ",
            "author": "Shai Erera",
            "id": "comment-12694972"
        },
        {
            "date": "2009-04-02T19:15:34+0000",
            "content": "Super, all tests pass for me too... ",
            "author": "Michael McCandless",
            "id": "comment-12695098"
        },
        {
            "date": "2009-04-03T11:24:18+0000",
            "content": "I've been thinking about TimeLimitedCollector and the revert to extend HitCollector I had to do in the last patch - the main reason was that I couldn't find a better name and did not want to deprecate it. But then, I thought that perhaps the current name is not so good, and we can change it? Syntactically, it is not a 'limited' collector, but more of a 'limiting' collector (I think, not being a native English speaker I may be wrong).\nAlternative names I've been thinking about are TimeKeeperCollector, TimeLimitingCollector, TimingOutCollector.\nThe advantage is that we deprecate the current one and have a clear back-compat support, instead of changing it in 3.0 to extend Collector. If you agree with any of these names I can create a new class, deprecate the current one, change the tests back to use the new version (and remove all those comments about the changes in 3.0). What do you think? ",
            "author": "Shai Erera",
            "id": "comment-12695338"
        },
        {
            "date": "2009-04-03T12:12:00+0000",
            "content": "If you agree with any of these names I can create a new class, deprecate the current one, change the tests back to use the new version (and remove all those comments about the changes in 3.0). What do you think?\n\nI like this approach.  I like \"TimeLimitingCollector\", or maybe \"TimeoutCollector\"? ",
            "author": "Michael McCandless",
            "id": "comment-12695358"
        },
        {
            "date": "2009-04-03T12:13:30+0000",
            "content": "\nOK, I attached a new patch with some minor changes:\n\n\n\tBeefed up javadocs in Collector.java; fixed other javadocs\n    warnings.  Tweaked CHANGES.txt.\n\n\n\n\n\tRenamed PositiveOnlyScoresCollector -->\n    PositiveScoresOnlyCollector\n\n\n\nAnd also came across these questions/issues:\n\n\n\tTopFieldCollector's updateBottom & add methods take score, and are\n    passed score from the non-scoring collectors, but shouldn't?\n\n\n\n\n\tTermScorer need not override score(HitCollector hc) (super does\n    the same thing).\n\n\n\n\n\tThe changes to TermScorer make me a bit nervous.  EG, the new\n    InternalScorer: will it hurt performance?  Also this part:\n\n+        // Set the Scorer doc and score before calling collect in case it will be\n+        // used in collect()\n+        s.d = doc;\n+        s.score = score;\n+        c.collect(doc);                      // collect score\n\n\nis spooky: I don't like how we worry that one may call scorer.doc() (I\ndon't like the ambiguity in the API – we both pass doc and fear you\nmay call scorer.doc()).  Not sure how to resolve it.\n\n\n\n\n\tHmm – we added a new abstract method to\n    src/java/org/apache/lucene/search/Searcher.java (that accepts\n    Collector).  Should that method be concrete (and throw UOE), for\n    back compat?\n\n\n\n\n\tWe've also added a method to the \"Searchable\" interface, which is\n    a break in back-compat.  But my feeling is we should allow this\n    break (but Shai can you add another Note at the top of\n    CHANGES.txt, calling this out?).\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12695359"
        },
        {
            "date": "2009-04-03T16:32:57+0000",
            "content": "I like \"TimeLimitingCollector\", or maybe \"TimeoutCollector\"?\n\nI like TimeLimitingCollector better, as I think the name makes the class more self explanatory.\n\nTopFieldCollector's updateBottom & add methods take score, and are passed score from the non-scoring collectors, but shouldn't?\n\nAt the end of the day, even the non-scoring collectors store a score in ScoreDoc, which is Float.NaN. So they should pass a score. Unlike the scoring ones, they always pass Float.NaN without ever calling scorer.score(). That's the cleanest way I've found I can make the changes to that class, w/o duplicating implementation all over the place. Notice that the scoring versions extend the non-scoring, and just add score computation, which resulted in a very clean implementation.\n\nTermScorer need not override score(HitCollector hc) (super does the same thing).\n\nAgreed.\n\nThe changes to TermScorer make me a bit nervous.\n\nSince we pass Sorer to Collector, I thought we cannot really rely on anyone not calling scorer.doc() or getSimilarity ever - it is in the API. Since doc() is abstract, I had to implement it and just thought that retuning the current doc is better than -1 for example. There are some alternatives I see to resolve it:\n\n\tCreate an abstract ScoringOnlyScorer which extends Scorer and implements all methods to throw UOE (also as final), besides score() which it will define abstract. We then define a ScoringOnlyScorerWrapper which takes a Scorer and delegates the score() calls. We use SOSW in places where we can't extend SOS. Where we can, we just extend it directly and implement score(), like in the InternalScorer case.\n\tCreate a new class which implements just score() (I've yet to come with a good name since Scorer is already taken) and create a wrapper which takes a Scorer and delegates the score() calls to it. Then Collector will use that new class, and we're sure that only score() can be called.\n\n\n\nThe last two comments are completely an overlook by my side. I'm not so sure about your proposal though. If we add to Searcher a concrete impl which throws UOE, how would that work in 3.0? How would anyone who extends Searcher know that it has to extend this method? Maybe do it now, and document that in 3.0 it will become abstract again?\nAbout Searchable, I wonder how many do implement Searchable, rather than extend IndexSearcher. Perhaps instead of making any changes in back-compat and add documentation to CHANGES I'll just comment out this method with a TODO to re-enstate in 3.0? ",
            "author": "Shai Erera",
            "id": "comment-12695478"
        },
        {
            "date": "2009-04-03T17:38:07+0000",
            "content": "I like TimeLimitingCollector better, as I think the name makes the class more self explanatory.\n\nOK let's go with that!\n\n\nAt the end of the day, even the non-scoring collectors store a score in ScoreDoc, which is Float.NaN. So they should pass a score. Unlike the scoring ones, they always pass Float.NaN without ever calling scorer.score(). That's the cleanest way I've found I can make the changes to that class, w/o duplicating implementation all over the place. Notice that the scoring versions extend the non-scoring, and just add score computation, which resulted in a very clean implementation.\n\nOK... let's stick with this approach for now.  Since the impl is\nlocked down (ctor for TopFieldCollector is private) we can freely\nswitch up this API in the future without breaking back compat, if we\nwant to optimize not passing/copying around the unused score.\n\nCan't the scoring collector impls in TopFieldCollector be final?\n\nSince we pass Sorer to Collector, I thought we cannot really rely on anyone not calling scorer.doc() or getSimilarity ever\n\nMaybe instead make InternalScorer non-static, and then doc() can\nreturn the doc from the TermScorer instance, instead of having to copy\n\"s.d = doc\" each time?  score can do a similar thing.\n\nActually, hang on: if I'm using a Collector that doesn't need the\nscore, TermScoring is still computing it?  We don't want that right?\nCan we simply pass \"this\" to setScorer(...)?\n\nIf we add to Searcher a concrete impl which throws UOE, how would that work in 3.0? How would anyone who extends Searcher know that it has to extend this method? Maybe do it now, and document that in 3.0 it will become abstract again?\n\nOK let's do that?\n\nAbout Searchable, I wonder how many do implement Searchable, rather than extend IndexSearcher. Perhaps instead of making any changes in back-compat and add documentation to CHANGES I'll just comment out this method with a TODO to re-enstate in 3.0?\n\nOK.\n\nMake sure at the end of all of this, you open a new issue, marked as\nfix version 3.0, that has all the \"and then on 3.0 we do XYZ\"s from\nthis. ",
            "author": "Michael McCandless",
            "id": "comment-12695513"
        },
        {
            "date": "2009-04-03T18:25:58+0000",
            "content": "Can't the scoring collector impls in TopFieldCollector be final?\n\nThey can, but they are private so they cannot be extended anyway. I can do that, but does it really matter?\n\nWe don't want that right? Can we simply pass \"this\" to setScorer(...)?\n\nThat's what I wanted to do, but then noticed that TermScorer.score() method is a bit different. However, now that I look at it again, I wonder if they are different. The difference is that in score(), it does at the end\n\nreturn raw * Similarity.decodeNorm(norms[doc]);\n\n\nand in score(Collector, int) it does\n\nfloat[] normDecoder = Similarity.getNormDecoder();\n...\nscore *= normDecoder[norms[doc] & 0xFF];\n\n\n\nLooking in Similarity.decodeNorm, it does exactly what's done in score(Collector, int). So I guess this code has been duplicated for no good reason? Please validate what I wrote and if you also agree, I can change the entire method (score(Collector, int)) to not compute any score and call c.setScorer(this). That will solve it.\n\nSo are you ok with passing Scorer to Collector, instead of just a class with a single score() method?\n\nI will open an issue w/ a fix version 3.0 and take care of all those TODOs. Should the issue also get rid of the deprecated methods? Or will we have a general issue in 3.0 that removes all deprecated methods? ",
            "author": "Shai Erera",
            "id": "comment-12695523"
        },
        {
            "date": "2009-04-03T18:39:37+0000",
            "content": "BTW Mike - I think the accidental changes to Searchable and Searcher could have been easily detected by test-tags if we had classes in the back-compat tag which implemented interfaces / extended abstract classes with empty implementations. These are not really junit tests, but if someone would have changed an interface or abstract class, then attempting to compile the test package against the trunk would fail.\n\nIt is not so relevant now, since the next release is 2.9 following by a 3.0 and back-compat will completely go away in 3.0, but perhaps post 3.0? Also, it will prevent us from making changes to back-compat like we wanted to in this issue, but perhaps it's good? ",
            "author": "Shai Erera",
            "id": "comment-12695525"
        },
        {
            "date": "2009-04-03T19:01:12+0000",
            "content": "\nI ran a \"first do no harm\" perf test, comparing trunk with this patch:\n\n\n\n\nquery\nsort\nhits\nqps\nqpsnew\npctg\n\n\n147\nscore\n   6953\n3631.1\n3641.8\n  0.3%\n\n\n147\ntitle\n   6953\n2916.7\n2255.6\n-22.7%\n\n\n147\ndoc\n   6953\n3251.2\n2676.8\n-17.7%\n\n\ntext\nscore\n 157101\n 208.1\n 202.1\n -2.9%\n\n\ntext\ntitle\n 157101\n  96.7\n  84.8\n-12.3%\n\n\ntext\ndoc\n 157101\n 174.0\n 115.2\n-33.8%\n\n\n1\nscore\n 565452\n  58.0\n  56.4\n -2.8%\n\n\n1\ntitle\n 565452\n  44.5\n  34.1\n-23.4%\n\n\n1\ndoc\n 565452\n  49.2\n  32.8\n-33.3%\n\n\n1 OR 2\nscore\n 784928\n  14.1\n  13.7\n -2.8%\n\n\n1 OR 2\ntitle\n 784928\n  12.5\n  11.5\n -8.0%\n\n\n1 OR 2\ndoc\n 784928\n  13.0\n  11.9\n -8.5%\n\n\n1 AND 2\nscore\n 333153\n  15.5\n  15.5\n  0.0%\n\n\n1 AND 2\ntitle\n 333153\n  14.8\n  13.7\n -7.4%\n\n\n1 AND 2\ndoc\n 333153\n  15.2\n  14.2\n -6.6%\n\n\n\n\n\nLooks like:\n\n\n\tSort by relevance got maybe a tad slower (~3%)\n\n\n\n\n\tSort by field is now quite a bit slower (23-33% on term query '1')\n\n\n\nThis was on a full wikipedia index, with 14 segments, Sun java\n1.6.0_07 on OS X Mac Pro quad core, on Intel X25M 160 GB\nSSD.\n\nI think we need to iterate some to try to get some performance back. ",
            "author": "Michael McCandless",
            "id": "comment-12695537"
        },
        {
            "date": "2009-04-03T19:21:03+0000",
            "content": "\n> Can't the scoring collector impls in TopFieldCollector be final?\n\nThey can, but they are private so they cannot be extended anyway. I can do that, but does it really matter?\n\nI was thinking in case it eeks performance.\n\nSo I guess this code has been duplicated for no good reason?\n\nDuplicated for performance I think.\n\nI can change the entire method (score(Collector, int)) to not compute any score and call c.setScorer(this). That will solve it.\n\nI think we should try this?\n\nSo are you ok with passing Scorer to Collector, instead of just a class with a single score() method?\n\nGood question... I'm not sure.  It would be cleaner to expose only\nscore() (and I think we could add methods over time), but then we'll\nbe creating new instance per segment per search which'll only slow\nthings down.\n\nI will open an issue w/ a fix version 3.0 and take care of all those TODOs. Should the issue also get rid of the deprecated methods? Or will we have a general issue in 3.0 that removes all deprecated methods?\n\nYou don't need to enumerate deprecated methods to get rid of – we\nwon't forget those ones  It's these other \"special\" tasks that may\nslip through the cracks. ",
            "author": "Michael McCandless",
            "id": "comment-12695541"
        },
        {
            "date": "2009-04-03T19:24:57+0000",
            "content": "BTW Mike - I think the accidental changes to Searchable and Searcher could have been easily detected by test-tags if we had classes in the back-compat tag which implemented interfaces / extended abstract classes with empty implementations. These are not really junit tests, but if someone would have changed an interface or abstract class, then attempting to compile the test package against the trunk would fail.\n\nI think that's a great idea!  Every interface/abstract class should\nhave a \"just compile me\" subclass in the tests.\n\nIt is not so relevant now, since the next release is 2.9 following by a 3.0 and back-compat will completely go away in 3.0, but perhaps post 3.0?\n\nIt is relevant because neither Searchable nor Searcher are deprecated\n(yet)?  Ie during development of 2.9 and of 3.0 we have to ensure we\ndon't break back compat of non-deprecated APIs.\n\nSo maybe fold this in on the next patch iteration?\n\nAlso, it will prevent us from making changes to back-compat like we wanted to in this issue, but perhaps it's good?\n\nIt's good, because it'd raise the issue right way vs us catching it or\nnot by staring at the code  ",
            "author": "Michael McCandless",
            "id": "comment-12695543"
        },
        {
            "date": "2009-04-03T20:02:31+0000",
            "content": "Something related to time limiting collectors we may want to\nsolve (maybe not in this patch) is passing the time limiting to\nthe sub-scorers. At the hit collector level the sub-scorers of a\nmulti clause query could be busy exceeding the time limit before\nreturning the first doc hit? ",
            "author": "Jason Rutherglen",
            "id": "comment-12695553"
        },
        {
            "date": "2009-04-03T20:59:14+0000",
            "content": "\n\nHow do I run such a test? Is there an algorithm for that in the benchmark\npackage?\n\nI compared the new TSDC to the trunk's version and the new code does ('-'\nmeans a negative change, '+' means a positive change, '|' means\nneither/undetermined):\n\n\tadds one collector.setScorer() call to each query. \n\tThe scorer.score() call in collect() was just moved from whoever called\ncollect() to inside collect(), so I don't think there's a difference. (|)\n\tDoes not check if score > 0.0f in each collect \n\timplements the new topDocs() method. Previously, it just implemented\ntopDocs() which returned everything. Now, topDocs() calls topDocs(0,\npq.size()), which verifies parameters and such - since that's executed once\nat the end of the search, I doubt that it has any effect major effect on the\nresults.\n\n\n\nBTW, as I scanned through the code I noticed that previously TSDC returned\nmaxScore = Float.NEGATIVE_INFINITY in case there were 0 results to the\nquery, and now it returns Float.NaN. I'm not sure however if this breaks\nanything, since maxScore is probably used (if at all) for normalization of\nscores, and in case there are 0 results you don't really have anything to\nnormalize? However I'm not sure ...\n\nRegarding TopFieldDocs I am quite surprised. I assume the test uses the\nOneComparatorScoringCollector, which means scores are computed:\n\n\tIt has the same issue as in TSDC regarding topDocs(). So I think it should\nbe changed here as well, however I doubt that's the cause for the\nperformance hit.\n\tIt computes the score and then does super.collect(), which adds a method\ncall \n\tIt doesn't check if the score is > 0 \n\tIt calls comparator.setScorer, which is ignored in all comparators besides\nRelevanceComparator. Not sure if it has any performance effects (|)\nThe rest of the code in collect() is exactly the same.\n\n\n\nCan it be that super.collect() has such an effect? When I think on the\nresults of TSDC (-3%) vs. TFC (-28% on avg.), I think it might be since\nsetScorer() is called once before the series of collect() calls, however\nsuper.collect() is called for every document. Your index is large (>2M\ndocuments, right?) and I don't know how many results are for each query, if\nthey are in the range of 100Ks, then that could be the explanation.\n\nMike - in case it's faster for you to run it, can you try to run the test\nagain with a change in the code which inlines super.collect() into\nOneComparatorScoringCollector and compare the results again? I will run it\nalso after you tell me which algorithm you used, but only tomorrow morning,\nso if you get to do it before then, that'd be great.\n\nI doubt that the change in topDocs() affects the query time that much, since\nit's called at the end of the search, and doing 4-5 'if' statements is\nreally not that expensive (I mean once per the entire search), comparing to\nScoreDoc[] array allocation, fetching Stored fields from the index etc. So\nI'd hate to implement all 3 topDocs() in each of the TopDocsCollector\nextensions unless it proves to be a problem.\n\nShai\n\nOn Fri, Apr 3, 2009 at 10:02 PM, Michael McCandless (JIRA)\n<jira@apache.org>wrote:\n ",
            "author": "Shai Erera",
            "id": "comment-12695575"
        },
        {
            "date": "2009-04-03T21:31:14+0000",
            "content": "BTW, I can change FieldValueHitQueue like I changed TopFieldCollector by\nintroducing a factory create() method which will return a\nOneComparaterFieldValueHitQueue and MultiComparatorsFieldValueHitQueue.\nToday, FVHQ.lessThan checks the numComparators in each call, which is\nredundant.\n\nAlso the class isn't final and I'm not sure if we want to change it.\n\nWhat do you think?\n\n ",
            "author": "Shai Erera",
            "id": "comment-12695595"
        },
        {
            "date": "2009-04-04T06:07:27+0000",
            "content": "Mike - about your comments on the new Searcher and Searchable search(Weight, Filter, Collector). I think that best (if not only) option currently is to remove them from the interface (comment out I mean) with a TODO to add in 3.0.\n\nI tried to just comment out in Searchable, and empty impl in Searcher which throws UOE. However that caused a problem in in MultiSearcher, ParallelMultiSearcher and RemoteSearchable:\n\n\tRemoteSearchable impls Searchable - commenting out the new impl method with a TODO for 3.0 will be fine, but\n\tMS and PMS accept Searchable in their ctor and use them in search(W, F, C) which they extend from Searcher (they MUST extend it because Searcher's throws UOE). However they call searchable.search, which accepts just a HC, and we can't wrap a Collector with a HC.\n\n\n\nPreviously, MS and PMS implemented the HC version by always wrapping with a MRHC. I think we should just pass in the given HC to the Searchable.search method, and rely on its wrapping by a HCW later on. In 3.0 we'll delete it entirely and use the Collector implementation.\n\nDo you see any other way? ",
            "author": "Shai Erera",
            "id": "comment-12695674"
        },
        {
            "date": "2009-04-04T06:51:14+0000",
            "content": "Oh wait .. I should have tried to implement it before I sent the last email.\n\nAfter I tried to implement it, I noticed that commenting out the\nSearcher.search(W, F, C) method creates a chain of compilation errors, since\nall the HC methods now call the Collector one (actually all the search()\nmethods call that one eventually). So I'm not sure it's a good idea to\ncomment it out. I thought to comment out all the Collector search methods in\nSearcher, but then it resulted in compilation errors in other places.\n\nHow problematic is this break in back-compat, given it will be documented in\nCHANGES?\n\n\tHave search(W, F, C) on Searchable? I don't think it will have such a\ngreat impact as I don't believe too many actually implement Searchable.\n\tHave search(W, F, C) on Searcher as abstract? I know you offered, Mike, to\ncreate an empty impl which throws UOE, but I'm not sure what's worse: having\na compilation error or UOE at runtime (which can happen at the customer's).\nAfter all, all the search methods call this one eventually, and if you did\nextend Searcher (rather than IndexSearcher), you'll get UOE on every search.\n\n\n\n ",
            "author": "Shai Erera",
            "id": "comment-12695677"
        },
        {
            "date": "2009-04-04T09:40:58+0000",
            "content": "I'm attaching the Python scripts I use to run the tests.  You also need this small mod:\n\n\nIndex: contrib/benchmark/src/java/org/apache/lucene/benchmark/byTask/tasks/ReadTask.java\n===================================================================\n--- contrib/benchmark/src/java/org/apache/lucene/benchmark/byTask/tasks/ReadTask.java\t(revision 761709)\n+++ contrib/benchmark/src/java/org/apache/lucene/benchmark/byTask/tasks/ReadTask.java\t(working copy)\n@@ -63,6 +63,9 @@\n     super(runData);\n   }\n \n+  // nocommit\n+  static boolean first = true;\n+\n   public int doLogic() throws Exception {\n     int res = 0;\n     boolean closeReader = false;\n@@ -101,6 +104,11 @@\n         } else {\n           hits = searcher.search(q, numHits);\n         }\n+        // nocommit\n+        if (first) {\n+          System.out.println(\"NUMHITS=\" + hits.totalHits);\n+          first = false;\n+        }\n         //System.out.println(\"q=\" + q + \":\" + hits.totalHits + \" total hits\"); \n \n         if (withTraverse()) {\n\n\n\nAll the python scripts do is write an alg, run it, gather the results, and collate in the end.  You run sortBench5.py once on trunk and once in a checkout with this patch, each time in the contrib/benchmark directory.  It saves a pickle file (results.pk) which sortCollate5.py then loads (you'll have to edit the hardwired paths in sortCollate5.py). ",
            "author": "Michael McCandless",
            "id": "comment-12695697"
        },
        {
            "date": "2009-04-04T09:49:15+0000",
            "content": "adds one collector.setScorer() call to each query. \n\nActually, it's one setScorer() call per segment (my index had 14\nsegments).  But I can't imagine this slows things down.\n\nThe scorer.score() call in collect() was just moved from whoever called collect() to inside collect(), so I don't think there's a difference. (|)\n\nI would think so, though, maybe the compiler can no longer inline the\ncall.  We may need to peek at the asm.\n\nDoes not check if score > 0.0f in each collect implements the new topDocs() method.\n\nYes, should be a speedup.\n\n\nPreviously, it just implemented topDocs() which returned everything. Now, topDocs() calls topDocs(0,\npq.size()), which verifies parameters and such - since that's executed once\nat the end of the search, I doubt that it has any effect major effect on the\nresults.\n\nI agree.\n\n\nBTW, as I scanned through the code I noticed that previously TSDC returned\nmaxScore = Float.NEGATIVE_INFINITY in case there were 0 results to the\nquery, and now it returns Float.NaN. I'm not sure however if this breaks\nanything, since maxScore is probably used (if at all) for normalization of\nscores, and in case there are 0 results you don't really have anything to\nnormalize? However I'm not sure ...\n\nHmm good question.  Float.NAN seems more correct, so let's stick with\nthat?\n\n\nRegarding TopFieldDocs I am quite surprised. I assume the test uses the\nOneComparatorScoringCollector, which means scores are computed:\n\nYes, and we need to test multiple field sorting too. \t\n\n\nIt has the same issue as in TSDC regarding topDocs(). So I think it should\nbe changed here as well, however I doubt that's the cause for the\nperformance hit.\n\nWhat should be changed here?\n\nIt computes the score and then does super.collect(), which adds a method call \n\nYes.\n\nIt doesn't check if the score is > 0 \n\nShould be faster.\n\nIt calls comparator.setScorer, which is ignored in all comparators besides RelevanceComparator. Not sure if it has any performance effects (|)\n\nShouldn't have an effect.\n\n\nThe rest of the code in collect() is exactly the same.\nCan it be that super.collect() has such an effect? When I think on the\nresults of TSDC (-3%) vs. TFC (-28% on avg.), I think it might be since\nsetScorer() is called once before the series of collect() calls, however\nsuper.collect() is called for every document. Your index is large (>2M\ndocuments, right?) and I don't know how many results are for each query, if\nthey are in the range of 100Ks, then that could be the explanation. \n\nThe table shows number of hits per query – query \"1\" is large.\n\n\nMike - in case it's faster for you to run it, can you try to run the test\nagain with a change in the code which inlines super.collect() into\nOneComparatorScoringCollector and compare the results again? I will run it\nalso after you tell me which algorithm you used, but only tomorrow morning,\nso if you get to do it before then, that'd be great.\n\nI'll test this.\n\n\nI doubt that the change in topDocs() affects the query time that much, since\nit's called at the end of the search, and doing 4-5 'if' statements is\nreally not that expensive (I mean once per the entire search), comparing to\nScoreDoc[] array allocation, fetching Stored fields from the index etc. So\nI'd hate to implement all 3 topDocs() in each of the TopDocsCollector\nextensions unless it proves to be a problem.\n\nI also cannot imagine this is a problem.  It's the slowdown of big\nsearches that spooks me (it's fine if fast searches pick up some added\ncost). ",
            "author": "Michael McCandless",
            "id": "comment-12695699"
        },
        {
            "date": "2009-04-04T09:51:50+0000",
            "content": "\nBTW, I can change FieldValueHitQueue like I changed TopFieldCollector by\nintroducing a factory create() method which will return a\nOneComparaterFieldValueHitQueue and MultiComparatorsFieldValueHitQueue.\n\nToday, FVHQ.lessThan checks the numComparators in each call, which is\nredundant.\n\nSeems good, unless the extra subclassing (and additions of super.XXX()) is somehow cause our performance loss.\n\nAlso the class isn't final and I'm not sure if we want to change it.\n\nYes let's make it final.  We need to eek... ",
            "author": "Michael McCandless",
            "id": "comment-12695700"
        },
        {
            "date": "2009-04-04T09:54:26+0000",
            "content": "\nHow problematic is this break in back-compat, given it will be documented in\nCHANGES?\n\n\n\tHave search(W, F, C) on Searchable? I don't think it will have such a\ngreat impact as I don't believe too many actually implement Searchable.\n\n\n\n\n\tHave search(W, F, C) on Searcher as abstract? I know you offered, Mike, to\ncreate an empty impl which throws UOE, but I'm not sure what's worse: having\na compilation error or UOE at runtime (which can happen at the customer's).\nAfter all, all the search methods call this one eventually, and if you did\nextend Searcher (rather than IndexSearcher), you'll get UOE on every search.\n\n\n\nOK let's add both and call it out in CHANGES.txt? ",
            "author": "Michael McCandless",
            "id": "comment-12695701"
        },
        {
            "date": "2009-04-04T11:39:17+0000",
            "content": "There are no super.XXX calls. The two FVHQ implementations just implement\nlessThan according to whether it's a single comparator or muli case. This\nremoves the check of numComparators == 1.\n\n\nOn Sat, Apr 4, 2009 at 12:53 PM, Michael McCandless (JIRA)\n ",
            "author": "Shai Erera",
            "id": "comment-12695711"
        },
        {
            "date": "2009-04-04T11:53:54+0000",
            "content": "OK let's add both and call it out in CHANGES.txt?\n\ngreat. so I leave them as they are in the latest patch and add a note to CHANGES.\n\nYes let's make it final. We need to eek...\n\nThis isn't necessary after all, since the class is now abstract, with a private ctor and two private final internal classes, which will be the concrete objects returned by create().\n\nBefore submitting the next patch version, I'd like to verify if super.collect() in TFC is the cause of the perf. degradation. We should also perf. test sorting w/o score tracking and note if there is any improvement over trunk. I'm downloading the latest enwiki xml (20090306), so I hope that sometime tomorrow it will finish the download, extract, indexing and search tests. ",
            "author": "Shai Erera",
            "id": "comment-12695723"
        },
        {
            "date": "2009-04-04T13:55:46+0000",
            "content": "\nThere are no super.XXX calls. The two FVHQ implementations just implement\nlessThan according to whether it's a single comparator or muli case. This\nremoves the check of numComparators == 1.\nExcellent!\n\nBefore submitting the next patch version, I'd like to verify if super.collect() in TFC is the cause of the perf. degradation\n\nI'll run this & post back. ",
            "author": "Michael McCandless",
            "id": "comment-12695743"
        },
        {
            "date": "2009-04-04T14:35:03+0000",
            "content": "\nOdd – inlining super.collect into OCSC, and making OCSC final, did not alter the numbers much (I re-ran trunk baseline to confirm its close to prior trunk baseline):\n\n\n\n\nquery\nsort\nhits\nqps\nqpsnew\npctg\n\n\n147\nscore\n   6953\n3635.8\n3650.1\n  0.4%\n\n\n147\ntitle\n   6953\n2915.7\n2297.6\n-21.2%\n\n\n147\ndoc\n   6953\n3265.6\n2665.8\n-18.4%\n\n\ntext\nscore\n 157101\n 208.5\n 202.9\n -2.7%\n\n\ntext\ntitle\n 157101\n  97.0\n  85.4\n-12.0%\n\n\ntext\ndoc\n 157101\n 174.3\n 125.0\n-28.3%\n\n\n1\nscore\n 565452\n  58.2\n  56.6\n -2.7%\n\n\n1\ntitle\n 565452\n  44.6\n  34.6\n-22.4%\n\n\n1\ndoc\n 565452\n  49.2\n  35.2\n-28.5%\n\n\n1 OR 2\nscore\n 784928\n  14.1\n  13.7\n -2.8%\n\n\n1 OR 2\ntitle\n 784928\n  12.6\n  11.5\n -8.7%\n\n\n1 OR 2\ndoc\n 784928\n  13.0\n  11.9\n -8.5%\n\n\n1 AND 2\nscore\n 333153\n  15.6\n  15.5\n -0.6%\n\n\n1 AND 2\ntitle\n 333153\n  14.8\n  13.7\n -7.4%\n\n\n1 AND 2\ndoc\n 333153\n  15.2\n  14.2\n -6.6%\n\n\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12695745"
        },
        {
            "date": "2009-04-04T14:38:02+0000",
            "content": "We should also perf. test sorting w/o score tracking and note if there is any improvement over trunk.\n\nLet's wait a bit until we sort things out (eg, w/ current patch, TermScorer will still compute its score even if I don't need it). ",
            "author": "Michael McCandless",
            "id": "comment-12695746"
        },
        {
            "date": "2009-04-04T14:57:10+0000",
            "content": "Shai can you post your latest patch, where TermScorer itself is passed down to the collector? ",
            "author": "Michael McCandless",
            "id": "comment-12695750"
        },
        {
            "date": "2009-04-04T17:29:36+0000",
            "content": "\n\tChanged TermScorer.score() method to not call Similarity.decodeNorm. If we can change Scorer.similarity to be protected, we can give up getSimilarity() call in score(). Also changed TermScorer.score(Collector) to set 'this' as the collector's scorer.\n\tDeprecated TimeLimitedCollector, created new TimeLimitingCollector, renamed TestTimeLimitedCollector to TestTimeLimitingCollector and used the new TimeLimitingCollector.\n\tChanged FVHQ to have a static create which returns One/MultiComparatorFieldValueHitQueue version.\n\tChanged TopFieldCollector setNextReader versions to not call pq.size() but rather use numHits.\n\n ",
            "author": "Shai Erera",
            "id": "comment-12695767"
        },
        {
            "date": "2009-04-04T19:24:33+0000",
            "content": "OK thanks.  Numbers w/ new patch:\n\n\n\n\nquery\nsort\nhits\nqps\nqpsnew\npctg\n\n\n147\nscore\n   6953\n3635.8\n3704.1\n  1.9%\n\n\n147\ntitle\n   6953\n2915.7\n2262.9\n-22.4%\n\n\n147\ndoc\n   6953\n3265.6\n2655.1\n-18.7%\n\n\ntext\nscore\n 157101\n 208.5\n 199.9\n -4.1%\n\n\ntext\ntitle\n 157101\n  97.0\n  87.1\n-10.2%\n\n\ntext\ndoc\n 157101\n 174.3\n 134.6\n-22.8%\n\n\n1\nscore\n 565452\n  58.2\n  56.5\n -2.9%\n\n\n1\ntitle\n 565452\n  44.6\n  35.3\n-20.9%\n\n\n1\ndoc\n 565452\n  49.2\n  38.0\n-22.8%\n\n\n1 OR 2\nscore\n 784928\n  14.1\n  13.8\n -2.1%\n\n\n1 OR 2\ntitle\n 784928\n  12.6\n  11.6\n -7.9%\n\n\n1 OR 2\ndoc\n 784928\n  13.0\n  11.9\n -8.5%\n\n\n1 AND 2\nscore\n 333153\n  15.6\n  15.4\n -1.3%\n\n\n1 AND 2\ntitle\n 333153\n  14.8\n  13.7\n -7.4%\n\n\n1 AND 2\ndoc\n 333153\n  15.2\n  14.2\n -6.6%\n\n\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12695782"
        },
        {
            "date": "2009-04-04T19:48:24+0000",
            "content": "Attached patch; only differences are:\n\n\n\tUnder contrib/benchmark I made changes so you can specify non-scoring field sorting\n\n\n\n\n\tFixed the rename of TestTimeLimitedCollector --> Limiting to be patch-friendly\n\n\n\nOK I ran performance with score tracking disabled during field sorted search:\n\n\n\n\nquery\nsort\nhits\nqps\nqpsnew\npctg\n\n\n147\ntitle\n   6953\n2915.7\n4043.3\n 38.7%\n\n\n147\ndoc\n   6953\n3265.6\n4840.1\n 48.2%\n\n\ntext\ntitle\n 157101\n  97.0\n 128.0\n 32.0%\n\n\ntext\ndoc\n 157101\n 174.3\n 273.2\n 56.7%\n\n\n1\ntitle\n 565452\n  44.6\n  60.2\n 35.0%\n\n\n1\ndoc\n 565452\n  49.2\n  75.3\n 53.0%\n\n\n1 OR 2\ntitle\n 784928\n  12.6\n  14.8\n 17.5%\n\n\n1 OR 2\ndoc\n 784928\n  13.0\n  15.2\n 16.9%\n\n\n1 AND 2\ntitle\n 333153\n  14.8\n  17.9\n 20.9%\n\n\n1 AND 2\ndoc\n 333153\n  15.2\n  18.9\n 24.3%\n\n\n\n\n\nVery nice speedups!  We just have to figure out why the score-tracking variant got slower... ",
            "author": "Michael McCandless",
            "id": "comment-12695784"
        },
        {
            "date": "2009-04-05T12:44:10+0000",
            "content": "Mike - I've been trying to see this performance hit, without indexing the full wikipedia content, but failed. What I did is:\n\n\tCreate an index with 10M documents with one term (all with the same term). The index had 51 segments (I deliberately aimed at a high number).\n\tRun a sort-by-doc (in reverse order so that collect() will actually do some work) search using TermQuery (so that TermScorer will be used).\n\tMeasure the avg. time of 20 query executions (I deliberately omit the first execution because I've noticed that the first run sometimes take much longer, even after I kill the JVM. I guess it has to do with OS caches).\n\n\n\nThe time I measure between the trunk and the current version are very much comparable:\ntrunk-patched: (1) 1248.45 ms (2) 1255.45 ms\ntrunk-orig: (1) 1314.1 ms (2) 1265.65 ms\nIn both runs the patched trunk ran faster. Both did not have any large differences.\n\nHere's the code:\n\n\tpublic static void main(String[] args) throws Exception {\n\n\t\tFile indexDir = new File(args[0]);\n\t\tDirectory dir = new FSDirectory(indexDir, new NativeFSLockFactory(indexDir));\n\t\t\n\t\tif (!indexDir.exists() || indexDir.list().length == 0) {\n\t\t\tint numDocs = 10000000;\n\t\t\tIndexWriter writer = new IndexWriter(dir, null, MaxFieldLength.UNLIMITED);\n\t\t\twriter.setMergeFactor(50);\n\t\t\twriter.setMaxBufferedDocs(numDocs/100);\n\t\t\tSystem.out.println(\"populating index\");\n\t\t\tlong time = System.currentTimeMillis();\n\t\t\tfor (int i = 0; i < numDocs; i++) {\n\t\t\t\tDocument doc = new Document();\n\t\t\t\tdoc.add(new Field(\"c\", \"test\", Store.NO, Index.NOT_ANALYZED));\n\t\t\t\twriter.addDocument(doc);\n\t\t\t}\n\t\t\twriter.close(false);\n\t\t\tSystem.out.println(\"time=\" + (System.currentTimeMillis() - time));\n\t\t}\n\t\t\n\t\tSystem.out.println(\"searching\");\n\t\tIndexSearcher searcher = new IndexSearcher(dir);\n\t\tSystem.out.println(\"numSegments=\" + searcher.getIndexReader().getSequentialSubReaders().length);\n\t\tSort sort = new Sort(new SortField(null, SortField.DOC, true));\n\t\tsearcher.search(new TermQuery(new Term(\"c\", \"test\")), null, 10, sort);\n\t\tlong time = System.currentTimeMillis();\n\t\tdouble numQueries = 20;\n\t\tfor (int i = 0; i < numQueries; i++) {\n\t\t\tsearcher.search(new TermQuery(new Term(\"c\", \"test\")), null, 10, sort);\n\t\t}\n\t\ttime = System.currentTimeMillis() - time;\n\t\tSystem.out.println(\"avg. time=\" + (time / numQueries) + \" ms\");\n\t\tsearcher.close();\n\t}\n\n\n\n\nCan you try running this code on your machine? ",
            "author": "Shai Erera",
            "id": "comment-12695853"
        },
        {
            "date": "2009-04-05T16:04:59+0000",
            "content": "OK I ran it like this:\n\n\njava -Xms1024M -Xmx1024M -Xbatch -server -cp build/classes/java:../lucene.collection PerfTest /lucene/fake\n\n\n\nAcross these OS/JRE versions:\n\n\n\n\nOS\nJRE\nTrunk\nPatch\n%tg change\n\n\nLinux\n1.6.0_10\n1075 ms\n1120 ms\n-4.2%\n\n\nLinux\n1.5.0_08\n1156 ms\n1199 ms\n-3.7%\n\n\nOS X\n1.6.0_07 (64bit)\n774 ms\n823 ms\n-6.3%\n\n\nOS X\n1.5.0_16\n987 ms\n936 ms\n5.2%\n\n\nWin Svr 2003 (64bit)\n1.6.0_11 (64bit)\n1209 ms\n1308 ms\n-8.2%\n\n\nWin Svr 2003 (64bit)\n1.5.0_14 (64bit)\n1559 ms\n1564 ms\n-0.3%\n\n\n\n\n\nShai which OS/JRE did you run on?\n\nExcept for the JRE 1.5 cases on OS X and Win Svr 2003, things seem\ngenerally slower with the patch, though I think the test is a little\ntoo synthetic (sorting by doc reversed is far worse than a \"normal\"\nfielded sort where I think the queue would typically fairly quickly\n\"converge\").  Also, I think it's better to take min rather than avg\nacross all the runs. ",
            "author": "Michael McCandless",
            "id": "comment-12695868"
        },
        {
            "date": "2009-04-05T17:21:56+0000",
            "content": "Shai which OS/JRE did you run on?\n\nWindows XP, 1.5 (32 bit)\n\nI chose the sort by doc since I was very curious as to the major drop in performance your queries show. When you sort by doc, the queue converges exactly after 10 documents (assuming you ask for 10 results). After that, every document that's collected fails at the comparator level (first line in the \"if (queueFull)\" code) and the collector literally does nothing. So all that's left are the calls to scorer.score().\nI chose to sort by docs reversed so that every call will actually do something.\nI measured scorer.score() calls in OCSC and they were insignificant (~14 ms total on a single query run).\n\nAlso, I think it's better to take min rather than avg across all the runs.\n\nI don't know. Some runs showed 112 ms and some 256 ms ... Taking the minimum just measures \"when the OS cache is fully optimized for your run\" case, that's why I prefer to take avg. Anyway, I don't think it matters since we're taking the same for both runs.\n\nI reviewed the code in TopFieldCollector and it's almost identical to before the patch, besides I differences I noted above, which don't seem like to have an effect. That's why I wanted to have a synthetic test, which we know exactly what it'll do.\n\nBTW, this test shows far smaller drop in performance comparing to your previous sort-by-doc runs, and it does collect ~x20 times more documents ... ",
            "author": "Shai Erera",
            "id": "comment-12695876"
        },
        {
            "date": "2009-04-05T19:26:56+0000",
            "content": "\n> Shai which OS/JRE did you run on?\n\nWindows XP, 1.5 (32 bit)\n\nDid you run with -server, -Xbatch, -Xms/-Xmx set to same value, etc?\nThe goal is to minimize any source of noise in the measurement.\n\nI also got mixed results on 1.5...\n\nI chose the sort by doc since I was very curious as to the major drop in performance your queries show. When you sort by doc, the queue converges exactly after 10 documents (assuming you ask for 10 results). After that, every document that's collected fails at the comparator level (first line in the \"if (queueFull)\" code) and the collector literally does nothing. So all that's left are the calls to scorer.score().\n\nI agree, I think sort by doc is overly easy, but sort by doc reversed\nis overly hard.  I think sort by title & docdate (in wikipedia) are\nreasonable.  Let's just leave doc entirely out of future wikipedia\ntests.\n\nI measured scorer.score() calls in OCSC and they were insignificant (~14 ms total on a single query run).\n\nThat's very odd, because I see big speedups when we don't score.\n\n\n> Also, I think it's better to take min rather than avg across all the runs.\n\nI don't know. Some runs showed 112 ms and some 256 ms ... Taking the minimum just measures \"when the OS cache is fully optimized for your run\" case, that's why I prefer to take avg. Anyway, I don't think it matters since we're taking the same for both runs.\n\nIf you really had such wide variance on your runs (I didn't), it's\neven more important to use min not avg.  It means there's alot of\nnoise in your measurement.\n\nFor this test we do want full OS caching, no page misses, no daemon\nthat wakes up a steals a few cycles, etc.  This is why min, across\nmany iterations, is good: it makes the numbers less noisy and more\ncomparable.  A random unlucky outlier won't increase the time.\n\nTrue, min is not a good way to measure what you'll typically see when\nrunning such searches in your app (the real world has lots of noise),\nbut that's not what we're after here.\n\nI reviewed the code in TopFieldCollector and it's almost identical to before the patch, besides I differences I noted above, which don't seem like to have an effect. That's why I wanted to have a synthetic test, which we know exactly what it'll do.\n\nI think it may be the switch to an abstract Scorer – the JIT can no\nlonger inline that code (maybe).\n\nOr maybe it's the switch to subclassing-not-if for the 4 impls of\nTopFieldCollector?\n\nBTW, this test shows far smaller drop in performance comparing to your previous sort-by-doc runs, and it does collect ~x20 times more documents ...\n\nYeah but we changed alot of things.  I think sort by title, docdate\nare more realistic tests.  It is nice that your test is ~20X\nlarger... I wish we had a real standard dataset that large, and real\nqueries instead of the few specific ones we are testing, would be\nbetter.\n ",
            "author": "Michael McCandless",
            "id": "comment-12695892"
        },
        {
            "date": "2009-04-05T19:30:38+0000",
            "content": "OK I modified your test (attached):\n\n\n\tMake a random int field and sort on that\n\n\n\n\n\tSwitch to System.nanoTime to measure time\n\n\n\n\n\tPrint min time in addition to avg\n\n\n\n\n\tGather silly sum just to make sure JRE can't optimize away things\n\n\n\nHere are the results:\n\n\n\n\nOS\nJRE\nTrunk\nPatch\n%tg\n\n\nOS X\n1.5.0_16\n389\n334\n14.1%\n\n\nOS X\n1.6.0_07 (64 bit)\n312\n430\n-27.4%\n\n\nLinux\n1.5.0_08\n403\n337\n16.4%\n\n\nLinux\n1.6.0_10\n337\n303\n10.1%\n\n\nWin Svr 2003 (64 bit)\n1.5.0_14 (64 bit)\n535\n727\n-36.6%\n\n\nWin Svr 2003 (64 bit)\n1.6.0_11 (64 bit)\n477\n682\n-43.0%\n\n\n\n\n\nNow I'm even more baffled.  The Win Svr 2003 times became especially\nawful... in fact it's as if 64-bit JREs don't like this change.\n\nOr we may simply be chasing Java ghosts at this point... though these\nare awfully big ghosts. ",
            "author": "Michael McCandless",
            "id": "comment-12695895"
        },
        {
            "date": "2009-04-06T02:10:16+0000",
            "content": "Gave the bench a try here on 64-bit linux with open-jdk 6 and sun-java 5.\n\nI did one throw away run with the new patch version, and then recorded the times for both - got 30% drop with the new patch.\n\nReran both many times after and got approx the same times for both every attempt, using both JRE's mentioned above.\n\nDunno know what that implies, but another data point.\n\n\n\tMark\n\n ",
            "author": "Mark Miller",
            "id": "comment-12695954"
        },
        {
            "date": "2009-04-06T02:42:57+0000",
            "content": "Reran both many times after and got approx the same times for both every attempt, using both JRE's mentioned above.\n\nJust for verification - by \"same time\" did you mean that your successive runs show ~X ms for both patched and non-patched trunk, or by \"same time\" you meant that the successive runs show -30% drop with the patch? ",
            "author": "Shai Erera",
            "id": "comment-12695957"
        },
        {
            "date": "2009-04-06T02:48:04+0000",
            "content": "As in, the 30% drop appeared to be an aberration. Both patched and un-patched performed the same on subsequent runs. It appears there is not a loss on my setup - or its very small if there is. ",
            "author": "Mark Miller",
            "id": "comment-12695958"
        },
        {
            "date": "2009-04-06T02:56:47+0000",
            "content": "Yes, that's what I saw too. I will run the test with both 1.5 and 1.6, 32/64 bit versions and post the results.\n\nBTW, if you look at Mike's table above, it's a black and white thing: the 1.5 JRE really like this patch and 1.6 really hate it. Maybe we should not move to 1.6 then?  (kidding) ",
            "author": "Shai Erera",
            "id": "comment-12695959"
        },
        {
            "date": "2009-04-06T09:09:36+0000",
            "content": "I wasn't able to run the test on 64-bit JRE. Here are the results on 32-bit JREs:\n\n\n\n\nOS\nJRE\nTrunk\nPatch\n%tg\n\n\nXP\nIBM 1.5\n 573 \n 571 \n 0.34%\n\n\n XP \n 1.6.07 (32 bit) \n 752 \n 804 \n -6.4 %\n\n\nSRV 2003\n IBM 1.5 \n 530/469 \n 536/493 \n 1%/-4.86%\n\n\nSRV 2003\n 1.6.07 (32 bit) \n 858 \n 699 \n 22.7%\n\n\n\n\n\nI ran each twice, and just in the SRV-2003-1.5 case there were differences between the two runs. Also, it's important to notice that unlike Mike's results, the SRV2003-JRE1.6 run had 22.7% improvement with the patched version. I re-ran the 2003 runs a couple of times and the results were consistent. ",
            "author": "Shai Erera",
            "id": "comment-12696010"
        },
        {
            "date": "2009-04-06T09:47:58+0000",
            "content": "Mark and Shai, are you guys using the last version of the bench (that sorts by random int field)?  Are you using the \"best\" time for your results?  How are you launching the JRE?\n\nBTW, if you look at Mike's table above, it's a black and white thing: the 1.5 JRE really like this patch and 1.6 really hate it. Maybe we should not move to 1.6 then?\n\nActually, for my run on Linux, the patch was faster for both 1.5 & 1.6 JREs. ",
            "author": "Michael McCandless",
            "id": "comment-12696017"
        },
        {
            "date": "2009-04-06T09:53:03+0000",
            "content": "Added JustCompileSearch, JustCompileSearchFunction and JustCompileSearchSpans that extend/implement all abstract classes/interfaces in o.a.l.s, o.a.l.s.s and o.a.l.s.f. Those are not unit tests per-sei, however if anyone will change the interfaces/abstract classes in a way that it breaks back-compat, we'll know it right away. I think that in general this is something good to have for Lucene overall, however I only took care of the search.* packages in this patch. ",
            "author": "Shai Erera",
            "id": "comment-12696019"
        },
        {
            "date": "2009-04-06T10:00:50+0000",
            "content": "I'm using the latest version which sorts by that random field (the output includes the prints of best, avg. and sum, so I'm sure of that). Also, the times I reported are the 'best' time. I launch the JRE like you posted with those args: \"-Xms1024M -Xmx1024M -Xbatch -server\".\n\nI reran now, and the results are consistent. ",
            "author": "Shai Erera",
            "id": "comment-12696020"
        },
        {
            "date": "2009-04-06T13:47:04+0000",
            "content": "I just used the defaults for cmd line - I can give it another go ensuring server and more RAM. I used the latest perf code provided by Mike and the latest patch.\n\nI didn't look at the numbers too closely - my plan was to do a quick profile with each, but eyeballing runs with each over and over, they were approx the same (both best and avg), so I skipped the profiling. ",
            "author": "Mark Miller",
            "id": "comment-12696084"
        },
        {
            "date": "2009-04-06T14:25:12+0000",
            "content": "\nI ran 2 more JREs under linux:\n\n\n\n\nOS\nJRE\nTrunk\nPatch\n%tg\n\n\nLinux\n1.7.0 ea\n333 ms\n320 ms\n3.9%\n\n\nLinux\nIBM JRE 1.5.0\n401 ms\n352 ms\n12.2%\n\n\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12696101"
        },
        {
            "date": "2009-04-06T15:54:32+0000",
            "content": "So how do we proceed? It looks like we get inconsistent results, sometimes over the same OS and JRE, just different machine. Perhaps the test is too synthetic, although it does capture the essence of the changes. Mike, can you post your Wikipedia index somewhere so I can download and run your previous queries and compare the results? ",
            "author": "Shai Erera",
            "id": "comment-12696145"
        },
        {
            "date": "2009-04-06T16:27:33+0000",
            "content": "So how do we proceed?\n\nThe results are definitely highly varying...\n\nIt seems like I'm the only one seeing sizable performance loss with the patch,\nand then only with 64bit JREs (on OS X and Windows Server 2004 x64).\n\nMark when you saw no performance loss on  64 bit linux, was the JRE\n64 bit?\n\nIf so, then maybe we should simply proceed with the patch as is.\nThese differences are clearly java ghosts and there's not much we can\ndo about that....\n\nThe index is a little too large (2.6G) to schlepp around – instead,\nhere's the alg I used to create it:\n\n\nanalyzer=org.apache.lucene.analysis.standard.StandardAnalyzer\n\ndoc.maker=org.apache.lucene.benchmark.byTask.feeds.LineDocMaker\n\nmerge.policy=org.apache.lucene.index.LogDocMergePolicy\n\ndocs.file=/Volumes/External/lucene/wiki.txt\ndoc.stored = false\ndoc.term.vector = false\ndoc.add.log.step=1000\nmax.field.length=2147483647\n\ndirectory=FSDirectory\nautocommit=false\ncompound=false\nram.flush.mb = 128\ndoc.maker.forever = false\n\nwork.dir=/lucene/work\n\n{ \"Rounds\"\n  ResetSystemErase\n  { \"BuildIndex\"\n    - CreateIndex\n     { \"AddDocs\" AddDoc > : *\n    - CloseIndex\n  }\n  NewRound\n} : 1\n\nRepSumByPrefRound BuildIndex\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12696160"
        },
        {
            "date": "2009-04-06T17:07:11+0000",
            "content": "Yes, both 64-bit versions - openjdk 6 and sun java 1.5. I appeared to be getting the same results with both jvm's and patched or not. I figured I'd try a bit of profiling, since I have a 64-bit setup, but doesnt appear I'd learn much. I'm going to try a bit more testing tonight for the heck of it - I've got sun 1.6 and a 32-bit 1.5 I could check with as well. ",
            "author": "Mark Miller",
            "id": "comment-12696178"
        },
        {
            "date": "2009-04-07T10:08:10+0000",
            "content": "Attached new patch:\n\n\n\tChanged members & methods in TopFieldCollector from \"protected\" to\n    package-private.\n\n\n\n\n\tTweaked javadocs, CHANGES.txt\n\n\n\n\n\tRemoved some dead code, nocommits\n\n\n\n\n\tRe-added TestTimeLimitedCollector\n\n\n\nBesides the java ghosts, for which we will close our eyes and hope\nthey disappear, I think this is ready to go in!\n\nI'll way a few days and then commit. ",
            "author": "Michael McCandless",
            "id": "comment-12696460"
        },
        {
            "date": "2009-04-07T17:25:50+0000",
            "content": "New patch which just fixes contrib/spatial's cutover to the new API to further cutover to the new new API. ",
            "author": "Michael McCandless",
            "id": "comment-12696632"
        },
        {
            "date": "2009-04-08T15:13:46+0000",
            "content": "I wonder if we should break out tracking of max score, which is far more costly, from tracking scores of hits inserted into the queue?\n\nTypically the number of inserts is very low (ie, the queue \"converges\" quickly) and so only track scores of inserted hits would be much lower cost than also tracking max score. ",
            "author": "Michael McCandless",
            "id": "comment-12697052"
        },
        {
            "date": "2009-04-08T15:32:18+0000",
            "content": "That's actually what's done in TopScoreDocCollector. maxScore is not tracked at all, and only when topDocs() is called, maxScore is set to the largest element in the queue. It has some overhead in topDocs() (might require a pop of all elements, even if the range is \"give me the last 10\"), which I personally don't care about since it happens once per search.\nmaxScore is only tracked in TopFieldCollector, which indeed adds several instructions to each collect, including a call to Math.max.\nWere you thinking along those lines? If so, I can remove maxScore tracking from TFC and compute it in topDocs only.\n\nAnother idea, which will prevent popping out all the elements from the queue just to compare maxScore is to actually make it a method of TopDocsCollector (e.g., TDC.maxScore()). It will be the responsibility of the implementation (with TDC providing a base for all) to ensure that if the largest element is extracted, maxScore is set (so that we don't lose it). The reason I'm thinking about it is that because maxScore is probably used only for normalization, and if a certain application never uses it, why should we compute it?\n\nWhat do you think? ",
            "author": "Shai Erera",
            "id": "comment-12697061"
        },
        {
            "date": "2009-04-08T16:22:09+0000",
            "content": "\nmaxScore is only tracked in TopFieldCollector, which indeed adds several instructions to each collect, including a call to Math.max.\n\nRight, but most costly is the call to Scorer.score().  If you didn't\ncare to know the maxScore, but still wanted the raw score for each hit,\nit'd be much cheaper to only call Scorer.score() if the hit is\ncompetitive (ie, is inserted into the pq).\n\nWere you thinking along those lines? If so, I can remove maxScore tracking from TFC and compute it in topDocs only.\n\nWe can't do that because that's a change in behavior (ie, maxScore\nincludes max across all hits, not just the final topN).\n\nThe reason I'm thinking about it is that because maxScore is probably used only for normalization, and if a certain application never uses it, why should we compute it?\n\nRight that's my reasoning too.  So I think we should be able to separately turn off \"track max score\". ",
            "author": "Michael McCandless",
            "id": "comment-12697083"
        },
        {
            "date": "2009-04-08T17:53:17+0000",
            "content": "Right ... so basically we're talking about changes in just TFC:\n\n\tAdd another parameter to TFC.create - trackMaxScore (default to true in IndexSearcher, but change to false in 3.0).\n\tKeeping the non-scoring collectors as they are.\n\tCreate a ScoringNoMaxScoreCollector, which extends NonScoringCollector. It will compute score only if the doc has a chance to enter the queue. This means implementing collect() entirely, and not relying on super.collect.\n\tRename ScoringCollector to ScoringMaxScoreCollector and leave it as is: track both scores and maxScore and call super.collect().\n\n\n\nI figure there's no reason to create a NonScoringTrackMaxScore, since if we're calling score() to track maxScore, there's no reason not to set it on the docs that enter the pq.\n\nThis does not affect TopScoreDocCollector. ",
            "author": "Shai Erera",
            "id": "comment-12697122"
        },
        {
            "date": "2009-04-08T17:57:29+0000",
            "content": "Sounds right!  Wanna update the patch w/ that? ",
            "author": "Michael McCandless",
            "id": "comment-12697124"
        },
        {
            "date": "2009-04-08T18:11:00+0000",
            "content": "of course ! ",
            "author": "Shai Erera",
            "id": "comment-12697130"
        },
        {
            "date": "2009-04-08T19:05:02+0000",
            "content": "I came across another simple search optimization I think we should do:\nif IndexSearcher can guarantee it visits docs in docID order (ie, turn\noff the \"sort by numDocs()\" now done by default, that was added in\nLUCENE-1483), then in TopFieldCollector and TopScoreDocCollector we\ncan remove careful tie-breaking in the \"equals\" cases.\n\nThis means in TopScoreDocCollector we could change this:\n\n} else if (score >= reusableSD.score) {\n\n\n(inside collect) to:\n\n} else if (score > reusableSD.score) {\n\n\n\nbecause if the new hit's score is == it can't possibly compete since\nits docID is guaranteed to be greater than what's in the queue.\n\nLikewise, in TopFieldCollector.OneComparatorNonScoringCollector, we\ncan change:\n\n\nif (cmp < 0 || (cmp == 0 && doc + docBase > bottom.docID)) {\n  return;\n}\n\n\n\nto:\n\n\nif (cmp <= 0) {\n  return;\n}\n\n\n\nand in MultiComparatorNonScoringCollector, we can change:\n\n} else if (i == comparators.length - 1) {\n  // This is the equals case.\n  if (doc + docBase > bottom.docID) {\n    // Definitely not competitive\n    return;\n  }\n  break;\n}\n\n\n\nto:\n\n\n} else if (i == comparators.length - 1) {\n  return;\n}\n\n\n\n(or possibly refactor this one to return if c == 0 on exiting the\nloop).\n\nWe do still need the \"break tie\" logic in the lessThan methods of\nHitQueue/FieldValueHitQueue, since PQ uses this to up/down heap itself\nafter we insert/delete. ",
            "author": "Michael McCandless",
            "id": "comment-12697152"
        },
        {
            "date": "2009-04-09T08:51:18+0000",
            "content": "Hey Mike. I actually planned to open another issue about optimizations to TSDC. Besides what you propose, I think that if we pre-fill pq with dummy objects (with score = Float.NEGATIVE_INF), we can skip the checks of \"if (reusableSD == null)\" and always assume the queue is full. We can even optimize it further by not calling pq.insertWithOverflow, but instead change top() and call adjustTop().\n\nI do think though that these belong in a different issue, since this one is about the refactoring. What do you say that I'll to this one the changes about maxScore we agreed, and then open a new one \"optimizations to TSDC and TFC\" and include those changes? I also want to do perf. measurements, ensure the unit tests cover everything etc. That issue already contains many changes. ",
            "author": "Shai Erera",
            "id": "comment-12697437"
        },
        {
            "date": "2009-04-09T08:59:22+0000",
            "content": "OK that sounds like a good plan.\n\nI'd be interested to see if pre-filling with sentinels gives better performance, too.\n\nHere's another one to add: some methods in Sort explicitly add SortField.FIELD_DOC as a \"tie breaker\" for the last SortField.  But, doing so should not be necessary (since we already break ties by docID), and is in fact less efficient (once the above optimization is in). ",
            "author": "Michael McCandless",
            "id": "comment-12697439"
        },
        {
            "date": "2009-04-09T09:09:53+0000",
            "content": "Does HitQueue favor documents with smaller ids? In case the score is equal I mean ... if not (I was under the impression larger doc Ids are favored), then if the scores are equal shouldn't the new doc replace the current doc? Isn't that's why the >= exists there now (othrewise it could be just >)? Or was it added as part of 1483, since it wasn't guaranteed documents are returned in increasing order? ",
            "author": "Shai Erera",
            "id": "comment-12697442"
        },
        {
            "date": "2009-04-09T09:48:07+0000",
            "content": "Does HitQueue favor documents with smaller ids?\n\nYes.  In it's lessThan method, when the scores are equal, it does this:\n\nreturn hitA.doc > hitB.doc; \n\n\n\nEg, hitB is \"favored\" (lessThan returns false) if it has a smaller doc than hitA.\n\nOr was it added as part of 1483, since it wasn't guaranteed documents are returned in increasing order?\n\nThis was added as part of LUCENE-1483, but can be optimized away once we go back to in-order docID processing from IndexSearcher. ",
            "author": "Michael McCandless",
            "id": "comment-12697454"
        },
        {
            "date": "2009-04-09T10:05:26+0000",
            "content": "Eg, hitB is \"favored\" (lessThan returns false) if it has a smaller doc than hitA.\n\nDuh, I got that backwards.  This stuff is hard to think about!\n\nCorrected: if hitB has smaller doc than hitA, lessThan returns true, meaning hitB is preferred. ",
            "author": "Michael McCandless",
            "id": "comment-12697462"
        },
        {
            "date": "2009-04-10T04:53:54+0000",
            "content": "\n\tAdds the ScoringNoMaxScore collectors\n\tAdds some tests to TestSort in order to test that functionality\n\tFixes a bug which existed since this issue - when maxScore is set to Float.NaN, Math.max always returns NaN. Therefore I set the ScoringMaxScore collectors to set it to NEG_INF (to accommodate scorers which assign negative scores to documents).\n\tAdded \"nomaxscore\" property to SearchWithSortTask.\n\tChanged ReadTask.doLogic() to always use search(Query, Collector). The reason is that currently if scoring is set to true, it uses the default search method, however in 3.0 that method will be changed to not compute scores, and we might forget to change the logic in ReadTask.\n\n\n\nBTW, I wonder if we can replace the call to Math.max with just 'if (score > maxScore)'? Looking at Math.max, it checks if the fist parameter is NaN (which I assume Scorer.score() will not return), and then if both equal 0.0f returns their sum, otherwise returns the biggest. Calling this method is quite expensive, and I think we will be safe with replacing it with 'if', however now that maxScore is decoupled as well, only the trackMaxScore collectors will suffer from it ....\nAnyway, I added a TODO in case we don't want to change it now. ",
            "author": "Shai Erera",
            "id": "comment-12697733"
        },
        {
            "date": "2009-04-10T05:45:15+0000",
            "content": "added another test case to TestSort ",
            "author": "Shai Erera",
            "id": "comment-12697747"
        },
        {
            "date": "2009-04-10T11:18:17+0000",
            "content": "BTW, I wonder if we can replace the call to Math.max with just 'if (score > maxScore)'?\n\nI would just go ahead and do that.\n\nLooks great!  All tests pass.  Here's all I found... can you make a\nnew patch Shai?:\n\n\n\tPatch is missing the fix to contrib/spatial\n\n\n\n\n\tDid you add a test case verifying maxScore is correct (so that the\n    Float.NaN issue would trip the test)?\n\n\n\n\n\tJavadoc of searchWithSort needs to describe nomaxscore param\n\n\n\n\n\tHitCollector isn't deprecated\n\n ",
            "author": "Michael McCandless",
            "id": "comment-12697791"
        },
        {
            "date": "2009-04-10T18:46:16+0000",
            "content": "Did you add a test case verifying maxScore is correct (so that the Float.NaN issue would trip the test)?\n\nI added to following tests:\n\n\ttestSortWithoutScoreTracking - asserts that ScoreDoc.score is set to Float.NaN as well as maxScore.\n\ttestSortWithScoreNoMaxScoreTracking - asserts that ScoreDoc.score is not Float.NaN, but maxScore is.\n\ttestSortWithScoreAndMaxScoreTracking - asserts that both ScoreDoc.score and maxScore are not set to NaN.\n\ttestSortWithScoreAndMaxScoreTrackingNoResults - asserts that in case of a maxScore tracking collector with 0 results, maxScore is set to Float.NaN, rather than NEG_INF.\n\n\n\nHitCollector isn't deprecated\n\nSomehow when I applied your patch, this change wasn't taken in. Anyway, I noticed its javadocs also referenced MRHC, so I fixed it also.\n ",
            "author": "Shai Erera",
            "id": "comment-12697915"
        },
        {
            "date": "2009-04-10T18:53:20+0000",
            "content": "I added to following tests:\n\nGreat, I'll have a look, thanks!\n\nSomehow when I applied your patch, this change wasn't taken in. Anyway, I noticed its javadocs also referenced MRHC, so I fixed it also.\n\nMost likely the hunk was rejected, due to the $Id$ keyword in that javadoc.  \"svn patch\" should fix this. ",
            "author": "Michael McCandless",
            "id": "comment-12697919"
        },
        {
            "date": "2009-04-10T19:33:50+0000",
            "content": "Patch looks good, and all tests patch.  I'll commit in a day or two, barring any more sudden improvements  ",
            "author": "Michael McCandless",
            "id": "comment-12697942"
        },
        {
            "date": "2009-04-13T18:35:53+0000",
            "content": "Thanks Shai! ",
            "author": "Michael McCandless",
            "id": "comment-12698483"
        },
        {
            "date": "2009-04-24T18:07:26+0000",
            "content": "Hi,\nShalin found a backwards-incompatible change in the Searcher abstract class, I noticed this from his SVN comment for SOLR-940 (where he updated to Lucene trunk):\n\nabstract public void search(Weight weight, Filter filter, Collector results) throws IOException;\n\n\nThis should not be abstract for backwards compatibility, but instead throw an UnsupportedOperationException or have a default implementation that somehow wraps the Collector using an old HitCollector (not very nice, I do not know how to fix this in any other way). Before 3.0, where this change would be ok,  the Javadocs should note, that the deprecated HitCollector API will be removed and the Collector part will be made abstract.\nIf this method stays abstract, you cannot compile old code or replace lucene jars (this is seldom, as almost nobody creates private implementations of Searcher, but Solr does... ",
            "author": "Uwe Schindler",
            "id": "comment-12702471"
        },
        {
            "date": "2009-04-24T19:04:09+0000",
            "content": "If you read somewhere above, you'll see that we've discussed this change. It seems that whatever we do, anyone who upgrades to 2.9 will need to touch his code. If you extend Searcher, you'll need to override that new method, regardless of what we choose to do. That's because if it's abstract, you need to implement it, and it it's concrete (throwing UOE), you'll need to override it since all the Searcher methods call this one at the end.\n\nI'm not sure wrapping a Collector with HitCollector will work, because all of the other classes now expect Collector, and their HitCollector variants call the Collector one with a HitCollectorWrapper (which is also deprecated).\n\nWe agreed that making it abstract is the lesser of all evils, since you'll spot it at compile time, rather than at runtime, when you'll hit a UOE. ",
            "author": "Shai Erera",
            "id": "comment-12702488"
        },
        {
            "date": "2009-04-24T19:52:56+0000",
            "content": "Shalin found a backwards-incompatible change in the Searcher abstract class\n\nWe could go either way on this... the evils were strong with either choice, and we struggled and eventually went with adding abstract method today, for the reasons Shai enumerated. ",
            "author": "Michael McCandless",
            "id": "comment-12702509"
        },
        {
            "date": "2009-04-24T20:04:27+0000",
            "content": "OK, I resolve the issue again. I was just wondering and wanted to be sure. I also missed the first entry in CHANGES.txt, which explains it.\nIt is the same like with the Fieldable interface in the past, it is seldom implemented/overwritten and so the \"normal\" user will not be affected. And those who implement Fieldable or extend Searcher must implement it. ",
            "author": "Uwe Schindler",
            "id": "comment-12702516"
        }
    ]
}