{
    "id": "LUCENE-2748",
    "title": "Convert all Lucene web properties to use the ASF CMS",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "The new CMS has a lot of nice features (and some kinks to still work out) and Forrest just doesn't cut it anymore, so we should move to the ASF CMS: http://apache.org/dev/cms.html",
    "attachments": {
        "modify_ui.diff": "https://issues.apache.org/jira/secure/attachment/12502961/modify_ui.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-11-09T18:18:46+0000",
            "content": "Where will the subversion space for the site sources go?  Under repos/asf/lucene/new-site-dir/?\n\nWill we still maintained versioned and unversioned content? ",
            "author": "Steve Rowe",
            "id": "comment-12930219"
        },
        {
            "date": "2010-12-03T01:46:37+0000",
            "content": "Initial setup is complete.  You can see a very barebones site at http://lucene.staging.apache.org/lucene\n\nWhere will the subversion space for the site sources go? Under repos/asf/lucene/new-site-dir/? \n\nSVN for all this is at: https://svn.apache.org/repos/asf/lucene/cms/trunk\n\nI'd suggest we can subdivide that to have solr, core, pylucene and ORP.  The nice thing is we can have a consistent look and feel and far less maintenance.\n\nWill we still maintained versioned and unversioned content?\n\nNot sure what you mean by unversioned content.  The Wiki won't be going away. ",
            "author": "Grant Ingersoll",
            "id": "comment-12966386"
        },
        {
            "date": "2010-12-08T18:59:25+0000",
            "content": "Not sure what you mean by unversioned content. The Wiki won't be going away.\n\ni'm pretty sure steven meant versioned/unversioned in the sense that the current site has general pages, and then pages that are specific to certain releases..\n\nSome unversioned pages...\n\nhttp://lucene.apache.org/java/docs/index.html\nhttp://lucene.apache.org/java/docs/features.html\nhttp://lucene.apache.org/java/docs/whoweare.html\n\nSome versioned pages...\n\nhttp://lucene.apache.org/java/2_9_1/fileformats.html\nhttp://lucene.apache.org/java/3_0_3/fileformats.html\n...all the release specific javadocs\n\nIIRC, the \"versioned\" pages are not checked in to svn, they are just unziped dumps of the docs from the corresponding release.\n\nmy understanding is that with the new CMS, all of those pages will need to go into SVN - not a big deal really, they go in once and never change ",
            "author": "Hoss Man",
            "id": "comment-12969421"
        },
        {
            "date": "2011-08-02T21:11:08+0000",
            "content": "I wonder if the best thing to do here is to simply start fresh and clean and simply leave all existing content up as is and link to it as the \"old\" content. ",
            "author": "Grant Ingersoll",
            "id": "comment-13078434"
        },
        {
            "date": "2011-08-06T21:27:31+0000",
            "content": "Making some progress on this.  Here's my intent:  We start clean.  One website directory for all of our projects (Lucene, Solr, PyLucene and ORP).  I'm more or less copying the layout of Mahout, which copied Open For Biz.  It's a lot cleaner and a lot nicer to look at.  I intend to move the old sites to an archive area and just link to them.\n\nWe'll still need to figure out per release docs, but I suspect it won't be that hard to convert that stuff to Markdown going forward and having our deploy/release mechanism just publish it to the CMS. ",
            "author": "Grant Ingersoll",
            "id": "comment-13080463"
        },
        {
            "date": "2011-08-06T22:13:44+0000",
            "content": "If you wish to build/test locally, do the setup at: http://www.apache.org/dev/cmsref.html#local-build\n\nThen run:\n\n<path>/build_site.pl --source-base [Path to Lucene CMS SVN checkout top dir] --target-base [OUTPUT] ",
            "author": "Grant Ingersoll",
            "id": "comment-13080471"
        },
        {
            "date": "2011-08-06T22:48:36+0000",
            "content": "I'm more or less copying the layout of Mahout, which copied Open For Biz.\n\n+1, I like the looks of the Mahout site. ",
            "author": "Yonik Seeley",
            "id": "comment-13080480"
        },
        {
            "date": "2011-08-07T14:55:33+0000",
            "content": "Made my first commit - update the solr logo from the old one to the new one.\n\nOverall, I already like this much more than the old system - despite the somewhat painful setup process. We need to work on documenting that better I think.\n\nNot sure I like the idea of having to run this markup daemon in the background though... ",
            "author": "Mark Miller",
            "id": "comment-13080584"
        },
        {
            "date": "2011-08-07T19:01:02+0000",
            "content": "We'll still need to figure out per release docs, but I suspect it won't be that hard to convert that stuff to Markdown going forward and having our deploy/release mechanism just publish it to the CMS.\n\nI would actually argue that the \"per release\" docs don't need to have the same look/feel as the site – probably better actually moving forward to make them clearly distinct so there is an obvious distinction between \"the site\" and \"the docs\" (which may also help to prevent us from inadvertently putting relative links in the \"per release\" docs that wont work from a local install of a release)\n\nOn the java side of things, moving all of the per-release docs into the javadoc process (using the doc-files dir, and linking to them from overview.html) would be one good way to keep everything encapsulated nicely.\n\nI haven't dug into it, but the Apache CMS Ref guide has an details on how to publish a big tar ball of auto-generated docs into the CMS, with an example of how to automate the process with a script (ie: from hudson for nightly docs or as part of a release manager script)\n\nhttps://www.apache.org/dev/cmsref.html#generated-docs ",
            "author": "Hoss Man",
            "id": "comment-13080628"
        },
        {
            "date": "2011-08-08T01:06:36+0000",
            "content": "Not sure I like the idea of having to run this markup daemon in the background though...\n\nOnce we get it up and running, we likely can just commit and then check the staging site.  The CMS has a means to push to production from staging.  For now, though, w/ multiple people working actively on it, we'll need to do it locally. ",
            "author": "Grant Ingersoll",
            "id": "comment-13080709"
        },
        {
            "date": "2011-08-08T06:35:21+0000",
            "content": "Once we get it up and running, we likely can just commit and then check the staging site\n\nmore importantly: for most small changes (adding new committers, posting release announcements, etc...) the CMS bookmarklet (which lets you edit live pages from your browser) will probably be all you'll ever need to use\n\nhttps://cms.apache.org/ ",
            "author": "Hoss Man",
            "id": "comment-13080773"
        },
        {
            "date": "2011-08-08T14:24:12+0000",
            "content": "On the java side of things, moving all of the per-release docs into the javadoc process (using the doc-files dir, and linking to them from overview.html) would be one good way to keep everything encapsulated nicely.\n\nI like the thought of moving those things into Javadocs, but it still means converting from Forrest to another format, although it likely isn't that hard to do, given we could render it as HTML and then cut and paste the pertinent content (minus the boilerplate) over to javadoc html. ",
            "author": "Grant Ingersoll",
            "id": "comment-13080964"
        },
        {
            "date": "2011-08-08T14:48:54+0000",
            "content": "This is shaping up nicely.  I've got a fair bit of the look and feel ironed out and it isn't half bad looking, IMO.\n\nWhat needs to be done now:\n\n\tFlesh out the rest of the mantle (slide) images for the top level and sub project sites (so they aren't all the same)\n\tClean up some transparency issues in the Lucene logo at the top of the page\n\tGet the rest of the main site content moved over\n\tMove over PyLucene and ORP\n\tPrepare the old sites to be moved per the placeholders in the new site\n\tAdd in a news section to the site\n\tFill in missing links, etc. and do a copy edit on the content\n\n\n\nI think if we can get most of these done soon, it would be in good enough shape to migrate. ",
            "author": "Grant Ingersoll",
            "id": "comment-13080980"
        },
        {
            "date": "2011-08-08T15:15:08+0000",
            "content": "News is hooked in.  Taking a break.  If others want to jump in on the other items, it would be most appreciated. ",
            "author": "Grant Ingersoll",
            "id": "comment-13080995"
        },
        {
            "date": "2011-08-08T15:48:23+0000",
            "content": "stuck in directory hell for a while, but I popped off #2 real quick. ",
            "author": "Mark Miller",
            "id": "comment-13081014"
        },
        {
            "date": "2011-08-10T11:34:58+0000",
            "content": "I'm hooking in Google Analytics, which ASF says is fine as long as we publish a privacy policy.  If you are a committer and want access to the info and are willing to comply with the ASF privacy policy, please send me your Google account name. ",
            "author": "Grant Ingersoll",
            "id": "comment-13082288"
        },
        {
            "date": "2011-08-10T13:27:10+0000",
            "content": "#4 above, migrate PyLucene and ORP is more or less done.  Those on PyLucene may wish to do more. ",
            "author": "Grant Ingersoll",
            "id": "comment-13082322"
        },
        {
            "date": "2011-08-10T13:27:54+0000",
            "content": "#6 is also done\n\n#1 is going to take some graphic design skills, I think, to make interesting images. ",
            "author": "Grant Ingersoll",
            "id": "comment-13082324"
        },
        {
            "date": "2011-08-10T14:59:48+0000",
            "content": "#3 is done.  Need to clean up how news gets included on pages ",
            "author": "Grant Ingersoll",
            "id": "comment-13082382"
        },
        {
            "date": "2011-08-10T16:24:32+0000",
            "content": "I tested home page on IE8 and here are few UI issues that I found. Some of them are trivial. \n\nHere are list of issues:\n1. Javascript error on page load. Details in the Google doc\n2. Menu bar looks different than ff5\n3. Text Transitions are not smooth as FF5. Intermediate states are visible for about 1 sec.\n4. Top right text box size is different than drop down.\n5. Header Text appears to be cut off from the bottom. Visible on \"Large, Vibrant community\"\n\nI have consolidated the list of issues with screenshots at https://docs.google.com/document/d/1VMes9KPBSXuCQdhSVuI-cw0L9bNfq-QwJ7pzKRYhAZY/edit?hl=en_US ",
            "author": "Param Sethi",
            "id": "comment-13082445"
        },
        {
            "date": "2011-08-10T16:55:49+0000",
            "content": "Thank you Grant for getting this going.\n\n#4 above, migrate PyLucene and ORP is more or less done. Those on PyLucene may wish to do more.\n\nI did a quick check for PyLucene: some fonts are HUGE and the entire jcc section (accessible from a tab in the old site) is gone.\nI hope to be able to get to this within a week or two...  ",
            "author": "Andi Vajda",
            "id": "comment-13082467"
        },
        {
            "date": "2011-08-21T23:24:19+0000",
            "content": "I made some progress today:\n\n\tsetup local copy of site with the software needed to generate it\n\thooked up missing pylucene/jcc content and templates\n\tchecked in rev 1160081\nI still need to go through all the content and make sure all links and formatting\nare correct. And last but not least, I need to mess with the .css so that the pages\nare legible, links visible, fonts balanced, etc...\nIs there a plan to have a global CSS for all pages or is this left up to each area ?\n\n ",
            "author": "Andi Vajda",
            "id": "comment-13088489"
        },
        {
            "date": "2011-08-23T21:41:26+0000",
            "content": "\nAnd last but not least, I need to mess with the .css so that the pages\nare legible, links visible, fonts balanced, etc...\nIs there a plan to have a global CSS for all pages or is this left up to each area ?\n\nI think one of the goals was to try and make the entire \"Lucene\" site more consistent in it's look/feel/navigation (and if it wasn't, then i vote for it to be a goal) so i would say having a global css for the entire site is wise – particularly if you're seeing problems with legibility, visibility, and fonts.  we should fix that everywhere.\n\n ",
            "author": "Hoss Man",
            "id": "comment-13089787"
        },
        {
            "date": "2011-08-24T00:52:29+0000",
            "content": "I completely agree, there should one css for the whole site. Consistent look and feel is a good thing. Currently, this is not how it's setup, each template gets its own .css.\nThat would simple to change, of course.\n\nOk, I'm going to try to tweak the pylucene.css to something more legible (I'm as incompetent with .css as anyone but I can copy/paste). Once I like what I see, I'll commit that and the\nother templates are welcome to adopt it.\n\nIf someones feel like intervening there first, by all means  ",
            "author": "Andi Vajda",
            "id": "comment-13089912"
        },
        {
            "date": "2011-11-08T20:53:57+0000",
            "content": "Here is my first pass at modifying the UI to be more consistent across templates.  Cleaned up the footer and adjusted the content in the slideshow. ",
            "author": "Jeremy Bolanos",
            "id": "comment-13146558"
        },
        {
            "date": "2011-11-09T19:50:46+0000",
            "content": "Thanks Jeremy! I've committed this. ",
            "author": "Mark Miller",
            "id": "comment-13147237"
        }
    ]
}