{
    "id": "LUCENE-670",
    "title": "improper isolation (overuse of system properties) allows Lucene apps to clobber each other",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "core/index",
            "core/store"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "1.9,                                            2.0.0",
        "resolution": "Duplicate",
        "status": "Closed"
    },
    "description": "As nicely stated by the Javadoc for org.apache.commons.discovery.tools.ManagedProperties, \"System properties are global in nature, so using them easily violates sound architectural and design principles for maintaining separation between components and runtime environments.\"  Lucene's use of system properties makes it so that one web application that uses Lucene can break another web application that uses Lucene.\n\nBoth org.apache.lucene.index.SegmentReader and org.apache.lucene.store.FSDirectory use system properties to locate an implementation class.  Because of this, two applications can step on each others' toes.\n\nSo, I have two webapps running in Tomcat.  One uses the Compass Framework which sets the SegmentReader implementation class to org.apache.lucene.index.CompassSegmentReader.  My other webapp tries to initialize SegmentReader in a different classloader, and it fails with an ExceptionInInitializerError because it can't load that class.  If I get lucky, the non-Compass webapp loads first and things run smoothly.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2006-09-08T00:42:26+0000",
            "content": "This appears to be the same issue as LUCENE-636.\n\nKen: if you could take a look at that issue (and the associated patch), and indicate wether it addresses your concerns (in which case this issue should be marked a dup) or not (in which case please clarify what other problems you see not already described/addressed by that issue.\n\nfeel free to vote for LUCENE-636 as well to raise it's visibility. ",
            "author": "Hoss Man",
            "id": "comment-12433283"
        },
        {
            "date": "2006-09-08T17:23:27+0000",
            "content": "I guess I didn't search well enough for a previously submitted bug.\n\nLUCENE-636 addresses my concerns and the patch is coded very close to how I had it in my head.\n\nPlease mark this as a duplicate of LUCENE-636.  (It doesn't appear that I have permission to do so.) ",
            "author": "Ken Geis",
            "id": "comment-12433447"
        }
    ]
}