{
    "id": "LUCENE-4403",
    "title": "sharpen javadocs for DISI.docID() when unpositioned",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Spinoff from LUCENE-4401.\n\nCurrently DISI requires an unpositioned iterator to be -1 or NO_MORE_DOCS. But I think we should refine this: in my opinion NO_MORE_DOCS should mean NO_MORE_DOCS.\n\nSo its ok for it to return NO_MORE_DOCS when its unpositioned, but only if it can already determine that its exhausted.\n\nThis makes life easier on consumers.\n\n\nSeparately we cant really test this situation very well as long as the javadocs for nextDoc say, Returns the following:\n\n    -1 or NO_MORE_DOCS if nextDoc() or\n    advance(int) were not called yet.\n    NO_MORE_DOCS if the iterator has exhausted.\n    Otherwise it should return the doc ID it is currently on.\n\nThis prevents us from being able to easily assert that nobody is calling nextDoc()/advance() after the enum is exhausted, since we cannot differentiate 'exhausted' from 'uninitialized'.\n\nI think we should clarify the javadocs, such that if nextDoc()/advance() are not called yet, you can still return NO_MORE_DOCS, but only if you somehow know you are exhausted-before-you-start. NO_MORE_DOCS should mean NO_MORE_DOCS.\n\nIt could also be everyone reads it this way already, and I'm just being super-anal.\n\n\n+1 to sharpen when a DocsEnum can return NO_MORE_DOCS before nextDoc: it should only be if the enum knows it has zero docs. But I'm not even sure we should allow that ... why not always make it -1 ...? We can do that separately...",
    "attachments": {
        "LUCENE-4403.patch": "https://issues.apache.org/jira/secure/attachment/12545469/LUCENE-4403.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-17T20:26:17+0000",
            "content": "start to a patch. \n\nAs i said the javadocs are ambiguous, an unpositioned DocsEnum can return NO_MORE_DOCS, but you also shouldnt nextDoc() after you see this. \n\nBecause of the ambiguity I'm sure we have test bugs: would be good to have a test postings-format that \"caches\" (reads ahead or something) to sometimes do this and tickle them out. ",
            "author": "Robert Muir",
            "id": "comment-13457285"
        }
    ]
}