{
    "id": "LUCENE-8009",
    "title": "Support disabling Locale randomization as part of Lucene test framework",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Unresolved",
        "affect_versions": "7.1",
        "status": "Open",
        "type": "Improvement",
        "components": [
            "modules/test-framework"
        ],
        "fix_versions": []
    },
    "description": "The Lucene test framework randomizes the Locale configuration to test the software in different locale settings.\nhttps://github.com/apache/lucene-solr/blob/e2521b2a8baabdaf43b92192588f51e042d21e97/lucene/test-framework/src/java/org/apache/lucene/util/TestRuleSetupAndRestoreClassEnv.java#L206-L209\n\nWhile this is a very good practice from engineering perspective, it causes issues when the Lucene/Solr test framework is used with third-party components which may have issues working with a subset of locale settings. e.g. for Solr/Sentry integration (SENTRY-1475), we are using Solr test framework to test the sentry authorization plugin for Solr. For unit-testing, it uses Apache Derby. We have found multiple cases when derby fail to initialize for a locale configured by Solr test framework. This causes tests to fail and create a confusion with respect to the quality of the integration source-code. Since the Derby failures are not related to Solr/Sentry integration, we would like to avoid such nasty surprises by suppressing the locale randomization. This is similar to the way we suppress Solr SSL configuration (@SolrTestCaseJ4.SuppressSSL).\n\nPlease refer to discussion on dev mailing list for more context,\nhttp://lucene.472066.n3.nabble.com/Solr-test-framework-Locale-randomization-td4359671.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16218121",
            "date": "2017-10-25T05:32:58+0000",
            "content": "Thank you Hrishikesh. I will review and commit your patch once you submit it. Please take a look at the existing Suppress... annotations and how they work in LuceneTestCase – follow the examples. ",
            "author": "Dawid Weiss"
        }
    ]
}