{
    "id": "LUCENE-4217",
    "title": "Load clover.jar from ivy-cachepath and store license key in SVN",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/build"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "When clover granted use the license for their clover-2.6.3.jar file they allowed us to ship this license file to every developer. Currently clover setup is very hard for users, so this issue will make it simple.\n\nIf you want to run tests with clover, just pass -Drun.clover=true to ant clean test. ANT will then download clover via IVY and point it to the license file in our tools folder. The license is supplemented by the original mail from Atlassian, that everybody is allowed to use it with code in the org.apache. java package.",
    "attachments": {
        "LUCENE-4217.patch": "https://issues.apache.org/jira/secure/attachment/12536251/LUCENE-4217.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-12T18:23:31+0000",
            "content": "Hi,\n\nattached is a patch with a complete overhaul of the Clover reporting on Lucene + Solr:\n\n\n\tClover is loaded by IVY from Maven Central\n\tThe License file was committed to lucene/tools/clover and is automatically used. This is possible according to the mail from Nicolas Muldon:\n\n\n\n\nOn Fri, Dec 18, 2009 at 1:33 AM, Nicholas Muldoon <nmuldoon@atlassian.com> wrote:\n---------------------------------------------------------------------------------\n\nHi,\nAtlassian are excited to be presenting Apache with a site license for Clover\n2.6.\n\nThis Clover license can be used for any code that is under an org.apache\npackage. Further, this license can be used by any developer on their machine\nin conjunction with our Eclipse or IntelliJ plugins for development on an\norg.apache project.\n\n\n\nAlso Mike & me talked to Nicholas and Nick Pellow, and we got the following response:\n\n\nOn Sat, Dec 19, 2009 at 10:38 PM, Nick Pellow <npellow@atlassian.com> wrote:\n> Hi Mike,\n>\n> That would be great if you could forward this to committers@apache.org.\n> The license is available to anyone working on the org.apache.* be it \n> in IDEA/Eclipse/Ant/Maven locally, or on a central build server.\n>\n> Since the license will only instrument and report coverage on \n> org.apache packages, please mention that it is fine to commit this \n> license to each project if it makes running builds easier. ie just \n> check out the project and run with Clover, without the need for the \n> extra step of locating and installing the clover license.\n>\n>\n> Cheers,\n> Nick\n>\n>\n>\n> On 19/12/2009, at 1:11 AM, Michael McCandless wrote:\n>\n>> Woops, I meant \"The only restriction is that it will only test \n>> coverage of packages under org.apache\", below.\n>>\n>> Mike\n>>\n>> On Fri, Dec 18, 2009 at 9:05 AM, Michael McCandless \n>> <lucene@mikemccandless.com> wrote:\n>>>\n>>> Since this generous offer extends beyond Lucene...\n>>>\n>>> I'd like to forward this to committers@apache.org, pointing to where \n>>> the license is available\n>>>\n>>> (https://svn.apache.org/repos/private/committers/donated-licenses/cl\n>>> over/2.6.x), explaining that Lucene upgraded (providing the link to \n>>> our coverage report), etc.\n>>>\n>>> But I wanted to confirm with you all first: is this OK?  This \n>>> license may be used by anyone?  The only restriction is that it will \n>>> only test coverage of packages under org.apache.lucene?\n>>>\n>>> I can draft something up and run it by you all first, if this makes \n>>> sense...\n\n\n\n\n\tThe ANT tasks were cleaned up and now work per module without crazy filesets. Only test-framework is not clovered, as it was explicitely disabled by the managers of the new buildsystem. Unfortunately if your make compile-core in test-framework depend on clover, it will correctly clover it, but as its in src/ and not /test it will be counted as source code and not test code and appears in the report as such. I left it disabled for now until we find a solution.\n\tSolr now reports everything also coverage on all referred Lucene modules (cool!)\n\n\n\nIf you want to run a test build with clover, do:\n\n\n# must be cleaned first on top-level, so all half baked code is gone\nant clean\n# go to lucene or solr\nant -Drun.clover=true test generate-clover-reports\n\n\n\nThis downloads clover from Maven central and runs all tests with clover and publishes the report. The target folder changed a bit (clenaup), we must change Jenkins config/scripts (I can do).\n\nFor Lucene and Solr the Cloverage Database is always placed in Lucene's build folder (as before), this is why you must clean on top-level. ",
            "author": "Uwe Schindler",
            "id": "comment-13413038"
        },
        {
            "date": "2012-07-12T18:26:29+0000",
            "content": "I wanted to mention: The code in the attached patch is ASF of course, but the License File is of course not Apache License. But there is only one checkbox in JIRA! ",
            "author": "Uwe Schindler",
            "id": "comment-13413044"
        },
        {
            "date": "2012-07-12T18:29:50+0000",
            "content": "We should maybe exclude the License file from the Source ZIP/TGZ file, but keep it in SVN? it's just an <excludes.../> ",
            "author": "Uwe Schindler",
            "id": "comment-13413050"
        },
        {
            "date": "2012-07-12T21:37:39+0000",
            "content": "Small patch improvements and correct mail extract in README. ",
            "author": "Uwe Schindler",
            "id": "comment-13413249"
        },
        {
            "date": "2012-07-13T21:58:34+0000",
            "content": "Final patch. I added exclusion of the license from src.tgz files (like the javadoc6 package list) and by the way fixed Solr's file attributes (SOLR-3328).\n\nI will commit this tomorrow and reconfigure Jenkins if nobody objects!\n\n(the License file in this patch is not ASF licensed) ",
            "author": "Uwe Schindler",
            "id": "comment-13414095"
        },
        {
            "date": "2012-07-14T07:33:30+0000",
            "content": "Committed trunk r1361480, 4.x r1361481.\nAlso committed nightly changes in 1361482. ",
            "author": "Uwe Schindler",
            "id": "comment-13414314"
        },
        {
            "date": "2012-07-14T11:41:56+0000",
            "content": "Clover reports of Lucene and Solr look cool, no problems on Jenkins.\n\nThe Solr report now also contains coverage on referenced Lucene classes (packages not used by Solr at all are excluded as not compiled): https://builds.apache.org/job/Solr-trunk/1912/clover-report/\n\nOf course the overall coverage percentage got lower by this, but we can clearly see in this report which cool features of Lucene are completely unused by Solr. ",
            "author": "Uwe Schindler",
            "id": "comment-13414363"
        }
    ]
}