{
    "id": "LUCENE-7691",
    "title": "ArrayLists should be created with explicit size if known",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Improvement",
        "components": [],
        "fix_versions": []
    },
    "description": "Many places in Lucene there are ArrayLists being created with no explicit size set even when the exact size is known in advance. In these places, the size should be passed in so the underlying array is sized correctly the first time.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15862529",
            "date": "2017-02-11T20:56:10+0000",
            "content": "I'd say this matters only for really super-hot codepaths (and only when the list in question does subsequent few expansions)? So I'd focus just on those 5% of crucial invocations, not all of them (when, ironically, computing the size of the target list may be eventually more costly than cheap tlab reallocations). ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-15862530",
            "date": "2017-02-11T20:58:57+0000",
            "content": "See also https://shipilev.net/blog/2016/arrays-wisdom-ancients/\n\nIt's about converting a Collection to an array and whether you should pass a properly sized array or not when you call .toArray. ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-15862535",
            "date": "2017-02-11T21:10:30+0000",
            "content": "GitHub user michaelbraun opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/157\n\n    LUCENE-7691 - add explicit size to arraylist creation if known\n\n\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/michaelbraun/lucene-solr lucene-7691\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/157.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #157\n\n\ncommit 5bf7f71925aa8c4b2055feb5f4433b90db39249f\nAuthor: Michael Braun <n3ca88@gmail.com>\nDate:   2017-02-11T21:06:19Z\n\n    LUCENE-7691 - add explicit size to arraylist creation if known\n\n ",
            "author": "ASF GitHub Bot"
        },
        {
            "id": "comment-15862538",
            "date": "2017-02-11T21:12:52+0000",
            "content": "I had already done this as an exercise earlier - let me know what parts you like / don't like from this. This is limited just to code only where we know the exact size of the collection, not an upper bound, and I only looked for new ArrayList, so .toArray was not part of the scope. Really interesting article - just read through it. Let me know what you think about the PR.  ",
            "author": "Michael Braun"
        }
    ]
}