{
    "id": "LUCENE-4786",
    "title": "Out of date API document-SinkTokenizer",
    "details": {
        "components": [
            "modules/analysis"
        ],
        "fix_versions": [],
        "affect_versions": "4.1",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "The following API document talks about SinkTokenizer:\nhttp://lucene.apache.org/core/4_1_0/analyzers-common/org/apache/lucene/analysis/sinks/package-summary.html\n\nHowever, SinkTokenizer is deleted and replaced by TeeSinkTokenFilter in lucene 4.1, according to the change log:\nhttp://lucene.apache.org/core/4_1_0/changes/Changes.html\n\nLUCENE-1422, LUCENE-1693: New TokenStream API that uses a new class called AttributeSource instead of the Token class, which is now a utility class that holds common Token attributes. All attributes that the Token class had have been moved into separate classes: TermAttribute, OffsetAttribute, PositionIncrementAttribute, PayloadAttribute, TypeAttribute and FlagsAttribute. The new API is much more flexible; it allows to combine the Attributes arbitrarily and also to define custom Attributes. The new API has the same performance as the old next(Token) approach. For conformance with this new API Tee-/SinkTokenizer was deprecated and replaced by a new TeeSinkTokenFilter. \n\nPlease update the API documents to reflect the latest code.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-02-22T00:04:24+0000",
            "content": "[branch_4x commit] Adrien Grand\nhttp://svn.apache.org/viewvc?view=revision&revision=1448859\n\nLUCENE-4784, LUCENE-4785, LUCENE-4786: Fixed references to deprecated classes SinkTokenizer, ValueSourceQuery and RangeQuery (merged from r1448852).\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13583702"
        },
        {
            "date": "2013-02-22T00:04:27+0000",
            "content": "[trunk commit] Adrien Grand\nhttp://svn.apache.org/viewvc?view=revision&revision=1448852\n\nLUCENE-4784, LUCENE-4785, LUCENE-4786: Fixed references to deprecated classes SinkTokenizer, ValueSourceQuery and RangeQuery.\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13583706"
        }
    ]
}