{
    "id": "LUCENE-6462",
    "title": "Latin Stemmer for lucene",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "modules/analysis"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "In the latest lucene package there is no stemmer for Latin language. I have a stemmer for latin language which is a rule based program based on the grammar and rules of Latin",
    "attachments": {
        "LatinStemmer.java": "https://issues.apache.org/jira/secure/attachment/12731964/LatinStemmer.java"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14527828",
            "author": "Niki",
            "date": "2015-05-05T03:00:11+0000",
            "content": "When searching for a LatinStemmer, I found this link from Lucene/Solr https://github.com/scherziglu/solr/blob/master/solr-analysis/src/main/java/org/apache/lucene/analysis/la/LatinStemmer.java. \nThis program does not stem most words properly and also unnecessarily adds an 'i' amongst other things.\nI modified the above code to accomodate the rules of stemming in Latin. "
        },
        {
            "id": "comment-14538286",
            "author": "Niki",
            "date": "2015-05-11T17:55:58+0000",
            "content": "This file is a replacement of previous LatinStemmer with extended rules covering different verbs and nouns. "
        },
        {
            "id": "comment-14538306",
            "author": "Niki",
            "date": "2015-05-11T18:04:35+0000",
            "content": "Hi Professor Chris A. Mattmann,\n\nAs we talked about it before, submitting a request to use my modified Latin Stemmer.\nLet me know if you need more information about what the code does.\n\nThanks. "
        },
        {
            "id": "comment-14538398",
            "author": "Uwe Schindler",
            "date": "2015-05-11T18:42:28+0000",
            "content": "Hi Niki,\nthe Latin Stemmer was originally written by Markus Klose. I would prefer to submit your patch to his Github repository: https://github.com/scherziglu/solr\n\nIf Markus wants to donate his whole code (including the TokenFilters) to Lucene, he should do this on himself to provide proper attribution to his work. The stemmer alone (as attached to this issue) is not so helpful.\n\nIn general stemmers should not necessarily produce \"correct\" forms, they should just \"normalize\" terms to something which can be compared with other terms during query execution. So before making changes to stemmers it is very important to test those changes with a corpus of latin texts and and compare the results of queries on them. For search engines, stemmers should also be light (so not to remove too much information).\n\nIn addition, this code has several problems: Why does it lookup the -que forms in a List instead of a CharArraySet? "
        },
        {
            "id": "comment-14539196",
            "author": "Chris A. Mattmann",
            "date": "2015-05-12T04:12:02+0000",
            "content": "Thanks for your comments Uwe. I encouraged Niki to submit her code to Lucene since she found it to be more useful than the default stemmer provided related to Latin corpuses in her work at USC. Thanks for the suggestions and I hope Niki takes you up on them - they are spot on. "
        }
    ]
}