{
    "id": "LUCENE-3819",
    "title": "Clean up what we show in right side bar of website.",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "I'd love to remove a couple things - it's pretty crowded on the right side bar. I find the latest JIRA and email displays are hard to read, tend to format badly, and don't offer much value.\n\nI'd like to remove them and just leave svn commits and twitter mentions (which are much easier to read and format better). Will help with some info overload on each page.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-02-22T15:44:00+0000",
            "content": "+1\n\nAnd make the sidebar take less horizontal space too (currently ~40%) ",
            "author": "Yonik Seeley",
            "id": "comment-13213713"
        },
        {
            "date": "2012-02-22T16:20:22+0000",
            "content": "+1, Mark.  +1, Yonik.  \n\nI also think it might be useful to have download shortcuts to Lucene Core (Java) and Solr available in the sidebar from http://lucene.apache.org/.  Perhaps \"Download\" could be considered becoming a standard sidebar item for the subprojects?\n\n ",
            "author": "Christian Moen",
            "id": "comment-13213740"
        },
        {
            "date": "2012-02-22T16:39:44+0000",
            "content": "I also think it might be useful to have download shortcuts to Lucene Core (Java) and Solr available in the sidebar from http://lucene.apache.org/. \n\nHow do you propose we do this?\n\nRight now we have links to each subproject called User Resources (could use a better name) - Should we add another section below that called Project Downloads? And rename User Resources to Projects or something? ",
            "author": "Mark Miller",
            "id": "comment-13213753"
        },
        {
            "date": "2012-02-22T17:29:04+0000",
            "content": "Thanks, Mark.\n\nI like your idea of renaming \"User Resources\" to \"Projects\" on the top level page. \"Lucene Projects\" is perhaps also possible, but I think I like \"Projects\" better.\n\nRegarding downloads, the idea was to make convenience links to the most common downloads – Lucene Core and Solr – from the top page, but I realize this breaks the layering structure somewhat.  Perhaps \"Downloads\", \"Common Downloads\" or \"Download Shortcuts\" makes sense?\n\nAlternatively, we could put download buttons for Lucene Core and Solr in the sidebar. If we follow this approach perhaps we might want to move the buttons to the sidebar for the Lucene Core and Solr page as well.\n\nTo sum up, I'm proposing:\n\n\n\tWe rename \"User Resources\" to \"Projects\" as you suggested (on the top page)\n\tWe add two download buttons for Solr and Lucene to the sidebar (on the top page)\n\tWe move the download button to the sidebar on the Lucene Core and Solr pages.\n\n\n\n(Lucene gets a green button and Solr gets an orange button on the relevant pages.)\n\nThoughts? ",
            "author": "Christian Moen",
            "id": "comment-13213776"
        },
        {
            "date": "2012-02-22T17:48:11+0000",
            "content": "+1 to all of Christian's suggestions ",
            "author": "Steve Rowe",
            "id": "comment-13213787"
        },
        {
            "date": "2012-02-22T18:56:05+0000",
            "content": "Thoughts?\n\nSounds good - I've made a first pass at this. ",
            "author": "Mark Miller",
            "id": "comment-13213848"
        },
        {
            "date": "2012-02-22T20:20:34+0000",
            "content": "I just made some more improvements as well. ",
            "author": "Mark Miller",
            "id": "comment-13213966"
        },
        {
            "date": "2012-02-22T20:36:05+0000",
            "content": "Explicitly, based on some informal feedback and my thoughts:\n\n1. Changed color of Solr download button to orange.\n2. On the main page, put small gray text indicating what each download button points to (lucene/solr)\n3. Added new redirects so that Download buttons now points to the latest release explicitly (3.5) ",
            "author": "Mark Miller",
            "id": "comment-13213983"
        },
        {
            "date": "2012-02-22T21:11:46+0000",
            "content": "So I'm done here for now - just made my last tweak. Thank you everyone for your suggestions and input! ",
            "author": "Mark Miller",
            "id": "comment-13214009"
        }
    ]
}