{
    "id": "SOLR-3659",
    "title": "non-reproducible failures from RecoveryZkTest - mostly NRTCachingDirectory.deleteFile",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Implemented",
        "status": "Closed"
    },
    "description": "Since getting my new laptop, i've noticed some sporadic failures from RecoveryZkTest, so last night tried running 100 iterations againts trunk (r1363555), and got 5 errors/failures...\n\n\n\t3 asertion failures from NRTCachingDirectory.deleteFile\n\t1 node recovery assertion from AbstractDistributedZkTestCase.waitForRecoveriesToFinish caused by OOM\n\t1 searcher leak assertion: opens=1658 closes=1652 (possibly lingering affects from OOM?)\n\n\n\nsee comments/attachments for details",
    "attachments": {
        "RecoveryZkTest.testDistribSearch-100-tests-failures.txt.tgz": "https://issues.apache.org/jira/secure/attachment/12537382/RecoveryZkTest.testDistribSearch-100-tests-failures.txt.tgz",
        "just-failures.txt": "https://issues.apache.org/jira/secure/attachment/12537383/just-failures.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-20T18:42:50+0000",
            "content": "Full tests-failures.txt (compressed) and a summary file containing just the failure stack traces (no log output)  ",
            "author": "Hoss Man",
            "id": "comment-13419425"
        },
        {
            "date": "2012-07-20T18:48:44+0000",
            "content": "Probably related to https://issues.apache.org/jira/browse/LUCENE-4238\n\nI didn't see it in that test, but I've seen it. I have a small test case that demonstarts one of the problems. ",
            "author": "Mark Miller",
            "id": "comment-13419429"
        },
        {
            "date": "2012-07-20T18:53:18+0000",
            "content": "Don't you think the problem is likely that solr's replication doesnt use the Directory api, instead works on Files directly, and its accessing NRTCachingDir's delegate FSDir, then modifying files in that directory all \"underneath\" nrtcachingdir? ",
            "author": "Robert Muir",
            "id": "comment-13419438"
        },
        {
            "date": "2012-07-20T19:02:51+0000",
            "content": "I don't know what's causing it...\n\nBut the assert that is generally tripped on delete is tripped because its trying to uncache a file and finds it in the delegate - and its trying to assert the file is not in both - and I can seem to cause that condition kind of easily in a simple multi threaded nrtdir test.\n\nI'm also not sure that removing files underneath this dir would cause that situation - it would seem not. ",
            "author": "Mark Miller",
            "id": "comment-13419447"
        },
        {
            "date": "2012-07-20T19:07:35+0000",
            "content": "ok, i know i ran into hellacious problems trying to get all tests using mockdirectorywrapper, i had to disable it\nin the TestReplicationHandler for this reason because it adds files outside of the directory api, calling sync itself\n(but mockdirectorywrapper doesnt know about this).\n\nThis also makes it impossible to re-use MDW's facilities for testing disk full etc (e.g. SOLR-3023). ",
            "author": "Robert Muir",
            "id": "comment-13419451"
        },
        {
            "date": "2012-07-20T19:15:30+0000",
            "content": "Yeah, I'm not ruling it out either - I try to be very careful before filing lucene bugs based on replication stuff and solrcloud especially (with all its jetty killing and what not). But I seemed to be able to cause the same situation with an isolated test (im not tripping the same assert, but causing a different exception in close because of the same invariant). So I'm somewhat sure it's a real issue with the dir, but since I don't have a fix, I don't know for sure. I tried just over syncing by synchronizing every method in that dir, but no luck  ",
            "author": "Mark Miller",
            "id": "comment-13419459"
        },
        {
            "date": "2012-07-20T19:46:38+0000",
            "content": "I hope this will solve the tests on SDDS Jenkins, too \n\nBTW: Can somebody disable testing DIH? It fails 50% of all time in any test out of all. ",
            "author": "Uwe Schindler",
            "id": "comment-13419496"
        },
        {
            "date": "2012-07-20T20:01:33+0000",
            "content": "BTW: Can somebody disable testing DIH? It fails 50% of all time in any test out of all.\n\nCan you be more specific  I'm trying to decipher 50% of all time in any test out of all \n\nI know one particular test keeps failing that I see on jenkins - am I missing something, or is it more tests than that?\n\nLets open an issue with the particulars and perhaps we can draw some attention to it. ",
            "author": "Mark Miller",
            "id": "comment-13419506"
        },
        {
            "date": "2012-07-20T20:03:23+0000",
            "content": "I hope this will solve the tests on SDDS Jenkins, too \n\nUsually when I see this particular test fail in jenkins runs, its that merge exception right? That is something else - I'd need to dig back in emails, but I figured out what was causing that and we had a short discussion about it - the issue itself is harmless - we just have to figure out a way to make it so that it doesn't fail the test. If I'm remembering right. ",
            "author": "Mark Miller",
            "id": "comment-13419507"
        },
        {
            "date": "2012-07-20T20:04:42+0000",
            "content": "Please don't disable DIH tests.  Its \"TestSqlEntityProcessorDelta2.testCompositePk_DeltaImport_add_delete\" that fails, right? Could we just @Ignore that one for now?  I do have it in mind to re-do all the SqlEntityProcessor tests, hopefully this Summer. (I'm trying here to help save DIH from the \"svn rm\" that was proposed back in February!) ",
            "author": "James Dyer",
            "id": "comment-13419509"
        },
        {
            "date": "2012-07-20T20:13:34+0000",
            "content": "Please don't disable DIH tests.\n\nI don't want to disable all tests  But those who fail, I have no idea a bout the code, so somebody working on DIH should do it.\n\nIts \"TestSqlEntityProcessorDelta2.testCompositePk_DeltaImport_add_delete\" that fails, right? Could we just @Ignore that one for now?\n\nCan you do this, please! It fails all the time. I am trying to ignore DIH completely, but this test failure annoys me. I tried to work on DIH and change all the API from Reader -> InputStream in the past (because the input can be anything else than text, like XML - which is not text, it just looks like it, SOLR-2347), but gave up. ",
            "author": "Uwe Schindler",
            "id": "comment-13419517"
        },
        {
            "date": "2012-07-20T20:14:55+0000",
            "content": "Usually when I see this particular test fail in jenkins runs, its that merge exception right?\n\nI dont know, it is quite often that TestZkRecover fails, too. I always see failing Solr tests, I have no idea anymore about what different types of patterns we have in the failures. ",
            "author": "Uwe Schindler",
            "id": "comment-13419520"
        },
        {
            "date": "2012-07-20T20:59:40+0000",
            "content": "I dont know, it is quite often that TestZkRecover fails, too\n\nYeah, with that merge exception - it's not a real fail. The merge exception should be ignored and not fail the test. ",
            "author": "Mark Miller",
            "id": "comment-13419567"
        },
        {
            "date": "2012-07-20T21:08:05+0000",
            "content": "Ah OK, it is still strange that this merge exception occurs. In my opinion that should not happen! ",
            "author": "Uwe Schindler",
            "id": "comment-13419570"
        },
        {
            "date": "2012-07-20T21:23:38+0000",
            "content": "Off-topic now, but to keep this discussion in one place:\n\nSee the discussion here: http://markmail.org/message/txiwakxolegjqafv\n\nI close the IW and tell it to wait for merges to finish. Then I close the directory. Because this is a cloud test with lost of jetties running, at the end of the test I have to shut them down - in many cases i want to test non graceful shutdowns - I want to shut them down quickly. That causes an interrupt, that causes IW.close to return, that causes the dir to be closed while merge threads are still running.\n\nFrom my tests perspective, I really don't care that this happens.\n\nI played around with always doing graceful shutdowns, but not only do I want to test none graceful shutdowns, making everything graceful makes the tests a lot longer. Also, I don't care about that exception even if it was killer, because either im going to restart jetty and replace that index with recovery or we are shutting down and the test is over. \n\nI'm using the API's sanely - I can't control that interrupt easily. ",
            "author": "Mark Miller",
            "id": "comment-13419584"
        },
        {
            "date": "2012-07-20T21:28:55+0000",
            "content": "Thanks for update! Sorry, I did not want to interrupt you working on that issue, it just looked similar to me. ",
            "author": "Uwe Schindler",
            "id": "comment-13419587"
        },
        {
            "date": "2012-08-28T13:32:25+0000",
            "content": "This should be fixed now. ",
            "author": "Mark Miller",
            "id": "comment-13443160"
        },
        {
            "date": "2012-08-28T13:35:40+0000",
            "content": "Thanks Mark. ",
            "author": "Dawid Weiss",
            "id": "comment-13443162"
        },
        {
            "date": "2016-10-11T20:45:13+0000",
            "content": "Issues says \"all fixed\" 4 years ago. Close? ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15566548"
        }
    ]
}