{
    "id": "LUCENE-219",
    "title": "PhraseQuery AND TermQuery differs from SpanNearQuery AND TermQuery",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "It appears that PhraseQuery may be broken when used with And in Lucene-1.4-RC2.\n This is demonstrated by the fact that equivalent PhraseQuery and SpanNearQuery\ns return different results combined with single TermQuery s using BooleanQuery\nin AND mode return different results.  This can be demonstrated by creating a\nsimple index using the provided demo code with a minor modification.\n\nIndex the following 3 documents using the Lucene-1.4-rc2 demo file IndexFiles.java\nFile 1\nXIE20000518.0115\n– The Clinton administration's drive to normalize trade\nrelations with China cleared important congressional hurdles\nWednesday with surprising ease as the measure appeared to pick up\nmomentum in advance of next week's crucial House vote.\n– Sierra Leone's pro-government troops captured rebel leader\nFoday Sankoh Wednesday, triggering jubilant celebrations in the\ncapital by residents who have long despised Sankoh and his\nRevolutionary United Front's brutality against civilians during\nthe West African nation's eight-year civil war.\nThe New York Times:\n– Calling trade relations with China the work of \"13 years and\nthree administrations,\" Governor George W. Bush of Texas urged\nWednesday Congressional Republicans and Democrats alike to support\nPresident Clinton and vote next week to grant China permanent\ntrade rights.\n– Embracing a strikingly broad concept of national security,\nPresident Bill Clinton on Wednesday told the graduating class of\nthe United states Coast Guard Academy that the world was becoming\nmore dangerous with new threats from disease, terrorism and even\nglobal warming.\nThe Wall Street Journal:\n– A dog debt negotiator well known in Western financial\ncircles, Mikhail Kasyanov won easy confirmation as prime minister\nfrom Russia's parliament after a speech mixing promises of reform\nwith populist pledges to avoid measures that could hurt ordinary\nRussians.\n– The U.S. Justice Department reiterated Wednesday that its\nplan to break up Microsoft Corp. is the only practical solution to\naddressing the software company's pattern of anticompetitive\nbehavior, without unduly burdening the technology industry and\ndamaging the New Economy.\n\nFile 2\nXIE20000701.0187\nClinton E-Signs Electronic Signature Bill\nWASHINGTON, June 30 (Xinhua) – Using a smart card and his\ndog's name as password, U.S. President Bill Clinton Friday e-\nsigned into law a bill that gives electronic signatures the same\nstatus as their ink-and-paper counterparts.\nThe president inserted the smart card into a computer and typed\nin his dog's name, Buddy, as the password. After a while, the\ncomputer screen said: \"The Electronic Signatures in Global and\nNational Commerce Act is now a law.\" The signing ceremony took\nplace in Congress Hall of Philadelphia.\n\"It works,\" Clinton told the audience of about 100 local\ncollege students.\nHe said Americans will soon be able to use the cards \"for\neverything from hiring a lawyer to closing a mortgage.\"\nSupporters said the electronic signature bill, passed in mid\nJune by Congress, will make it easier for both companies and\nconsumers to do business online.\nFor instance, computer users would be able to take out\nmortgages, buy insurance, even enter a binding contract with their\nroofer without ever leaving their home, signing a piece of paper\nor waiting for back-and-forth of mailed paperwork.\nAnd business negotiating contracts with each other could enter\nbinding agreements without having to send paper documents\novernight.\nThe bill could revolutionize banking by letting buyers close\nmortgages and car loans 24 hours a day, said Jerry Buckley of the\nElectronic Financial Services Council, a lobbying group.\nMichael Hogan, senior vice president of online brokerage DLJ\nDirect said his company will let clients open accounts and receive\nstatements online.\nThe technology to allow for secure e-signatures is still being\ndeveloped, however. Among the approaches are encrypted numeric\ncoding devices and fingerprint or iris scans attached to computers\nthat verify a person's identity.\n\nFile 3\nXIE19990818.0210\nMajor News Items in Leading Israeli Newspapers\nJERUSALEM, August 18 (Xinhua) – The following are major news\nitems in leading Israeli newspapers Wednesday.\nThe Jerusalem Post:\n– U.S. President Bill Clinton wrote a letter to Palestinian\nNational Authority Chairman Yasser Arafat Tuesday, promising that\nWashington is ready to do everything necessary to get the peace\nprocess back on track.\nPalestinian officials said the letter showed that the U.S. is\ndeeply involved in the peace process and keen to see the Wye\nagreement back on track. Israeli Prime Minister Ehud Barak also\nreceived a letter from Clinton this week, the contents of which\nwere not disclosed.\nHaaretz:\n– Israel sent a 120-person rescue mission to Turkey Tuesday to\nhelp rescue survivors of a devastating earthquake. The group\nincluded a search and rescue team with specially trained sniffer\ndog. Israeli President Ezer Weizman called up his Turkish\ncounterpart Suleyman Demirel after the quake to express deep\ncondolence for the victims of the disaster.\nMa'ariv:\n– Two Israeli soldiers, First Sergeant Eyal Guetta and\nSergeant Doron Hershkowitz, were killed and seven others wounded\nTuesday in fierce clashes with Hezbollah guerrillas in southern\nLebanon, one day after a senior Hezbollah official was killed by\nroadside bombs in Lebanon. Israel has denied any involvement in\nthe bombing attack.\nYediot Ahronot:\n– The Health Ministry has decided to reveal the names of HIV\ncarriers because they are engaging in unsafe sex. Israelis\nsuspected of being infected have already received notification\nthat their names may be revealed in media in the future.\n\nAll of these files contain \"Bill Clinton\" and \"dog\"\n\nIf you modify the Lucene-1.4-rc2 demo file SearchFiles.java to run the following \n2 test cases, you will see they return different results – the PhraseQuery\nversion misses a valid Hit\n\n        Query query = null;\n        if(args.length == 1 && args[0].equals(\"-t1\"))\n        {\n          Term bill = new Term(\"contents\", \"bill\");\n          Term clinton = new Term(\"contents\", \"clinton\");\n          PhraseQuery billClinton = new PhraseQuery();\n          billClinton.add(bill);\n          billClinton.add(clinton);\n          \n          TermQuery dog = new TermQuery(new Term(\"contents\", \"dog\"));\n          BooleanQuery billClintonANDdog = new BooleanQuery();\n          billClintonANDdog.add(billClinton, true, false);\n          billClintonANDdog.add(dog, true, false);\n          query = billClintonANDdog;\n        }\n        else\n        if(args.length == 1 && args[0].equals(\"-t2\"))\n        {\n          SpanTermQuery bill = new SpanTermQuery(new Term(\"contents\", \"bill\"));\n          SpanTermQuery clinton = new SpanTermQuery(new Term(\"contents\",\n\"clinton\"));\n          SpanNearQuery billClinton = new SpanNearQuery(new\nSpanQuery[]\n{bill,clinton}\n, 0, true);\n\n          TermQuery dog = new TermQuery(new Term(\"contents\", \"dog\"));\n          BooleanQuery billClintonANDdog = new BooleanQuery();\n          billClintonANDdog.add(billClinton, true, false);\n          billClintonANDdog.add(dog, true, false);\n          query = billClintonANDdog;\n        }\n        else\n        {\n          System.out.println(\"usage: java SearchFiles -t1|-t2\");\n          return;\n        }\n\nThis seems to be a bug related to at least PhraseQuery introduced since Lucene\n1.3 final.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2004-04-28T05:33:38+0000",
            "content": "I originally submitted this bug.\nI just checked out the CVS version\n$Id: BUILD.txt,v 1.8 2004/04/03 21:32:50 ehatcher Exp $\nAnd this issue has been resolved.\nPlease disregard it. ",
            "author": "Luke",
            "id": "comment-12321704"
        }
    ]
}