{
    "id": "LUCENE-3365",
    "title": "Create or Append mode determined before obtaining write lock",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.4",
            "4.0-ALPHA"
        ],
        "affect_versions": "3.1,                                            3.2,                                            3.3",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "If an IndexWriter(\"writer1\") is opened in CREATE_OR_APPEND mode, it determines whether to CREATE or APPEND before obtaining the write lock.  When another IndexWriter(\"writer2\") is in the process of creating the index, this can result in writer1 entering create mode and then waiting to obtain the lock.  When writer2 commits and releases the lock, writer1 is already in create mode and overwrites the index created by write2.\n\nThis bug was probably effected by LUCENE-2386 as prior to that Lucene generated an empty commit when a new index was created.  I think the issue could still have occurred prior to that but the two IndexWriters would have needed to be opened nearly simultaneously and the first IndexWriter would need to release the lock before the second timed out.",
    "attachments": {
        "LUCENE-3365.patch": "https://issues.apache.org/jira/secure/attachment/12489832/LUCENE-3365.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-08-08T13:43:59+0000",
            "content": "I'm uploading a patch that contains a test that demonstrates this issue as well as a proposed fix.\n\nThe proposed fix is simply to move the create or append decision a step lower so it occurs after the lock is obtained. ",
            "author": "Geoff Cooney",
            "id": "comment-13080942"
        },
        {
            "date": "2011-08-10T07:26:43+0000",
            "content": "hey Geoff, thanks for reporting and fixing this. I updated your patch to trunk (4.0) and simplyfied the testcase a little (no busy waiting etc) I am planning to commit this soon to trunk and backport to 3.x\n\nthanks! ",
            "author": "Simon Willnauer",
            "id": "comment-13082209"
        },
        {
            "date": "2011-08-10T07:51:07+0000",
            "content": "committed to trunk & backported to 3.x\n\nthanks geoff! ",
            "author": "Simon Willnauer",
            "id": "comment-13082214"
        },
        {
            "date": "2011-08-10T13:34:48+0000",
            "content": "Glad I could help! ",
            "author": "Geoff Cooney",
            "id": "comment-13082330"
        }
    ]
}