{
    "id": "LUCENE-561",
    "title": "ParallelReader fails on deletes and on seeks of previously unused fields",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.0.0"
        ],
        "affect_versions": "2.0.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In using ParallelReader I've hit two bugs:\n\n1.  ParallelReader.doDelete() and doUndeleteAll() call doDelete() and doUndeleteAll() on the subreaders, but these methods do not set hasChanges.  Thus the changes are lost when the readers are closed.  The fix is to call deleteDocument() and undeleteAll() on the subreaders instead.\n\n2.  ParallelReader discovers the fields in each subindex by using IndexReader.getFieldNames() which only finds fields that have occurred on at least one document.  In general a parallel index is designed with assignments of fields to sub-indexes and term seeks (including searches) may be done on any of those fields, even if no documents in a particular state of the index have yet had an assigned field.  Seeks/searches on fields that have not yet been indexed generated an NPE in ParallelReader's various inner class seek() and next() methods because fieldToReader.get() returns null on the unseen field.  The fix is to extend the add() methods to supply the correct list of fields for each subindex.\n\nPatch that corrects both of these issues attached.",
    "attachments": {
        "ParallelReaderBugs.patch": "https://issues.apache.org/jira/secure/attachment/12326114/ParallelReaderBugs.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2006-05-02T14:10:44+0000",
            "content": "This new version of the patch provides a more general solution for the unknown field NPE problem (the solution for the delete problem is the same and is included in the new patch file).\n\nFor the NPE problem, the new patch handles the case of an unknown field explicitly in all ParallelReader API's for which it is relevant.  This is quite a few of them, but I think I got them all.\n\nThe first solution of specifying the field list for each reader was expedient in my applicaiton since all fields are pre-configured and validated on index operations.  However, for Lucene in general such field processing is not required.  E.g., with ParallelReader as it is in Lucene now and with the first version of the patch, a user-entered misspelled field name passed in a Query to search() generates an NPE instead of zero results.  With the new version of the patch, zero resutls are returned properly. ",
            "author": "Chuck Williams",
            "id": "comment-12377339"
        },
        {
            "date": "2006-05-19T07:40:00+0000",
            "content": "Chuck, I took a very quick scan, most of it looks fine.\nWhat about seek() calls though... if the reader is null, shouldn't termDocs be set to null?\n\n     public void seek(Term term) throws IOException {\n\n\ttermDocs = ((IndexReader)fieldToReader.get(term.field())).termDocs(term);\n+      IndexReader reader = ((IndexReader)fieldToReader.get(term.field()));\n+      termDocs = reader!=null ? reader.termDocs(term) : null;\n\n ",
            "author": "Yonik Seeley",
            "id": "comment-12412459"
        },
        {
            "date": "2006-05-19T07:58:49+0000",
            "content": "Yonik, thanks for looking at this, and good catch!  If there are multiple seeks on the termDocs, one is performed on a known field and not iterated to exahaustion, and then a seek is performed on an unknown field, then without your fix I believe the unknown field would erroneously report remaining documents on the prior known field.\n\nIt appears nothing I've done hit this pariticular case!  Sorry I missed it... ",
            "author": "Chuck Williams",
            "id": "comment-12412460"
        },
        {
            "date": "2006-05-19T22:58:06+0000",
            "content": "This patch also fixes another little bug... the previous behavior bypassed synchronization of deleteDocument in subreaders. ",
            "author": "Yonik Seeley",
            "id": "comment-12412532"
        },
        {
            "date": "2006-05-19T23:40:52+0000",
            "content": "Patch applied,  thanks Chuck! ",
            "author": "Yonik Seeley",
            "id": "comment-12412535"
        },
        {
            "date": "2006-06-19T17:37:56+0000",
            "content": "Chuck: Unfortunately, the NPE in seek/next can still be triggered.\nSee LUCENE-398 for Testcase and a suggested patch. ",
            "author": "Christian Kohlschuetter",
            "id": "comment-12416738"
        },
        {
            "date": "2006-06-20T01:11:54+0000",
            "content": "Christian,\n\nThat is a different bug than this one.  This bug has been fixed.\n\nChuck ",
            "author": "Chuck Williams",
            "id": "comment-12416790"
        }
    ]
}