{
    "id": "LUCENE-4545",
    "title": "Better error reporting StemmerOverrideFilterFactory",
    "details": {
        "components": [
            "modules/analysis"
        ],
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "4.0",
        "priority": "Trivial",
        "labels": "",
        "type": "Improvement",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "If the dictionary contains an error such as a space instead of a tab somewhere in the dictionary it is hard to find the error in a long dictionary. This patch includes the file and line number in the exception, helping to debug it quickly.",
    "attachments": {
        "LUCENE-4545-trunk-1.patch": "https://issues.apache.org/jira/secure/attachment/12552463/LUCENE-4545-trunk-1.patch",
        "LUCENE-4545.patch": "https://issues.apache.org/jira/secure/attachment/12914180/LUCENE-4545.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-07T13:27:32+0000",
            "content": "Patch for trunk. ",
            "author": "Markus Jelsma",
            "id": "comment-13492334"
        },
        {
            "date": "2012-11-07T14:08:28+0000",
            "content": "I'm for the idea, but not for the logic contained to this specific factory.\n\nInstead of tracking our own line numbers, we should use LineNumberReader and so on.\n\nWordListLoader.getStemDict should be changed to take a generic map (Not a chararraymap), so that it can be used by this method.\nIn fact, since nothing at all is using this method, we can do whatever we want with it.\n\nAlso the logic should not use split(s, 2): I think instead it should just use split(s)? This way we detect the situation\nwhere there are multiple tabs in a line unexpectedly, too. ",
            "author": "Robert Muir",
            "id": "comment-13492366"
        },
        {
            "date": "2013-07-23T18:44:38+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717009"
        },
        {
            "date": "2014-04-16T12:54:39+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970832"
        },
        {
            "date": "2018-03-12T23:23:36+0000",
            "content": "Found this issue because of a user having a problem.  Uploaded a new patch against master (8.0).\n\nRobert Muir, I didn't use LineNumberReader as you suggested.  I did find an example of that elsewhere in the code, but using that would have required a more substantial rewrite.  I'm willing to do that if you really think that's the way it should be done, but I was able to get line numbers more directly than what the first patch did.  The code has changed since the first patch was made.\n\nI changed the regex in the split usage to any sequence of one or more whitespace characters, so it should be able to handle just about anything a user is likely to throw at it.\n\nI did find a few other usages elsewhere of split with a single tab character.  Some of them should perhaps be reviewed for adjustment to the \"any whitespace\" regex. ",
            "author": "Shawn Heisey",
            "id": "comment-16396237"
        }
    ]
}