{
    "id": "LUCENE-4004",
    "title": "Add syntax for DisjunctionMaxQuery to the Query Parser",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/queryparser"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.6",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I've come up with a use for DisjunctionMaxQuery, but not the dismax parser. I note that the toString() method on that item proposes a syntax with vertical bars. Is there any sympathy for a patch that added this to the standard parser, or some other syntax?",
    "attachments": {
        "LUCENE-4004.patch": "https://issues.apache.org/jira/secure/attachment/12523713/LUCENE-4004.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-22T19:46:02+0000",
            "content": "I note that the xml parser doesn't do DisjunctionMaxQuery. I can't see a reason why this would be controversial, so I'll start with a patch for that. ",
            "author": "Benson Margulies",
            "id": "comment-13259227"
        },
        {
            "date": "2012-04-22T19:57:05+0000",
            "content": "I'm +1 to adding syntax to this to the classic/flexible/qps as well.\n\nBut I like your idea of adding it to the xml one first. Maybe its an easier iteration to then boil down the best\nsyntax for the other ones (which is going to be more difficult just because they are hairier). ",
            "author": "Robert Muir",
            "id": "comment-13259234"
        },
        {
            "date": "2012-04-22T20:09:58+0000",
            "content": "Support D-m-q in the XML parser. ",
            "author": "Benson Margulies",
            "id": "comment-13259239"
        },
        {
            "date": "2012-04-22T20:11:26+0000",
            "content": "Indeed I don't quite know what sort of syntax would fly for the tieBreaker, I'm off to study the jj file for the classic parser and see if anything analogous presents itself.\n\nMeanwhile, do you want to do XML in a different JIRA from the hard ones, or should I just stack up the patches here? ",
            "author": "Benson Margulies",
            "id": "comment-13259240"
        },
        {
            "date": "2012-04-22T20:18:54+0000",
            "content": "add the boost param I forgot the first time. ",
            "author": "Benson Margulies",
            "id": "comment-13259243"
        },
        {
            "date": "2012-04-22T20:33:25+0000",
            "content": "Using the syntax ( q | q | q ) might be doable in javacc, but I worry that it's undesirable.\n\nRight now, what's in parens are boolean clauses (with +/-). The insides of a disjunct aren't boolean clauses, they are queries. This could be pretty confusing all around. It would be really better to introduce some syntax that allows for various sorts of grouping, but I don't want to step on the Solr parser's use of {}. Further, DisjunctionMaxQuery is just one thing, and using up | for it seems ill-advised.\n\n% isn't doing anything for a living, so that an option would be \n\n(%disjunctionmax q q q q q ) would serve, and also open a door to supporting other things. \n\n? ",
            "author": "Benson Margulies",
            "id": "comment-13259246"
        },
        {
            "date": "2012-04-22T20:36:10+0000",
            "content": "\nFurther, DisjunctionMaxQuery is just one thing, and using up | for it seems ill-advised.\n\nI think we allow this for OR as well anyway, so it would be ambiguous...? ",
            "author": "Robert Muir",
            "id": "comment-13259247"
        },
        {
            "date": "2012-04-22T20:41:08+0000",
            "content": "FWIW, that's ||, not |, but I still don't want to burn | on disjunction. ",
            "author": "Benson Margulies",
            "id": "comment-13259248"
        },
        {
            "date": "2012-04-22T20:41:40+0000",
            "content": "Note that the patch is to trunk, I'm sort of assuming that you all do 'patch the trunk and then backport as appropriate'. ",
            "author": "Benson Margulies",
            "id": "comment-13259249"
        },
        {
            "date": "2012-04-22T20:56:02+0000",
            "content": "Usually yes, however at this stage we just released 3.6 (intended to be the last minor release in the 3.x series).\n\nSo currently we have not yet cut a branch_4x for stable 4.0 and are only working on trunk.\n\n(separately, we also have http://svn.apache.org/repos/asf/lucene/dev/branches/lucene_solr_3_6/ open for bugfixes, to backport any nasty bugs for 3.6.1, 3.6.2, etc: basically 3.x is intended to be in maintenance mode like 2.9.x was) ",
            "author": "Robert Muir",
            "id": "comment-13259251"
        },
        {
            "date": "2012-04-22T21:01:30+0000",
            "content": "At the risk of drifting off topic ...\n\nFrom where I sit, 4.0 looks a long way from a release. Lots of things with no javadoc, with the experimental tag, etc. (I've mostly been reading in Solr.) Am I underestimating the speed at which the entire lodge of beavers pulls a major release together? ",
            "author": "Benson Margulies",
            "id": "comment-13259254"
        },
        {
            "date": "2012-04-22T21:14:02+0000",
            "content": "What can I say: documentation is always a weakness.\n\nFrom the Solr side, I think most of the documentation tends to be higher level on the wiki, and javadocs\ndon't get as much attention since its a smaller population hacking on the APIs.\n\nFrom the Lucene side, things tend to be under-documented or out of date.\n\nIn any case, just throw up patches and lets get em in. Nobody gets excited to work on docs too much around here unfortunately, probably because there is no momentum and the existing docs are all out of date and not very good. \n\nOn the other hand, just in the past weekend we've made some serious progress on the lucene documentation already: nuked the old out-of-date-forrest stuff, fixed a ton of broken links, added a broken-link checker, linked the javadocs of various modules to each other, brought all the existing docs (minus fileformats) up to speed with 4.0, generating htmlized version of the .txt documents with markdown, etc.\n\nI know there is a lot of underdocumented stuff in lucene, but currently from my own perspective I am working to correct the broken stuff \n\nFor some reason, its definitely harder to fix the old documentation up to make sense than i would have ever thought, I spent most of the day just bringing http://lucene.apache.org/core/3_6_0/scoring.html up to speed and integrating it into the o.a.l.search package javadocs.\n\nFor the stuff you see thats experimental with no javadoc tag... this is really just as bad of a problem, just open issues if you want to help out. We are pretty overwhelmed with things to fix on the documentation side so any help would be appreciated. ",
            "author": "Robert Muir",
            "id": "comment-13259261"
        },
        {
            "date": "2012-04-22T21:21:01+0000",
            "content": "By the way this patch looks good. Thanks Benson! I plan to commit this in a bit ",
            "author": "Robert Muir",
            "id": "comment-13259268"
        },
        {
            "date": "2012-04-22T21:29:19+0000",
            "content": "Committed revision 1328981 for the xml queryparser support. Thanks again. \nWe can either keep this issue open for the other QPs, or spin off new issues, \nwhichever you prefer. ",
            "author": "Robert Muir",
            "id": "comment-13259273"
        },
        {
            "date": "2012-04-22T23:27:37+0000",
            "content": "Please see https://issues.apache.org/jira/browse/LUCENE-4012 for an alternative to adding syntax to any of the existing end-user-facing parsers. I think it makes more sense, myself, but if others see value in continuing the line in here I'm game. ",
            "author": "Benson Margulies",
            "id": "comment-13259302"
        }
    ]
}