{
    "id": "LUCENE-1077",
    "title": "New Analysis  Contributions",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis",
            "modules/other"
        ],
        "type": "New Feature",
        "fix_versions": [
            "2.3"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "With the advent of the new TeeTokenFilter and SinkTokenizer, there now exists some interesting new things that can be done in the analysis phase of indexing.  See LUCENE-1058.\n\nThis patch provides some new implementations of SinkTokenizer that may be useful.",
    "attachments": {
        "LUCENE-1077.patch": "https://issues.apache.org/jira/secure/attachment/12370948/LUCENE-1077.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-12-04T16:17:33+0000",
            "content": "This is a fairly trivial start to to this, but it creates the sinks package in the contrib/Analysis section and adds a simple TokenRangeSinkTokenizer and test.  This can be used to siphon off tokens that fall in a range.  All it does is count the tokens that go by and add those that fall in the range.  It might be useful for documents that you know have certain structures.  For instance, if you know the first 5 tokens of your docs are X.\n\nMore to follow. ",
            "author": "Grant Ingersoll",
            "id": "comment-12548293"
        },
        {
            "date": "2007-12-05T14:03:15+0000",
            "content": "Expanding to add in some other analysis capabilities ",
            "author": "Grant Ingersoll",
            "id": "comment-12548675"
        },
        {
            "date": "2007-12-06T03:44:31+0000",
            "content": "Adds to the sinks package:\nDateRecognizerSinkTokenizer which only adds dates that can be parsed by a DateFormat object\n\nTokenRangeSinkTokenizer as described earlier\n\nTokenTypeSinkTokenizer only adds to the sink if the token type is a specific value.\n\nAdds the payloads package, which contains\nNumericPayloadTokenFilter – Assigns a predefined float-based payload to a Token if the type matches the specified input type of the Token.  As a use case, this could be used to assign a payload for all tokens that are marked as \"bold\" or some other value. ",
            "author": "Grant Ingersoll",
            "id": "comment-12548912"
        },
        {
            "date": "2007-12-06T03:57:36+0000",
            "content": "Thought of another possibly useful payload convenience TokenFilter that adds the Token type as the payload.  I've always wondered why we don't make more use of the type attribute on a Token. ",
            "author": "Grant Ingersoll",
            "id": "comment-12548914"
        },
        {
            "date": "2007-12-07T12:57:41+0000",
            "content": "Committed ",
            "author": "Grant Ingersoll",
            "id": "comment-12549395"
        }
    ]
}