{
    "id": "LUCENE-8028",
    "title": "Arabic Stemmer improvement for Better Search Accuracy",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Improvement",
        "components": [],
        "fix_versions": []
    },
    "description": "HI, this is Ayah - bidi developer at IBM Egypt - Globalization Team, we are responsible to support Arabic at IBM products and services and as we use lucence at many of services, we found that it needs major improvement at Arabic stemmer, we implement the following two papers https://dl.acm.org/citation.cfm?id=1921657 and http://waset.org/publications/10005688/arabic-light-stemmer-for-better-search-accuracy to improve lucene arabic stemmer function and would like to open a Pull request to let you integrate it as a part of lucene",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16226750",
            "date": "2017-10-31T13:08:33+0000",
            "content": "Hi, we should add it as an option! It is ok to have multiple stemmers (choices).\n\nI think we should be conservative about changing the default: at least for the second paper (which isn't paywalled, so i could quickly look), this appears to incorporate a dictionary-based approach (domain-dependent, typically perform less well on average than rule-based due to OOV) and i don't yet see any standard IR experiments confirming the improvement. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16243782",
            "date": "2017-11-08T11:52:48+0000",
            "content": "So you mean that I can start implementing it ..... right? ",
            "author": "Ayah Shamandi"
        },
        {
            "id": "comment-16253410",
            "date": "2017-11-15T12:59:25+0000",
            "content": "GitHub user Ashamandi opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/274\n\n    LUCENE-8028 Arabic stemmer enhancement \n\n    Hello, this PR is to add Enhancement for Arabic Stemmer #https://issues.apache.org/jira/browse/LUCENE-8028\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/ACGC/lucene-solr master\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/274.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #274\n\n\ncommit 9c5d4f2b5584d26627d04414d8048c56b899210e\nAuthor: Ashamandi <ashamand@eg.ibm.com>\nDate:   2017-11-15T09:19:16Z\n\n    Arabic Stemmer enhancement\n\ncommit 667f3f548692c6ea1b3918a5bc9393e25d7f0c39\nAuthor: Ashamandi <ashamand@eg.ibm.com>\nDate:   2017-11-15T12:54:07Z\n\n    tune code style\n\n ",
            "author": "ASF GitHub Bot"
        },
        {
            "id": "comment-16253457",
            "date": "2017-11-15T13:45:17+0000",
            "content": "Can we instead factor out this stemmer into its own stemmer file? I don't think we should mix together two stemmers in the same file with conditionals. See for example the German package (or many other languages) where there are multiple stemmers.\n\nAlso lets avoid modifying the analyzer for now. The analyzer just represents defaults but we shouldn't add conditional options. Instead as a start we should just add the new stemmer, and make it easy for people to instantiate it e.g. in CustomAnalyzer. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16253463",
            "date": "2017-11-15T13:49:26+0000",
            "content": "Also if we could avoid using naming such as \"high accuracy\"/\"smart\"/\"fast\" in the new stemmer since it will confuse users. If there is no better name then perhaps name it based upon the authors of the algorithm instead. \n\nFinally is it possible to have some simple unit tests? We need these to be able to maintain the code going forward. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16262347",
            "date": "2017-11-22T11:30:41+0000",
            "content": "I added the arabic light stemmer at separate files as you suggested , added unit tests for it, and removed the analyzer changes.  ",
            "author": "Ayah Shamandi"
        },
        {
            "id": "comment-16262427",
            "date": "2017-11-22T12:23:27+0000",
            "content": "Github user Ashamandi commented on the issue:\n\n    https://github.com/apache/lucene-solr/pull/274\n\n    I have handled your comments, please review ... Thank you! ",
            "author": "ASF GitHub Bot"
        },
        {
            "id": "comment-16265978",
            "date": "2017-11-26T12:08:21+0000",
            "content": "Robert Muir, do you have any comment, Please? ",
            "author": "Ayah Shamandi"
        },
        {
            "id": "comment-16266019",
            "date": "2017-11-26T14:30:58+0000",
            "content": "Hello, sorry for the slow response! (holiday times here).\n\nI took a glance and it is shaping up well! I saw a little funky formatting we may want to tackle, perhaps there were some stray tabs or just indentation was off?\nAnd can you try running `ant precommit` from the top of your git checkout? It takes a few minutes, but will run some code analysis checks such as javadocs and the like, it may find stuff.\n\nI will carve out some time in the next few days to take a deeper look. Thanks for putting in the hard work. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16267237",
            "date": "2017-11-27T18:49:17+0000",
            "content": "Robert Muir, Thank you for your help, I run 'ant precommit' it was really helpful, replaced all tabs with spaces and added a new commit, once you have a time, please check it. ",
            "author": "Ayah Shamandi"
        },
        {
            "id": "comment-16280009",
            "date": "2017-12-06T10:51:12+0000",
            "content": "Robert Muir , Has you got an opportunity to review?  ",
            "author": "Ayah Shamandi"
        }
    ]
}