{
    "id": "LUCENE-6679",
    "title": "Filter's Weight.explain returns an explanation with isMatch==true even on documents that don't match",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "This was reported by Trejkaz on the java-user list: http://search-lucene.com/m/l6pAi19h4Y3DclgB1&subj=Re+What+on+earth+is+FilteredQuery+explain+doing+",
    "attachments": {
        "LUCENE-6679.patch": "https://issues.apache.org/jira/secure/attachment/12754701/LUCENE-6679.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14628135",
            "author": "Adrien Grand",
            "date": "2015-07-15T14:29:58+0000",
            "content": "Terry Smith On the email thread, you looked interested to work on this issue? "
        },
        {
            "id": "comment-14628153",
            "author": "Terry Smith",
            "date": "2015-07-15T14:39:06+0000",
            "content": "Adrien Grand Absolutely, I'd love to give it a stab. Currently waiting for feedback from TX on the users list.\n\nI think you are spot on about adding some additional testing to the test suite to catch explanation mismatches. I'll take a peek at that also and see if I can figure out something worth submitting. "
        },
        {
            "id": "comment-14628155",
            "author": "Adrien Grand",
            "date": "2015-07-15T14:40:04+0000",
            "content": "Awesome!  "
        },
        {
            "id": "comment-14629956",
            "author": "Terry Smith",
            "date": "2015-07-16T16:22:57+0000",
            "content": "Trejkaz confirmed the patch referenced from the mailing list works.\n\nThis bug is fixed as a side effect of LUCENE-6601 so will automatically be fixed as part of release 5.3.\n\nI'll work on cleaning up the new test contributed by Trejkaz for inclusion and then move onto a more generic hook to catch other explanation mistakes.\n "
        },
        {
            "id": "comment-14735400",
            "author": "Terry Smith",
            "date": "2015-09-08T18:57:15+0000",
            "content": "Here is a patch (against trunk) that adds test coverage for explanations on hits only.\n\nI'm looking for feedback to the approach used before expanding to cover explanations for misses.\n\nCurrently I get a couple of failures when running just the Lucene tests:\n\n\nTests with failures:\n  - org.apache.lucene.search.TestSortRandom.testRandomStringValSort\n  - org.apache.lucene.search.TestSortRandom.testRandomStringSort\n\n\nJVM J0:     1.42 ..   284.75 =   283.33s\nJVM J1:     1.64 ..   284.77 =   283.13s\nJVM J2:     1.42 ..   284.70 =   283.28s\nJVM J3:     1.42 ..   284.68 =   283.26s\nExecution time total: 4 minutes 44 seconds\nTests summary: 404 suites, 3235 tests, 2 failures, 104 ignored (100 assumptions)\n\n\n\nHappy to dig into these more once an approach has been found that people like. "
        },
        {
            "id": "comment-14737694",
            "author": "Adrien Grand",
            "date": "2015-09-09T22:15:54+0000",
            "content": "I think it is a nice change: AssertingIndexSearcher is widely used in tests so it would be nice if it could catch explain bugs. "
        },
        {
            "id": "comment-14994369",
            "author": "Alexander Kanarsky",
            "date": "2015-11-06T20:22:23+0000",
            "content": "It looks like the issue was not fixed as a part of LUCENE-6601 though; I opened SOLR-8245 to track it (did not see this ticket yesterday, but since it seems to be on a Solr side now, SOLR project ticket seems to be reasonable). "
        },
        {
            "id": "comment-14994430",
            "author": "Terry Smith",
            "date": "2015-11-06T21:07:55+0000",
            "content": "Darn, sorry I didn't get back to pushing these new tests into the source, they would have helped to catch this.\n\n\nIt looks like branch_5x and trunk diverged here, this commit shows where this code was removed on branch_5x: https://github.com/apache/lucene-solr/commit/11cc6e53f85f7bc4b616bb38370ddfc704987337#diff-2b293bfd95e32f715a5c05b4e132f047L82\n\nAnd this commit from trunk shows the move of Filter from Lucene to Solr: https://github.com/apache/lucene-solr/commit/98888f8d64d4fb34eb2480e9a667c45f262d20f0#diff-4bf1c256f49c1a4ee4a50b1f8aeda1ddL1\n\nYou can see the trunk version of the file here: https://github.com/apache/lucene-solr/blob/98888f8d64d4fb34eb2480e9a667c45f262d20f0/solr/core/src/java/org/apache/solr/search/Filter.java\n\nThe changes from the branch_5x commit are missing.\n\nI don't know why this is the case, perhaps Adrien Grand can chime in as the original commit that fixes the explain output as a side effect (LUCENE-6601) looks like it ought to be on both branch_5x and trunk.\n "
        },
        {
            "id": "comment-14994622",
            "author": "Alexander Kanarsky",
            "date": "2015-11-06T22:52:11+0000",
            "content": "Terry Smith I agree, the code is different in the trunk and branch_5x but the explain issue is still present in both branches:\n\n\n if (match) {\n  assert s.score() == 0f;\n  return Explanation.match(0f, \"Match on id \" + doc);\n} else {\n  return Explanation.match(0f, \"No match on id \" + doc); // here it should be Explanation.noMatch(\"No match on id \" + doc); \n}\n\n\n\nIn the branch_5x that code is in FilteredQuery (line 299), in the trunk it is in Filter.createWeight(...) "
        },
        {
            "id": "comment-14996491",
            "author": "Adrien Grand",
            "date": "2015-11-09T13:05:00+0000",
            "content": "5.x and trunk are indeed different, mainly because of backward compatibility for FilteredQuery (which is gone in trunk but still exists in 5.x): since FilteredQuery has an option that lets control whether the filter should be executed before or after the query, Filter had to diverge a bit from trunk so that this would remain possible (while in trunk all decisions are made automatically now).\n\nTerry, please let us know if you need help fixing the tests that fail with your patch. I'd be happy to help. "
        },
        {
            "id": "comment-14996583",
            "author": "Terry Smith",
            "date": "2015-11-09T14:23:19+0000",
            "content": "Thanks Adrien, I'll give it a shot this morning and reach out as needed.\n\nAs a reminder, my patch only checks hits and the bug reports are for misses. I'll need to expand upon it to get better coverage for those also.\n\nIf I can't turn something around early this week I'll backup a little and at least get direct test for the underlying bug behind SOLR-8245 to go with it's fix. "
        },
        {
            "id": "comment-14997218",
            "author": "Terry Smith",
            "date": "2015-11-09T19:37:34+0000",
            "content": "Here is an updated patch against trunk that adds hit and miss explain checks to AssertingLeafCollector and hooks it up with the surrounding classes.\n\nI've also introduced a new annotation called SuppressExplainChecks that I've applied to the following tests that would fail without.\n\n\n\tTestSortRandom\n\tTestLazyProxSkipping\n\tTestDrillSideways\n\tTestRangeFacetCounts\n\tTestJoinUtil\n\tTestFieldCacheSortRandom\n\tTestCustomScoreQuery\n\tTestCustomScoreQueryExplanations\n\tTestFunctionQueryExplanations\n\tTestForTooMuchCloning\n\tTestTermAutomationQuery\n\n\n\nOnce you are happy with this patch, I'd like to get it on trunk so the jenkins servers can shake out any more failures and we can create tickets for any uncovered bugs.\n "
        }
    ]
}