{
    "id": "LUCENE-2897",
    "title": "apply delete-by-Term and docID immediately to newly flushed segments",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.2",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Spinoff from LUCENE-2324.\n\nWhen we flush deletes today, we keep them as buffered Term/Query/docIDs that need to be deleted.  But, for a newly flushed segment (ie fresh out of the DWPT), this is silly, because during flush we visit all terms and we know their docIDs.  So it's more efficient to apply the deletes (for this one segment) at that time.\n\nWe still must buffer deletes for all prior segments, but these deletes don't need to map to a docIDUpto anymore; ie we just need a Set.\n\nThis issue should wait until LUCENE-1076 is in since that issue cuts over buffered deletes to a transactional stream.",
    "attachments": {
        "LUCENE-2897.patch": "https://issues.apache.org/jira/secure/attachment/12469747/LUCENE-2897.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-01-29T16:16:34+0000",
            "content": "Initial patch.\n\nThe approach is nice and simple   All tests pass, but I put a bunch of nocommits in there, and I stopped short of the stuff I'll have to redo after committing ooo merges. ",
            "author": "Michael McCandless",
            "id": "comment-12988471"
        },
        {
            "date": "2011-01-29T16:19:57+0000",
            "content": "I had to read this a few times, yes it's very elegant as we're skipping the postings that otherwise would be deleted immediately after flush, and we're reusing the terms map already in DWPT.\n\nWell... I think we can't [easily] skip writing the postings, because could result in non-deterministic behavior (I put a comment on this in the patch).\n\nIf we did the flush w/ 2 passes (first pass to mark all del docs and 2nd to flush) then we could skip writing postings of docs that were deleted.  But I suspect that's too much cost on flush.\n\nWith a single pass, we'd end up writing some postings for the doc, but not all, depending on the order in which its terms arrived vs its deleted terms.\n\nI mean, in practice, an app is gonna delete against ID field (typically) so if we \"knew\" that down deep here in Luceneland we could do the first pass only against that one field...\n\nAlso, merge is still going to have to apply del docs, since eg stored fields have written the deleted docs. ",
            "author": "Michael McCandless",
            "id": "comment-12988472"
        },
        {
            "date": "2011-01-29T16:33:28+0000",
            "content": "Well... I think we can't [easily] skip writing the postings, because could result in non-deterministic behavior (I put a comment on this in the patch).\n\nInstead we're building the deleted docs BV as we're flushing. ",
            "author": "Jason Rutherglen",
            "id": "comment-12988473"
        },
        {
            "date": "2011-01-29T16:40:47+0000",
            "content": "Yeah this is nice.  I was thinking we'd switch to live deletes with RT, because then we can also handle delete-by-query like this.\n\nSo the deleted queries we still have to buffer per DWPT, but this solves the updateDocument() problem. ",
            "author": "Michael Busch",
            "id": "comment-12988474"
        },
        {
            "date": "2011-01-29T17:17:15+0000",
            "content": "Instead we're building the deleted docs BV as we're flushing.\n\nRight, that's what the patch does.  Seems to work great \n\nI was thinking we'd switch to live deletes with RT, because then we can also handle delete-by-query like this.\n\nRight, though for RT we need to apply the delete immediately (vs this patch which applies on flush).\n\nAnd delete-by-Query is still buffered... ",
            "author": "Michael McCandless",
            "id": "comment-12988481"
        },
        {
            "date": "2011-01-30T00:26:22+0000",
            "content": "Patch – I think it's ready to commit! ",
            "author": "Michael McCandless",
            "id": "comment-12988524"
        },
        {
            "date": "2011-02-03T15:26:01+0000",
            "content": "I think we can do this for 3.1. ",
            "author": "Michael McCandless",
            "id": "comment-12990129"
        },
        {
            "date": "2011-02-04T12:05:25+0000",
            "content": "I changed my mind!  Pushing this to 3.2 now. ",
            "author": "Michael McCandless",
            "id": "comment-12990540"
        },
        {
            "date": "2011-06-03T16:37:12+0000",
            "content": "Bulk closing for 3.2 ",
            "author": "Robert Muir",
            "id": "comment-13043476"
        }
    ]
}