{
    "id": "LUCENE-5983",
    "title": "RoaringDocIdSet",
    "details": {
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed",
        "components": [],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.0"
        ]
    },
    "description": "Robert pointed me to this paper: http://arxiv.org/pdf/1402.6407v4 that describes an interesting way to build doc id sets: The bit space is divided into blocks of 2^16 bits so that you can store the bits which are set either in a short[] (2 bytes per doc ID) or in a FixedBitSet. The choice is easy, if less than 2^12 bits are set, then the short[] representation is more compact otherwise a FixedBitSet would be more compact. It's quite similar to the way that Solr builds DocSets in SolrIndexSearcher.getDocSet(DocsEnumState).",
    "attachments": {
        "LUCENE-5983.patch": "https://issues.apache.org/jira/secure/attachment/12672330/LUCENE-5983.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14154853",
            "author": "Adrien Grand",
            "content": "Here are a patch and the results of the benchmark on this new DocIdSet: http://people.apache.org/~jpountz/doc_id_sets4.html\n\nCompared to the paper, I also optimized the super-dense case in order to encode the negation of the set to save space (like WAH8DocIdSet does). I like the fact that this set is overall very fast, especially to build, which is an interesting characteristic for caching, so I replaced WAH8DocIdSet with this new DocIdSet in CachingWrapperFilter. Another nice property is that it is naturally indexed, it doesn't need a side-car data-structure like the WAH8 and PFOR doc id sets: in the array case, you can just perform a binary search, and in the FixedBitSet case you already have random-access.\n\nIn order to avoid the profusion of doc id sets, I'm thinking of removing the WAH8 and PFOR doc id sets since this one looks better to me in most areas. ",
            "date": "2014-10-01T14:19:10+0000"
        },
        {
            "id": "comment-14159986",
            "author": "David Smiley",
            "content": "Cool.  I also like that it's worst-case in advance() is not too shabby.\n\nWhy remove WAH8 & PFOR yet not also Elias-Fano?  Because EF compresses the most and doesn't perform as bad as those two in most advance() scenarios? ",
            "date": "2014-10-06T04:15:44+0000"
        },
        {
            "id": "comment-14160115",
            "author": "Adrien Grand",
            "content": "Why remove WAH8 & PFOR yet not also Elias-Fano? Because EF compresses the most and doesn't perform as bad as those two in most advance() scenarios?\n\nI have to admit I don't know this set as well as the PFOR and WAH8 ones, but indeed it seems to compress very efficiently sparse sets and also has the nice property that WAH8 and PFOR miss that it is naturally indexed, ie. it doesn't need a side-car data-structure in order to be able to skip efficiently. ",
            "date": "2014-10-06T08:59:45+0000"
        },
        {
            "id": "comment-14160162",
            "author": "ASF subversion and git services",
            "content": "Commit 1629605 from Adrien Grand in branch 'dev/trunk'\n[ https://svn.apache.org/r1629605 ]\n\nLUCENE-5983: CachingWrapperFilter now uses RoaringDocIdSet. ",
            "date": "2014-10-06T10:28:22+0000"
        },
        {
            "id": "comment-14160163",
            "author": "ASF subversion and git services",
            "content": "Commit 1629606 from Adrien Grand in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1629606 ]\n\nLUCENE-5983: CachingWrapperFilter now uses RoaringDocIdSet. ",
            "date": "2014-10-06T10:30:21+0000"
        },
        {
            "id": "comment-14160169",
            "author": "Adrien Grand",
            "content": "Committed to trunk and branch_5x. I also opened /LUCENE-5993 to discuss the removal of the WAH8 and PForDelta sets. ",
            "date": "2014-10-06T10:37:23+0000"
        },
        {
            "id": "comment-14332883",
            "author": "Anshum Gupta",
            "content": "Bulk close after 5.0 release. ",
            "date": "2015-02-23T05:02:25+0000"
        }
    ]
}