{
    "id": "LUCENE-8421",
    "title": "TopScoreDocCollector.create(int) should disable exact hit counts",
    "details": {
        "components": [],
        "status": "Resolved",
        "resolution": "Won't Fix",
        "fix_versions": [],
        "affect_versions": "None",
        "labels": "",
        "priority": "Minor",
        "type": "Improvement"
    },
    "description": "We should make TopScoreDocCollector.create(int) disable exact hit counts so that users don't have to opt out to get faster queries. Users can still get exact counts by using the other factory method TopScoreDocCollector.create(int,ScoreDoc,boolean).",
    "attachments": {
        "LUCENE-8421.patch": "https://issues.apache.org/jira/secure/attachment/12932664/LUCENE-8421.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16552467",
            "author": "Adrien Grand",
            "content": "Here is a patch. Note that it doesn't change the behavior of IndexSearcher#search(int) which still returns exact hit counts (for now). ",
            "date": "2018-07-23T08:11:30+0000"
        },
        {
            "id": "comment-16553172",
            "author": "Hoss Man",
            "content": "-0\n\nThis seem like a scary default behavior – particularly since TopDocs.totalHits is still going to be there in the response object containing non-deterministic data (IIUC the docs make no garuntees unless trackTotalHits=true – so it's not like we even have a \"-1\" sentinal value, and it's not a method that we could make throw an UnsupportedOperationException if the original collector had trackTotalHits=false ) ... and especially since existing users who already have code that calls TopScoreDocCollector.create(42) won't see any sort of compilation error on upgrade – their code will just starrt lying to them about hte number of total hits.\n\ncouldn't we at least use a new static method name, and deprecate the old single arg create(int) ??  that way nothing will change out from under people. ",
            "date": "2018-07-23T17:52:43+0000"
        },
        {
            "id": "comment-16554471",
            "author": "Adrien Grand",
            "content": "Sorry I should have provided more context. I agree this change alone is problematic. I'm trying to break down some ideas from LUCENE-8060 into smaller, easier tasks but we need other changes to make it less trappy. I will revive the discussion on LUCENE-8060. ",
            "date": "2018-07-24T16:16:59+0000"
        },
        {
            "id": "comment-16620630",
            "author": "Adrien Grand",
            "content": "We ended up addressing this need differently. TopScoreDocCollector now always takes a totalHitsThreshold. ",
            "date": "2018-09-19T14:00:21+0000"
        }
    ]
}