{
    "id": "LUCENE-1897",
    "title": "Links to javadoc from the site pages do not work in the src dist because it does not include the javadoc under docs.",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/javadocs"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "Links to javadoc from the site pages do not work in the src dist because it does not include the javadoc under docs.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2009-09-10T03:04:25+0000",
            "content": "this one I think we are going to live with - unless we decide to include the expanded javadocs in src release.\n\nI'm not going to worry about it myself for this release. ",
            "author": "Mark Miller",
            "id": "comment-12753401"
        },
        {
            "date": "2009-09-11T22:15:06+0000",
            "content": "Honestly: i don't think this is a bug.  javadocs are generated, just like jar files ... if we had a refrence to a jar file in a README or an html page we wouldn't consider it a bug that people couldn't find that jar file in a source release, it's understood that they have to build the source release for the generated artifacts to be where they expect.\n\nas long as running \"ant javadoc\" in a source release puts the javadocs in the right spot so that the linkss start working, we're doing the right thing. ",
            "author": "Hoss Man",
            "id": "comment-12754379"
        },
        {
            "date": "2009-09-12T05:00:57+0000",
            "content": "I guess.\n\nif we had a refrence to a jar file in a README or an html page we wouldn't consider it a bug that people couldn't find that jar file in a source release\n\nI dunno - perhaps. If the README said, you will find this jar at /lucene/jar and then I go to /lucene/jar and nothing is there, I would personally find that a bit confusing. But it wouldnt bother me too much I guess.\n\nBut if I open the site HTML in the folder docs, and most of the links are broken cause they point to javadoc - that seems broken to me. Whether we want to fix it or not, I don't know and I don't have a real suggestion - but certainly seems like a bug when we distribute a bunch of docs in a doc folder with a bunch of broken links.\n\n\n\tedit *\n\n\n\nUnless it says somewhere - by the way - the doc folder will contain a bunch of broken links until you build the javadocs - that would convince me otherwise.\n\nI'm not super concerned either way - you can feel free to close - it was more to flag a discussion than anything I'm personally vested in. To me, downloading to view the source, and then looking through the docs, I'd be confused when the links didn't work - but that doesn't mean anything has to change. ",
            "author": "Mark Miller",
            "id": "comment-12754480"
        },
        {
            "date": "2009-09-12T05:39:51+0000",
            "content": "If the README said, you will find this jar at /lucene/jar and then I go to /lucene/jar and nothing is there, I would personally find that a bit confusing. But it wouldnt bother me too much I guess.\n\nThat's almost exactly what our README file says actually...\n\n\n...\nFILES\n\nlucene-core-XX.jar\n  The compiled lucene library.\n\nlucene-demos-XX.jar\n  The compiled simple example code.\n\nluceneweb.war\n  The compiled simple example Web Application.\n\n\ncontrib/*\n  Contributed code which extends and enhances Lucene, but is not\n  part of the core library.  Of special note are the JAR files in the analyzers \nand snowball directory which\n  contain various analyzers that people may find useful in place of the Standard\nAnalyzer.\n\ndocs/index.html\n  The contents of the Lucene website.\n\ndocs/api/index.html\n  The Javadoc Lucene API documentation.  This includes the core\n  library, the demo, as well as all of the contrib modules.\n...\n\n\n\n...if anything, it's somewhat odd that we include the generated documentation in our source release (instead of just the forrest docs) but that's only because the generated docs are also committed into SVN (which now that i tihnk about it is also really weird since we seperated the version specific docs from the site docs)\n ",
            "author": "Hoss Man",
            "id": "comment-12754486"
        },
        {
            "date": "2009-09-12T13:46:22+0000",
            "content": "we will likely just close this, but for now I'm just taking off 2.9 (didn't plan/think it would be done for 2.9 in the first place actually) ",
            "author": "Mark Miller",
            "id": "comment-12754530"
        },
        {
            "date": "2013-04-13T21:28:08+0000",
            "content": "SPRING_CLEANING_2013 JIRAS As per Mark's last comment. ",
            "author": "Erick Erickson",
            "id": "comment-13631179"
        }
    ]
}