{
    "id": "LUCENE-2788",
    "title": "Make CharFilter reusable",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The CharFilter API lets you wrap a Reader, altering the contents before the Tokenizer sees them.\nIt also allows you to correct the offsets so this is transparent to highlighting.\n\nOne problem is that the API isn't reusable, if you have a lot of short documents its going to be efficient.\nAdditionally there is some unnecessary wrapping in Tokenizer (see the CharReader.get in the ctor, but not in reset(Reader)!!!)",
    "attachments": {
        "LUCENE-2788.patch": "https://issues.apache.org/jira/secure/attachment/12465070/LUCENE-2788.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-12-01T20:44:24+0000",
            "content": "here's a very quick patch (all tests pass):\n\n\tChanged CharFilter to extend FilterReader, and removed CharStream and CharReader.\n\tadded reset(Reader) to CharFilter, so you can reset your entire charfilter chain with a new reader.\n\tchanged Solr to re-use the charfilter chain in its Analyzers.\n\n\n\nit would be nice to add specific reuse tests to some of these charfilters, and also to see\nif theres a way we can do this with any backwards compatibility... i didnt worry about that when making the patch. ",
            "author": "Robert Muir",
            "id": "comment-12965840"
        },
        {
            "date": "2012-03-21T17:32:26+0000",
            "content": "+1\n\nI really like the approach here (just using FilterReader instead of our own new class).\n\nSince the back-compat is going be tricky... maybe we should first commit this patch to trunk? ",
            "author": "Michael McCandless",
            "id": "comment-13234556"
        },
        {
            "date": "2012-03-21T18:56:13+0000",
            "content": "The patch likely needs to be brought up to speed (probably not too bad, but maybe some work).\n\nI'm gonna be focused on 3.6 for a while, so if anyone wants to take this, feel free! ",
            "author": "Robert Muir",
            "id": "comment-13234860"
        }
    ]
}