{
    "id": "LUCENE-2849",
    "title": "StringIndexOutOfBoundsException on searchtime",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/benchmark"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "3.0.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I've been trying to run the example PrecisionRecall.java code from Lucene in Action II (downloaded the code, so its just as in the book). It gives a StringIndexOutOfBoundsException on my machine. \n\nFigured it out. I copied QualityBenchmark and QualityStats from the Lucene source and inserted a debugline to get a view of the argument values in the function that throws the exception.\n\nprivate String fracFormat(String frac) {\nint k = frac.indexOf('.');\nString s1 = padd+frac.substring(0,k);\nint n = Math.max(k,6);\ns1 = s1.substring(s1.length()-n);\nreturn s1 + frac.substring(k);\n}\n\nThis function assumes that a decimal '.' is being used. However, the PC's we use over here at uni have a different locale using a ',' for decimals. Think you might be able to catch that by using (new DecimalFormatSymbols().getDecimalSeparator()) instead of ('.')?",
    "attachments": {
        "LUCENE-2849.patch": "https://issues.apache.org/jira/secure/attachment/12467716/LUCENE-2849.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-01-06T13:18:40+0000",
            "content": "However, the PC's we use over here at uni have a different locale using a , for decimals. Think you might be able to catch that by using DecimalFormatSymbols().getDecimalSeperator() instead of '.'?\n\nHi Jeroen, I agree this sounds like a localization bug. do you want to contribute a patch?\nsee http://wiki.apache.org/lucene-java/HowToContribute ",
            "author": "Robert Muir",
            "id": "comment-12978309"
        },
        {
            "date": "2011-01-06T13:30:47+0000",
            "content": "Hi Robert,\n\nWell I've never contributed a patch to open source b4, but I'll have a look on the page you refer to, to see if I can figure it out.\n\nregards, Jeroen\n ",
            "author": "Jeroen Vuurens",
            "id": "comment-12978313"
        },
        {
            "date": "2011-01-06T13:50:33+0000",
            "content": "Jeroen, let us know either way! (we can try to improve the guide).\n\nOne thing to keep in mind, is that lucene/contrib/benchmark is now under modules/benchmark in our trunk code:\nhttp://svn.apache.org/repos/asf/lucene/dev/trunk/ ",
            "author": "Robert Muir",
            "id": "comment-12978319"
        },
        {
            "date": "2011-01-06T15:56:47+0000",
            "content": "Really made an attempt here. Just starting to use Lucene, but am going for a few years of researching information retrieval at least, so figured knowing how SVN works (is new for me too) enables me to contribute more. But after getting eclipse with svn-plugins to work, it hangs at importing 52% giving a java-heap error. Can't find any good tutorial on how to get SVN to work. Unless you have a doable tutorial on this I think I better leave it into your capable hands.\n ",
            "author": "Jeroen Vuurens",
            "id": "comment-12978379"
        },
        {
            "date": "2011-01-07T11:18:24+0000",
            "content": "Hi Robert,\n\nQuite a hassle for someone thats new to SVN. I wast able to create a test. Problem is that the whole export doesnt build in Netbeans. I made the changes to the file, it does test out ok like this in my own environment. First attempt at posting a patch, so would appreciate some feedback if the patch is usable as created or if I did something wrong.\n\ngl Jeroen  ",
            "author": "Jeroen Vuurens",
            "id": "comment-12978743"
        }
    ]
}