{
    "id": "LUCENE-6463",
    "title": "Share more logic between our approximated queries",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "5.2",
            "6.0"
        ],
        "priority": "Minor",
        "status": "Closed",
        "type": "Improvement"
    },
    "description": "We have several queries that support approximations, and in particular the ones based on random-access (doc values terms/range, FieldValueFilter, ...) duplicate some logic.",
    "attachments": {
        "LUCENE-6463.patch": "https://issues.apache.org/jira/secure/attachment/12730600/LUCENE-6463.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14529239",
            "author": "Adrien Grand",
            "date": "2015-05-05T20:50:58+0000",
            "content": "Here is a patch:\n\n\tit adds a new RandomAccessWeight that has a simple Bits getMatchingDocs(LeafReaderContext context) method that can be overridden to define matching docs. Such weights will produce scorers with approximations that match every document and a matches() method that checks deleted docs first and then the bits returned by getMatchingDocs\n\tit moves David's ConstantScoreScorer to lucene/core and makes other constant-score queries use it, including ConstantScoreQuery\n\tit fixes a performance bug in ConstantScoreWeight (parent class of RandomAccessWeight) in order to use the approximation to check if a document matched instead of using only the scorer. Otherwise calling explain on a DocValuesRangeQuery could result in a linear scan.\n\n "
        },
        {
            "id": "comment-14529851",
            "author": "David Smiley",
            "date": "2015-05-06T03:49:51+0000",
            "content": "I'm glad you noticed my Scorer with the TODO \n\nI was reviewing the patch but hit a dead-end in finding the RandomAccessWeight. Please put that in the patch.  Even without seeing R.A.W., it's nice to see in this patch that many scorers and weights go away or get simplified.\n\nOther opportunities to use the Constant scorer?:\n\n\tJoinQuery.JoinScorer\n\tSolrConstantScoreQuery.ConstantScorer (say with a factory method as a substitute for that constructor),\n\tMatchAllDocsQuery with a DocIdSetIterator.all\n\tFilter.createWeight.scorer\n\n "
        },
        {
            "id": "comment-14530139",
            "author": "Adrien Grand",
            "date": "2015-05-06T08:23:17+0000",
            "content": "Thanks for having a look David, I added RandomAccessWeight and applied your suggestions! "
        },
        {
            "id": "comment-14530830",
            "author": "David Smiley",
            "date": "2015-05-06T16:31:19+0000",
            "content": "The patch looks good Adrien (+1).  The patch I'm uploading augments yours with a use of ConstantScorScorer in TermsQuery.  No other changes.\n\nI’ve seen at least a few cases where we start from a DocIdSet and then check for null, then grab the DISI from it then check for null, and then finally return the constant scorer.  Perhaps a static method could be added like from(weight, score, DocIdSet)?  I'm not sure if it's worth the method but I thought I'd bring it up. "
        },
        {
            "id": "comment-14531371",
            "author": "Adrien Grand",
            "date": "2015-05-06T20:45:00+0000",
            "content": "I’ve seen at least a few cases where we start from a DocIdSet and then check for null, then grab the DISI from it then check for null, and then finally return the constant scorer.\n\nI agree this is horrible to deal with LUCENE-5117 (but complicated to fix). Hopefully moving to filters is going to make it less of an issue as we will not have to deal as much with DocIdSet as we had in the past.\n\nThanks for fixing TermsQuery too, it looks good! I'll commit the patch tomorrow if nobody has objections. "
        },
        {
            "id": "comment-14532553",
            "author": "ASF subversion and git services",
            "date": "2015-05-07T12:39:22+0000",
            "content": "Commit 1678181 from Adrien Grand in branch 'dev/trunk'\n[ https://svn.apache.org/r1678181 ]\n\nLUCENE-6463: Share more logic between approximated queries. "
        },
        {
            "id": "comment-14532606",
            "author": "ASF subversion and git services",
            "date": "2015-05-07T13:29:54+0000",
            "content": "Commit 1678194 from Adrien Grand in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1678194 ]\n\nLUCENE-6463: Share more logic between approximated queries. "
        },
        {
            "id": "comment-14586857",
            "author": "Anshum Gupta",
            "date": "2015-06-15T21:43:32+0000",
            "content": "Bulk close for 5.2.0. "
        }
    ]
}