{
    "id": "LUCENE-3118",
    "title": "Tools for making explanations easier to consume/understand",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Often times, reading Explanations (i.e. the breakdown of scores for a particular query and result, say via Solr's &debugQuery) is a pretty cryptic and hard to do undertaking.  I often say people suffer from \"explain blindness\" from staring at explanation results for too long.  We could add a layer of explanation helpers above the core Explain functionality that help people understand better what is going on.  The goal is to give a higher level of tools to people who aren't necessarily well versed in all the underpinnings of Lucene's scoring mechanisms but still want information about why something didn't match\n\nFor instance (brainstorming some things that might be doable):\n\n\tExplain Diff Tool – Given an 1 or more explanations, quickly highlight what the key things are that differentiate the results  (i.e. fieldNorm is higher, etc.)\n\tGiven a query and any document, give a more friendly reason why it ranks lower than others without the need to have to parse through all the pieces of the score, for instance, could you simply say something like, programatically that is, this document scored lower compared to your top 10 b/c it had no values in the foo Field.\n\tCould even maybe return codes for these reasons which could then be hooked into actual user messages.\n\n\n\nI don't have anything concrete patch-wise here, but am putting this up as a way to capture the idea and potentially spur others to think about it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-20T20:24:17+0000",
            "content": "LUCENE-3013 captures a lot of ideas about making explanations easier to consume/use in client apps ... i think a lot of the ideas here are dependent on some of the ideas there. ",
            "author": "Hoss Man",
            "id": "comment-13037064"
        }
    ]
}