{
    "id": "LUCENE-1178",
    "title": "Hits does not use MultiSearcher's createWeight",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.3",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "I am developing a distributed index, using MultiSearcher and RemoteSearcher. When investigating some performance issues, I noticed that there is a lot of back-and-forth traffic between the servers during the weight calculation.\nAlthough MultiSearcher has a method called createWeight that minimizes the calls to the sub-searchers, this method never actually gets called when I call search(query).\n\nFrom what I can tell, this is fixable by changing in Hits.java the line:\nweight = q.weight(s);\nto:\nweight = s.createWeight(q);",
    "attachments": {
        "hits.diff": "https://issues.apache.org/jira/secure/attachment/12375581/hits.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-02-14T12:13:00+0000",
            "content": "Adding a patch for the suggested solution (it's just two lines, really). ",
            "author": "Israel Tsadok",
            "id": "comment-12568904"
        },
        {
            "date": "2008-05-28T11:18:17+0000",
            "content": "Wow, that was a deafening silence....\n\nSince Hits has been deprecated in LUCENE-1290, I guess there's no reason to keep this bug open. \nIf anyone with permissions is reading this, I think a status change to WONTFIX is in order. ",
            "author": "Israel Tsadok",
            "id": "comment-12600439"
        },
        {
            "date": "2008-05-28T11:26:37+0000",
            "content": "Id still like to see an answer if anyone knows. From what I can tell, this is also the only place that the similarity from the multi searcher is used.\n\nDoes that mean that MultiSearcher.setSimilarity has no real effect? ",
            "author": "Mark Miller",
            "id": "comment-12600440"
        },
        {
            "date": "2008-05-28T12:42:11+0000",
            "content": "Actually, when using the other search methods, e.g. search(query, filter, n), the proper method is called (createWeight), so this works properly if you don't use Hits - MultiSearcher's method is the one that gets called.\n\nThere was a similarity issue in MultiSearcher, but LUCENE-789 fixed it. ",
            "author": "Israel Tsadok",
            "id": "comment-12600456"
        },
        {
            "date": "2008-06-11T06:12:16+0000",
            "content": "With Hits getting deprecated, I think it doesn't make sense to pursue this.  If anyone disagrees, we can reopen. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12604131"
        }
    ]
}