{
    "id": "LUCENE-1732",
    "title": "Multi-threaded Spatial Search",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "2.9",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The attached patch is a large refactoring of the spatial search contrib.  The primary contribution is the creation of the ThreadedDistanceFilter, which uses an ExecutorService to filter the documents in multiple threads.  As a result of doing the filtering in multiple threads, the time taken to filter 1.2 million documents has been reduced from nearly 3s, to between 500-800ms.\n\nAs part of this work, the DistanceQueryBuilder has been replaced by the SpatialFilter, a Lucene Filter, some unused functionality has been removed, and the package hierarchy has changed.  Consequently this patch breaks backwards compatibility with the existing spatial search contrib.\n\nAlso during the process of making these changes, abstractions have been added so that the one implementation of the ThreadedDistanceFilter can work with lat/long and geohash data formats, and so that precise but costly arc distance calculations can be replaced by less precise but much more efficient flat plane calculations if needed.\n\nThis patch will be used in an upcoming patch for Solr which will improve Solr's support for spatial search.",
    "attachments": {
        "LUCENE-1732_multi_threaded_spatial_search.patch": "https://issues.apache.org/jira/secure/attachment/12412493/LUCENE-1732_multi_threaded_spatial_search.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-07-03T13:44:00+0000",
            "content": "As it breaks backwards compatibility, could you use o.a.l.util.NumericUtils instead of NumberUtils and remove the class? Using this new class, all numeric values use the same encoding coming from Lucene core. This is part of a new approach for numeric range queries (see also SOLR-940), but the number format can also be used for Spatial's Tier encoding.\n\nI could then close LUCENE-1505. ",
            "author": "Uwe Schindler",
            "id": "comment-12726965"
        },
        {
            "date": "2009-07-03T14:36:59+0000",
            "content": "Unfortunately Solr is not using a version of Lucene which has the NumericUtils class at this point and I would like for this patch to be usable with Solr.  When Solr does update to a version of Lucene which does include NumericUtils, I will update my patch to use the class. ",
            "author": "Chris Male",
            "id": "comment-12726986"
        },
        {
            "date": "2009-07-03T14:59:03+0000",
            "content": "This is only a couple of days until this is part of Solr trunk. This is a case about Lucene 2.9, so it should use Lucene 2.9 things. This contrib may be part of Solr some time in the future but until then the Lucene JARs will also be updated.\n\nI only mention this, as I will do the change to NumericUtils in very near future (when I have time to do it). NumericUtils has also the important advantage, that it is natively supported by Lucene's FieldCache (you can do e.g. FieldCache.getFloats() on such a field), so calculations on such fields could also be done using the FieldCache.\n\nThe Lucene people have no problem with changing the API nor the index format, as this was not yet released, so there is no backwards problem (only for people already using another version of LocalLucene).\n\nUwe ",
            "author": "Uwe Schindler",
            "id": "comment-12726997"
        },
        {
            "date": "2010-02-25T21:28:25+0000",
            "content": "If I have a machine with say four CPU cores also running Solr with four cores (a distributed – i.e. sharded index), would it be fair to say that the optimization presented in this issue is of no use? ",
            "author": "David Smiley",
            "id": "comment-12838544"
        },
        {
            "date": "2010-12-01T09:57:30+0000",
            "content": "Closing along with LUCENE-2139 ",
            "author": "Chris Male",
            "id": "comment-12965645"
        }
    ]
}