{
    "id": "LUCENE-4190",
    "title": "IndexWriter deletes non-Lucene files",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Carl Austin raised a good issue in a comment on my Lucene 4.0.0 alpha blog post: http://blog.mikemccandless.com/2012/07/lucene-400-alpha-at-long-last.html\n\nIndexWriter will now (as of 4.0) delete all foreign files from the index directory.  We made this change because Codecs are free to write to any files now, so the space of filenames is hard to \"bound\".\n\nBut if the user accidentally uses the wrong directory (eg c:/) then we will in fact delete important stuff.\n\nI think we can at least use some simple criteria (must start with _, maybe must fit certain pattern eg _<base36>(_X).Y), so we are much less likely to delete a non-Lucene file....",
    "attachments": {
        "LUCENE-4190.patch": "https://issues.apache.org/jira/secure/attachment/12535099/LUCENE-4190.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-04T13:16:28+0000",
            "content": "History repeats itself: LUCENE-385. ",
            "author": "Michael McCandless",
            "id": "comment-13406497"
        },
        {
            "date": "2012-07-04T13:18:43+0000",
            "content": "I dont think we should do anything beyond 'must start with _'\n\nOtherwise this file handling gets complicated again, I don't want to see that! \n\nIn all cases, if we start enforcing what the file names for lucene-files must be,\nthen when we call SegmentInfo.setFiles, we need an assert that they \nall in fact actually match this pattern. ",
            "author": "Robert Muir",
            "id": "comment-13406500"
        },
        {
            "date": "2012-07-04T13:30:15+0000",
            "content": "I also raised an eyebrow when I read this comment. Many of the lucene+facet deployments that I know of store the taxonomy index as a sub-directory of the search index. Also, we've been storing other files in the index directory too ... this new feature will affect such existing deployments.\n\nI think it makes sense to change IW behavior to only delete files that start with _. It's a reasonable requirement IMO.\n\nWhile I don't know the nature of this change, I can assume it's related to IW not knowing which files to delete when a segment is no longer needed, because Codecs can pick their own file names. If we had an instance which kept track of all files that were created, e.g. every Codec would register the files there (if it wants to protect from their deletion), would make the decision of which files to delete easier? ",
            "author": "Shai Erera",
            "id": "comment-13406510"
        },
        {
            "date": "2012-07-04T13:39:40+0000",
            "content": "We track the files, but what if your computer crashes during flush, how would we know to erase the broken files.\n\nLets keep it simple with _ ",
            "author": "Robert Muir",
            "id": "comment-13406517"
        },
        {
            "date": "2012-07-04T13:40:56+0000",
            "content": "patch is against branch_4x ",
            "author": "Robert Muir",
            "id": "comment-13406519"
        },
        {
            "date": "2012-07-04T13:41:04+0000",
            "content": "Many of the lucene+facet deployments that I know of store the taxonomy index as a sub-directory of the search index\n\nWe won't delete directories, just files.\n\nAlso, we've been storing other files in the index directory too ... this new feature will affect such existing deployments.\n\nYeah ... better to move them elsewhere or to a sub dir?\n\nI can assume it's related to IW not knowing which files to delete when a segment is no longer needed, because Codecs can pick their own file names\n\nRight: it's easy to track the positive set (files referenced by current segments), what's harder is the negative set (files created in the past but no longer referenced).\n\nIf we had an instance which kept track of all files that were created, e.g. every Codec would register the files there (if it wants to protect from their deletion), would make the decision of which files to delete easier?\n\nIn theory it would ... but this would add a fair amount of complexity (we'd have to save this list of files into segments_N).  In fact long ago Lucene did this (it had a deletable file which stored the list of files previously created and now to-be-deleted). ",
            "author": "Michael McCandless",
            "id": "comment-13406520"
        },
        {
            "date": "2012-07-04T13:41:25+0000",
            "content": "I think that the way to \"bound\" the namespace of files is to put everything in a subdirectory of the index directory chosen by the user and control the name of that subdirectory, making it clear that this is semi-private to Lucene and that all files in that subdirectory are fair game. ",
            "author": "Andi Vajda",
            "id": "comment-13406521"
        },
        {
            "date": "2012-07-04T13:45:10+0000",
            "content": "Let's keep it simple, I agree. ",
            "author": "Shai Erera",
            "id": "comment-13406525"
        },
        {
            "date": "2012-07-04T13:48:12+0000",
            "content": "We can maybe improve in the future besides the _ check, but I just think this is an easy improvement that will prevent most of the problems.\n\nI just think in this specific case, its critical to balance the complexity of our code against any improvement here, because there can always be a conflict no matter what we do. _ is a nice 80/20 that is simple to understand  ",
            "author": "Robert Muir",
            "id": "comment-13406529"
        },
        {
            "date": "2012-07-04T14:12:33+0000",
            "content": "Robert: assertSaneFiles is called directly, so the loop is always executed.\n\nShould look like:\n\nassert assertSaneFiles();\n ",
            "author": "Uwe Schindler",
            "id": "comment-13406541"
        },
        {
            "date": "2012-07-04T14:14:26+0000",
            "content": "nice catch, thanks for reviewing Uwe! ",
            "author": "Robert Muir",
            "id": "comment-13406542"
        },
        {
            "date": "2012-07-04T16:31:05+0000",
            "content": "Patch looks good! ",
            "author": "Michael McCandless",
            "id": "comment-13406613"
        },
        {
            "date": "2012-07-04T17:59:33+0000",
            "content": "I think that the way to \"bound\" the namespace of files is to put everything in a subdirectory of the index directory chosen by the user and control the name of that subdirectory, making it clear that this is semi-private to Lucene and that all files in that subdirectory are fair game.\n\nisn't that in theory already the point of the index directory anyway?  how far down the rabit hole are we going to go?\n\nWe won't delete directories, just files.\n\nOne sanity check: this may be an orthoginal issue, but is there anything stoping a codec from using subdirectories?  what if i have a codec that creates \"_mycodec/foo\" and \"_mycodec/bar\" ... will those not get cleaned up? ",
            "author": "Hoss Man",
            "id": "comment-13406640"
        },
        {
            "date": "2012-07-04T18:01:43+0000",
            "content": "\nOne sanity check: this may be an orthoginal issue, but is there anything stoping a codec from using subdirectories\n\nYes: the fact that Directory abstraction doesnt have a way of dealing with subdirectories. you can only openInput(String) and createOutput(String) ",
            "author": "Robert Muir",
            "id": "comment-13406642"
        },
        {
            "date": "2012-07-04T18:03:13+0000",
            "content": "isn't that in theory already the point of the index directory anyway?\n\nSolr has always supported certain files being in the index directory (elevation and external file field IIRC). ",
            "author": "Yonik Seeley",
            "id": "comment-13406644"
        },
        {
            "date": "2012-07-04T18:05:55+0000",
            "content": "Then its probably a good time to put those somewhere else. \n\nthe index directory is for the index.\n\nwith flexible indexing, filenames are not set in stone.\n\ndespite this issue, those files could get deleted by IndexFileDeleter (especially if they start with the name \"segments\" or an underscore) ",
            "author": "Robert Muir",
            "id": "comment-13406646"
        },
        {
            "date": "2012-07-04T18:09:19+0000",
            "content": "How about we keep it simple and practical over pedantic and just go with the underscore. ",
            "author": "Yonik Seeley",
            "id": "comment-13406648"
        },
        {
            "date": "2012-07-04T18:12:59+0000",
            "content": "I'm not trying to be pedantic: I don't want the crazy files() handling we had before: its too much.\n\nThats why i took this issue (and already committed, see the commits list) to only delete files that start with underscores.\n\nI'm just mentioning that in general its still not really safe to put files in the index directory: this is just a simple solution that doesnt bring back the complicated files() handling we had that nobody really understood. ",
            "author": "Robert Muir",
            "id": "comment-13406652"
        },
        {
            "date": "2012-07-04T19:14:28+0000",
            "content": "If Joe user gives c:\\ as their index directory, which is silly, sure, it's even worse to just delete all files in there.\nEven if you just delete files there that are prefixed with _, we should know better than that. By putting the files we want to control into their own directory, a subdirectory of the Lucene index directory, there is very little room for mistakes.\n_ is just not a namespace for files reserved to Lucene, but a sub-directory chosen by Lucene instead is.\nIf you persist in picking just , why not picking _90439043 to make it at least more unique ? ",
            "author": "Andi Vajda",
            "id": "comment-13406669"
        },
        {
            "date": "2012-07-04T19:28:40+0000",
            "content": "now I'm ready to be pedantic: I refuse to let file handling get complicated for this stuff. its not important and we are trying to make a search engine not a file manager.\n\ntomorrow, ill revert my commit and go back to deleting all files as I was totally happy with the previous situation: just don't put stuff in the lucene index directory. ",
            "author": "Robert Muir",
            "id": "comment-13406671"
        },
        {
            "date": "2012-07-04T19:52:07+0000",
            "content": "Thats why i took this issue (and already committed, see the commits list)\n\nHmmm, I don't see any commits under this issue.  But searching the mailing list, I do see that you correctly used the issue name in the commit log - so I guess we can chalk it up to the recent ASF infra flakiness.\n\ntomorrow, ill revert my commit and go back to deleting all files\n\n-1 to reverting, we've made progress! ",
            "author": "Yonik Seeley",
            "id": "comment-13406682"
        },
        {
            "date": "2012-07-04T23:20:04+0000",
            "content": "I still plan to revert tomorrow. I think the comments here are a bad sign... I sent us down an unfortunate slippery slope\n\nwe are a search engine library!\n\ndon't put shit in the index directory! or we will delete your shit. dead simple. ",
            "author": "Robert Muir",
            "id": "comment-13406784"
        },
        {
            "date": "2012-07-04T23:33:18+0000",
            "content": "I still plan to revert tomorrow.\n\n-1\n\nThe now current behavior is more consistent with the legacy behavior, and everyone else seems to agree it's an improvement (although some feel we should go further).  Reverting this bug fix without a better fix makes no sense. ",
            "author": "Yonik Seeley",
            "id": "comment-13406786"
        },
        {
            "date": "2012-07-04T23:50:39+0000",
            "content": "pretty sure I have the right to revert my own commit.\n\nI can declare the licensing of asl2 as a mistake and instead full gpl if we want to press the point? ",
            "author": "Robert Muir",
            "id": "comment-13406789"
        },
        {
            "date": "2012-07-05T06:39:01+0000",
            "content": "What if we had an object called IndexFileNames with a method accept(String name), that returns true if the file is recognized, false otherwise - that could give applications a way to create a recognized-set of index files:\n\n\tLucene would provide a DefaultIndexFileNames which recognizes all non-codec files\n\tEither the app would provide an extension to the default (or a wrapper) which recognizes its codec files as well\n\t\n\t\tOr, we make the Codec responsible for recognizing files too, and then the code would just query the Codec for non-default index files.\n\t\n\t\n\n\n\nEither way, it seems like we can very easily recognize what are index files and what aren't.\n\nWhen files need to be deleted, it seems simple as well:\n\n\tLucene lists all files in the directory\n\tAny file that is referenced by the index (I assume we still know which files are needed right?) is kept\n\tAny other file is queried against IndexFileNames.accept and if it is accepted, it's deleted, otherwise it's left alone.\n\n\n\nSince this looks too simple to me, I'm assuming that I'm missing something. If so, can someone please clarify the problem to me? ",
            "author": "Shai Erera",
            "id": "comment-13406874"
        },
        {
            "date": "2012-07-05T06:46:47+0000",
            "content": "Perhaps out of context, but here goes..\nUsers sometimes do stupid things, me included, such as putting the index in a non-dedicated-directory. But should they pay the penalty just because the code should not get overly complicated?\n\nCodecs create their own files, and no one seems able to control what files they create (other than in assert?); Than, is it possible for the codec to handle the removal of the files it created? \n\nThat would make codecs work the same way the Index handles the 'core' index files - each codec will be able to erase its own.\nAnother closely related option - let IW consult with the codecs about 'non-core-files' and see which one should/could be removed.\n\nI only suggest this because I fear for users' files which might get erased. \n\nDisclosure:\nIt'll be ages before I understand Lucene 4 half as much as I do Lucene 3.6 (not that that's much), so forgive me if I stepped on anyone's toes, or just described how to implement a time  machine  ",
            "author": "Gilad Barkai",
            "id": "comment-13406877"
        },
        {
            "date": "2012-07-05T06:50:50+0000",
            "content": "<edit: remove unhelpful sarcasm, sorry> ",
            "author": "selckin",
            "id": "comment-13406879"
        },
        {
            "date": "2012-07-05T10:13:20+0000",
            "content": "Again: I am totally against complicated file handling here for this reason. People can handle this some other way in their apps.\nWe HAVE to keep this kind of code simple and maintainable in lucene.\n\nIt was a mistake to start a slippery slope by being friendly at all to this. (I reverted) ",
            "author": "Robert Muir",
            "id": "comment-13406951"
        },
        {
            "date": "2012-07-05T11:37:39+0000",
            "content": "I was the original commenter on the blog about this issue and have previously experienced the deletion of all files on a drive because of the exact same restriction - the fallout from this is massive.\n\nThe issue here is that many people who use lucene will not realise that this can happen, and this situation will occur sooner or later. You can't expect that every developer who uses lucene will understand every in and out, read every bit of javadoc fully or every release change note. Look at the number of posts to the mailing list that are just people who haven't fully read or understood something. I firmly believe that this has to be handled by the library such that a simple mistake or misunderstanding by a developer does not lead to the loss of important files. ",
            "author": "Carl Austin",
            "id": "comment-13407001"
        },
        {
            "date": "2012-07-05T12:00:43+0000",
            "content": "We HAVE to keep this kind of code simple and maintainable in lucene.\n\nWhy? We write lots of other code that prevents users from shooting themselves in the legs, so why make an exception here? Just because a code might get complicated doesn't mean we don't need to write it.\n\nWhile I agree with you that Lucene is not a File manager, I think it'd be good if we can cleanup after ourselves rather than delete everything that we don't recognize.\n\nSince you're more familiar than me with the 4.0 internals, can you please relate to the simple proposal I outlined above? Can it even work? ",
            "author": "Shai Erera",
            "id": "comment-13407027"
        },
        {
            "date": "2012-07-05T12:11:30+0000",
            "content": "I agree there is a real danger here if users accidentally point\nIndexWriter at the wrong directory.  This was found/fixed way in the\npast already: LUCENE-385.\n\nBut I also don't want to go back to the hairy files(), extensions() we\nused to require of all codec components.\n\nYet I think there's a good middle ground: only allow a codec to write\nto <seg>.* or _<seg>. files (ie the ones created by\nIndexFileNames).  All of our codecs are (should be!) using IndexFileName.*\nto compute a file name to write to.\n\nIn reality a codec already isn't free to just write to any file,\nbecause then it may conflict with another codec doing the same thing.\nSo de-facto codecs already have a \"private\" namespace, prefixed by\n_<seg> and further refined by _N (ie when there are multiple postings\nformats in a single codec).\n\nSince a general codec must already obey its private namespace (to not\nstep on other codecs) I think it's fine to enforce it?\n ",
            "author": "Michael McCandless",
            "id": "comment-13407033"
        },
        {
            "date": "2012-07-05T12:11:49+0000",
            "content": "The problem with a global filter is that what files a codec uses are an implementation detail of the codec. Currently today,\na codec can name files pretty much whatever it wants (it must avoid _seg.cfs and segments_seg and segments.gen of course).\n\nIn general other than exceptional cases, we know which files a codec owns because\na codec writes the list of files that it uses for a segment into the SegmentInfo (http://lucene.apache.org/core/4_0_0-ALPHA/core/org/apache/lucene/codecs/lucene40/Lucene40SegmentInfoFormat.html).\n\nThe problem is these exceptional cases: how can IndexFileDeleter distinguish between leftover partially written index files for a segment and some files of the user, since it may not have the SegmentInfo (.si) for that segment?\n\nPrevious attempts at this still didnt work well:\n\n\tlisting the extensions() in the codec is not great, e.g. Sep codec uses .doc extension for documents!\n\thaving the codec list the files it uses for a segment isnt easy and causes a mess: previously files() had to be symmetric at read and write time and we often had bugs in this, because the files used by the codec often depends upon various things like options the user chooses (e.g. did they enable term vectors, payloads, etc etc). I will do anything to prevent this from coming back!\n\n\n\nSo in my opinion, the only real, third option is to restrict what file names a codec can use, in a way thats not a huge imposition to the codec. My patch on this issue (which people weren't happy with) did just this: it restricted file names to begin with an underscore. ",
            "author": "Robert Muir",
            "id": "comment-13407034"
        },
        {
            "date": "2012-07-05T12:23:21+0000",
            "content": "\nSince a general codec must already obey its private namespace (to not\nstep on other codecs) I think it's fine to enforce it?\n\nThe problem it seems is people want a perfect solution. An imperfect solution (_.*) seems to imply that\nits a bug if lucene deletes _myImportantDocument.doc.\n\nSo if we insist on a perfect solution: then fine, the perfect solution I accept is for lucene to totally own\nthe directory, don't put files in there! Then the behavior is clear, no bugs, we delete everything. ",
            "author": "Robert Muir",
            "id": "comment-13407040"
        },
        {
            "date": "2012-07-05T13:23:36+0000",
            "content": "\nSo if we insist on a perfect solution: then fine, the perfect solution I accept is for lucene to totally own\nthe directory, don't put files in there! Then the behavior is clear, no bugs, we delete everything.\n\nBut than we're left with the original problem - should a poor user (say, me) accidentally put an index in an already filled directory (say /tmp) - the price to pay for is great.\nToo great IMHO. ",
            "author": "Gilad Barkai",
            "id": "comment-13407086"
        },
        {
            "date": "2012-07-05T13:25:42+0000",
            "content": "Robert, you completely ignored my explicit VETO.\nWe had consensus, and code was committed.  It's no longer \"your commit\" to do anything you want with over the objections of others.\nUndoubtedly, you would now revert any commit I would make to rectify the situation and fix this bug.  So let's now take it to the PMC and codify if it's OK to ignore VETOs of other PMC members that you don't agree with.  Perhaps we need to update the rules we operate under. ",
            "author": "Yonik Seeley",
            "id": "comment-13407088"
        },
        {
            "date": "2012-07-05T13:27:32+0000",
            "content": "you can't veto me backing out my own commit.  ",
            "author": "Robert Muir",
            "id": "comment-13407091"
        },
        {
            "date": "2012-07-05T13:31:53+0000",
            "content": "pretty sure I have the right to revert my own commit.\n\nOnce something is in the code base, it doesn't matter who committed it - all the same rules apply. That it's your commit doesn't change anything. Unless you went insane and started threatening license revoking type...oh wait...\n\nI can declare the licensing of asl2 as a mistake and instead full gpl if we want to press the point?\n\nYou can't be on the PMC and play games like this if you ask me. Being on the PMC means you have an obligation to act above this. Are we going back to the revert wars now?\n\nAs far as I can tell you are trying to act like a dictator on this issue. You contribute a lot to Lucene, but you are not the dictator. Why do you need to demand that certain things happen as you prescribe? Why do you need to make threats about revoking licenses?\n\nThis issue should be about consensus, not bullying.\n\nAre you kidding me dude?\n\nI hope you start working with the community and stop trying to step on it. Your stance is far too often, it's Roberts way or the highway if you ask me. ",
            "author": "Mark Miller",
            "id": "comment-13407094"
        },
        {
            "date": "2012-07-05T13:36:16+0000",
            "content": "Thats ok, its clearly another typical Solr-versus-Robert battle here, where Mark+Yonik both gang up on me.\n\nAnother way to look at it: I committed the patch after Mike reviewed it, because it looked like consensus.\nThere was then a ton of questions and commentary, arguably there wasnt really consensus and i prematurely committed.\n\nSo i backed it out. ",
            "author": "Robert Muir",
            "id": "comment-13407097"
        },
        {
            "date": "2012-07-05T13:37:08+0000",
            "content": "-1 for merrily wiping contents of whatever directory a user happens to pick for an index location\n+0 on requiring all codecs to declare filenames because I take on board Rob's points re complexity\n+1 for the \"_*\" name-spacing proposal as a sensible compromise\n\n\n ",
            "author": "Mark Harwood",
            "id": "comment-13407099"
        },
        {
            "date": "2012-07-05T13:48:26+0000",
            "content": "Thats ok, its clearly another typical Solr-versus-Robert battle here, where Mark+Yonik both gang up on me.\n\nI don't have an opinion on this issue. A lot of smart people have already given input, and I was interested to read about it. I have not formulated my own opinion yet.\n\nI also don't mind if you and Yonik have disagreement or debate. As long as you act reasonably.\n\nAnyone that ignores consensus and threatens license revoking has me not on their side. That's part of the role of a PMC member IMO. To keep an eye out for unhealthy community behavior and point it out. All the disagreement in the world is fine, but you have to play in the sandbox. ",
            "author": "Mark Miller",
            "id": "comment-13407104"
        },
        {
            "date": "2012-07-05T13:50:30+0000",
            "content": "I think if you read through the issue, how is consensus being ignored?\n\nAgain: I committed the patch after Mike reviewed it, because it looked like consensus.\nBut I think this was premature, because a lot of questions and comments came afterwards.\n\nBacking it out is the right thing to do. It might be that we get consensus for this patch\nor something else and it might even go right back in the way it was.\n\nYou just don't like the words I used. ",
            "author": "Robert Muir",
            "id": "comment-13407107"
        },
        {
            "date": "2012-07-05T13:55:18+0000",
            "content": "Another way to look at it: I committed the patch after Mike reviewed it, because it looked like consensus.\nThere was then a ton of questions and commentary, arguably there wasnt really consensus and i prematurely committed. So i backed it out. \n\nThat would have been a good argument and much better than the alternative argument you took IMO. ",
            "author": "Mark Miller",
            "id": "comment-13407115"
        },
        {
            "date": "2012-07-05T13:59:39+0000",
            "content": "You just don't like the words I used.\n\nThe words, the threat, the quick action - correct - that's my problem.\n\nYour objective is certainly not my problem.\n\nHad you made the argument you formulated after, I would not have a problem. That argument is within the 'sandbox'. ",
            "author": "Mark Miller",
            "id": "comment-13407120"
        },
        {
            "date": "2012-07-05T14:05:45+0000",
            "content": "\nThe words, the threat, the quick action - correct - that's my problem.\n\nRight, i take offense to the idea that if i committed something too soon, i cant back it out.\n\nSure, it didnt help that I was already frustrated with the technical situation (I thought and still do think,\nthat the patch is a great compromise, easy solution, low risk, simple, etc).\n\nBut i think if this situation happens, e.g. someone commits prematurely, then there are a bunch of comments\non the issue that make it clear there really isnt consensus, then they have the right to back it out, in fact\nI think its the right thing to do. \n\nAnd nobody can veto that. ",
            "author": "Robert Muir",
            "id": "comment-13407145"
        },
        {
            "date": "2012-07-05T14:10:34+0000",
            "content": "But I think this was premature, because a lot of questions and comments came afterwards.\n\nExcept that if you read back through the issue, that's not what happened.\n\nAnyway, if you're interested in consensus now, I don't see anyone opposed to the underscore solution in the short term, even if some thought it didn't go far enough.  I didn't see anyone saying that deleting all files was preferable in the short term.\nSo if there are no objections, I'll re-commit the underscore fix (which there was consensus for), and then discussion can continue about better methods.\n\nRobert, I'll repeat your own words back to you:\nWe can maybe improve in the future besides the _ check, but I just think this is an easy improvement that will prevent most of the problems. ",
            "author": "Yonik Seeley",
            "id": "comment-13407148"
        },
        {
            "date": "2012-07-05T14:13:48+0000",
            "content": "\nI didn't see anyone saying that deleting all files was preferable in the short term.\n\nI'm not sure this is totally true.\n\nAgain I think if its required that we have a perfect solution, then deleting all files is preferable to the alternative of codec having hairy code to detect if it owns or doesnt own a file.\n\nBut this patch is a nice imperfect solution that probably prevents accidental deletion of MyImportantDocument.doc or whatever. ",
            "author": "Robert Muir",
            "id": "comment-13407151"
        },
        {
            "date": "2012-07-05T14:20:09+0000",
            "content": "\nSo if there are no objections, I'll re-commit the underscore fix (which there was consensus for), and then discussion can continue about better methods.\n\nI don't object to the patch being committed (though i think it would be good to wait a little bit), but\nI am still very very concerned that it starts a slippery slope back to Codec.files(). ",
            "author": "Robert Muir",
            "id": "comment-13407155"
        },
        {
            "date": "2012-07-05T14:21:33+0000",
            "content": "Hi,\nI was thinking about the whole thing for longer time. My idea would limit us a bit more, but I really like Mike's proposal of fixed names. I would change the Directory class, so every method that handles or deletes files gets 2 parameters, segment name and one arbitrary codec-private file name. the directory is then responsible to create the file name, prefix with _ and so on. A custom directoy (like hbase), could use the segment name as table name and the private file name as identifier, so all segment files go into same hbase table. the diurectory would then also be responible to do a \"cleanup\"/\"list of files\", where it would only return files matching the pattern.\n\nFor the index wide metdata like segments file we would then unfortunately need a special method to get indexoutput \n\nIf we keep with current one-filename, i would make the format fixed, so it throws IOException if filename is invalid. Assert makes no sense here as it does not prevent people from doing the wrong thing. Then really nothing can create invalid files and deleting by \"_[0-9a-z_]+\" works and all would be happy.\n\nAlternatively, we could switch to the following:\n\n\tIf we create an new index, we enforce that listFiles returns empty list (., .. excluded, buts thats done already), otherwise we throw IOException(\"directory not empty\").\n\tIf there is a segment file already there, we can delete everything not allowed in an index.\n\n\n\nUwe ",
            "author": "Uwe Schindler",
            "id": "comment-13407157"
        },
        {
            "date": "2012-07-05T14:27:32+0000",
            "content": "\nI was thinking about the whole thing for longer time. My idea would limit us a bit more, but I really like Mike's proposal of fixed names. I would change the Directory class, so every method that handles or deletes files gets 2 parameters, segment name and one arbitrary codec-private file name. the directory is then responsible to create the file name, prefix with _ and so on. A custom directoy (like hbase), could use the segment name as table name and the private file name as identifier, so all segment files go into same hbase table. the diurectory would then also be responible to do a \"cleanup\"/\"list of files\", where it would only return files matching the pattern.\n\nI'm not sure matching _[0-9a-z_]+ is really that big of an improvement over just the underscore. But i dont think we need\nto refactor Directory.java to do this. we could just change the underscore check to a regular expression.\n\n\nAssert makes no sense here as it does not prevent people from doing the wrong thing.\n\nI don't agree: i at first thought to do a hard check, but this is only really necessary for codec developers. So an assert\nis enough, because you catch it when developing your codec (its either gonna work, or completely not work here).\n\n\nIf we create an new index, we enforce that listFiles returns empty list (., .. excluded, buts thats done already), otherwise we throw IOException(\"directory not empty\").\n\nI thought about this but i have concerns about things like .DS_Store and .nfsXXXXX or other files that some system could\nbe doing behind the scenes, etc.\n\n ",
            "author": "Robert Muir",
            "id": "comment-13407162"
        },
        {
            "date": "2012-07-05T14:30:16+0000",
            "content": "just to mention: the reason I don't like the Directory refactoring would be some of the crazy things we do (look at CompoundFileDirectory and also IndexWriter copySegmentAsIs, etc).\n\nThis is basically what i think we should avoid: adding a lot of risky complexity for little gain. ",
            "author": "Robert Muir",
            "id": "comment-13407167"
        },
        {
            "date": "2012-07-05T14:36:44+0000",
            "content": "\nAssert makes no sense here as it does not prevent people from doing the wrong thing.\n\nI don't agree: i at first thought to do a hard check, but this is only really necessary for codec developers. So an assert\nis enough, because you catch it when developing your codec (its either gonna work, or completely not work here).\n\nWhy not make it a hard check, otherwise one could write a file without _ and schwupps, it's wech  (German). Why only an assert? If we require all files start with _ lets enorce it, otherwise delete all files like we do currently. Using an assert would get my -1 to commit this again. ",
            "author": "Uwe Schindler",
            "id": "comment-13407170"
        },
        {
            "date": "2012-07-05T14:41:20+0000",
            "content": "I'm not 1000% determined for it to only be an assert, but then we should change how the code works to make\nsure that the check is not too expensive. The current assert makes SegmentInfo.addFiles/addFile very expensive (if its turned directly into a hard check) ",
            "author": "Robert Muir",
            "id": "comment-13407177"
        },
        {
            "date": "2012-07-05T14:49:31+0000",
            "content": "String.startsWith(\"_\") static string is cheap (a few cpu cycles, as it only needs compare length and one char... Please dont tell me that SI.addFilkes is called in inner loops like Scorers! Not doing this check is stupid.\n\nBTW: In CFSDirectory the assert about double entries on reading the dir should also throw CorruptIndexEx, because a CFS with duplicate file names is broken. This check is even cheaper. I am planning to open a new issue to fix all those I/O related checks to be hard, asserts are not appropriate here. ",
            "author": "Uwe Schindler",
            "id": "comment-13407181"
        },
        {
            "date": "2012-07-05T14:50:20+0000",
            "content": "Uwe, no i mean that we check the entire list each time.\n\nSo if someone were to call addFile(), addFile(), addFile() that would be very bad runtime. Ill update the patch. ",
            "author": "Robert Muir",
            "id": "comment-13407185"
        },
        {
            "date": "2012-07-05T14:51:43+0000",
            "content": "updated patch with _ check turned into a hard check. ",
            "author": "Robert Muir",
            "id": "comment-13407186"
        },
        {
            "date": "2012-07-05T15:04:07+0000",
            "content": "New patch looks good, I was not aware that the previous one was iterating over all files each time. As the SegmentInfo internal list should not be available outside, we have no problem anybody else changing this uncontrolled.\n\nSee also issue LUCENE-4196. ",
            "author": "Uwe Schindler",
            "id": "comment-13407196"
        },
        {
            "date": "2012-07-05T18:33:19+0000",
            "content": "\nI think that the way to \"bound\" the namespace of files is to put everything in a subdirectory of the index directory chosen by the user and control the name of that subdirectory, making it clear that this is semi-private to Lucene and that all files in that subdirectory are fair game.\n\nWell there are a couple challenges with that I think:\n1. subdirectories currently are a foreign concept to Directory, we would have to make some serious changes there to support subdirectories.\n2. Lucene 3.x and Lucene4-alpha indexes still need to be supported, and we dont want to leave behind baggage when we merge, so the transition would be tricky.\n3. the user could also do this on their own right? e.g. we still have the same situation we have currently, where anything in that directory can get deleted by lucene, its just underneath another layer. ",
            "author": "Robert Muir",
            "id": "comment-13407365"
        },
        {
            "date": "2012-07-05T22:19:51+0000",
            "content": "I think \n\n_<seg>.*\n\n or \n\n_<seg>_*.\n\n is better than simply _*?\n\nIe, it further reduces the risk of deleting a non-Lucene file, while\nnot restricting the codec at all (this is already its private\nnamespace)?  No codec should be writing files outside of this space\n(and if somehow one needs to in the future, we can cross that bridge\nat that point?).\n\nIt's of course still not perfect but I think it's as close as we should try\nto get. ",
            "author": "Michael McCandless",
            "id": "comment-13407550"
        },
        {
            "date": "2012-07-05T22:31:12+0000",
            "content": "I think the regex matching the current behavior (as restrictive as i can get) is:\n\n\n_<seg>(_.*)?\\..*\n\n ",
            "author": "Robert Muir",
            "id": "comment-13407562"
        },
        {
            "date": "2012-07-05T23:26:34+0000",
            "content": "Updated patch with the regex instead of the underscore.\n\nadditionally, dont fire off IndexFileDeleter's nuking of files if there is no current segments file. \n\nThis means if you screw up and pick c:\\, we do nothing. if you go and commit documents to c:\\, then the next time you fire up indexwriter it will do the nuking as its then actually an index directory. \n\nBut this gives you an additional chance to catch your mistake besides just the regex: plus its just a null check/optimization if you want to look at it. ",
            "author": "Robert Muir",
            "id": "comment-13407592"
        },
        {
            "date": "2012-07-06T09:27:37+0000",
            "content": "\n\n1. subdirectories currently are a foreign concept to Directory, we would have\nto make some serious changes there to support subdirectories.\n2. Lucene 3.x and Lucene4-alpha indexes still need to be supported, and we\ndont want to leave behind baggage when we merge, so the transition would be\ntricky.\n\nThe way I imagined this working (short of looking at the code and proposing a\npatch) was to just append something like \"lucene.index\" to the directory path\ngiven by the user and pretend that's what the user gave it (and create that\nsubdirectory). Code deleting the index files becomes simpler, it's just a\nrecursive delete of that subdirectory Lucene created.\n\nThat name, \"lucene.index\", could be in fact an additional parameter to the\nDirectory class so that one could pick different names and store multiple\nindexes in the directory part.\n\nHaving that extra name parameter would make it harder to a just use c:\\ or c:\\tmp which, while apparently silly, is also easy to hit accidentally. Imagine a shell script that puts together an index directory path with, say, some environment variables or command line parameters, and because of a bug there or some human error some inputs making up that path are now missing. Fancy generated path /home/fred/$(indexes) is now shorter all of a sudden, /home/fred gets used instead and later (partially) wiped. Ouch. No, I didn't just make this up \n\n\n3. the user could also do this on their own right? e.g. we still have the same situation we have currently, where anything in that directory can get deleted by lucene, its just underneath another layer.\n\nOf course they could, but the difference is that if Lucene is the one creating\na directory, I expect it to more or less control the files in it, whereas if I\ncreate a directory myself, that is not the case. I don't expect Lucene to take\nit over by deleting files in it it didn't create.\n\nWith the extra index name parameter, one would make it much less likely to stomp over something not belonging to Lucene. As for backwards compatibility, one could tolerate for the next release cycle, that this extra name be empty (which would be equivalent to the situation we have now, bug 4190). ",
            "author": "Andi Vajda",
            "id": "comment-13407858"
        },
        {
            "date": "2012-07-06T09:33:41+0000",
            "content": "\nAs for backwards compatibility, one could tolerate for the next release cycle, that this extra name be empty (which would be equivalent to the situation we have now, bug 4190).\n\n2 release cycles: as we need to be able to support the 4.0-ALPHA indexes through the 5.x series, we wouldn't even be able to implement this change until Lucene 6.0.\n ",
            "author": "Robert Muir",
            "id": "comment-13407862"
        },
        {
            "date": "2012-07-09T19:06:41+0000",
            "content": "I think that the way to \"bound\" the namespace of files is to put everything in a subdirectory of the index directory chosen by the user and control the name of that subdirectory, making it clear that this is semi-private to Lucene and that all files in that subdirectory are fair game.\n\nI think this idea is compelling.  It would clearly succeed in creating\na private namespace (unless someone had happened to separately create\na directory named 'lucene.index' there, which seems very unlikely).\n\nFor back compat... if we open an existing index (not in the subdir),\nwe'd have to just continue writing there?  But when creating a new\nindex, we'd create the subdir and write files into it (and maybe we\nfix index upgrader to somehow move the files to the subdir?).\n\nWe could make this change for 4.0 Beta, but it wouldn't be until 6.0\nthat we could remove the back compat (which is fine).\n\nHmm but then an old index would never actually migrate \"forward\".  Not\nquite sure how to do the transition ...\n\nIt seems like a rather big change, which makes me nervous ... and I\nimagine apps will be confused eg when they try to replicate or backup\n(but, they'd just have to fix themselves: apps can't rely on the index\nfiles).\n\nIt seems less risky to start with the current patch; in fact I think\nthe two changes can be done separately? ",
            "author": "Michael McCandless",
            "id": "comment-13409739"
        },
        {
            "date": "2012-07-29T17:33:25+0000",
            "content": "I think for now we should just commit the last \"best effort regexp\" patch ... progress not perfection.\n\nWe can separately / later explore creating our own sub-directory... ",
            "author": "Michael McCandless",
            "id": "comment-13424592"
        }
    ]
}