{
    "id": "LUCENE-8104",
    "title": "Facet module should no longer depend on Queries module (ValueSource)",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Closed",
        "type": "Improvement",
        "components": [
            "modules/grouping"
        ],
        "fix_versions": [
            "7.3"
        ]
    },
    "description": "The Grouping module depends on the Queries module in GroupingSearch / ValueSourceGroupSelector to use the ValueSource framework.  It should instead use the newer DoubleValueSource or LongValueSource framework in Core.  As I write this, this appears to be the last part of Lucene to refer to the ValueSource framework, and I think we should then remove it – for another issue of course.",
    "attachments": {
        "LUCENE-8104.patch": "https://issues.apache.org/jira/secure/attachment/12902810/LUCENE-8104.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16295653",
            "date": "2017-12-18T20:59:56+0000",
            "content": "CC Alan Woodward and Martijn van Groningen\nNote I have no intent to work on this anytime soon but wanted to at least file an issue.\n\nBTW Michael McCandless the facet module depends on the Queries module too but it appears it is only to make javadoc references to some classes it no longer actually uses  ",
            "author": "David Smiley"
        },
        {
            "id": "comment-16296426",
            "date": "2017-12-19T08:10:23+0000",
            "content": "LUCENE-7889 is a start at implementing this.\n\nRemoving ValueSource entirely would be great, but it's heavily used within Solr.  Would you want to just move the classes into the Solr subproject, or try and rework things so that Solr uses DoubleValuesSource instead? ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-16296505",
            "date": "2017-12-19T09:17:26+0000",
            "content": "The facets module also uses a FunctionQuery in TestTaxonomyFacetSumValueSource, so it can't be removed entirely.  But we could make it a test-only dependency instead? ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-16296537",
            "date": "2017-12-19T09:34:15+0000",
            "content": "Here's a patch changing the facet dependency on queries to be test-only, and fixing the javadocs. ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-16296577",
            "date": "2017-12-19T10:00:46+0000",
            "content": "The facets module also uses a FunctionQuery in TestTaxonomyFacetSumValueSource, so it can't be removed entirely.\n\nIt looks like it can be easily replaced with a FunctionScoreQuery? ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16296661",
            "date": "2017-12-19T11:43:51+0000",
            "content": "FunctionScoreQuery is also in the queries module ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-16296907",
            "date": "2017-12-19T14:51:12+0000",
            "content": "Removing ValueSource entirely would be great, but it's heavily used within Solr. Would you want to just move the classes into the Solr subproject, or try and rework things so that Solr uses DoubleValuesSource instead?\n\nIndeed those are the options.  The latter is certainly preferable to me but is of course a lot of work – not sure how much.\n\nRE facets module: if its tests only depend on the queries module then the build/dependencies should be modified as-such (or as Adrien suggested use FunctionScoreQuery.  And have its test switch to FunctionScoreQuery (thus away from ValueSource framework).  Right now the facets module artificially declares through its dependencies that a user needs the queries module when that's not true.  This ought to be another issue; sorry for distracting us here. ",
            "author": "David Smiley"
        },
        {
            "id": "comment-16296922",
            "date": "2017-12-19T14:58:52+0000",
            "content": "FunctionScoreQuery is also in the queries module\n\nSorry I got confused by the fact that DoubleValuesSource is in core. +1 to the patch.\n ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16298498",
            "date": "2017-12-20T13:24:01+0000",
            "content": "Commit 581b25e10cc291379f8508555b305c089a574e28 in lucene-solr's branch refs/heads/branch_7x from Alan Woodward\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=581b25e ]\n\nLUCENE-8104: Remove facet module compile-time dependency on queries ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-16298499",
            "date": "2017-12-20T13:24:04+0000",
            "content": "Commit d9695cca5512762957943f938a68d3f7e895b51d in lucene-solr's branch refs/heads/master from Alan Woodward\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d9695cc ]\n\nLUCENE-8104: Remove facet module compile-time dependency on queries ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-16298514",
            "date": "2017-12-20T13:33:42+0000",
            "content": "I've committed the patch, shall I change this issue to reflect the facets/queries dependency change instead and we can create a new one for grouping/queries once LUCENE-7889 is in? ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-16298620",
            "date": "2017-12-20T15:11:31+0000",
            "content": "Yeah at this point the issue transformed itself to be about the faceting module so indeed, edit it as-such and recreate another issue with the current title & description. ",
            "author": "David Smiley"
        },
        {
            "id": "comment-16299740",
            "date": "2017-12-21T09:13:27+0000",
            "content": "I think for the grouping module, for now, the ValueSourceGroupSelector class should be moved to the solr-core module and then the dependency on the queries module that the grouping module has can be removed, which is a big win on its own. ",
            "author": "Martijn van Groningen"
        },
        {
            "id": "comment-16307870",
            "date": "2018-01-02T10:51:27+0000",
            "content": "I opened LUCENE-8114 to deal with grouping ",
            "author": "Alan Woodward"
        }
    ]
}