{
    "id": "LUCENE-6711",
    "title": "Instead of docCount(), maxDoc() is used for numberOfDocuments in SimilarityBase",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [
            "core/search"
        ],
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "priority": "Minor",
        "status": "Resolved",
        "type": "Bug"
    },
    "description": "SimilarityBase.java has the following line :\n\n long numberOfDocuments = collectionStats.maxDoc();\n\n\n\nIt seems like collectionStats.docCount(), which returns the total number of documents that have at least one term for this field, is more appropriate statistics here.",
    "attachments": {
        "LUCENE-6711.patch": "https://issues.apache.org/jira/secure/attachment/12748320/LUCENE-6711.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14650451",
            "author": "Ahmet Arslan",
            "date": "2015-08-01T16:54:56+0000",
            "content": "Patch that includes suggested change. However, this breaks most of the tests in TestSimilarityBase. What is the preferred course of action here?   "
        },
        {
            "id": "comment-14650499",
            "author": "Robert Muir",
            "date": "2015-08-01T18:49:05+0000",
            "content": "IndexReader/Terms etc still document this as an optional statistic: I think we should keep it that way. E.G. maybe its hard to compute for some FilterReader, who knows.\n\nSo I think we should do a fallback like the other statistics: check for -1 and use maxDoc if its unsupported.\n\nBut I think its a good time to make the change. For ordinary users, it will not be trappy/happen incrementally: all these statistics have been supported since 4.0. We should fix TFIDFSimilarity and BM25Similarity too. "
        },
        {
            "id": "comment-14650500",
            "author": "Upayavira",
            "date": "2015-08-01T18:50:56+0000",
            "content": "I've often wondered the same sort of thing.\n\nNow, given that this will likely change the score for every single query anyone does on any Lucene based search, would it be possible to make this configurable, so that people can choose which one they want? More particularly, to choose the point at which their scoring will change? "
        },
        {
            "id": "comment-14650510",
            "author": "Robert Muir",
            "date": "2015-08-01T19:45:23+0000",
            "content": "This is already a pluggable api so someone can do that if they want: lets not make our code complicated. I also think its best to just make the change for trunk and not do it in a minor version. "
        },
        {
            "id": "comment-14651756",
            "author": "Ahmet Arslan",
            "date": "2015-08-03T11:29:38+0000",
            "content": "This patch checks for -1 and uses maxDoc() if docCount() is not unsupported. "
        },
        {
            "id": "comment-14651758",
            "author": "Ahmet Arslan",
            "date": "2015-08-03T11:33:54+0000",
            "content": "We should fix TFIDFSimilarity and BM25Similarity too.\n\nFor TFIDF and BM25, do we simply replace \n\ncollectionStats.maxDoc()\n\n with \n\ncollectionStats.docCount() == -1 ? collectionStats.maxDoc() : collectionStats.docCount()\n\n ? "
        },
        {
            "id": "comment-14651839",
            "author": "Robert Muir",
            "date": "2015-08-03T13:08:12+0000",
            "content": "yes, thats right "
        },
        {
            "id": "comment-14651911",
            "author": "Ahmet Arslan",
            "date": "2015-08-03T14:26:45+0000",
            "content": "Includes changes to TFIDF and BM25, ant clean test passes. "
        },
        {
            "id": "comment-14652160",
            "author": "Hoss Man",
            "date": "2015-08-03T17:36:07+0000",
            "content": "I also think its best to just make the change for trunk and not do it in a minor version.\n\n+1\n\nThis is the sort of behavior change that should be noted in MIGRATE.txt – Ahmet: could you take a stab at adding the necessary text in your patch? "
        },
        {
            "id": "comment-14653469",
            "author": "Ahmet Arslan",
            "date": "2015-08-04T11:23:11+0000",
            "content": "Patch that includes following migrate entry. But I am not sure this is an appropriate text for migrate.txt.\nThe way how number of document calculated is changed (LUCENE-6711)\nThe number of documents (docCount) is used to calculate term specificity (idf) and average document length (avdl). Prior to LUCENE-6711, collectionStats.maxDoc() was used for the statistics. Now, collectionStats.docCount() is used whenever possible, if not maxDocs() is used.\n\nAssume that a collection contains 100 documents, and 50 of them have \"keywords\" field. In this example, maxDocs is 100 while docCount is 50 for the \"keywords\" field. The total number of tokens for \"keywords\" field is divided by docCount to obtain avdl. Therefore, docCount which is the total number of documents that have at least one term for the field, is a more precise metric for optional fields.\n\nDefaultSimilarity does not leverage avdl, so this change would have relatively minor change in the result list. Because relative idf values of terms will remain same. However, when combined with other factors such as term frequency, relative ranking of documents could change. Some Similarity implementations (such as the ones instantiated with NormalizationH2 and BM25) take account into avdl and would have notable change in ranked list. Especially if you have a collection of documents with varying lengths. Because NormalizationH2 tends to punish documents longer than avdl.\n "
        },
        {
            "id": "comment-14695631",
            "author": "ASF subversion and git services",
            "date": "2015-08-13T17:37:17+0000",
            "content": "Commit 1695744 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1695744 ]\n\nLUCENE-6711: Use CollectionStatistics.docCount() for IDF and average field length computations "
        },
        {
            "id": "comment-14695633",
            "author": "Robert Muir",
            "date": "2015-08-13T17:38:00+0000",
            "content": "Thanks Ahmet, I committed this. I only made cosmetic changes: I renamed local variable and parameter names to be \"docCount\" because numDocs is pretty confusing. I also added a test case for all of our similarities. "
        },
        {
            "id": "comment-14705090",
            "author": "Steve Rowe",
            "date": "2015-08-20T15:12:53+0000",
            "content": "testNoFieldSkew() failure: https://issues.apache.org/jira/browse/LUCENE-6751 "
        },
        {
            "id": "comment-14705117",
            "author": "ASF subversion and git services",
            "date": "2015-08-20T15:25:36+0000",
            "content": "Commit 1696807 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1696807 ]\n\nLUCENE-6711: improve test when it fails "
        },
        {
            "id": "comment-14705121",
            "author": "Robert Muir",
            "date": "2015-08-20T15:26:44+0000",
            "content": "Thanks. I think it found an unrelated bug. "
        },
        {
            "id": "comment-14706970",
            "author": "Hoss Man",
            "date": "2015-08-21T16:31:24+0000",
            "content": "possible bug identified by Terry Smith in LUCENE-6758 "
        },
        {
            "id": "comment-14706980",
            "author": "Robert Muir",
            "date": "2015-08-21T16:36:16+0000",
            "content": "I dont think its a bug with this.\n\nLikely the typical bugs from crappy useless querynorm, and exposed by shaking things up. "
        }
    ]
}