{
    "id": "LUCENE-942",
    "title": "TopDocCollector.topDocs throws ArrayIndexOutOfBoundsException when called twice",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.2",
        "resolution": "Not A Problem",
        "status": "Closed"
    },
    "description": "Here's the implementation of TopDocCollector.topDocs():\n\n  public TopDocs topDocs() \n{\n    ScoreDoc[] scoreDocs = new ScoreDoc[hq.size()];\n    for (int i = hq.size()-1; i >= 0; i--)      // put docs in array\n      scoreDocs[i] = (ScoreDoc)hq.pop();\n      \n    float maxScore = (totalHits==0)\n      ? Float.NEGATIVE_INFINITY\n      : scoreDocs[0].score;\n    \n    return new TopDocs(totalHits, scoreDocs, maxScore);\n  }\n\nWhen you call topDocs(), hq gets emptied. Thus the second time you call it scoreDocs.length will be 0 and scoreDocs[0] will throw an ArrayIndexOutOfBoundsException.\n\nI don't know whether this 'call only once' semantics is intended behavior or not; if not, it should be fixed, if yes it should be documented.\n\nThanks a lot for an absolutely fantastic product,\nAaron",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2007-06-25T23:55:14+0000",
            "content": "this seems like both a documentation issue, and a bad state checking issue.\n\nthe javadoc for topDocs should indicate that it should only be called once all collection is done, and that calling it resets the internal state so that it can no longer be called again.\n\nthe internals of topDocs should be changed so that it doesn't rely on \"totalHits==0\" to indicate if there is a maxScore available and throws a meaninful exception if the method is called more then once.  I would suggest moving the maxScore assignment above the loop using hq.top() as both an indicator of a top score being available and as the top score itself, and wrapping the whole body of the method with something like ...\n\n  if (null == hq) throw new IllegalStateException(\"topDocs can not be called twice\")\n  try \n{ \n      ... \n  }\n finally \n{ hq=null} ",
            "author": "Hoss Man",
            "id": "comment-12508018"
        },
        {
            "date": "2007-06-26T00:55:00+0000",
            "content": "Perhaps simpler to make the scoreDocs[] array a private data member, which null until topDocs[] is called for the first time, and computed only once - then, repeated calls to topDocs() would use that same array... ? ",
            "author": "Doron Cohen",
            "id": "comment-12508025"
        },
        {
            "date": "2007-06-26T02:18:00+0000",
            "content": "that makes sense ... but there is still a state issue of \"don't call topDocs() until done collecting\" .. as is a TopDocCollector can't be reused (for more then one search) because totalHits grows without ever being reset, but hq does get reset when topDocs() is called ... currently this is unintentionally enforced by the ArrayIndexOutOfBoundsException, it would be a good idea to continue to enforce it (with an exception that has a better class/message)\n\na finer point thta some might nit pick about is that it's generally considered a bad idea to return a refrence a member array since your client can mutate it out from under you ... i don't personally think that's much of a concern in this case since there is no expectation that TopDocCollector will ever touch the array again. ",
            "author": "Hoss Man",
            "id": "comment-12508039"
        },
        {
            "date": "2011-01-25T13:15:49+0000",
            "content": "TopDocsCollector documents that you cannot call topDocs() more than once for each search execution. ",
            "author": "Shai Erera",
            "id": "comment-12986368"
        }
    ]
}