{
    "id": "LUCENE-4654",
    "title": "Test duration statistics from multiple test runs should be reused (locally).",
    "details": {
        "components": [],
        "fix_versions": [
            "4.2",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Trivial",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This is trivial to accomplish: when somebody (or jenkins) runs tests multiple times the execution statistics could be reused to improve load balancing on the local machine (local hardware and settings) in favor of the precached values currently version in the svn repo.\n\nAt this moment we already do this, but keep the stats under build/ and every ant clean effectively removes them. I could move those stats under an svn-ignored folder elsewhere so that these stats are not lost and reused for balancing.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-03-04T12:42:43+0000",
            "content": "I've implemented this and committed it in along with an update to precomputed statistics.\n\nThis will not make your tests a whole lot faster because there is job-stealing by default anyway so unless you really hit a long test scheduled at the very end of a series of per-jvm tests it won't make a difference.\n\nObviously it won't make any difference if you're running with a single JVM either.\n\nWhat may make a (small) difference is for people with a lot of cores or, paradoxically, a few cores on slower machines. I think it's an improvement over the existing version anyway so it's for the better. ",
            "author": "Dawid Weiss",
            "id": "comment-13592163"
        },
        {
            "date": "2013-03-04T12:44:14+0000",
            "content": "[trunk commit] Dawid Weiss\nhttp://svn.apache.org/viewvc?view=revision&revision=1452276\n\nLUCENE-4654: Test duration statistics from multiple test runs should be reused (locally). ",
            "author": "Commit Tag Bot",
            "id": "comment-13592165"
        },
        {
            "date": "2013-03-04T12:54:24+0000",
            "content": "[branch_4x commit] Dawid Weiss\nhttp://svn.apache.org/viewvc?view=revision&revision=1452277\n\nLUCENE-4654: Test duration statistics from multiple test runs should be reused (locally). ",
            "author": "Commit Tag Bot",
            "id": "comment-13592172"
        },
        {
            "date": "2013-05-10T10:34:08+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654133"
        }
    ]
}