{
    "id": "LUCENE-1051",
    "title": "Separate javadocs for core and contribs",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/javadocs"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.3"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "A while ago we had a discussion on java-dev about separating the javadocs\nfor the contrib modules instead of having only one big javadoc containing \nthe core and contrib classes.\n\nThis patch:\n\n\tAdds new targets to build.xml:\n\t\n\t\t\"javadocs-all\" Generates Javadocs for the core, demo, and contrib\n    classes\n\t\t\"javadocs-core\" Generates Javadocs for the core classes\n\t\t\"javadocs-demo\" Generates Javadocs for the demo classes\n\t\t\"javadocs-contrib\" Using contrib-crawl it generates the Javadocs for\n    all contrib modules, except \"similarity\" (currently empty) and gdata.\n\t\n\t\n\tAdds submenues to the Javadocs link on the Lucene site with links to\n  the different javadocs\n\tIncludes the javadocs in the maven artifacts\n\n\n\nRemarks:\n\n\tI removed the ant target \"javadocs-internal\", because I didn't want to\n  add corresponding targets for all new javadocs target. Instead I \n  defined a new property \"javadoc.access\", so now  \n  \"ant -Djavadoc.access=package\" can be used in combination with any of\n  the javadocs targets. Is this ok?\n\tI didn't include gdata (yet) because it uses build files that don't\n  extend Lucenes standard build files.\n\n\n\nHere's a preview:\nhttp://people.apache.org/~buschmi/site-preview/index.html\n\nPlease let me know what you think about these changes!",
    "attachments": {
        "lucene-1051.patch": "https://issues.apache.org/jira/secure/attachment/12369342/lucene-1051.patch",
        "lucene-1051-take2.patch": "https://issues.apache.org/jira/secure/attachment/12369345/lucene-1051-take2.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-11-12T04:29:47+0000",
            "content": "Some small improvements:\n\n\n\tMoved property \"javadoc.link\" to common-build.xml, so that\n  the link is available in the contrib javadocs as well.\n\tLinked the core, demo, and contrib javadocs with the\n  combined javadocs, which makes these javadocs much nicer.\n\tThe combined javadocs now go into the same directory as\n  before, so bookmarks will still work after we applied this\n  patch.\n\n\n\nI also updated the preview. ",
            "author": "Michael Busch",
            "id": "comment-12541684"
        },
        {
            "date": "2007-11-14T05:21:53+0000",
            "content": "I'm planning to commit this tomorrow... any objections? Did anyone look at the preview yet? ",
            "author": "Michael Busch",
            "id": "comment-12542322"
        },
        {
            "date": "2007-11-14T07:40:25+0000",
            "content": "This has been somewhere far down on my todo list for quite a while, so I was going to try the patch, but a committed version would certainly be easier. In case you prefer someone else to try this before committing, could you wait a (short) week? ",
            "author": "Paul Elschot",
            "id": "comment-12542356"
        },
        {
            "date": "2007-11-14T12:52:24+0000",
            "content": "Looks good.  I think we need to put GData in before committing.\n\nAlso, I don't know ANT well enough, but is there anyway to have it automatically do the contrib packages without having to explicitly specify it?  Just one less thing to remember to add when adding new contrib packages.  If it's not a quick fix, don't worry about. ",
            "author": "Grant Ingersoll",
            "id": "comment-12542444"
        },
        {
            "date": "2007-11-14T18:21:53+0000",
            "content": "\nLooks good. I think we need to put GData in before committing.\n\nGData has build files that don't extend common-build.xml, so there's always extra work that needs to be done when we add a new feature to our build (like maven artifacts or these javadocs improvements). It doesn't seem that Simon is still around, but we should decide on how we're going to maintain gdata. I'll open a new issue for that and not put GData in this patch.\n\n\nAlso, I don't know ANT well enough, but is there anyway to have it automatically do the contrib packages without having to explicitly specify it? Just one less thing to remember to add when adding new contrib packages. If it's not a quick fix, don't worry about.\n\nHmm, not sure how to do that. There's a TODO comment in the build file for a long time. I think I'll commit this patch and we can simplify that in the future if someone knows who to do this with Ant. ",
            "author": "Michael Busch",
            "id": "comment-12542527"
        },
        {
            "date": "2007-11-14T18:39:14+0000",
            "content": "> we should decide on how we're going to maintain gdata\n\nAre many folks using Lucene's gdata server?  If no one is using it, and it's not maintained, then it should probably be dropped from trunk.  If someone decides to start maintaining it later, then they could update it and re-add it to trunk. ",
            "author": "Doug Cutting",
            "id": "comment-12542536"
        },
        {
            "date": "2007-11-14T18:40:35+0000",
            "content": "The take2 patch works fine for me. Also this works fine:\nant -Djavadoc.access=private javadocs-core\nbut it generates two minor javadoc warnings.\n\nGrant:\nant javadocs generates everything combined and everything seperately,\nand ant javadocs-contrib works as expected.\n ",
            "author": "Paul Elschot",
            "id": "comment-12542537"
        },
        {
            "date": "2007-11-14T18:42:47+0000",
            "content": "the note about keeping the contrib list uptodate with the group list should also mention keeping the list in site.xml uptodate.\n\nwe could probably make that site.xml list autogenerated by the javadoc target, but that would require someone with ant fu and forrest fu thinking about it carefully ... in the meantime a reminder note would be handy. ",
            "author": "Hoss Man",
            "id": "comment-12542538"
        },
        {
            "date": "2007-11-14T18:50:12+0000",
            "content": "\nAre many folks using Lucene's gdata server? If no one is using it, and it's not maintained, then it should probably be dropped from trunk. If someone decides to start maintaining it later, then they could update it and re-add it to trunk.\n\n+1 ",
            "author": "Michael Busch",
            "id": "comment-12542542"
        },
        {
            "date": "2007-11-14T18:51:20+0000",
            "content": "\nThe take2 patch works fine for me.\n\nThanks for trying! I will commit then...\n\n\nthe note about keeping the contrib list uptodate with the group list should also mention keeping the list in site.xml uptodate.\n\nAgreed. I'll update the comment. ",
            "author": "Michael Busch",
            "id": "comment-12542543"
        },
        {
            "date": "2007-11-14T19:17:09+0000",
            "content": "Committed. ",
            "author": "Michael Busch",
            "id": "comment-12542551"
        },
        {
            "date": "2007-11-16T19:28:54+0000",
            "content": "OK, this should be up live on the site now.  I still have to check into why the site isn't being copied properly.  Will do when I get back from ApacheCon. ",
            "author": "Grant Ingersoll",
            "id": "comment-12543179"
        }
    ]
}