{
    "id": "LUCENE-1866",
    "title": "better RAT reporting",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/build"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "the \"ant rat-sources\" target currently only analyzes src/java ... we can do better then this.",
    "attachments": {
        "LUCENE-1866.patch": "https://issues.apache.org/jira/secure/attachment/12417923/LUCENE-1866.patch",
        "LUCENE-1866_step1.patch": "https://issues.apache.org/jira/secure/attachment/12521271/LUCENE-1866_step1.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-08-27T20:03:14+0000",
            "content": "per discussion on the user list, we should be looking at a RAT report for all the sources in the common case, and prior to a release we should sanity check exactly what is in the release.\n\npatch makes a start at this ... as mentioned on mail, the rat ant task has soem anoying limitations so i went back and forth between using it vs using <java> to run rat.Report directly.\n\nat the moment this works fine, but it's pissing me off that i can't find an obvious way to either just get a summary report (skipping all the heads of the files that don't have recognized licenses) or to have hte report go to a file and to the ant output (because when the report is really bad, all the important summary info scrolls out of hte terminal buffer unless it's configured really huge)\n\n\nI'm clearly really tired right now, so i'm going to drop this and let other people pick it up if they want. ",
            "author": "Hoss Man",
            "id": "comment-12748540"
        },
        {
            "date": "2011-01-28T16:03:59+0000",
            "content": "attached is a patch that moves the existing rat-sources task to common-build.\nIt runs over java and test sources, and works for both core/contribs/modules.\n\nSeparately I think its a good idea to also do what Hoss had in his original patch,\n(add a rat-dist or similar) which actually runs over the real artifacts... i think we \nshould add this target too.\n\nBut I'd like to commit this one as a start. ",
            "author": "Robert Muir",
            "id": "comment-12988124"
        },
        {
            "date": "2011-02-01T01:55:23+0000",
            "content": "I'd still like to improve this, but I think its good for a release,\nwe can run rat-sources everywhere (though its not some cool combined report).\n\nTo do this, you run rat-sources from lucene/, or from solr/ or from any contrib or module.\n\nI did this and raised comments etc about missing license headers.\n\nI think we should move the issue to 3.2 (In general i still like the idea of \nautomatically ratting the actual distribution, not just whats in SVN). ",
            "author": "Robert Muir",
            "id": "comment-12989001"
        },
        {
            "date": "2011-06-03T16:40:39+0000",
            "content": "bulk move 3.2 -> 3.3 ",
            "author": "Robert Muir",
            "id": "comment-13043538"
        },
        {
            "date": "2012-04-04T01:43:25+0000",
            "content": "Looking at this more, I'm tired of reviewing/fixing the licenses prior to release.\n\nI think the issue should be less of 'better rat reporting' and more of:\n\n\tconfigure rat with the proper accepted licenses so there are no false positives for e.g. BSD stuff.\n\tconfigure any really necessary exclusions (like there is an htmlStripTest.html that I'm sure is structured\n  the way it is for a reason for testing something)\n\tfix \"top-level\" stuff like lucene/solr/modules to, instead of failing confusingly because\n  they have no src/, instead recurse into all their submodules.\n\tonce everything is configured correctly: have hudson fail the build if files are missing any licenses,\n  we can grep the output file automatically to determine it passed with no problems.\n\n ",
            "author": "Robert Muir",
            "id": "comment-13245958"
        },
        {
            "date": "2012-04-04T02:55:05+0000",
            "content": "made some initial progress on the first step, e.g. adding custom matchers for\nwhen the detection fails and stuff...\n\nBut i only did lucene core+contrib so far. ",
            "author": "Robert Muir",
            "id": "comment-13245982"
        },
        {
            "date": "2012-04-04T04:48:38+0000",
            "content": "patch implementing all of the proposed steps for trunk. I also fixed any problems: its ready to be added to the hudson tasks.\n\nFirst I will commit and backport to 3.x ",
            "author": "Robert Muir",
            "id": "comment-13246023"
        },
        {
            "date": "2012-04-04T06:03:22+0000",
            "content": "Committed, backported, added task to hudson scripts.\n\n'ant rat-sources' from the top-level gives reports for the whole source tree (and same from lucene/solr/modules), and\nfails if there are any violations.\n\nhudson runs this as part of its scripts.\n\nI didnt put rat in .ant/lib because the rat jar uses some\ncommons libs (don't want to pollute the ant classpath which\nwe wrongly let slip into the compile classpath still i think).\n\nSo thats why the separate execution of ant -lib <rat_jar> rat-sources ",
            "author": "Robert Muir",
            "id": "comment-13246060"
        }
    ]
}