{
    "id": "LUCENE-2453",
    "title": "Make Index Output Buffer Size Configurable",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/store"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.2",
            "6.0"
        ],
        "affect_versions": "4.0,                                            4.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Currently, the buffered index input class allows sub-classes and users thereof to specify a size for the input buffer, which by default is 1024 bytes. In practice, this option is leveraged by the simple file and compound segment index input sub-classes. \n\nBy the same token, it would be nice if the buffered index output class could open up it's buffer size for users to configure. In particular, this would allow sub-classes thereof to align the output buffer size, which by default is 16348 bytes, to that of the underlying directory's data unit. For example, a network-based directory might want to buffer data in multiples of it's maximum transmission unit. To use an existing use-case, the file system-based directory could potentially choose to align it's output buffer size to the operating system's file block size.\n\nThe proposed change to the buffered index output class involves defining a one-arg constructor that takes a user-defined buffer size, and a default constructor that uses the currently defined buffer size.",
    "attachments": {
        "LUCENE-2453.patch": "https://issues.apache.org/jira/secure/attachment/12444357/LUCENE-2453.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-05-10T07:33:00+0000",
            "content": "Patch looks good ! Few comments:\n\n\tbuffer can still be final (and should) since it's only initialized in the ctor\n\tI'd inline checkBufferSize in the ctor\n\tI think that adding the same level of control to BufferedIndexInput would be useful too?\n\n\n\nIn general, I think the size of the buffer (1024) is set like that because larger buffer sizes did not improve the performance. Can you perhaps run on the benchmark indexing algorithms, w/ the buffer size set to larger values and report the results? It'd be interesting to note if there are any improvements before we open up the API like that. ",
            "author": "Shai Erera",
            "id": "comment-12865688"
        },
        {
            "date": "2010-05-12T23:07:31+0000",
            "content": "Hi Shai,\n\nTo answer your comments:\n\n\n\tbuffer can still be final (and should) since it's only initialized in the ctor\n\n\n\n[K] Agreed. It's not like we want to allow the size of the buffer to be changed once it has been instantiated.\n\n\n\tI'd inline checkBufferSize in the ctor\n\n\n\n[K] Done. Again, we only need to check the buffer size one time in the ctor.\n\n\n\tI think that adding the same level of control to BufferedIndexInput would be useful too?\n\n\n\n[K] Actually, the BufferedIndexInput already allows this level of control, and then some. In fact, I plagiarized the #checkBufferSize method from that class, where it is used twice, once in the ctor, and then again in the #setBufferSize method. In theory, we could allow the size of the BufferedIndexOutput's buffer to be reset as well, but in case the buffer is made smaller, we'll have to take care to flush some of the \"older\" bytes that no longer fit in the buffer. IMO, that was not worth the risk and hassle.\n\nI will update the patch momentarily based on the comments above, and keep you posted on the benchmark results.\n\nRegards,\nKarthick  ",
            "author": "Karthick Sankarachary",
            "id": "comment-12866780"
        },
        {
            "date": "2010-07-04T20:54:16+0000",
            "content": "Karthick, I'm interested in moving forward with this and LUCENE-2456. Could you perhaps prepare an updated patch that incorporates the comments above? ",
            "author": "Andrzej Bialecki",
            "id": "comment-12885081"
        },
        {
            "date": "2010-07-05T19:14:00+0000",
            "content": "Hi Andrzej, The patch has already been updated to incorporate the comments above. Please let me know if you need anything else. ",
            "author": "Karthick Sankarachary",
            "id": "comment-12885305"
        },
        {
            "date": "2010-07-24T07:16:52+0000",
            "content": "Hi Andrzej, The patch has already been updated to incorporate the comments above. Please let me know if you need anything else. \n\nKarthick , you should not delete old patches from the issue, as it makes it hard to follow the issue. Just upload the new patch with same filename and JIRA will automatically gray the old one out, but its still visible. ",
            "author": "Uwe Schindler",
            "id": "comment-12891946"
        },
        {
            "date": "2013-01-22T17:05:47+0000",
            "content": "bringing this up-to-date.... I think this is pretty useful for downstream apps though. I plan to commit this soon too. ",
            "author": "Simon Willnauer",
            "id": "comment-13559772"
        },
        {
            "date": "2013-01-23T08:44:12+0000",
            "content": "[trunk commit] Simon Willnauer\nhttp://svn.apache.org/viewvc?view=revision&revision=1437295\n\nLUCENE-2453: Make Index Output Buffer Size Configurable ",
            "author": "Commit Tag Bot",
            "id": "comment-13560487"
        },
        {
            "date": "2013-01-23T08:58:12+0000",
            "content": "[branch_4x commit] Simon Willnauer\nhttp://svn.apache.org/viewvc?view=revision&revision=1437304\n\nLUCENE-2453: Make Index Output Buffer Size Configurable ",
            "author": "Commit Tag Bot",
            "id": "comment-13560496"
        },
        {
            "date": "2013-01-23T10:20:12+0000",
            "content": "[branch_4x commit] Simon Willnauer\nhttp://svn.apache.org/viewvc?view=revision&revision=1437312\n\nLUCENE-2453: fix javadocs ",
            "author": "Commit Tag Bot",
            "id": "comment-13560538"
        },
        {
            "date": "2013-01-23T10:20:14+0000",
            "content": "[trunk commit] Simon Willnauer\nhttp://svn.apache.org/viewvc?view=revision&revision=1437311\n\nLUCENE-2453: fix javadocs ",
            "author": "Commit Tag Bot",
            "id": "comment-13560539"
        },
        {
            "date": "2013-05-10T10:33:47+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654029"
        }
    ]
}