{
    "id": "LUCENE-2358",
    "title": "rename KeywordMarkerTokenFilter",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "modules/analysis"
        ],
        "type": "Task",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I would like to rename KeywordMarkerTokenFilter to KeywordMarkerFilter.\nWe havent released it yet, so its a good time to keep the name brief and consistent.",
    "attachments": {
        "LUCENE-2358.patch": "https://issues.apache.org/jira/secure/attachment/12440283/LUCENE-2358.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-03-30T21:26:00+0000",
            "content": "attached is a patch (really svn move of KeywordMarkerTokenFilter and its test will be done) ",
            "author": "Robert Muir",
            "id": "comment-12851608"
        },
        {
            "date": "2010-03-30T23:11:28+0000",
            "content": "Hi Robert,\n\nI'm working on a change to ShingleFilter to not output \"_\" filler token unigrams (or generally, filler-only ngrams, to cover the case where position increment gaps exceed n).  \n\nI needed to be able to mark cached tokens as being filler tokens (or not) - a boolean attribute.  After trying to write a new private-use attribute and failing (I didn't make both an interface and an implementation, I think - I should figure it out and improve the docs I guess), I found KeywordAttribute and have used it to mark whether or not a cached token is a filler token (keyword:yes => filler-token:yes).\n\nWould it make sense to have a generalized boolean attribute, specialized for keywords or (fill-in-the-blank)?  It's a small leap to say that \"iskeyword\" means true for whatever boolean attribute you want to carry, so this isn't really a big deal, but I thought I'd bring it up while you're thinking about naming this thing.\n\n(This may be a can of worms: if there  is a generic boolean attribute, should there be generic string/int/float/etc. attributes too?)\n\nSteve ",
            "author": "Steve Rowe",
            "id": "comment-12851652"
        },
        {
            "date": "2010-03-30T23:33:16+0000",
            "content": "\nI needed to be able to mark cached tokens as being filler tokens (or not) - a boolean attribute. After trying to write a new private-use attribute and failing (I didn't make both an interface and an implementation, I think - I should figure it out and improve the docs I guess), I found KeywordAttribute and have used it to mark whether or not a cached token is a filler token (keyword:yes => filler-token:yes).\n\nI'm not really sure the KeywordAttribute is the best fit here, because its purpose is for the token \nto not be changed by some later filter. I'm not sure how your filter works (I would have to see the patch),\nbut I think using this attribute for this purpose could introduce some bugs?\n\nI guess the key is that its not a private-use attribute really, these things are visible by all tokenstreams.\nso stemmers etc will see your 'internal' attribute.\n\n\nWould it make sense to have a generalized boolean attribute, specialized for keywords or (fill-in-the-blank)? It's a small leap to say that \"iskeyword\" means true for whatever boolean attribute you want to carry, so this isn't really a big deal, but I thought I'd bring it up while you're thinking about naming this thing.\n\n(This may be a can of worms: if there is a generic boolean attribute, should there be generic string/int/float/etc. attributes too?)\n\nI don't really think so. Since there can only be one of any attribute in the tokenstream, you would have\nvarious TokenFilters clashing on how they interpret and use some generic boolean attribute! ",
            "author": "Robert Muir",
            "id": "comment-12851656"
        },
        {
            "date": "2010-03-30T23:44:56+0000",
            "content": "Sorry for cluttering this issue...\n\n\nI'm not really sure the KeywordAttribute is the best fit here, because its purpose is for the token\nto not be changed by some later filter. I'm not sure how your filter works (I would have to see the patch),\nbut I think using this attribute for this purpose could introduce some bugs?\n\nI guess the key is that its not a private-use attribute really, these things are visible by all tokenstreams.\nso stemmers etc will see your 'internal' attribute.\n\nYep, you're right, I hadn't thought it through that far.\n\n\nWould it make sense to have a generalized boolean attribute [...]?\n\nI don't really think so. Since there can only be one of any attribute in the tokenstream, you would have\nvarious TokenFilters clashing on how they interpret and use some generic boolean attribute!\n\nUm, yes, I should have realized that...\n\n(Re-writing private FillerTokenAttribute! Hooray!) ",
            "author": "Steve Rowe",
            "id": "comment-12851659"
        },
        {
            "date": "2010-04-11T09:15:41+0000",
            "content": "Committed revision 932856. ",
            "author": "Robert Muir",
            "id": "comment-12855696"
        },
        {
            "date": "2011-03-30T15:50:04+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013355"
        }
    ]
}