{
    "id": "LUCENE-4558",
    "title": "Make CompressingStoredFieldsFormat more flexible",
    "details": {
        "components": [],
        "fix_versions": [
            "4.1"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "My plan consists in making CompressionMode an abstract class instead of an enum and having different codec names per CompressionMode. I think this has two main benefits:\n\n\tit makes Lucene41StoredFieldsFormat cleaner (no need to write a CompressionMode id),\n\tit allows for custom CompressionModes.",
    "attachments": {
        "LUCENE-4558.patch": "https://issues.apache.org/jira/secure/attachment/12553526/LUCENE-4558.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-14T18:53:55+0000",
            "content": "Patch. ",
            "author": "Adrien Grand",
            "id": "comment-13497341"
        },
        {
            "date": "2012-11-15T00:13:56+0000",
            "content": "so the compression format byte is replaced by string you passed in the codec header... \n\n(sorry i havent fully thought about it and I'm not listing objections, just thinking to be careful) because:\n\n\tI see lucene41 stored fields impl puts a \"version inside the string\"\n\tcodec header name mismatch is a corruptindexexception\n\n\n\nAs I've said before, i dont like that we put versions \"inside the string\" even for Codec names.\nBut I think it was the right tradeoff to do: compare 4.1's format versus 4.0, its easier that they are separate codecs i think.\n\nWe just need to be really cautious whenever putting a version inside a string in general.\n\nAt some point in the future, Lucene40 and Lucene41 codec will be too old and we are going to need hacks\nto throw IndexFormatTooOldException and so on, so we are already in trouble today  ",
            "author": "Robert Muir",
            "id": "comment-13497622"
        },
        {
            "date": "2012-11-15T01:15:00+0000",
            "content": "so the compression format byte is replaced by string you passed in the codec header...\n\nRight: with this patch, a concrete CompressingStoredFieldsFormat must always use the same compression format. Compared to trunk, this means that if you want to change the compression format, you must either create a stored fields format with a different name or bump the version number. But we are still free to perform modifications that don't change the compression format, such as modifying the compression algorithm to spend more (less) time compressing in order to improve the compression ratio (speed).\n\nBut I think it was the right tradeoff to do: compare 4.1's format versus 4.0, its easier that they are separate codecs i think.\n\nAgreed. Having lots of if/then/else would have made the code less readable given how different these stored fields formats are.\n\nAt some point in the future, Lucene40 and Lucene41 codec will be too old and we are going to need hacks to throw IndexFormatTooOldException and so on, so we are already in trouble today\n\nWhy would we need hacks? Wouldn't it be sufficient to register Lucene40 and Lucene41 with a codec impl whose *writers would throw UnsupportedOperationException and *readers would throw IndexFormatTooOldException? (or is it a hack to you?)\n\nsorry i havent fully thought about it and I'm not listing objections, just thinking to be careful\n\nNo problem, I'm glad you did. This is the right time to think about backward compatibility... ",
            "author": "Adrien Grand",
            "id": "comment-13497676"
        },
        {
            "date": "2012-11-15T17:07:56+0000",
            "content": "\nWhy would we need hacks? Wouldn't it be sufficient to register Lucene40 and Lucene41 with a codec impl whose *writers would throw UnsupportedOperationException and *readers would throw IndexFormatTooOldException? (or is it a hack to you?)\n\nduh  Thats a great plan for handling the too-old exception on the codec side! ",
            "author": "Robert Muir",
            "id": "comment-13498141"
        },
        {
            "date": "2012-11-19T16:46:42+0000",
            "content": "Committed:\n\n\ttrunk r1411262 and r1411264\n\tbranch_4x r1411273\n\n ",
            "author": "Adrien Grand",
            "id": "comment-13500359"
        },
        {
            "date": "2013-03-22T16:16:35+0000",
            "content": "[branch_4x commit] Adrien Grand\nhttp://svn.apache.org/viewvc?view=revision&revision=1411273\n\nLUCENE-4558: Make CompressingStoredFieldsFormat more flexible (merged from r1411262 and r1411264).\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13610541"
        }
    ]
}