{
    "id": "LUCENE-2836",
    "title": "FieldCache rewrite method for MultiTermQueries",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "New Feature",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "For some MultiTermQueries, like RangeQuery we have a FieldCacheRangeFilter etc (in this case its particularly optimized).\n\nBut in the general case, since LUCENE-2784 we can now have a rewrite method to rewrite any MultiTermQuery \nusing the FieldCache, because MultiTermQuery's getEnum no longer takes IndexReader but Terms, and all the \nFilteredTermsEnums are now just real TermsEnum decorators.\n\nIn cases like low frequency queries this is actually slower (I think this has been shown for numeric ranges before too),\nbut for the really high-frequency cases like especially ugly wildcards, regexes, fuzzies, etc, this can be several times faster \nusing the FieldCache instead, since all the terms are in RAM and automaton can blast through them quicker.",
    "attachments": {
        "LUCENE-2836.patch": "https://issues.apache.org/jira/secure/attachment/12467027/LUCENE-2836.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-12-28T05:06:15+0000",
            "content": "here's the patch: I don't think we really need the *Wrapper class, nor does it need to be in core (this could be contrib or something instead).\n ",
            "author": "Robert Muir",
            "id": "comment-12975416"
        },
        {
            "date": "2010-12-28T05:44:14+0000",
            "content": "Here's some results from my silly wildcard benchmarker (I think luceneutil doesnt yet have a keyword title or similar field for this):\n\n(using 10M docs with single valued numeric field, so 10M terms too)\n\nin general its a stupid rewrite method, unless your users are typing in truly horrific queries and then its better.\n\n\n\n\nPattern\nno. matching docs\navgms (filter)\navgms (fieldcache)\n\n\nN?N?N?N\n1000\n35.9\n52.5\n\n\n?NNNNNN\n10\n3.1\n44.2\n\n\n??NNNNN\n100\n5.5\n45.6\n\n\n???NNNN\n1000\n44.7\n48.5\n\n\n????NNN\n10000\n141.8\n67.9\n\n\nNN??NNN\n100\n3.6\n41.5\n\n\nNN?N*\n10000\n5.3\n42.7\n\n\n?NN*\n100000\n25.9\n50.8\n\n\n*N\n1000000\n1639.2\n446.8\n\n\n*N*\n5217031\n2089.4\n701.2\n\n\n*NN*\n590040\n1811.6\n674.8\n\n\n\n ",
            "author": "Robert Muir",
            "id": "comment-12975421"
        },
        {
            "date": "2010-12-28T11:40:38+0000",
            "content": "Hah, cool!\n\nThe question is, does it really works correct with multivalued fields? I have to recapitulate the TermsIndex, but the method fcsi.getOrd(doc) returns only the term ord of the first term found in index for that document? For numeric queries with single-value fields thats fine, but for wildcards on analyzed fields? Maybe I miss something, but I am not sure if it works correct...\n\nRobert: Help me please  g ",
            "author": "Uwe Schindler",
            "id": "comment-12975477"
        },
        {
            "date": "2010-12-28T13:11:49+0000",
            "content": "The question is, does it really works correct with multivalued fields?\n\nof course not, its no different than any of the other fieldcache*filter stuff we have now.\nexcept that stuff is an aweful lot more code... do we really need all those specializations in fieldcacherangefilter? ",
            "author": "Robert Muir",
            "id": "comment-12975496"
        },
        {
            "date": "2011-01-03T11:43:50+0000",
            "content": "This is a great speedup for the hard wildcard queries!\n\nI think we should commit it, but jdoc the limitations (eg single valued).\n\nI'll add a \"whole title\" field to luceneutil so we can more naturally test wildcards... ",
            "author": "Michael McCandless",
            "id": "comment-12976707"
        },
        {
            "date": "2011-01-03T13:29:46+0000",
            "content": "OK, I'll work on getting it into contrib. \n\nI think its best to put it there because its generally slower (only faster in certain circumstances), \nand at the moment the app has to supply the 'query planning logic' to make good use of it. ",
            "author": "Robert Muir",
            "id": "comment-12976729"
        },
        {
            "date": "2011-01-04T15:24:04+0000",
            "content": "here's the patch for contrib... i think its ready to commit.\n\ni also added some basic testing of the seek() in the doctermsindex's termsenum. ",
            "author": "Robert Muir",
            "id": "comment-12977314"
        },
        {
            "date": "2011-01-04T18:23:18+0000",
            "content": "Committed revision 1055130. ",
            "author": "Robert Muir",
            "id": "comment-12977391"
        }
    ]
}