{
    "id": "LUCENE-2776",
    "title": "indexwriter creates unwanted termvector info",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.9.4",
            "3.0.3",
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "3.0.3",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I noticed today that when I build a big index in Solr, I get some unwanted termvector info, even though I didn't request any.\nThis does not happen on 3x - not sure when it started happening on trunk.",
    "attachments": {
        "TestWriter.java": "https://issues.apache.org/jira/secure/attachment/12460412/TestWriter.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-11-24T22:33:59+0000",
            "content": "Here's a test program that reproduces the issue.\n\nThis seems to have some relationship to shared docstores.  If you put an IW.commit() in the loop, you never see the issue.  It only seems to happen when the IW session is still open and a new segment is flushed.  Hence, if you raise the buffer size, you will also avoid the extra termvector info in this test. ",
            "author": "Yonik Seeley",
            "id": "comment-12935545"
        },
        {
            "date": "2010-11-25T09:29:51+0000",
            "content": "Hmmmm, I know why this is happening – I caused this when fixing intermittent test failures with LUCENE-2759.  Ugh.\n\nBut: do you see any end-user issue, eg exception?  Or it's \"just\" that IW is now creating files that it should not (which is a real issue that we need to fix).\n\nAnd in fact I see it happening even if you put IW.commit() in the loop and it happens in 3.x, 3.0.x and 2.9.x, as far as I can tell (I backported LUCENE-2759 there).\n ",
            "author": "Michael McCandless",
            "id": "comment-12935703"
        },
        {
            "date": "2010-11-26T04:25:53+0000",
            "content": "Nope - no end user exceptions - I just happened to notice that one of my test indexes was 10% bigger than I expected.\nw.r.t. 3x, that's certainly possible - the 3x Solr index I compared against was built 2 months ago. ",
            "author": "Yonik Seeley",
            "id": "comment-12935933"
        }
    ]
}