{
    "id": "LUCENE-1835",
    "title": "Signature changes in AttributeSource for better Generics support of AddAttribute/getAttribute",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Task",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "2.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The last update of Attribute API using AttributeImpl as implementation oif Attributes changed the API a little bit. This change leads to the fact, that in Java 1.5 using generics we are no longer able to add Attributes without casting. addAttribute and getAttribute should return the Attribute interface because the implementation of the attribute is not interesting to the caller. By that in 1.5 using generics, one could add a TermAttribute without casting using:\n\nTermAttribute termAtt = addAttribute(TermAttribute.class);\n\n\nThe signature to do this is:\n\npublic <T extends Attribute> T addAttribute(Class<T>)\n\n\n\nThe attached patch applies the mentioned change to the signature (without generic, only returning Attribute). No other code changes are needed, as current code always casts the result to the requested interface. I also added the 1.5 method signature for all these methods to the javadocs.\n\nAll tests pass.",
    "attachments": {
        "LUCENE-1835.patch": "https://issues.apache.org/jira/secure/attachment/12417238/LUCENE-1835.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-08-21T08:41:26+0000",
            "content": "Good catch! ",
            "author": "Michael Busch",
            "id": "comment-12745855"
        },
        {
            "date": "2009-08-21T08:54:32+0000",
            "content": "I forget to mention, AttributeImpl now always implements Attribute (which is an empty interface). addAttributeImpl was changed to ignore this empty interface when adding all interfaces to the Maps. By that it is possible to use AttributeImpl without casting to Attribute. ",
            "author": "Uwe Schindler",
            "id": "comment-12745860"
        },
        {
            "date": "2009-08-21T09:09:09+0000",
            "content": "Small update of the patch that fixes the generics declarations a little bit, that it realy would compile with 1.5 ",
            "author": "Uwe Schindler",
            "id": "comment-12745867"
        },
        {
            "date": "2009-08-21T12:12:06+0000",
            "content": "Committed revision: 806523 ",
            "author": "Uwe Schindler",
            "id": "comment-12745927"
        }
    ]
}