{
    "id": "LUCENE-1511",
    "title": "Improve Java packages (remove shared/split packages, refactore naming scheme)",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search",
            "modules/other"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "2.4",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "I recently prepared Lucene OSGi bundles for the Eclipse Orbit repository. During the preparation I discovered that some packages (eg. org.apache.lucene.search) are shared between different JARs, i.e. the package is in Lucene Core and in a contrib lib. While this is perfectly fine, it just makes OSGi packaging more complex and complexity also has a higher potential for errors. \n\nThus, my wish for a Lucene 3.0 would be to rename some packages. For example, all contribs/extensions could be moved into their own package namespace.\n\n\n(Apologize if this has been reported elsewhere. I did a search in JIRA but did not find a similar issue.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2009-01-05T16:24:15+0000",
            "content": "Perhaps this should have been brough up on java-dev first...\n\nHow does one deal with package private classes/methods then? ",
            "author": "Otis Gospodnetic",
            "id": "comment-12660808"
        },
        {
            "date": "2009-01-05T16:31:37+0000",
            "content": "Thanks for the mailing list remainder. The package private model does not work anymore. I didn't consider this because we have the notion of \"internal\" packages. Those packages are only exported to friends and contain public/protected classes/methods. The general rule is that their API is internal and clients may break if they depend on them even if the version only goes from 3.0.0 to 3.0.1. In some environments the dependency is strictly enforced and bundles won't resolve if they use internal API. ",
            "author": "Gunnar Wagenknecht",
            "id": "comment-12660810"
        },
        {
            "date": "2012-02-26T20:27:33+0000",
            "content": "Please reopen if you have a patch that does the package moves, and ensures that all tests pass. ",
            "author": "Steve Rowe",
            "id": "comment-13216824"
        }
    ]
}