{
    "id": "LUCENE-5512",
    "title": "Remove redundant typing (diamond operator) in trunk",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.8",
            "6.0"
        ]
    },
    "description": "",
    "attachments": {
        "LUCENE-5512.patch": "https://issues.apache.org/jira/secure/attachment/12633601/LUCENE-5512.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13925242",
            "author": "Furkan KAMACI",
            "content": "Currently I've found 1542 usage for it at trunk. I can work for this issue. ",
            "date": "2014-03-09T16:54:38+0000"
        },
        {
            "id": "comment-13925246",
            "author": "Robert Muir",
            "content": "There are way more than that. I don't recommend the use of automated tools (it sounds easy, but it doesnt take care of style, generated code, etc). ",
            "date": "2014-03-09T17:02:12+0000"
        },
        {
            "id": "comment-13925247",
            "author": "Furkan KAMACI",
            "content": "I'll not use an automated tool because of it is an important thing so we should be careful. ",
            "date": "2014-03-09T17:08:11+0000"
        },
        {
            "id": "comment-13925249",
            "author": "Erick Erickson",
            "content": "Sure hope the eventual (massive) check-in/merge works. Is there any merit in doing this in chunks that are more bite-sized? Perhaps making this an umbrella JIRA?\n\nI just worry that this is going to touch lots and lots and lots of files in the code base, inconveniencing people who are in the middle of some work.\n\nAnd I have to ask, what good is this doing us? Does it make any functional difference or is this simply esthetic? If the latter, then I suspect that doing this is going to cause some disruption to no good purpose. Reconciling any update issues for people who have significant outstanding chunks of code with changes may be \"interesting\". \n\nOr I may be imagining problems that don't actually exist. I guess under any circumstances since I'm not doing the work I don't really have much say... ",
            "date": "2014-03-09T17:13:46+0000"
        },
        {
            "id": "comment-13925250",
            "author": "Robert Muir",
            "content": "Furkan: i'll give you my patch if you want to take over?\n\nThe safest approach: make it a compile error in eclipse. ",
            "date": "2014-03-09T17:15:03+0000"
        },
        {
            "id": "comment-13925253",
            "author": "Robert Muir",
            "content": "Furkan: attached is my patch, i did some parts of the codebase. Happy to have you take over here! ",
            "date": "2014-03-09T17:16:50+0000"
        },
        {
            "id": "comment-13925258",
            "author": "Uwe Schindler",
            "content": "I think before backporting to 4.x, I would do the merge of the previous patches. Once the vote is over, I will start and backport as many as possible of the previous commits for Java 7. This includes reverting the \"quick fix\" commits to prevent compile issues in 4.x.\n\nMy personal opinion about the diamond operator is mixed: I don't see this as important. Much more important is migrating over the code to try-with resources and only use IOUtils at places where the open/close is not in the same code block. But this needs more careful review! ",
            "date": "2014-03-09T17:28:17+0000"
        },
        {
            "id": "comment-13925260",
            "author": "Robert Muir",
            "content": "But we don't need to wait on anything to clean up trunk. Its been on java7 for a long time. ",
            "date": "2014-03-09T17:30:56+0000"
        },
        {
            "id": "comment-13925292",
            "author": "Uwe Schindler",
            "content": "I was just referring to the backport of this. We should do this, once I backported the earlier stuff. I am already working on this (backporting smoketester, build files, initial FileChannel changes in NIO/MMapDir,...). I will open issue, once the vote succeeded and post patches and manage the backports. ",
            "date": "2014-03-09T19:11:32+0000"
        },
        {
            "id": "comment-13925325",
            "author": "Furkan KAMACI",
            "content": "When I finish it I will attach the patch file. ",
            "date": "2014-03-09T21:01:00+0000"
        },
        {
            "id": "comment-13925373",
            "author": "Furkan KAMACI",
            "content": "I've finished it. Compilation and tests did not give any error. I will check it one more time and attach the patch. On the other hand I will apply changes for \"lucene\" module. Will anybody open a Jira issue for Solr module too or I can apply same things for Solr module too?\n\nErick Erickson you are right. I've touched many many files in the code base. However I think that it will not cause any conflict (at least any real conflict) for anybody who is working on any issue. I think that the source code of Lucene became cleaner.\n\nRobert Muir if you want I can do same thing for \"try-with resources\" at another Jira issue? ",
            "date": "2014-03-10T00:56:21+0000"
        },
        {
            "id": "comment-13925378",
            "author": "Erick Erickson",
            "content": "Fire away. Personally the only thing I might have that requires some work is the whole Analytics thing that I've had hanging pending getting the test failures to stop. But that's almost entirely new code so I really don't anticipate much to do.\n\nAnd don't get me wrong, I think moving to Java 7 is a fine thing. I was somehow thinking that it would be inappropriate to do that before 5.0, but clearly I was wrong. As evidence I offer the enthusiasm with which moving to Java 7 for Solr/Lucene 4.8 has been received.\n\nI guess what I envision at this point is that those things that have been bugging people will get attention now that the Java 6 compatibility issue is being removed. And the whole try-with thing is significant IMO, I've been tripped up by this before; Uwe rescued me.\n\nThanks for putting the effort in here! ",
            "date": "2014-03-10T01:09:10+0000"
        },
        {
            "id": "comment-13925724",
            "author": "Robert Muir",
            "content": "\nI've finished it. Compilation and tests did not give any error. I will check it one more time and attach the patch. On the other hand I will apply changes for \"lucene\" module. Will anybody open a Jira issue for Solr module too or I can apply same things for Solr module too?\n\nYou can just supply one patch here. You can also separate it, if its easier on you. Either way.\n\n\nRobert Muir if you want I can do same thing for \"try-with resources\" at another Jira issue?\n\nYes, we should, that one is more complicated, but there are a lot of cleanups to be done. ",
            "date": "2014-03-10T13:18:23+0000"
        },
        {
            "id": "comment-13925730",
            "author": "Furkan KAMACI",
            "content": "I'm running tests for Lucene for last time. If all tests pass I will add patch. When I finish Solr part I will start to try-with resources. ",
            "date": "2014-03-10T13:28:15+0000"
        },
        {
            "id": "comment-13925746",
            "author": "Furkan KAMACI",
            "content": "Lucene part is OK. I will appy same procedure to the Solr module too. ",
            "date": "2014-03-10T14:02:14+0000"
        },
        {
            "id": "comment-13925900",
            "author": "Furkan KAMACI",
            "content": "Solr module is OK. I will test it and attach whole patch. ",
            "date": "2014-03-10T17:08:48+0000"
        },
        {
            "id": "comment-13930341",
            "author": "Furkan KAMACI",
            "content": "I've finished removing redundant typing for trunk. 1221 files has affected from my patch. I've done it for both Lucene and Solr modules. \n\nI didn't use any automated tools for it and I've changed even the commented codes to avoid confusion.\n\nAfter I finished removing redundant typing I have reviewed all my changes inside 1221 files and everything seems OK. Code is compiled successfully and all tests are passed.\n\nMy suggestion is that: if the voting ends up and result is OK to support Java 7 we should apply this patch into trunk as soon as possible. Because it includes many changes and it make Lucene/Solr code much more readable. On the other hand I don't think that it will cause conflict (at least any real conflict) for people who develops code right now.\n\nAll in all I could have a chance to check nearly all classes of project and it was really good for me. I've noted some issues about project noted some good tips for me when I was checking all the Lucene/Solr project.\n\nRobert Muir you can check the code and apply the patch if vote passes. ",
            "date": "2014-03-11T14:00:11+0000"
        },
        {
            "id": "comment-13931797",
            "author": "Robert Muir",
            "content": "Thanks Furkan, I merged the patch into trunk, i found a few missing ones (e.g. lucene/expressions, solr map-reduce contribs) but I fixed those up.\n\nI'll commit soon after I'm finished reviewing all the changes ",
            "date": "2014-03-12T14:10:23+0000"
        },
        {
            "id": "comment-13931813",
            "author": "Uwe Schindler",
            "content": "And now you can also backport to 4.x  ",
            "date": "2014-03-12T14:33:21+0000"
        },
        {
            "id": "comment-13931815",
            "author": "Furkan KAMACI",
            "content": "You're welcome. I know that reviewing takes a little time  I also planning to apply a patch for LUCENE-3538 whenever I have time. ",
            "date": "2014-03-12T14:33:45+0000"
        },
        {
            "id": "comment-13931822",
            "author": "ASF subversion and git services",
            "content": "Commit 1576755 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1576755 ]\n\nLUCENE-5512: remove redundant typing (diamond operator) in trunk ",
            "date": "2014-03-12T14:39:24+0000"
        },
        {
            "id": "comment-13931854",
            "author": "Uwe Schindler",
            "content": "Furkan KAMACI: backports should be done with svn merge and then committed. Unfortunately thats not easy to do for a non-committer. Otherwise it would be a separate patch, which is not ideal, because the merge information is lost. ",
            "date": "2014-03-12T15:07:09+0000"
        },
        {
            "id": "comment-13932101",
            "author": "Robert Muir",
            "content": "Thanks Furkan! ",
            "date": "2014-03-12T18:11:25+0000"
        },
        {
            "id": "comment-13932106",
            "author": "ASF subversion and git services",
            "content": "Commit 1576837 from Robert Muir in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1576837 ]\n\nLUCENE-5512: remove redundant typing (diamond operator) in trunk ",
            "date": "2014-03-12T18:14:11+0000"
        },
        {
            "id": "comment-13944170",
            "author": "ASF subversion and git services",
            "content": "Commit 1580271 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1580271 ]\n\nLUCENE-5512: remove redundant typing (diamond operator) ",
            "date": "2014-03-22T18:08:34+0000"
        },
        {
            "id": "comment-13944171",
            "author": "ASF subversion and git services",
            "content": "Commit 1580272 from Steve Rowe in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1580272 ]\n\nLUCENE-5512: remove redundant typing (diamond operator) ",
            "date": "2014-03-22T18:09:23+0000"
        },
        {
            "id": "comment-13982584",
            "author": "Uwe Schindler",
            "content": "Close issue after release of 4.8.0 ",
            "date": "2014-04-27T23:25:49+0000"
        }
    ]
}