{
    "id": "LUCENE-113",
    "title": "Caching problem with JSP:Search tag",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "1.2",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Hi all,\nI have been working on a few issues with the ability to crash the JSP:Search\ntag when no criteria have been submitted. With out imposing validation\nrestrictions on the tag itself I put in some more robust exception handling\nand put into place some fail safe logic that will abort the tag if there is\na problem. I added a new attribute called throwOnException=\"true|false\" so\nthat if you want to do debugging you can turn it on. Each line of lucene\ncode that throws exceptions looks like this.\n\ntry{\n    //volatile code here\n}catch(SomeException e)\n    if(throwOnException)\n{\n        throw new JspException(\"class name: \" + e);\n    }\n    abort = true;\n}\n\nif any of the code fails the tag expose the current variable state into the\nPAGE_SCOPE and exit. I am having a problem with caching. I am not sure if it\nis a problem with Tom Cat or the search engine. I hope you can give me some\nadvice.\n\nWhen I run the tag and pass it good criteria the tag responds with the\nresults as expected. When I hit the back button and submit an empty form\nfield the tag stops processing as expected but still shows the hitCount from\nthe previous query, ever there after I can not get the tag to produce\nresults from an criteria, the values from the previous run are cached. Is\nthis a Tom Cat setting or am I doing something wrong in the way I am\nprocessing the tag?\n\nI am posting the entire tag at the bottom of this email but if there is a\nbetter way to provide the example please let me know. I will also submit it\nas a bug report.\n\nBryan LaPlante",
    "attachments": {
        "ASF.LICENSE.NOT.GRANTED--lucene-taglib.zip": "https://issues.apache.org/jira/secure/attachment/12312240/ASF.LICENSE.NOT.GRANTED--lucene-taglib.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2003-05-21T02:21:39+0000",
            "content": "Created an attachment (id=6429)\ncurrent proposal to fix no-criteria crashing causing caching problem ",
            "author": "Bryan LaPlante",
            "id": "comment-12321311"
        },
        {
            "date": "2003-05-21T08:25:23+0000",
            "content": "I've committed the code you supplied.  Next time, please submit as a cvs diff -u format patch file. ",
            "author": "Erik Hatcher",
            "id": "comment-12321312"
        }
    ]
}