{
    "id": "LUCENE-7444",
    "title": "Remove English stopwords default from StandardAnalyzer in Lucene-Core",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "6.2",
        "components": [
            "core/other",
            "modules/analysis"
        ],
        "labels": "",
        "fix_versions": [
            "master (8.0)"
        ],
        "priority": "Major",
        "status": "Resolved",
        "type": "Task"
    },
    "description": "Yonik said on LUCENE-7318:\n\n\nI think it would make a good default for most Lucene users, and we should graduate it from the analyzers module into core, and make it the default for IndexWriter.\n\nThis \"StandardAnalyzer\" is specific to English, as it removes English stopwords.\nThat seems to be an odd choice now for a few reasons:\n\n\tIt was argued in the past (rather vehemently) that Solr should not prefer english in it's default \"text\" field\n\tAFAIK, removing stopwords is no longer considered best practice.\n\n\n\nGiven that removal of english stopwords is the only thing that really makes this analyzer english-centric (and given the negative impact that can have on other languages), it seems like the stopword filter should be removed from StandardAnalyzer.\n\nWhen trying to fix the backwards incompatibility issues in LUCENE-7318, it looks like most unrelated code moved from analysis module to core (and changing package names!!!!  ) was related to word list loading, CharArraySets, and superclasses of StopFilter. If we follow Yonik's suggestion, we can revert all those changes. I agree with hin, an \"universal\" analyzer should not have any language specific stop-words.\n\nThe other thing is LowercaseFilter, but I'd suggest to simply add a clone of it to Lucene core and leave the analysis-module self-contained.",
    "attachments": {
        "LUCENE-7444.patch": "https://issues.apache.org/jira/secure/attachment/12927628/LUCENE-7444.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15481447",
            "author": "Uwe Schindler",
            "date": "2016-09-11T09:45:42+0000",
            "content": "We should also remove StandardFilter which is a no-op! "
        },
        {
            "id": "comment-15481829",
            "author": "Yonik Seeley",
            "date": "2016-09-11T14:22:35+0000",
            "content": "+1 "
        },
        {
            "id": "comment-15482066",
            "author": "Michael McCandless",
            "date": "2016-09-11T17:08:50+0000",
            "content": "+1 to not applying stop words by default with our default analyzer (StandardAnalyzer).  I agree a secret English bias is no good.\n\nBut, replying to Uwe from LUCENE-7318:\n\nPeople that want to have stopwords can always define their own Analyzer using CustomAnalyzer.\n\nSorry, this is completely non-obvious to new users.\n\nSure, Uwe Schindler and perhaps 2 other people in the world would consider this the obvious way to add stop word filtering to Lucene.\n\nBut for everyone else, we must keep a simple core API (StandardAnalyzer ctor) taking an optional stop words set in core.\n\nI wouldn't mind paring that API down, e.g. to Set<String> or CharArraySet passed to StandardAnalyzer.  This would let us move the word list loaders back out to the analyzers module?\n\nRegardless of how you feel personally about whether stop words should be used in a search engine, many users legitimately fall on both sides of the camp. "
        },
        {
            "id": "comment-15482747",
            "author": "David Smiley",
            "date": "2016-09-12T01:37:03+0000",
            "content": "Good to see there seems to be general agreement.\n\nBut for everyone else, we must keep a simple core API (StandardAnalyzer ctor) taking an optional stop words set in core.\n\n+1 sounds good to me. "
        },
        {
            "id": "comment-15846935",
            "author": "Alan Woodward",
            "date": "2017-01-31T15:05:23+0000",
            "content": "All tests pass if I apply the following to master:\n\ndiff --git a/lucene/core/src/java/org/apache/lucene/analysis/standard/StandardAnalyzer.java b/lucene/core/src/java/org/apache/lucene/analysis/standard/StandardAnalyzer.java\nindex fb57573..321cb8e 100644\n--- a/lucene/core/src/java/org/apache/lucene/analysis/standard/StandardAnalyzer.java\n+++ b/lucene/core/src/java/org/apache/lucene/analysis/standard/StandardAnalyzer.java\n@@ -70,7 +70,7 @@ public final class StandardAnalyzer extends StopwordAnalyzerBase {\n   /** Builds an analyzer with the default stop words ({@link #STOP_WORDS_SET}).\n    */\n   public StandardAnalyzer() {\n-    this(STOP_WORDS_SET);\n+    this(CharArraySet.EMPTY_SET);\n   }\n\n   /** Builds an analyzer with the stop words from the given reader.\n\n\n\nI guess this should be a master-only change?  Plus appropriate javadocs and CHANGES mods as well. "
        },
        {
            "id": "comment-16510061",
            "author": "Uwe Schindler",
            "date": "2018-06-12T19:16:33+0000",
            "content": "+1 that's an easy change! "
        },
        {
            "id": "comment-16510124",
            "author": "Michael McCandless",
            "date": "2018-06-12T20:07:28+0000",
            "content": "+1 to that patch. "
        },
        {
            "id": "comment-16510936",
            "author": "Alan Woodward",
            "date": "2018-06-13T10:37:49+0000",
            "content": "Patch including docs changes.\n\nAs a follow-up, I think we should move StopwordAnalyzerBase back into the analysis module, and remove StandardAnalyzer's Reader constructors.  I'll open a separate issue for that. "
        },
        {
            "id": "comment-16510955",
            "author": "ASF subversion and git services",
            "date": "2018-06-13T11:08:26+0000",
            "content": "Commit 5ae716c412d705570b2dafd423755eb58142212e in lucene-solr's branch refs/heads/master from Alan Woodward\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5ae716c ]\n\nLUCENE-7444: StandardAnalyzer not longer uses english stopwords by default "
        },
        {
            "id": "comment-16511052",
            "author": "Adrien Grand",
            "date": "2018-06-13T12:36:57+0000",
            "content": "Should we move the set of english stop words from StandardAnalyzer to EnglishAnalyzer as a follow-up, similarly to the french and german analyzers? "
        },
        {
            "id": "comment-16511054",
            "author": "Alan Woodward",
            "date": "2018-06-13T12:39:22+0000",
            "content": "Yes, I'll do that as part of the StopwordAnalyzerBase changes "
        }
    ]
}