{
    "id": "LUCENE-4681",
    "title": "more artifact inconsistencies",
    "details": {
        "components": [
            "general/build"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Currently the tasks for releasing can easily create artifacts that are inconsistent with each other:\n\n\tthe source releases (package-tgz-src) targets trigger an svn checkout to ensure the source release has no local modifications or extra files (even svn:ignore'd).\n\tthe binary releases (and maven source/javadoc/binary artifacts too?) unfortunately are not built from this source release, which can differ than the local version.\n\tusers who want to make their own release have to run special source targets (package-local-src-tgz) to make source tgs built from their actual checkout.\n\n\n\nI think this can be safer and simpler.\n\nInstead of these special source targets: imagine a prepare-release and a prepare-release-local (or swap it around and have prepare-official-release and prepare-release, i actually like that better, but it doesnt matter).\n\nprepare-official-release would just do an svn:checkout and subant \"prepare-release\" from that checkout.\n\nthis way we know all artifacts are from the same consistent source.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-01-11T18:16:43+0000",
            "content": "+1 ",
            "author": "Steve Rowe",
            "id": "comment-13551339"
        },
        {
            "date": "2013-01-11T19:03:13+0000",
            "content": "I don't think we have to fix this one for 4.1: if the RM is careful there will be no problem\n\nThis is just one of those things to do eventually to make the process less fragile. ",
            "author": "Robert Muir",
            "id": "comment-13551404"
        }
    ]
}