{
    "id": "LUCENE-101",
    "title": "Selecting a language-specific analyzer according to a locale.",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Moved from todo.xml:\n\nNow we rewrite parts of Lucene code in order to use another analyzer. It will \nbe useful to select analyzer without touching code.\n\nThis was orginally request by Kazuhiro Kazama (kazama@ingrid.org) in\n\nhttp://nagoya.apache.org/eyebrowse/ReadMsg?listName=lucene-\ndev@jakarta.apache.org&msgId=338928\n\nNot sure if this was completed to Kazuhiro Kazama's satisfaction in the current \nCVS. We can certainly choose which analyzer to use for a given IndexWriter and \nQueryParser it sounded like he was asking for something like a factory the \nwould create an analyzer based on a locale but unless I don't understand things \nquite right, searching an index with any analyzer that you didn't create the \nindex with is bound to cause you to have false hits in your results.\n\nPerhaps this is fixed or no action should be taken. Can someone with a better \nunderstanding of the request comment on this one or close it out?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2006-06-16T04:34:30+0000",
            "content": "The URL from the original report doesn't work anymore, I think it refers to this post:\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-java-dev/200205.mbox/<20020522.153124.14421363.kazama%40ingrid.org>\n\nI guess this report can be closed? ",
            "author": "Daniel Naber",
            "id": "comment-12416410"
        },
        {
            "date": "2006-07-18T21:45:32+0000",
            "content": "Closing, the code changes the original report talks about don't seem to be needed anymore today. ",
            "author": "Daniel Naber",
            "id": "comment-12421976"
        }
    ]
}