{
    "id": "LUCENE-2707",
    "title": "NumericField throws a NotSerializableException when it is serialized, even though it implements Serializable",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.9.3,                                            3.0.2",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "NumericField extends from AbstractField, which implements Serializable.\n\nNumericField cannot be serialized because it stores the precisionStep in the underlying NumericTokenStream, which is not serializable.  The NumericTokenStream should either be made serializable, or made transient in NumericField, and the precisionStep should be stored directly in NumericField, and recreated on deserialization.\n\nNot entirely related, but the real reason I found this bug was because Field and NumericField are not cloneable and there is no way to make a copy manually, since there is no getter method for precisionStep on NumericField, so I thought I was going to be clever and do a \"poor man's clone\" by serializing/deserializing a NumericField.  No such luck.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-02-10T08:03:55+0000",
            "content": "This bug affects Hibernate Search as well:\n\nhttp://opensource.atlassian.com/projects/hibernate/browse/HSEARCH-681 ",
            "author": "Katrin E.",
            "id": "comment-12992924"
        },
        {
            "date": "2011-02-10T10:47:08+0000",
            "content": "In Lucene trunk (coming version 4.0) we removed support for Serialization in Lucene entirely: LUCENE-2908\n\nSo there is no need to fix this, as it was never working correctly and lead to very stupid problems. Remote Search was broken and was also removed in Lucene trunk.\n\nI keep this open an will supply a patch to add the missing getter methods, which are indeed missing (also for NumericRangeQuery). ",
            "author": "Uwe Schindler",
            "id": "comment-12992990"
        },
        {
            "date": "2011-02-10T10:52:29+0000",
            "content": "Serialization support was removed in Lucene trunk. ",
            "author": "Uwe Schindler",
            "id": "comment-12992993"
        }
    ]
}