{
    "id": "LUCENE-4008",
    "title": "Use Java Markdown provided by Ivy to transform BUILD.txt, MIGRATE.txt,.. to simple (better readable) HTML and place under documentation.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The MIGRATE.txt and other files are very simple formatted and can be converted using Markdown.\n\nWe can use e.g. pegdown (a Java Markdown converter) to make HTML out of them and place those in the HTML documentation. Theoretically, also CHANGES.txt might be processed by Markdown, we have to try out. Pegdown is extensible, so it could handle LUCENE-xxx JIRA links correctly.",
    "attachments": {
        "LUCENE-4008.patch": "https://issues.apache.org/jira/secure/attachment/12523689/LUCENE-4008.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-22T00:19:10+0000",
            "content": "Pegdown: https://github.com/sirthias/pegdown ",
            "author": "Uwe Schindler",
            "id": "comment-13258972"
        },
        {
            "date": "2012-04-22T15:46:30+0000",
            "content": "Attached a first patch to demonstate the idea. The patch adds a new <pegdown/> macro to common-build.xml that can convert any TXT file to a HTML representation (if the syntax is fine). It has some hacks:\n\n\tIt uses the first line of the TXT file as HTML page title\n\tIt converts the first line to a first level heading\n\tIt rewrites LUCENE-xxx/SOLR-xxx identifiers to Markdown Links to JIRA\n\n\n\nThe patch converts a few files (including CHANGES.txt!!!) to HTML using that macro and places them in build/docs, no linking at the moment.\n\nIt is visile that the files look not too bad, with some tweaking and using Markdown syntax, we can make them look nice! ",
            "author": "Uwe Schindler",
            "id": "comment-13259157"
        },
        {
            "date": "2012-04-22T16:05:57+0000",
            "content": "More compact patch and invocation using todir=\"\" and nested filesets. ",
            "author": "Uwe Schindler",
            "id": "comment-13259161"
        },
        {
            "date": "2012-04-22T16:38:12+0000",
            "content": "I offered to also include CHANGES.txt as markdown interpreted (to show that it looks not too bad).\n\nHere new patch, also converting CHANGES.txt to the documentation directory. Also made the pegdown macro be more verbose and allow flatten. ",
            "author": "Uwe Schindler",
            "id": "comment-13259172"
        },
        {
            "date": "2012-04-22T17:50:53+0000",
            "content": "Small improvements in the macro/javascript:\n\n\tUse StringBuffer, so handling the large CHANGES.txt is more effective\n\tOnly convert markdown if target file is older than source (default <copy/> behaviour (I had the overwrite setting enabled to debug better).\n\tRemove useless import\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-13259197"
        },
        {
            "date": "2012-04-22T19:40:39+0000",
            "content": "+1, i think we should just commit this (excluding CHANGES.txt for now, as changes2html looks nicer).\n\nI can help with the files (adding markers for headings/bullets) so they look nice, and linking them\ninto the index.html docs. \n\nawesome idea! ",
            "author": "Robert Muir",
            "id": "comment-13259224"
        },
        {
            "date": "2012-04-22T21:14:02+0000",
            "content": "Attached the latest patch with MIGRATE.txt already converted:\n\n\n\tMIGRATE.txt was migrated to pegdown, was very easy. There are only few things to take care: Code must be indented by TAB or four spaces, Secrion headers start with #, ##, or ###. Lists start with * or -\n\tBUILD.txt was not touched or added, as you dont need build instructions anymore once you have the full documentation\n\tREADME.txt was minimalized and only points to the HTML docu.\n\n\n\nWe still need a system requirements page. Ideally as markdown, too.\n\nI will commit that now as a start. ",
            "author": "Uwe Schindler",
            "id": "comment-13259260"
        },
        {
            "date": "2012-04-22T21:15:45+0000",
            "content": "Committed trunk revision: 1328978 ",
            "author": "Uwe Schindler",
            "id": "comment-13259262"
        }
    ]
}