{
    "id": "LUCENE-5903",
    "title": "Fix MockDirectoryWrapper double-write logic?",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "From a jenkins failure: \n\n\nI think its a bug, and this was just exposed by randomization of\ncommitOnClose in IndexWriterConfig?\n\nwe start a CMS merge for _8 segment (consumer creates _8.fdt and\n_8.fdx), but this merge doesn't make it into the commit, and we\nclose() without waiting for merges.\nthis merge is aborted and indexfiledeleter cleans up _8.fdt and _8.fdx\n\nwe start a new IW on the same dir, and the next segment it tries to\ncreate is _8 (how else would it know?) which trips the double-write\nlogic in createOutput.\nThis logic currently only checks files that we ever created, and\ndoesn't check if we ever deleted the file.\nWe can fix mockdirectorywrapper, but I feel like this could be a real\nproblem on e.g. windows if the file was busy for both IFD runs.",
    "attachments": {
        "LUCENE-5903_test.patch": "https://issues.apache.org/jira/secure/attachment/12663967/LUCENE-5903_test.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14108431",
            "author": "Robert Muir",
            "content": "Here is a (slow) but reproducible test. It just stalls the CMS merge thread with a ratelimiter to force the abort. ",
            "date": "2014-08-24T15:41:54+0000"
        },
        {
            "id": "comment-14108432",
            "author": "Robert Muir",
            "content": "I think its too hard to improve the situation for windows, its unavoidable really. The best we could probably do is gobble up extra generations on IW bootup to try to make it less likely.\n\nAs far as fixing MDW to allow for the situation (recording deleted files and checking that map), it would be nice if somehow it would only \"allow\" this across IW instances, but not within the same one. ",
            "date": "2014-08-24T15:52:07+0000"
        }
    ]
}