{
    "id": "LUCENE-6138",
    "title": "ItalianLightStemmer doesn't apply on words shorter then 6 chars in length",
    "details": {
        "resolution": "Won't Fix",
        "affect_versions": "4.10.2",
        "components": [
            "modules/analysis"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Minor",
        "status": "Resolved",
        "type": "Bug"
    },
    "description": "I expect a stemmer to transform nouns in their singular and plural forms into a shorter common form. The implementation of the ItalianLightStemmer doesn't apply any stemming to words shorter then 6 characters in length. This leads to some annoying results:\n\nsingular form | plural form\n4|5 chars in length (no stemming)\nalga -> alga | alghe -> alghe\nfuga -> fuga | fughe -> fughe\nlega -> lega | leghe -> leghe\n5|6 chars in length (stemming only on plural form)\nvanga -> vanga | vanghe -> vang\nverga -> verga | verghe -> verg\n\nI suppose that such limitation on words length is to avoid other side effects on shorter words not in the set above, but I think something must be reviewed in the code for better results.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14258906",
            "author": "Erick Erickson",
            "date": "2014-12-26T02:45:06+0000",
            "content": "I think the discussion at LUCENE-6137 applies here. "
        },
        {
            "id": "comment-14259655",
            "author": "Massimo Pasquini",
            "date": "2014-12-28T15:23:44+0000",
            "content": "The issue you pointed out is related to a different stemmer for Russian language. I see no connection to the Italian light stemmer. According to the rules of the Italian grammar, I think the bug I found can be fixed (it possibly cannot be done in the Russian stemmer according to what I've read on the other post).\n\nSo I suppose the ItalianLightStemmer can evolve to a better implementation: it is possible to find some simple rules on words suffixes in order to make a decision about applying the stemming on short words (shorter then 6 characters).\n\nNotice my thoughts are not based on a deep and accurate study of the problem though. But I think it could be worth to investigate about it. I may suggest to submit this issue to the author of the code and see if he got a better solution (I saw he's in the field of computational linguistics). According to the notes in the source, the algorithm was written in 2005 as the result of some experiments. We don't know if they've put further efforts in investigating the problem and they possibly wrote a best algorithm they agree to publish according to Lucene's license.\n\nI don't expect the stemmer to be 100% successful, but the issue I pointed out affects an important range on words. "
        },
        {
            "id": "comment-14259684",
            "author": "Erick Erickson",
            "date": "2014-12-28T17:52:08+0000",
            "content": "Right, the important part of the discussion (I should have pointed it out) was that the stemmers are not part of the Solr code base, they're another project and that project would be the place to raise possible bugs or submit patches, \n\nbq: Can you propose your changes to http://members.unine.ch/jacques.savoy/clef/index.html?\n\nSorry for the confusion\n "
        },
        {
            "id": "comment-14261227",
            "author": "Massimo Pasquini",
            "date": "2014-12-30T16:37:05+0000",
            "content": "Could you please give me the link to the right place to post issues about the stemmers? I cannot find any link to the project. Thanks "
        },
        {
            "id": "comment-14261242",
            "author": "Robert Muir",
            "date": "2014-12-30T16:54:15+0000",
            "content": "One nice thing about the porter stemmer is that it does some basic syllable counting instead of using arbitrary limits of characters like the light stemmers do. This is more complicated than checking a limit, but probably the best solution for this problem. Its probably easier to implement this logic with the snowball language itself (for this language, the logic already exists there), but could be done in java too. However these kind of changes need real evaluation work too. Currently we don't invent these light stemmers, we just use other people's work.\n "
        },
        {
            "id": "comment-14261247",
            "author": "Erick Erickson",
            "date": "2014-12-30T16:59:15+0000",
            "content": "Unfortunately I don't quite know, I've used the stemmers \"as is\".\n\nSorry I can't help...  "
        },
        {
            "id": "comment-14261470",
            "author": "Massimo Pasquini",
            "date": "2014-12-30T20:38:20+0000",
            "content": "I got the point about \"it's not your work\", after all this is the good thing about open source software. I also definitely agree your second point \"these kind of changes need real evaluation work too\": that's exactly what I was thinking before opening this issue. \nI think I will try to fix the ItalianLightStemmer myself and see what the results will be, but considering the wide range of test necessary in this specific domain, it will take a while before I could find enough time to try to fix it.\nAbout this issue, I suppose it may be closed as \"won't fix\" then. "
        },
        {
            "id": "comment-14261512",
            "author": "Erick Erickson",
            "date": "2014-12-30T21:24:42+0000",
            "content": "Massimo:\n\nAppreciate your understanding here. It's always difficult to figure out what to be responsible for and what not...\n\nClosing as per your comment... "
        }
    ]
}