{
    "id": "LUCENE-5631",
    "title": "Improve access to archived versions of Lucene and Solr",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved",
        "components": [
            "general/website"
        ],
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": []
    },
    "description": "When visiting the website to download Lucene or Solr, it is very difficult for people to locate where to download previous versions.  The archive link does show up when you click the download link, but the page where it lives is replaced in less than a second by the CGI for picking a download mirror for the current release.  There's nothing there for previous versions.\n\nAt a minimum, we need a link to the download archive that's right below the main Download link.  Something else I think we should do (which might actually be an INFRA issue, as this problem exists for other projects too) would be to have the \"closer.cgi\" page include a link to the archives.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13983280",
            "author": "Steve Rowe",
            "content": "The project has taken several steps in the opposite direction, intentionally making it harder to access releases (and docs) for older versions, to encourage people to choose the most recent version.   ",
            "date": "2014-04-28T17:45:08+0000"
        },
        {
            "id": "comment-13983291",
            "author": "Shawn Heisey",
            "content": "I asked on #asfinfra whether a general solution with the mirror CGI would be a good idea.\n\n\n11:39 <@gmcdonald> I do not think download.cgi is the place to put an archives\n                   link no\n\n\n\n\n11:41 <@gmcdonald> elyograg: elsewhere on your website you should link to\n                   downloads.cgi or the archives. The download.cgi picks a\n                   mirror, archives do not live on mirrors, change your way of\n                   thinking is my reply. If you insist on following up, talk to\n                   the site-dev@ list instead of an INFRA ticket.\n\n\n\nI will follow up with the site-dev list to see if they have any interest in a general solution.  Regardless of what happens there, I do think we need to improve our own project pages.  When I have a moment, I will pull the site down from svn and see if I can cook up a patch. ",
            "date": "2014-04-28T17:50:27+0000"
        },
        {
            "id": "comment-13983338",
            "author": "Hoss Man",
            "content": "I'm not really understanidng this issue.\n\nIn the right nav of the site, are links that are very explicitly about downloading the latest release.  These load pages that do an auto-redirect, but as a convenience also include some static text for people that might not use javascript.\n\nThis doesn't change the fact that we also already have a main \"Download\" page that also links to those download redirectors, and has details about archived releases...\n\nhttps://lucene.apache.org/core/downloads.html\nhttps://lucene.apache.org/solr/downloads.html\n\nBoth of these links are prominent in the top nav of the main pages for Lucene-Core & Solr, just to the right of the \"news\" tabs...\n\nhttps://lucene.apache.org/core/\nhttps://lucene.apache.org/solr/ ",
            "date": "2014-04-28T18:09:33+0000"
        },
        {
            "id": "comment-13983405",
            "author": "Shawn Heisey",
            "content": "\nhttps://lucene.apache.org/core/downloads.html\nhttps://lucene.apache.org/solr/downloads.html\n\nBoth of these links are prominent in the top nav of the main pages for Lucene-Core & Solr, just to the right of the \"news\" tabs...\n\nThis is not the first time I've been completely blind.  I did not notice those links.  Apparently I'm not the only one, though.  I've seen the question come up in the IRC channel regularly.  Now that they've been pointed out, I can guide people in the right direction much easier than providing a link or telling them that they just have to click fast. \n\nThe project has taken several steps in the opposite direction, intentionally making it harder to access releases (and docs) for older versions, to encourage people to choose the most recent version. \n\nThis is understandable, but people who are explicitly looking for an older version are asking about it.  Hoss has pointed out where to go.  I thought those links weren't there, and it turns out that it was me, not the website. ",
            "date": "2014-04-28T19:10:15+0000"
        }
    ]
}