{
    "id": "LUCENE-5246",
    "title": "SegmentInfoPerCommit continues to list unneeded updatesFiles",
    "details": {
        "components": [
            "core/index"
        ],
        "fix_versions": [
            "4.6",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "SegmentInfoPerCommit continues to list updates files even if they are unneeded anymore. For example, if you update the values of documents of field 'f', it creates a gen'd .fnm (FieldInfos) file. If you commit/reopen and update the field again (maybe now a different set of documents), it creates another gen'd .fnm, but continues to list both gens, even though only the latest one is needed.\n\nTo solve this, SIPC would need to know then dvGen of each FieldInfo, so that it can correctly list only the updates files that are truly needed. I'll work on a testcase and fix.",
    "attachments": {
        "LUCENE-5246.patch": "https://issues.apache.org/jira/secure/attachment/12605786/LUCENE-5246.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-09-29T12:51:43+0000",
            "content": "Patch fixes SIPC to only track the files that are used by the different generations, determined by fieldInfosGen. Also added testDeleteUnusedUpdatesFiles - it's kind of hacky as it asserts on _0_1.fnm, e.g. won't work if we'll ever have a Codec which writes FieldInfos to a custom-named files. If you have a better idea how to assert that the unused updates files were deleted, let me know and I'll change the test accordingly.\n\nI also relaxed testStressMultithreading by allocating between 3-6 update threads as well as extracted the commit logic out to a separate thread. Also limited the number of updates to 20-100 (instead of atLeast(40) which could reach 200+ with certain test parameters). ",
            "author": "Shai Erera",
            "id": "comment-13781356"
        },
        {
            "date": "2013-09-29T13:40:16+0000",
            "content": "Wow, this is a good catch; I'm glad the test uncovered this!\n\nThis was a \"file\" leak right?  In that files that are never actually\nopened will remain in the index, so that over time if you keep\napplying dv updates and reopening, you'd get a forever increasing\nnumber of files in the index.\n\nCan we only partially neuter the test (it's obviously good!)?\nE.g. maybe we can change numThreadUpdates to be an atLeast so that\nmultiplier makes the test run for more iterations?  Also, I prefer\nthat each thread does its own committing; it's more evil.  Using a\nseparate thread that sleeps for 50 msec each time it's not clear how\nmany commits will actually happen.\n\nCan we fix SIPC.getUpdatesFiles to return an unmodifiableMap?  And then\nfix RALD to not add into the map like it does now?\n\nAlso don't forget to email people to re-index trunk indices after\ncommitting this... ",
            "author": "Michael McCandless",
            "id": "comment-13781374"
        },
        {
            "date": "2013-09-29T14:16:25+0000",
            "content": "Thanks for the comments Mike. I modified the test to do atLeast(100) on a global numUpdates counter, so that all threads do as many updates as the nightly test params say. Also, every thread commits on average every 20 updates and reopens every 10.\n\nIt's a good idea about SIPC.getUpdatesFiles – changed to return unmodifiable map.\n\nI gave luceneutil 400 iters on that test and it was happy. I think it's ready to commit. ",
            "author": "Shai Erera",
            "id": "comment-13781387"
        },
        {
            "date": "2013-09-29T17:37:03+0000",
            "content": "Commit 1527361 from Shai Erera in branch 'dev/trunk'\n[ https://svn.apache.org/r1527361 ]\n\nLUCENE-5246: SegmentInfoPerCommit continues to list unneeded updatesFiles ",
            "author": "ASF subversion and git services",
            "id": "comment-13781453"
        },
        {
            "date": "2013-09-29T17:38:15+0000",
            "content": "Committed this to trunk. Keeping open until the backport to 4x. ",
            "author": "Shai Erera",
            "id": "comment-13781455"
        },
        {
            "date": "2013-09-30T06:39:54+0000",
            "content": "Commit 1527460 from Shai Erera in branch 'dev/trunk'\n[ https://svn.apache.org/r1527460 ]\n\nLUCENE-5246: improve test to be more generic ",
            "author": "ASF subversion and git services",
            "id": "comment-13781627"
        },
        {
            "date": "2013-11-14T16:04:24+0000",
            "content": "Committed to 4x under LUCENE-5189. ",
            "author": "Shai Erera",
            "id": "comment-13822545"
        }
    ]
}