{
    "id": "LUCENE-5317",
    "title": "Concordance/Key Word In Context (KWIC) capability",
    "details": {
        "components": [
            "core/search"
        ],
        "fix_versions": [],
        "affect_versions": "4.5",
        "priority": "Major",
        "labels": "",
        "type": "New Feature",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This patch enables a Lucene-powered concordance search capability.\n\nConcordances are extremely useful for linguists, lawyers and other analysts performing analytic search vs. traditional snippeting/document retrieval tasks.  By \"analytic search,\" I mean that the user wants to browse every time a term appears (or at least the topn)  in a subset of documents and see the words before and after.  \n\nConcordance technology is far simpler and less interesting than IR relevance models/methods, but it can be extremely useful for some use cases.\n\nTraditional concordance sort orders are available (sort on words before the target, words after, target then words before and target then words after).\n\nUnder the hood, this is running SpanQuery's getSpans() and reanalyzing to obtain character offsets.  There is plenty of room for optimizations and refactoring.\n\nMany thanks to my colleague, Jason Robinson, for input on the design of this patch.",
    "attachments": {
        "lucene5317v1.patch": "https://issues.apache.org/jira/secure/attachment/12682333/lucene5317v1.patch",
        "LUCENE-5317.patch": "https://issues.apache.org/jira/secure/attachment/12675414/LUCENE-5317.patch",
        "concordance_v1.patch.gz": "https://issues.apache.org/jira/secure/attachment/12611145/concordance_v1.patch.gz",
        "lucene5317v2.patch": "https://issues.apache.org/jira/secure/attachment/12682461/lucene5317v2.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-10-30T19:08:45+0000",
            "content": "v1 of patch attached ",
            "author": "Tim Allison",
            "id": "comment-13809499"
        },
        {
            "date": "2014-10-17T02:11:29+0000",
            "content": "Sync'd Tim's patch up to current trunk:\n\n\n\tLUCENE-5449: _TestUtil->TestUtil\n\tLUCENE-5569 AtomicReader->LeafReader\n\tLUCENE-5984: ChainedFilter removed; replaced with BooleanFilter\n\tLUCENE-6010: OpenBitSet removed; replaced with FixedBitSet, except for in TokenCharOffsetRequests, where I switched it to Java's BitSet.\n\tAdded Maven and IntelliJ config\n\tCleaned up some code formatting issues:\n\t\n\t\tindents -> 2 spaces per level\n\t\tremoved useless javadoc stuff (empty returns, empty params)\n\t\tnormalized whitespace\n\t\tnormalized curly brace placement\n\t\tremoved unused imports\n\t\tconverted some counted for loops to for-each\n\t\n\t\n\n\n\nI left a few nocommits.\n\nI plan on reviewing more. ",
            "author": "Steve Rowe",
            "id": "comment-14174645"
        },
        {
            "date": "2014-10-17T11:00:01+0000",
            "content": "Steve, thank you!  I had abandoned hope and haven't been updating this patch on jira.  The current version in my local repo looks a bit different now.\n\nLet me apply your patch and see what the diff is between your cleanup/fixes and my current version.\n ",
            "author": "Tim Allison",
            "id": "comment-14174938"
        },
        {
            "date": "2014-10-17T17:28:28+0000",
            "content": "Tim, FYI, I've used the ASF's ReviewBoard instance a few times recently - it's very nice for comparing two patches against each other, and it can be useful for detailed review too: https://reviews.apache.org/.  After creating an account there, the workflow is: manually upload a patch, assign a reviewer (could be the \"lucene\" group, in which case review requests go to the dev list, or a RB account-holder, including yourself), then publish.  Thereafter anybody can review by clicking on one or more adjacent lines in a patch and attaching a comment, repeating till done, then publishing, and the original review request creator can update the patch, and anybody can view differences between any two patched versions, and also attach reviews to the patched version differences. ",
            "author": "Steve Rowe",
            "id": "comment-14175274"
        },
        {
            "date": "2014-10-29T12:38:07+0000",
            "content": "Thank you, Steve.  I created a lucene5317 branch on my github fork.  I applied your patch and will start adding my local updates...there have been quite a few since I posted the initial patch. \n\nWhen I'm happy enough with that, I'll put the patch on rb.\n\nThank you, again. ",
            "author": "Tim Allison",
            "id": "comment-14188309"
        },
        {
            "date": "2014-10-31T18:56:19+0000",
            "content": "I added my latest source code and standalone jars to work with 4.10.2 to my lucene-addons repo in case anyone wants to try the code as is.  There may be surprises.\n\nThe next step is to turn back to the lucene5317 branch in my fork and update the trunk code.\n\nThe biggest functional difference between the original patch from last October and the current working code in my repo is that I added multivalued field handling. ",
            "author": "Tim Allison",
            "id": "comment-14192255"
        },
        {
            "date": "2014-11-19T03:09:48+0000",
            "content": "I merged in my local updates and I pushed these to my fork on github link. \n\n I didn't have luck posting this to the review board.  When I tried to post it, I entered the base directory and was returned to the starting page without any error message.  For the record, I'm sure that this is user error. ",
            "author": "Tim Allison",
            "id": "comment-14217330"
        },
        {
            "date": "2014-11-19T15:10:21+0000",
            "content": "I didn't have luck posting this to the review board. When I tried to post it, I entered the base directory and was returned to the starting page without any error message. For the record, I'm sure that this is user error.\n\nI've successfully used trunk (literally just that) for the base directory in the past - what did you use? ",
            "author": "Steve Rowe",
            "id": "comment-14217994"
        },
        {
            "date": "2014-11-19T19:29:59+0000",
            "content": "I made the mistake of following instructions and tried /trunk and /trunk/ yesterday.  I tried with a git diff file yesterday, and I also just tried with a git --no-prefix diff file today, which seems to work with a traditional svn (patch attached).  Today, I tried three variations of trunk.  Still confident this is user error.  Is there a size limit on diffs or is there something screwy with the attached diff file? ",
            "author": "Tim Allison",
            "id": "comment-14218355"
        },
        {
            "date": "2014-11-19T19:38:54+0000",
            "content": "When I tried to make a new review request with your latest patch, I get this error:\n\n\nThe specified diff file could not be parsed.\nLine 2: No valid separator after the filename was found in the diff header\n\nI've successfully applied your patch to my svn checkout (using svn patch), and I'm posting it here unchanged. ",
            "author": "Steve Rowe",
            "id": "comment-14218366"
        },
        {
            "date": "2014-11-19T19:54:41+0000",
            "content": "Great.  Thank you.  I just tried svn diff from the svn checkout that I had patched with the correct git diff...with no luck.  I hadn't even svn-added the concordance directory, so the diff file was quite short.\n\nAre you using rbtools or have you had luck with the web interface?\n\nAnd success with installing rbtools: \n\nSearching for RBTools\nReading https://pypi.python.org/simple/RBTools/\nDownload error on https://pypi.python.org/simple/RBTools/: [Errno 10061] No conn\nection could be made because the target machine actively refused it -- Some pack\nages may not be found!\nCouldn't find index page for 'RBTools' (maybe misspelled?)\nScanning index of all packages (this may take a while)\nReading https://pypi.python.org/simple/\nDownload error on https://pypi.python.org/simple/: [Errno 10061] No connection c\nould be made because the target machine actively refused it -- Some packages may\n not be found!\nNo local packages or download links found for RBTools\nerror: Could not find suitable distribution for Requirement.parse('RBTools')\n\n ",
            "author": "Tim Allison",
            "id": "comment-14218401"
        },
        {
            "date": "2014-11-19T19:59:06+0000",
            "content": "One of the nice things about svn patch is that it automatically does the svn add stuff for you.\n\nI've never tried rbtools, always used the web interface, no problems so far. ",
            "author": "Steve Rowe",
            "id": "comment-14218407"
        },
        {
            "date": "2014-11-19T20:17:22+0000",
            "content": "Switching to Chrome was the answer, apparently: link\n\nThank you for the tip on \"svn patch\"...I just upgraded my Linux svn to something more appropriate for this decade, and now patch is available.  ",
            "author": "Tim Allison",
            "id": "comment-14218436"
        },
        {
            "date": "2016-08-11T12:00:33+0000",
            "content": "Now available via Maven central.\n\n<!-- https://mvnrepository.com/artifact/org.tallison.lucene/lucene-5317 -->\n<dependency>\n    <groupId>org.tallison.lucene</groupId>\n    <artifactId>lucene-5317</artifactId>\n    <version>6.1-0.2</version>\n</dependency>\n\nIf anyone has an interest in helping me change the namespace back to org.apache.lucene, let me know.  ",
            "author": "Tim Allison",
            "id": "comment-15417097"
        },
        {
            "date": "2016-09-21T12:27:36+0000",
            "content": "Hi Tim Allison, I'd be interested in getting this into trunk, I agree it can be a useful analysis tool. ",
            "author": "Tommaso Teofili",
            "id": "comment-15509759"
        },
        {
            "date": "2016-09-21T12:47:16+0000",
            "content": "Great. I'll start a fresh branch in my fork, pick up where Steve Rowe left off and submit a new PR.  Probably be a few days to early next week.  Thank you! ",
            "author": "Tim Allison",
            "id": "comment-15509806"
        },
        {
            "date": "2016-09-23T19:22:01+0000",
            "content": "GitHub user tballison opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/82\n\n    First draft of LUCENE-5317\n\n    First draft of LUCENE-5317\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/tballison/lucene-solr LUCENE-5317\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/82.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #82\n\n\ncommit ea9fd7fdd4d94fd498f0188b9aab0c8cf48c7295\nAuthor: tballison <tallison@mitre.org>\nDate:   2016-09-23T19:19:22Z\n\n    Rough draft of LUCENE-5317.\n\ncommit 632c00980d1f7257b15b5dfde445168940dd423c\nAuthor: tballison <tallison@mitre.org>\nDate:   2016-09-23T19:20:36Z\n\n    Merge remote-tracking branch 'upstream/master' into LUCENE-5317\n\n ",
            "author": "ASF GitHub Bot",
            "id": "comment-15517330"
        },
        {
            "date": "2016-09-23T19:23:48+0000",
            "content": "Rough, rough draft.  Any and all comments are welcomed!\n\nMany thanks, again, to Steve Rowe for doing the first draft of an actual integration w/ Lucene.  ",
            "author": "Tim Allison",
            "id": "comment-15517339"
        },
        {
            "date": "2016-09-26T13:31:53+0000",
            "content": "I received a personal email asking for some more background on this capability.  Here goes (apologies for some repetition with the issue description)...\n\nFor an example of concordance output, see these slides.  Slides 23 and 24 for LUCENE-5317 and slides 25-28 for LUCENE-5318.\n\nThe notion is that you present every time the term appears in the central column with x number of words to the left and right.  The user can sort on words before the target term to see what modifies it, or the user can sort on words after the target term to see what it modifies, or the user can sort on order of appearance within the documents to effectively read everything in their docs that matters to them. \n\n By target term, of course, I mean any term/phrase that can be represented by a SpanQuery.\n\nThis kind of view of the data is extremely helpful to linguists and philologists to understand how words are being used.  It also has practical applications for anyone doing \"analytic\" search, that is, they want to see every time a term/phrase appears – lawyers, patent examiners, etc.\n\nThis view of the data is fundamentally different from snippets, which typically show the three or so best chunks where the search terms appear, and they're typically ordered per document.  Snippets allow the user to determine if a document is relevant, then the user has to open the document.  Snippets are great if users are seeking the best document to answer their information need.  \n\nFor \"analytic searchers\", however, with concordance results, the user can be saved the step of having to open the document; they can see every time their term/phrase appears.  Also, for \"analytic searchers\", if their documents are lengthy, the concordance allows them to see the potentially hundreds of times that their term/phrase appears in each document instead of the three or so snippets they might see with traditional search engines.\n\n\"But you can increase the number of snippets to whatever you want...\"  Yes, you can, but the layout of the concordance allows you to see patterns across documents very easily.  Again, the results are sorted by words to the left or right, not by which document the target appeared in.\n\nThis link shows some output from a concordancer (AntConc).  Wikipedia's best description is under key word in context (KWIC). If you're into tree-ware, Oakes has a great introduction to concordances among many other useful topics! ",
            "author": "Tim Allison",
            "id": "comment-15523067"
        },
        {
            "date": "2016-09-29T15:08:17+0000",
            "content": "thanks [~tallison@mitre.org], I'll have a look at your patch tomorrow. ",
            "author": "Tommaso Teofili",
            "id": "comment-15533026"
        },
        {
            "date": "2016-09-29T15:11:09+0000",
            "content": "Thank you.  It was initially developed in Notepad with Groovy and Lucene 2.4...some of that feel is still evident. ",
            "author": "Tim Allison",
            "id": "comment-15533035"
        },
        {
            "date": "2017-10-10T18:39:45+0000",
            "content": "A prototype ASL 2.0 application that demonstrates the utility of the concordance is available: https://github.com/mitre/rhapsode ",
            "author": "Tim Allison",
            "id": "comment-16199160"
        }
    ]
}