{
    "id": "LUCENE-4231",
    "title": "Lucene-test-framework has META-INF for Codec for PreFlexRWCodec but not instantiatable",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/test"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Not A Problem",
        "status": "Closed"
    },
    "description": "The Lucene-test-framework for 4.0-ALPHA contains /META-INF/services/org.apache.lucene.codecs.Codec which I didn't expect; shouldn't that only be in Lucene-core ?  Well its there, and it contains org.apache.lucene.codecs.lucene3x.PreFlexRWCodec which is actually a class embedded in the test framework jar file (again, unexpected).  However, this class depends on the existence of Lucene3xCodec which is not part of this jar file.\n\nI discovered this because I accidentally had the lucene-test-framework 4.0-ALPHA on my classpath along with the lucene-core 5.0 but Codec would fail at class initialization time because the services failed to resolve.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-17T21:02:34+0000",
            "content": "This is all intentional.\n\nPreFlexRW Codec is a (test-only) read-write version of Lucene3x codec to act like 3.x for tests.\n\nIts in the test-framework jar because its only for testing. ",
            "author": "Robert Muir",
            "id": "comment-13416593"
        },
        {
            "date": "2012-07-18T14:42:51+0000",
            "content": "So is it assumes that if you have lucene-test-framework that you also have lucene-core?  That would satisfy the dependency of org.apache.lucene.codecs.lucene3x.PreFlexRWCodec to Lucene3xCodec which doesn't exist in lucene-test-framework ",
            "author": "David Smiley",
            "id": "comment-13417131"
        },
        {
            "date": "2012-07-18T14:49:22+0000",
            "content": "I thought you were a maven user? All dependencies for lucene-test-framework.jar are specified there:\nhttp://search.maven.org/remotecontent?filepath=org/apache/lucene/lucene-test-framework/4.0.0-ALPHA/lucene-test-framework-4.0.0-ALPHA.pom ",
            "author": "Robert Muir",
            "id": "comment-13417136"
        },
        {
            "date": "2012-07-18T14:50:20+0000",
            "content": "Yes, lucene-test-framework depends on Llucene-core (not only for codecs, much more). The problem you had is that you were also mixing versions, and Lucene trunk (5.0) no longer has 3.x index compatibility, so the Lucene3x codec is missing completely, leaving the 4.0 test-framework JAR alone. ",
            "author": "Uwe Schindler",
            "id": "comment-13417137"
        },
        {
            "date": "2012-07-18T16:16:41+0000",
            "content": "Ok, sorry for the confusion. I do use maven but I was messing with my classpath in my IDE to try out a patched trunk. ",
            "author": "David Smiley",
            "id": "comment-13417209"
        }
    ]
}