{
    "id": "LUCENE-3325",
    "title": "Transpose positions in index",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "When positions are used in queries with many terms, each term in each document causes a seek in the positions, and in large indexes these seeks can be far apart even when the terms are in the same document.\nThe number of (disk) cache misses of such position seeks might be reduced by putting the positions for all terms in the same document directly behind each other. This should have a noticable effect when terms are alphabetically close, for example for truncations, and it should also help when the documents have few enough positions to fill a cache entry (disk page, cache line).\nThis might also help the performance of highlighting based on indexed positions.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-07-17T12:24:46+0000",
            "content": "This was more or less suggested in:\n\n\"Compressing Term Positions in Web Indexes\", Hao Yan, Shuan Ding, Torsten Suel, SIGIR '09.\nhttp://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.152.4748&rep=rep1&type=pdf\n\nin sections 7 and 8, and especially the last sentence: \"... one could even consider storing the parsed documents themselves in highly compressed form and accessing these during a position data lookup, instead of keeping the positions in inverted lists.\" ",
            "author": "Paul Elschot",
            "id": "comment-13066628"
        },
        {
            "date": "2011-07-17T12:31:24+0000",
            "content": "Currently positions are stored in this order (see the index file formats for positions):\n\nTermPositions are ordered by term (the term is implicit, from the .tis file).\nPositions entries are ordered by increasing document number (the document number is implicit from the .frq file).\n\nThe idea is to change this order such that positions are ordered first by document and then by term. ",
            "author": "Paul Elschot",
            "id": "comment-13066630"
        },
        {
            "date": "2011-07-17T12:34:59+0000",
            "content": "Perhaps this also speeds up segment merging, as there is no more need to uninvert the positions. ",
            "author": "Paul Elschot",
            "id": "comment-13066631"
        },
        {
            "date": "2014-10-19T20:57:02+0000",
            "content": "Not enough interest. ",
            "author": "Paul Elschot",
            "id": "comment-14176419"
        }
    ]
}