{
    "id": "LUCENE-4416",
    "title": "disable manual invocation of internal untested ant targets",
    "details": {
        "components": [
            "general/build"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Task",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This typically comes up at e.g. release vote time, people try to run one of the many targets that happens to have a \"description\" in build.xml, but is really internal.\n\ne.g. if someone runs 'dist-contrib                 Make the contribs ready for distribution' from solr, will it work? I have no idea. probably not.\n\nwe should change some of these to be e.g. -dist-contrib or whatever, so there are no complaints.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-22T01:11:32+0000",
            "content": "why don't we just remove the descriptions (ie: move them into xml comments) so they don't show up in \"ant -p\" at all? ",
            "author": "Hoss Man",
            "id": "comment-13460980"
        },
        {
            "date": "2012-09-22T01:16:18+0000",
            "content": "I think we should both remove the descriptions and hyphenate them,\nthis way they are impossible to execute standalone, the only targets\nthat are shown in ant -p, and the only targets you can run at all are the \nones we test.\n\nThis relieves the onus from being on the release manager to manually test this\nkind of stuff before releases. ",
            "author": "Robert Muir",
            "id": "comment-13460983"
        },
        {
            "date": "2012-09-22T01:19:35+0000",
            "content": "this way they are impossible to execute standalone,\n\nAh ... ok, right: you can't specify them on the command line because they start with a hyphen.\n\n+1 ",
            "author": "Hoss Man",
            "id": "comment-13460987"
        },
        {
            "date": "2012-09-22T01:27:55+0000",
            "content": "...and all said targets we want to support should be tested from a totally \nclean checkout (ant clean clean-jars), so we know that both their \ndependencies are correct, and they resolve anything they need.\n\nfor example, today we don't really \"test\" javadocs, because it runs\nafter 'ant test' is done. \n\n\"ant javadocs\" could be and has been in the past broken standalone, where \nit doesnt properly resolve e.g. 3rd party libraries but happens to work if\nits run after other things which forced lib/ to be populated.\n\nSo today this is an example of what I mean by unsupported target.\n\nif a user sent an email tonight to the list saying \"can't build javadocs for 4.0,\nthe ant target fails\", because it didnt resolve its dependencies correctly if\nyou weren't previously doing other shit, i wouldn't be surprised at all. And\nthen we would have blocker issues/ respins / etc etc when we can avoid this with\njust some jenkins testing. ",
            "author": "Robert Muir",
            "id": "comment-13460991"
        },
        {
            "date": "2012-09-22T01:41:42+0000",
            "content": "The best way to implement these checks imo is to add the \nappropriate 'clean clean-jars' to the smokeTester.py in between the things it tests. ",
            "author": "Robert Muir",
            "id": "comment-13460996"
        }
    ]
}