{
    "id": "LUCENE-5778",
    "title": "Support hunspell morphological description fields",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.10",
            "6.0"
        ]
    },
    "description": "Currently hunspell stemmer doesn't support these (particularly the st:XYZ field which signifies a stemming \"exception\" basically).\n\nFor example in english \"feet\" might have \"st:foot\".\n\nThese can be encoded two ways, inline into the .dic or aliased via AM entries from the .aff.\n\nUnfortunately, our parsing was really lenient and in order to do this properly (e.g. handling words with spaces and morphological fields containing slashes and all that jazz), it had to be cleaned up a bit to follow the hunspell rules.\n\nFor now, we dont waste space with part of speech and only concern ourselves with the \"st:\" field and the stemmer uses it transparently. \n\nEncoding these exceptions is a little complicated because these exceptions are rarely used, but when they are, they are typically common verbs and stuff (like english 'be'), so we dont want it to be slow. \nThey are also not \"per-word\" but \"per-form\", so you could have homonyms with different stems (at least theoretically). \nOn the other hand this is silly stuff particular to these silly languages, so we dont want it to blow up the datastructure for 99% of languages that dont use it.\n\nSo the way we do it is to just store the exception ID alongside the form ID (this doubles the intsref, which is usually 1). So for e.g. english i think it typically boils down to an extra byte or so in the FST and doesn't blow up. For languages not using this stuff there is no impact.",
    "attachments": {
        "LUCENE-5778.patch": "https://issues.apache.org/jira/secure/attachment/12651428/LUCENE-5778.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14037440",
            "author": "Robert Muir",
            "content": "patch, with tests ",
            "date": "2014-06-19T15:39:51+0000"
        },
        {
            "id": "comment-14039807",
            "author": "ASF subversion and git services",
            "content": "Commit 1604354 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1604354 ]\n\nLUCENE-5778: support hunspell morphological description fields ",
            "date": "2014-06-21T13:15:58+0000"
        },
        {
            "id": "comment-14039809",
            "author": "ASF subversion and git services",
            "content": "Commit 1604355 from Robert Muir in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1604355 ]\n\nLUCENE-5778: support hunspell morphological description fields ",
            "date": "2014-06-21T13:19:04+0000"
        }
    ]
}