{
    "id": "LUCENE-6376",
    "title": "Spatial PointVectorStrategy should use DocValues",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [
            "modules/spatial"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "PointVectorStrategy.createIndexableFields should be using DocValues, like BBoxStrategy does.  Without this, UninvertingReader is required.",
    "attachments": {
        "LUCENE-6376.patch": "https://issues.apache.org/jira/secure/attachment/12709398/LUCENE-6376.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14395564",
            "author": "Aditya Dhulipala",
            "date": "2015-04-04T05:37:44+0000",
            "content": "I've added the line to setDocValuesType for the PointVectorStrategy.createIndexableFields method "
        },
        {
            "id": "comment-14395740",
            "author": "David Smiley",
            "date": "2015-04-04T14:22:30+0000",
            "content": "Thanks for the patch.  It's better than before.  As the description says, BBoxStrategy has code that could be emulated here allowing for customizing the index options desired.  Some users might not even want the docValues because they are just doing rectangle queries & no sorting, for example.   When I get to this I intend to copy that, moving any common code to the util package, perhaps. "
        },
        {
            "id": "comment-14396021",
            "author": "Aditya Dhulipala",
            "date": "2015-04-05T01:01:02+0000",
            "content": "Hi David,\n\nThanks for writing back. \n\nI'm a CS studnet and would like to get invovled in the project. \n\nThe description seemed simple enough and I assumed this was equivalent to a \"newdev\" label. \n\nIf it's ok with you I'd like to research more on this issue. Can you point me to some documentation or references that can help me contribute a patch?\n\nThanks!\n\n–\nAditya "
        },
        {
            "id": "comment-14396060",
            "author": "David Smiley",
            "date": "2015-04-05T04:05:02+0000",
            "content": "Okay; I'm in no hurry to add the things I said so please go ahead and learn how things work so that you can do likewise.  You already know how to add a patch I see; you're doing what you supposed to do in terms of contributing.  Check out: http://wiki.apache.org/lucene-java/HowToContribute\n\nBTW along with the change you did, update the spatial test infrastructure to not uninvert this strategies fields.  See SpatialTestCase.setup:\n\n    // TODO: change this module to index docvalues instead of uninverting\n    uninvertMap.clear();\n    uninvertMap.put(\"pointvector__x\", Type.DOUBLE);\n    uninvertMap.put(\"pointvector__y\", Type.DOUBLE);\n\n\nshould become simply uninvertMap.clear();   The comment no longer applies as we no longer invert with your patch. "
        },
        {
            "id": "comment-14396068",
            "author": "Aditya Dhulipala",
            "date": "2015-04-05T04:57:12+0000",
            "content": "Ok. Thanks for the info. I'll continue working on this.\n "
        }
    ]
}