{
    "id": "LUCENE-1882",
    "title": "move SmartChineseAnalyzer into the smartcn package",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "an offshoot of LUCENE-1862, org.apache.lucene.analysis.cn.SmartChineseAnalyzer should become org.apache.lucene.analysis.cn.smartcn.SmartChineseAnalyzer",
    "attachments": {
        "LUCENE-1882.patch": "https://issues.apache.org/jira/secure/attachment/12418294/LUCENE-1882.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-09-01T20:11:08+0000",
            "content": "svn commit -m \"LUCENE-1882: move SmartChineseAnalyzer to the 'correct' package ... this commit is based on a sequence of svn commands and a patch provided by Robert Muir in LUCENE-1862\"\n...\nCommitted revision 810208.\n\nRobert: could you please verify wether the move looks good to you? ",
            "author": "Hoss Man",
            "id": "comment-12750075"
        },
        {
            "date": "2009-09-01T20:29:56+0000",
            "content": "hossman, looks good! Thanks for correcting the EOL issue also.\n\nI've attached a trivial patch to the package.html files now that the eol issue is resolved. ",
            "author": "Robert Muir",
            "id": "comment-12750086"
        },
        {
            "date": "2009-09-01T20:32:23+0000",
            "content": "hossman, I am curious if you have trouble with this patch to package.html now that you have corrected the EOL issue?\n\nif you do have issues, i can commit it if you want, but I'd really like to verify we can all create/apply patches to smart chinese analyzer  ",
            "author": "Robert Muir",
            "id": "comment-12750087"
        },
        {
            "date": "2009-09-01T20:38:46+0000",
            "content": "hmm scratch that, I think the package.html for .smart should be similar to the old one under .cn... (that explains the difference between the 3 chinese options).\n\nI will supply a new patch. ",
            "author": "Robert Muir",
            "id": "comment-12750089"
        },
        {
            "date": "2009-09-01T20:46:21+0000",
            "content": "this patch adds the old verbage under smartcn/o.a.l.analysis.cn/package.html  to the smartcn/o.a.l.analysis.cn.smart/package.html\nits much better for the javadocs summary, and explains the difference between the 3 options.\n\nalso, i added UTF-8 content-type explicitly to both smartcn/package.html and smartcn/hhmm/package.html\nif you are using an ide such as eclipse, the patch will not apply unless you FORCE the encoding of these files to UTF-8 before applying the patch.\n\nafter we commit the patch, eclipse will detect the file is UTF-8 encoding (you can undo the forced encoding setting) and we won't have to deal with this issue again.\n\nthe following statement is a stretch, but imho all .html files in lucene should declare content-type, so we don't have encoding issues. ",
            "author": "Robert Muir",
            "id": "comment-12750092"
        },
        {
            "date": "2009-09-01T21:28:41+0000",
            "content": "I am curious if you have trouble with this patch to package.html now that you have corrected the EOL issue?\n\nit might have just been the content type in the html header ... but i don't think so, i think it had to do with the line endings of the patch, vs the updated line endencins once i fixed the eol-style ... plus i was trying a bunch of differnt things to fix hte line endings ... i don't know what it was exactly, but this new patch seems to work fine (evne with the non ascii glyphs) so i think we're good. ",
            "author": "Hoss Man",
            "id": "comment-12750109"
        },
        {
            "date": "2009-09-01T21:31:57+0000",
            "content": "Committed revision 810247.\n\nthanks robert. ",
            "author": "Hoss Man",
            "id": "comment-12750111"
        }
    ]
}