{
    "id": "LUCENE-2169",
    "title": "Speedup of CharArraySet#copy if a CharArraySet instance is passed to copy.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "3.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "the copy method should use the entries array itself to copy the set internally instead of iterating over all values. this would speedup copying even small set",
    "attachments": {
        "LUCENE-2169.patch": "https://issues.apache.org/jira/secure/attachment/12428289/LUCENE-2169.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-12-17T12:37:37+0000",
            "content": "here is a patch  ",
            "author": "Simon Willnauer",
            "id": "comment-12791903"
        },
        {
            "date": "2009-12-20T14:37:26+0000",
            "content": "Patch that extends test to verify that the documented behaviour on arbitrary objects using toString() works correctly.\n\nThis also fixes the issue of preserving matchVersion. ",
            "author": "Uwe Schindler",
            "id": "comment-12792995"
        },
        {
            "date": "2009-12-20T16:17:14+0000",
            "content": "Better patch, that is more clear and structured. Also improved javadocs. ",
            "author": "Uwe Schindler",
            "id": "comment-12793000"
        },
        {
            "date": "2009-12-23T18:50:58+0000",
            "content": "Uwe, when I first looked at your patch I thought that is a good idea but once I looked at the usecases of CharArraySet differentiating between matchVersion if the given set is an instance of CharArraySet is not idea IMO. Imagine you create an analyzer with CharArraySet the analyzer will use its own given version together with the copy method internally if the analyzer is created with a different version than the provided stopset (which is already a CharArraySet) copy could change the behavior due to the given version with is actually the matchVersion for the analyzer not for the set. I would leave the decision to the user if a copy with a different version is what the user wants. If the version should not be preserved and the set to copy is a charArraySet users should use the constructor directly. I will attach a patch shortly ",
            "author": "Simon Willnauer",
            "id": "comment-12794147"
        },
        {
            "date": "2009-12-23T18:52:16+0000",
            "content": "patch that incorporates uwes additions to the testcases and enforces the Version of the source set in the copy if it is an instance of CharArraySet ",
            "author": "Simon Willnauer",
            "id": "comment-12794148"
        },
        {
            "date": "2009-12-23T19:02:36+0000",
            "content": "But you now changed the behaviour of copy(). Before the patch it changed the CharArraySets matchVersion... That was what my patch was doing to preserve this behaviour. ",
            "author": "Uwe Schindler",
            "id": "comment-12794157"
        },
        {
            "date": "2009-12-23T19:07:12+0000",
            "content": "But you now changed the behaviour of copy(). Before the patch it changed the CharArraySets matchVersion... That was what my patch was doing to preserve this behaviour. \n\nthe CharArraySet did not have a Version before 3.1 so this code has never been released. Changing this behavior is fine and will not break anything though.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12794160"
        },
        {
            "date": "2009-12-23T20:24:27+0000",
            "content": "OK.\n\nI will commit this together with LUCENE-2179. ",
            "author": "Uwe Schindler",
            "id": "comment-12794207"
        },
        {
            "date": "2009-12-23T23:26:05+0000",
            "content": "Committed revision: 893655 ",
            "author": "Uwe Schindler",
            "id": "comment-12794271"
        }
    ]
}