{
    "id": "LUCENE-2411",
    "title": "clean up uses of String.toLowerCase in code",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0"
        ],
        "affect_versions": "3.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Uwe recently fixed this in the ThaiWordFilter, which reminded me to search our code for use of String.toLowerCase()\n\nThe problem with this method is the following:\n\n\tit depends on the \"default locale\" which is flimsy and should be avoided I think, it typically just causes problems.\n  This is because there can be hard-to-debug issues if the machine is not configured correctly for the same Locale\n  at both index and query time.\n\tlowercasing with locale-sensitive rules is really only suitable for display and presentation,\n  if we want international lowercasing for search we should be using case folding.\n  This is especially important since otherwise people unknowingly using this special casing at query-time are\n  not going to get results, e.g. if they use a TermRangeQuery from the queryparser and it lowercases stuff differently.\n\n\n\nin my opinion we should fix all these methods to use Character.toLowerCase\n(if possible especially for speed with TokenStreams), otherwise String.toLowerCase \nwith the ROOT Locale, new Locale(\"\"). This is closer to case folding.\n\nIf some things really need locale-sensitivity for some extreme reason I think we should just make the Locale \na mandatory parameter.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-04-22T17:36:10+0000",
            "content": "by the way, the most confusing example of this is the queryparser: which takes a Locale parameter, but doesnt even use it for this operation, instead using the default. ",
            "author": "Robert Muir",
            "id": "comment-12859915"
        },
        {
            "date": "2012-09-18T15:54:22+0000",
            "content": "I think this can be closed as fixed, given that -check-forbidden-jdk-apis prohibits String.toLowerCase(): LUCENE-4199. ",
            "author": "Steve Rowe",
            "id": "comment-13457898"
        },
        {
            "date": "2013-05-10T10:33:00+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13653794"
        }
    ]
}