{
    "id": "LUCENE-6902",
    "title": "Fail fsync immediately",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "5.3.1",
        "components": [
            "core/store"
        ],
        "labels": "",
        "fix_versions": [
            "5.4",
            "6.0"
        ],
        "priority": "Minor",
        "status": "Closed",
        "type": "Improvement"
    },
    "description": "While analysing a build issue in Elasticsearch I stumpled upon org.apache.lucene.util.IOUtils.fsync. It has a retry loop in fsync whenever an IOException occurs. However, there are lots of instances where a retry is not useful, e.g. when a channel has been closed, a ClosedChannelException is thrown and IOUtils#fsync still tries to fsync multiple times on the closed channel.\n\nAfter bringing the issue to Robert's attention, he even opted for removing the retry logic entirely for fsyncing.\n\nPlease find attached a patch that removes the retry logic.",
    "attachments": {
        "ioutils-fsync-fail-fast.patch": "https://issues.apache.org/jira/secure/attachment/12773469/ioutils-fsync-fail-fast.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15013833",
            "author": "Robert Muir",
            "date": "2015-11-19T16:47:05+0000",
            "content": "+1 to remove this retry. Its especially bad since its just \"any IOException\".\n\nI think it is a relic from when this method used RandomAccessFile (and would sometimes create files). If it turns out some hack is really needed (e.g. on windows), then we should at least contain it better to a more specific case or think about how we can avoid it. "
        },
        {
            "id": "comment-15014188",
            "author": "Michael McCandless",
            "date": "2015-11-19T19:17:08+0000",
            "content": "+1, patch looks good, except testFsyncFile is actually just fsync'ing the dir? "
        },
        {
            "id": "comment-15014485",
            "author": "Uwe Schindler",
            "date": "2015-11-19T22:08:31+0000",
            "content": "Hi, patch looks good. I will take this issue and commit it after doing my usual checks (modifications on fsync are\n\nMike is right, the testFsyncFile is wrong, it syncs the directory.\n\nThe assume on not windows is not needed for the directory test, please remove it! Because fsyncing a directory may always fail on any operating system and this is correctly checked in the code (supresses exception). So just remove the assume on windows. Removing it actually checks that our assert statement in the code works correct. "
        },
        {
            "id": "comment-15014501",
            "author": "Uwe Schindler",
            "date": "2015-11-19T22:11:21+0000",
            "content": "btw. I was About to remove the loop when touching the code last time (adding directory fsync). But as this was another issue I left it alive. "
        },
        {
            "id": "comment-15015357",
            "author": "Daniel Mitterdorfer",
            "date": "2015-11-20T07:33:51+0000",
            "content": "Mike, you are right regarding the test. I totally forgot to change the boolean to false for the file-based test. I've uploaded a corrected version of the patch. "
        },
        {
            "id": "comment-15015362",
            "author": "Daniel Mitterdorfer",
            "date": "2015-11-20T07:35:47+0000",
            "content": "Btw, I think LUCENE-6169 could also be resolved now. The according JDK bug is fixed by now according to their issue tracker. "
        },
        {
            "id": "comment-15015381",
            "author": "Uwe Schindler",
            "date": "2015-11-20T07:45:45+0000",
            "content": "Hi,\ncan you also remove the assume on Windows from the fsync on directory test? The test must also work on Windows (it would just be a no-op).\nLUCENE-6169 is still open because OpenJDK team is still working on an \"official\" API. "
        },
        {
            "id": "comment-15015389",
            "author": "Daniel Mitterdorfer",
            "date": "2015-11-20T07:56:58+0000",
            "content": "Sure. Please find the updated version attached. The testFsyncFile is also fsyncing on the file now, not on the directory. "
        },
        {
            "id": "comment-15015486",
            "author": "Uwe Schindler",
            "date": "2015-11-20T09:31:40+0000",
            "content": "Looks fine! I will check and commit this later.\nYou can leave the old versions of the patch online, don't delete them! If you upload a new version of the same filename, the old one is grayed out, but is still accessible for doucmentation purposes. "
        },
        {
            "id": "comment-15015494",
            "author": "Daniel Mitterdorfer",
            "date": "2015-11-20T09:33:59+0000",
            "content": "Sorry, wasn't aware of that. Thanks for pointing it out. "
        },
        {
            "id": "comment-15018471",
            "author": "Uwe Schindler",
            "date": "2015-11-20T18:28:55+0000",
            "content": "Hi the patch fails on windows, because it does not swallow the IOException when fsyncing a directory. I will correct it and upload new patch. In fact, you catched the exception at the wrong place! "
        },
        {
            "id": "comment-15018479",
            "author": "Uwe Schindler",
            "date": "2015-11-20T18:35:49+0000",
            "content": "Corrected patch. The inner try-block was obsolete. The catching had to be outside (as it was before, just more complicated).\n\nI will remove the extra check for Java 9 to work around LUCENE-6169 in a second commit. "
        },
        {
            "id": "comment-15020928",
            "author": "ASF subversion and git services",
            "date": "2015-11-22T10:27:59+0000",
            "content": "Commit 1715617 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1715617 ]\n\nLUCENE-6902: Don't retry to fsync files / directories; fail immediately "
        },
        {
            "id": "comment-15020929",
            "author": "ASF subversion and git services",
            "date": "2015-11-22T10:29:23+0000",
            "content": "Commit 1715618 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1715618 ]\n\nMerged revision(s) 1715617 from lucene/dev/trunk:\nLUCENE-6902: Don't retry to fsync files / directories; fail immediately "
        }
    ]
}