{
    "id": "LUCENE-3769",
    "title": "Simplify NRTManager",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "NRTManager is hairy now, because the applyDeletes is separately passed\nto ctor, passed to maybeReopen, passed to getSearcherManager, etc.\n\nI think, instead, you should pass it only to the ctor, and if you have\nsome cases needing deletes and others not then you can make two\nNRTManagers.  This should be no less efficient than we have today,\njust simpler.\n\nI think it will also enable NRTManager to subclass ThingyManager\n(LUCENE-3761).",
    "attachments": {
        "LUCENE-3769.patch": "https://issues.apache.org/jira/secure/attachment/12514123/LUCENE-3769.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-02-10T17:28:54+0000",
            "content": "Patch; this is a great simplification of the NRTMgr API, and I think sets it up for ThingyManager.\n\nBut: I had to introduce TrackingIndexWriter, which just wraps an IndexWriter and tracks the changes made through it (as a generation).  Previously NRTManager did this all itself, but now you may need to share this tracking across 2 NRTManagers so I had to pull it out...  ",
            "author": "Michael McCandless",
            "id": "comment-13205563"
        },
        {
            "date": "2012-02-10T17:57:55+0000",
            "content": "mike, I like the simplification. I think we talked about this last time we touched this code already. I think this is the most common use-case... Yet, I don't think NRTManager should expose IndexSearcher directly. Think of an app that either uses NRT or commit / reopen ie. uses a NRTManager and a PlainOldIndexManager. From a user perspective SearcherManager is the main interface to search the index no matter how you commit / flush / NRT etc. I'd rather keep it exposing the SM instead. \n\nabout TrackingIndexWriter - I think we should fix IW to use seq ids eventually but I think for this purpose its fine. ",
            "author": "Simon Willnauer",
            "id": "comment-13205583"
        },
        {
            "date": "2012-02-10T18:29:05+0000",
            "content": "Yet, I don't think NRTManager should expose IndexSearcher directly. \n\nHmm, but the example you raised will be addressed by LUCENE-3761, right?  Ie at that point, both SM and NRTM are ThingyManager<IndexSearcher>?\n\nI don't like the extra indirection (you get an SM from NRTM) because now you have two linked instances.  For example, it opens up the risk that the app will (incorrectly) call SM.maybeReopen instead of NRTM.maybeReopen.  I think having the one manager to work with is less dangerous... ",
            "author": "Michael McCandless",
            "id": "comment-13205609"
        },
        {
            "date": "2012-02-10T18:55:19+0000",
            "content": "Hmm, but the example you raised will be addressed by LUCENE-3761, right? Ie at that point, both SM and NRTM are ThingyManager<IndexSearcher>?\n\nI think NRTM should delegate rather than subclass. It serves two different purposes and we shouldn't try to couple tight if not needed. ",
            "author": "Simon Willnauer",
            "id": "comment-13205635"
        },
        {
            "date": "2012-02-11T21:33:46+0000",
            "content": "New patch, exposing the private SearcherManager via\ngetSearcherManager.\n\nI really don't like the trappiness, ie that an app will mistakenly\ncall SM.maybeReopen instead of NRTM.maybeReopen, thus silently causing\nthreads to hang....  But I think once LUCENE-3761 is in we can fix\nthis... I'll open a separate issue to address this....\n\nI think this is ready! ",
            "author": "Michael McCandless",
            "id": "comment-13206270"
        },
        {
            "date": "2012-02-12T15:38:39+0000",
            "content": "I think this is ready!\n\n+1 I think this gets further improved once LUCENE-3761 is in. thanks mike ",
            "author": "Simon Willnauer",
            "id": "comment-13206433"
        },
        {
            "date": "2012-02-12T15:39:33+0000",
            "content": "one question, who is \"MJB\" in the changes.txt? ",
            "author": "Simon Willnauer",
            "id": "comment-13206434"
        },
        {
            "date": "2012-02-13T19:01:03+0000",
            "content": "one question, who is \"MJB\" in the changes.txt?\n\nOh, it's someone who found the applyDeletes logic confusing... s/he was asking about it in the comments near the end, here:\n\nhttp://blog.mikemccandless.com/2011/06/lucenes-near-real-time-search-is-fast.html ",
            "author": "Michael McCandless",
            "id": "comment-13207078"
        },
        {
            "date": "2012-02-13T19:35:08+0000",
            "content": "I'll open follow-on issue for the nasty trap... ",
            "author": "Michael McCandless",
            "id": "comment-13207113"
        }
    ]
}