{
    "id": "LUCENE-1738",
    "title": "IndexWriter.addIndexes without syncing",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "2.4.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "When LUCENE-1313 is completed, it would be good to have a way to\nreplicate segments from one IndexWriter to another.\n\n\n\tCallback on successful flush (maybe for other events as well?)\n\n\n\n\n\tAbility to access files for a segment (which would presumably\nbe read from the IW ramdir), then copy them to a temporary\nserialized ramdir (or equivalent as ramdir uses extra space in\nblocks, whereas we'll already know the size of the files before\nwe write them).\n\n\n\n\n\tOn the receiving end, we may be able to use\naddIndexesNoOptimize(Directory[]), however this would entail\neach directory having an extraneous segment_N file for each\nreplicated update (so we may want another format). \n\n\n\n\n\tIt will rely on having a new public version of SegmentInfo.",
    "attachments": {
        "LUCENE-1738.patch": "https://issues.apache.org/jira/secure/attachment/12413590/LUCENE-1738.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-07-10T09:23:47+0000",
            "content": "Moving fix version to 3.1... 3.0 will be just a mechanical release (no new features), quickly following 2.9. ",
            "author": "Michael McCandless",
            "id": "comment-12729586"
        },
        {
            "date": "2009-07-15T00:49:28+0000",
            "content": "Changed because we can use addIndexes for replication (hopefully) . ",
            "author": "Jason Rutherglen",
            "id": "comment-12731233"
        },
        {
            "date": "2009-07-15T19:16:44+0000",
            "content": "Very basic start at the patch.  The not IW.dir check is removed in the DirectoryReader ctor called by readerPool.  This conflicts with the way addIndexes currently works.  I guess we could add a parameter to segmentInfo indicating it's ok to include the segmentInfo in getReader?   \n\n\n\tAdded IW.addIndexesNoSync which doesn't stop indexing during the method, nor does it synchronously copy the indexes over.  The new indexes are scheduled as merges.\n\n\n\n\n\tcommit and close call resolveExternalSegments.\n\n\n\n\n\tI think we'll want a boolean parameter that synchronously copies the indexes over but does not start any merging.  This is for copying from a filesystem index.  In the replication use case, we're adding ramDirs so we don't need to immediately merge/copy them over.\n\n\n\n\n\tNeeds more unit tests\n\n ",
            "author": "Jason Rutherglen",
            "id": "comment-12731637"
        },
        {
            "date": "2009-07-21T23:03:28+0000",
            "content": "\n\tAdded copy parameter that calls resolveExternalSegments\n\n\n\n\n\tNext up is a test case showing the merge exception problem\n\n ",
            "author": "Jason Rutherglen",
            "id": "comment-12733878"
        },
        {
            "date": "2011-01-24T21:12:12+0000",
            "content": "Sorry if this spam's things, however it's unlikely that I'll work on these. ",
            "author": "Jason Rutherglen",
            "id": "comment-12985986"
        }
    ]
}