{
    "id": "LUCENE-7703",
    "title": "Record the version that was used at index creation time",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Improvement",
        "components": [],
        "fix_versions": [
            "7.0"
        ]
    },
    "description": "SegmentInfos already records the version that was used to write a commit and the version that was used to write the oldest segment in the index. In addition to those, I think it could be useful to record the Lucene version that was used to create the index. I think it could help with:\n\n\tDebugging: there are things that change based on Lucene versions, for instance we will reject broken offsets in term vectors as of 7.0. Knowing the version that was used to create the index can be very useful to know what assumptions we can make about an index.\n\tBackward compatibility. The codec API helped simplify backward compatibility of the index files a lot. However for everything that is done on top of the codec API like analysis or the computation of length norm factors, backward compatibility needs to be handled on top of Lucene. Maybe we could simplify this?",
    "attachments": {
        "LUCENE-7703.patch": "https://issues.apache.org/jira/secure/attachment/12853981/LUCENE-7703.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15878041",
            "date": "2017-02-22T11:32:54+0000",
            "content": "+1, I think this is important info for the index. ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-15878522",
            "date": "2017-02-22T15:51:56+0000",
            "content": "Thanks Mike for confirming it would be useful. So I gave it a try, see the attached patch. It should be fine for regular usage of IndexWriter with calls to add/updateDocument. However it is not totally clear to me how we should deal with addIndexes. For the one that takes a list of codec readers, I don't think there is much we can do anyway since the version is not exposed (and it would not make much sense anyway?). For the one that takes a list of directories, we could either reject the call if versions differ (this is what the patch is doing), or be lenient but this has the major drawback that any assumptions we might make based on the created version could break. Any opinions? ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-15883579",
            "date": "2017-02-24T21:44:20+0000",
            "content": "+1 to the patch. ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-15888099",
            "date": "2017-02-28T14:26:38+0000",
            "content": "Commit d9c0f2599d934766549b2566d7c0dd159c3af5c8 in lucene-solr's branch refs/heads/master from Adrien Grand\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d9c0f25 ]\n\nLUCENE-7703: Record the index creation version. ",
            "author": "ASF subversion and git services"
        }
    ]
}