{
    "id": "LUCENE-2799",
    "title": "MMapDirectory not designed for inheritance",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/store"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.0.3",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "How to reproduce\n\nTry to inherit from MMapDirectory to change the openInput logic (open files from different directories).\n\nExpected result:\n\nInherit from MMapDirectory, overwrite the one method, done.\n\nActual result:\n\nIt's impossible to overwrite the method as the inner classes would be missing. It's impossible to fork the inner classes as they depend on a final method with default visibility (cleanMapping).\nIt turns out to be the easiest option to completely for the code and replace just the method in question.\n\nPossible fix:\n\nChange the visibility of most members and subtypes to be at least protected and avoid the default visibility.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-12-04T22:20:17+0000",
            "content": "To change the openInput logic to map special files to other directories use e.g. FileSwitchDirectory or similar implementations with the delegation pattern. There is no need to extend MMapDirectory. ",
            "author": "Uwe Schindler",
            "id": "comment-12966864"
        },
        {
            "date": "2010-12-04T22:33:23+0000",
            "content": "I think it's always best to copy-paste stuff to your project and adapt it, in such cases.\nIt's simple, it doesn't break when you upgrade, it works with clumsily-built code.\n\nDesigning actual classes (not API interfaces, but fullblown working code) for inheritance is very complex. I've seen few people trying this for real, and even fewer succeeding. ",
            "author": "Earwin Burrfoot",
            "id": "comment-12966865"
        },
        {
            "date": "2010-12-04T22:35:00+0000",
            "content": "Ah, right, but FileSwitchDirectory won't solve my problems either as every file is in a different directory. A set of MMapDirectories + delegation might help here.\n\nBut it would still be nice if MMapDirectory would either be final or extension safe. Or if the implicit no-exension policy of openInput would be made explicit with a final tag. ",
            "author": "René Treffer",
            "id": "comment-12966866"
        }
    ]
}