{
    "id": "LUCENE-5095",
    "title": "Add useful toString()s to DocValues impls",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Task",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Currently, you have no insight into what these are doing (what kind of compression does your numerics have, how much RAM are the datastructures taking up, so on.\n\nSo I think we should add some cheap toString's (nothing heavy), things like\n\n\n@Override\npublic String toString() {\n  return \"Lucene42Numeric(compression=TABLE,bpv=\" + bitsPerValue)\";\n}\n\n\n\nand so on. Maybe we could think about printing them from CheckIndex when verbose=true too.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-07-06T20:16:26+0000",
            "content": "+1.  Not sure if Luke + Solr's Luke expose this either, but would be good to have them expose this info as well. ",
            "author": "Otis Gospodnetic",
            "id": "comment-13701403"
        },
        {
            "date": "2013-07-06T20:25:16+0000",
            "content": "I hesitate to pull docvalues + toString from such places, because they are lazy loaded and with some implementations could cause things to be loaded into RAM.\n\nbut I mentioned checkindex since its going to do this to verify them anyway... ",
            "author": "Robert Muir",
            "id": "comment-13701404"
        },
        {
            "date": "2013-07-07T14:36:28+0000",
            "content": "Actually, I would love if we exposed this kind of information in a structured way: not just a toString() method but rather something like optional methods returning -1 by default that could be used by people implementing formats to report on the disk and memory size used by their format. It is very common that users wonder about what is eating their disk or memory capacity and I feel like such monitoring methods would be very useful. ",
            "author": "Adrien Grand",
            "id": "comment-13701578"
        },
        {
            "date": "2013-07-07T14:54:05+0000",
            "content": "I strongly disagree with cluttering up these APIs with such implementation details: I'd rather do nothing than do that. The idea here is instead to give additional messages for human debugging.\n\nNumericDocValues for example has a simple API:\n\n  /**\n   * Returns the numeric value for the specified document ID.\n   * @param docID document ID to lookup\n   * @return numeric value\n   */\n  public abstract long get(int docID);\n\n\n\nIt needs nothing else: toString is already in the method signature: its perfect for this type of thing. ",
            "author": "Robert Muir",
            "id": "comment-13701580"
        }
    ]
}