{
    "id": "LUCENE-2429",
    "title": "A Rotating Split Policy For Managing Bounded Indices",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index",
            "modules/other"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "3.0.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "(Please note that the feature described in LUCENE-2425 is required reading for this issue.)\n\nA rotating split policy maintains a bounded set of sub-indices underneath the split index's directory. The motivation for such a policy is to be able to control the size of the index in a user-defined manner. It comes in handy in scenarios where (a) documents are added at a higher-than-normal rate, and (b) documents older than a certain cut-off date needn't be searchable. As a matter of fact, this policy is applicable to most real-time streams, given that they tend to satisfy both of the above properties.\n\nIn short, when the number of sub-indices hits the maximum allowed number (@see \n{@link ROTATING_POLICY_MAXIMUM_SUB_INDICES}\n), then this policy effectively forces the last sub-index out of the split index. A sub-index is deemed to be the last one if it is considered to be lesser (according to #getDirectoryComparator) than every other sub-index.\n\nThe exact point in time at which rotation occurs is determined by the split rule(s) in effect for this policy. For example, one may apply a scheduled split rule (see LUCENE-2427) if one wishes the split to occur at fixed intervals. For finer control over the periodicity of the interval, a cron split rule (see LUCENE-2428) may be employed.\n\nTo illustrate the behavior of the rotation policy policy, consider a split rule that triggers a split on the hour every hour. Furthermore, let's assume that the maximum number of sub-indices allowed is 7. In this case, the rotation policy will have no more than 8 hours worth of data (1 hour in the super-index and each of the 7 sub-indices).",
    "attachments": {
        "LUCENE-2429.patch": "https://issues.apache.org/jira/secure/attachment/12443411/LUCENE-2429.patch"
    },
    "issue_links": {},
    "comments": []
}