{
    "id": "LUCENE-7837",
    "title": "Use indexCreatedVersionMajor to fail opening too old indices",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Task",
        "components": [],
        "fix_versions": [
            "master (8.0)"
        ]
    },
    "description": "Even though in theory we only support reading indices created with version N or N-1, in practice it is possible to run a forceMerge in order to make Lucene accept to open the index since we only record the version that wrote segments and commit points. However as of Lucene 7.0, we also record the major version that was used to initially create the index, meaning we could also fail to open N-2 indices that have only been merged with version N-1.\n\nThe current state of things where we could read old data without knowing it raises issues with everything that is performed on top of the codec API such as analysis, input validation or norms encoding, especially now that we plan to change the defaults (LUCENE-7730).\n\nFor instance, we are only starting to reject broken offsets in term vectors in Lucene 7. If we do not enforce the index to be created with either Lucene 7 or 8 once we move to Lucene 8, then it means codecs could still be fed with broken offsets, which is a pity since assuming that offsets go forward makes things easier to encode and also potentially allows for better compression.",
    "attachments": {
        "LUCENE-7837.patch": "https://issues.apache.org/jira/secure/attachment/12868752/LUCENE-7837.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16015664",
            "date": "2017-05-18T12:23:35+0000",
            "content": "The attached patch shows what it would look like. We should do this as of 8.0 which will the first major version whose previous major version also records the index creation version. ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16017333",
            "date": "2017-05-19T12:35:20+0000",
            "content": "+1 ",
            "author": "David Smiley"
        },
        {
            "id": "comment-16073878",
            "date": "2017-07-04T16:20:36+0000",
            "content": "Here is an updated patch. I'd like to merge it soon if there are no objections. ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16074082",
            "date": "2017-07-04T21:10:12+0000",
            "content": "+1 LGTM ",
            "author": "Simon Willnauer"
        },
        {
            "id": "comment-16076617",
            "date": "2017-07-06T14:40:22+0000",
            "content": "Commit 43442a6354b911be51be601f035cdcb8fd072b50 in lucene-solr's branch refs/heads/master from Adrien Grand\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=43442a6 ]\n\nLUCENE-7837: Use indexCreatedVersionMajor to fail opening too old indices. ",
            "author": "ASF subversion and git services"
        }
    ]
}