{
    "id": "LUCENE-3950",
    "title": "load rat via ivy for rat-sources task",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/build"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "we now fail the build on rat problems (LUCENE-1866),\nso we should make it easy to run rat-sources for people\nto test locally (it takes like 3 seconds total for the whole trunk)\n\nAlso this is safer than putting rat in your ~/.ant/lib because that \nadds some classes from commons to your ant classpath (which we currently\nwrongly use in compile).",
    "attachments": {
        "LUCENE-3950.patch": "https://issues.apache.org/jira/secure/attachment/12536141/LUCENE-3950.patch",
        "LUCENE-3950-cachepath.patch": "https://issues.apache.org/jira/secure/attachment/12536195/LUCENE-3950-cachepath.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-04T14:59:05+0000",
            "content": "+1. I think this, license checks, CRLFs and other non-code things should be part of an integration test target. So that if you want to actually test code you can apply a filter and have a quick turnaround and for full integration tests you can fire them before the commit etc. ",
            "author": "Dawid Weiss",
            "id": "comment-13246323"
        },
        {
            "date": "2012-04-04T15:57:20+0000",
            "content": "\nSo that if you want to actually test code you can apply a filter and have a quick turnaround and for full integration tests you can fire them before the commit etc.\n\nFor this we should probably add a 'quiet' mode too for that purpose. rat-sources serves a double-duty, \nit also creates hugeish output for human review (since really for releasing thats required, its heuristical).\n\nBut we fail on \"unknown\" licenses which is safe, and detects the common case of 'forgot license header'. ",
            "author": "Robert Muir",
            "id": "comment-13246393"
        },
        {
            "date": "2012-07-11T23:20:40+0000",
            "content": "here's a patch, finally. ",
            "author": "Robert Muir",
            "id": "comment-13412347"
        },
        {
            "date": "2012-07-11T23:49:51+0000",
            "content": "I'm waiting to ensure I didn't totally hose hudson before removing its local jar file and marking this resolved. ",
            "author": "Robert Muir",
            "id": "comment-13412371"
        },
        {
            "date": "2012-07-12T07:00:03+0000",
            "content": "\n+    <typedef resource=\"org/apache/rat/anttasks/antlib.xml\" uri=\"antlib:org.apache.rat.anttasks\">\n       <classpath>\n-        <fileset dir=\".\" includes=\"rat*.jar\"/>\n+        <fileset dir=\"${common.dir}/tools/lib\" includes=\"apache-rat-0.8.jar\"/>\n       </classpath>\n     </typedef>\n\n\n\nI don't like this duplication of version numbers in ivy and ant files. I think it'd be nicer to use ivy's fileset or path to resolve these JARs if they're not part of the distribution?  ",
            "author": "Dawid Weiss",
            "id": "comment-13412568"
        },
        {
            "date": "2012-07-12T08:23:54+0000",
            "content": "I had the same problem with this commit, but I remember that Robert said, there was actually a problem with RAT running from <ivy:cachepath/>. I would also really prefer to have this one only in cache, as we dont ship with this tool, so we dont have to take care of license,... We use all tasks from cachepatch (pegdown for converting markdown->HTML, cpptasks,...).\n\nSide note: I am thinking about adding clover, too. The required license file can be shipped together with our src package in the tools directory (Atlassian allowed this to the ASF, because the license only allows to check org.apache.* packages) and clover-2.6.1.jar can be downloaded via Ivy. ",
            "author": "Uwe Schindler",
            "id": "comment-13412605"
        },
        {
            "date": "2012-07-12T08:49:47+0000",
            "content": "> but I remember that Robert said, there was actually a problem with RAT running from <ivy:cachepath/>\n\nRobert you recall what was that problem? ",
            "author": "Dawid Weiss",
            "id": "comment-13412611"
        },
        {
            "date": "2012-07-12T09:17:04+0000",
            "content": "Hi, I reopen, as it works with cachepath. No fckd up lib folder with tools we dont need for compile. It is now behaving identical to cpptasks, junit, pegdown, maven-ant-tasks and all other build-tools. No License checks required. ",
            "author": "Uwe Schindler",
            "id": "comment-13412624"
        },
        {
            "date": "2012-07-12T09:19:50+0000",
            "content": "Patch. Works fine on different machines. I have no RAT in my .lib folder, maybe that was Robert's problem (conflict with cachepath)? ",
            "author": "Uwe Schindler",
            "id": "comment-13412630"
        },
        {
            "date": "2012-07-12T10:27:25+0000",
            "content": "\nRobert you recall what was that problem?\n\nI think the problem was i tried to use the fine grained maven artifacts (rat-core + rat-tasks)\n\nusing the big 'rat' jar with all its dependencies in one thing works great, and if it works on cachepath, even better.\n\ni dont care about actual jars, just that the task works  ",
            "author": "Robert Muir",
            "id": "comment-13412674"
        },
        {
            "date": "2012-08-01T20:15:49+0000",
            "content": "This is already resolved in other issue. ",
            "author": "Uwe Schindler",
            "id": "comment-13426870"
        }
    ]
}