{
    "id": "LUCENE-2589",
    "title": "Add a variable-sized int block codec",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We already have support for fixed block size int block codecs, making it very simple to create a codec from a int encoder algorithms like FOR/PFOR.\n\nBut algorithms like Simple9/16 are not fixed – they encode a variable number of adjacent ints at once, depending on the specific values of those ints.",
    "attachments": {
        "LUCENE-2589.patch": "https://issues.apache.org/jira/secure/attachment/12451418/LUCENE-2589.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-08-06T10:56:22+0000",
            "content": "Attached patch.\n\nJust like for the fixed int block case, I added a MockVariableIntBlockCodec (in src/test), with a stupid variable-sized int block encoding.\n\nThese MockVariable/FixedIntBlockCodec serve as a good example of how one can take any low-level int encoder and turn it into a Lucene codec.\n\nI also increased randomness of the codecs picked for testing, by adding params like block size (for both fixed & variable mock intblock codecs) and the freq cutoff for Pulsing.  So these configurations are now also randomly picked when running tests (= spikes on the monster's back). ",
            "author": "Michael McCandless",
            "id": "comment-12896017"
        },
        {
            "date": "2010-08-08T15:13:05+0000",
            "content": "I want to make it possible to pass params to the test codecs, eg -Dtest.codecs=Pulsing(4) ",
            "author": "Michael McCandless",
            "id": "comment-12896367"
        },
        {
            "date": "2010-08-08T15:14:26+0000",
            "content": "Simple patch – uses regexp to parse out a single int param. ",
            "author": "Michael McCandless",
            "id": "comment-12896368"
        },
        {
            "date": "2010-08-08T18:50:23+0000",
            "content": "Simple patch - uses regexp to parse out a single int param.\nLooks good to me - makes sense to have the size configurable. I wonder if we should start some documentation either in src/test/../package.html or on the wiki which holds information about how we test and which properties are recognized in the unit test.\n\nThoughts? ",
            "author": "Simon Willnauer",
            "id": "comment-12896397"
        },
        {
            "date": "2010-08-08T19:13:44+0000",
            "content": "\nLooks good to me - makes sense to have the size configurable. I wonder if we should start some documentation either in src/test/../package.html or on the wiki which holds information about how we test and which properties are recognized in the unit test.\n\nActually i would prefer we just fix LuceneTestCase etc so that each test class has a single static random seed, then there would be less parameters. Then we can change the failure message to just say 'reproduce with -D....' and I think it would be best. ",
            "author": "Robert Muir",
            "id": "comment-12896402"
        },
        {
            "date": "2010-08-08T20:12:45+0000",
            "content": "Actually i would prefer we just fix LuceneTestCase etc so that each test class has a single static random seed, then there would be less parameters. Then we can change the failure message to just say 'reproduce with -D....' and I think it would be best.\n\nA single random seed per TestCase / Class would make things way easier IMO and I would agree that we should have that per Class. Nevertheless, would that deprecate all parameters? When I want to use randomized tests but need to force a certain codec that wouldn't work. Anyway, a documentation of whatever we do here would help people new to lucene to get started with patches and test. ",
            "author": "Simon Willnauer",
            "id": "comment-12896406"
        },
        {
            "date": "2010-08-08T21:19:37+0000",
            "content": "When I want to use randomized tests but need to force a certain codec that wouldn't work.\n\nYes it would, as random codec selection would be determined by the same random seed (so if you use the same seed, you force the same codec).\n\nAnyway, a documentation of whatever we do here would help people new to lucene to get started with patches and test.\n\nI dont think we should add a lot of documentation (which will only become obselete as i know i will be adding even more dimensions to the test ASAP). I think its better to simplify and use a single seed for selecting all parameters!  ",
            "author": "Robert Muir",
            "id": "comment-12896417"
        },
        {
            "date": "2010-08-09T10:30:40+0000",
            "content": "I think we should do both!  (Single static random seed and some basic docs about all the neat props our tests now accept...).  But I think these are separate issues?  I'll commit this one (enabling you to specify codec & its param on the ant command-line) shortly. ",
            "author": "Michael McCandless",
            "id": "comment-12896496"
        }
    ]
}