{
    "id": "LUCENE-3661",
    "title": "move deletes under codec",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "After LUCENE-3631, this should be easier I think.\n\nI haven't looked at it much myself but i'll play around a bit, but at a glance:\n\n\tSegmentReader to have Bits liveDocs instead of BitVector\n\taddress the TODO in the IW-using ctors so that SegmentReader doesn't take a parent but just an existing core.\n\twe need some type of minimal \"MutableBits\" or similar subinterface of bits. BitVector and maybe Fixed/OpenBitSet could implement it\n\tBitVector becomes an impl detail and moves to codec (maybe we have a shared base class and split the 3.x/4.x up rather than the conditional backwards)\n\tI think the invertAll should not be used by IndexWriter, instead we define the codec interface to say \"give me a new MutableBits, by default all are set\" ?\n\tredundant internally-consistent checks in checkLiveCounts should be done in the codec impl instead of in SegmentReader.\n\tplain text impl in SimpleText.",
    "attachments": {
        "LUCENE-3661.patch": "https://issues.apache.org/jira/secure/attachment/12512333/LUCENE-3661.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-12-21T10:52:31+0000",
            "content": "This sounds like a great plan!  So then the use of BitVector is an impl detail to the codec... ",
            "author": "Michael McCandless",
            "id": "comment-13174000"
        },
        {
            "date": "2012-01-19T17:14:10+0000",
            "content": "I started working on this some before christmas break, and just merged it up to trunk.\n\nIll commit it to a branch (branches/lucene3661) in case anyone wants to help. \n\nI don't think I really got much done yet, but it would be nice to make our codec api \nmore complete by including representation of deletions. ",
            "author": "Robert Muir",
            "id": "comment-13189208"
        },
        {
            "date": "2012-01-23T20:28:30+0000",
            "content": "So this is \"working\" in the branch (SimpleText deletes and stuff), but needs rounding out\nbefore committing, e.g. the API should not be so horrible and some documentation and such. ",
            "author": "Robert Muir",
            "id": "comment-13191422"
        },
        {
            "date": "2012-01-28T18:27:48+0000",
            "content": "Here's a patch showing the differences between branch and trunk.\n\nI think its ready: thanks to Mike for helping with a lot of the cleanup here. ",
            "author": "Robert Muir",
            "id": "comment-13195594"
        },
        {
            "date": "2012-01-28T18:34:56+0000",
            "content": "and also Simon for helping track down a tricky bug involving docvalues... maybe we \nshould open an issue later to try to make it more resilient just for future refactorings?  ",
            "author": "Robert Muir",
            "id": "comment-13195595"
        },
        {
            "date": "2012-01-28T19:08:01+0000",
            "content": "One thing: Can we not split the BitVector and LiveDocs in 3.x and trunk? Just because the logic is inverse in 3.x (deletions instead of live docs). This would also make the LiveDocs in trunk always have a codec header, but not in 3.x?\n\nOtherwise, looks great! ",
            "author": "Uwe Schindler",
            "id": "comment-13195604"
        },
        {
            "date": "2012-01-28T19:47:05+0000",
            "content": "We could, I think it would be mostly duplicate code at this point.\n\nBut, like stored fields (which is also shared), its just another TODO we can do later.\n\nDefinitely needs not block this issue (its unrelated). ",
            "author": "Robert Muir",
            "id": "comment-13195613"
        },
        {
            "date": "2012-01-28T21:25:23+0000",
            "content": "We should open issue, otherwise coomit that so I can work on splitting composite and atomic readers again! ",
            "author": "Uwe Schindler",
            "id": "comment-13195630"
        },
        {
            "date": "2012-01-28T23:15:45+0000",
            "content": "I'll open a followup issue (can be done in trunk after this is committed).\n\nJust for reference, there are 3 bitvector versions that can be read:\nunversioned/darkages: some 3.x versions\ncodec header version 0: some 3.x versions\ncodec header version 1: trunk\n\nso trunk always writes a versioned codec header, even lucene 3.5 always writes \na versioned codec header, but i think the 3.x codec must at least support\nunversioned files still for e.g. 3.0 indexes.\n\nalso, under the same issue we could maybe remove bitvector completely and the \ncodecs just use FastBitSet. there is no difference now that count() is unused.\n\nThis could be cleaner: just having different serialization forms for fastbitset. ",
            "author": "Robert Muir",
            "id": "comment-13195640"
        },
        {
            "date": "2012-01-29T11:29:39+0000",
            "content": "Merging this to trunk now...\n\nWe can use LUCENE-3613 issue for any remaining splitting of 4.x/3.x codec impls (stored fields, deletes). ",
            "author": "Robert Muir",
            "id": "comment-13195733"
        }
    ]
}