{
    "id": "LUCENE-6137",
    "title": "RussianLightStemmer incorrectly handles the words ending with 'ее'",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "4.10.2",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "Consider the forms of Russian word \"синий\" and the result returned by RussianLightStemmer:\n\nсиний -> син\nсиняя -> син\nсинее -> сине\nсиние -> син\n\nI think the correct result should be:\n\nсиний -> син\nсиняя -> син\nсинее -> син\nсиние -> син",
    "attachments": {
        "LUCENE-6137.patch": "https://issues.apache.org/jira/secure/attachment/12689092/LUCENE-6137.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14258660",
            "author": "Alexander Sofronov",
            "date": "2014-12-25T06:51:27+0000",
            "content": "Patch attached "
        },
        {
            "id": "comment-14258662",
            "author": "Alexander Sofronov",
            "date": "2014-12-25T06:59:10+0000",
            "content": "Also, I think it should be reasonable to include \"ие\" ending to the list of 2-chars endings. With current implementation it is processed in 2 steps: first \"е\" is removed in removeCase() and then \"и\" removed in normalize(). "
        },
        {
            "id": "comment-14258768",
            "author": "Robert Muir",
            "date": "2014-12-25T14:40:56+0000",
            "content": "Can you propose your changes to http://members.unine.ch/jacques.savoy/clef/index.html?\n\nLike snowball, these are just implementations of those algorithms. They have done tests and written papers and so on, and can better evaluate these changes. "
        },
        {
            "id": "comment-14258787",
            "author": "Uwe Schindler",
            "date": "2014-12-25T15:41:30+0000",
            "content": "Hi,\nI also agree you should raise this issue at the CLEF people who invented that stemmer!\n\nI talked with my wife (she has russian as mother language) and she can confirm your problem with some neutral adjective forms, but - as expected - she can confirm that removing \"-ee\" is too risky, because this would change also comparative form (also using -ee), too, which is not intended to be done by a \"light stemmer\". I think this might be the reason not to remove \"-ee\" by default (this changes meaning). "
        },
        {
            "id": "comment-14258922",
            "author": "Alexander Sofronov",
            "date": "2014-12-26T04:46:43+0000",
            "content": "OK, I sent email to Ljiljana Doalmic and Jacques Savoy. BTW, I found that Perl version of Russian stemmer (http://members.unine.ch/jacques.savoy/clef/russianStemmerPerl.txt) handles \"ее\" and \"ие\" endings properly. "
        },
        {
            "id": "comment-14262103",
            "author": "Alexander Sofronov",
            "date": "2014-12-31T10:55:59+0000",
            "content": "Just received confirmation from Jacques Savoy that this is a bug in Java version of stemmer. Waiting for the fix... "
        },
        {
            "id": "comment-14262117",
            "author": "Uwe Schindler",
            "date": "2014-12-31T11:36:06+0000",
            "content": "Hi, thanks for the response!\n\nIn any case, did you send a reference to this issue? I am not sure if the problems with comparative forms should be handled. "
        },
        {
            "id": "comment-14262559",
            "author": "Alexander Sofronov",
            "date": "2015-01-01T14:26:46+0000",
            "content": "Yes, I sent link to this issue. My opinion is that comparative forms should be stemmed also. Please note that comparative forms in Russian can have not only \"ее\" endings, but also \"ий\", \"ей\" and some other that listed in RussianLightStemmer.\n\nAlso, please take a look and Perl version of Russian light stemmer (http://members.unine.ch/jacques.savoy/clef/russianStemmerPerl.txt) which handles \"ее\" and \"ие\" endings properly. "
        }
    ]
}