{
    "id": "LUCENE-6154",
    "title": "nuke FilterDirectory.unwrap or make package-private",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "As Uwe points out, this is dangerous. The only thing using it is its test: TestFilterDirectory.testUnwrap() and IOUtils.spins().\n\nIf this method is implemented in some other way, we could remove it. otherwise maybe it can be package-private.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14262280",
            "author": "Robert Muir",
            "date": "2014-12-31T16:27:29+0000",
            "content": "One solution is to move IOUtils.spins() -> Directory.spins().\nThe current logic would move into the respective implementations (e.g. ramdirectory returns false always). The hairy one would go in FSDirectory.\n\nBut maybe it is not important enough to belong here and should remain a hack, instead the static method moved to the .store package. "
        },
        {
            "id": "comment-14262288",
            "author": "Uwe Schindler",
            "date": "2014-12-31T16:41:21+0000",
            "content": "Thanks for opening the issue!  was just afraid because I knew that Elasticsearch used it, too.\n\nFor the spins issue, I would prefer to have a geter on directory (non static). By that my own custom directory could return something useful. RAMDirectory, too. Or HDFSDirectory could return false, if it is able to ask Hadoop for the spinning flag. "
        },
        {
            "id": "comment-14262290",
            "author": "Uwe Schindler",
            "date": "2014-12-31T16:42:07+0000",
            "content": "Maybe one solution is to make Directory.spin() return \"true\" by default and not make it abstract? So nobody needs to implement it if he dont care about the optmization? "
        },
        {
            "id": "comment-14262296",
            "author": "Robert Muir",
            "date": "2014-12-31T16:44:03+0000",
            "content": "OK. I will make a try and we can see what it looks like. "
        },
        {
            "id": "comment-14262529",
            "author": "Michael McCandless",
            "date": "2015-01-01T11:07:03+0000",
            "content": "OK I agree: this method is dangerous, so we should remove it.  ES can do this on its own.\n\nFortunately it has not been released yet: I added it in LUCENE-6099. "
        }
    ]
}