{
    "id": "LUCENE-4299",
    "title": "No way to find term vectors options at read time",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The problem is simple:\n\n\tterm vectors can be configured \"per-field-per-document\", meaning for the \"body\" field, document 0 can have them, document 1 maybe doesnt at all, document 2 maybe has offsets (no positions), and so on. To me this is not a useful feature at all, no one has ever mentioned a single use case for this, and it just makes our code more complicated. but it is what it is (for this issue)\n\tthere is no way to discover these options for a field of a document, you have to do things like 'peek ahead' to see the first position of the first term is -1, or same for offsets (except worse, we used to allow anything in offsets so -1 might be an actual value). This makes the merging code really hairy, and tough on end consumers.\n\n\n\nSo I propose that instead of returning Terms for Vectors, we return VectorTerms (extends Terms), which just adds hasOffsets() and hasPositions(). e.g. lucene40 already knows this from the bits for the field/doc pair and just returns what it knows.",
    "attachments": {
        "LUCENE-4299.patch": "https://issues.apache.org/jira/secure/attachment/12540109/LUCENE-4299.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-08-09T20:20:32+0000",
            "content": "here's a prototype patch: all tests pass. \n\nIf we are ok with the idea, i can clean up the rest. ",
            "author": "Robert Muir",
            "id": "comment-13432114"
        },
        {
            "date": "2012-08-09T20:21:49+0000",
            "content": "I would also clean up the merging and checkindex code too... thats the worst and it would become a lot simpler here. ",
            "author": "Robert Muir",
            "id": "comment-13432115"
        },
        {
            "date": "2012-08-09T20:29:09+0000",
            "content": "an alternative is to add this information just to Terms, but then for postings its redundant with FieldInfos. So I don't know if thats any better. ",
            "author": "Robert Muir",
            "id": "comment-13432122"
        },
        {
            "date": "2012-08-09T21:51:06+0000",
            "content": "ok second idea seems simpler, just adding these to Terms: here's a patch.\n\nI didn't improve tv merging or checkindex yet. ",
            "author": "Robert Muir",
            "id": "comment-13432196"
        },
        {
            "date": "2012-08-09T22:38:21+0000",
            "content": "Updated patch: really simplifies the default TermVectorsWriter.merge impl. ",
            "author": "Robert Muir",
            "id": "comment-13432250"
        },
        {
            "date": "2012-08-09T22:48:29+0000",
            "content": "updated patch fixing a pretty big inefficiency in highlighter, because its hasPositions(termvectors) was inefficient before, it had to actually clone an indexinput, read term bytes, freqs, positions, offsets, just to see if the first pos was -1. ",
            "author": "Robert Muir",
            "id": "comment-13432269"
        },
        {
            "date": "2012-08-10T13:39:23+0000",
            "content": "added comparisons of these options in TestDuelingCodecs, and tried to simplify CheckIndex (only slightly) since we know these values up front.\n\nI think this is ready. ",
            "author": "Robert Muir",
            "id": "comment-13432728"
        },
        {
            "date": "2013-05-10T10:34:19+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654184"
        }
    ]
}