{
    "id": "LUCENE-2679",
    "title": "IndexWriter.deleteDocuments should have option to not apply to docs indexed in the current IW session",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "In LUCENE-2655 we are struggling with how to handle buffered deletes,\nwith the new per-thread RAM buffers (DWPT).\n\nBut, the only reason why we must maintain a map of del term -> current\ndocID (or sequence ID) is to correctly handle the interleaved adds &\ndeletes case.\n\nHowever, I suspect that for many apps that interleaving never happens.\nIe, most apps delete only docs from before the last commit or NRT\nreopen.  For such apps, we don't need a Map... we just need a Set of\nall del terms to apply to past segments but not to the currently\nbuffered docs.\n\nAnd, importantly, with LUCENE-2655, this would be a single Set, not\none per DWPT.  It should be a a healthy RAM reduction on buffered\ndeletes, and should make the deletes call faster (add to one set instead of\nN maps).\n\nWe of course must still support the interleaved case, and I think it\nshould be the default, but I think we should provide the option for\nthe common-case apps to take advantage of much less RAM usage.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-07-23T18:44:22+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716931"
        },
        {
            "date": "2014-03-28T14:36:24+0000",
            "content": "I actually have \"interleaved adds & deletes \" and it fails kind of randomly. There is any work around i can use? ",
            "author": "Rodrigo Vega",
            "id": "comment-13950785"
        },
        {
            "date": "2014-03-28T14:43:39+0000",
            "content": "It should not fail, it should work.  Can you post a test case to the Lucene user's (java-user@lucene.apache.org) list? ",
            "author": "Michael McCandless",
            "id": "comment-13950793"
        },
        {
            "date": "2014-04-16T12:54:55+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970923"
        }
    ]
}