{
    "id": "LUCENE-2030",
    "title": "CachingSpanFilter synchronizing on a none final protected object",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.0"
        ],
        "affect_versions": "2.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "CachingSpanFilter and CachingWrapperFilter expose their internal cache via a protected member which is lazily instantiated in the getDocSetId method. The current code yields the chance to double instantiate the cache and internally synchronizes on a protected none final member. My first guess is that this member was exposed for testing purposes so it should rather be changed to package private. \n\nThis patch breaks backwards compat while I guess the cleanup is kind of worth breaking it.",
    "attachments": {
        "LUCENE-2030.patch": "https://issues.apache.org/jira/secure/attachment/12424040/LUCENE-2030.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-11-05T03:05:09+0000",
            "content": "This patch breaks serialization because the de-serializer does not call ctors and so the cache keeps unintialized (=null). ",
            "author": "Uwe Schindler",
            "id": "comment-12773758"
        },
        {
            "date": "2009-11-05T03:21:53+0000",
            "content": "Fixed patch. ",
            "author": "Uwe Schindler",
            "id": "comment-12773761"
        },
        {
            "date": "2009-11-05T07:30:44+0000",
            "content": "Uwe, I'm so glad that you are so keen on stuff like Java serialization! Thanks ",
            "author": "Simon Willnauer",
            "id": "comment-12773814"
        },
        {
            "date": "2009-11-06T22:27:19+0000",
            "content": "New patch. The previous one had the problem, that it also blocked during creating the Filter/SpanResult. Now it only locks correctly before creating the WeakHashMap at all and when requesting/putting entries. The only problem is, that two threads may create the same DocIdSet at the same time because of cache miss, but that is not a problem at all for correct behaviour. ",
            "author": "Uwe Schindler",
            "id": "comment-12774452"
        },
        {
            "date": "2009-11-08T19:06:21+0000",
            "content": "New patch that uses ReentrantLock from Java5's concurrent package. This lock is serializable. All tests pass, will commit soon. ",
            "author": "Uwe Schindler",
            "id": "comment-12774811"
        },
        {
            "date": "2009-11-08T21:46:32+0000",
            "content": "Committed revision: 833934 ",
            "author": "Uwe Schindler",
            "id": "comment-12774829"
        }
    ]
}