{
    "id": "LUCENE-125",
    "title": "Please increase the default size of HTMLParser summaries or make it ignore graphic's Alt text",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/other"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "At the top of every page, I have some header graphics w/ Alt text.  The problem\nis that the HTMLParser stores this Alt text in the summary and it shouldn't (all\ngraphics are supposed to have Alt text according to accessibility rules); maybe\nthere should be an option to disable storing Alt text since Lucene has always\ndone this.\n\nEven if this is fixed, each of my web pages has a header on the page.  Ideally,\nthe summary generator should ignore <Hx> tags (H1, H2, etc.) as well.  The\nheader text is the same as the <title> text for the page.  This header ends up\nin the summary as well as the link (the link is the title), so it's wasted space.\n\nThe end result is that I end up trimming off the first part of the summaries\nthat I get via getParser before storing it in the Lucene index.  In the\nHTMLParser.java file in src\\demo\\org\\apache\\lucene\\demo\\html, the SUMMARY_LENGTH\nis set to 200, so this effectively is only about 100 for me.  \n\nJust wanted to give you some feedback instead of just grabbing the source and\nmaking my own version of this...\n\nThis is in 1.3RC3",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2004-04-03T20:38:00+0000",
            "content": "Remember that the HTML Parser is just a demo. I think these requests are much \ntoo specific for a demo, so I'll close the bug report unless the Lucene \ncommitters disagree. \n ",
            "author": "Daniel Naber",
            "id": "comment-12321343"
        },
        {
            "date": "2004-04-03T23:31:51+0000",
            "content": "I agree it's a demo, but these are fairly minor changes that would make it more\nusable.  Demos don't have to be static once they are in the source tree... ",
            "author": "Ken Yee",
            "id": "comment-12321344"
        }
    ]
}