{
    "id": "LUCENE-4010",
    "title": "AttributeSource api has broken documentation due to java generics bug",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/javadocs"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "There seems to be a javadocs generation bug, whereby generic type params are not properly escaped.  So if you use <A> as a type param (which we do in AttributeSource.java), it produces invalid HTML.  The bug seems to be fixed in java 7...\n\nYou can see the bug here (search for \"after adding\"):\n\n    http://lucene.apache.org/core/old_versioned_docs/versions/3_5_0/api/all/org/apache/lucene/util/AttributeSource.html\n\nThe <A> generic type is gone, and that closing paren is red but should be blue.\n\nThe 3.6.0 javadocs are OK because we used java7 to generate them...\n\nI think we should avoid <A> to workaround it until we are on java 7...",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-22T17:20:41+0000",
            "content": "\nThe 3.6.0 javadocs are OK because we used java7 to generate them...\n\nWell not totally ok. Only OK on the website. The ones actually included in the release were generated\nwith Java 5 (because i didnt want anything but a java5 compiler coming anywhere near the actual artifacts).\n\nThe website javadocs were separately regenerated with java7: http://wiki.apache.org/lucene-java/HowToGenerateNiceJavadocs ",
            "author": "Robert Muir",
            "id": "comment-13259184"
        },
        {
            "date": "2012-04-22T18:29:59+0000",
            "content": "I checked it, it always produces invalid HTML, you can use any type param you want. Same happens with <B>,... We should simply remove the @link and never use @link pointing to anything that uses generics. ",
            "author": "Uwe Schindler",
            "id": "comment-13259210"
        },
        {
            "date": "2012-04-23T13:29:57+0000",
            "content": "Hmm, true.\n\nBut I think never linking to any API w/ generics is insanity (the cure is worse than the bug..).  At least, the link works (it's just that the link text is missing the type param).\n\nSo I think this is a WONTFIX...? ",
            "author": "Michael McCandless",
            "id": "comment-13259598"
        }
    ]
}