{
    "id": "LUCENE-3865",
    "title": "MemoryIndex does not allow user to add multiple values for a single field name",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/other"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "affect_versions": "3.5",
        "resolution": "Duplicate",
        "status": "Closed"
    },
    "description": "When using MemoryIndex.addField the following operation throws an IllegalArgumentException:\n\nindex.addField(\"foobar\", \"value1\", LuceneAnalyzer); \nindex.addField(\"foobar\", \"value2\", LuceneAnalyzer); \n\nThis throws:\njava.lang.IllegalArgumentException: field must not be added more than once\n\nAccording to Uwe Schindler on the java-user mailing list this violates the IndexWriter/IndexReader contract.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-03-12T15:50:26+0000",
            "content": "Thanks for opening this, I will have a look into this. If I am able to fix this easily, I will assign myself! ",
            "author": "Uwe Schindler",
            "id": "comment-13227628"
        },
        {
            "date": "2012-09-03T13:18:51+0000",
            "content": "Is MemoryIndex still a relevant way of doing Prospective Search? I see a couple of other issues that talk about using a regular IndexWriter with a MemoryCodec.\n\nI myself am also looking for a way to do Prospective Search — I'd like to push documents into both Apache Solr (general search) and something like MemoryIndex (for alerting a large number of users instantly.) I've implemented it to the point where I have a Solr IndexSchema to provide me with the same Analyzers as the ones the Apache Solr instance has, but now I'm running into the issue that MemoryIndex does not support multiple fields and only supports String-valued elements (less of an issue than the lack of multiple-field support) .. Should I make an effort to try and add multiple-field support to MemoryIndex or should I look towards another way of achieving the same?  ",
            "author": "Jasper van Veghel",
            "id": "comment-13447263"
        },
        {
            "date": "2012-10-30T06:39:50+0000",
            "content": "An option to delete fields would also be useful.\n\nDoes this mean that RAMDirectory is still alright to use for small data sets? ",
            "author": "Ashwin Jayaprakash",
            "id": "comment-13486687"
        },
        {
            "date": "2012-11-04T19:42:27+0000",
            "content": "included in LUCENE-4515 ",
            "author": "Simon Willnauer",
            "id": "comment-13490278"
        },
        {
            "date": "2013-05-10T10:33:14+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13653867"
        }
    ]
}