{
    "id": "LUCENE-5229",
    "title": "remove Collector specializations",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "There are too many collector specializations (i think 16 or 18?) and too many crazy defaults like returning NaN scores to the user by default in indexsearcher.\n\nthis confuses hotspot (I will ignore any benchmarks posted here where only one type of sort is running thru the JVM, thats unrealistic), and confuses users with stuff like NaN scores coming back by default.\n\nI have two concerete suggestions:\n\n\n\tnuke doMaxScores. its implicit from doScores. This is just over the top. This should also halve the collectors.\n\tchange doScores to true by default in indexsearcher. since shai was confused by the NaNs by default, and he added this stuff to lucene, that says everything about how wrong this default is. Someone who does understand what it does can simply pass false.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-09-20T15:43:03+0000",
            "content": "nuke doMaxScores. its implicit from doScores\n\n+1, if you ask to compute scores, you might as well get maxScore. I doubt that specialization is so important.\n\nchange doScores to true by default in indexsearcher\n\nI'm not sure about it. I wasn't confused by the fact that I received NaN, only pointed out that when you use Expression, the result is not in the 'score' field, but the 'field' field. I think that in most cases, if you sort, you're interested in the sort-by value, not the score. Not sure if it buys performance or not, but I think it's just redundant work. ",
            "author": "Shai Erera",
            "id": "comment-13773097"
        },
        {
            "date": "2013-09-20T15:48:35+0000",
            "content": "\nI wasn't confused by the fact that I received NaN, only pointed out that when you use Expression, the result is not in the 'score' field, but the 'field' field.\n\nYou invoked IndexSearcher.search(query, filter, n, Sort) and you were surprised that the result of the sort goes there?\n\nI think this kinda stuff only furthers to reinforce my argument that this stuff is way too specialized and complicated. ",
            "author": "Robert Muir",
            "id": "comment-13773108"
        },
        {
            "date": "2013-09-20T16:52:26+0000",
            "content": "\n    nuke doMaxScores. its implicit from doScores\n\n+1, if you ask to compute scores, you might as well get maxScore. I doubt that specialization is so important.\n\nI will split off a subtask for this since I dont think its controversial. I at least want to make some progress on this. Removing confusing booleans from the API of indexsearcher is also huge to me: and this will take care of one. ",
            "author": "Robert Muir",
            "id": "comment-13773171"
        }
    ]
}