{
    "id": "LUCENE-770",
    "title": "CfsExtractor tool",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "2.1",
        "resolution": "Not A Problem",
        "status": "Resolved"
    },
    "description": "A tool for extracting the content of a CFS file, in order to go from a compound index to a multi-file index.\nThis may be handy for people who want to go back to multi-file index format now that field norms are in a single file - LUCENE-756.\n\nMost of this code already existed and was hiding in IndexReader.main.\n\nI'll commit tomorrow, unless I hear otherwise.  I think I should also remove IndexReader.main then.  Ja?",
    "attachments": {
        "LUCENE-770.patch": "https://issues.apache.org/jira/secure/attachment/12348718/LUCENE-770.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-12-20T21:24:47+0000",
            "content": "I think there's a small issue which is also in IndexReader.main: the javadoc claims that you need to copy the segments files to make the extracted index work, but that's not enough, you will also need to modify the segments file because it contains the information whether the index is in compound format or not. ",
            "author": "Daniel Naber",
            "id": "comment-12553778"
        },
        {
            "date": "2007-12-24T05:07:06+0000",
            "content": "I haven't touched this tool since I put it together.  If you are using it, Daniel, got a patch? ",
            "author": "Otis Gospodnetic",
            "id": "comment-12554215"
        },
        {
            "date": "2007-12-26T11:07:07+0000",
            "content": "Otis, I've used it just once and noticed the problem. I'm not sure how to fix this problem, I could of course just change the javadoc. But telling people to use a hex editor to change some files isn't really a nice solution. ",
            "author": "Daniel Naber",
            "id": "comment-12554405"
        },
        {
            "date": "2011-01-25T15:33:45+0000",
            "content": "In my opinion, this tool is not needed and does not really help, because it would not de-compound an index successfully.\n\nThe correct way to decompound is:\nCreate a new IndexWriter on a empty directory, set CFS to off and then use addIndexes(IndexReader...) to force a merge over to the new dir. ",
            "author": "Uwe Schindler",
            "id": "comment-12986438"
        }
    ]
}