{
    "id": "LUCENE-3604",
    "title": "3x/lucene/contrib/CHANGES.txt has two \"API Changes\" subsections for 3.5.0",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "3.5"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "There are two \"API Changes\" sections which is confusing when looking at the txt version of the file. \nThe HTML expands only the first of the two, unless expand-all is clicked.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-11-28T09:09:51+0000",
            "content": "Fixed the 3x file in r1207018 - ordering the \"API Changes\" entries by their date (by svn log).\nKeeping open for fixing the Changes.html that already appears in the Web site. ",
            "author": "Doron Cohen",
            "id": "comment-13158306"
        },
        {
            "date": "2011-11-28T09:27:06+0000",
            "content": "I looked at \"HowToUpdateTheWebSite\" but still do not understand how to update the contrib/Changes.html that appears in the main Web site. \n\nIs it a 'versioned' or 'unversioned' that should be changed? \n\nI think it is the 'versioned' but then I don't understand the instructions in that wiki page: an example with 3.4.1 requires to 'svn co trunk', is this real?\n\nSo better if this is handled by someone who knows his way around this process. ",
            "author": "Doron Cohen",
            "id": "comment-13158314"
        },
        {
            "date": "2011-11-28T17:13:40+0000",
            "content": "Would anybody object to including these changes on the lucene_solr_3_5 branch, then moving the lucene_solr_3_5_0 tag?  Uwe fixed another CHANGES.txt issue on the branch, so moving the tag would also include that fix. ",
            "author": "Steve Rowe",
            "id": "comment-13158574"
        },
        {
            "date": "2011-11-28T17:17:28+0000",
            "content": "Moving the tag is a bad idea, we should maybe add another TAG named \"post_3_5_0_release_docchanges\" as we cannot modify the TARGZs anymore on release servers. Once we get 3.5.1 out we can use the branch but update the webpages with the above tag? ",
            "author": "Uwe Schindler",
            "id": "comment-13158579"
        },
        {
            "date": "2011-11-28T17:21:23+0000",
            "content": "we should maybe add another TAG named \"post_3_5_0_release_docchanges\" [and then] update the webpages with the above tag?\n\n+1 ",
            "author": "Steve Rowe",
            "id": "comment-13158582"
        },
        {
            "date": "2011-11-28T20:19:37+0000",
            "content": "I merged Doron's changes to the lucene_solr_3_5 branch, then created a new tag: https://svn.apache.org/repos/asf/lucene/dev/tags/post_3_5_0_release_doc_changes.  I'll work on updating the Lucene website to be built from this tag. ",
            "author": "Steve Rowe",
            "id": "comment-13158720"
        },
        {
            "date": "2011-11-28T22:46:11+0000",
            "content": "I ran ant changes-to-html from lucene/ on the tip of the lucene_solr_3_5 branch (same as the new tag), then copied the resulting Changes.html to people.apache.org:/www/lucene.apache.org/java/3_5_0/changes/.  The new version will show up on the website once the periodic resync happens. ",
            "author": "Steve Rowe",
            "id": "comment-13158887"
        },
        {
            "date": "2011-11-28T23:11:06+0000",
            "content": "Uwe pointed out on #lucene-dev that I also needed to copy over the resulting Contrib-Changes.html - that's where Doron's changes are - to the versioned website.  I've done that now. ",
            "author": "Steve Rowe",
            "id": "comment-13158911"
        },
        {
            "date": "2011-11-29T04:40:10+0000",
            "content": "Thanks for taking care of this Steven. I think it will be good to update the Wiki page as well (\"HowToUpdateTheWebsite\"), because if I read the instructions there, they don't mention running \"ant changes-to-html\" and/or copy the result to people.apache.org. Did you run \"forrest site\" (that's what the instructions say)?\n\nWould you mind updating the Wiki page with the steps that you've done, so that next time we can do it ourselves? ",
            "author": "Shai Erera",
            "id": "comment-13159080"
        },
        {
            "date": "2011-11-29T05:10:00+0000",
            "content": "The new version will show up on the website once the periodic resync happens.\n\n3.5-contrib-changes now shows the correct API changes. Thanks Steven! ",
            "author": "Doron Cohen",
            "id": "comment-13159086"
        },
        {
            "date": "2011-11-29T13:41:00+0000",
            "content": "Shai,\n\nI updated both the ReleaseTodo and the HowToUpdateTheWebsite wiki pages to be more explicit about how the versioned website is produced and populated.\n\nI did not regenerate the Forrest site, nor did I reproduce the javadocs, because the changes were restricted to the CHANGES.txt files.\n\nThe HTML-formatted CHANGES files are produced by ant package, which runs the changes-to-html and javadocs targets and combines their results with the Forrest-generated site under the docs/ directory in the binary release package. ",
            "author": "Steve Rowe",
            "id": "comment-13159269"
        },
        {
            "date": "2011-11-29T13:51:54+0000",
            "content": "Thanks. It's clear now ! ",
            "author": "Shai Erera",
            "id": "comment-13159270"
        }
    ]
}