{
    "id": "LUCENE-7774",
    "title": "Allow BKDWriter buffer sizes to be configurable",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Won't Fix",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Improvement",
        "components": [],
        "fix_versions": []
    },
    "description": "BKDWriter has a 16Mb internal buffer it uses for sorting points, which then spills over to on-disk sorting if there are too many values.  The difference in performance between in-buffer and on-disk sorting is pretty stark, and it would be nice to make this buffer size configurable so that users can choose to use more RAM during indexing to speed things up.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15962616",
            "date": "2017-04-10T09:03:48+0000",
            "content": "I started to play with a patch for this, but it turns out to be a bit tricky, as the BKDWriter is an implementation detail of the Lucene60PointsWriter, and we don't have an easy way to pass configuration parameters to Codecs.  So this is mainly a discussion JIRA at the moment.  Michael McCandless do you have any thoughts? ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-15962717",
            "date": "2017-04-10T11:08:24+0000",
            "content": "I think it would be better to speed up e.g. offlinesorter or whatever so that large amounts of ram are not necessary here? ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-15962939",
            "date": "2017-04-10T14:22:13+0000",
            "content": "We were able to achieve significant gains by switching to radix sort (LUCENE-7306, see annotation O at http://people.apache.org/~mikemccand/geobench.html#index-times) for the in-memory part. Maybe we should explore doing something similar for offline sorting? ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-15964413",
            "date": "2017-04-11T14:06:49+0000",
            "content": "Maybe we should explore doing something similar for offline sorting?\n\n+1\n\nThe Lucene60PointsWriter]} ctor already accepts {{maxMBSortInHeap, which it passes onto BKDWriter, so users could make a custom codec changing this setting themselves? ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-15974538",
            "date": "2017-04-19T12:22:54+0000",
            "content": "users could make a custom codec changing this setting themselves?\n\nOf course, this is the obvious short-term fix!  Thanks Mike.\n\nImproving the offline sorter would be great, but I'm not going to have time to look at it for now, so I'll close this issue and that can be dealt with elsewhere. ",
            "author": "Alan Woodward"
        }
    ]
}