{
    "id": "LUCENE-7701",
    "title": "Refactor grouping collectors",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Improvement",
        "components": [],
        "fix_versions": [
            "7.0"
        ]
    },
    "description": "Grouping currently works via abstract collectors, which need to be overridden for each way of defining a group - currently we have two, 'term' (based on SortedDocValues) and 'function' (based on ValueSources).  These collectors all have a lot of repeated code, and means that if you want to implement your own group definitions, you need to override four or five different classes.\n\nThis would be easier to deal with if instead the 'group selection' code was abstracted out into a single interface, and the various collectors were changed to concrete implementations.",
    "attachments": {
        "LUCENE-7701.patch": "https://issues.apache.org/jira/secure/attachment/12853735/LUCENE-7701.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15875886",
            "date": "2017-02-21T12:11:13+0000",
            "content": "Here's a patch implementing the idea.  Group definitions are delegated to a GroupSelector class, with the following methods:\n\n\n\tvoid setNextReader(LeafReaderContext ctx) - called per-segment\n\tState advanceTo(int doc) - advance the selector to a given doc.  State can be one of VALUE or SKIP\n\tT currentValue() - get the current group value\n\tT copyValue() - get a persistent copy of the current group value\n\tvoid setGroups(Collection<SearchGroup<T>> groups) - called to change the selector to 'second-pass' mode.  advanceTo(int) will return SKIP if the currentValue is not in one of these groups.\n\n\n\nThere are two implementations of this, TermGroupSelector and ValueSourceGroupSelector, replacing the current term and function package Collectors.  \n\nThe patch converts FirstPass, AllGroups, AllGroupHeads and SecondPassCollectors.  I haven't yet worked on the DistinctValues or GroupFacet collectors, but they should be convertible in the same way. ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-15949653",
            "date": "2017-03-30T19:27:32+0000",
            "content": "This patch also refactors the second-pass collector into a concrete class that accepts a GroupReducer.  GroupReducers return a Collector instance for each group that is to be reduced, so for example the TopGroupsCollector will create a TopDocsCollector for each group.\n\nNow if you want to create a new type of group (a set of ranges over a DoubleValuesSource, for example) you just need to create a GroupSelector implementation; and if you want to create a new type of group summarizer (say some statistics over a group), then you create a GroupReducer implementation.\n\nThere's a failing test in Solr that I still need to track down, but I think this is a much nicer grouping interface.  It is not at all backwards compatible, so I'd be targeting this at 7.0.  cc Martijn van Groningen ",
            "author": "Alan Woodward"
        },
        {
            "id": "comment-15950977",
            "date": "2017-03-31T14:13:56+0000",
            "content": "Sorry for the late reply Alan Woodward! I general I agree with this refactoring. It is a better design. I'll look more closely at this patch next week. ",
            "author": "Martijn van Groningen"
        },
        {
            "id": "comment-15960652",
            "date": "2017-04-07T11:53:54+0000",
            "content": "+1 I think this is a good change. I agree it should 7.0 only. ",
            "author": "Martijn van Groningen"
        },
        {
            "id": "comment-15962680",
            "date": "2017-04-10T10:11:52+0000",
            "content": "Commit caf329717ef643b2a5a8b7ef0bfb7bd5e096c849 in lucene-solr's branch refs/heads/master from Alan Woodward\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=caf3297 ]\n\nLUCENE-7701: Refactor grouping collectors ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-15962681",
            "date": "2017-04-10T10:12:26+0000",
            "content": "Thanks for the review Martijn! ",
            "author": "Alan Woodward"
        }
    ]
}