{
    "id": "LUCENE-7589",
    "title": "Prevent outliers from raising the number of bits of everyone with numeric doc values",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Improvement",
        "components": [],
        "fix_versions": [
            "7.0"
        ]
    },
    "description": "Today we encode entire segments with a single number of bits per value. It was done this way because it was faster, but it also means a single outlier can significantly increase the space requirements. I think we should have protection against that.",
    "attachments": {
        "LUCENE-7589.patch": "https://issues.apache.org/jira/secure/attachment/12842582/LUCENE-7589.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15735788",
            "date": "2016-12-09T16:57:40+0000",
            "content": "Here is a patch. The doc values consumer computes space usage both for the case that all values use the same number of bits per value and for the case that values are split into blocks of 16384 values. And if using blocks proves to save 10% disk usage or more, then it encodes blocks with their own required number of bits per value.\n\nI kept a rather high value of the block size, since this impl can only jump forward blockSize documents at a time, so a high value like 16384 hopefully keeps performance good, but in the future we might want to look into leveraging the sequential access pattern even more (to do run-length encoding for instance) and maybe have eg. a skip list to handle the big jumps, like postings do. I think that patch is a good first (baby) step towards that direction. ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-15736776",
            "date": "2016-12-10T00:17:24+0000",
            "content": "The patch looks great, just this minor typo:\n\n{{ values for te next block.}} --> {{ values for the next block.}}\n\nThis seems to give ~3.7% reduction in the doc values disk used for sparse taxis! ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-15741431",
            "date": "2016-12-12T09:27:25+0000",
            "content": "Thanks Mike for having a look. The patch does not show much reduction in spite of the quality issues of the dataset since existing fields tend to not have outliers. However if you add a new field that stores the average number of miles per hour as a long doc values field, then it highlights the quality issues of this dataset and disk usage for this field goes from 40 to 15.7 bits per value (-60%) with the patch. ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-15741566",
            "date": "2016-12-12T10:28:01+0000",
            "content": "However if you add a new field that stores the average number of miles per hour as a long doc values field, then it highlights the quality issues of this dataset and disk usage for this field goes from 40 to 15.7 bits per value (-60%) with the patch.\n\nAhhh, I see!  The taxis that go faster than the speed of light are not apparent now since we don't store that field directly... makes sense. ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-15751785",
            "date": "2016-12-15T16:24:35+0000",
            "content": "Commit 3b182aa2fb3e4062f6ec5be819f3aa70aa2e523d in lucene-solr's branch refs/heads/master from Adrien Grand\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=3b182aa ]\n\nLUCENE-7589: Prevent outliers from raising the bpv for everyone. ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-15754558",
            "date": "2016-12-16T14:29:42+0000",
            "content": "Like Mike predicted, this helped the NYC taxi bench a bit, Disk usage for the dropoff datetime field went from 194MB to 166MB: http://people.apache.org/~mikemccand/lucenebench/sparseResults.html#index_size_by_field\n ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-15761076",
            "date": "2016-12-19T12:51:47+0000",
            "content": "Commit 3b182aa2fb3e4062f6ec5be819f3aa70aa2e523d in lucene-solr's branch refs/heads/feature/metrics from Adrien Grand\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=3b182aa ]\n\nLUCENE-7589: Prevent outliers from raising the bpv for everyone. ",
            "author": "ASF subversion and git services"
        }
    ]
}