{
    "id": "LUCENE-2350",
    "title": "Refactor/Cleanup Lucene Spatial",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "Lucene spatial needs a lot of work.  We should clean it up and allow for people to use different distances (i.e. don't assume Haversine), etc.  We should also merge the Solr and Lucene code into a single lib, where possible (starting w/ Distance Utils).   Update the distance filter to allow for pluggable distance measures. \n\nAlso do things like not assume everything is in degrees (users may already store radians, for instance) and use constants for conversions/multiplications instead of division.\n\n End goal:  No more experimental status.  Clean up the APIs, use the more common nomenclature for \"tiers\" and be consistent across Lucene and Solr.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-03-26T14:37:30+0000",
            "content": "+1\n\nMost of my patches for Spatial are doing this very work.  I will connect them all here and we can go through what still needs work. ",
            "author": "Chris Male",
            "id": "comment-12850155"
        },
        {
            "date": "2010-03-26T14:39:02+0000",
            "content": "Linking LUCENE-2148 which guts and cleans up the geometry shape classes in Spatial, reducing them down to the core of Point, Rectangle and LatLng. ",
            "author": "Chris Male",
            "id": "comment-12850156"
        },
        {
            "date": "2010-03-26T14:43:52+0000",
            "content": "Linking LUCENE-2151, which abstracts the distance calculation process.  GeoDistanceCalculators accept 2 points, and are left to calculate the distance themselves.  This means you can use Harversine, or whatever other distance algorithm you like.\n\nThis implementation includes what I call the ArcGeoDistanceCalculator, which uses Harversine and thus could be renamed, and PlaneGeoDistanceCalculator which assumes the points are on a flat plane and uses simple trigonometry. ",
            "author": "Chris Male",
            "id": "comment-12850158"
        },
        {
            "date": "2010-03-26T14:54:19+0000",
            "content": "Linking LUCENE-2152, which abstracts the distance filtering process, and index formats.\n\nCurrently the 2nd step in Spatial's filtering algorithm, calculates the distance between the central point and each document that has passed the tier filtering stage.  This patch abstracts this 2nd step, allowing for different implementations.  Included is a multi-threaded implementation which I use for large result sets.\n\nEqually, the existing filtering algorithm is replicated twice, once for 2 field lat/lng configuration, and once for geohashes.  This patch abstracts the index format away, allowing it to be implemented in whatever fashion, as long as it can be decoded into a Point class.\n\nFollowing on from discussions in the issue, I have abstracted the process of storing the calculated distances.  This patch introduces the DocumentDistanceSource abstraction which takes a GeoDistanceCalculator and a LocationDataSet to calculate the distance.  Its then left upto implementations of DocumentDistanceSource to decide whether or not to store values, and how to store them as well. ",
            "author": "Chris Male",
            "id": "comment-12850161"
        },
        {
            "date": "2010-03-26T15:54:40+0000",
            "content": "Linking LUCENE-2173 which cleans up the Cartesian Tier code, including the CartesianShapeFilter. ",
            "author": "Chris Male",
            "id": "comment-12850185"
        },
        {
            "date": "2010-03-26T15:56:31+0000",
            "content": "Linking LUCENE-2174 which replaces the existing DistanceQueryBuilder with a new SpatialFilter, which is a proper Lucene Filter.  This also replaces the DistanceFieldComparatorSource with an improved version.\n\nThis patch needs to be updated to incorporate the DocumentDistanceSource introduced in the previous patches. ",
            "author": "Chris Male",
            "id": "comment-12850186"
        },
        {
            "date": "2010-03-26T15:57:29+0000",
            "content": "Linking LUCENE-2175 which deprecates the remainder of the spatial contrib that is unused after all the changes. ",
            "author": "Chris Male",
            "id": "comment-12850187"
        },
        {
            "date": "2010-03-26T18:48:54+0000",
            "content": "Some of this stuff overlaps with Solr, too.  Especially when we talk about Point types, etc. ",
            "author": "Grant Ingersoll",
            "id": "comment-12850297"
        },
        {
            "date": "2010-03-31T18:54:19+0000",
            "content": "Once this is in, let's apply a global code format to the spatial code, too.  The indentations, etc. are whacked in that code. ",
            "author": "Grant Ingersoll",
            "id": "comment-12852045"
        },
        {
            "date": "2013-12-02T04:02:48+0000",
            "content": "Closing because the old spatial contrib module referenced here no longer exists as of Solr 4. ",
            "author": "David Smiley",
            "id": "comment-13836219"
        }
    ]
}