{
    "id": "LUCENE-2988",
    "title": "trunk 'ant test' hangs",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/test"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Cannot Reproduce",
        "status": "Closed"
    },
    "description": "Running 'ant test' from trunk on XP in a Cygwin shell hangs.\nThere was no progress in the console for a long time, so i stopped the program.\nBefore stopping it, created 5 consecutive thread dumps to see where the code is.\nIt is not clear what is going on - does not seem like a Lucene code I think but not sure.\nOpening this issue to keep an eye on this - I will try with other JDKs to see if this is persistent.\nAlso, when first seeing this had local changes of two issue: LUCENE-2986 and LUCENE-2977 - I think the changes in these issues are related but will repeat the tests without these changes.",
    "attachments": {
        "5-java-dumps.zip": "https://issues.apache.org/jira/secure/attachment/12474473/5-java-dumps.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-03-24T06:58:36+0000",
            "content": "Attached contains 5 consecutive java dumps taken when the tests were hanging - in the hope that comparing the thread states in the files would reveal the problem. ",
            "author": "Doron Cohen",
            "id": "comment-13010583"
        },
        {
            "date": "2011-03-24T07:02:53+0000",
            "content": "Updated the description - removed the part about 100% CPU - apparently the CPU consumption was unrelated (though the tests do hang). ",
            "author": "Doron Cohen",
            "id": "comment-13010584"
        },
        {
            "date": "2011-03-24T14:16:42+0000",
            "content": "I havent tried the tests with IBM's JRE in a while, I just did so and actually noticed some test failures. So it seems we have some issues to cleanup here.\n\nAs far as hangs, I inspected your dump files and it seems they are from the 'ant' jvm, not the forked process that actually runs the tests? \n\nIt could be the case here that its just in some ultra-slow test such as TestIndexWriterOnDiskFull... this one frequently takes several minutes for me even on Sun JRE. ",
            "author": "Robert Muir",
            "id": "comment-13010686"
        },
        {
            "date": "2011-03-24T16:37:50+0000",
            "content": "Thanks Robert for looking into this!\n\nit seems they are from the 'ant' jvm, not the forked process that actually runs the tests\n\nIndeed, now I notice that too... when 'ant test' hanged I used <CTRL BREAK> to get the thread dump and did not realize the ant JVM stands in between... That console is lost and I don't know the exact location in the tests when that happened - too bad. \n\nIt could be the case here that its just in some ultra-slow test such as TestIndexWriterOnDiskFull... this one frequently takes several minutes for me even on Sun JRE.\n\nI was away for half an hour so its something slower...\n\nI was not able to reproduce this, and also in the meantime found out that I was using incompatible ant version - 1.8.1. \n\nSo thinking of closing this for now, will reopen it if it will reappear with ant 1.7.1. ",
            "author": "Doron Cohen",
            "id": "comment-13010754"
        },
        {
            "date": "2011-03-24T17:41:41+0000",
            "content": "Could not reproduce once moved from ant 1.8.1 to 1.7.1. ",
            "author": "Doron Cohen",
            "id": "comment-13010790"
        }
    ]
}