{
    "id": "LUCENE-2724",
    "title": "BooleanFilter and ChainedFilter miss to fully optimize for OpenBitSets",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/other"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "3.0.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "In line 65 of the BooleanFilter class there is an optimization for OpenBitSets, but i miss an optimization in line 62. \n\nI would replace the existing line:\n\nres = new OpenBitSetDISI(getDISI(shouldFilters, i, reader), reader.maxDoc());\n\n \n\nwith following code:\n\nDocIdSet docIdSet = shouldFilters.get(i).getDocIdSet(reader);\nif(docIdSet instanceof OpenBitSet) {\n\tres = new OpenBitSetDISI(reader.maxDoc());\n\tres.or((OpenBitSet) docIdSet);\n} else {\n\tres = new OpenBitSetDISI(docIdSet.iterator(), reader.maxDoc());\n}\n\n\n\nSame for line 78 and 95, adjusted for not and must filters.\n\nThat leads to an up to 5 times slower AND-combination in my test, where i had two filters to be AND-combined returning each a cached OpenBitSet, one with a cardinality of 15000 and the other with a cardinality of 13000. The result had a cardinality of 8300. Thats important if you do that 1000 times with a lot more documents.\n\nThe same must be also done for ChainedFilter in the method initialResult(..).\n\nAlso, the getDISI method in the BooleanFilter must be replaced by a getDocIdSet(..) method. This is useful because in line 87 the docIdSet is retrieved and in line 92 again when it is not of type OpenBitSet. This may also lead to a performance issue if the getDocIdSet method of a sub filter is not super fast.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-10-26T16:24:41+0000",
            "content": "Indeed that should speed up things.\n\nThe first case in the replacing code is actually only a copy of the underlying OpenBitSet, so perhaps it could be simplified to do just that.\n\nAnd some common code for this between ChainedFilter and BooleanFilter could perhaps be moved to OpenBitSetDISI. ",
            "author": "Paul Elschot",
            "id": "comment-12925021"
        }
    ]
}