{
    "id": "LUCENE-6247",
    "title": "artifacts are half a gigabyte",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "5.0"
        ],
        "priority": "Major",
        "status": "Open",
        "type": "Bug"
    },
    "description": "This is a growing problem and now, its spun out of control.\n\nThe latest release artifacts are half a gigabyte. sorry, I am against adding more retries to the smoke tester and continuing down the same path (LUCENE-6231).\n\nInstead I open this blocker issue to discuss fixing this. Whenever i tried to fix it before (e.g. removing zips), people complained at me \"what are you trying to fix\" and wouldn't let me minimize it in the slightest.\n\nNow the problem is clear, we have a blocker issue to discuss it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14321404",
            "author": "Robert Muir",
            "date": "2015-02-14T12:59:06+0000",
            "content": "The first thing to fix is the embedded javadocs in the binary release.\n\nI love how the esoteric cases love to pop out from trying to do this: \"but i dont have an internet connection, i'm on a secure network, blah blah\". World's smallest violin is playing: you guys can run 'ant javadocs'. Very simple. Everyone else can read them online.\n\nI am going to repeat for the last time: We shouldnt include these tens of thousands of files in our binary releases when they just bloat them for all users, when most do not need it.  "
        },
        {
            "id": "comment-14321419",
            "author": "Robert Muir",
            "date": "2015-02-14T13:54:18+0000",
            "content": "Here are the calculations for current lucene branch_5x.\nInstead of a 144MB binary release, it could be 24MB.\n\n\nCurrent: 144,919,796 bytes\n\n-rw-rw-r--  1 rmuir rmuir 67144315 Feb 14 08:38 lucene-5.1.0-SNAPSHOT.tgz\n-rw-rw-r--  1 rmuir rmuir 77775481 Feb 14 08:38 lucene-5.1.0-SNAPSHOT.zip\n\n-Javadocs: 122,022,758 bytes\n\n(this means: don't include javadocs in the binary release. they are on the website,\n and users who need a local copy can build one with 'ant javadocs')\n\n-rw-rw-r--  1 rmuir rmuir 60947629 Feb 14 08:42 lucene-5.1.0-SNAPSHOT.tgz\n-rw-rw-r--  1 rmuir rmuir 61075129 Feb 14 08:42 lucene-5.1.0-SNAPSHOT.zip\n\n-Javadocs -3rdPartyJars: 48,935,497 bytes\n\n(this means: also don't include dependent third party jars. basic usage of lucene\n like running the demos does not require them. but several advanced modules have huge\n ones. Instead we could just clearly document what versions, for people not using\n a dependency manager)\n \n-rw-rw-r--  1 rmuir rmuir 24405986 Feb 14 08:48 lucene-5.1.0-SNAPSHOT.tgz\n-rw-rw-r--  1 rmuir rmuir 24529511 Feb 14 08:48 lucene-5.1.0-SNAPSHOT.zip\n\n-Javadocs -3rdPartyJars -Zip: 24,405,986 bytes\n\n(this means: also don't include the .zip. Its totally redundant. Welcome to 2015).\n\n-rw-rw-r--  1 rmuir rmuir 24405986 Feb 14 08:48 lucene-5.1.0-SNAPSHOT.tgz\n\n "
        },
        {
            "id": "comment-14321430",
            "author": "Steve Rowe",
            "date": "2015-02-14T14:05:41+0000",
            "content": "Setting an issue as a Blocker doesn't mean it holds up the release, Robert, as you are well aware.\n\nEven -1'ing a release vote doesn't hold up a release, unless you can get the majority of voters to agree with you.\n\nBut you know this: you've been saying so for years. "
        },
        {
            "id": "comment-14321443",
            "author": "Robert Muir",
            "date": "2015-02-14T14:09:53+0000",
            "content": "Nope, I'm just opening a blocker issue. If you don't agree this is a problem, then feel free to ignore it, create an RC, and call a VOTE on half a gigabyte anyway.\n\nBut I am raising the issue and discussing the actual problem at hand here (not adding more retries and stuff like that to try to hack around it). "
        },
        {
            "id": "comment-14321561",
            "author": "Erik Hatcher",
            "date": "2015-02-14T17:08:21+0000",
            "content": "(from LUCENE-6231)\n2. fix for 5.1: we commit your patch and release 5.0, but we fix download size for 5.1. \n\nI concur that download size is an issue and that it is worth fixing soon, but should not be a blocker for 5.0 at this stage.\n\nWe all know that 5.1 will be right around the corner, so let's get 5.0 released. "
        },
        {
            "id": "comment-14321573",
            "author": "Shalin Shekhar Mangar",
            "date": "2015-02-14T17:24:54+0000",
            "content": "I agree with you Robert. The download sizes have increased too much. For example, why should we ship Javadocs in Solr distributions? It may make sense to ship solrj javadocs only but no more. "
        },
        {
            "id": "comment-14321577",
            "author": "Yonik Seeley",
            "date": "2015-02-14T17:30:31+0000",
            "content": "I am going to repeat for the last time: We shouldnt include these tens of thousands of files in our binary releases when they just bloat them for all users, when most do not need it.\n\n+1 for removing javadoc from both lucene and solr (I've been onboard with that for years \n\nAs far as zip/tgz, I think Lucene as a developer library only needs one... but Solr as a product should keep the zip.  My heliosearch download counts have the .zip outnumbering the .tgz... anyone know the counts for the ASF downloads? "
        },
        {
            "id": "comment-14321579",
            "author": "Robert Muir",
            "date": "2015-02-14T17:32:26+0000",
            "content": "\nWe all know that 5.1 will be right around the corner, so let's get 5.0 released.\n\nI am completely +1 for this approach, but i have big concerns because there are quite a few file size issues open and no consensus anywhere. I honestly think it has gotten out of control, i DO NOT want to do anything risky or scary for 5.0, i DO NOT want to hold up the release, I just want us to agree there is a problem, and that we will fix this change this packaging in e.g. 5.1.\n\nAs i mentioned, I do understand that solr underwent radical packaging changes for 5.0 already, so doing it again could cause confusion. If we must fix it for 5.0 due to those concerns, then that's ok too. But lets please not let it drop like all the other issues. "
        },
        {
            "id": "comment-14321580",
            "author": "Robert Muir",
            "date": "2015-02-14T17:33:52+0000",
            "content": "\nAs far as zip/tgz, I think Lucene as a developer library only needs one... but Solr as a product should keep the zip. My heliosearch download counts have the .zip outnumbering the .tgz... anyone know the counts for the ASF downloads?\n\nI don't know this, but I want to point out one fact. Once the javadocs situation is fixed, the size of .tgz vs .zip is essentially the same (see my numbers above). I think thats because, once the javadocs thing is fixed, then zips/tgzs mostly contain already-compressed jars so it does not matter, its just a convenient packaging format. "
        },
        {
            "id": "comment-14321585",
            "author": "Ryan Ernst",
            "date": "2015-02-14T17:37:37+0000",
            "content": "I'm +1 to removing javadocs from binary release.  I thought there was an issue for this from a while ago (after a release Robert did), but the closest I could find is the previous discussion on LUCENE-5589. "
        },
        {
            "id": "comment-14321624",
            "author": "Anshum Gupta",
            "date": "2015-02-14T18:29:37+0000",
            "content": "I'm +1 to removing javadocs from the binary release and making that and anything more that comes out, in 5.1.\nLet's decide on that and move forward? "
        },
        {
            "id": "comment-14321628",
            "author": "Robert Muir",
            "date": "2015-02-14T18:34:25+0000",
            "content": "It would be good to get opinions on the other lucene changes here. Consensus on removing javadocs from the binary release is great, since its ~23MB we don't need, but the other proposed changes really get the size to something reasonable.\n\nFor example once we remove the javadocs, .zip and .tar.gz are on par size-wise, so I propose to remove one of them. I do not care which one it is, but I don't think having both is really helpful for lucene. The third party jars are also very large, so we should discuss that too.\n\nNOTE: I didn't do experiments with solr, its an app so it has more complexities here. I am sure the packaging may need to be different there. "
        },
        {
            "id": "comment-14321663",
            "author": "Noble Paul",
            "date": "2015-02-14T19:26:44+0000",
            "content": "+1 for removing javadocs. Users usually prefer to check it online\n\nWhat else are we going to remove to cut down the download size? "
        },
        {
            "id": "comment-14321697",
            "author": "Robert Muir",
            "date": "2015-02-14T20:40:58+0000",
            "content": "My comment above shows several ways to do this significantly, please look thru it: https://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419\n\nConsensus on javadocs isn't enough here. We need to talk about these other things, sorry. "
        },
        {
            "id": "comment-14321711",
            "author": "Michael McCandless",
            "date": "2015-02-14T21:21:18+0000",
            "content": "+1 to remove javadocs from bin release.\n\n+1 to remove 3rd party JARs from lucene.\n\n+1 to build just .zip (not .tar.gz). "
        },
        {
            "id": "comment-14322061",
            "author": "Adrien Grand",
            "date": "2015-02-15T16:39:26+0000",
            "content": "Same +1s as Michael, this sounds like a good trade-off to me. "
        },
        {
            "id": "comment-14322218",
            "author": "Anshum Gupta",
            "date": "2015-02-15T22:33:15+0000",
            "content": "I think it totally makes sense to do all of the above but in 5.1 instead of 5.0. "
        },
        {
            "id": "comment-14322235",
            "author": "Jan Høydahl",
            "date": "2015-02-15T23:12:20+0000",
            "content": "+1 to Michael's suggestions - in 5.1 "
        },
        {
            "id": "comment-14322844",
            "author": "Alexandre Rafalovitch",
            "date": "2015-02-16T15:06:41+0000",
            "content": "+1 on removing Javadocs in shipped version of both Solr and Lucene.\n\nAlso, Solr ships with lucene-test library (and junit, ant, etc) in dist/test-framework. That's another 10Mb. I don't think anything in the binary distribution actually relies on it. "
        },
        {
            "id": "comment-14322958",
            "author": "Robert Muir",
            "date": "2015-02-16T16:32:53+0000",
            "content": "Please, comment on all 3 of my suggestions listed here:\n\nhttps://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419\n\nI don't know how many times i have to say it. The javadocs are only a small piece of what needs to be done here.\n\nhttps://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419\nhttps://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419\nhttps://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419\nhttps://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419 "
        },
        {
            "id": "comment-14322971",
            "author": "Alexandre Rafalovitch",
            "date": "2015-02-16T16:41:18+0000",
            "content": "Not everybody has an opinion on the other issues, I guess. I feel I know enough to vote on Javadoc issues, but on others, I don't understand the implications either way.\n\nBut, rechecking that list, I think, for Solr, ..zip is better than .tgz for our target audience. Even if it is 2015. For Lucene, I don't know, maybe .tgz only is ok. But that would introduce inconsistencies between Lucene and Solr distributions. "
        },
        {
            "id": "comment-14322981",
            "author": "Robert Muir",
            "date": "2015-02-16T16:46:10+0000",
            "content": "But that's the problem, nobody wants to make a decision, nobody has any guts to try to do anything here, and the release just gets bigger and bigger and bigger.\n\nThats why there are no progress on other issues, thats why the release is half a gigabyte, and thats why I am raising hell. I'm the last hope of anything ever happening here, because I'm the only one that will break some eggs to get it done.\n\nSpeak your mind now, if people whine about my proposals later, despite me making incredible amounts of noise to try to get comments about them, I can assure you that it will not be pretty. "
        },
        {
            "id": "comment-14322996",
            "author": "Steve Molloy",
            "date": "2015-02-16T16:56:41+0000",
            "content": "+1 to everything in 5.1 (although zip may be easier for some than tgz, as long as there's only one)\n\nThis said, maybe more people would vote on details if it was split in separate tickets. And if some part causes more waves, at least the rest could be tackled and be done with. I don't see javadocs and double-packaging as causing much waves (apart from potential long discussion around zip vs tgz), 3rd party libs might cause more. If you split the ticket, you can get all but 3rd party in quickly and at least make progress on reducing size. Not perfect, but on the right path... "
        },
        {
            "id": "comment-14323001",
            "author": "Alexandre Rafalovitch",
            "date": "2015-02-16T17:00:48+0000",
            "content": "Could we have a parent blocker and children for individual issues to discuss? My strong vote (if I had any) would be to dump Javadoc from 5.0 (yes, with a re-spin). Explaining it going away in 5.1 would be a lot more awkward. It's a clear issue with simple solution (just stop building/bundling). Nothing will break, because nothing relies on those Javadocs. I am already doing Javadocs online with search built-in ( http://www.solr-start.com/javadoc/solr-lucene/index.html ), so we know that the shipped Javadocs are not actually all that good or useful.\n\nBundling as a zip/tgz-only is also easy to do (disable the task), but choosing which one to keep is harder and there might be downstream tasks that rely on a particular format's presence. But that should not hold up the Javadocs issue. So, maybe that should be for 5.1 with a warning/discussion on the dev list outside of JIRA.\n\nOther artifacts would probably take even more discussion. Target that for 5.1 or 5.2. I have absolutely zero opinions on those as I only use Lucene downloads to build the Javadocs. But I strongly agree on making things smaller. I suspect this discussion would also re-trigger the discussion on modularity/plugins. Both in relations to ElasticSearch implementation of plugins and with recent work on Solr towards plugins. Sparks could fly.\n "
        },
        {
            "id": "comment-14323008",
            "author": "Robert Muir",
            "date": "2015-02-16T17:03:29+0000",
            "content": "For lucene, third party libs are an important component to the size though. They are more than 50% of it.\n\nI've tried splitting out this stuff before, it does not work (see LUCENE-5589)\n\nI think it is best to keep a coherent unified issue that attacks the size problem directly. I am not going to herd cats on 8 different issues like in the past.\n\nThe issue is being brought to a head, right here, and I intend to fix it in 5.1.  "
        },
        {
            "id": "comment-14323011",
            "author": "Robert Muir",
            "date": "2015-02-16T17:04:51+0000",
            "content": "\nMy strong vote (if I had any) would be to dump Javadoc from 5.0 (yes, with a re-spin). Explaining it going away in 5.1 would be a lot more awkward. \n\nI don't want to downplay your argument here, don't get the wrong idea. But this is why i made this a blocker for 5.0 (i know, which pisses everyone off). If we need to fix things for 5.0, then we should do it. The issue should not be put off for 6.0 "
        },
        {
            "id": "comment-14323030",
            "author": "Alexandre Rafalovitch",
            "date": "2015-02-16T17:12:37+0000",
            "content": "(meta-level comment)\nLUCENE-5589\n\nI see intermingling of the target audiences in these issues. There is issue that more affects developers (smoke test, repeated downloads of RCs, etc) and there are issues that affect final users and those downstream with the public release (tgz vs zip, Javadoc, etc).\n\nBoth camps are in favor of smaller downloads I am sure, but not being explicit about it is what's muddling the discussion. For my target audience (users), any incremental improvement (decrease in size) would be good news as long as it does not break anything. Hence, that pushes Javadoc as the most important issue, even if it is not the maximum impact on size overall. "
        },
        {
            "id": "comment-14323041",
            "author": "Robert Muir",
            "date": "2015-02-16T17:21:02+0000",
            "content": "Third party libraries are a far bigger component of the \"user\" download than the javadocs. See my sizes above.\n\nFor lucene, these only apply to additional optional modules. Its not needed for example to run the demo or use lucene.\nWe can have the build emit information to a .txt or whatever describing exactly which versions we have tested (for people not using a dependency manager to get these artifacts from maven).\n "
        },
        {
            "id": "comment-14323044",
            "author": "Robert Muir",
            "date": "2015-02-16T17:23:40+0000",
            "content": "\nBoth camps are in favor of smaller downloads I am sure, but not being explicit about it is what's muddling the discussion. \n\n\nWho is not being explicit? I was explicit when i said what i wanted to do for lucene, its right here:\n\nhttps://issues.apache.org/jira/browse/LUCENE-6247?focusedCommentId=14321419&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321419\n\nI'm being explicit, thats not the problem. I think the problem is that you aren't listening. "
        },
        {
            "id": "comment-14323068",
            "author": "Alexandre Rafalovitch",
            "date": "2015-02-16T17:49:43+0000",
            "content": "I'm being explicit, thats not the problem. I think the problem is that you aren't listening.\n\nAre you really sure I am not listening!?! If I am not listening, then why my slides at the Solr Revolutions were bitching about Solr distribution size with charts and all? You think I wasted my precious presentation time on that because it was an easy issue to raise?\n\nThere is a bad joke about Americans in a foreign country just repeating the questions (in English) louder when they are misunderstood. Similarly, I don't think using the same words again but in all caps (or with a blocker flag) is what will make a difference. You are being very explicit about what you want for Lucene. But when people come back and say that they disagree or only comment on a part of an issue, you are repeating exactly the same message just louder. I do not see you addressing different impacts on developers and final users. Impact is not just size, it's historical implications, 3rd party systems, etc. \n\nYou asked for feedback, you got some, including some representing the issues you - as a hardcore developer - don't seem to care much about. You were unhappy that the feedback did not fully agree with your vision, so will now go ahead and do it your way anyway. Why did you bother asking then, apart from Grandstanding? \n\nThe saddest thing is that people are mostly agreeing with you on this issue. Yet, the conversation is rapidly going in the direction where you will either abandon this with bitter complains or push things through in the way that only address your own concerns. "
        },
        {
            "id": "comment-14323077",
            "author": "Robert Muir",
            "date": "2015-02-16T17:54:56+0000",
            "content": "\nBut when people come back and say that they disagree or only comment on a part of an issue, you are repeating exactly the same message just louder. I do not see you addressing different impacts on developers and final users. Impact is not just size, it's historical implications, 3rd party systems, etc. \n\nI haven't even begun to get loud. \n\nI proposed specific changes to lucene, with the size impacts of each.  Maybe that is your confusion, that this is a LUCENE issue that I opened and is quite contained to that? I don't care about solr here, Someone else can lead the charge for solr honestly, it will not be me. sparks are not going to fly and I am not going to develop any plugin system to deal with its size issue.\n\nSo please, lets just comment on the very specific proposal for lucene here and not discuss anything else irrelevant. "
        },
        {
            "id": "comment-14323088",
            "author": "Ryan Ernst",
            "date": "2015-02-16T18:05:16+0000",
            "content": "I've already given my +1 to removal of javadoc.  Regarding the other two ideas:\n\nI am in favor of removing zip, and only leaving tgz.  I did a quick survey of other apache projects.  A number I looked at only released with tgz (hadoop, couchdb, cassandra, cordova).  Others I looked at were the main httpd project, which released source as tgz but binary as zip, and Harmony which had both tgz and zip. Flex and Geronimo also released zip and labelled as \"windows\" and tgz and labelled it for mac and linux.  IMO, if someone cannot handle extracting a tgz on windows, they can't handle running Solr.\n\nFor removing dependencies, I'm in favor of this:\nWe can have the build emit information to a .txt or whatever describing exactly which versions we have tested (for people not using a dependency manager to get these artifacts from maven). "
        },
        {
            "id": "comment-14323091",
            "author": "Robert Muir",
            "date": "2015-02-16T18:09:16+0000",
            "content": "\n IMO, if someone cannot handle extracting a tgz on windows, they can't handle running Solr.\n\nLets keep the discussion contained to lucene here. Otherwise it will quickly blow out of scope and nothing will get done \n\nPlease note, we already release source code (and officially, thats the only thing we really release) as .tgz only. So it should be just fine to remove the binary .zip. "
        },
        {
            "id": "comment-14323176",
            "author": "Mark Miller",
            "date": "2015-02-16T19:43:19+0000",
            "content": "The saddest thing is that people are mostly agreeing with you on this issue. \n\nThat's usually the case. Pointing out what is happening on this issue won't solve anything unfortunately. This play has repeated 100 times by now.\n\n\n\tthings have spiraled out of control!\n\tgive me feedback or i will do what i want!\n\tyour feedback sucks and your stupid, i will do what i want!\n\tyour feedback sucks and your stupid, i will do what is obviously necessary and the only thing a sane person could think until you agree to all my points!\n\n\n\nrepeat at random intervals "
        },
        {
            "id": "comment-14323332",
            "author": "Jan Høydahl",
            "date": "2015-02-16T21:36:00+0000",
            "content": "+1 for sub tasks, then they can go in different releases, and it is easier to track what needs to be done for each, and (most important) the discussion gets more focused and technical, not all this crazy fuzzy yelling about the end of the world being near if we don't do a b and c "
        },
        {
            "id": "comment-14324702",
            "author": "Shawn Heisey",
            "date": "2015-02-17T19:11:20+0000",
            "content": "My contribution:\n\n\n\tI agree with dropping zip and keeping .tgz or .tar.gz.  That should cut the size roughly in half for developers.  It won't impact a user's download time.\n\tThe size of what a user must download is more important than what the developers must handle, but it's a separate issue.\n\tIMHO, those who cannot deal with a unix archive, regardless of OS, are probably not qualified to write Lucene code or admin Solr.\n\t\n\t\tWe can include some extraction instructions for Windows, which probably would start with installing 7zip or one of the non-free commercial offerings like Winzip or WinRar.\n\t\n\t\n\n\n "
        },
        {
            "id": "comment-14324742",
            "author": "Erik Hatcher",
            "date": "2015-02-17T19:31:09+0000",
            "content": "My $0.02 on the download format: .zip is what I always use, because it's pleasantly cross-platform and easy to inspect with `unzip -v`.  I'm -0 on dropping .zip (not big enough of a deal to me either way, just a preference). "
        },
        {
            "id": "comment-14324760",
            "author": "Shawn Heisey",
            "date": "2015-02-17T19:47:10+0000",
            "content": "I'm -0 on dropping .zip (not big enough of a deal to me either way, just a preference).\n\nFrom what I understand, all text files included in the .zip artifacts are in Windows CR/LF format, which is wrong for every other platform.  If we keep .zip, do we change that aspect of artifact creation?  My bias would be to stick with the *NIX text format, but that will cause problems for less sophisticated Windows users who use the built in Notepad.  Microsoft needs to correctly handle LF-only text files in Notepad.\n\nI don't really care too much about whether the supported archive is .zip or .tgz, but I do care about the text file format.  I never run production on Windows, so I don't want CR in my text files.  That's honestly my primary motivation for preferring tgz. "
        },
        {
            "id": "comment-14327074",
            "author": "Ryan Ernst",
            "date": "2015-02-19T07:35:28+0000",
            "content": "I have been working on some of the suggestions here for decreasing the artifacts sizes.  I spun off separate issues as many suggested. Note that all of these are only for binary releases.  Please comment there if you have opinions on those specific ideas:\n\n\tLUCENE-6257 - Remove javadocs\n\tLUCENE-6258 - Remove zip or tgz\n\tLUCENE-6259 - Remove dependencies\n\n "
        },
        {
            "id": "comment-14327426",
            "author": "Steve Molloy",
            "date": "2015-02-19T13:56:35+0000",
            "content": "I spun off separate issues as many suggested.\nAre those intended for both Lucene & Solr? Should separate ones be entered for Solr as well? I think they should be aligned as much as possible. "
        },
        {
            "id": "comment-14327478",
            "author": "Shawn Heisey",
            "date": "2015-02-19T14:20:07+0000",
            "content": "Steve Molloy, it has been my experience that issues affecting the build system for both Lucene and Solr are created in the LUCENE project.  Sometimes this leads to omissions in the solr/CHANGES.txt file because a committer is focused on the LUCENE aspect of the issue and doesn't think about that file.\n\nTo be absolutely sure we don't forget, documentation issues in SOLR, linked to the the relevant LUCENE issues, would be technically correct. "
        },
        {
            "id": "comment-14332071",
            "author": "Jan Høydahl",
            "date": "2015-02-22T07:37:12+0000",
            "content": "Found the existing JIRA where we discuss reducing the size of Solr (SOLR-6806) which also links to SOLR-5103 for a Solr plugin system. So for those interested, head over there and revive the discussion  "
        },
        {
            "id": "comment-16602960",
            "author": "Adrien Grand",
            "date": "2018-09-04T12:04:05+0000",
            "content": "I'm decreasing the priority from blocker to major since this hasn't been considered a blocker in practice. "
        }
    ]
}