{
    "id": "LUCENE-704",
    "title": "Lucene should have a \"write once\" mode",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "2.1",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "This is a spinoff of LUCENE-701\n\nIf your directory is residing on a \"write once\" filesystem (eg Hadoop), we need for Lucene to have a mode where it doesn't write to the same file more than once, nor (I think?) do things like rewind a file to overwrite parts of it.\n\nLockless commits (LUCENE-701 ) gets us closer to this goal because it always commits to a new segments_N+1 file (and new files for deletes/separate norms), but, it still re-writes to a \"segments.gen\" file.  This file is often \"optional\" (it's only necessary if directory listing can be stale on the platform/filesystem).\n\nThe only other place I know of is in CompoundFileWriter.close().  That method writes 0's into the header and then rewinds and rewrites those 0s with the actual offsets into the compound file.  I think (on quick inspection) that pre-computing the offsets and writing everything in one pass should be simple.\n\nDoes anyone know of other places that re-use filenames or rewind/seek and rewrite bytes?\n\nWe should create a \"setWriteOnceMode()\" or something like that.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2006-11-02T19:10:16+0000",
            "content": "Found it: http://issues.apache.org/jira/browse/LUCENE-532\nLooks like TermInfosWriter is the culprit.\n\nPersonally, I think having to use the non-compound index format for write-once mode would be fine.\nIndexing w/ compound file format in HDFS would lead to much worse performance anyway. ",
            "author": "Yonik Seeley",
            "id": "comment-12446698"
        },
        {
            "date": "2006-11-10T15:17:28+0000",
            "content": "I think this is a dup of LUCENE-532 ",
            "author": "Michael McCandless",
            "id": "comment-12448768"
        }
    ]
}