{
    "id": "LUCENE-6514",
    "title": "'ant idea' no longer includes code style settings",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [
            "-tools"
        ],
        "labels": "",
        "fix_versions": [
            "5.3"
        ],
        "priority": "Minor",
        "status": "Closed",
        "type": "Bug"
    },
    "description": "Fairly recently, with modern versions of IntelliJ (14+ ?), code style settings are no longer included when you run ant idea, so you get the defaults (4 spaces per indent level rather than 2, etc.)\n\nThe .idea/projectCodeStyle.xml file is still there, so something has changed.",
    "attachments": {
        "LUCENE-6514.patch": "https://issues.apache.org/jira/secure/attachment/12736596/LUCENE-6514.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14567516",
            "author": "Steve Rowe",
            "date": "2015-06-01T16:27:44+0000",
            "content": "Patch with a new file that apparently is now used by IntelliJ: .idea/codeStyleSettings.xml.  It has a slightly different format from .idea/projectCodeStyle.xml.  I added 2-space indent settings for all languages in the settings dialog.\n\nIf we leave .idea/projectCodeStyle.xml, I think older versions of IntelliJ will continue to work properly, and will likely just ignore the new file.\n\nCommitting shortly. "
        },
        {
            "id": "comment-14567522",
            "author": "ASF subversion and git services",
            "date": "2015-06-01T16:29:25+0000",
            "content": "Commit 1682948 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1682948 ]\n\nLUCENE-6514: IntelliJ config: fix code style settings for IntelliJ v14+ "
        },
        {
            "id": "comment-14567526",
            "author": "ASF subversion and git services",
            "date": "2015-06-01T16:30:15+0000",
            "content": "Commit 1682949 from Steve Rowe in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1682949 ]\n\nLUCENE-6514: IntelliJ config: fix code style settings for IntelliJ v14+ (merged trunk r1682948) "
        },
        {
            "id": "comment-14605662",
            "author": "Alessandro Benedetti",
            "date": "2015-06-29T14:18:36+0000",
            "content": "Im just trying with Intellij Idea 14.1.4 and it seems to not load properly the style.\nFor example what about the use of spaces ?\nNothing seems in the config file posted !\n\nCheers "
        },
        {
            "id": "comment-14605754",
            "author": "Steve Rowe",
            "date": "2015-06-29T15:24:01+0000",
            "content": "Hi Alessandro, which branch did you try it on?  The patch on this issue is only committed on branch_5x and trunk.\n\nWhat do you mean about the use of spaces?\n\nIt would be helpful if you could describe exactly what is happening and what you think should happen instead. "
        },
        {
            "id": "comment-14606120",
            "author": "Erick Erickson",
            "date": "2015-06-29T18:50:13+0000",
            "content": "It seems to come and go depending on how recently I've updated IntelliJ. While it's a pain, I usually get a dialog box in Idea that lets me set indents to 2. That's fragile though...\n\nAnd, BTW, I really love the IntelliJ option to \"Only reformat VCS changed text\"...... "
        },
        {
            "id": "comment-14606184",
            "author": "Alessandro Benedetti",
            "date": "2015-06-29T19:16:09+0000",
            "content": "Yes Erick I do love too, just discovered today and I will use it for the upcoming contributions!\n\nSo Steve, sorry to have been to vague.\nI was referring to the presence of spaces between params, within method params, in relation with parenthesis ext..\n\nI applied today the codeStyle xml from the branch you quoted in this issue : dev/branches/branch_5x .\nIt seems the indentation is ok now but no the spaces management, so my code seems not perfectly compliant when I create the patch ( actually I see a not uniform use of spaces across the already committed code as well from trunk.\nBut looking into the codeStyle I see only indentation params and nothing about use spacing.\n\nHope I clarified this.\n "
        },
        {
            "id": "comment-14606403",
            "author": "Erick Erickson",
            "date": "2015-06-29T21:06:29+0000",
            "content": "bq: I see a not uniform use of spaces across the already committed code as well from trunk.\n\nWhich is unfortunate, but true. It's a continual battle to get formatting done and there's code that has been checked in that doesn't conform to standards.\n\nI try resist the temptation to reformat whole files as then looking at the diffs is much harder. So basically I try to insure that code I change has been reformatted (at least the changed parts).\n\nIf there's a really horrible file that you just can't stand because the formatting is so bad, then it's OK to reformat the entire file and check it in without changing any code and add a note like \"reformat only, no code changes\". But practically I find this very rare.\n\nFWIW "
        },
        {
            "id": "comment-14606730",
            "author": "Steve Rowe",
            "date": "2015-06-30T00:29:10+0000",
            "content": "Alessandro, nobody has attempted to modify the shared code style settings to affect spaces.  Contributions are welcome!  \n\nWhat I do when I want to change IntelliJ config is: I make changes via IntelliJ's UI config management, then compare the modified files in .idea/ against what's stored under dev-tools/idea/.idea/, merge the changes into the dev-tools/ files, then run ant clean-idea idea and get the project to reload in IntelliJ to test out that they work. "
        },
        {
            "id": "comment-14606735",
            "author": "Steve Rowe",
            "date": "2015-06-30T00:31:30+0000",
            "content": "Alessandro, also, since what you're asking about isn't directly related to this issue (other than that it relates to IntelliJ code style settings), please create a new issue for it. "
        },
        {
            "id": "comment-14607932",
            "author": "Alessandro Benedetti",
            "date": "2015-06-30T08:23:20+0000",
            "content": "Thanks Steve, let me open the new issue !\nhttps://issues.apache.org/jira/browse/LUCENE-6641\nCan we discuss there the standard, for me it is no problem to contribute it, but actually I don't know where to find the exhaustive standard currently !\n\nCheers "
        },
        {
            "id": "comment-14713350",
            "author": "Shalin Shekhar Mangar",
            "date": "2015-08-26T13:06:30+0000",
            "content": "Bulk close for 5.3.0 release "
        }
    ]
}