{
    "id": "LUCENE-817",
    "title": "Manage dependencies in the build with ivy",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/build"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "2.1",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "There were issues about making the 2.1 release : http://www.nabble.com/-VOTE--release-Lucene-2.1-tf3228536.html#a8994721\nThen the discussion started to talk about maven, and also about ivy.\nI propose here a draft, a proof of concept of an ant + ivy build. I made this build parallel to the actual one, so people can evaluate it.\nNote that I have only ivy-ified the core, the demo and the contrib/benchmark. The other contrib projects can be ivy-ified quite easily.\n\nThe build system is in the common-build directory. In this directory we have :\n\n\tcommon-build.xml : the main common build which handle dependencies with ivy\n\tcommon-build-project.xml : build a java project, core, demo, or a contrib one\n\tcommon-build-webapp.xml : extend common-build-project and have some tasks about building a war\n\tcommon-build-modules.xml : allow to build sevral projects, just using some subant task\n\tcommon-build-gcj.xml : build with gcj. It work once, need to be fixed\n\tivyconf.xml, ivyconf.properties : ivy configuration\n\tbuild.xml : a little task to generate the ivyconf.xml to use with the eclipse ivy plugin\n\teclipse directory : contains some XSL/XML to generate .classpath and .project\n\n\n\nTo test it and see how ivy is cool  :\ncd contrib/benchmark\nant -f build-ivy.xml buildeep\n\nand look at the new local-libs directory at the root of the lucene directory !",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2007-02-26T10:17:34+0000",
            "content": "jira not responding, retrying, and then a duplicate issue... ",
            "author": "Nicolas Lalevée",
            "id": "comment-12475863"
        }
    ]
}