{
    "id": "LUCENE-3150",
    "title": "Wherever we catch & suppress Throwable we should not suppress ThreadInterruptedException",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "In various places we catch Throwable and suppress it, usually in exception handlers where we want to just throw the first exc we had hit.\n\nBut this is dangerous for a thread interrupt since it means we can swallow & ignore the interrupt.\n\nWe should at least catch the interrupt & restore the interrupt bit, if we can't rethrow it.\n\nOne example is in SegmentInfos where we write the segments.gen file... there are many other examples in SegmentInfos too.",
    "attachments": {
        "LUCENE-3150.patch": "https://issues.apache.org/jira/secure/attachment/12503531/LUCENE-3150.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-29T11:47:28+0000",
            "content": "We can fix IOUtils to do that – now that we call it from many places in the code, it will catch a lot of instances. Also, perhaps we could have an Abortable interface and then call IOUtils from all places that impl abort() today. ",
            "author": "Shai Erera",
            "id": "comment-13040791"
        },
        {
            "date": "2011-11-13T12:07:21+0000",
            "content": "here is a first patch for this issue. I integrated another utility into IOUtils that checks if we suppress an InterruptException and resets the interrupt bit on the thread if so. I also call maybeResetInterrupt throughout the code in core where we catch(Throwable) and don't rethrow - its a start.... ",
            "author": "Simon Willnauer",
            "id": "comment-13149280"
        },
        {
            "date": "2012-03-23T20:28:20+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited ",
            "author": "Hoss Man",
            "id": "comment-13237029"
        },
        {
            "date": "2013-07-23T18:44:32+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716981"
        },
        {
            "date": "2014-04-16T12:54:51+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970904"
        }
    ]
}