{
    "id": "LUCENE-1670",
    "title": "Cosmetic JavaDoc updates",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "general/javadocs"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I've taken the liberty of making a few cosmetic updates to various JavaDocs:\n\n\n\tMergePolicy (minor cosmetic change)\n\tLogMergePolicy (minor cosmetic change)\n\tIndexWriter (major cleanup in class description, changed anchors to JavaDoc links [now works in Eclipse], no content change)\n\n\n\nAttached diff from SVN r780545.\n\nI would appreciate if whomever goes over this can let me know if my issue parameter choices were correct (yeah, blame my OCD), and if there's a more practical/convenient way to send these in, please let me know",
    "attachments": {
        "lucene_1670.patch": "https://issues.apache.org/jira/secure/attachment/12409540/lucene_1670.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-06-01T04:31:46+0000",
            "content": "Patch against r780545 ",
            "author": "Tomer Gabel",
            "id": "comment-12714967"
        },
        {
            "date": "2009-06-01T05:37:54+0000",
            "content": "I have a couple of comments:\n\n\n\tIn LogMergePolicy, you add a reference to mergeFactor (\n{@link #mergeFactor}\n), which is a private member of LMP. Wouldn't that be an issue when generating the javadocs (i.e., create a link to a non-existent entity, since private members are not generated in the javadocs)?\n\tIn MergePolicy you added a link to SegmentInfo. Same as above - SegmentInfo is package private and therefore I'm not sure its included in the javadocs. If I look here (http://lucene.apache.org/java/2_4_0/api/core/index.html), SegmentInfo does not appear there.\n\tIn IndexWriter, you add references like this: \n{@link #addDocument(Document) addDocument}\n - is the 'addDocument' in the end necessary. I've tried it and it doesn't come out nicely in the javadocs. Same goes for \n{@link #updateDocument(Term, Document) updateDocument}\n.\n\tIn IndexWriter you replaced see <a href=\"#mergePolicy\"> with *see \n{@link #mergePolicy below}\n* - that's wrong for two reasons: (1) mergePolicy is private (see comments above) and (2) the javadocs actually have an element afterwards: <a name=\"mergePolicy\"></a>. The part you replaced references that element, rather than the mergePolicy member (which just happen to have the same name ).\n\n ",
            "author": "Shai Erera",
            "id": "comment-12714980"
        },
        {
            "date": "2009-06-01T06:06:59+0000",
            "content": "Good comments all around, I should definitely have caught all of those. I'll post an update presently. ",
            "author": "Tomer Gabel",
            "id": "comment-12714987"
        },
        {
            "date": "2009-06-01T07:09:27+0000",
            "content": "Alright, I'll attach a new patch in a couple of minutes that has the following improvements:\n\n\tLogMergePolicy: You are correct. I removed the links, as well as tried rewriting the paragraph to be a little clearer.\n\tMergePolicy: This is not a problem; it does not appear in the API, but it's still linked (hence refactoring tools such as Eclipse will update the link value as well as the class name), and it shows in monospaced font as you'd expect with <code>.\n\tIndexWriter: Re (3), the extra token is the apparent text for the link (in this case, it \"hides\" the parameters). I merely \"translated\" from the previous anchor tag to links.\n\tIndexWriter: Fixed a few typoes\n\tIndexWriter: Reverted the mergePolicy link change\n\tIndexWriter: Fixed missing IndexSearcher import for link\n\n\n ",
            "author": "Tomer Gabel",
            "id": "comment-12714998"
        },
        {
            "date": "2009-06-01T07:11:19+0000",
            "content": "Patch for r780565 ",
            "author": "Tomer Gabel",
            "id": "comment-12714999"
        },
        {
            "date": "2009-06-01T10:24:46+0000",
            "content": "Ok I checked and if you reference an item which is not generated in the Javadocs, it appears in monospace, with no link. So I guess referencing SegmentInfo is fine. Just as a FYI, not everybody use Eclipse, and Eclipse (I think since 3.4) has the ability to update String references to class names you refactor.\n\nThis look good now. Unfortunately, I'm not a committer so I cannot take this issue any further . Hope my review will help the committer that will choose to commit it. ",
            "author": "Shai Erera",
            "id": "comment-12715047"
        },
        {
            "date": "2009-06-01T10:28:16+0000",
            "content": "Thanks Tomer!  I just committed this.  There was one warning the patched caused when running \"ant javadocs-core\":\n\n\n[javadoc] /lucene/src/clean/src/java/org/apache/lucene/index/IndexWriter.java:215: warning - Tag @link: reference not found: IndexSearcher\n\n\n\n(because IndexSearcher wasn't imported in IndexWrieter.java).  So I just reverted that change (made it fully qualified again). ",
            "author": "Michael McCandless",
            "id": "comment-12715050"
        },
        {
            "date": "2009-06-01T13:01:37+0000",
            "content": "That's odd – one of the changes I made in the second version was to fix that precise warning (added an import directive). The last bullet even mentions it :-/\nAnyway glad to be of help! ",
            "author": "Tomer Gabel",
            "id": "comment-12715077"
        },
        {
            "date": "2009-06-01T14:22:46+0000",
            "content": "Hmm I see that bullet too, but when I look at the patch it doesn't have the added import?  Maybe something got mixed up when you attached the patch?  Are there any other intended changes missing? ",
            "author": "Michael McCandless",
            "id": "comment-12715096"
        },
        {
            "date": "2009-06-01T14:30:36+0000",
            "content": "Yeah, the minor typo I fixed. It's not in the diff though. Oh well, I'll get it next time... ",
            "author": "Tomer Gabel",
            "id": "comment-12715098"
        }
    ]
}