{
    "id": "LUCENE-2452",
    "title": "Is a more recent code avaailable than that provided in June 3, 2003 Version of \"Parsing, indexing and searching XML with Digester and Lucene\"?",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "The online Article \"Parsing, indexing, and searching XML with Digester and Lucene\" <https://www.ibm.com/developerworks/library/j-lucene/> provides java code to create a Lucene index from an XML input file.  It also provides code for an index reader.  The article is dated June 03,2003.  After some modification, I was able to execute the index writer code using Lucene 3.0.1, however I have been unsuccessful in executing the code for searching the index.  Does anyone know whether more recent code is available, or if there are any instructions to bring the Index reader (i.e. AddressBookSearcher) up to date?\nThanks, Bill",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-05-07T18:13:29+0000",
            "content": "Hi Bill,\n\nYou should address issues like this to the java-user@lucene.apache.org mailing list; the bug tracking system is intended to address issues with the software maintained by the Lucene project, not source code created elsewhere.  \n\nIn any case, it's a good idea to ask first on the user list, in case the issue you're having is already known.\n\nHave you seen Lucene's Getting Started page?  The Lucene command line demo is mentioned there; here is a direct link to the source code, including searching against an index:\n\n http://svn.apache.org/viewvc/lucene/dev/trunk/lucene/src/demo/org/apache/lucene/demo/SearchFiles.java?view=markup\n\nGood luck,\nSteve ",
            "author": "Steve Rowe",
            "id": "comment-12865253"
        },
        {
            "date": "2010-05-07T18:18:58+0000",
            "content": "Forgot to mention the Resources page on the Lucene wiki - tons of useful stuff there:\n\nhttp://wiki.apache.org/lucene-java/Resources ",
            "author": "Steve Rowe",
            "id": "comment-12865257"
        }
    ]
}