{
    "id": "LUCENE-45",
    "title": "ACL's on search content",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "1.2",
        "resolution": "Cannot Reproduce",
        "status": "Closed"
    },
    "description": "I would like Lucene to be able to be able to limit its search to specific\ncontent by arbitrary information, such as user and company information.  We need\nthis kind of capability for our e-commerce website, in that we have company and\nuser rules that would prohibit specific users from being able to see our entire\ncatalog.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2002-06-29T04:50:03+0000",
            "content": "This sounds like an application-specific feature, and something that Lucene\nshould not have to worry about. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321099"
        },
        {
            "date": "2002-07-04T09:02:28+0000",
            "content": "I opened this as an enhancement request, not as a bug, as anyone can clearly see\nfrom the severity being set to \"Enchancment\".  Based on the below text, which\ncomes directly from the Jakarta project site, this is supposed to be the\nmechanism to request feature enhancements.  I recieved one e-mail saying that\none of my bugs was closed, because you use a TODO list in CVS for enhancements.\n I know that Lucene hasn't been a Jakarta project for very long, but since it\nis, it should follow established Jakarta project methods for such a thing.  I\nfind it much easier to request a feature enhancement through the standard\nJakarta mechanism, because I can use to track my requests against the project. \nIf you want to add my request to the TODO list in CVS from here that is fine,\nbut I would like to track this through this request.\n\nPier Fumagalli has set up the Apache Bug Database. Please use this database\nreport bugs and suggest new features. To suggest a new feature, set the severity\nof the bug to \"enhancement\".\n\nThanks.\n ",
            "author": "Andrig T. Miller",
            "id": "comment-12321100"
        },
        {
            "date": "2003-10-09T16:11:15+0000",
            "content": "Lucene includes several options for doing what is requested here.  Writing a custom Filter or using \nQueryFilter are two possibilities.   While I agree that we should use Bugzilla for enhancement \nrequests, your request is specific to your application and Lucene provides the necessary hooks for \nyou to accomplish your needs. ",
            "author": "Erik Hatcher",
            "id": "comment-12321101"
        },
        {
            "date": "2003-10-10T06:08:11+0000",
            "content": "Okay, we will look into a custom filter, or whether the QueryFilter will work\nfor us.\n\nThanks. ",
            "author": "Andrig T. Miller",
            "id": "comment-12321102"
        }
    ]
}