{
    "id": "LUCENE-1817",
    "title": "it is impossible to use a custom dictionary for SmartChineseAnalyzer",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "it is not possible to use a custom dictionary, even though there is a lot of code and javadocs to allow this.\n\nThis is because the custom dictionary is only loaded if it cannot load the built-in one (which is of course, in the jar file and should load)\n\npublic synchronized static WordDictionary getInstance() {\n    if (singleInstance == null) {\n      singleInstance = new WordDictionary(); // load from jar file\n      try {\n        singleInstance.load();\n      } catch (IOException e) { // loading from jar file must fail before it checks the AnalyzerProfile (where this can be configured)\n        String wordDictRoot = AnalyzerProfile.ANALYSIS_DATA_DIR;\n        singleInstance.load(wordDictRoot);\n      } catch (ClassNotFoundException e) {\n        throw new RuntimeException(e);\n      }\n    }\n    return singleInstance;\n  }\n\n\n\nI think we should either correct this, document this, or disable custom dictionary support...",
    "attachments": {
        "LUCENE-1817-mark-cn-experimental.patch": "https://issues.apache.org/jira/secure/attachment/12417742/LUCENE-1817-mark-cn-experimental.patch",
        "LUCENE-1817.patch": "https://issues.apache.org/jira/secure/attachment/12417758/LUCENE-1817.patch",
        "dataFiles.zip": "https://issues.apache.org/jira/secure/attachment/12417759/dataFiles.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-08-26T14:56:49+0000",
            "content": "I am looking at this today. One thing about this code that should also be corrected ASAP is that if you have a custom dictionary directory in .DCT format, the load() method will actually call save()\n\nThis will create a corresponding .MEM file in the same directory after loading the dictionary in DCT format.\n\nI really do not think load() methods should be creating or writing to files. ",
            "author": "Robert Muir",
            "id": "comment-12747963"
        },
        {
            "date": "2009-08-26T15:02:27+0000",
            "content": "In my opinion, the loader should be able to load either .mem files (which should realy be named *.ser, because they are serialized java objects) or DCT format files (maybe autodetect) or two separate methods. If you want to quicker load the files later, you could also save the DCT as a serialized object after that, but this should be left to the user and not done automatically. ",
            "author": "Uwe Schindler",
            "id": "comment-12747966"
        },
        {
            "date": "2009-08-26T15:05:47+0000",
            "content": "Uwe, i agree. currently it does do the autodetect (first checks for .MEM, then falls back on DCT).\nbut if it has to fall back on DCT, it will create a .MEM file. ",
            "author": "Robert Muir",
            "id": "comment-12747967"
        },
        {
            "date": "2009-08-26T15:11:13+0000",
            "content": "We should mark the smartcn module  experimental as we plan to do heavy refactoring after 2.9 is out. This patch adds a notice to package.html and JavaDoc.\nQuoting Mark Miller from the list:\nWarning users that you don't plan on promising back compat with experimental warnings seems like a good idea to me. ",
            "author": "Simon Willnauer",
            "id": "comment-12747973"
        },
        {
            "date": "2009-08-26T16:54:49+0000",
            "content": "to make matters more complex, trying to load a bigram dictionary from a DCT file gave me:\n\n\n# An unexpected error has been detected by Java Runtime Environment:\n#\n#  EXCEPTION_ACCESS_VIOLATION (0xc0000005) at pc=0x000000006dc378d0, pid=3140, tid=5912\n#\n# Java VM: Java HotSpot(TM) 64-Bit Server VM (11.2-b01 mixed mode windows-amd64)\n# Problematic frame:\n# V  [jvm.dll+0x3a78d0]\n\n\n\napparently this is some clover issue in my eclipse and i turned it off, so it is an unrelated problem. ",
            "author": "Robert Muir",
            "id": "comment-12748025"
        },
        {
            "date": "2009-08-26T17:19:08+0000",
            "content": "patch adds:\n\n\tload custom dictionaries when the analyzer has been configured to do so\n\ttest that custom DCT dictionaries load\n\tdo not serialize/write files when loading DCT\n\tchange saveToObj() to package protected so someone can serialize their own dictionaries instead.\n\n\n\nthe patch requires some binary dct data files which I will try to upload as a zip ",
            "author": "Robert Muir",
            "id": "comment-12748037"
        },
        {
            "date": "2009-08-26T17:20:48+0000",
            "content": "the two files in this directory need to be placed in smartcn/test under o/a/l/analysis/cn/smart/hmm/customDictionaryDCT ",
            "author": "Robert Muir",
            "id": "comment-12748038"
        },
        {
            "date": "2009-08-26T20:19:55+0000",
            "content": "i looked at this file format and I am going to create smaller custom dictionaries for testing.\n\nthis way we do not have huge files in svn ",
            "author": "Robert Muir",
            "id": "comment-12748126"
        },
        {
            "date": "2009-08-26T20:23:18+0000",
            "content": "Robert, I commited the javadoc changes. Once you have smaller dict files feel free to commit your patch. If you run into problems I would prefer to skip the tests (and the dict files) and commit it without this simple test. This should be fine.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12748127"
        },
        {
            "date": "2009-08-27T16:50:36+0000",
            "content": "Here is a javadocs-only patch that I think is the best solution.\n\nThis is because i created several custom dictionaries and found:\n1) it will be difficult to support this dictionary format for a number of reasons\n2) the dictionary format is limited to GB2312 encoding, and will not support things like traditional chinese\n3) even when creating a correct file in the correct format, there are many assumptions about what should be in the dictionary.\n   Especially things like WordDictionary.expandDelimiterData\n   If these assumptions are not met, things like infinite loops occur.\n\nI recommend we instead remove javadocs describing how to use a custom dictionary.\nAnd in this patch also expand the EXPERIMENTAL wording from just APIs, to both APIs and file formats.\nIn the future we should refactor and use a unicode-based format.\n\nI won't do anything here without some consensus that others feel it is the right way to go, but I think we should do this in 2.9 ",
            "author": "Robert Muir",
            "id": "comment-12748441"
        },
        {
            "date": "2009-08-27T18:41:00+0000",
            "content": "I agree Robert - given your concerns, lots drop custom support for now (even if just at the javadoc lvl if you can't do custom anyway without rebuilding the jar).\n\n+1 ",
            "author": "Mark Miller",
            "id": "comment-12748497"
        },
        {
            "date": "2009-08-27T18:47:17+0000",
            "content": "i will wait a bit and see if anyone has an issue with this, otherwise i would like to commit at the end of the day. ",
            "author": "Robert Muir",
            "id": "comment-12748500"
        },
        {
            "date": "2009-08-27T18:55:19+0000",
            "content": "I vote commit it now so it makes the RC - I can appreciate wanting to have consensus here - but silence is consensus in Lucene dev, - and twos often a crowd\nBy the powers vested in me as the RM (which are, essentially, none) I say pop this baby in. People have a week to complain and force us to take it out. I think this one is fairly clear territory though.\nLets put the first RC out with everything we know of taken care of. These are extraordinary times. ",
            "author": "Mark Miller",
            "id": "comment-12748505"
        },
        {
            "date": "2009-08-27T19:02:40+0000",
            "content": "Committed revision 808570. ",
            "author": "Robert Muir",
            "id": "comment-12748509"
        },
        {
            "date": "2012-01-28T01:01:29+0000",
            "content": "I am interested in working on adding the feature to allow use customized dictionary in text file, not DCT file.\nI have a couple of questions before trying on it.\n\nIn the package, I only saw .mem file. Where should I download .dct file and how to convert from text file to dct file? ",
            "author": "xlzhang",
            "id": "comment-13195310"
        }
    ]
}