{
    "id": "LUCENE-44",
    "title": "Thesauras capability",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "1.2",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "I would like Lucene to be able to add terms to a search automatically through a\nthesauras lookup.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2002-06-29T08:20:35+0000",
            "content": "This is not a bug, but rather a feature request.  We keep those in a TODO file\nin the CVS repository.  We don't use Bugzilla for this.\n\nAlso, one developer did mention that he may develop a component that would use A\nThesaurus to look up synonyms.\n\nThere is no ETA on that, but you are welcome to inquire on lucene-dev mailing list.\n ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321094"
        },
        {
            "date": "2002-07-04T09:02:12+0000",
            "content": "I opened this as an enhancement request, not as a bug, as anyone can clearly see\nfrom the severity being set to \"Enchancment\".  Based on the below text, which\ncomes directly from the Jakarta project site, this is supposed to be the\nmechanism to request feature enhancements.  I recieved one e-mail saying that\none of my bugs was closed, because you use a TODO list in CVS for enhancements.\n I know that Lucene hasn't been a Jakarta project for very long, but since it\nis, it should follow established Jakarta project methods for such a thing.  I\nfind it much easier to request a feature enhancement through the standard\nJakarta mechanism, because I can use to track my requests against the project. \nIf you want to add my request to the TODO list in CVS from here that is fine,\nbut I would like to track this through this request.\n\nPier Fumagalli has set up the Apache Bug Database. Please use this database\nreport bugs and suggest new features. To suggest a new feature, set the severity\nof the bug to \"enhancement\".\n\nThanks.\n ",
            "author": "Andrig T. Miller",
            "id": "comment-12321095"
        },
        {
            "date": "2003-10-09T16:23:15+0000",
            "content": "Your request is precisely what custom Analyzers are all about.  The core of Lucene supports this \nflexibly, so thesaurus lookup is possible.  This feature is not something that should be included \ninto the core, but rather as an extension.  We have a Lucene sandbox CVS repository for just such \ncustomizations - will we see your contribution there soon?!   ",
            "author": "Erik Hatcher",
            "id": "comment-12321096"
        },
        {
            "date": "2003-10-10T06:10:16+0000",
            "content": "Okay.  I believe I understand the rationale for not including this in the core.\n We will write it ourselves.\n\nThanks. ",
            "author": "Andrig T. Miller",
            "id": "comment-12321097"
        },
        {
            "date": "2003-10-15T20:45:54+0000",
            "content": "Also, take a look at WordNet/Synonyms section at\nhttp://jakarta.apache.org/lucene/docs/lucene-sandbox/ ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321098"
        }
    ]
}