{
    "id": "LUCENE-2404",
    "title": "Improve speed of ThaiWordFilter by CharacterIterator, factor out LowerCasing and also fix some bugs (empty tokens stop iteration)",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The ThaiWordFilter creates new Strings out of term buffer before passing to The BreakIterator., But BreakIterator can take a CharacterIterator and directly process on it without buffer copying.\nAs Java itsself does not provide a CharacterIterator implementation in java.text, we can use the javax.swing.text.Segment class, that operates on a char[] and is even reuseable! This class is very strange but it works and is in JDK 1.4+ and not deprecated.\n\nThe filter also had a bug: It stopped iterating tokens when an empty token occurred. Also the lowercasing for non-thai words was removed and put into the Analyzer by adding LowerCaseFilter.",
    "attachments": {
        "LUCENE-2404-2.patch": "https://issues.apache.org/jira/secure/attachment/12442205/LUCENE-2404-2.patch",
        "LUCENE-2404.patch": "https://issues.apache.org/jira/secure/attachment/12442201/LUCENE-2404.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-04-19T18:00:09+0000",
            "content": "New patch, which preserves backwards with matchVersion. It adds an LowerCaseFilter in the ctor of ThaiWordFilter automatically, so the bahviour does not change, except a second bug:\nThe previous version of the filter did not correctly lowercase a token that contains \"ThaiEnglishThai\" text. As the filter is now plugged before, it will lowercase this correctly, so its a backwards break.\n\nSince Version 3.1, the filter is no longer automatically used, instead ThaiAnalyzer plugs it before the filter (I reversed the order in contrast to previous patch to have the same order in deprecated and actual case). ",
            "author": "Uwe Schindler",
            "id": "comment-12858615"
        },
        {
            "date": "2010-04-19T18:17:27+0000",
            "content": "This is great. it already more than doubles the speed of this filter on english text...\n\nbut this filter has always been cheating with the UnicodeBlock check on charAt(0), as you could have EnglishThaiEnglish too.\nit also cheats because it doesn't check that the break boundaries are words, and not just spaces or punctuation.\n\nI suppose the above two things are not much of a problem if you assume StandardTokenizer, but maybe a problem for\nother Tokenizers... tricky to figure out how to make it correct and still as fast as the 'cheating' ",
            "author": "Robert Muir",
            "id": "comment-12858618"
        },
        {
            "date": "2010-04-19T18:24:45+0000",
            "content": "Another variant of the previous patch, slightly faster as Robert said, maybe we get an inspiration by that. It uses cloneAttributes and does not create new clones all the time. ",
            "author": "Uwe Schindler",
            "id": "comment-12858621"
        },
        {
            "date": "2010-04-19T18:32:37+0000",
            "content": "Looking at Uwe's code points out there is another bug in the old filter, \nit does not really handle position increments correctly.\n\nSo if there is a stopword or some other posInc it gets applied to all\nsubwords... in my opinion only the first token should carry this.\n\nOtherwise you can have problems like SOLR-1852 ",
            "author": "Robert Muir",
            "id": "comment-12858624"
        },
        {
            "date": "2010-04-19T19:29:31+0000",
            "content": "Yes, this is not a problem if you use the ThaiAnalyzer, as StopFilter comes after this filter. But users of Solr plugging this filter after a StopFilter will have problems. ",
            "author": "Uwe Schindler",
            "id": "comment-12858645"
        },
        {
            "date": "2010-04-19T20:33:32+0000",
            "content": "New version of the cloneAttributes-version, that produces correct position increments with matchVersion=3.1. ",
            "author": "Uwe Schindler",
            "id": "comment-12858670"
        },
        {
            "date": "2010-04-19T20:35:38+0000",
            "content": "Nice Uwe. So this patch fixes quite a few bugs and speeds things up... do you want to commit? ",
            "author": "Robert Muir",
            "id": "comment-12858672"
        },
        {
            "date": "2010-04-19T20:43:49+0000",
            "content": "I will commit this soon after adding changes. ",
            "author": "Uwe Schindler",
            "id": "comment-12858678"
        },
        {
            "date": "2010-04-19T20:58:17+0000",
            "content": "Committed revisions: 935734 (Lucene) & 935739 (Solr) ",
            "author": "Uwe Schindler",
            "id": "comment-12858680"
        },
        {
            "date": "2011-03-30T15:50:26+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013480"
        }
    ]
}