{
    "id": "LUCENE-2025",
    "title": "Ability to turn off the store for an index",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "New Feature",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "It would be really good in combination with parallel indexing if the\nLucene store could be turned off entirely for an index. \n\nThe reason is that part of the store is the FieldIndex (.fdx file),\nwhich contains an 8 bytes pointer for each document in a segment, even\nif a document does not contain any stored fields.\n\nWith parallel indexing we will want to rewrite certain parallel\nindexes to update them, and if such an update affects only a small\nnumber of documents it will be a waste if you have to write the .fdx\nfile every time.\n\nSo in the case where you only want to update a data structure in the\ninverted index it makes sense to separate your index into multiple\nparallel indexes, where the ones you want to update don't contain any\nstored fields.\n\nIt'd be also great to not only allow turning off the store but to make\nit customizable, similarly to what flexible indexing wants to achieve\nregarding the inverted index.\n\nAs a start I'd be happy with the ability to simply turn off the store and to\nadd more flexibility later.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-03-14T16:47:58+0000",
            "content": "Simon, watch out for INFRA-3517 – we have to be careful, when labeling, to not use the label with a trailing comma stuck on!\n\nIe this issue now has two such labels: 'gosc2011,' and 'mentor,'\n ",
            "author": "Michael McCandless",
            "id": "comment-13006506"
        },
        {
            "date": "2011-03-14T17:13:47+0000",
            "content": "Ie this issue now has two such labels: 'gosc2011,' and 'mentor,'\nthanks mike I changed them back to have no commas ",
            "author": "Simon Willnauer",
            "id": "comment-13006522"
        },
        {
            "date": "2012-05-23T19:55:10+0000",
            "content": "moving this over to 4.1 this won't happen in 4.0 anymore ",
            "author": "Simon Willnauer",
            "id": "comment-13281846"
        },
        {
            "date": "2012-08-31T14:40:53+0000",
            "content": "One simple way to do this today is to just use a codec that has a NoStoredFieldsImpl,\nThrows exception in its writer impl if you ask it to actually write any stored fields \n(e.g. startDocument(n) is called where n > 0), and does nothing in its reader impl.\n\nI think for the typical case its fairly uncommon, i looked into seeing if we could\noptimize this case for Lucene40's impl, but it introduces a lot of scary situations\nfor things like bulk merge.\n\nSo for now I really think this is a simple safe way at the moment, if someone wants to \nturn it off they just set this as their codec on indexwriter. ",
            "author": "Robert Muir",
            "id": "comment-13446003"
        },
        {
            "date": "2013-07-23T18:44:40+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717022"
        },
        {
            "date": "2014-04-16T12:54:23+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970735"
        }
    ]
}