{
    "id": "LUCENE-3275",
    "title": "SamplingAccumulatorTest hangs on Java 1.6.0u26",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "on the mac, a system update pushed out an upgrade to 1.6.0u26\n\nbasically, if i run 'ant test' from the faceting module, my jre completely hangs (0% cpu, won't even respond to kill -QUIT to print a stacktrace).\nThis is reproducable... it always happens inside SamplingAccumulatorTest.\n\nOf course if i run this test by itself, or anything else, it doesn't want to hang... but you should be able to reproduce by running 'ant test -Dtests.threadspercpu=0' which runs all tests sequentially.\n\nActs like http://forums.oracle.com/forums/thread.jspa?threadID=2246699\n\nI think this JRE version (update 26) is broken. If your mac asks you to upgrade, just say no.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-07-04T23:58:38+0000",
            "content": "Robert: did you file a new bug with oracle?\n\nIf the hypothesis of the reporter for the bug you linked to is correct, then it's not likely to be the same bug – in that case the debug info for the process suggested that it was hung getting translation info as part of a call to GraphicsEnvironment.getLocalGraphicsEnvironment().getAvailableFontFamilyNames() while running in headless mode.  none of which sound like they are likely to happen in one of our tests.\n\nthat report was also filed by someone working on proprietary code who couldn't post a reproducible test case.  If you can post jvm info, os info, and a lucene svn r# that reliable reproduces orcale would have a much better bug report to work with. ",
            "author": "Hoss Man",
            "id": "comment-13059641"
        },
        {
            "date": "2011-07-05T00:17:17+0000",
            "content": "hoss, no I did not.\n\nthis is basically just a warning for other devs not\nto upgrade to this broken jre on their macs.\n\notherwise your tests hang and you must kill -9 ",
            "author": "Robert Muir",
            "id": "comment-13059645"
        },
        {
            "date": "2011-07-05T10:37:55+0000",
            "content": "I wasn't able to get a hang on Fedora 13 Linux using 1.6.0_26... but I only tried ~10 iteration of ant test. ",
            "author": "Michael McCandless",
            "id": "comment-13059827"
        }
    ]
}