{
    "id": "LUCENE-4555",
    "title": "Partial matches in DisjunctionIntervalQueries trip assertions when collected",
    "details": {
        "components": [
            "core/search"
        ],
        "fix_versions": [
            "Positions Branch"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Sub-task",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "See, eg, all the TestOr* tests in TestBasicIntervals.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-13T12:00:22+0000",
            "content": "The TestOr* queries failing were due to bugs in the tests, of course...\n\nThe actual problem here is that DisjunctionIntervalIterator doesn't take snapshots of its intervals, so the iterator is already positioned when we collect.  I'll abstract out a SnapshotCollectingIntervalIterator, and both ConjunctionII and DisjunctionII can subclass from that. ",
            "author": "Alan Woodward",
            "id": "comment-13496127"
        },
        {
            "date": "2012-11-13T17:22:04+0000",
            "content": "OK, the relevant test here is TestNestedIntervalFilterQueries.testOrNearNearQuery.  It seems as though the bug is actually in PositionFilterScorer (which should be called IntervalFilterScorer, but anyway).  Will try and chase it down tonight. ",
            "author": "Alan Woodward",
            "id": "comment-13496349"
        },
        {
            "date": "2012-11-14T22:08:00+0000",
            "content": "I'm running into something of a brick wall here.\n\nThe problem arises when you have a DisjunctionII wrapping an IntervalFilter over a ConjunctionII.  When scorerAdvanced is called, a ConjunctionII can end up positioned on a document ahead of the parent DisjunctionII, which then trips asserts when the parent is advanced.  I've tried to work out a way round this but am failing so far.  Anybody else want to have a look? ",
            "author": "Alan Woodward",
            "id": "comment-13497518"
        },
        {
            "date": "2012-11-20T09:49:52+0000",
            "content": "Got it, fixed in 1411603 ",
            "author": "Alan Woodward",
            "id": "comment-13500949"
        }
    ]
}