{
    "id": "LUCENE-6187",
    "title": "explore symmetic docvalues pull API",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "priority": "Major",
        "status": "Resolved",
        "type": "Improvement"
    },
    "description": "Currently the DocValuesConsumer and NormsConsumer have a streaming pull API based on Iterable.\n\n\naddNumericField(FieldInfo field, Iterable<Number> values)\n...\naddSortedSetField(FieldInfo field, Iterable<BytesRef> values, Iterable<Number> docToOrdCount, Iterable<Number> ords)\n\n\n\nI think this was a good initial approach, but it has a few downsides:\n\n\tfor more complex structures (sorted/sortedset/sortednumeric) the codec must awkwardly handle multiple streams and sometimes inefficiently do extra passes.\n\tthousands of lines of XXXDocValues <-> Iterable bridge handling in merge code (when MultiDocValues already knows how to merge multiple subs)\n\tmissing values represented as null is awkward, complicated and a little trappy on the consumer.\n\n\n\nI think we should explore changing it to look more like postings:\n\naddNumericField(FieldInfo field, NumericDocValues values, Bits docsWithField)\naddSortedSetField(FieldInfo field, SortedSetDocValues values, Bits docsWithField)\n\n\n\nI don't think it would be hard on the implementation: e.g. when I look at IndexWriter it seems like these would even be simpler code than the current iterators (e.g. for numerics its already got a NumericDocValues and a Bits docsWithField, the current iterable stuff is just \"extra\" bridge code like merging).\n\nMy main concern is if it makes things easier on the codec impls or not. I think we have to try it out to see. We could test it out on trunk with just NormsConsumer.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14289269",
            "author": "Michael McCandless",
            "date": "2015-01-23T14:07:28+0000",
            "content": "+1 "
        },
        {
            "id": "comment-15906233",
            "author": "Michael McCandless",
            "date": "2017-03-11T15:58:14+0000",
            "content": "This was done with the switch to an iterator API for doc values for 7.0. "
        }
    ]
}