{
    "id": "LUCENE-2921",
    "title": "Now that we track the code version at the segment level, we can stop tracking it also in each file level",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Now that we track the code version that created the segment at the segment level, we can stop tracking versions in each file. This has several major benefits:\n\n\tToday the constant names that use to track versions are confusing - they do not state since which version it applies to, and so it's harder to determine which formats we can stop supporting when working on the next major release.\n\tThose format numbers are usually negative, but in some cases positive (inconsistency) – we need to remember to increase it \"one down\" for the negative ones, which I always find confusing.\n\tIt will remove the format tracking from all the *Writers, and the *Reader will receive the code format (String) and work w/ the appropriate constant (e.g. Constants.LUCENE_30). Centralizing version tracking to SegmentInfo is an advantage IMO.\n\n\n\nIt's not urgent that we do it for 3.1 (though it requires an index format change), because starting from 3.1 all segments track their version number anyway (or migrated to track it), so we can safely release it in follow-on 3x release.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-24T13:54:05+0000",
            "content": "On this thread (http://lucene.markmail.org/thread/2puabohgbkgtbq7o) we discussed the option of using Version in SI.getVersion(), and then we'll be able to easily compare segment versions. Also, after we do this, StringHelper.versionComparator can be deleted. ",
            "author": "Shai Erera",
            "id": "comment-13038561"
        },
        {
            "date": "2011-06-03T16:40:45+0000",
            "content": "bulk move 3.2 -> 3.3 ",
            "author": "Robert Muir",
            "id": "comment-13043555"
        },
        {
            "date": "2012-03-06T02:06:44+0000",
            "content": "3.6 pruning: can we push this out to 4.0? ",
            "author": "Robert Muir",
            "id": "comment-13222912"
        },
        {
            "date": "2012-03-06T06:40:50+0000",
            "content": "Removing 3.6 version. Since this requires an index format change, I think that it'd be good if we can resolve it by 4.0 Alpha. ",
            "author": "Shai Erera",
            "id": "comment-13223032"
        }
    ]
}