{
    "id": "LUCENE-4411",
    "title": "Depth requested in a facetRequest is reset when Sampling is in effect",
    "details": {
        "components": [
            "modules/facet"
        ],
        "fix_versions": [
            "4.0",
            "4.1",
            "3.6.2",
            "6.0"
        ],
        "affect_versions": "3.6.1,                                            4.0,                                            6.0",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "FacetRequest can be set a Depth parameter, which controls the depth of the result tree to be returned.\nWhen Sampling is enabled (and actually used) the Depth parameter gets reset to its default (1).",
    "attachments": {
        "OversampleWithDepthTest.java": "https://issues.apache.org/jira/secure/attachment/12545891/OversampleWithDepthTest.java",
        "LUCENE-4411.patch": "https://issues.apache.org/jira/secure/attachment/12546301/LUCENE-4411.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-20T11:51:05+0000",
            "content": "A Test revealing the bug for Trunk ",
            "author": "Gilad Barkai",
            "id": "comment-13459536"
        },
        {
            "date": "2012-09-20T11:51:50+0000",
            "content": "A Test revealing the bug for 3.6 ",
            "author": "Gilad Barkai",
            "id": "comment-13459538"
        },
        {
            "date": "2012-09-20T11:59:56+0000",
            "content": "When sampling is under effect, the original FacetRequest is replaces with a wrapper, which takes under account different sampling related parameters named OverSampledFacetRequest.\nThis \"wrapping\" class modifies only a small set of parameters in the request and should otherwise delegate everything to the original one - but it does not.\nSome of the information that is lost from the original request: SortOrder, SortBy, number of results to lable, ResultMode and Depth.\n\nA patch would be available shortly.\n ",
            "author": "Gilad Barkai",
            "id": "comment-13459543"
        },
        {
            "date": "2012-09-24T14:31:35+0000",
            "content": "Attached a proposed fix + test.\n\nDelegating is impossible as FacetRequest's getters are final. The only way to 'delegate' the information is using the setters in the wrapping class (e.g setDepth(original.getDepth()).\nThis solution does not seem the right one, but other approaches involves changing much more code and reducing the amount of protection the public API offers (e.g the user will find it easier to break something).\n\nThe patch also introduce (the missing) delegation of the SortBy, SortOrder, numResultsToLable and ResultMode methods.\n\nSomewhat out of scope of the issue - I tried to figure out why the wrapping and keeping the original request is important:\nThe count (number of categories to return) is final, set at construction. While Sampling is in effect, in order to better the chances of 'hitting' the true top-k results, the notion of oversampling is introduced, which asks for more than just K (e.g 3 * K results) - so another request should be made. The 'original' request is saves so the end-result would hold the original request, and not the over-sampled one (every FacetResult has its originating FacetRequest). ",
            "author": "Gilad Barkai",
            "id": "comment-13461827"
        },
        {
            "date": "2012-09-25T05:07:15+0000",
            "content": "Thanks Gilad ! Patch looks good, I'll commit it shortly. I'll also add a CHANGES entry. ",
            "author": "Shai Erera",
            "id": "comment-13462446"
        },
        {
            "date": "2012-09-25T07:24:49+0000",
            "content": "Committed to 3.6.2, 4x, and trunk.\n\nI also committed to lucene_solr_4_0 just in case we'll have another 4.0 candidate.\n\nThanks Gilad ! ",
            "author": "Shai Erera",
            "id": "comment-13462517"
        },
        {
            "date": "2013-03-22T16:29:13+0000",
            "content": "[branch_4x commit] Robert Muir\nhttp://svn.apache.org/viewvc?view=revision&revision=1392460\n\nLUCENE-4411: fix changes entry (this made it into 4.0) ",
            "author": "Commit Tag Bot",
            "id": "comment-13610716"
        },
        {
            "date": "2013-03-22T16:33:36+0000",
            "content": "[branch_4x commit] Shai Erera\nhttp://svn.apache.org/viewvc?view=revision&revision=1389722\n\nLUCENE-4411: Depth requested in a FacetRequest is reset when Sampling is in effect ",
            "author": "Commit Tag Bot",
            "id": "comment-13610765"
        },
        {
            "date": "2013-05-10T10:33:01+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13653796"
        }
    ]
}