{
    "id": "LUCENE-383",
    "title": "ConstantScoreRangeQuery - fixes \"too many clauses\" exception",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [
            "1.9",
            "2.0.0"
        ],
        "affect_versions": "1.4",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "ConstantScoreQuery wraps a filter (representing a set of documents) and returns\na constant score for each document in the set.\n\nConstantScoreRangeQuery implements a RangeQuery that works for any number of\nterms in the range.  It rewrites to a ConstantScoreQuery that wraps a RangeFilter.\n\nStill needed:\n\n\tunit tests (these classes have been tested and work fine in-house, but the\ncurrent tests rely on too much application specific code)\n\tcode review of Weight() implementation (I'm unsure If I got all the score\nnormalization stuff right)\n\texplain() implementation\n\n\n\nNOTE: requires Java 1.4 for BitSet.nextSetBit()",
    "attachments": {
        "ConstantScoreRangeQuery.java": "https://issues.apache.org/jira/secure/attachment/12314413/ConstantScoreRangeQuery.java",
        "ASF.LICENSE.NOT.GRANTED--ConstantScoreRangeQuery.java": "https://issues.apache.org/jira/secure/attachment/12312604/ASF.LICENSE.NOT.GRANTED--ConstantScoreRangeQuery.java",
        "ASF.LICENSE.NOT.GRANTED--ConstantScoreQuery.java": "https://issues.apache.org/jira/secure/attachment/12312603/ASF.LICENSE.NOT.GRANTED--ConstantScoreQuery.java",
        "TestConstantScoreRangeQuery.java": "https://issues.apache.org/jira/secure/attachment/12320654/TestConstantScoreRangeQuery.java",
        "ConstantScoreQuery.java": "https://issues.apache.org/jira/secure/attachment/12314414/ConstantScoreQuery.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2005-04-29T13:14:40+0000",
            "content": "Created an attachment (id=14877)\nConstantScoreQuery ",
            "author": "Yonik Seeley",
            "id": "comment-12322351"
        },
        {
            "date": "2005-04-29T13:15:04+0000",
            "content": "Created an attachment (id=14878)\nConstantScoreRangeQuery ",
            "author": "Yonik Seeley",
            "id": "comment-12322352"
        },
        {
            "date": "2005-05-02T03:48:33+0000",
            "content": "The ConstantScoreQuery requires java 1.4 for its skipTo() implementation, \nso this will have to wait until java 1.4 is a minimum requirement for \nLucene. \nSome time ago there was a bit of discussion on mixed boolean and \nscored queries, and I think the ConstantScoreQuery is a wellcome \naddition for such mixed queries. \nOne problem with the current score is that it is not really bound \nto a maximum, so it is difficult to choose a good constant score \nvalue in a mix. \nPerhaps that aspect of scoring should be tackled in the future. \n\nRegards, \nPaul Elschot \n ",
            "author": "Paul Elschot",
            "id": "comment-12322353"
        },
        {
            "date": "2005-09-17T06:11:01+0000",
            "content": "Refresh:\n\n\timplemented explain()\n\tchanged scoring so that score is simply the boost\n\tfixed bug in scoring (weight normalization)\n\tfixed bug where boost was not copied during rewrite\n\n ",
            "author": "Yonik Seeley",
            "id": "comment-12329580"
        },
        {
            "date": "2005-09-27T11:59:23+0000",
            "content": "> One problem with the current score is that it is not really bound\n> to a maximum, so it is difficult to choose a good constant score\n> value in a mix. \n\ntf() and lengthNorm() factors will vary by index, but I think idf() may be the most problematic since it can change over time as the index grows.\n\nWould it be better to add something like an idf(1,maxDocs()) factor? ",
            "author": "Yonik Seeley",
            "id": "comment-12330537"
        },
        {
            "date": "2005-09-27T16:18:29+0000",
            "content": "Since the constant score is taken from the query boost, idf issues\ncan be dealt with elsewhere. IOW I don't think there is a need to\ndeal with idf here.\n\nRegards,\nPaul Elschot ",
            "author": "Paul Elschot",
            "id": "comment-12330549"
        },
        {
            "date": "2005-10-27T06:23:21+0000",
            "content": "I like this patch.  It would be nice to have a unit test, and we need to agree that Lucene 1.9 will require java 1.4 (which seems reasonable to me) before we commit it.\n\nOnce this is committed, should we consider changing the query parser to use ConstantScoreRangeQuery for range queries?  That alone would probably solve the majority of too-many-clauses problems. ",
            "author": "Doug Cutting",
            "id": "comment-12356014"
        },
        {
            "date": "2005-10-27T06:49:32+0000",
            "content": "The functionality is definitely needed, I'm just not sure of the API yet.\nI also have a ConstantScorePrefixQuery/PrefixFilter that just needs to be cleaned up a bit before it can be contributed.\n\nDoug, you had brought up the possibility of having a flag on Query indicating if it was constant scoring or not... it would be simpler than reproducing Constant versions of all the query types.\nThe downside of that is the whole issue of query  immutability... if you set the constant-scoring flag on the root query, it really needs to set it on all of it's sub queries (and hence changes them).  You can easily get into trouble if a query is shared.\n\nTo avoid changing queries, you would have to follow the same strategy as rewrite()... \nYou would need to clone the query object, then set constantScoring, then call rewrite (which may clone it again).  Not the best for performance...\n\nOne solution is to communicate the fact that we want a constant scoring query in the rewrite method itself:  rewrite(Query query, int flags)\n ",
            "author": "Yonik Seeley",
            "id": "comment-12356018"
        },
        {
            "date": "2005-10-27T07:27:15+0000",
            "content": "Doug: actually we agreed to require Java 1.4 some time ago already. You can find that dicussion somewhere in the mail archives. ",
            "author": "Daniel Naber",
            "id": "comment-12356021"
        },
        {
            "date": "2005-10-28T01:41:18+0000",
            "content": "I hadn't heard about Doug's plans that Yonik refered to (to revamp all Query classes to support a constant score option) so forgive me if this is way off the mark:\n\nIf Doug's plan is fairly solid and just needs to be cranked out, then by all means it might make sense to go that route intstead of having seperate ConstantScoreRange and ConstantScorePrefix queries ... but if that plan is still very hypotheitcal, then perhaps the best course of action would be to commit Yonik's existing code into the contrib section.  \n\nNothing here requires any changes to the core codebase, and as of 1.9 the contrib code will start being reved/released on teh same schedule as the core correct? ... so there's really no downside to putting it in contrib.  If the other idea falls through, then this code could be \"promoted\" from contrib to the core (and perhaps then QueryParser could be changed to use it by default).  If the other plan does get implimented, then these classes can be deprecated in favor of the new ones (and their new API) ",
            "author": "Hoss Man",
            "id": "comment-12356105"
        },
        {
            "date": "2005-10-28T03:05:27+0000",
            "content": "Doug's suggestion is here:\nhttp://www.mail-archive.com/java-dev@lucene.apache.org/msg00532.html ",
            "author": "Yonik Seeley",
            "id": "comment-12356118"
        },
        {
            "date": "2005-10-29T01:53:39+0000",
            "content": "Yonik: I'd forgotten about that suggestion, thanks for remembering it!\n\nHoss: I think there are some nasty details still to be worked out in that suggestion, like how to cache bitvectors.  Long-term, I think it would be a better approach, but Yonik's ConstantScoreQuery stuff works well today.\n\nI think fixing common use cases, like range queries, from exploding in people's faces is a high priority.  So I would argue for changing QueryParser sooner rather than later.  If we ever implement my proposal then we can deprecate these classes.  The majority of folks just use QueryParser, and they won't know the difference. ",
            "author": "Doug Cutting",
            "id": "comment-12356221"
        },
        {
            "date": "2005-11-12T11:27:11+0000",
            "content": "a Unit test for ConstantScoreRangeQuery ... that was easy to crank out based on the existing BaseTestRangeFilter.\n\nOne catch is that the test currently fails: when i tried to prove that the scores were not only constant, but also equaled the boost I couldn't get it to work – perhaps I have a missunderstanding of how HItCollector works, but I thought that was the safest way to get a \"raw\" score. ",
            "author": "Hoss Man",
            "id": "comment-12357469"
        },
        {
            "date": "2005-11-12T11:48:54+0000",
            "content": "Cool, thanks for the tests!\n\nYou are getting the raw score from the HitCollector all right.  The internal score is equal to the boost, but there is also a query normalization factor that's applied...\n\nQuery.weight() calls Weight.sumOfSquaredWeights() which returns boost*boost.\nThen it calls Similarity.queryNorm(boost*boost) which returns 1/boost\nThen it calls Weight.normalize(1/boost), and I multiply 1/boost by boost and get 1.0\n\n ",
            "author": "Yonik Seeley",
            "id": "comment-12357473"
        },
        {
            "date": "2005-11-15T14:36:23+0000",
            "content": "I have committed these classes.\nUnless I hear objections, I'll change the QueryParser to use ConstantScoreRangeQuery, \nand allow the specification of open-ended ranges using \"*\". ",
            "author": "Yonik Seeley",
            "id": "comment-12357666"
        },
        {
            "date": "2006-04-10T19:49:49+0000",
            "content": "Hi,\n\nIt appears that ConstantScoreRangeQuery is already in the trunk.\nHowever, QueryParser still uses RangeQuery, not ConstantScoreRangeQuery.\n\nShould this issue be closed? Or are you still intending to change QueryParser to use the new class? ",
            "author": "Nadav Har'El",
            "id": "comment-12373843"
        },
        {
            "date": "2006-04-13T13:45:52+0000",
            "content": "I believe (but i'm not certain) that i remember a discusion on java-dev a while back regarding this and that there was some concensus not to make the QueryParser change until 2.0 so as not to affect the scores of existing searches.\n\ni could be completely wrong ",
            "author": "Hoss Man",
            "id": "comment-12374301"
        },
        {
            "date": "2006-05-10T02:17:03+0000",
            "content": "This has been fixed. ",
            "author": "Doug Cutting",
            "id": "comment-12378699"
        }
    ]
}