{
    "id": "LUCENE-7928",
    "title": "Change LatLonPointDistanceQuery and LatLonPointInPolygonQuery visibility to public",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Closed",
        "type": "Improvement",
        "components": [],
        "fix_versions": [
            "7.1",
            "master (8.0)"
        ]
    },
    "description": "Changing the visibility of these classes to public can be useful for accessing the getters (which are already public) to allow custom post processing of the query instances.",
    "attachments": {
        "LUCENE_7928.patch": "https://issues.apache.org/jira/secure/attachment/12881436/LUCENE_7928.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16123293",
            "date": "2017-08-11T12:50:34+0000",
            "content": "I don't think these classes shoudl be public, they are an implementation detail. \n\nTo create such queries, use LatLonPoint.newXXX() methods. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16123309",
            "date": "2017-08-11T13:03:05+0000",
            "content": "I agree that these queries should only be constructed via their factory methods, that is why the constructors are package protected. I like these two classes to be public to access the getters, which is useful for query processing. (which is what the percolator and luwak both do) ",
            "author": "Martijn van Groningen"
        },
        {
            "id": "comment-16123311",
            "date": "2017-08-11T13:06:14+0000",
            "content": "But this unnecessarily raises the surface area of the API, which makes it more confusing for users trying to figure the stuff out. This was part of the design of the whole API here, to have the most minimal surface area possible so that we'd have spatial stuff that was straightforward.\n\nI don't think we should make such changes for expert cases, at the expense of the typical case. I'm -1 to making this stuff public. ",
            "author": "Robert Muir"
        },
        {
            "id": "comment-16123377",
            "date": "2017-08-11T13:59:15+0000",
            "content": "Ok, I agree, that this is an expert use case and that the api shouldn't have to change for that. ",
            "author": "Martijn van Groningen"
        }
    ]
}