{
    "id": "LUCENE-4585",
    "title": "Spatial RecursivePrefixTreeFilter has some bugs with indexing non-point shapes",
    "details": {
        "components": [
            "modules/spatial"
        ],
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "affect_versions": "4.0",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "RecursivePrefixTreeFilter has some bugs that can occur when searching indexed shapes.  One bug is an unpositioned termsEnum.  It through an exception in testing; I'm not sure what its effects would be in production.  The other couple bugs are hard to describe here but were rare to occur in extensive testing. The effects were probably a slim chance of matching an indexed shape near the query shape. And SpatialPrefixTree does not support an indexed shape that covers the entire globe.\n\nThese bugs were discovered during development of tests for RPTF LUCENE-4419 which I will submit shortly.",
    "attachments": {
        "LUCENE-4585_PrefixTree_bugs.patch": "https://issues.apache.org/jira/secure/attachment/12555950/LUCENE-4585_PrefixTree_bugs.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-12-04T16:57:36+0000",
            "content": "The attached patch resolves the aforementioned problems.\n\nHowever note that when a point is indexed, the final full-length token is not indexed with a trailing leaf '+' byte variant; it was before.  The up-side is that we save one token per indexed point (~1/12th savings if 11 maxLevels).  The semantics of that '+' are intended to be that the entire grid cell represents an indexed shape for matching, so compare the rectangle for it with the query shape.  But for points, it should be the center point of the cell, so no '+'.\n\nIf a user doesn't re-index, then an indexed point is 1/2 the smallest grid cell closer to a query shape and as such might match when it didn't before.  Quite minor I think but worth mentioning. ",
            "author": "David Smiley",
            "id": "comment-13509854"
        },
        {
            "date": "2012-12-04T18:06:27+0000",
            "content": "Updated patch with the correct set of files. ",
            "author": "David Smiley",
            "id": "comment-13509912"
        },
        {
            "date": "2012-12-05T15:34:28+0000",
            "content": "I'll commit this tomorrow if there are no objections.\n\nFor those of you that didn't look at the patch, note that it adds an entry up in the API compatibility section:\n\n\n\tLUCENE-4585: Spatial PrefixTree based Strategies (either TermQuery or\n  RecursivePrefix based) MAY want to re-index if used for point data. If a\n  re-index is not done, then an indexed point is ~1/2 the smallest grid cell\n  larger and as such is slightly more likely to match a query shape.\n  (David Smiley)\n\n\nStrictly speaking this is not an API change but there wasn't a upgrade section.  This note I added is also quite minor (in fact the behavior of a point matching its entire grid cell might be desirable) so arguably I could simply not mention it; but I'm err'ing on the side of full disclosure. ",
            "author": "David Smiley",
            "id": "comment-13510535"
        },
        {
            "date": "2012-12-08T05:27:44+0000",
            "content": "[branch_4x commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1418009\n\nLUCENE-4585: PrefixTree bugs\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527045"
        },
        {
            "date": "2012-12-08T05:27:54+0000",
            "content": "[trunk commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1418008\n\nLUCENE-4585: Forgot another CHANGES.txt entry\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527060"
        },
        {
            "date": "2012-12-08T05:27:55+0000",
            "content": "[trunk commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1418006\n\nLUCENE-4585: PrefixTree bugs\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527062"
        },
        {
            "date": "2012-12-09T08:54:18+0000",
            "content": "[trunk commit] Doron Cohen\nhttp://svn.apache.org/viewvc?view=revision&revision=1418834\n\nLUCENE-4585: (Spatial PrefixTree) bring back few CHANGES.txt entries.\n\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13527372"
        },
        {
            "date": "2013-03-22T16:11:29+0000",
            "content": "[branch_4x commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1418009\n\nLUCENE-4585: PrefixTree bugs ",
            "author": "Commit Tag Bot",
            "id": "comment-13610459"
        }
    ]
}