{
    "id": "LUCENE-7989",
    "title": "Add computed (at segment flush) doc values fields",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Won't Fix",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Improvement",
        "components": [],
        "fix_versions": []
    },
    "description": "This is a failed experiment but I thought I'd open an issue and post the patch in case it inspires others.\n\nIt adds a new feature to Lucene, which lets you provide function (set via IndexWriterConfig) that is invoked at segment flush time to create a new doc values field as a function of all other doc values fields in that segment.  The newly created field is \"first class\", i.e. behaves as if you had indexed actual doc values fields on your documents, it can participate in index sort, etc.  The interesting thing about it is it has access to all other documents that made it into the flushed segment (by pulling doc values iterators for it).\n\nAnyway, I got the feature working, and it's surprisingly small core code change, but I had a very specific use case in mind, to \"coalesce\" documents by their families while sorting them by another field, and I realized that even though the feature is working, I cannot use it for this particular use case since the coalescing would break during merge (it's not just a simple \"merge sort\").  The test case I added, simulating my use case, fails on those seeds / test multipliers that trigger merging of the random index.\n\nI'll post a patch but I don't plan to push this any further!",
    "attachments": {
        "LUCENE-7989.patch": "https://issues.apache.org/jira/secure/attachment/12890880/LUCENE-7989.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16195902",
            "date": "2017-10-07T21:32:34+0000",
            "content": "Patch.\n\nActually, there's one small part of this I do plan to commit, just the changes to FieldInfos adding some detection of misuse of its Builder API. ",
            "author": "Michael McCandless"
        },
        {
            "id": "comment-16195999",
            "date": "2017-10-08T07:06:38+0000",
            "content": "Pretty cool, Mike. ",
            "author": "Dawid Weiss"
        }
    ]
}