{
    "id": "LUCENE-1958",
    "title": "ShingleFilter creates shingles across two consecutives documents : bug or normal behaviour ?",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.4.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "HI\n\nI add two consecutive documents that are indexed with some filters. The last one is ShingleFilter.\nShingleFilter creates a shingle spannnig the two documents, which has no sense in my context.\nIs that a bug oris it  ShingleFilter normal behaviour ? If it's normal behaviour, is it possible to change it optionnaly ?\n\nThanks\n\nMR",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2009-10-07T22:56:45+0000",
            "content": "You should ask bug or normal on the email lists before creating a bug report. ",
            "author": "Mark Miller",
            "id": "comment-12763293"
        },
        {
            "date": "2009-10-07T23:06:35+0000",
            "content": "this says affects version: 2.4.1, do you see this behavior with 2.9?\n\nI only ask this because ShingleFilter did not implement reset() until 2.9, so if you are using reusableTokenStream in your analyzer, maybe there is a problem, maybe not. ",
            "author": "Robert Muir",
            "id": "comment-12763297"
        },
        {
            "date": "2009-10-08T19:02:57+0000",
            "content": "It doesnt happen with Lucene 2.9 (just downloaded). ",
            "author": "MRIT64",
            "id": "comment-12763638"
        },
        {
            "date": "2009-10-08T19:08:21+0000",
            "content": "It doesnt happen with Lucene 2.9 (just downloaded). \n\nCan you tell me if you have made a custom analyzer? If so, does this analyzer implement reusableTokenStream?\n\nIf this is the case, its really not a bug, reset() is an optional operation and with Lucene 2.4.1 you can't safely reuse instances of ShingleFilter for this reason, it does not support reuse as of that version. ",
            "author": "Robert Muir",
            "id": "comment-12763641"
        },
        {
            "date": "2009-10-09T18:20:54+0000",
            "content": "\n\tYes, I use a custom analyser which uses reusableToken\n\n\n\n\n\tI dont know if reusableToken is supported or not in this version, but the method next(Token reusableToken)  is proposed on the ShingleFilter  2.4.1 Javadoc (see http://lucene.apache.org/java/2_4_1/api/org/apache/lucene/analysis/shingle/ShingleFilter.html). That's the reason why I have used it and I don't know how it works internally and the is nothing mentionned on the documentation.\n\n\n\nAnyway, it doesnt' matter know because the problem doesnt occur with Lucene 2.9.\n\nRegards ",
            "author": "MRIT64",
            "id": "comment-12764134"
        },
        {
            "date": "2009-10-09T18:28:12+0000",
            "content": "MRIT64, actually I am not curious about next(reusableToken), but instead whether your Analyzer implements \n\n\npublic TokenStream reusableTokenStream(String fieldName, Reader reader) throws IOException\n\n\n\nIf you were trying to reuse ShingleFilters in 2.4.1 with this technique, I think this would be unsafe. It is safe in 2.9\n\nAnyway, it doesnt' matter know because the problem doesnt occur with Lucene 2.9.\n\nOk to mark this issue as resolved? ",
            "author": "Robert Muir",
            "id": "comment-12764141"
        },
        {
            "date": "2009-10-10T11:34:49+0000",
            "content": "Yes, Ok to mark this issue as resolved ",
            "author": "MRIT64",
            "id": "comment-12764333"
        },
        {
            "date": "2009-10-10T12:35:51+0000",
            "content": "Not a problem in 2.9 ",
            "author": "Karl Wettin",
            "id": "comment-12764340"
        }
    ]
}