{
    "id": "LUCENE-7725",
    "title": "it should be possible to run \"ant precommit\" with java9",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Task",
        "components": [],
        "fix_versions": []
    },
    "description": "Eventually we'll want to be sure that ant precommit works even if you are using java9.\n\nThis is currently not possible because the ECJ (Eclipse JDT based) javadoc linter we use doesn't work on java9 – so we're blocked on that, and the build.xml explicitly fails fast.  (The fail fast logic in build.xml can currently be bypassed via a -Dis.jenkins.build=true system prop)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15891063",
            "date": "2017-03-01T21:24:50+0000",
            "content": "Currently precommit on master with java9 fails because...\n\n\n-ecj-javadoc-lint-unsupported:\n\nBUILD FAILED\n/home/hossman/lucene/dev/lucene/common-build.xml:1993: Linting documentation with ECJ is not supported on this Java version (9).\n\n\n\n\n...i haven't dug into this enough to figure out if there is a genuine problem running ECJ on java9, or if it's just an overly aggressive version restriction in the build file. ",
            "author": "Hoss Man"
        },
        {
            "id": "comment-15891138",
            "date": "2017-03-01T21:54:01+0000",
            "content": "The problem was Javadocs and it's linter. In addition, current ECJ cannot handle the missing rt.jar. There is work going on to release a new version that's able to handle Java 9. ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15891148",
            "date": "2017-03-01T22:01:32+0000",
            "content": "I can take this issue, but we have to wait for Java 9 to come out until ECJ works.\n\nBtw, you can run precommit also with Java 9 if you set an extra build property to activate \"Jenkins mode\". 🙄 ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15891173",
            "date": "2017-03-01T22:14:23+0000",
            "content": "Btw, you can run precommit also with Java 9 if you set an extra build property to activate \"Jenkins mode\".\n\nreally? what exactly does that look like?\n\nwe should document that here as a workaround. ",
            "author": "Hoss Man"
        },
        {
            "id": "comment-15891212",
            "date": "2017-03-01T22:33:05+0000",
            "content": "Hi,\n\nthis target explains it:\n\n\n  <target name=\"-ecj-javadoc-lint-unsupported\" unless=\"ecj-javadoc-lint.supported\">\n    <fail message=\"Linting documentation with ECJ is not supported on this Java version (${build.java.runtime}).\">\n      <condition>\n        <not><isset property=\"is.jenkins.build\"/></not>\n      </condition>\n    </fail>\n    <echo level=\"warning\" message=\"WARN: Linting documentation with ECJ is not supported on this Java version (${build.java.runtime}). NOTHING DONE!\"/>\n  </target>\n\n ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15891215",
            "date": "2017-03-01T22:35:17+0000",
            "content": "We (Robert and I) added the hard fail, because we wanted to prevent anybody from running precommit and missing the extra checks, just because they ran Java 9. In any case, if you run precommit, you should really, really only do that on Java 8. Because that's the version we compile against.\n\nNevertheless, we can remove the hard fail and just print the warning. But I'd not be happy.\n\nSo the fix is: ant precommit -Dis.jenkins.build=true ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15891221",
            "date": "2017-03-01T22:37:48+0000",
            "content": "BTW: If you try to run ECJ with current Java 9, it fails horribly with 24667 errors on Lucene-Core  Last one is most funny:\n\n\n [ecj-lint] 24667. ERROR in C:\\Users\\Uwe Schindler\\Projects\\lucene\\trunk-lusolr1\\lucene\\core\\src\\java\\org\\apache\\lucene\\util\\packed\\PagedMutable.java (at line 66)\n [ecj-lint]     @Override\n [ecj-lint]      ^^^^^^^^\n [ecj-lint] Override cannot be resolved to a type\n\n\n\nThis is because ECJ cannot find the JAR file with the runtime classes (rt.jar). We have to wait for a new version (see above). ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15892590",
            "date": "2017-03-02T16:49:12+0000",
            "content": "Nevertheless, we can remove the hard fail and just print the warning. But I'd not be happy.\n\nI am all in favor of the hard fail (by default) until it works completely – i just wanted to be sure we have open issues for all the \"known\" java9 problems so people reviewing the list in jira have an accurate picture of the situation.\n\nI've updated the description based on the added context you provided. (Thanks)\n\nAs far as the upstream bug blocking this: i found the two URLs below, do you know if there is a more specific ECJ bug# we can link to?\n\n\n\thttps://wiki.eclipse.org/Java9\n\thttps://bugs.eclipse.org/bugs/show_bug.cgi?id=456778\n\n\n ",
            "author": "Hoss Man"
        },
        {
            "id": "comment-15892670",
            "date": "2017-03-02T17:44:49+0000",
            "content": "I have no full overview of all bugs (same like you). There is not much visible activity around ECJ and Java 9. I am currently trying the latest ECJ version... Stay tuned. ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15892676",
            "date": "2017-03-02T17:47:38+0000",
            "content": "FYI, I also changed the Markdown converter from pegdown to flexmark: LUCENE-7727\nYou can now build documentation with Java 9. I did not yet try linting with our own python-based linter... ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-15892682",
            "date": "2017-03-02T17:48:53+0000",
            "content": "Stay tuned.\n\nNot working  (ECJ 4.6.1) ",
            "author": "Uwe Schindler"
        }
    ]
}