{
    "id": "LUCENE-5685",
    "title": "Add file:// support to crawl.maven.release.dist.sh",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem",
        "components": [],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": []
    },
    "description": "During the release process i always zip up and download the entire voted on RC folder locally, so I can commit the release artifacts. This is just the simplest way to avoid mistakes.\n\nMaven publishing is a mystery to me, I just follow the instructions exactly because I'm not totally sure what the directory structure should be that the scripts expect. \n\nCurrently this means i have to do a large file transfer over the internet again, because the crawl script wont work with a file:// url (the unzipped contents of the release folder i just downloaded).\n\nIt would be great if it could just use 'cp -r' or something for that, rather than wget, to save another large transfer.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14001663",
            "author": "Robert Muir",
            "content": "Or alternatively, perhaps we could just change the instructions on http://wiki.apache.org/lucene-java/PublishMavenArtifacts to work with a local copy of the release? \n\nThe crawler script intentionally excludes certain file types, so I'm not sure what happens during the publishing if they are present, or if thats just a small optimization... ",
            "date": "2014-05-19T13:12:16+0000"
        },
        {
            "id": "comment-14001737",
            "author": "Steve Rowe",
            "content": "Robert, I think it should be possible to just skip the crawler script step if you have a local copy.\n\nOr alternatively, perhaps we could just change the instructions on http://wiki.apache.org/lucene-java/PublishMavenArtifacts to work with a local copy of the release?\n\nThey already say that?  Feel free to fix if it's not clear:\n\nDownload the Lucene/Solr Maven artifacts (if you don't already have them)\n\nThe crawler script intentionally excludes certain file types, so I'm not sure what happens during the publishing if they are present, or if thats just a small optimization...\n\nThe crawler script excludes \"*.md5,*.sha1,maven-metadata.xml*,index.html*\" - *.md5, *.sha1 and maven-metadata.xml* files are excluded because these are re-generated by Maven Ant Tasks when it uploads artifacts to the staging repository, so they aren't needed; and index.html* are files auto-generated by the web server (and won't be present in a copy zipped up on the server).  In all cases, the excluded files are unnecessary, but their presence wouldn't actually cause trouble, because the artifact uploading process explicitly names all files to be uploaded. ",
            "date": "2014-05-19T14:53:53+0000"
        },
        {
            "id": "comment-14001902",
            "author": "Robert Muir",
            "content": "ok, so if i just point maven.dist.dir at my local copy of the release everything will \"work\" without having to remove any files or anything?\n\nIf so, we can just won't fix this. ",
            "date": "2014-05-19T15:41:02+0000"
        },
        {
            "id": "comment-14001936",
            "author": "Steve Rowe",
            "content": "ok, so if i just point maven.dist.dir at my local copy of the release everything will \"work\" without having to remove any files or anything?\n\nYes, I've done that in the past. ",
            "date": "2014-05-19T16:01:28+0000"
        }
    ]
}