{
    "id": "LUCENE-5813",
    "title": "Directory should implement Accountable",
    "details": {
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix",
        "components": [],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": []
    },
    "description": "Follow-up of LUCENE-5812.",
    "attachments": {
        "LUCENE-5813.patch": "https://issues.apache.org/jira/secure/attachment/12656319/LUCENE-5813.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14065374",
            "author": "Adrien Grand",
            "content": "Here is a patch. Directory implements Accountable and BaseDirectoryTestCase has a new test to check ram usage estimations ",
            "date": "2014-07-17T19:00:30+0000"
        },
        {
            "id": "comment-14065389",
            "author": "Uwe Schindler",
            "content": "I don't think Directory itsself should implement Accountable. In my opinion, just because some directories consume RAM, I don't think we should make all directories implement that.\n\nFor the issue mentioned in LUCENE-5812 I think the ramBytesUsed there should simply check with instanceof if the inner directory implements accountable and then add its size to itsself. Something thats not intended to be Accountable like a purely disk based dir, should not implement it. Because otherwise a NIOFSDirectory would need to return the size of its inner ByteBuffer caches or whatever.\n\n-1 to make Directory itsself Accountable. ",
            "date": "2014-07-17T19:12:09+0000"
        },
        {
            "id": "comment-14065487",
            "author": "Adrien Grand",
            "content": "I don' t think using instanceof Accountable works in general to measure memory usage. That's what I initially wanted to do with doc id sets, but this doesn't work as soon as you start using wrappers since they hide what interface the wrapped class implements. So for example if your NRT dir wraps a RateLimitedDirectoryWrapper that wraps another directory that implements Accountable, you would miss it.\n\nIf we don't want of Accountable on Directory, I would rather revert LUCENE-5812 to make clear that it only reports memory usage for the cache? ",
            "date": "2014-07-17T20:09:21+0000"
        },
        {
            "id": "comment-14065741",
            "author": "Ryan Ernst",
            "content": "In my opinion, just because some directories consume RAM, I don't think we should make all directories implement that.\n\nWhy can't any directories that don't consume RAM return 0 for ramBytesUsed()? ",
            "date": "2014-07-17T23:12:06+0000"
        }
    ]
}