{
    "id": "LUCENE-7937",
    "title": "Improve tests to play nicely w/IntelliJ IDE",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Closed",
        "type": "Improvement",
        "components": [
            "general/test"
        ],
        "fix_versions": [
            "7.1",
            "master (8.0)"
        ]
    },
    "description": "When running a single test in IntelliJ, something about the way the tests are run causes the UI to display all the tests in the class other than the one that was run as if they had been ignored. In contrast, running a single test in a typical test case class not derived from LuceneTestCase shows only the status of that test case method, not all the other methods in the class.\n\nThis is somewhat irritating since it makes it hard to see what's going on with the test of interest.\n\nThis is with IntelliJ 2017.1.4, junit 4.12",
    "attachments": {
        "Screen Shot 2017-08-23 at 4.27.19 PM.png": "https://issues.apache.org/jira/secure/attachment/12883412/Screen%20Shot%202017-08-23%20at%204.27.19%20PM.png",
        "Screen Shot 2017-08-23 at 4.27.49 PM.png": "https://issues.apache.org/jira/secure/attachment/12883411/Screen%20Shot%202017-08-23%20at%204.27.49%20PM.png",
        "Screen Shot 2017-08-23 at 4.28.22 PM.png": "https://issues.apache.org/jira/secure/attachment/12883410/Screen%20Shot%202017-08-23%20at%204.28.22%20PM.png"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16135184",
            "date": "2017-08-21T13:45:36+0000",
            "content": "Can you provide a screenshot of what you mean? Thanks. IDEs support selective test execution in a myriad of ways, so hard to tell what's happening here. ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-16139041",
            "date": "2017-08-23T20:35:45+0000",
            "content": "JUnit test runner display in IntelliJ shown above. The first image shows what happens when you run an entire LuceneTestCase class. The second one shows what happens when you run a single method in the same class – you see all the methods in orange and the one you ran in green (it passed). The last one shows what happens when you run a single method in another class (not a LuceneTestCase), which also has a lot of other methods that didn't get run, and are not displayed: just the one method shown passing.\n\nAlso – just to be totally explicit, I ran the single test cases by right-clicking and in that test runner output window, but the same thing happens if you run them from elsewhere, at least for all the options I know about. ",
            "author": "Mike Sokolov"
        },
        {
            "id": "comment-16139715",
            "date": "2017-08-24T07:37:10+0000",
            "content": "Thanks Mike. I'll take a look at it later today. ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-16139979",
            "date": "2017-08-24T12:35:44+0000",
            "content": "Yes, something is wrong here – the number of tests executed is fine, but the runner for some reason reports all tests, even those removed when applying Filterable on the runner... Thanks for reporting – I'll try to fix it, but can't give you any time frame. ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-16140732",
            "date": "2017-08-24T21:28:10+0000",
            "content": "This is a regression that happened at some point when I was refactoring code to work around another problem (with hierarchical test descriptions being identical in case of repeated tests). Unfortunately the IDEs are pretty dumb and what we do in randomized testing stretches JUnit assumptions a bit (for example we append randomization seed to each method execution if a single test is repeated).\n\nI filed an issue here and will think how to best handle it without breaking other stuff.\nhttps://github.com/randomizedtesting/randomizedtesting/issues/251 ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-16207468",
            "date": "2017-10-17T11:04:24+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar"
        }
    ]
}