{
    "id": "LUCENE-4268",
    "title": "Rename ResourceAsStreamReasourceLoader to ClasspathResourceLoader, supply simple FilesystemResourceLoader",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We should rename the class and also fix some bugs:\n\n\tClass/ClassLoader.getResourceAsStream() returns null when resource not found (which is a Java bug in my opinion) and does not throw IOException. SolrResourceLoader throws IOException, the Lucene \"example\" one should do the same. This prevents NPEs everywhere.\n\n\n\nImprovements:\n\n\tAdd no-arg CTOR that uses context class loader instead a given class. This is more what users want. Resource names must then include package name, of course.\n\n\n\nWe should also provide a second implementation that allows resource names to be full filesystem paths. I think for loading the resources like custom word list, this is the most wanted implementation. Loading of classes would be delegated to ClassLoader (of course).\n\nI dont like ResourceLoader also supplying newInstance(), can we remove this for analysis?",
    "attachments": {
        "LUCENE-4268.patch": "https://issues.apache.org/jira/secure/attachment/12538240/LUCENE-4268.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-28T10:48:58+0000",
            "content": "The current patch only contains the renamed ClasspathResourceLoader + bug fixes. No filesystem yet. ",
            "author": "Uwe Schindler",
            "id": "comment-13424316"
        },
        {
            "date": "2012-07-28T11:49:56+0000",
            "content": "Initial patch including all functionality.\n\nFilesystemResourceLoader resolves all resources against a base directory (similar to Solr's loader) and delegates all class lookups and resources not found to a delegate ResourceLoader. The default delegate is ClasspathResourceLoader with context classloader. ",
            "author": "Uwe Schindler",
            "id": "comment-13424321"
        },
        {
            "date": "2012-07-28T11:53:36+0000",
            "content": "+1 ",
            "author": "Chris Male",
            "id": "comment-13424322"
        },
        {
            "date": "2012-07-28T12:44:25+0000",
            "content": "Thanks Chris,\nattached new patch with test case that checks every combination of file resources and classloaders. It also fixes a bug regarding absolute paths. ",
            "author": "Uwe Schindler",
            "id": "comment-13424333"
        },
        {
            "date": "2012-07-28T13:26:37+0000",
            "content": "More test improvements. It is ready, I will commit this later! ",
            "author": "Uwe Schindler",
            "id": "comment-13424346"
        },
        {
            "date": "2012-07-28T19:28:54+0000",
            "content": "Committed trunk revision: 1366748\nCommitted 4.x revision: 1366749 ",
            "author": "Uwe Schindler",
            "id": "comment-13424408"
        }
    ]
}