{
    "id": "LUCENE-1722",
    "title": "SmartChineseAnalyzer javadoc improvement",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Chinese -> English, and corrections to match reality (removes several javadoc warnings)",
    "attachments": {
        "LUCENE-1722.txt": "https://issues.apache.org/jira/secure/attachment/12412073/LUCENE-1722.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-06-29T14:04:12+0000",
            "content": "patch file ",
            "author": "Robert Muir",
            "id": "comment-12725184"
        },
        {
            "date": "2009-06-30T15:00:11+0000",
            "content": "Robert, I had a look at this patch - good work! \n\nAre you planing to add more javadoc fixes to it, I found a couple of inline comment being still chinese in\nBigramDictionary.java\nBiSegGraph.java\nHHMMSegmenter.java\n\nand real javadoc in \nWordDictionary.java\n\nI also think we could remove the commented source code in \nSegToken.java\nSegTokenPair.java\n\nas well as the logger code in \nWordDictionary.java\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12725657"
        },
        {
            "date": "2009-06-30T15:00:36+0000",
            "content": "btw. do you speak chinese?!  ",
            "author": "Simon Willnauer",
            "id": "comment-12725658"
        },
        {
            "date": "2009-06-30T18:33:45+0000",
            "content": "Simon you are right, I only did the public scope javadoc (and some of the comments). I thought this was most important for now, since it would be what the users see.\n\nyou are correct there are some package/private/protected javadocs that i didn't get to.\nthere are also main methods, commented out test code as you mentioned.\nfinally, basically all the classes are in public scope, and many internal-only classes should instead be package protected (imho). This might involve reorganizing the files a bit.\n\nLet me know if you want me to do these things as well.\n\nThanks ",
            "author": "Robert Muir",
            "id": "comment-12725737"
        },
        {
            "date": "2009-06-30T19:53:41+0000",
            "content": "I thought this was most important for now, since it would be what the users see. \n\nI agree, those are most important. I really appreciate this doc work, again thanks for that. I would like to have this in for 2.9 preferably with all chinese documentation replaced. Would be greate if you could do it! \n\nall the classes are in public scope, and many internal-only classes should instead be package protected (imho). This might involve reorganizing the files a bit.\n\nagreement again. I would rather do that in a second patch / issue as soon as this one is commited. Would this remove some of the addtional documentation work? If so you can leave those as they are.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12725771"
        },
        {
            "date": "2009-06-30T20:07:20+0000",
            "content": "Simon, I believe fixing the scope issues would reduce the documentation work considerably. For many of the classes that really should not be public, there is still a lot of missing documentation.\n\nIn my opinion, things such as Utility class and everything in .hhmm package should be package-protected. I already wasted time partially javadocing these things, which probably wasn't a complete waste, but you get the idea.\n\nif you look it over, I think you can see I put much more effort into the main analyzer/tokenizer classes that should be public. So these docs are of higher-quality because I think both users and lucene developers will need to interact with these (such as porting to the new Token api, etc).\n\nI think in the short term, I like this patch as is because I think developers will be able to port it to the new API and users will be able to understand what it does.\n\nI can come back around later and do a more thorough job, but this isn't the only analyzer that needs some documentation improvements! ",
            "author": "Robert Muir",
            "id": "comment-12725778"
        },
        {
            "date": "2009-07-01T10:00:55+0000",
            "content": "In my opinion, things such as Utility class and everything in .hhmm package should be package-protected. I already wasted time partially javadocing these things, which probably wasn't a complete waste, but you get the idea.\nYeah those could be cleaned up quite a bit. Lets do this in a different patch / issue after this one is commited.\n\nI think in the short term, I like this patch as is because I think developers will be able to port it to the new API and users will be able to understand what it does.\nLets get it in, it is a huge improvement to the Chinese documentation and needed too.\n\n\nI can come back around later and do a more thorough job, but this isn't the only analyzer that needs some documentation improvements!\nThanks for the attitude!\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12725985"
        },
        {
            "date": "2009-07-01T10:34:34+0000",
            "content": "Just committed this javadoc improvment - thanks robert! ",
            "author": "Simon Willnauer",
            "id": "comment-12725992"
        },
        {
            "date": "2009-07-01T13:26:26+0000",
            "content": "Simon, thanks. It was mentioned on the mailing list that perhaps this analyzer might be moved in the future (since the datafiles cause analyzers.jar to be very large).\n\nSo, maybe at the same time when/if this is done the files could be reorganized in a way that allows a lot of these internal classes to be marked package private. ",
            "author": "Robert Muir",
            "id": "comment-12726053"
        },
        {
            "date": "2009-07-01T17:39:42+0000",
            "content": "It was mentioned on the mailing list that perhaps this analyzer might be moved in the future (since the datafiles cause analyzers.jar to be very large). \n\nI created a new issue for this - LUCENE-1728 feel free to grab it.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12726146"
        }
    ]
}