{
    "id": "LUCENE-2330",
    "title": "Allow easy extension of IndexWriter",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "IndexWriter is not so easy to extend. It hides a lot of useful methods from extending classes as well as useful members (like infoStream). Most of this stuff is very straightforward and I believe it's not exposed for no particular reason. Over in LUCENE-1879 I plan extend IndexWriter to provide a ParallelWriter which will support the parallel indexing requirements. For that I'll need access to several methods and members. I plan to contain in this issue some simple hooks, nothing fancy (and hopefully controversial). I'll leave the rest to specific issues. For now:\n\n\tIntroduce a protected default constructor and init(Directory, IndexWriterConfig). That's required because ParallelWriter does not itself index anything, but instead delegates to its Slices. So that ctor is for convenience only, and I'll make it clear (through javadocs) that if one uses it, one needs to call init(). PQ has the same pattern.\n\tExpose some members and methods that are useful for extensions (such as config, infoStream etc.). Some candidates are package-private methods, but these will be reviewed and converted on a case by case basis.\n\n\n\nI don't plan to do anything drastic here, just prepare IW for easier extendability.\n\nI'll post a patch after LUCENE-2320 is committed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-03-18T13:46:13+0000",
            "content": "Please, only open up something if you decorate it with @experimental @will.change.without.single.warning annotations like a christmas tree.\n\nWith luceneish freakyish back-compat policy you want to have as few things public as possible  ",
            "author": "Earwin Burrfoot",
            "id": "comment-12846903"
        },
        {
            "date": "2010-03-18T13:56:25+0000",
            "content": "Sure, I'll annotate whatever is needed for PI (e.g. protected/public but still for internal use) as @lucene.experimental. After we see more than one extension of IW, we can decide whether those API need to made 'public' in essence (i.e. w/o the annotation).\n\nI've been burned plenty of times w/ bw policy . ",
            "author": "Shai Erera",
            "id": "comment-12846906"
        },
        {
            "date": "2013-01-12T19:32:57+0000",
            "content": "I don't think this issue is relevant anymore. ",
            "author": "Shai Erera",
            "id": "comment-13552015"
        }
    ]
}