{
    "id": "LUCENE-805",
    "title": "New Lucene Demo",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/examples"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "The much maligned demo, while useful, could use a breath of fresh air.  This issue is to start collecting requirements about what people would like to see in a demo and what they don't like in the current one.\n\nIdeas (not necessarily in order of importance):\n1. More in-depth tutorial explaining indexing/searching\n2. Multilingual support/demonstration\n3. Better demonstration of querying capabilities: Spans, Phrases, Wildcards, Filters, sorting, etc.\n4. Dealing with different content types and pointers to resources\n5. Wiki use cases links – I think it would be cool to solicit people to contribute use cases to the docs. \n6. Demonstration of contrib packages, esp. Highlighter\n7. Performance issues/factors/tradeoffs.  Lucene lessons learned and best practices\n\n\nAdvanced tutorials:\n1. Hadoop + Lucene\n2. Writing custom analyzers/filters/tokenizers\n3. Changing Scoring\n4. Payloads (when they are committed)\n\nPlease contribute what else you would like to see.  I may be able to address some of these issues for my ApacheCon talk, but not all of them.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2007-02-15T16:37:57+0000",
            "content": "The examples from Lucene in Action are freely available and Otis and I are fine with assigning the ASL to them (its currently unspecified but implicitly ASLd).  If these would be useful, at least the  Indexer.java and Searcher.java which are better demos than current demo application, we're free to use that as a starter.  All the code could be contributed if folks are ok with that. \n\nIn fact, maybe Otis and I should do the 2nd edition codebase within the Lucene svn somewhere so that it serves as a built-in example. ",
            "author": "Erik Hatcher",
            "id": "comment-12473419"
        },
        {
            "date": "2007-02-15T16:59:07+0000",
            "content": "I'm all for that the examples from LIA, but I also think the key part  \nis the documentation that goes with it.  I don't think it should be a  \nrequirement to buy LIA (even though I think everyone should    )   \nin order to understand the demo.  So, we would have to figure out  \nsome way to get it documented w/o infringing on LIA, which may prove  \ndifficult.\n\n-Grant\n\n\n\n\n--------------------------\nGrant Ingersoll\nCenter for Natural Language Processing\nhttp://www.cnlp.org\n\nRead the Lucene Java FAQ at http://wiki.apache.org/jakarta-lucene/ \nLuceneFAQ\n\n ",
            "author": "Grant Ingersoll",
            "id": "comment-12473429"
        },
        {
            "date": "2007-02-15T19:24:05+0000",
            "content": "That was my concern as well, Grant.  At least the LIA code is fairly well self documenting (we used JUnit for a reason  and the build file itself is a nice example of how to launch applications and examples from a common starting point.  \n\nWhat other documentation would be needed to make this a palatable? ",
            "author": "Erik Hatcher",
            "id": "comment-12473480"
        },
        {
            "date": "2007-08-08T22:37:57+0000",
            "content": "Hmm, might be cool to make things real for the demo by using either the Wikipedia download or the Reuters download.  Thus, we could make the demo a Best Practices place as well. ",
            "author": "Grant Ingersoll",
            "id": "comment-12518567"
        }
    ]
}