{
    "id": "LUCENE-7037",
    "title": "Switch all exception tests to expectThrows()",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "priority": "Major",
        "status": "Resolved",
        "type": "Bug"
    },
    "description": "Tests expecting exceptions today are done in various ways.\n\nThe best ones look like this.\n\ntry {\n  something();\n  fail(\"message\");\n} catch (Exception expected) {\n  assertSomethingAbout(expected);\n}\n\n\n\nBut there are many forms (involving booleans and such). All of these are a little sketchy because it is all-too easy to just forget the fail() and then the whole test is useless.\n\n`expectThrows` was added in LUCENE-7009 which solves a lot of these problems. Its not perfect, but overall a big improvement. We should cut over all of our tests.",
    "attachments": {
        "LUCENE-7037.patch": "https://issues.apache.org/jira/secure/attachment/12788690/LUCENE-7037.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15154315",
            "author": "Robert Muir",
            "date": "2016-02-19T15:06:01+0000",
            "content": "Here is a patch. It fixes numerous instances of missing fail() calls and other problems. \n\nIf a test was \"crazy\" (e.g. multi-catch) then I did not switch it over.\nFor example catch (NoSuchFileException | FileNotFoundException). I think we should try to improve those APIs if possible instead?\n\nIn some cases the limitations of effectively-final meant I had to split up big tests into smaller ones or change local variables or similar. I see this as a good thing... "
        },
        {
            "id": "comment-15154342",
            "author": "Uwe Schindler",
            "date": "2016-02-19T15:24:08+0000",
            "content": "Thanks for the cleanup! +1 to commit this as first step. I did only skim through the patch, but looks fine! I love this!\n\nI have some unrelated comments:\n\n\tMaybe we should improve the expectThrows() assertion to also take a message like assertEquals(message,...). I just noticed that some messages were converted to comments in this patch (thanks), so I thought about that.\n\tAbout the multi-catch: I feel the same: FileNotFoundException should not be allowed anymore in Lucene 6. Only NoSuchFileException! BASTA  So clean up APIs. The old style RAFDirectory must then just convert them correctly and we assert that!\n\n "
        },
        {
            "id": "comment-15154348",
            "author": "Robert Muir",
            "date": "2016-02-19T15:29:31+0000",
            "content": "If we want to add one that takes message, I am fine. I did not do it here, because you get a clear exception (and if you expected a different one, it chains that incorrect one), and the test class and method name in the stacktrace should clarify what is wrong. I converted to comments if i felt those \"messages\" added additional context to document what the test is doing, but that is just that. \n\nThese are not error messages to end-users but test failures for developers, who will go look at the source code. So I think we should focus on testing exceptions correctly (e.g. inspection of its message that its really the exception we expect), and documenting and organizing our tests to be clear in general, instead of adding infra to pass this around at runtime.\n\nAlong the multi-catch: I feel the same way. The other big one is different exception type (always wrapped in RejectedExecution or something) when IndexSearcher uses an Executor. That is not good. "
        },
        {
            "id": "comment-15154487",
            "author": "Michael McCandless",
            "date": "2016-02-19T16:50:49+0000",
            "content": "This is wonderful, thanks Robert Muir!  I skimmed patch also, +1 to commit before it goes too stale. "
        }
    ]
}