{
    "id": "LUCENE-2854",
    "title": "Deprecate SimilarityDelegator and Similarity.lengthNorm",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "SimilarityDelegator is a back compat trap (see LUCENE-2828).\n\nApps should just [statically] subclass Sim or DefaultSim; if they really need \"runtime subclassing\" then they can make their own app-level delegator.\n\nAlso, Sim.computeNorm subsumes lengthNorm, so we should deprecate lengthNorm in favor of computeNorm.",
    "attachments": {
        "LUCENE-2854.patch": "https://issues.apache.org/jira/secure/attachment/12467791/LUCENE-2854.patch",
        "LUCENE-2854_fuzzylikethis.patch": "https://issues.apache.org/jira/secure/attachment/12467794/LUCENE-2854_fuzzylikethis.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-01-08T12:32:08+0000",
            "content": "I think we should simply make a hard break on the Sim.lengthNorm ->\ncomputeNorm cutover.  Subclassing sim is an expert thing, and, I'd\nrather apps see a compilation error on upgrade so that they realize\ntheir lengthNorm wasn't being called this whole time because of\nLUCENE-2828 (and that they must now cutover to computeNorm).\n\nSo I made lengthNorm final (and throws UOE), computeNorm abstract.  I\ndeprecated SimilarityDelegator, and fixed BQ to not use it anymore.\nThe only other use is FuzzyLikeThisQuery, but fixing that is a little\ntoo involved for today. ",
            "author": "Michael McCandless",
            "id": "comment-12979121"
        },
        {
            "date": "2011-01-08T13:36:19+0000",
            "content": "The above patch applies to 3.x\n\nFor trunk I plan to remove SimliarityDelegator from core, and move it (deprecated) into contrib/queries/... (private to FuzzyLikeThisQ).  At some point [later] we can fix FuzzyLikeThisQ to not use it... ",
            "author": "Michael McCandless",
            "id": "comment-12979128"
        },
        {
            "date": "2011-01-08T15:36:07+0000",
            "content": "here is the patch for fuzzylikethis for trunk... so you can remove the delegator completely in trunk. ",
            "author": "Robert Muir",
            "id": "comment-12979140"
        },
        {
            "date": "2011-01-08T15:41:45+0000",
            "content": "Is it possible to remove this method Query.getSimilarity also? I don't understand why we need this method!\n\n\n  /** Expert: Returns the Similarity implementation to be used for this query.\n   * Subclasses may override this method to specify their own Similarity\n   * implementation, perhaps one that delegates through that of the Searcher.\n   * By default the Searcher's Similarity implementation is returned.*/\n\n ",
            "author": "Robert Muir",
            "id": "comment-12979141"
        },
        {
            "date": "2011-01-08T18:53:54+0000",
            "content": "Is it possible to remove this method Query.getSimilarity also? I don't understand why we need this method!\n\nI would love to!  But I think that's for another day...\n\nI looked into this and got stuck with BoostingQuery, which rewrites to an anon subclass of BQ overriding its getSimilarity in turn override its coord method.  Rather twisted... if we can do this differently I think we could remove Query.getSimilarity. ",
            "author": "Michael McCandless",
            "id": "comment-12979174"
        },
        {
            "date": "2011-03-30T15:50:24+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013468"
        }
    ]
}