{
    "id": "LUCENE-4943",
    "title": "remove 'Changes to Backwards Compatibility Policy' from lucene/CHANGES.txt",
    "details": {
        "components": [],
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "CHANGES.txt is useful to summarize the changes in a release. \n\nHowever its expected that a lot of changes will impact the APIs, this currently hurts the quality of CHANGES.txt because it leads to a significant portion of changes (whether they be bugs, features, whatever) being grouped under this one title.\n\nIt also leads to descriptions of CHANGES being unnecessarily verbose.\n\nI think it makes CHANGES confusing and overwhelming, and it would be better to have a simpler 'upgrading' section with practical information on what you actually need to do (like Solr's CHANGES.txt).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-04-19T13:14:57+0000",
            "content": "+1 to have a better upgrading section (and the original issues just spread around the other sections like API changes, new Features,...), but we have it somehow already: MIGRATE.txt (currently it only contains migration to 4.0 (or 5.0 on trunk). ",
            "author": "Uwe Schindler",
            "id": "comment-13636350"
        },
        {
            "date": "2013-04-19T13:17:32+0000",
            "content": "I thought about MIGRATE.txt too, but I see its use for 'major releases'. Maybe we dont even need it any more long term and it was mainly just needed for 4.0 (hopefully we can get releases out faster so we dont need things like this).\n\nOne advantage of the \"Upgrading\" section is that it would make the Lucene and Solr CHANGES files more consistent, and I think the changes2html parser would already work with it? ",
            "author": "Robert Muir",
            "id": "comment-13636352"
        },
        {
            "date": "2013-04-19T13:46:47+0000",
            "content": "In my opinion, we should separate the migration/update guide completely from the changes.txt (also in solr).\n\nFrom the \"usability\" standpoint on the documentation homepage (index.xsl, the page generated by ant process-webpages) should have a separate link to this guide (like the MIGRATE.txt guide). By this a user gets a nice HTML-formatted guide.\n\nAnd the Markdown parser has more features to make nice HTML than changes2html. ",
            "author": "Uwe Schindler",
            "id": "comment-13636375"
        },
        {
            "date": "2013-04-19T18:00:12+0000",
            "content": "In my opinion, we should separate the migration/update guide completely from the changes.txt (also in solr).\n\n+1\n\nSmall note: The general open source convention seems to be INSTALL.txt and UPGRADE.txt ... when I attempted to help my boss upgrade his Lucene project from 3.x to 4.x, I was completely unaware of MIGRATE.txt, because I wasn't looking for that file.  Admittedly I was being shortsighted and had a PEBCAK moment when a helpful member of the dev list pointed me at the file, but I wonder how many other users miss it because of the name. ",
            "author": "Shawn Heisey",
            "id": "comment-13636668"
        },
        {
            "date": "2013-07-23T18:44:29+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716965"
        },
        {
            "date": "2014-04-16T12:54:54+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970918"
        }
    ]
}