{
    "id": "LUCENE-3144",
    "title": "FreqProxTermsWriter leaks file handles if exceptions are thrown during flush()",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.2",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "FreqProxTermsWriter leaks open file handles if exceptions are thrown during flush. Code needs to be protected by try-finally clauses.",
    "attachments": {
        "LUCENE-3144.patch": "https://issues.apache.org/jira/secure/attachment/12480415/LUCENE-3144.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-25T14:06:21+0000",
            "content": "Patch against 3x, adds safeMaybe() versions to MockIOWrapper which closes the underlying IO on exception.\n\nHowever, TestIndexWriterExceptions.testDocumentsWriterAbort still leaves open file handles. On Windows, I put a break point in several places throughout the test, and even after IW.close() is called, I still see that .tii, .tis and .frq are being kept by the Java process.\n\nIs it a bug that we don't close them (in actual code, not test)? They have no references in MockDirWrapper ... ",
            "author": "Shai Erera",
            "id": "comment-13039136"
        },
        {
            "date": "2011-05-25T15:24:59+0000",
            "content": "Turns out this is not a problem w/ MockDirWrapper and MockIOWrapper, but w/ FreqProxTermsWriter – it didn't call its consumers' .finish() in a finally clause, causing leaked file handles.\n\nThe changes I've done to MockIOWrapper cannot sustain, because if I keep them, then I hit an IOException from RandomAccessFile on \"handle is invalid\", which is b/c I close the stream in MockIOWrapper, and now FreqProx (after the fix) tries to close() it too, on the go seeking to some location and writing something.\n\nTherefore, I think this is the only fix that's required for this issue (the FreqProxTermsWriter). If so, I will also rename it and add a CHANGES entry. ",
            "author": "Shai Erera",
            "id": "comment-13039158"
        },
        {
            "date": "2011-05-25T15:50:57+0000",
            "content": "Looks great Shai!  Nice catch  ",
            "author": "Michael McCandless",
            "id": "comment-13039169"
        },
        {
            "date": "2011-05-25T15:58:08+0000",
            "content": "Thanks for tracking this one down Shai!\n\nAfter fixing this, is it then possible to fail lucene tests if we cannot delete the directory, or are there still issues with special tests? ",
            "author": "Robert Muir",
            "id": "comment-13039176"
        },
        {
            "date": "2011-05-25T17:49:13+0000",
            "content": "I think that it will be good to fail the test if we fail to delete directories. Only problem is that on Linux it won't fail, which means we won't see build failures. I wonder if MockDirWrapper can catch that for us though ...\n\n\n    if (noDeleteOpenFile && openFiles.size() > 0) {\n      // print the first one as its very verbose otherwise\n      Exception cause = null;\n      Iterator<Exception> stacktraces = openFileHandles.values().iterator();\n      if (stacktraces.hasNext())\n\n\n\nWhen I debug-traced the failures, I noticed that I never went inside the 'if' even though noDeleteOpenFile was true. I'm pretty sure that openFileHandles is not empty, b/c only MockIO/IIWrappers removes themselves from it. We should at least be able to report those handles that were open but never closed.\n\nI will commit this fix to 3x. I saw same file exists in trunk, so I'll fix it there too and try to catch any other failures. ",
            "author": "Shai Erera",
            "id": "comment-13039236"
        },
        {
            "date": "2011-05-25T17:53:20+0000",
            "content": "Changed issue title and description. ",
            "author": "Shai Erera",
            "id": "comment-13039241"
        },
        {
            "date": "2011-05-25T18:10:12+0000",
            "content": "I see that MockDirWrapper.createOutput does not add the IndexOutput to openFiles, only to openFileHandles, while openInput adds the IndexInput to both. Then MockIndexInput removes itself from the Map. Is it a bug?\n\nAs a side note, and maybe a separate issue, I think we should improve the way MockII/IO interact w/ MockDirWrapper. Currently they access the maps directly, and I prefer them to be accessed via methods. That way we can better track what's going on on failures. ",
            "author": "Shai Erera",
            "id": "comment-13039256"
        },
        {
            "date": "2011-05-25T18:18:27+0000",
            "content": "Resolving this issue. We can track the MockDir stuff separately.\n\nCommitted revision 1127614 (3x).\nCommitted revision 1127615 (trunk).\n\nThanks Mike and Robert for the review ! ",
            "author": "Shai Erera",
            "id": "comment-13039260"
        },
        {
            "date": "2011-06-03T16:37:20+0000",
            "content": "Bulk closing for 3.2 ",
            "author": "Robert Muir",
            "id": "comment-13043529"
        }
    ]
}