{
    "id": "LUCENE-5629",
    "title": "Comparing the Version of Lucene , the Analyzer and the similarity function that are being used for indexing and searching.",
    "details": {
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem",
        "components": [
            "core/index",
            "core/queryparser",
            "core/search"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.8",
            "4.9",
            "6.0"
        ]
    },
    "description": "We have observed that Lucene does not check if the same Similarity function is used during indexing and searching. The same problem exists for the Analyzer that is used. This may lead to poor or misleading results.\n\nSo we decided to create an xml file during indexing that will store information such as the Analyzer and the Similarity function that were used as well as the version of Lucene that was used. This xml file will always be available to the users.\n\nAt search time , we will retrieve this information using SAX parsing and check if the utils used for searching , match those used for indexing. If not , a warning message will be displayed to the user.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13979875",
            "author": "Ahmet Arslan",
            "content": "The same problem exists for the Analyzer that is used.\nCan't we use different analyzers for indexing and searching? e.g. WordDelimiterFilter, SynonymFilter, NGramFilter, etc.  ",
            "date": "2014-04-24T15:56:56+0000"
        },
        {
            "id": "comment-13979884",
            "author": "Erick Erickson",
            "content": "Closing, if you still think this is a problem we can re-open.\n\nAllowing different analyzers at index and query time is a deliberate decision. Otherwise all the effort that went in to allowing independent index and query analysis chains could have been avoided. In particular synonyms are often defined at index time but not at query time. ",
            "date": "2014-04-24T16:05:55+0000"
        },
        {
            "id": "comment-13985357",
            "author": "Isabel Mendonca",
            "content": "Leaving aside the comparing part, wouldn't it be useful to store the information concerning the indexing into a separate file? In that way, the index and query analysis will still be independent and this information will be accessible to whoever wants to see it.  ",
            "date": "2014-04-30T10:35:49+0000"
        },
        {
            "id": "comment-13985384",
            "author": "Ahmet Arslan",
            "content": "store the information concerning the indexing into a separate file?\nYou mean a separate file other than schema.xml? ",
            "date": "2014-04-30T11:34:15+0000"
        },
        {
            "id": "comment-13985426",
            "author": "Isabel Mendonca",
            "content": "What we meant is an xml file containing indexing metadata such as the similarity function and the analyzer. This xml file could be stored in a different location from where the actual index exists.  ",
            "date": "2014-04-30T12:45:58+0000"
        }
    ]
}