{
    "id": "LUCENE-606",
    "title": "Change behavior of ParallelReader.document(int)",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "2.0.0",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "Currently, the returned documents contain, for each field, the stored data from all enclosed IndexReaders which contain the corresponding field.\nThat is, a call to ParallelReader.document(doc).getFields(fieldName) returns an array of possibly several Field objects. Since null entries are disallowed, there is no way to determine to which IndexReader the field data exactly belongs.\n\nOn the other side, a search for a term on that field only yields results if that term was contained in the first matching IndexReader which contained the field.\nThus, when merging the ParallelReader contents to another IndexWriter, the indexed data does not correspond to the stored information.\n\nI am not sure whether this can be considered a bug (in some cases, this may exactly be required). However I would like to see an option to change this behaviour.\n\nI suggest a parameter for ParallelReader which specifies whether stored data from all IndexReaders or only from the one which is repsonsible for the field's indexed data will be returned by ParallelReader.document(int).\n\nPlease find my proposed implementation attached, as well as a JUnit testcase.",
    "attachments": {
        "ParallelReaderTest2.java": "https://issues.apache.org/jira/secure/attachment/12335618/ParallelReaderTest2.java",
        "patch-allfields.diff": "https://issues.apache.org/jira/secure/attachment/12335617/patch-allfields.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2006-06-19T19:10:58+0000",
            "content": "Patch to ParallelReader. Implementation of the proposed parameter.\n\n ",
            "author": "Christian Kohlschuetter",
            "id": "comment-12416749"
        },
        {
            "date": "2006-06-19T19:11:58+0000",
            "content": "Testcase demonstrating the new feature. ",
            "author": "Christian Kohlschuetter",
            "id": "comment-12416752"
        },
        {
            "date": "2011-01-27T10:16:38+0000",
            "content": "Closing due to long inactivity, and also because I don't think it's a bug. IndexReaders today expose a getSequentialSubReaders API which allows one to fetch a Document's fields from whatever sub-reader they want. Also, the general concept behind ParallelReader is that fields do not exist in more than 1 sub-reader. ",
            "author": "Shai Erera",
            "id": "comment-12987476"
        }
    ]
}