{
    "id": "LUCENE-4445",
    "title": "Fix clover to correcty instrument all packages, improve permgen",
    "details": {
        "components": [
            "general/test"
        ],
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "affect_versions": "4.0",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This is a very stupid problem, but after a long time sitting in fornt of the build.xml's I found it:\n\n1. The biggest problem was: the target \"-clover.init\" was made in a way that it used the clover.loaded sysprop to avoid permgen issues. Unfortunatley it not only loaded clover, it also set it up in this task (setting the java source file folders). If the taskdef was then loaded for the first time, it had its source folders set up with the module it was called first. The later coming compilation of another module did not run clover.setup anymore, so no new source folders were configured. I splitted the IVY-Load+Taskdef from the clover setup.\n\n2. I also improved the code duplication for compile in test-framework. I made it inherit from common-build, but disable clover instrumentation for test-framework by overriding -clover.setup target in the test-frameworks (Lucene+Solr).\n\n3. I fixed some permgen issues, so -clover.load is only executed onec. I had to use a trick to pass the classpath to ivy's cachepath down to the subants, because we don't inherit refs. The trick was to make the clover.loaded property contain a stringified version of the clover classpath instead of a simple \"true\". By that it is automatically passed down using the propertyset.",
    "attachments": {
        "LUCENE-4445.patch": "https://issues.apache.org/jira/secure/attachment/12546976/LUCENE-4445.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-28T10:17:04+0000",
            "content": "Committed trunk revision: 1391382\nCommitted 4.x revision: 1391383\n\nI did not commit to 4.0 branch. We can backport this once we setup jenkins runs before a 4.0.1 release (if we want clover). ",
            "author": "Uwe Schindler",
            "id": "comment-13465505"
        },
        {
            "date": "2013-03-22T16:30:38+0000",
            "content": "[branch_4x commit] Uwe Schindler\nhttp://svn.apache.org/viewvc?view=revision&revision=1391383\n\nMerged revision(s) 1391382 from lucene/dev/trunk:\nLUCENE-4445: Fix clover to correcty instrument all packages, improve permgen ",
            "author": "Commit Tag Bot",
            "id": "comment-13610733"
        }
    ]
}