{
    "id": "LUCENE-2570",
    "title": "Some improvements to _TestUtil and its usage",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Test",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I've started this issue because I've noticed that _TestUtil.getRandomMultiplier() is called from many loops' condition check, sometimes hundreds and thousands of times. Each time it does Integer.parseInt after calling System.getProperty. This really can become a constant IMO, either in LuceneTestCase(J4) or _TestUtil, as it's not expected to change while tests are running ...\n\nI then reviewed the class and spotted some more things that I think can be fixed/improved:\n\n\tgetTestCodec() can become a constant as well\n\tarrayToString is marked deprecated. I've checked an no one calls them, so I'll delete them. This is a 4.0 code branch + a test-only class. No need to deprecate anything.\n\tgetTempDir calls new Random(), instead of newRandom() in LuceneTestCaseJ4, which means that if something fails, we won't know the random seed used ...\n\t\n\t\tIn that regard, we might want to output all the classes that obtained a static seed in reportAdditionalFailures(), instead of just the class that ran the test.\n\t\n\t\n\trmDir(String) can be removed IMO, and leave only rmDir(File)\n\tI suggest we include some recursion in rmDir(File) to handle the deletion of nested directories.\n\t\n\t\tAlso, it does not check whether the dir deletion itself succeeds (but it does so for the files). This can bite us on Windows, if some test did not close things properly.\n\t\n\t\n\n\n\nI'll work out a patch.",
    "attachments": {
        "LUCENE-2570.patch": "https://issues.apache.org/jira/secure/attachment/12450583/LUCENE-2570.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-07-27T08:40:10+0000",
            "content": "In that regard, we might want to output all the classes that obtained a static seed in reportAdditionalFailures(), instead of just the class that ran the test.\n\nI think that one might be confusing? because one test class can't really affect another. I like all your other suggestions though! ",
            "author": "Robert Muir",
            "id": "comment-12892691"
        },
        {
            "date": "2010-07-27T08:51:13+0000",
            "content": "I was thinking of the fix to getTempDir that I proposed. If _TestUtil should obtain such static random, then it (1) needs to extend LuceneTestCaseJ4 and (2) will affect all the classes that call this method.\n\nI'm not sure I like having _TestUtil extending LTCJ4, and not sure that particular random can affect any test failure ... so perhaps I'll leave that fix outside? ",
            "author": "Shai Erera",
            "id": "comment-12892693"
        },
        {
            "date": "2010-07-27T08:58:17+0000",
            "content": "We can remove the whole class and move the code to LTC(J4)? ",
            "author": "Uwe Schindler",
            "id": "comment-12892694"
        },
        {
            "date": "2010-07-27T09:18:41+0000",
            "content": "Another option, is if _TestUtil has methods that need a random, make it a required argument? ",
            "author": "Robert Muir",
            "id": "comment-12892700"
        },
        {
            "date": "2010-07-27T10:25:01+0000",
            "content": "I don't think that removing the class is a good idea. Some methods like rmDir can exist on the base test classes, however the class also contains large arrays blockStarts/Ends and it will just clatter the base test class, I think. What do you think?\n\nAnother option, is if _TestUtil has methods that need a random, make it a required argument? \n\nI had thought about it, but that method is called from several places in the code, and the randomness seems very insignificant. It just adds a random number to the directory name the caller requested. If it is in order to prevent collisions, then the code isn't safe because there is a chance the same number will be generated twice ... ",
            "author": "Shai Erera",
            "id": "comment-12892711"
        },
        {
            "date": "2010-07-27T10:44:04+0000",
            "content": "Most of the patch is about replacing the calls to getRandomMultiplier w/ the static constant reference. All tests pass, except the one that is fixed in LUCENE-2568 (but not committed yet). Unless you have more comments, I'd like to commit this shortly. ",
            "author": "Shai Erera",
            "id": "comment-12892714"
        },
        {
            "date": "2010-07-27T10:49:46+0000",
            "content": "the only comment i have is exposing TEST_CODEC as public... can it be private? \n\nI don't think its very useful since it could be a value like \"random\" (and is by default!) which isnt actually a valid codec, its basically just internal to LuceneTestCase[J4] ",
            "author": "Robert Muir",
            "id": "comment-12892716"
        },
        {
            "date": "2010-07-27T11:03:02+0000",
            "content": "I can make it private, but then I'll need to repeat the declaration line in both LTC and LTCJ4. Currently, LTC just references the one in LTCJ4. If that matters, I can make it package-private? ",
            "author": "Shai Erera",
            "id": "comment-12892722"
        },
        {
            "date": "2010-07-27T11:13:20+0000",
            "content": "package-private works... i just wanted to prevent confusion since i don't think its very useful outside of LuceneTestCase[J4]  ",
            "author": "Robert Muir",
            "id": "comment-12892725"
        },
        {
            "date": "2010-07-27T11:18:42+0000",
            "content": "ok will do, and commit. ",
            "author": "Shai Erera",
            "id": "comment-12892729"
        },
        {
            "date": "2010-07-27T14:28:21+0000",
            "content": "Committed revision 979646 (trunk).\nCommitted revision 979720 (3x). ",
            "author": "Shai Erera",
            "id": "comment-12892795"
        },
        {
            "date": "2011-03-30T15:50:26+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013479"
        }
    ]
}