{
    "id": "LUCENE-6438",
    "title": "Improve clean-jars when dealing with symbolic links.",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "Ever since I started seeing jars in the lib folders use symbolic links on linux I've run into jar problems when working with an old checkout or switching branches on a git checkout. You would normally expect ant clean-jars to help, but it didn't and led to some headaches and random bs.\n\nTurns out, clean-jars is not properly removing all symbolic links for me. I've seen two cases - symbolic links to jars that are not removed and broken symbolic links to jars.\n\nI can get rid of the symbolic links with the following:\n\n\n  <target name=\"clean-jars\" description=\"Remove all JAR files from lib folders in the checkout\">\n    <delete failonerror=\"true\" removeNotFollowedSymlinks=\"true\">\n      <fileset dir=\".\" followsymlinks=\"false\">\n\n\n\nBut that doesn't work with the broken links.\n\nI guess you can remove those with the Ant Symlink task, but it seems only specifically one at a time which is not that useful.",
    "attachments": {
        "LUCENE-6438.patch": "https://issues.apache.org/jira/secure/attachment/12803868/LUCENE-6438.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14502197",
            "author": "Robert Muir",
            "date": "2015-04-20T00:52:04+0000",
            "content": "The best solution is not to use clean-jars. Clean-jars is useless, except for a lone solr place: solr/server, because of its \"sync-hack\". If that can somehow be removed, clean-jars would never be needed, and we would just let ivy do its thing. "
        },
        {
            "id": "comment-14502236",
            "author": "Mark Miller",
            "date": "2015-04-20T02:10:05+0000",
            "content": "I'm not so sure that is the only issue - the jars are often in solr/server, but I've seen the problem in other dirs as well - like the lucene test framework module and other solr modules and contribs.\n\nI have just assumed the sync is still buggy. I tried upgrading to ivy 2.4.0 as part of the initial investigation into this I did. "
        },
        {
            "id": "comment-14502307",
            "author": "Mark Miller",
            "date": "2015-04-20T03:42:23+0000",
            "content": "If that can somehow be removed\n\nI'll remove it in SOLR-7429. "
        },
        {
            "id": "comment-14503127",
            "author": "Mark Miller",
            "date": "2015-04-20T16:25:40+0000",
            "content": "So given that clean-jars is currently weak when dealing with the sym links option and theoretically we should not need it once SOLR-7429 is resolved, are there any objections to removing it? "
        },
        {
            "id": "comment-15282666",
            "author": "Christine Poerschke",
            "date": "2016-05-13T12:37:32+0000",
            "content": "LUCENE-6074 introduced symlinks to jars. "
        },
        {
            "id": "comment-15282732",
            "author": "Steve Rowe",
            "date": "2016-05-13T14:29:02+0000",
            "content": "Patch that fixed the problem for me, from last year, but the idea will still apply even if the patch won't.\n\nI haven't run into this problem recently, so I can't say for sure whether the sync-hack removal fixed all of the problems. "
        }
    ]
}