{
    "id": "LUCENE-3238",
    "title": "SpanMultiTermQueryWrapper with Prefix Query issue",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.3"
        ],
        "affect_versions": "3.3",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "If we try to do a search with SpanQuery and a PrefixQuery this message is returned:\n\n\"You can only use SpanMultiTermQueryWrapper with a suitable SpanRewriteMethod.\"\n\nThe problem is in the WildcardQuery rewrite function.\n\nIf the wildcard query is a prefix, a new prefix query is created, the rewrite method is set with the SpanRewriteMethod and the prefix query is returned.\n\nBut, that's the rewritten prefix query which should be returned:\n\n\n\treturn rewritten;\n+      return rewritten.rewrite(reader);\n\n\n\nI will attach a patch with a unit test included.",
    "attachments": {
        "LUCENE-3238.patch": "https://issues.apache.org/jira/secure/attachment/12483710/LUCENE-3238.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-06-24T13:55:07+0000",
            "content": "Here is the patch for the branch 3x. ",
            "author": "Ludovic Boutros",
            "id": "comment-13054456"
        },
        {
            "date": "2011-06-24T14:21:26+0000",
            "content": "Hi, definitely a bug, thank you!\n\nIn my opinion, WildcardQuery should not try to override MultiTermQuery's rewrite here, it causes too many problems.\n\nInstead, in this case it should just return a PrefixTermEnum... this is the way we handle these things in trunk and I think we should fix it here the same way. ",
            "author": "Robert Muir",
            "id": "comment-13054464"
        },
        {
            "date": "2011-06-24T14:22:52+0000",
            "content": "The fix is fine, but in my optinion the problem should be solved differently.\n\nI would like to make the rewrite method in MultiTermQuery final to prevent override. To correctly fix the issue, WildcardQuery only needs to return a PrefixTermEnum in its getEnum method. This is already fixed in Lucene 4.0.\n\nFrom looking at the code, SpanMultiTermQueryWrapper would not work correct in all cases, if the underlying query overwrites rewrite(), as the rewritten query would again have the wrong type. ",
            "author": "Uwe Schindler",
            "id": "comment-13054465"
        },
        {
            "date": "2011-06-24T14:25:20+0000",
            "content": "Patch is fine! Funny overlap, we both responded with same answer  ",
            "author": "Uwe Schindler",
            "id": "comment-13054466"
        },
        {
            "date": "2011-06-24T14:51:25+0000",
            "content": "Same patch: except I made MultiTermQuery's rewrite() final.\n\nIn my opinion, this is a good backwards break, it will only fix bugs in someone's code if they have a custom MultiTermQuery: its very tricky to override this (e.g. you must pass along boost, rewriteMethod, ...), and when you do, still might cause problems (like this Span issue).\n\nIts also much easier to just return a simpler enum. ",
            "author": "Robert Muir",
            "id": "comment-13054483"
        },
        {
            "date": "2011-06-24T16:30:08+0000",
            "content": "I understand the patch, that's better indeed. \n\nThanks. ",
            "author": "Ludovic Boutros",
            "id": "comment-13054530"
        },
        {
            "date": "2011-06-24T23:42:16+0000",
            "content": "thanks Ludovic, nice catch!\n\n ",
            "author": "Robert Muir",
            "id": "comment-13054757"
        },
        {
            "date": "2011-07-02T02:40:12+0000",
            "content": "bulk close for 3.3 ",
            "author": "Robert Muir",
            "id": "comment-13058906"
        }
    ]
}