{
    "id": "LUCENE-3750",
    "title": "Convert Versioned docs to Markdown/New CMS",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Since we are moving our main site to the ASF CMS (LUCENE-2748), we should bring in any new versioned Lucene docs into the same format so that we don't have to deal w/ Forrest anymore.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2012-02-09T20:32:28+0000",
            "content": "FWIW: while i love the ability to do quick edits using the CMS bookmarklet, i have had absolutely zero success doing a full site build on my local machine – i'm not even getting errors, i'm just getting no output.\n\nthis may just be something really flakey about my machine, but it begs the question: for our versioned per release documentation, is there really any advantage to using markdown over simply editing HTML directly?\n\nwe used forrest for the versioned docs solely because once upon a time the entire site use to be versioned, and it was easy to just extract the versioned docs from the non-versioned docs and keep using forrest for both and have a similar look/feel, but is there really any reason why the versioned docs we ship in the release need to be in markdown and/or have the same look/feel as the website?  yes, we'll archive them on the website for refrence, but we also archive the javadocs and we've never tried to make them look like the forrest docs (or the new site style)\n\nwhy not just leave the versioned docs looking very simple, and very distinctive from the website, so when people browsing them online see them it's very obvious that they are not just part of the website, they are a snapshot of per version documentation?\n ",
            "author": "Hoss Man",
            "id": "comment-13204827"
        },
        {
            "date": "2012-02-09T20:55:59+0000",
            "content": "\n\n\nI'll contact you on IRC and we can work through it.\n\n\nEasier editing?\n\n\nI don't know.  I personally don't have the bandwidth to convert, but there is supposedly a Forrest-> Markdown plugin available.\n\n\n\n--------------------------------------------\nGrant Ingersoll\nhttp://www.lucidimagination.com\n\n\n ",
            "author": "Grant Ingersoll",
            "id": "comment-13204853"
        },
        {
            "date": "2012-02-10T02:58:09+0000",
            "content": "I'll contact you on IRC and we can work through it.\n\nI realize now i didn't not finish explaining the concerns i was trying to get to in that first para.\n\nmy comment was not intended to mean \"i can't get local doc building to work for the www site, therefore i'm leary of using local doc building for the versioned docs\".  my comment was to be \"if 1 out of N committers who have tried doing local www site builds can't get it to work, then that doesn't bode well for asking non-committer contributors to be able to use the same markdown tools to do local doc building of versioned docs that they might want to contribute patches for.\"\n\nthat smells like a big red flag to me. ",
            "author": "Hoss Man",
            "id": "comment-13205186"
        },
        {
            "date": "2012-02-10T13:09:54+0000",
            "content": "Or perhaps we just need to doc it better.  If we can track down what's going on your machine, then perhaps that will help others avoid it or we can figure out that it is something nastier. ",
            "author": "Grant Ingersoll",
            "id": "comment-13205434"
        },
        {
            "date": "2012-02-16T18:52:20+0000",
            "content": "if 1 out of N committers who have tried doing local www site builds can't get it to work\n\n+1 more\n\nI've spent the last few hours trying to get it to work on my OS-X (lion) box...\nI figured out how to install the cpan perl modules (not being a perl person myself), and the python modules installed fine, but now the daemon just won't run:\n\n\n/opt/code/cms/build$ python --version\nPython 2.7.1\n/opt/code/cms/build$ export MARKDOWN_SOCKET=`pwd`/markdown.socket PYTHONPATH=`pwd`\n/opt/code/cms/build$ python markdownd.py\n/opt/code/cms/build$ No handlers could be found for logger \"MARKDOWN\"\nTraceback (most recent call last):\n  File \"markdownd.py\", line 41, in <module>\n    'codehilite', 'elementid', 'footnotes', 'abbr'])\n  File \"build/bdist.macosx-10.7-intel/egg/markdown/__init__.py\", line 395, in markdown\n  File \"build/bdist.macosx-10.7-intel/egg/markdown/__init__.py\", line 134, in __init__\n  File \"build/bdist.macosx-10.7-intel/egg/markdown/__init__.py\", line 166, in registerExtensions\nValueError: Extension \"__builtin__.NoneType\" must be of type: \"markdown.Extension\".\n\n ",
            "author": "Yonik Seeley",
            "id": "comment-13209602"
        },
        {
            "date": "2012-02-16T19:39:51+0000",
            "content": "Heh - and I just tried the bookmarklet, and it crashed crome as soon as I tried to do an edit ",
            "author": "Yonik Seeley",
            "id": "comment-13209655"
        },
        {
            "date": "2012-02-16T22:09:17+0000",
            "content": "I'm in a similar boat with site updates at the moment - while I struggled through the setup in the past, I had things working smoothly at one point - but since I've updated recently, I can no longer build the site - i get two errors about the JIRA additions in the sidebar.\n\n\n. at /Users/markrmiller/Workspaces/lucid/cms/lib/view.pm line 46\nFile content/solr/index.mdtext had processing errors: Error while rendering output to string\n get http://s.apache.org/solrjira failed.\n\n. at /Users/markrmiller/Workspaces/lucid/cms/lib/view.pm line 46\nFile content/core/index.mdtext had processing errors: Error while rendering output to string\n get http://s.apache.org/corejira failed.\n\n ",
            "author": "Mark Miller",
            "id": "comment-13209794"
        },
        {
            "date": "2012-02-17T15:23:02+0000",
            "content": "FWIW, you can all just commit and then look at it in staging.  You don't have to use the local build.  I doubt we will run into too many people bumping up against each other and staging is only marginally slower than doing a local build anyway. ",
            "author": "Grant Ingersoll",
            "id": "comment-13210318"
        },
        {
            "date": "2012-02-17T15:23:51+0000",
            "content": "Also, I would suggest reporting your errors as bugs to infra or at least asking first (perhaps on site-dev@) ",
            "author": "Grant Ingersoll",
            "id": "comment-13210319"
        },
        {
            "date": "2012-02-17T16:02:09+0000",
            "content": "FWIW, you can all just commit and then look at it in staging. You don't have to use the local build.\n\nIf you are doing anything but a minor change, that's a fairly nasty way to work on the site though (at least IMO). For website dev you really want to have immediate feedback and to be able to experiment and play around with having to commit each time. Honestly, I won't make any substantial change that way.\n\nJust curious - is there anyone out there that has/can currently build the site locally?\n\nGrant, I assume you still can? ",
            "author": "Mark Miller",
            "id": "comment-13210347"
        },
        {
            "date": "2012-02-17T16:29:42+0000",
            "content": "I hear you on the commit approach, just saying it is a workaround for now.  For me, doing a commit doesn't take all that much longer than doing a local build unless you use --offline mode locally, in which case it skips the Twitter/JIRA stuff.\n\nGrant\nYes, I can.  I talked w/ Yonik about it yesterday.  I think we have different versions of the Py Markdown library (his is newer, mine is 2.0.3).  Don't know if that is the issue.  Mark, what version are you on? ",
            "author": "Grant Ingersoll",
            "id": "comment-13210360"
        },
        {
            "date": "2012-02-17T17:05:36+0000",
            "content": "unless you use --offline mode locally, in which case it skips the Twitter/JIRA stuff.\n\nBingo - I was looking for this option but couldn't find it in the doc anywhere - I could see in the perl code there was some offline option that skipped trying to do the JIRAs but I had no idea how to turn it on. That lets me get a local build going that works for me. ",
            "author": "Mark Miller",
            "id": "comment-13210381"
        }
    ]
}