{
    "id": "LUCENE-5158",
    "title": "Allow StoredFieldVisitor instances to be stateful",
    "details": {
        "components": [
            "core/index"
        ],
        "fix_versions": [],
        "affect_versions": "4.4",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "Currently there is no way to build stateful StoredFieldVisitor s. \n\nMotivation\n\nWe would like to optimise our access to stored fields in our indexes by utilising the StoredFieldVisitor.Status.STOP feature to stop processing fields in a document. Unfortunately we have very large indexes, and rebuilding them to have the required field order is not an option.\n\nA stateful StoredFieldVisitor could solve this; it could track which fields have been loaded for a document, and then STOP when the fields required have been loaded, regardless of the order they were loaded.\n\nImplementation\n\nI've added a no-op public void reset() method to the StoredFieldVisitor base class, which gives a StoredFieldVisitor subclass an opportunity to reset its state before the fields of the next document are processed. I've added a call to reset() in all places the StoredFieldVisitor was being used.",
    "attachments": {
        "LUCENE-5158.patch": "https://issues.apache.org/jira/secure/attachment/12596776/LUCENE-5158.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-08-08T05:49:15+0000",
            "content": "\nUnfortunately we have very large indexes, and rebuilding them to have the required field order is not an option.\n\nThen it can't work.\n\nLucene returns the order of the fields in A,B,A if you add fields in that order.\n\nSeparately if you want a reset() method to call before a document is processed, just add it to your own StoredFieldVisitor, and just call it yourself before the next ir.document().\n\nIts not necessary to add this method to the lucene API for that. ",
            "author": "Robert Muir",
            "id": "comment-13733173"
        },
        {
            "date": "2013-08-08T06:15:08+0000",
            "content": "\nSeparately if you want a reset() method to call before a document is processed, just add it to your own StoredFieldVisitor, and just call it yourself before the next ir.document().\nIts not necessary to add this method to the lucene API for that.\n\nYes, I see now what you mean. I had come to this solution via a fairly circuitous route; stopping to smell the flowers I see my modifications were unnecessary. I'll close this won't fix. \n\nCheers,\n-Brendan\n\n\n ",
            "author": "Brendan Humphreys",
            "id": "comment-13733191"
        }
    ]
}