{
    "id": "LUCENE-22",
    "title": "Parse Aborted: Lexical error",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Incomplete",
        "status": "Closed"
    },
    "description": "This report is for Lucene 1.2 RC4.\n\nWhen indexing a 4 MB size text file using the HTMLIndexer from the demo package \nI get the following error:\n\nParse Aborted: Lexical error at line 106377, column 64.  Encountered: \"=\" (61),\nafter : \"\".\n\nThe line actually contains nothing more than a lot of spaces followed by word, \nso nothing special.\n\nIf I delete the line, the error still occurs.\nIf I crop the file so that the file contains less than 106377 lines, the error \nstill occurs.\nIf I crop the file further, at a certain point the error disappears.\n\nThe error does not occur when using the IndexFiles indexer.\n\nMichael",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2002-03-20T23:46:36+0000",
            "content": "Is it possible that your file has some invisible characters that the parser\ncannot handle?\nWhat happens if you create a new file and just put in it only characters that\nyou know the parser will handle?\nFor example, you could do this repeatedly:\n\necho <P>Some text to fill up the file >> file.html\n\nThen run the demo every so often after adding more text to it and see if it\nchokes even when only regular ASCII characters are inserted in the file.\nPlease follow up with the outcome. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321023"
        },
        {
            "date": "2002-03-21T16:29:09+0000",
            "content": "Otis, I did as suggested and filled a text file by repeated insertions of one \nline containing normal characters. A test with 500000 lines resulting in 16 MB \nsize worked without problems. So you're probably right that my original file \ncontains some problem characters. What is the supported character range?\n\nBTW, my text file is created from a PDF file where the text was extracted by \nthe pdftotext tool that ships with xpdf.\n\nThanks\n\nMichael ",
            "author": "michael.suedkamp",
            "id": "comment-12321024"
        },
        {
            "date": "2002-03-22T01:20:38+0000",
            "content": "The ranges should be listed in QueryParser.jj.\n\nI will close this bug.  If anyone thinks this is not the right thing to do \nplease reopen it. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321025"
        }
    ]
}