{
    "id": "LUCENE-4527",
    "title": "CompressingStoredFieldsFormat: encode numStoredFields more efficiently",
    "details": {
        "components": [],
        "fix_versions": [
            "4.1"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Another interesting idea from Robert: many applications have a schema and all documents are likely to have the same number of stored fields. We could save space by using packed ints and the same kind of optimization as ForUtil (requiring only one VInt if all values are equal).",
    "attachments": {
        "LUCENE-4527.patch": "https://issues.apache.org/jira/secure/attachment/12552016/LUCENE-4527.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-04T11:57:04+0000",
            "content": "Patch. The number of stored fields and document lengths are encoded more efficiently: I first compute the minimum value and then only encode the deltas. In case documents have similar numbers of stored fields and lengths, this should be a little more efficient. ",
            "author": "Adrien Grand",
            "id": "comment-13490171"
        },
        {
            "date": "2012-11-04T12:18:34+0000",
            "content": "I'm not sure I like 4 vints for min and lengths? If documents (including all fields) are largish then we might be making it worse.\n\nIs the min really worth it? It seems like too much overhead. ",
            "author": "Robert Muir",
            "id": "comment-13490178"
        },
        {
            "date": "2012-11-04T12:23:57+0000",
            "content": "And of course for this test (and any other test of compressing stored fields), that \n\"fake\" wikipedia corpus being used is totally invalid because all documents are \ntruncated to a specific length  ",
            "author": "Robert Muir",
            "id": "comment-13490179"
        },
        {
            "date": "2012-11-04T21:47:15+0000",
            "content": "I'm not sure I like 4 vints for min and lengths? If documents (including all fields) are largish then we might be making it worse.\n\nI hadn't thought much of it. I assume there are 3 main cases:\n 1. if document lengths are larger than 16K there is no problem (when chunkDocs==1, it only encodes 2 vints),\n 2. if the numbers of stored fields and document lengths vary by more than 50%, it can waste 3 bytes (given that doc length < 2**14 and assuming numStoredFields < 128),\n 3. if the number of stored fields and document lengths vary by less than 50%, it saves at least 2 bits per document so the savings are 2 * chunkDocs - 3 * 8 bits (if docs are 8K each, this can waste 2.5 bytes, if docs are 1K each, this can save 1 byte, if docs are 100 bytes each, this can save 38 bytes).\n\n(I did the math while writing, please correct me if I'm wrong)\n\nBoth options seem to have pros and cons so I'm not sure which one to choose... Which maybe means we should go for the easiest one? (without encoding the min values as VInts) ",
            "author": "Adrien Grand",
            "id": "comment-13490303"
        },
        {
            "date": "2012-11-04T23:50:40+0000",
            "content": "New patch without the minValue+delta trick. Instead it uses the exact same trick as ForUtil: bitsRequired == 0 => all elements have the same value, which is the next VInt. ",
            "author": "Adrien Grand",
            "id": "comment-13490332"
        },
        {
            "date": "2012-11-07T22:57:39+0000",
            "content": "Committed\n\n\ttrunk: r1406704\n\tbranch 4.x: r1406712\n\n ",
            "author": "Adrien Grand",
            "id": "comment-13492792"
        },
        {
            "date": "2013-03-22T16:18:59+0000",
            "content": "[branch_4x commit] Adrien Grand\nhttp://svn.apache.org/viewvc?view=revision&revision=1406712\n\nLUCENE-4527: CompressingStoreFieldsFormat: encode numStoredFields more efficiently (merged from r1406704).\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13610580"
        }
    ]
}