{
    "id": "LUCENE-2985",
    "title": "Build SegmentCodecs incrementally for consistent codecIDs during indexing",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/codecs",
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA",
            "CSF branch"
        ],
        "affect_versions": "4.0-ALPHA,                                            CSF branch",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "currently we build the SegementCodecs during flush which is fine as long as no codec needs to know which fields it should handle. This will change with DocValues or when we expose StoredFields / TermVectors via Codec (see LUCENE-2621 or LUCENE-2935). The other downside it that we don't have a consistent view of which codec belongs to which field during indexing and all FieldInfo instances are unassigned (set to -1). Instead we should build the SegmentCodecs incrementally as fields come in so no matter when a codec needs to be selected to process a document / field we have the right codec ID assigned.",
    "attachments": {
        "LUCENE-2985.patch": "https://issues.apache.org/jira/secure/attachment/12474388/LUCENE-2985.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-03-23T12:39:24+0000",
            "content": "here is an initial patch that uses a SegmentCodecBuilder to assign codec IDs during indexing in DocFieldProcessorPerThread. ",
            "author": "Simon Willnauer",
            "id": "comment-13010098"
        },
        {
            "date": "2011-03-24T17:24:09+0000",
            "content": "Patch looks great!\n\nI wonder if we should pass the segmentCodecsBuilder to FieldInfos?  This way, FieldInfos.add/update could set the codecID, instead of caller doing it after the fact (in DocFieldProcessorPerThread)? ",
            "author": "Michael McCandless",
            "id": "comment-13010778"
        },
        {
            "date": "2011-03-24T17:46:28+0000",
            "content": "I wonder if we should pass the segmentCodecsBuilder to FieldInfos? This way, FieldInfos.add/update could set the codecID, instead of caller doing it after the fact (in DocFieldProcessorPerThread)?\n\nhere is the thing, I first added it to FieldInfos since it appears to be the place for that kind of stuff. Yet, the first problem is that DocFieldProcessorPerThread is caching the FI for each DFPPerField so I would really need to add it to each FieldInfo (FI not FIs). Further having another invariant in FIs that only applies if we are writing is something I tried to prevent in the first place and eventually SegementCodecs is somewhat internal to the SegmentInfo and not to the FieldInfos and I tried to couple them only by the codec ID though. I agree this would be easier and less disturbing in the code. I'd love to find a better way to do that really.... except of this part in DocFieldProcessorPerThread is smooth though :/ ",
            "author": "Simon Willnauer",
            "id": "comment-13010798"
        },
        {
            "date": "2011-03-25T13:20:38+0000",
            "content": "next iteration. This patch moves the SegmentCodecsBuilder into FieldInfos and forces DocFieldProcessorPerThread to update FieldInfo through the global FieldInfos instance. \n\n\n\nI changed the FieldInfos#add methods to FieldInfos#addOrUpdate and made SegmentCodecsBuilder package private, final and removed synchronization since it is guarded by FieldInfos during creation. This patch also fixes JavaDoc on SegmentCodecs since we build that now incrementatlly.\n\nSince we now update the FieldInfo through FieldInfos this looks much cleaner.\n\nI think this is ready to commit. ",
            "author": "Simon Willnauer",
            "id": "comment-13011187"
        },
        {
            "date": "2011-03-25T15:40:22+0000",
            "content": "I will commit this in a bit if nobody objects ",
            "author": "Simon Willnauer",
            "id": "comment-13011245"
        },
        {
            "date": "2011-03-25T16:24:36+0000",
            "content": "Committed revision 1085449. ",
            "author": "Simon Willnauer",
            "id": "comment-13011259"
        }
    ]
}