{
    "id": "LUCENE-8265",
    "title": "WordDelimiterFilter should pass through terms marked as keywords",
    "details": {
        "components": [],
        "status": "Closed",
        "resolution": "Fixed",
        "fix_versions": [
            "7.4",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "labels": "",
        "priority": "Major",
        "type": "Improvement"
    },
    "description": "This will help in cases where some terms containing separator characters should be split, but others should not.  For example, this will enable a filter that identifies things that look like fractions and identifies them as keywords so that 1/2 does not become 12, while doing splitting and joining on terms that look like part numbers containing slashes, eg something like \"sn-999123/1\" might sometimes be written \"sn-999123-1\".",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16447374",
            "author": "Mike Sokolov",
            "content": "Pull request here: https://github.com/apache/lucene-solr/pull/359 .. I haven't used this workflow much, so please let me know if there is a way to make it easier for committers to check out this change. ",
            "date": "2018-04-22T21:12:30+0000"
        },
        {
            "id": "comment-16447980",
            "author": "Michael McCandless",
            "content": "Thanks Mike Sokolov; the PR looks great; I'll wait a day or so and then push! ",
            "date": "2018-04-23T11:19:28+0000"
        },
        {
            "id": "comment-16448135",
            "author": "Nikolay Khitrin",
            "content": "This is the breaking change.\n\nFor example keyword attribute can be used for bypass stemming (as mentioned in KeywordAttribute javadoc) after WordDelimiterFilter.\n\nShould be at least marked as breaking in changelog. Might be better solution is to provide this as an option for delimiter filter. ",
            "date": "2018-04-23T13:20:32+0000"
        },
        {
            "id": "comment-16448145",
            "author": "Alan Woodward",
            "content": "I wonder if there's a better way of handling this than using the KeywordAttribute, which as Nikolay says is heavily overloaded.  Would it be possible to somehow code up a TokenFilter that wraps another TokenFilter, and bypasses the wrapped filter if a certain condition is met? ",
            "date": "2018-04-23T13:28:16+0000"
        },
        {
            "id": "comment-16448257",
            "author": "Mike Sokolov",
            "content": "Good point Nikolay Khitrin. While I am having difficulty coming up with an example of something that would be marked as keyword in order to protect it from stemming, but that should be split up by WDF (or conversely something that should be stemmed, but not split), I agree that in principle these are different decisions, and adding an option is low-complexity. I'll post a change later today I hope.\n\nAlan Woodward that idea is really cool, but I think it is more complexity than I want to take on for this issue? I have tried making a wrapping filter before, and it is pretty tricky. In my experience you have to be very careful about (1)  how reset() calls propagate, and (2) the signal to switch behavior.  EG you probably want to be able to call incrementToken() on either of two different upstream filters that both share the same input, based on the value of some attribute. However, by the time you see the attribute, it is already too late to change! So you have to introduce a delay token that only carries this \"switching\" info.  ",
            "date": "2018-04-23T14:47:57+0000"
        },
        {
            "id": "comment-16448339",
            "author": "David Smiley",
            "content": "code up a TokenFilter that wraps another TokenFilter, and bypasses the wrapped filter if a certain condition is met?\n\nYes; this has been my very long Lucene/Solr idea TODO list.   Or perhaps alternatively, some TokenFilters could extend a new TokenFilter subclass that checks a condition.   By default it could be a Predicate that simply returns true.  This would address Mike Sokolov's concern on propagating the lifecycle calls... I've had to delegate a tokenizer/filter before and it was a bit annoying to get right. ",
            "date": "2018-04-23T15:51:06+0000"
        },
        {
            "id": "comment-16449744",
            "author": "Mike Sokolov",
            "content": "I updated the pull request, adding a new flag, IGNORE_KEYWORDS, that gates\nthis feature.\n\nOn Mon, Apr 23, 2018 at 11:52 AM, David Smiley (JIRA) <jira@apache.org>\n ",
            "date": "2018-04-24T12:29:00+0000"
        },
        {
            "id": "comment-16449819",
            "author": "Michael McCandless",
            "content": "Thanks Mike Sokolov; new PR looks great. ",
            "date": "2018-04-24T13:10:29+0000"
        },
        {
            "id": "comment-16449896",
            "author": "Alan Woodward",
            "content": "I created LUCENE-8273 for the potential spinoff - Mike Sokolov would this work for your situation? ",
            "date": "2018-04-24T13:56:04+0000"
        },
        {
            "id": "comment-16449981",
            "author": "Mike Sokolov",
            "content": "Alan Woodward yes, I could use that!   ",
            "date": "2018-04-24T14:48:11+0000"
        },
        {
            "id": "comment-16457620",
            "author": "ASF subversion and git services",
            "content": "Commit fc0878cc2f97fdaa5206796ca5e0efa4988e7609 in lucene-solr's branch refs/heads/master from Michael Sokolov\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=fc0878c ]\n\nLUCENE-8265: WordDelimiter*Filter ignores keywords ",
            "date": "2018-04-28T13:58:09+0000"
        },
        {
            "id": "comment-16457626",
            "author": "ASF subversion and git services",
            "content": "Commit d1bf6ad79a862b48c20d3197d58e6b5eefde519c in lucene-solr's branch refs/heads/branch_7x from Michael Sokolov\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d1bf6ad ]\n\nLUCENE-8265: WordDelimiter*Filter ignores keywords ",
            "date": "2018-04-28T14:14:43+0000"
        },
        {
            "id": "comment-16457627",
            "author": "Michael McCandless",
            "content": "Thanks Mike Sokolov! ",
            "date": "2018-04-28T14:15:13+0000"
        }
    ]
}