{
    "id": "LUCENE-875",
    "title": "javadocs creation has too many warnings/errors",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/javadocs"
        ],
        "type": "Task",
        "fix_versions": [
            "2.2"
        ],
        "affect_versions": "2.2",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Currently running 'ant javadocs' creates so many warnings that you have to grep the output to verify that new code did not add more.\n\nWhile most current errors might be minor, they might hide a few serious ones that we will never know abut until someone complains. \n\nBest if we fix all of them and keep it always clean...",
    "attachments": {
        "875_javacc_patch.txt": "https://issues.apache.org/jira/secure/attachment/12356741/875_javacc_patch.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2007-05-03T21:58:56+0000",
            "content": "( modified   'and javadocs'   -->    'ant javadocs' ) ",
            "author": "Doron Cohen",
            "id": "comment-12493537"
        },
        {
            "date": "2007-05-03T23:23:50+0000",
            "content": "Attached patch fixes all javadocs warnings and errors when using javadocs 1.4.2.\n\n javadocs with jdk 5 - current build.xml creates javadocs also for contrib/gdata only \n     under jdk 5. To fix the javadocs some jars had to be added to the javadocs classpath. \n     But for gdata, even after adding the required jars there remained lots of errors that I \n     did not want to handle here. So I commented out the addition of gdata jars, and focused \n     in running javadocs with jdk 1.4.2.\n\n Some of the warning had to do with peculiarities of javadocs, In one case I replaced '?' \n     with  '?' - wasn't too happy with this, but it seemed nice at that particular code \n     to have the '?' at the middle of a summary line, which was causing the warning. (in \n     other places I changed the wording so that '?' was o more in the summary line).\n\n This is quite a technical fix - only javadoc comments where modified (and build.xml), so unless \n     there are objections I intend to commit it pretty soon. ",
            "author": "Doron Cohen",
            "id": "comment-12493557"
        },
        {
            "date": "2007-05-04T17:11:26+0000",
            "content": "skimmed the patch, noticed isPayloadAvailable method added to MemoryIndex .. unintentional? ",
            "author": "Hoss Man",
            "id": "comment-12493747"
        },
        {
            "date": "2007-05-04T17:37:22+0000",
            "content": "yes...  thanks for reviewing this Hoss. \n\nMemoryIndex doesn't compile without implementing this method.\nBut this is unrelated to the javadocs, so I will not include in this change. ",
            "author": "Doron Cohen",
            "id": "comment-12493752"
        },
        {
            "date": "2007-05-04T17:58:01+0000",
            "content": "i vote for adding...\n\n    failonerror=\"true\"\n\n...as well.  it won't help in the case of warnings, but it will at least ensure that the build fails if we have any seriously eggregious errors in the javadocs that completely prevent them from being generated. ",
            "author": "Hoss Man",
            "id": "comment-12493757"
        },
        {
            "date": "2007-05-04T18:44:12+0000",
            "content": "Agree, I will add that.\n ",
            "author": "Doron Cohen",
            "id": "comment-12493772"
        },
        {
            "date": "2007-05-04T19:30:27+0000",
            "content": "> it won't help in the case of warnings\n\nWe could make it fail also in case of warnings: logging javadoc stdio also to file; fail if the file has warnings (otherwise delete file);  ",
            "author": "Doron Cohen",
            "id": "comment-12493779"
        },
        {
            "date": "2007-05-04T20:06:42+0000",
            "content": "An updated patch:\n\n\twithout the MemoryIndex changes (was fixed separately).\n\tfailonerror=true added as Hoss suggested.\n\tnow fails also on javadoc warnings, as discussed above.\n\n ",
            "author": "Doron Cohen",
            "id": "comment-12493789"
        },
        {
            "date": "2007-05-04T22:17:54+0000",
            "content": "It occurred to me that with this, javadoc with jdk 1.5, which also processes gdata, would fail on errors. Ucommenting the gdata-jars addition to javadocs-classpath would solve the errors but there are many warnings still. Then, the fail-on-warning logic would cause javadoc to fail.\n\nBy itself this is not necessarily a bad thing, as it would encourage to fix that sooner. However when invoked as part of a larger target, like \"package\" or \"nightly\", it would stop that target in the middle. ",
            "author": "Doron Cohen",
            "id": "comment-12493812"
        },
        {
            "date": "2007-05-05T05:06:35+0000",
            "content": "huh ... i've never seen the <record> task before ... interesting.\n\nnot being familiar with it, i don't really have an opinion about using it it in this way, but the gdata situation is ... annoying.  we may want to hold off on failing on warnings until we can get them all squared away (and/or have a better system in place for dealing with contribs that require 1.5) ",
            "author": "Hoss Man",
            "id": "comment-12493855"
        },
        {
            "date": "2007-05-05T05:17:50+0000",
            "content": "Agree.\nI am changing it to fail-on-warning only under 1.4, with TODO comment to remove this condition once gdata javadocs is fixed. \nI intend to commit this and create a new issue for gdata's javadoc warnings. ",
            "author": "Doron Cohen",
            "id": "comment-12493856"
        },
        {
            "date": "2007-05-05T05:22:08+0000",
            "content": "Updated patch:\n  1) as discussed, disable fail-on-warning under jdk5. \n  2) updated  Changes.txt  ",
            "author": "Doron Cohen",
            "id": "comment-12493857"
        },
        {
            "date": "2007-05-05T05:40:48+0000",
            "content": "Just committed. ",
            "author": "Doron Cohen",
            "id": "comment-12493858"
        },
        {
            "date": "2007-05-10T05:25:34+0000",
            "content": "Grrr... it seems we may need to reopen this, i didn't realize until just now that the previous patch (including \"fail on warnings unless 1.4\" was already committed) and my recent tweak to the build.xml so that all contribs get their javadocs built has spanwed some more warnings/problems that i didn't notice before because i was using 1.5 (and apparently so is hudson because the nightly build is still working).\n\nNote, if you are using java 1.5 and wnat to reproduce these problems, use...\n    ant -Dant.java.version=1.4 javadocs\n\nCurrent issues:\n\n1) running javadocs on a virgin checkout does not force contribs that download their dependencies on the fly to do so – the javadocs task currently has no dependencies that relate to contribs, so \"ant javadocs\" or even \"ant package\" will get errors from things like contrib/db because the sleepycat jar has never been downloaded.\n(NOTE: you can NOT reproduce this by running \"ant clean javadocs\" ... the clean target doesn't remove lib jars that contribs download on the fly .. if you've ever build contribs you've got the jars and it will mask this bug)\n\nPossible solution: make \"javadocs\" depend on build-contrib ?  or a new task that does the contrib-crawl and calls whatever task contribs use to fetch third party jars?\n\n2) even if all the jars are downloaded, and running in 1.4 mode so current gdata errors are ignored, there are still 3 warnings...\n\n  [javadoc] javadoc: warning - Multiple sources of package comments found for package \"org.apache\"\n  [javadoc] javadoc: warning - Multiple sources of package comments found for package \"org\"\n  [javadoc] javadoc: warning - Multiple sources of package comments found for package \"org.apache.commons\"\n\n...my first guess is that multiple lib jars in the contribs had package.html files for these packages ... but i can't find evidence of that ... i haven't tried the trial and error approach of commenting out contribs one at a time until those errors go away to try and track down the source of the problem\n\n3) Hudson seems to be running the nightly build using java 1.5, so the hook to ensure that there are no javadoc warnings isn't getting triggered.\n ",
            "author": "Hoss Man",
            "id": "comment-12494629"
        },
        {
            "date": "2007-05-10T05:43:49+0000",
            "content": "I checked with 1.4 earlier today and didn't get these \"Multiple sources\" warnings.\nI checked again now, also with 1.5 and -Dant.java.version=1.4 and it passes as well. \nThis was Windows: Standard Doclet version 1.5.0_06 and Standard Doclet version 1.4.2_08\nSo I don't know what is causing these errors. \nSeems ok to have \"javadocs\" depend on \"build-contrib\". \nShould we disable this fail-on-warning logic until clearing it further...?\n ",
            "author": "Doron Cohen",
            "id": "comment-12494631"
        },
        {
            "date": "2007-05-10T16:43:01+0000",
            "content": "Also, since failOnEror was added to the javadocs task, build services (e.g. parabuild) with jars misconfigured would fail not only because of javadoc warnings but also because of javadoc errors. \n\nI feel that the noise this created with the failures of builds due to javadocs problems is a price to high to pay for being automatically \"forced\" to keep javadocs error/warning free. I am disabling both fail-on-jdoc-error and fail-on-jdoc-warning.\n\nI will add an item \"check javadocs creation\" to Wiki's \"Patch Check List\" page. ",
            "author": "Doron Cohen",
            "id": "comment-12494786"
        },
        {
            "date": "2007-05-10T17:30:43+0000",
            "content": "I also made \"javadocs\" depend on \"build-contrib\". \n\nThis too might create some noise, because when attempting to download jars from the net, some firewall prompt might pop up. If running unattended and no one approves, it might eventually time out and fail. On the other hand, we do want the jars to be downloaded...   So let's wait a few days and see how this works out. ",
            "author": "Doron Cohen",
            "id": "comment-12494796"
        },
        {
            "date": "2007-05-10T17:59:09+0000",
            "content": "I'm not sure i follow why failOnError concerns you ... but in general i think you're right ... Lucene's build system just isn't quite \"clean\" enough at the moment to be so critical of javadoc issues.\n\nas for the \"Multiple sources of package comments\" i'm using \"Standard Doclet version 1.5.0_02\" FWIW. ",
            "author": "Hoss Man",
            "id": "comment-12494801"
        },
        {
            "date": "2007-06-01T18:49:43+0000",
            "content": "Fixed - we remain with not failing a build due to javadoc warnings or errors - verifying these would remain manual. ",
            "author": "Doron Cohen",
            "id": "comment-12500809"
        }
    ]
}