{
    "id": "LUCENE-4417",
    "title": "Re-Add the backwards compatibility tests to 4.1 branch",
    "details": {
        "components": [
            "general/test"
        ],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Task",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "In 4.0 we have no backwards compatibility, but in 4.1 we must again ivy-retrieve the 4.0 JAR file and run the core tests again (like in 3.6). We may think about other modules, too, so all modules that must be backwards compatible should be added to this build.\n\nI will work on this once we have a release candidate in Maven Central.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-01-12T22:00:15+0000",
            "content": "We shouldn't release 4.1 until at least lucene-core backwards tests are re-enabled. ",
            "author": "Steve Rowe",
            "id": "comment-13552079"
        },
        {
            "date": "2013-01-13T01:44:54+0000",
            "content": "Seems pretty complicated, core tests depend upon things like test-framework and codecs, which have experimental APIs. (look at 4.0 codebase if you dont believe me, whole experimental codecs have been folded into core functionality and removed, and so on).\n\nEven if we were to do this, i don't think it would be maintainable. For example, take issues that will seriously change the codec API like LUCENE-4547. \n\nI'd be the first to simply disable the whole thing rather than waste a bunch of time fixing outdated tests and experimental codecs from a previous release.\n\nI think it would be more bang for the buck to integrate an API comparison tool (like jdiff or whatever) that shows the breaks so we know what they are. ",
            "author": "Robert Muir",
            "id": "comment-13552118"
        },
        {
            "date": "2013-01-15T23:49:19+0000",
            "content": "Blocker->Major, Fix Version -> 4.2 ",
            "author": "Steve Rowe",
            "id": "comment-13554531"
        },
        {
            "date": "2013-07-23T18:44:36+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716998"
        },
        {
            "date": "2014-04-16T12:54:24+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970742"
        }
    ]
}