{
    "id": "LUCENE-2255",
    "title": "IndexWriter.getReader() allocates file handles",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.9.2",
            "3.0.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I am not sure if this is a \"bug\" or really just me not reading the Javadocs right...\n\nThe IR returned by IW.getReader() leaks file handles if you do not close() it, leading to starvation of the available file handles/process. If it was clear from the docs that this was a new reader and not some reference owned by the writer then this would probably be ok. But as I read the docs the reader is internally managed by the IW, which at first shot lead me to believe that I shouldn't close it.\n\nSo perhaps the docs should be amended to clearly state that this is a caller-owns reader that must be closed? Attaching a simple app that illustrates the problem.",
    "attachments": {
        "LuceneManyCommits.java": "https://issues.apache.org/jira/secure/attachment/12435201/LuceneManyCommits.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-02-08T19:59:23+0000",
            "content": "Leaks file handles via IW.getReader() ",
            "author": "Mikkel Kamstrup Erlandsen",
            "id": "comment-12831084"
        },
        {
            "date": "2010-02-08T20:20:30+0000",
            "content": "You're not the first to report this... I wonder if we should also do a weak ref type of dealie that auto closes the reader for users who aren't calling IR.close?  \n\nTo answer the question, yes, close on IR must be called.  I can't directly do anything about the javadocs so I'll leave that for Mike. ",
            "author": "Jason Rutherglen",
            "id": "comment-12831095"
        },
        {
            "date": "2010-02-08T20:41:32+0000",
            "content": "I see this coming up multiple times, we should document this properly in the javadoc and on the wiki. Jason, aren't you the NRT specialist here. What keeps you from attaching a patch for the IW javadoc?\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12831107"
        },
        {
            "date": "2010-02-08T20:58:28+0000",
            "content": "What keeps you from attaching a patch for the IW javadoc? \n\nLaziness and lack of motivation...   \n\nI'll post something to the issue, how's that? ",
            "author": "Jason Rutherglen",
            "id": "comment-12831116"
        },
        {
            "date": "2010-02-08T21:15:58+0000",
            "content": "This has already been fixed on trunk... we added this to the javadocs a while back:\n\n\n\t<p>You must close the \n{@link IndexReader}\n returned by\n\tthis method once you are done using it.</p>\n\n\n\nWhile the returned reader used IndexWriter to determine which segments to open, the returned reader is fully independent of the writer.  EG you can close the writer and continue using the reader.  And you must close the reader.\n\nI'll backport that fix to 3.0 & 2.9. ",
            "author": "Michael McCandless",
            "id": "comment-12831124"
        }
    ]
}