{
    "id": "LUCENE-5043",
    "title": "Eclipse project name change - autogenerated",
    "details": {
        "components": [
            "general/build"
        ],
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "affect_versions": "4.3",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The eclipse project name (created by 'ant eclipse') for most of the 4.x versions comes up as \"lucene_solr_branch_4x\" ... which causes a few problems.  Recently I needed to take a look at a particular class in Solr 4.2.1, 4.3.0, and branch_4x.  I couldn't load all three projects into Eclipse at the same time, because they have the same project name.  Even if I could have, it would have been very confusing.  I would like to improve this situation for the future.\n\nI have a couple of ideas right up front, both of which seem like reasonable ways to go:\n\n1) Use the directory name, similar to what IntelliJ Idea does.\n2) Use the \"fakeReleaseVersion\" property in the central build.xml.",
    "attachments": {
        "LUCENE-5043.patch": "https://issues.apache.org/jira/secure/attachment/12586558/LUCENE-5043.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-06-06T16:38:10+0000",
            "content": "The first option has an advantage over the second - you could have multiple copies of the same version (such as trunk) imported into eclipse at the same time.  It would be easier to work on more than one issue without juggling projects.  For that reason, I would prefer that option.\n\nI did wonder what happens if you change a project name outside of eclipse, so I tried editing .project.  Eclipse doesn't notice the change, even if you shut it down and restart it.  I don't think that will be a disadvantage for option 1, because the only way the project name would change is if you move the project or rename the directory, in which case you'd have to re-import it into eclipse anyway. ",
            "author": "Shawn Heisey",
            "id": "comment-13677213"
        },
        {
            "date": "2013-06-06T17:00:03+0000",
            "content": "I dont understand the issue, when i want to use eclipse i always do this:\n1. svn co https://svn.apache.org/repos/asf/lucene/dev/trunk lucene-XXXX\n2. cd lucene-XXXX; ant eclipse\n3. File->New Java Project->lucene-XXXX\n\nI have many of these open at a time, with the name i chose (the directory name) ",
            "author": "Robert Muir",
            "id": "comment-13677232"
        },
        {
            "date": "2013-06-06T17:07:48+0000",
            "content": "I use File->Import... and use the \"Existing Projects into Workspace\" type under General. ",
            "author": "Shawn Heisey",
            "id": "comment-13677246"
        },
        {
            "date": "2013-06-06T17:11:10+0000",
            "content": "I think that causes the trouble, just do new project, and when you give it lucene-XXXX which is a folder already in the workspace, it sees its already setup and uses it with that name. ",
            "author": "Robert Muir",
            "id": "comment-13677250"
        },
        {
            "date": "2013-06-06T17:50:10+0000",
            "content": "That never occurred to me ... I wasn't making a new project, I was using an existing one.  Although it's a great workaround, I think we still should fix what 'ant eclipse' puts in for the project name. ",
            "author": "Shawn Heisey",
            "id": "comment-13677301"
        },
        {
            "date": "2013-06-06T19:13:35+0000",
            "content": "Patch against trunk.  This changes the eclipse target so it gives the eclipse project the same name as its containing directory. ",
            "author": "Shawn Heisey",
            "id": "comment-13677394"
        },
        {
            "date": "2013-06-06T19:25:44+0000",
            "content": "Nice idea. Patch looks good.\nThis helps me, as I have multiple checkouts of the same branch next to each other.  This makes them have a good name.  ",
            "author": "Uwe Schindler",
            "id": "comment-13677405"
        },
        {
            "date": "2013-06-06T19:36:05+0000",
            "content": "+1 ",
            "author": "Steve Rowe",
            "id": "comment-13677413"
        },
        {
            "date": "2013-06-06T20:08:32+0000",
            "content": "Updated patch, with CHANGES.txt and some additional tweaks recommended by Uwe.\n\nI added UTF-8 encoding to the filtered file copy, and found other places where files were being filtered without encoding.  I did change one instance where it was already specified - it had the outputencoding parameter, which isn't really necessary. ",
            "author": "Shawn Heisey",
            "id": "comment-13677442"
        },
        {
            "date": "2013-06-06T21:17:50+0000",
            "content": "+1 to commit. Thanks for fixing charsets! ",
            "author": "Uwe Schindler",
            "id": "comment-13677523"
        },
        {
            "date": "2013-06-06T21:35:46+0000",
            "content": "Committed to trunk, r1490450.  Because this does slightly change some ant tasks related to maven files, and I have no idea how to make sure maven is working correctly, I will wait to ensure that jenkins looks good before backporting to 4x. ",
            "author": "Shawn Heisey",
            "id": "comment-13677540"
        },
        {
            "date": "2013-06-07T16:59:10+0000",
            "content": "Jenkins never sent me any direct email, and the jenkins maven failures that I saw looked like the failures that have been happening for quite some time now, so I have backported this to 4x, commit r1490726. ",
            "author": "Shawn Heisey",
            "id": "comment-13678153"
        },
        {
            "date": "2013-07-23T18:36:58+0000",
            "content": "Bulk close resolved 4.4 issues ",
            "author": "Steve Rowe",
            "id": "comment-13716705"
        }
    ]
}