{
    "id": "LUCENE-4988",
    "title": "\"ant nightly-smoke\" ignores local code changes",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Invalid",
        "status": "Resolved"
    },
    "description": "While trying to test SOLR-4803 i discovered that \"ant nightly-smoke\" was ignoring my local (uncommited) source changes in it's smoke checks.\n\nspecifically: it was running the solr example using an unpacked version of artifacts built from an svn-export that did not include my changes, so test_utf8.sh was still failing.\n\ni'm not sure if it is intentional that the svn export is used instead of the current working checkout, but it seems like something needs to change, either...\n\n\n\t\"ant nightly-smoke\" should fail if the working dir is a dirty checkout\n\t\"ant nightly-smoke\" should use the current working dir even if it's a dirty checkout.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-05-09T00:13:12+0000",
            "content": "Seems kinda hard to fix.\n\nJust to be clear what this task does:\n1. builds a release\n2. smoke tests it.\n\nPart #1 always uses an svn checkout, not local copy of stuff. Thats because thats how release packaging is done, its not related to nightly-smoke. It was changed a while ago to use an svn checkout to avoid dirty extra crap being in the release. ",
            "author": "Robert Muir",
            "id": "comment-13652556"
        },
        {
            "date": "2013-05-09T00:16:37+0000",
            "content": "It was changed a while ago to use an svn checkout to avoid dirty extra crap being in the release.\n\nbut then wouldn't it be good to fail if the working dir is a dirty checkout? so people aren't confused about trying to smoke test uncommited changes? ",
            "author": "Hoss Man",
            "id": "comment-13652564"
        },
        {
            "date": "2013-05-09T00:28:41+0000",
            "content": "I actually really would like to not do this.\n\nBut thats just me: so far i've found this ant task invaluable for testing build system changes. e.g. when what i want to test is some change that could potentially screw up #1 itself. ",
            "author": "Robert Muir",
            "id": "comment-13652584"
        },
        {
            "date": "2013-05-09T00:32:36+0000",
            "content": "Hmm, yes ... i see what you mean.\n\nclosing as invalid – this is just one of those situations where you have to understand what's going on wnen you run it, because either of hte changes i proposed would defeat the point of the target. ",
            "author": "Hoss Man",
            "id": "comment-13652589"
        },
        {
            "date": "2013-05-09T00:37:07+0000",
            "content": "I'm not saying its totally unfixable, but i think hard.\n\nThe only idea i had, would be some kinda alternate 'prepare-release' like 'prepare-local-release' (calls package-local-src-tgz instead of package-tgz-src and so on).\n\nThe thing i dont like about nightly-smoke calling that, is that then we aren't really testing 'actual' release anymore, only testing hacked ones that are generated via this other mechanism...\n\nBut the benefit would be you could test the impact of 'code' changes too.\n\nAnother workaround for the immediate moment is to just commit to a throwaway svn branch and then run nightly-smoke. ",
            "author": "Robert Muir",
            "id": "comment-13652592"
        }
    ]
}