{
    "id": "LUCENE-1369",
    "title": "Eliminate unnecessary uses of Hashtable and Vector",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "2.4"
        ],
        "affect_versions": "2.3.2",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Lucene uses Vector, Hashtable and Enumeration when it doesn't need to. Changing to ArrayList and HashMap may provide better performance.\n\nThere are a few places Vector shows up in the API. IMHO, List should have been used for parameters and return values.\n\nThere are a few distinct usages of these classes:\n\n\tinternal but with ArrayList or HashMap would do as well. These can simply be replaced.\n\tinternal and synchronization is required. Either leave as is or use a collections synchronization wrapper.\n\tAs a parameter to a method where List or Map would do as well. For contrib, just replace. For core, deprecate current and add new method signature.\n\tGenerated by JavaCC. (All *.jj files.) Nothing to be done here.\n\tAs a base class. Not sure what to do here. (Only applies to SegmentInfos extends Vector, but it is not used in a safe manner in all places. Perhaps, implements List would be better.)\n\tAs a return value from a package protected method, but synchronization is not used. Change return type.\n\tAs a return value to a final method. Change to List or Map.\n\n\n\nIn using a Vector the following iteration pattern is frequently used.\nfor (int i = 0; i < v.size(); i++) {\n  Object o = v.elementAt;\n}\n\nThis is an indication that synchronization is unimportant. The list could change during iteration.",
    "attachments": {
        "LUCENE-1369.patch": "https://issues.apache.org/jira/secure/attachment/12389122/LUCENE-1369.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-09-04T11:08:13+0000",
            "content": "This patch looks good, thanks DM!\n\nThe only issue I had was the addition of \"implements PrecedenceQueryParserConstants\" in PrecedenceQueryParser.jj:\n\n\n  public class PrecedenceQueryParser implements PrecedenceQueryParserConstants {\n\n\n\nWhen I ran javacc 3.2, which apparently also inserts its own \"implements PrecedenceQueryParserConstants\", it failed to compile.\n\nI plan to commit in a day or two. ",
            "author": "Michael McCandless",
            "id": "comment-12628306"
        },
        {
            "date": "2008-09-07T19:23:44+0000",
            "content": "Thanks DM! ",
            "author": "Michael McCandless",
            "id": "comment-12628996"
        },
        {
            "date": "2008-12-01T00:39:41+0000",
            "content": "Did we break our back compat guarantee here? This changes some protected signatures in queryparser. If someone was overriding them (which is what they are intended for), dropping in the new jar could cause hard to track down silent changes (the new method is called, the old one you may have overridden is not). There is a similar issue with adding more expressive range query syntax that I plan to finish up, so whats the verdict on these types of changes? Might as well do as many at once as we can if we are going to do it. ",
            "author": "Mark Miller",
            "id": "comment-12651889"
        },
        {
            "date": "2008-12-01T01:06:30+0000",
            "content": "It's definitely iffy - that's why I didn't do these replacements in QueryParser when I did the others. ",
            "author": "Yonik Seeley",
            "id": "comment-12651894"
        },
        {
            "date": "2008-12-01T10:52:59+0000",
            "content": "Ugh, that was definitely a break in back-compat – my bad.\n\nI missed that this change would mean we silently stop calling the Vector-based methods in subclasses.\n\nI'll send an email to java-user. ",
            "author": "Michael McCandless",
            "id": "comment-12651964"
        }
    ]
}