{
    "id": "LUCENE-5771",
    "title": "Review semantics of SpatialOperation predicates",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [
            "modules/spatial"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.10",
            "6.0"
        ]
    },
    "description": "SpatialOperation (which I wish was named SpatialPredicate) is a bunch of predicates – methods that return true/false based on a pair of shapes.  Some of them don't seem to be defined in a way consistent with their definitions on ESRI's site:\nhttp://edndoc.esri.com/arcsde/9.1/general_topics/understand_spatial_relations.htm  (which is linked as a reference, and is in turn equivalent to OGC spec definitions, I believe).\n\nProblems:\n\n\tthe definitions make no mention of needing to have area or not, yet some of our predicates are defined as to require area on either the indexed or query shape.\n\tthe definitions make a distinction of the boundary of a shape, yet in Lucene-spatial, there is none.  That suggests our predicates are wrongly chosen since there are official predicates that are boundary-neutral – namely \"Covers\" and \"CoveredBy\" in lieu of Contains and Within, respectively.  If we don't rename our predicates, we should at least support the correct predicates names!\n\tOverlaps appears totally wrong. It should be defined as indexedShape.relate(queryShape) == Intersects  (and thus not Within or Contains or Disjoint).  It's presently defined as the same as Intersects plus the query shape needing area.",
    "attachments": {
        "LUCENE-5771_SpatialOperation_semantics.patch": "https://issues.apache.org/jira/secure/attachment/12651599/LUCENE-5771_SpatialOperation_semantics.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14038292",
            "author": "David Smiley",
            "content": "It's a simple patch.  Not seen here is a change to BBoxStrategy to disavow it's support for Overlaps.\n\nFurthermore, I'm not sure \"queryNeedsArea\" and \"targetNeedsArea\" is needed or has correct values.  Same for scoreIsMeaningful.  Can't this thing be a simple enum?  Could you take a look Ryan McKinley? ",
            "date": "2014-06-20T02:41:02+0000"
        },
        {
            "id": "comment-14038546",
            "author": "Ryan McKinley",
            "content": "change looks good\n\nI think the reason for  \"queryNeedsArea\" and \"targetNeedsArea\" was so that we could decide if the input was valid simply based on the shape – but i think we find that out anyway, so we could just drop these.\n\nI don't think 'scoreIsMeaningful' is used, so it can also be dropped\n\n ",
            "date": "2014-06-20T07:06:06+0000"
        },
        {
            "id": "comment-14038955",
            "author": "David Smiley",
            "content": "The attached patch removes the \"needs area\" and \"score is meaningful\" notions from SpatialOperation.\n\nI also added aliases to the various predicates to align with the standard names.  Ryan, why did you choose the non-standard names?  E.g. why did you choose \"IsEqualTo\" when \"Equals\" is the standard name?  And why the BBoxIntersects and BBoxWithin predicates which I'm not aware we use and are also non-standard and seem better addressed via other ways (e.g. some sort of function one adds that bbox'es a shape). ",
            "date": "2014-06-20T16:04:46+0000"
        },
        {
            "id": "comment-14048023",
            "author": "David Smiley",
            "content": "Well I'll commit my patch within a couple days.  It'll deserve visible entries in CHANGES.txt so it's clear what aliases people can use.  In fact I think such notices should suggest using the more standardized names – that's what standards are for!  Arguably there should be constants for these standard names too. ",
            "date": "2014-06-30T19:35:52+0000"
        },
        {
            "id": "comment-14048074",
            "author": "ASF subversion and git services",
            "content": "Commit 1606905 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1606905 ]\n\nLUCENE-5771: Remove BBoxStrategy's support for Overlaps because it never actually did work.\n\nThis is a partial commit for this issue – just the BBox portion so as not to interfere with LUCENE-5779.  Trunk only (bbox isn't in 4x yet). ",
            "date": "2014-06-30T20:09:56+0000"
        },
        {
            "id": "comment-14055392",
            "author": "ASF subversion and git services",
            "content": "Commit 1608922 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1608922 ]\n\nLUCENE-5771: SpatialOperation refactoring: (OGC alias names, removed area requirement, fixed overlap definition) ",
            "date": "2014-07-08T19:50:23+0000"
        },
        {
            "id": "comment-14055444",
            "author": "ASF subversion and git services",
            "content": "Commit 1608939 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1608939 ]\n\nLUCENE-5771: SpatialOperation refactoring: (OGC alias names, removed area requirement, fixed overlap definition) ",
            "date": "2014-07-08T20:18:48+0000"
        }
    ]
}