{
    "id": "LUCENE-8525",
    "title": "throw more specific exception on data corruption",
    "details": {
        "components": [],
        "status": "Open",
        "resolution": "Unresolved",
        "fix_versions": [],
        "affect_versions": "None",
        "labels": "",
        "priority": "Major",
        "type": "Improvement"
    },
    "description": "DataInput throws generic IOException if data looks odd\n\nDataInput:141\n\nthere are other examples like BufferedIndexInput:219, CompressionMode:226 and maybe DocIdsWriter:81\n\nThat leads to some difficulties - see elasticsearch #34322\n\nIt would be better if it throws more specific exception.\n\nAs a consequence SegmentInfos.readCommit violates its own contract\n\n\n/**\n   * @throws CorruptIndexException if the index is corrupt\n   * @throws IOException if there is a low-level IO error\n   */",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16639664",
            "author": "Robert Muir",
            "content": "i don't think it should be corruptindexexception, there is no index here. DataInput is for in-memory stuff. We shouldn't throw the wrong exception just because elasticsearch has the wrong catch logic  ",
            "date": "2018-10-05T11:05:36+0000"
        },
        {
            "id": "comment-16639669",
            "author": "Vladimir Dolzhenko",
            "content": "My point is to throw more specific exception (it could be smth like DataCorruptionException) rather plain IOException. \n\nfrom a user (like elastic) point of view it is clear what is happened underneath - is it a real io exception or data specific one.  ",
            "date": "2018-10-05T11:11:12+0000"
        },
        {
            "id": "comment-16639673",
            "author": "Robert Muir",
            "content": "i would close this one, as its an elasticsearch bug. it should just catch IOException here. In most cases corruptions are going to show as various exception types such as EOFException or subclasses of FileSystemException, that is just the nature of the beast.\n\nPerhaps it is confusing that lucene has its own CorruptIndexException, but that shouldnt be interpreted as \"all corruptions will come across as this exception type\". It is just something that we throw in the code to be explicit. ",
            "date": "2018-10-05T11:15:26+0000"
        }
    ]
}