{
    "id": "LUCENE-4667",
    "title": "Change TestRandomChains to replace the list of broken classes by a list of broken constructors",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Task",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Some classes are currently in the list of bad apples although only one constructor is broken. For example, LimitTokenCountFilter has an option to consume the whole stream.",
    "attachments": {
        "LUCENE-4667.patch": "https://issues.apache.org/jira/secure/attachment/12563929/LUCENE-4667.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-01-09T01:23:48+0000",
            "content": "+1 ",
            "author": "Robert Muir",
            "id": "comment-13547511"
        },
        {
            "date": "2013-01-09T11:18:39+0000",
            "content": "Patch. ",
            "author": "Adrien Grand",
            "id": "comment-13548402"
        },
        {
            "date": "2013-01-09T12:33:26+0000",
            "content": "Looks fine. I would prfer to use IdentityHashMap instead of HashMap, so it is consistent with the remaining logic. Classes and Constructors should be compared with identity. I would also make all constructors in the Map with the ALWAYS predicate to be not added to the array lists from the beginning. ",
            "author": "Uwe Schindler",
            "id": "comment-13548457"
        },
        {
            "date": "2013-01-09T13:21:27+0000",
            "content": "The test failed when I used an IdentityHashMap. Did I miss something or can't constructors be compared using ==? ",
            "author": "Adrien Grand",
            "id": "comment-13548505"
        },
        {
            "date": "2013-01-09T13:47:13+0000",
            "content": "New patch that adds exceptions to TrimFilter and TypeTokenFilter as well and uses a constructor map for all components, following Uwe's advice. ",
            "author": "Adrien Grand",
            "id": "comment-13548517"
        },
        {
            "date": "2013-01-09T13:52:08+0000",
            "content": "Maybe that's the case! Sorry. I was expecting that constructors are singletons like classes. HashMap is fine then.\n\nIn my opinion, I think maybe the whole Predicate approach is too much detailed? I would just match on the constructor itsself and would disallow it completeley (without looking into actual parameters). Just exclude the constructor in the beforeClass() method when populating the lists.\n\nIf you want to keep the predicate approach, i would exclude all broken construcors with the ALWAYS predicate in beforeClass(), so it never tries to use the constructor at all (because its no longer in the list). ",
            "author": "Uwe Schindler",
            "id": "comment-13548518"
        },
        {
            "date": "2013-01-09T14:03:46+0000",
            "content": "Maybe that's the case! Sorry. I was expecting that constructors are singletons like classes.\n\nNo problem, I had the same expectation and was a little disappointed to see that it didn't work!\n\nI think maybe the whole Predicate approach is too much detailed?\n\nI think it's worth exluding with a predicate: for example this allows to test random chains with LimitTokenCountFilter(consumeAllTokens=true) (when consumeAllTokens=false, this filter is broken).\n\nI would exclude all broken construcors with the ALWAYS predicate in beforeClass()\n\nSounds good, I updated the patch. ",
            "author": "Adrien Grand",
            "id": "comment-13548524"
        },
        {
            "date": "2013-01-09T16:18:23+0000",
            "content": "[trunk commit] Adrien Grand\nhttp://svn.apache.org/viewvc?view=revision&revision=1430931\n\nLUCENE-4667: Change the broken components list from class-based to constructor-based.\n\nTestRandomChains now tests LimitTokenCountFilter and checks that offsets\ngenerated with TrimFilter and TypeTokenFilter are correct.\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13548630"
        },
        {
            "date": "2013-01-09T16:23:01+0000",
            "content": "We could also use this to stop some false fails from all the subclasses of FilteringTokenFilter (LengthFilter, TypeFilter, etc)\nthat currently cause failures due to https://issues.apache.org/jira/browse/LUCENE-4065, when enablePositionIncrements=false\n ",
            "author": "Robert Muir",
            "id": "comment-13548640"
        },
        {
            "date": "2013-01-09T16:24:23+0000",
            "content": "[branch_4x commit] Adrien Grand\nhttp://svn.apache.org/viewvc?view=revision&revision=1430934\n\nLUCENE-4667: Change the broken components list from class-based to constructor-based (merged from r1430931).\n\nTestRandomChains now tests LimitTokenCountFilter and checks that offsets\ngenerated with TrimFilter and TypeTokenFilter are correct.\n ",
            "author": "Commit Tag Bot",
            "id": "comment-13548643"
        },
        {
            "date": "2013-01-09T16:58:20+0000",
            "content": "Thanks Adrien! ",
            "author": "Uwe Schindler",
            "id": "comment-13548680"
        }
    ]
}