{
    "id": "LUCENE-4431",
    "title": "License of servlet-api.jar is NOT ASF, it is CDDL! We must fix and add NOTICE.txt",
    "details": {
        "components": [
            "modules/other"
        ],
        "fix_versions": [
            "4.0",
            "4.1",
            "3.6.3",
            "6.0"
        ],
        "affect_versions": "3.6.1,                                            4.0-BETA",
        "priority": "Blocker",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The demo module has sevlet-api.jar with a ASF-named license file and the text \"TODO: fill in\"\n\tThis also affects Solr: It has a full ASF license file, but that is wrong.\n\n\n\nThe servlet-apoi file is CDDL license: http://download.oracle.com/otndocs/jcp/servlet-3.0-fr-eval-oth-JSpec/ (same for 2.4). The 3.0.1 JAR file also contains License in its META-INF folder.",
    "attachments": {
        "LUCENE-4431.lucene_solr_3_6.patch": "https://issues.apache.org/jira/secure/attachment/12565040/LUCENE-4431.lucene_solr_3_6.patch",
        "LUCENE-4431.patch": "https://issues.apache.org/jira/secure/attachment/12546609/LUCENE-4431.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-09-25T22:59:57+0000",
            "content": "I'm not going to pretend to know what jar is really what jar and really has what license, but i do know that:\n\n\n\ttomcat ships with a servlet-api.jar\n\tthe servlet-api.jar provided by tomcat (7.0.29) contains a META-INF/LICENSE that says it's ASL 2.0\n\tat some point in the past, the copy of servlet-api.jar that solr compiled against definitely came from tomcat: https://mail-archives.apache.org/mod_mbox/lucene-solr-dev/200601.mbox/%3C20060126054430.50674.qmail@web50306.mail.yahoo.com%3E .. i have no idea what jar we are getting from ivy now\n\n ",
            "author": "Hoss Man",
            "id": "comment-13463317"
        },
        {
            "date": "2012-09-25T23:06:13+0000",
            "content": "The problem with servlet-api.jar is that it was redistributed by Tomcat in the past because of License reasons. In fact, Tomcat's is (like Harmony) a reimplemented one from the official API spec.\n\nWe should (for compiling code use the original one from Oracle). In fact we don't ship this file, we use it as compile dependency like rt.jar, so the best would be to use ivy:cachepath and never materialize it  Unfortunately it is not shipped with JDK, so we need it for compiling the code. ",
            "author": "Uwe Schindler",
            "id": "comment-13463324"
        },
        {
            "date": "2012-09-25T23:07:36+0000",
            "content": "Patch fixing the License. I also fixed NOTICE.txt. The main Lucene Notice file does not need to be changed, as it is not in the binary JAR file. ",
            "author": "Uwe Schindler",
            "id": "comment-13463327"
        },
        {
            "date": "2012-09-25T23:10:29+0000",
            "content": "From the Apache License Docs:\n\nEach license in this category requires some degree of reciprocity; therefore, additional action must be taken in order to minimize the chance that a user of an Apache product will create a derivative work of a reciprocally-licensed portion of an Apache product without being aware of the applicable requirements.\n\nThe first action that must be taken is that software under the following licenses may only be included in within an Apache product if the inclusion is appropriately labeled:\n\n\n\tCDDL 1.0\n\t...\n\n\n\nFor small amounts of source that is directly consumed by the ASF product at runtime in source form, and for which that source is unlikely to be changed anyway (say, by virtue of being specified by a standard), this action is sufficient. An example of this is the web-facesconfig_1_0.dtd, whose inclusion is mandated by the JSR 127: JavaServer Faces specification.\n\nCode that is more substantial, more volatile, or not directly consumed at runtime in source form may only be distributed in binary form.\n\nBy including only the object/binary form, there is less exposed surface area of the third-party work from which a work might be derived; this addresses the second guiding principle of this policy. By attaching a prominent label to the distribution and requiring an explicit action by the user to get the reciprocally-licensed source, users are less likely to be unaware of restrictions significantly different from those of the Apache License; this addresses the fourth guiding principle of this policy.\n\nAlthough the source must not be included in Apache products, the NOTICE file, which is required to be included in each ASF distribution, must point to the source form of the included binary (more on that in the forthcoming \"Receiving and Releasing Contributions\" document).\n\nNote that works written in a scripting language without a binary form cannot be included in any ASF product under one of these licenses (see Transition and Exceptions). In addition, C-based projects may have difficulty using works under these licenses since they would have to deal with platform-specific binaries, rather than just distributing source that can be built on most any platform.\n\nIn fact our use is exactly like described there: We dont ship with this file at all (its nowhere in any ZIP/TGZ) and so no derivative work can be created. ",
            "author": "Uwe Schindler",
            "id": "comment-13463329"
        },
        {
            "date": "2012-09-25T23:10:48+0000",
            "content": "\nThe main Lucene Notice file does not need to be changed, as it is not in the binary JAR file.\n\nI don't agree. its a dependency that we download if you use the source release. \n\"binary release\" doesnt even really exist, and is optional (i coudl put up an RC with just source: totally valid)\n\neither this CDDL shit needs to be in NOTICE.txt, or we should eradicate these dependencies. ",
            "author": "Robert Muir",
            "id": "comment-13463331"
        },
        {
            "date": "2012-09-25T23:38:46+0000",
            "content": "OK, lets add it to toplevel NOTICE.txt, too! We should only change the text a littel bit (as we don't bundle). ",
            "author": "Uwe Schindler",
            "id": "comment-13463354"
        },
        {
            "date": "2012-09-25T23:59:24+0000",
            "content": "Patch with addition to Lucene's NOTICE.txt, also the \"bundled\" was removed. ",
            "author": "Uwe Schindler",
            "id": "comment-13463377"
        },
        {
            "date": "2012-09-26T00:13:04+0000",
            "content": "Robert reminded me that the LUCENE notice file must be verbatim in Solr's ",
            "author": "Uwe Schindler",
            "id": "comment-13463391"
        },
        {
            "date": "2012-09-26T00:14:44+0000",
            "content": "+1 to commit. Thanks for fixing this up Uwe. ",
            "author": "Robert Muir",
            "id": "comment-13463392"
        },
        {
            "date": "2012-09-26T00:16:50+0000",
            "content": "I don't agree. its a dependency that we download if you use the source release. \n\n+1 \n\nOK, lets add it to toplevel NOTICE.txt, too! \n\n+1\n\nAlways better to error on the stricter side with licenses. ",
            "author": "Mark Miller",
            "id": "comment-13463393"
        },
        {
            "date": "2012-09-26T00:30:41+0000",
            "content": "I also am in favor of a backport to 3.6 branch here. in case we do a 3.6.2\n\nI'll do the work if Uwe doesnt have the time. ",
            "author": "Robert Muir",
            "id": "comment-13463399"
        },
        {
            "date": "2012-09-26T00:43:12+0000",
            "content": "I can backport tomorrow! ",
            "author": "Uwe Schindler",
            "id": "comment-13463404"
        },
        {
            "date": "2012-10-12T14:30:38+0000",
            "content": "Are we still going to back port this? Trying to close all the 4.0 issues in Lucene so I can mark the release - can't close or push this one though. If it's going to take a bit, I'll just create a new issue for the back port. ",
            "author": "Mark Miller",
            "id": "comment-13475017"
        },
        {
            "date": "2012-10-12T14:32:29+0000",
            "content": "We backported this to 4.0, sorry! You can close it. ",
            "author": "Uwe Schindler",
            "id": "comment-13475019"
        },
        {
            "date": "2012-10-12T14:33:37+0000",
            "content": "The issue was left open actually for a possible 3.6 backport in case we ever wanted to do a 3.6.2 release. ",
            "author": "Robert Muir",
            "id": "comment-13475021"
        },
        {
            "date": "2012-10-12T14:50:03+0000",
            "content": "Sorry, we misunderstood each other! In 3.6.2 we need to fix this if we release 3.6.2. ",
            "author": "Uwe Schindler",
            "id": "comment-13475038"
        },
        {
            "date": "2013-01-10T18:43:06+0000",
            "content": "Can this be resolved now, since 3.6.2 was released? ",
            "author": "Steve Rowe",
            "id": "comment-13549894"
        },
        {
            "date": "2013-01-10T18:48:01+0000",
            "content": "No, because it wasnt fixed in 3.6.2 ",
            "author": "Robert Muir",
            "id": "comment-13549904"
        },
        {
            "date": "2013-01-10T18:54:24+0000",
            "content": "ah right, fix version is 3.6.3 ",
            "author": "Steve Rowe",
            "id": "comment-13549914"
        },
        {
            "date": "2013-01-10T19:01:31+0000",
            "content": "I did those automatically (when jira releases, it asks you if you want to move out any still-open issues... never saw it before, its handy though).\n\nbut  yeah we should still fix this if we do a 3.6.3 IMO ",
            "author": "Robert Muir",
            "id": "comment-13549930"
        },
        {
            "date": "2013-01-15T23:35:53+0000",
            "content": "Patch for the 3.6 branch.  Only Solr changes are included, since Lucene doesn't have include servlet-api.jar in this branch.\n\nCommitting shortly. ",
            "author": "Steve Rowe",
            "id": "comment-13554518"
        },
        {
            "date": "2013-01-15T23:41:31+0000",
            "content": "Committed to branches/lucene_solr_3_6/. ",
            "author": "Steve Rowe",
            "id": "comment-13554526"
        },
        {
            "date": "2013-03-22T16:32:37+0000",
            "content": "[branch_4x commit] Uwe Schindler\nhttp://svn.apache.org/viewvc?view=revision&revision=1390236\n\nMerged revision(s) 1390235 from lucene/dev/trunk:\nLUCENE-4431: Fix license of servlet-api.jar in Solr and Lucene ",
            "author": "Commit Tag Bot",
            "id": "comment-13610754"
        },
        {
            "date": "2013-05-10T10:34:16+0000",
            "content": "Closed after release. ",
            "author": "Uwe Schindler",
            "id": "comment-13654170"
        }
    ]
}