{
    "id": "LUCENE-8588",
    "title": "Replace usage of deprecated RAMOutputStream",
    "details": {
        "components": [
            "core/index"
        ],
        "status": "Resolved",
        "resolution": "Fixed",
        "fix_versions": [
            "master (8.0)",
            "7.7"
        ],
        "affect_versions": "None",
        "labels": "",
        "priority": "Trivial",
        "type": "Improvement"
    },
    "description": "While reviewing code in FrozenBufferedUpdates I noticed that it uses the deprecated RAMOutputStream. This issue fixes it. Separately we should reduce the usage of that class, so that we can really remove it.\n\n \n\nBesides that, while running tests I hit a test failure which at first I thought was related to this change, but then noticed that the test doesn't close the DirectoryReader (I run tests on Windows), so that fix is included in this patch too.",
    "attachments": {
        "LUCENE-8588.patch": "https://issues.apache.org/jira/secure/attachment/12950535/LUCENE-8588.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16708560",
            "author": "Shai Erera",
            "content": "I think this is ready to commit ",
            "date": "2018-12-04T11:07:17+0000"
        },
        {
            "id": "comment-16708572",
            "author": "Dawid Weiss",
            "content": "Hi Shai, please don't remove it yet. There's a bulk issue that removes all usages of Ram*Stream and RAMDirectory all across the codebase. The consensus was that we don't do it until 8.x is cut. I'll link the original issue where this is discussed. ",
            "date": "2018-12-04T11:21:49+0000"
        },
        {
            "id": "comment-16708574",
            "author": "Dawid Weiss",
            "content": "Link to the parent issue that removes all RAMDirectory cruft across the codebase. I have a branch for this, it'll create conflicts if you remove some bits separately. ",
            "date": "2018-12-04T11:23:55+0000"
        },
        {
            "id": "comment-16708780",
            "author": "Shai Erera",
            "content": "Dawid Weiss thanks for pointing that out. I will not commit that change then. I pushed a commit that closes the DirReader in the test and one that fixes a typo. Thanks! ",
            "date": "2018-12-04T14:38:54+0000"
        }
    ]
}