{
    "id": "LUCENE-4165",
    "title": "HunspellDictionary - AffixFile Reader closed, Dictionary Readers left unclosed",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/analysis"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.6.1",
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "3.6",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The HunspellDictionary takes an InputStream for affix file and a List of Streams for dictionaries.\n\nJavadoc is not clear about i have to close those stream myself or the Dictionary constructor does this already.\n\nLooking at the code, at least reader.close() is called when the affix file is read via readAffixFile() method (although closing streams is not done in a finally block - so the constructor may fail to do so).\nThe readDictionaryFile() method does miss the call to close the reader in contrast to readAffixFile().\n\nSo the question here is - have i have to close the streams myself after instantiating the dictionary?\nOr is the close call only missing for the dictionary streams?\nEither way, please add the close calls in a safe manner or clarify javadoc so i have to do this myself.",
    "attachments": {
        "lucene_36.patch": "https://issues.apache.org/jira/secure/attachment/12533614/lucene_36.patch",
        "LUCENE-4156-trunk.patch": "https://issues.apache.org/jira/secure/attachment/12533769/LUCENE-4156-trunk.patch",
        "LUCENE_4156_36.patch": "https://issues.apache.org/jira/secure/attachment/12533830/LUCENE_4156_36.patch",
        "lucene_trunk.patch": "https://issues.apache.org/jira/secure/attachment/12533613/lucene_trunk.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-06-26T08:09:01+0000",
            "content": "You're right, we should clean up the Streams and make it clear.  Do you want to put together a patch which addresses this? ",
            "author": "Chris Male",
            "id": "comment-13401232"
        },
        {
            "date": "2012-06-26T08:41:10+0000",
            "content": "Yeah i can do so. Against trunk only or branch-3.6 too? ",
            "author": "Torsten Krah",
            "id": "comment-13401247"
        },
        {
            "date": "2012-06-26T08:59:42+0000",
            "content": "Trunk and 3.6 would be fantastic since this is really a bug fix so we'll get it into 3.6.1. ",
            "author": "Chris Male",
            "id": "comment-13401259"
        },
        {
            "date": "2012-06-26T10:08:01+0000",
            "content": "\n\tPatch against trunk and 3.6.\n\tResources are closed asap.\n\tFinally block in constructor added to be sure resources are closed too if an exception is hit before resources are processed.\n\tTest modified to check if close() was called on the provided streams after the Dictionary constructor was called.\n\n ",
            "author": "Torsten Krah",
            "id": "comment-13401276"
        },
        {
            "date": "2012-06-26T10:28:15+0000",
            "content": "Isn't it sufficient to have the streams closed in the finally block of the constructor? Is there any reason we need to close them in readAffix and readDictionary as well? ",
            "author": "Chris Male",
            "id": "comment-13401284"
        },
        {
            "date": "2012-06-26T11:29:22+0000",
            "content": "It would should be sufficient.\nOnly reason i did was, that fd is freed asap it is not needed anymore to get rid of it, just in case processing of the others may take time.\nBut its a more theoretical scenario, because file descriptors should not be that \"low\" to make a real world difference here.\nShould i'll provide new patches?\n\nObsoleted comment, see next one from me. ",
            "author": "Torsten Krah",
            "id": "comment-13401307"
        },
        {
            "date": "2012-06-26T11:31:11+0000",
            "content": "That'd be great if you could since I think it is cleaner for them to be closed in one place. ",
            "author": "Chris Male",
            "id": "comment-13401308"
        },
        {
            "date": "2012-06-26T11:44:02+0000",
            "content": "Just did think about it again and would prefer to close the readers explicitly too.\nA Reader may internally acquire other resources (byte buffers etc.) which must/should be released too (e.g. have a look at: com.sun.org.apache.xerces.internal.impl.io.UTF8Reader).\nCalling close() on the reader should imho be done too - do you agree with me? ",
            "author": "Torsten Krah",
            "id": "comment-13401312"
        },
        {
            "date": "2012-06-26T11:48:46+0000",
            "content": "Yes you're quite right actually.  Okay we'll go with closing them in both places. ",
            "author": "Chris Male",
            "id": "comment-13401323"
        },
        {
            "date": "2012-06-26T12:24:10+0000",
            "content": "Two things:\n\n\tIn Lucene we have a variant of the Java 7 close with resources logic. It is (including examples) in the utility package (IOUtils). We should use this, as it correctly handles special cases like supressing Exceptions occuring on close(). It also ensures, all resources are closed.\n\tfrom my perspective / in my opinion: the general contract in Java is, that methods getting streams or readers don't close. This is e.g. important if you have the stuff in a ZIP file and read it with ZIPInputStream. If you close that reader, you cannot read the other files in the archive anymore. So I would prefer to let the user close the files. Behavior in APIs is different for methods taking file names, of course. They close their internal streams. We also fixed other places in Lucene to respect this contract. E.g., IndexWriter does not close readers from Field instances.\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-13401343"
        },
        {
            "date": "2012-06-26T12:37:54+0000",
            "content": "So we should close any Readers we internally create (such as in readDictionaryFile()) but leave the InputStreams that have been passed in? ",
            "author": "Chris Male",
            "id": "comment-13401350"
        },
        {
            "date": "2012-06-26T12:50:35+0000",
            "content": "If you close the Reader it automatically closes all underlying streams (see docs). So: No, you simply wrap any readers around in your code and let GC do its work. Reader dont allocate any resources like file handles whatever. InputStreamReader just wraps a CharsetDecoder on top. Buffers it allocates will be freed by GC.\n\nSo just take the IS as got from caller, do something with it (e.g. wrap a Reader on top) and then return method without doing anything. Closing any wrapped readers would break the contract. If the caller closes the InputStream he releases resources. ",
            "author": "Uwe Schindler",
            "id": "comment-13401359"
        },
        {
            "date": "2012-06-26T12:52:21+0000",
            "content": "Okay, makes sense.  Then we need to pull out the close in readAffixFile and document that we don't close anything (even if it is the general Java contract, will still be helpful for users to know). ",
            "author": "Chris Male",
            "id": "comment-13401361"
        },
        {
            "date": "2012-06-26T12:55:23+0000",
            "content": "We should document it, that would be good.\n\nThe example with the ZIPInputStream is the number one example, why a method should not close streams passed to it  Otherwise you need horrible things like \"CloseShieldInputStream\" (as used by TIKA) to prevent closing for the ZIP file case. ",
            "author": "Uwe Schindler",
            "id": "comment-13401364"
        },
        {
            "date": "2012-06-26T12:56:43+0000",
            "content": "Just my 2 cents:\n\nBut GC may or may not happend and you will run out of file descriptors sooner or later. You can't rely on GC to kick in and clean up and the resources may be gone already (fd run out e.g.).\n\nZIPInputstream is a good example, the Inflater instance there does use non heap memory and is only freed if \"inflater.end()\" is called. This will be done via finalize - but you are going to see OOMException before, because you may have enough heap and GC decides not to collect your ZIS instance, but the memory used by the inflater is full.\n\nAnd creating Readers and not closing them is imho not good either, e.g. take a look at: com.sun.org.apache.xerces.internal.impl.io.UTF8Reader.\nNo finalize there, if you do not call close on that reader, the ThreadLocal allocated does leak - imho if you create readers, you should close them.\n\nIn this case the readers are not allocating extra stuff so closing the streams can be done by the user, but imho not closing internally created readers is not good. Than to not take InputStreams as arguments but use a Reader and document that the callee must call close on that reader. ",
            "author": "Torsten Krah",
            "id": "comment-13401365"
        },
        {
            "date": "2012-06-26T12:58:30+0000",
            "content": "\nThan to not take InputStreams as arguments but use a Reader and document that the callee must call close on that reader.\n\nI think the challenge is the caller does not know how to supply a reader as the encoding is specified in the .aff file. ",
            "author": "Robert Muir",
            "id": "comment-13401366"
        },
        {
            "date": "2012-06-26T13:00:13+0000",
            "content": "Hm thats correct - but than the Reader should imho be closed anyway and the callee must be aware (via docs) that in any failure case, he should cleanup the streams provided or he may leak some fd. ",
            "author": "Torsten Krah",
            "id": "comment-13401367"
        },
        {
            "date": "2012-06-26T13:03:09+0000",
            "content": "Did you actually run into any problems (lack of fds, OOMs) Torsten? or was it just the lack of documentation that made you aware of the issue? ",
            "author": "Chris Male",
            "id": "comment-13401369"
        },
        {
            "date": "2012-06-26T13:11:52+0000",
            "content": "Not yet.\nIt was a pure lack of documentation and as Tika got leaking descriptors in v0.9 which really hurt me, i thought it might be a good idea to find a solution .\n\nI am using a custom Tokenizer and wanted to use the HunspellDictionary and did not know if i have to close the streams or not because docs does not tell.\nLooking at the code it does close the affix reader, but does not close the dicionary ones - so here is at least a gap .\n\nUsing \"lsof\" you can see the affic file descriptor vanishing and the dictionary one still there (because i did not close the stream), so it does leak yet. ",
            "author": "Torsten Krah",
            "id": "comment-13401375"
        },
        {
            "date": "2012-06-26T13:16:28+0000",
            "content": "Okay then I think a reasonable solution would be to remove the close from readAffixFile and document then it is the callers responsibility to close the Streams. ",
            "author": "Chris Male",
            "id": "comment-13401377"
        },
        {
            "date": "2012-06-26T13:20:23+0000",
            "content": "And creating Readers and not closing them is imho not good either, e.g. take a look at: com.sun.org.apache.xerces.internal.impl.io.UTF8Reader. No finalize there, if you do not call close on that reader, the ThreadLocal allocated does leak - imho if you create readers, you should close them.\n\nLOOOOL  UTF8Reader of Xerces is broken, so don't take this one as example. It should go away, especially it is slower (like Jettys broken readers, too) than recent Java ones. In times of Java 1.1 there was a speed improvement, but not any more.\n\nThe Readers we wrap around the InputStream are standard Java readers (InputStreamReader) and we really don't need to close them. This is done everywhere that way. BufferedReader (if needed), also needs no close. No broken ThreadLocals, nothing, just plain GC. So please don't do any crazy stuff here.\n\nThe only thing that takes system resources like FDs may be the InputStream from a File or ZIP file. And those will be closed by the caller.\n\nWe should just document that the InputStream is not closed. There is nothing to worry about. We had a similar discussion already in the past with the Readers passed to Fields.\n\nUwe ",
            "author": "Uwe Schindler",
            "id": "comment-13401379"
        },
        {
            "date": "2012-06-26T13:25:59+0000",
            "content": "I did not say its a good example, but its a example that match the docs.\nA reader may allocate resources depending on the implementation and you are creating and not closing them - you may leak resources a reader may have allocated - that was the purpose for that example; you can imagine every reader you want (e.g. a Buffered one which does buffer things on disk and clear the files if you call close ...).\n\nThe actual JRE implementation used does not use such readers - but imho you should not depend on implementation when using an interface; the JRE implementation may change and code will leak resources in that case.\nWhy should a reader have a close() method if you should not call it when you are done? And relying on GC is never a good idea when it comes to resources and you actually do not know what system resources are acquired by the readers, because you can't know  what implementation is used and because of that, you don't even know for sure if \"finalize\" does call close.\n\nWhats the problem with calling close on that readers and tell the caller that the stream is consumed and closed?\n\nYou said: \"This is done everywhere that way.\" - hm what do you mean with everywhere? Usually at least i do close all my readers which i did create.\n\nAt least it should be made clear, which was the purpose of the report, whatever solution is accepted - close the readers or do not close them and tell the caller to close the input streams. ",
            "author": "Torsten Krah",
            "id": "comment-13401381"
        },
        {
            "date": "2012-06-26T13:39:55+0000",
            "content": "-1, don't close InputStreams. We do this nowhere in Lucene (of course we close streams, but only if we open them. Wrapping is not opening, it's just decorating the underlying).\n\nYou said: \"This is done everywhere that way.\" - hm what do you mean with everywhere? Usually at least i do close all my readers which i did create.\n\nI am talking about libraries. Of course the end user code closes the underlying stream. And with the filter-reader contract you are wrong. Reader's and InputStream are a Decorator-Pattern API. The close() call of the wrapper just delegates down, but there is no must to call it.\n\nWhats the problem with calling close on that readers and tell the caller that the stream is consumed and closed?\n\nSee my example with ZIPInputStream. If you close the Reader on top, it will close the ZIPInputStream. You have no chance to read the next ZIP-file entry. There are more examples like this.\n\nThe design of the Lucene TokenStream API also follows the decorator pattern, the same applies for this one. ",
            "author": "Uwe Schindler",
            "id": "comment-13401386"
        },
        {
            "date": "2012-06-26T13:53:07+0000",
            "content": "I know the ZIPInputStream problem, but the solution here is, to use a Reader, which does not delegate the close call to the stream, but releases all resources which it did create itself; as you said: \n\n... The close() call of the wrapper just delegates down, but there is no must to call it. ...\n\nSo in general not calling close() on readers, may leak resources if they did acquire extra ones beside the stream they take (which is up to the actual implementation used) - so in general its good to close them; there are actual some implementations of cause, which are a PITA to use if you actually call \"close\" (e.g. the ZIPInputStream problem)- but thats another problem.\n\nOk back to topic :-D:\n\nI am going to add a patch for trunk and branch which does remove the reader.close() call and add a javadoc comment to the constructors, that the streams provided MUST be closed by the caller, right?\n\n ",
            "author": "Torsten Krah",
            "id": "comment-13401393"
        },
        {
            "date": "2012-06-26T13:54:13+0000",
            "content": "+1, Yes. ",
            "author": "Uwe Schindler",
            "id": "comment-13401397"
        },
        {
            "date": "2012-06-26T13:58:22+0000",
            "content": "+1 ",
            "author": "Chris Male",
            "id": "comment-13401398"
        },
        {
            "date": "2012-06-26T14:02:41+0000",
            "content": "to use a Reader, which does not delegate the close call to the stream\n\nJava Readers do this. The only workaround is e.g. TIKA's CloseShieldInputStream. If you wrap it between the original stream and your InputStreamReader on top, then you can call close on the InputStreamReader.\n\nAbout the misunderstanding: The counterpart for close() is the ctor, and close() closes the \"underlying\" \"opened\" resource (this is what the docs says). This resource is the stream and nothing else. If you call close on a decorator (like InputStreamReader, BufferedInputStrea), the close call closes the underlying \"opened\" resource. It talks about nothing else.\n\nAs I said, XERCES UTF8Reader is already horribly broken, it violates Unicode specs and lots of other stuff + it is horribly slow, so its a bad example. If it allocates ThreadLocals, there is no need / requirement to release them on close(). Close() should only close the underlying resource, not any helpers around. ",
            "author": "Uwe Schindler",
            "id": "comment-13401401"
        },
        {
            "date": "2012-06-26T14:28:19+0000",
            "content": "Last 2 cents about the misunderstanding:\n\nDoc says: \"Closes the stream and releases any system resources associated with it.\".\n\nMay be read like this:\n\n1. \"it\" may actually mean the stream here -> \"Closes the stream and releases any system resources associated with the stream.\"\n2. \"it\" just meaning the object (reader) itself -> \"Closes the stream and releases any system resources associated with the reader.\"\n\nBoth is possible (is it?) and to me 2. would be more common, because @ variant 1. you do not know, if \"close\" on the stream does really release any system resources (this is up to the input streams close method, e.g. take the CloseShieldInputStream.) - so if 1. should be the only one meaning of the docs, they are promising things, which they can't enforce .\nBut i guess i have to look at english grammer again (long long ago ...) - maybe this is really clear here how it must be understand - if 1. is the only possible one from a language perspective one, than it should imho read more like this:\n\n\"Does call close on the Stream.\" - not more, because you do not know if any system resources are freed; this should be documented at the close() method of the actual InputStream documentation used.\n\nBack to topic: I'll provide those patches asap. ",
            "author": "Torsten Krah",
            "id": "comment-13401426"
        },
        {
            "date": "2012-06-27T07:21:21+0000",
            "content": "Updated patches:\n\n1. removed reader.close() call in readAffixFile() function.\n2. Add comment at ctors and arguments to make clear that caller has to close the streams and that the ctor does not close them.\n3. Test modified to check its actually not closed.\n4. Added 2 close calls on the streams in trunk patch for the Test. ",
            "author": "Torsten Krah",
            "id": "comment-13402019"
        },
        {
            "date": "2012-06-28T02:48:33+0000",
            "content": "Updated version of trunk patch which closes the InputStreams created in Solr's HunspellStemFilterFactory. ",
            "author": "Chris Male",
            "id": "comment-13402794"
        },
        {
            "date": "2012-06-28T11:14:26+0000",
            "content": "Updated patch for 36 branch which does handle StemFactory closing.\nPorted IOUtils change from trunk to branch (IOException removed from throws declaration). ",
            "author": "Torsten Krah",
            "id": "comment-13403010"
        },
        {
            "date": "2012-06-28T11:56:06+0000",
            "content": "Thanks for doing that Torsten.  Would it be possible to make a version that doesn't change IOUtils but instead just catches the useless Exception?  3.6.1 is just a bug fix so I'd rather not change anything unnecessary. ",
            "author": "Chris Male",
            "id": "comment-13403037"
        },
        {
            "date": "2012-06-28T14:05:50+0000",
            "content": "Updated patch, removed IOUtils change, catch useless Exception. ",
            "author": "Torsten Krah",
            "id": "comment-13403112"
        },
        {
            "date": "2012-07-16T12:23:16+0000",
            "content": "3x commit in r1361988 ",
            "author": "Chris Male",
            "id": "comment-13415052"
        },
        {
            "date": "2012-07-16T16:27:11+0000",
            "content": "Can I resolve this one? ",
            "author": "Uwe Schindler",
            "id": "comment-13415354"
        },
        {
            "date": "2012-07-17T06:06:54+0000",
            "content": "trunk r1362371\n4x 1362373\n\nThanks guys! ",
            "author": "Chris Male",
            "id": "comment-13415923"
        },
        {
            "date": "2012-07-22T16:04:54+0000",
            "content": "Bulk close for 3.6.1 ",
            "author": "Uwe Schindler",
            "id": "comment-13420202"
        }
    ]
}