{
    "id": "LUCENE-2787",
    "title": "disable atime for DirectIOLinuxDirectory",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/other"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In Linux's open():\nO_NOATIME\n    (Since Linux 2.6.8) Do not update the file last access time (st_atime in the inode) when the file is read(2). This flag is intended for use by indexing or backup programs, where its use can significantly reduce the amount of disk activity. This flag may not be effective on all filesystems. One example is NFS, where the server maintains the access time.\n\nSo we should do this in our linux-specific DirectIOLinuxDirectory.\n\nSeparately (offtopic), it would be better if this was a LinuxDirectory that only uses O_DIRECT when it should \nIt would be nice to think about an optional modules/native for common platforms similar to what tomcat provides\nIts easier to test directories like this now (-Dtests.directory)...",
    "attachments": {
        "LUCENE-2787.patch": "https://issues.apache.org/jira/secure/attachment/12465043/LUCENE-2787.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-12-01T14:19:28+0000",
            "content": "all core tests pass with this directory. ",
            "author": "Robert Muir",
            "id": "comment-12965688"
        },
        {
            "date": "2010-12-01T14:37:58+0000",
            "content": "robert, you can also control this through mount options / how you mount your filesystems with setting the noatime option on the mount command do you think this is absolutely necessary to set this in here by default? \n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12965695"
        },
        {
            "date": "2010-12-01T14:40:00+0000",
            "content": "Simon, of course you can, but why not set it? Our indexes don't need the atime for any reason.\n\nThe option exists specifically for apps like lucene... see the description from the man page!!!! ",
            "author": "Robert Muir",
            "id": "comment-12965697"
        },
        {
            "date": "2010-12-01T14:45:14+0000",
            "content": "Also simon, i just wanted to say, you need to be root to change the mount option etc.\n\nI think this is totally appropriate for us to do, again quoting from the page:\n\n\"This flag is intended for use by indexing or backup programs, where its use can significantly reduce the amount of disk activity.\"\n ",
            "author": "Robert Muir",
            "id": "comment-12965700"
        },
        {
            "date": "2010-12-01T14:45:16+0000",
            "content": "The option exists specifically for apps like lucene... see the description from the man page!!!!\n\nThe intention behind the man page is not for the part of the app that manages the index itsself (like Lucene) - it is for the part of the app, that reads files to index them (so that would be the app that uses lucene and e.g. uses TIKA to read all files, this one should set noatime). The idea is to not mark the file as \"accessed\" when the virus scanner or the KDE/gnome file system browser indexes it.\n\nSimon is right about setting it as a mount option. ",
            "author": "Uwe Schindler",
            "id": "comment-12965701"
        },
        {
            "date": "2010-12-01T15:00:55+0000",
            "content": "Uwe: I don't interpret it that way!\n\nI don't think our indexinputs should be doing writes! ",
            "author": "Robert Muir",
            "id": "comment-12965705"
        },
        {
            "date": "2010-12-01T16:50:06+0000",
            "content": "+1, this is a no brainer.  I had no idea linux lets you turn off atime per file desriptor!\n\nIt's ridiculous that the OS maintains an atime on our index files.\n\nUwe, I agree about the intention of the man page (so eg back when contrib/benchmark used to write 10,000 files to run its tests, and then index them, we could've seen a big speedup  ), but still it can't hurt to also turn it off when opening the index files for reading.\n\nI think atime is updated per-read not just at open (http://lkml.org/lkml/1998/12/14/81) though I'm not sure.  Even so, it's presumably cached in the OS's write buffer and then only flushed periodically, so I don't think we'll see sizable gains here.  But every bit counts so I think we should do it. ",
            "author": "Michael McCandless",
            "id": "comment-12965740"
        },
        {
            "date": "2010-12-01T17:28:47+0000",
            "content": "after all i think we should really do it. I can not think of any situation where you want atime to be updated here. It seems that lots of distributions use relatime which is smarter about it see: http://lwn.net/Articles/244829/\n\nwe should really document that on the wiki so that folks can check what their dist does or by default set it to noatime.\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-12965752"
        },
        {
            "date": "2010-12-03T19:09:26+0000",
            "content": "Committed revision 1041954 (trunk), 1041957 (3x) ",
            "author": "Robert Muir",
            "id": "comment-12966631"
        },
        {
            "date": "2011-03-30T15:50:12+0000",
            "content": "Bulk close for 3.1 ",
            "author": "Grant Ingersoll",
            "id": "comment-13013398"
        }
    ]
}