{
    "id": "LUCENE-3643",
    "title": "Improve FilteredQuery to shortcut on wrapped MatchAllDocsQuery",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Since the rewrite of Lucene trunk to delegate all Filter logic to FilteredQuery, by simply wrapping in IndexSearcher.wrapFilter(), we can do more short circuits and improve query execution. A common use case it to pass MatchAllDocsQuery as query to IndexSearcher and a filter. For the underlying hit collection this is stupid and slow, as MatchAllDocsQuery simply increments the docID and checks acceptDocs. If the filter is sparse, this is a big waste. This patch changes FilteredQuery.rewrite() to short circuit and return ConstantScoreQuery, if the query is MatchAllDocs.",
    "attachments": {
        "LUCENE-3643.patch": "https://issues.apache.org/jira/secure/attachment/12507015/LUCENE-3643.patch",
        "LUCENE-3643-noNullQueryFilter.patch": "https://issues.apache.org/jira/secure/attachment/12507155/LUCENE-3643-noNullQueryFilter.patch",
        "LUCENE-3643-allowNullQueryFilter.patch": "https://issues.apache.org/jira/secure/attachment/12507154/LUCENE-3643-allowNullQueryFilter.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-12-12T16:46:38+0000",
            "content": "Patch for trunk.\n\nIt also adds tests that checks for correctly rewritten queries with correct boosts (it assigns random boosts and checks the resulting query's boost). ",
            "author": "Uwe Schindler",
            "id": "comment-13167588"
        },
        {
            "date": "2011-12-12T16:49:24+0000",
            "content": "With this patch applied, it's now also possible to search directly on IndexSearcher with only a filter given:\n\n\nTopDocs topDocs = searcher.search(null, filter, topN);\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-13167595"
        },
        {
            "date": "2011-12-12T18:33:48+0000",
            "content": "Improved patch with more documentation in FilteredQuery.rewrite() and easier if/then/else checks (+ asserts).\n\nAlso added some more javadocs.\n\nThis cannot be backported to 3.x, because:\n\n\tIn 3.x Filters are not required to only contain non-deleted documents (in trunk, they must respect non-null acceptDocs). As ConstantScoreQuery does not enforce deleted documents the optimization may return wrong results (MatchAllDocs is required)\n\tThe API of IndexSearcher cannot be modified, so wrapFilter() is not available there. IS delegates hit collection to FilteredQuery, but it does not rewrite Filter+Query to FilteredQuery.\n\n\n\nThis is ready to commit. ",
            "author": "Uwe Schindler",
            "id": "comment-13167654"
        },
        {
            "date": "2011-12-12T22:04:44+0000",
            "content": "Hi Uwe, I think the patch looks great.\n\nI just have one question, should we really advertise that you can pass a null Query to IndexSearcher?\n\nI'm not saying I'm against it, but maybe we should think about it... because then maybe someone\nsays its strange they can't have a null query and null filter with a Sort.\n\nIf FilteredQuery optimizes the MatchAllDocsCase behind the scenes anyway, what is the harm in keeping\nthe current semantics? ",
            "author": "Robert Muir",
            "id": "comment-13167851"
        },
        {
            "date": "2011-12-12T22:18:29+0000",
            "content": "Here a more simplified rewrite. As rewrite is  running in a loop \"while (query != query.rewrite())\", we don't need to do everything on first pass. The special cases are simply expanded only on the not rewritten inner query, otherwise a new FilteredQuery is created. The second pass may rewrite the inner query. ",
            "author": "Uwe Schindler",
            "id": "comment-13167866"
        },
        {
            "date": "2011-12-12T22:21:29+0000",
            "content": "I just have one question, should we really advertise that you can pass a null Query to IndexSearcher?\n\nI heard this question quite often, how to execute a solely Filter without query. As the current API allows filter==null, why not the same for the query. Passing null as filter and query of course makes no real sense, so I don't expect this question.\n\nI think it is harder for people to explain them that they must a) either wrap the Filter with CSQ or b) must pass a MatchAllDocsQuery. If you tell them, just call IndexSearcher.search() and pass either filter, query or both, then it's much easier. ",
            "author": "Uwe Schindler",
            "id": "comment-13167872"
        },
        {
            "date": "2011-12-13T09:45:13+0000",
            "content": "Here 2 patch variants:\n\n\n\tallowNullQueryFilter.patch is the same patch as before, with some rewrite() improvements for more clarity, but it allows null Query and null Filter and so does IndexSearcher.\n\tnoNullQueryFilter.patch is a simplier patch, disallowing null filters and null queries, so IndexSaercher behaves as before. The only optimization is to rewrite the MatchAllDocs+Filter combination to CSQ with combined boost.\n\n\n\nAfter sleeping one night about it, I think we should start with the latter patch and maybe think about allowing a null query in IndexSearcher separately in another issue. In my opinion, the null special case should maybe done inside IS.wrapFilter. Allowing null as query or filter in FilteredQuery makes no sense and adds complexity. ",
            "author": "Uwe Schindler",
            "id": "comment-13168263"
        },
        {
            "date": "2011-12-13T16:31:27+0000",
            "content": "I will commit the noBullQuerFilter.patch soon! ",
            "author": "Uwe Schindler",
            "id": "comment-13168483"
        },
        {
            "date": "2011-12-13T16:33:51+0000",
            "content": "Committed LUCENE-3643-noNullQueryFilter.patch to trunk revision: 1213771 ",
            "author": "Uwe Schindler",
            "id": "comment-13168485"
        }
    ]
}