{
    "id": "LUCENE-3201",
    "title": "improved compound file handling",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Currently CompoundFileReader could use some improvements, i see the following problems\n\n\tits CSIndexInput extends bufferedindexinput, which is stupid for directories like mmap.\n\tit seeks on every readInternal\n\tits not possible for a directory to override or improve the handling of compound files.\n\n\n\nfor example: it seems if you were impl'ing this thing from scratch, you would just wrap the II directly (not extend BufferedIndexInput,\nand add compound file offset X to seek() calls, and override length(). But of course, then you couldnt throw read past EOF always when you should,\nas a user could read into the next file and be left unaware.\n\nhowever, some directories could handle this better. for example MMapDirectory could return an indexinput that simply mmaps the 'slice' of the CFS file.\nits underlying bytebuffer etc naturally does bounds checks already etc, so it wouldnt need to be buffered, not even needing to add any offsets to seek(),\nas its position would just work.\n\nSo I think we should try to refactor this so that a Directory can customize how compound files are handled, the simplest \ncase for the least code change would be to add this to Directory.java:\n\n\n  public Directory openCompoundInput(String filename) {\n    return new CompoundFileReader(this, filename);\n  }\n\n\n\nBecause most code depends upon the fact compound files are implemented as a Directory and transparent. at least then a subclass could override...\nbut the 'recursion' is a little ugly... we could still label it expert+internal+experimental or whatever.",
    "attachments": {
        "LUCENE-3201.patch": "https://issues.apache.org/jira/secure/attachment/12482570/LUCENE-3201.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-06-14T00:01:07+0000",
            "content": "+1 ",
            "author": "Michael McCandless",
            "id": "comment-13048906"
        },
        {
            "date": "2011-06-14T00:12:30+0000",
            "content": "I think for this one, I prefer to wait for Uwe's refactoring of MMap on LUCENE-3200.\nThen mmap is simpler, and i think we can even use the same indexinput implementation here.\n\nThis would mean no slowdown when searching CFS. ",
            "author": "Robert Muir",
            "id": "comment-13048912"
        },
        {
            "date": "2011-06-14T17:13:43+0000",
            "content": "Initial patch for review. In this patch I only cut over MMapDirectory to using a special CompoundFileDirectory, all others use the default as before (but i cleaned up some things about it).\n\nPretty sure i can easily improve SimpleFS and NIOFS, i'll take a look at that now, but I wanted to get this up for review. ",
            "author": "Robert Muir",
            "id": "comment-13049283"
        },
        {
            "date": "2011-06-14T17:19:19+0000",
            "content": "Patch looks great!  Incredible that this means there's no penalty at all at search time when using CFS, if you use MMapDir.\n\nI like that CFS reader is now under oal.store not .index. ",
            "author": "Michael McCandless",
            "id": "comment-13049287"
        },
        {
            "date": "2011-06-14T17:29:15+0000",
            "content": "setting 3.3/4.0 as fix version, as the changes are backwards compatible (compoundfilereader is pkg-private still in 3.x) ",
            "author": "Robert Muir",
            "id": "comment-13049296"
        },
        {
            "date": "2011-06-14T18:56:41+0000",
            "content": "Hi Robert, great patch, exactly as I would have wished to have it when we discussed about it!\n\nPatch looks file, small bug:\n\n\tFileSwitchDirectory should also override the openCompoundInput() from Directory and delegate to the correct underlying directory. Now it always uses the default impl, which is double buffering. So if you e.g. put MMapDirectory as a delegate for CFS files, those files would be opened like before your patch. Just copy'n'paste the code from one of the other FileSwitchDirectory methods.\n\n\n\nSome suggestions:\nWe currently map the whole compound file into address space, read the header/contents and unmap it again. This may be some overhead especially if unmapping is not supported.\n\n\tWe could use SimpleFSIndexInput to read CFS contents (we only need to pass the already open RAF there, alternatively use Dawids new wrapper IndexInput around a standard InputStream, got from RAF -> LUCENE-3202)\n\tOnly map the header of the CFS file, the problem: we dont know exact size.\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-13049335"
        },
        {
            "date": "2011-06-14T19:10:01+0000",
            "content": "I agree, the fileswitchdirectory should delegate the openCompoundInput.\n\nAs far as mapping small things, I think we should set this aside for another issue. \nas far as this issue goes, I don't mind returning the DefaultCompound impl if unmapping isn't supported, but i'd really rather defer the open the can of worms of 'mapping small things' to some other issue  ",
            "author": "Robert Muir",
            "id": "comment-13049346"
        },
        {
            "date": "2011-06-14T19:19:38+0000",
            "content": "We have LUCENE-1743 for the small files can of worms. ",
            "author": "Uwe Schindler",
            "id": "comment-13049352"
        },
        {
            "date": "2011-06-14T21:42:14+0000",
            "content": "here is an updated patch, including impls for SimpleFS and NIOFS, fixing the FileSwitchDirectory thing uwe mentioned, and also mockdirectorywrapper and NRTCachingDirectory.\n\nall the tests pass with Simple/NIO/MMap but we need to benchmark. haven't had good luck today with luceneutil ",
            "author": "Robert Muir",
            "id": "comment-13049446"
        },
        {
            "date": "2011-06-14T22:00:14+0000",
            "content": "Robert: Very nice. Small thing:\n\n\n\tNIOFSCompoundFileDirectory / SimpleFSCompoundFileDirectory / MMapCompoundFileDirectory are non-static inner classes but still get parent Directory in ctor. This is douplicated as javac also passes the parent around (the special ParentClassName.this one). I would remove the ctor param and use \"*FSDirectory.this\" as reference to outer class. I nitpick, because at some places it references the parent directory without the ctor param, so its inconsistent.\n\n\n\nThat's all for now, thanks for hard work! ",
            "author": "Uwe Schindler",
            "id": "comment-13049460"
        },
        {
            "date": "2011-06-20T18:59:27+0000",
            "content": "this seems ready to commit... I think we should get that in so I can take it further on LUCENE-3218\n\nRobert is it ok for you if I commit this or are you gonig to do it?\n\nsimon ",
            "author": "Simon Willnauer",
            "id": "comment-13052156"
        },
        {
            "date": "2011-06-20T19:03:12+0000",
            "content": "I didnt commit because I didn't measure any performance improvements from the patch (this frustrated me).\nAlso, I didn't address Uwe's last comment...\n\nIn general, I was thinking that this would be a good performance win, but it isn't. So we should consider it from a refactoring perspective only. ",
            "author": "Robert Muir",
            "id": "comment-13052159"
        },
        {
            "date": "2011-06-21T15:54:57+0000",
            "content": "incorporated in LUCENE-3218 I will track backporting there ",
            "author": "Simon Willnauer",
            "id": "comment-13052634"
        },
        {
            "date": "2011-08-20T09:09:10+0000",
            "content": "reopening, like LUCENE-3218, I think we should pull this stuff back and revisit. ",
            "author": "Robert Muir",
            "id": "comment-13088167"
        },
        {
            "date": "2011-08-20T09:19:28+0000",
            "content": "My last comment was wrong, the impl was changed before commit so it reuses RAF. ",
            "author": "Uwe Schindler",
            "id": "comment-13088169"
        },
        {
            "date": "2011-08-20T09:19:35+0000",
            "content": "thats just not true... but illustrates my point that this stuff is complicated and I think we need to take the safe option here and back it out. ",
            "author": "Robert Muir",
            "id": "comment-13088170"
        },
        {
            "date": "2011-08-20T09:24:33+0000",
            "content": "I reverted my comment  ",
            "author": "Uwe Schindler",
            "id": "comment-13088172"
        },
        {
            "date": "2011-10-02T09:49:46+0000",
            "content": "I think we can close this issue unless we plan to backport the CFS changes to 3.x? Opinions? ",
            "author": "Simon Willnauer",
            "id": "comment-13118988"
        },
        {
            "date": "2011-10-07T19:34:26+0000",
            "content": "not a blocker, it was pulled from 3.x (and fixed in trunk) ",
            "author": "Robert Muir",
            "id": "comment-13123108"
        },
        {
            "date": "2011-10-07T21:57:14+0000",
            "content": "I am closing this... if we feel like porting we can still reopen ",
            "author": "Simon Willnauer",
            "id": "comment-13123243"
        }
    ]
}