{
    "id": "LUCENE-2364",
    "title": "Add support for terms in BytesRef format to Term, TermQuery, TermRangeQuery & Co.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "It would be good to directly allow BytesRefs in TermQuery and TermRangeQuery (as both queries convert the strings to BytesRef internally). For NumericRange support in Solr it will be needed to support numerics as ByteRef in single-term queries.\n\nWhen this will be added, don't forget to change TestNumericRangeQueryXX to use the BytesRef ctor of TRQ.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-04-05T08:10:51+0000",
            "content": "This would also make MTQ's rewrite mode internal collectors better, as they convert BytesRef terms from the enums to String Terms, passing to TermQuery and inside TermScorer convert back. Whith real binary terms (numerics are not yet real binary, they are UTF-8 conform ascii bytes), this would break. ",
            "author": "Uwe Schindler",
            "id": "comment-12853336"
        },
        {
            "date": "2010-04-07T16:13:18+0000",
            "content": "Also FieldCacheRangeFilter.newStringRange, but for this we need FieldCache to load as BytesRef (I'll open a separate issue). ",
            "author": "Michael McCandless",
            "id": "comment-12854575"
        },
        {
            "date": "2010-04-07T21:27:47+0000",
            "content": "Once we fix Term to take a BytesRef, we should remove the newly added IndexReader.docFreq(String field, BytesRef term), and just use the existing one that takes a Term. ",
            "author": "Michael McCandless",
            "id": "comment-12854717"
        },
        {
            "date": "2010-04-09T10:51:49+0000",
            "content": "Maybe we should simply deprecate Term?  It's used in very few places, now.  And then require you pass in separate String field, BytesRef text (eg to TermQuery). ",
            "author": "Michael McCandless",
            "id": "comment-12855343"
        },
        {
            "date": "2010-04-09T11:54:54+0000",
            "content": "+1\n\nTerm is still used at a lot of places in internal code, but that can be changed easily. One of those places is MTQ  ",
            "author": "Uwe Schindler",
            "id": "comment-12855358"
        },
        {
            "date": "2012-03-20T15:34:57+0000",
            "content": "Term now stores BytesRef internally... ",
            "author": "Michael McCandless",
            "id": "comment-13233494"
        }
    ]
}