{
    "id": "LUCENE-3415",
    "title": "Snowball filter to include original word too",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.5",
            "4.0-ALPHA"
        ],
        "affect_versions": "3.3",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "1. Currently, snowball filter deletes the original word and adds the stemmed word to the index. So, if i want to do search with / without stemming, i have to keep 2 fields, one with stemming and one without it. \n2. Rather than doing this, if we have configurable item to preserve original, it would solve more business problem. \n3. Using single field, i can do search using stemming / without stemming by changing the query filters. \n\nThe same can also be done for phonetic filters too.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-09-06T09:51:56+0000",
            "content": "instead of modifying snowball filter you could write a filter that buffers the term and emits it twice. First you simply pass on the term and the second time you set KeywordAttribute#setKeyword(boolean) to true. This will force the stemmer to ignore this term an pass it along the tokenstream pipeline without modification. Would that solve your problem? I am not sure we should actually provide such a filter but others have more insight into this, robert? ",
            "author": "Simon Willnauer",
            "id": "comment-13097857"
        },
        {
            "date": "2011-09-06T10:05:30+0000",
            "content": "How to handle 2 different analyzers for query? Guess, not possible in current design.  ",
            "author": "Manish",
            "id": "comment-13097864"
        },
        {
            "date": "2011-09-06T10:34:55+0000",
            "content": "Manish, why not put your content in a different field without stemming?\n\nYou can use e.g. MultiFieldQueryParser to make this transparent. ",
            "author": "Robert Muir",
            "id": "comment-13097878"
        },
        {
            "date": "2011-09-06T10:56:57+0000",
            "content": "The index size becomes huge (infact double). \nWe have 2 fields both indexed and stored, one with stemming and one without stemming. We thought of removing the stored=true from one of the fields, but highlighting becomes the problem(the field 1 wont have original words and hence term vectors wont highlight it properly)\n\nI have an idea bases on Simon's comments, dont know if it going to work or not. \n\n1. Create new Filter Factory which will put both the stemmed word and original word. \n2. Field 1-> indexed=true, stored=true, use the above filter\n3. Field 2-> indexed=true, stored=false, dont use the above filter. \n\nI can make searches against the corresponding fields. for highlighting, i can always use Field 1 and since term vectors, offsets and positions are present for original words too, it will highlight properly. \n\nDo let me know your thoughts on this.  ",
            "author": "Manish",
            "id": "comment-13097890"
        },
        {
            "date": "2011-09-06T11:18:05+0000",
            "content": "The index size is increasing because you are storing both fields, this has nothing to do with how the analysis is done.\n\nI don't think we should modify every tokenfilter to optionally inject things instead of changing terms: or create a hack with KeywordAttribute.\n\nInstead if the problem is the Highlighter, why not propose a modification to the highlighter so it can highlight field A with field B's stored value? ",
            "author": "Robert Muir",
            "id": "comment-13097898"
        },
        {
            "date": "2011-09-06T11:26:41+0000",
            "content": "The index size increases because we dont have the option of with / without stemming in a single field and as a reason, we have to store in 2 separate fields. \n\nEven with highlighting, we can hightlight another field also, but since the term vector information are different, it cannot hightlight it properly. ",
            "author": "Manish",
            "id": "comment-13097904"
        },
        {
            "date": "2011-09-06T11:29:44+0000",
            "content": "\nThe index size increases because we dont have the option of with / without stemming in a single field and as a reason, we have to store in 2 separate fields. \n\nThis is not true. there are just as many postings either way. ",
            "author": "Robert Muir",
            "id": "comment-13097907"
        },
        {
            "date": "2011-11-10T18:24:49+0000",
            "content": "moving out here - this should be solved differently  ",
            "author": "Simon Willnauer",
            "id": "comment-13147885"
        },
        {
            "date": "2011-11-27T12:29:27+0000",
            "content": "Bulk close after release of 3.5 ",
            "author": "Uwe Schindler",
            "id": "comment-13157763"
        }
    ]
}