{
    "id": "LUCENE-1214",
    "title": "Possible hidden exception on SegmentInfos commit",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.3.1",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "I am not sure if this is that big of a deal, but I just ran into it and thought I might mention it.\n\nSegmentInfos.commit removes the Segments File if it hits an exception. If it cannot remove the Segments file (because its not there or on Windows something has a hold of it), another Exception is thrown about not being able to delete the Segments file. Because of this, you lose the first exception, which might have useful info, including why the segments file might not be there to delete.\n\n\n\tMark",
    "attachments": {
        "LUCENE-1214.patch": "https://issues.apache.org/jira/secure/attachment/12377534/LUCENE-1214.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-03-10T13:06:49+0000",
            "content": "Good catch Mark.  It seems like we should ignore any exception while trying to delete the partially written segments_N file, and throw the original exception.  I'll do that.\n\nHow did you hit these two exceptions? ",
            "author": "Michael McCandless",
            "id": "comment-12576970"
        },
        {
            "date": "2008-03-10T16:46:56+0000",
            "content": "Attached patch.  All tests pass.  I plan to commit in a day or so. ",
            "author": "Michael McCandless",
            "id": "comment-12577066"
        },
        {
            "date": "2008-03-10T21:56:59+0000",
            "content": "I am still trying to work that out...some craziness that started after I updated Lucene to trunk, but also made other fundamental changes, and windows vista may be haunting me too...\n\nThe gist of it is that Lucene is failing when it tries to create an index file (creates the directory fine). I don't think its Lucene related at the moment, but I havnt gotten to the bottom of it either.\n\nOddly, if I stop using the NoLockFactory (I manually manage a single Writer), things work...still digging though. ",
            "author": "Mark Miller",
            "id": "comment-12577220"
        }
    ]
}