{
    "id": "LUCENE-3161",
    "title": "consider warnings from the source compilation",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/build"
        ],
        "type": "Task",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "as Doron mentioned in his review: At compiling there are various warning printed, I think it would be more assuring for downloaders if the build runs without warning. These warnings are not a stopper.\n\nwe could conditionalize these warnings so that they don't \"display\" when compiling from actual releases, but I have to wonder if we should hide these... being open source I think we should display all our warts, maybe some contributor sees these warnings and decides they want to submit a patch to fix some of them.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-31T02:07:53+0000",
            "content": "There are currently 18 warnings in lucene if you use java 6, all of which are in generated code:\n\n\tjflex generates fallthrough warnings\n\tjavacc generates dep-ann and redundant cast warnings.\n\n\n\nAdditionally on java 5-only, you will get a dep-ann warning for Version.java, which is actually a JDK bug.\nI'll commit a workaround for this issue, as its the only one in our code.\n\nIn the future, the javacc dep-ann warnings can be reduced by upgrading to the latest javacc, which generates java-5 compatible code.\nI say reduced because on java 5 it hits the same bug as above... and it still has redundant casts.\n\nI don't think at this time we should be upgrading any of our code generators though, so I think a workaround for our Version.java is the best solution.\nAnd, I don't think we should in general hide any warnings, even to users for the reasons i mentioned above. ",
            "author": "Robert Muir",
            "id": "comment-13041376"
        },
        {
            "date": "2011-05-31T02:13:07+0000",
            "content": "I committed the SuppressWarnings(\"dep-ann\") with a note in revs 1129465, 1129466 (branch3x), 1129467 (branch32).\n\nI'll keep the issue open for future improvements like possibly upgrading javacc. ",
            "author": "Robert Muir",
            "id": "comment-13041379"
        },
        {
            "date": "2011-05-31T04:56:14+0000",
            "content": "And, I don't think we should in general hide any warnings, even to users for the reasons i mentioned above.\n\n+1 for not hiding! ",
            "author": "Doron Cohen",
            "id": "comment-13041418"
        },
        {
            "date": "2013-07-23T18:44:20+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716918"
        },
        {
            "date": "2014-04-16T12:54:28+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970766"
        }
    ]
}