{
    "id": "LUCENE-7366",
    "title": "Allow RAMDirectory to copy any Directory",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "Uwe: \"The FSDirectory passed to RAMDirectory in the ctor could be changed to Directory easily. The additional check for \"not is a directory inode\" is in my opinion lo longer needed, because listFiles should only return files.\"\n\nUse case: For increasing the speed of some of my application tests, I want to re-use/copy a pre-populated RAMDirectory over and over.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15356966",
            "author": "Uwe Schindler",
            "date": "2016-06-30T12:01:15+0000",
            "content": "I think to fix this, we should first fix FSDirectory, to filter the returned filenames in listAll() to only show regular files. I had the impression we already fixed this. No other directory implementation allows o create directorys or lists them, only FSDirectory. So for consistency FSDirectory.listAll() should exclude non-regular files. "
        },
        {
            "id": "comment-15356983",
            "author": "Robert Muir",
            "date": "2016-06-30T12:12:38+0000",
            "content": "I don't agree with that. That costs a readAttribute for every file. "
        },
        {
            "id": "comment-15356997",
            "author": "Uwe Schindler",
            "date": "2016-06-30T12:20:05+0000",
            "content": "So I would suggest to just remove the check (or only do it is instanceof FSDirectory). If somebody has subdirs in an FSDirectory, the copy ctor will just fail - as this is brokenness anyways. "
        },
        {
            "id": "comment-15357006",
            "author": "Uwe Schindler",
            "date": "2016-06-30T12:25:45+0000",
            "content": "I just checked, the ctor taking FSDirectory was originally taking Directory, but this was changed in LUCENE-6241.\n\nAs said before, we should just remove the check. "
        }
    ]
}