{
    "id": "LUCENE-4278",
    "title": "Tests no longer check directories are closed",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I was surprised when writing a test, and forgetting to close my directory,\nthat it didnt fail the test.",
    "attachments": {
        "LUCENE-4278.patch": "https://issues.apache.org/jira/secure/attachment/12538637/LUCENE-4278.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-31T23:43:41+0000",
            "content": "This is something from LUCENE-4243, Ill look into it. ",
            "author": "Robert Muir",
            "id": "comment-13426222"
        },
        {
            "date": "2012-08-01T00:20:11+0000",
            "content": "patch: one test that needed to disable MDW temporarily was CoreContainerCoreInitFailuresTest\n\nI tried cleaning up for the test, it didnt work, its still leaving a directory unclosed. I think under some exceptional conditions, the dir is not closed. ",
            "author": "Robert Muir",
            "id": "comment-13426235"
        },
        {
            "date": "2012-08-01T00:49:18+0000",
            "content": "I tried cleaning up for the test, it didnt work, its still leaving a directory unclosed. I think under some exceptional conditions, the dir is not closed.\n\nThat would totally make sense – as i mentioned in SOLR-3634 ...\n\n\"Directory not closed\" - something about this test is causing MockDirWrapper to complain it's never closed - buti don't think this is a bug in the new code or the test. I suspect we have an existing bug where SolrCore initialization failures after the Directory has already been opened aren't closing the Directory – so we should get to hte bottom of that (probably in a new issue if i'm correct)\n\n...and then later on in that issue...\n\nthe directory not closed problem vanished on it's own – i suspect SOLR-3656 fixed it.\n\n...but based on your comments, it sounds like what actually happened was that LUCENE-4243 broke the close checks and the test just started being silent about the problem. ",
            "author": "Hoss Man",
            "id": "comment-13426252"
        }
    ]
}