{
    "id": "LUCENE-466",
    "title": "Need QueryParser support for BooleanQuery.minNrShouldMatch",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Attached 2 new classes:\n\n1) CoordConstrainedBooleanQuery\nA boolean query that only matches if a specified number of the contained clauses\nmatch. An example use might be a query that returns a list of books where ANY 2\npeople from a list of people were co-authors, eg:\n\"Lucene In Action\" would match (\"Erik Hatcher\" \"Otis Gospodnetić\" \"Mark Harwood\"\n\"Doug Cutting\") with a minRequiredOverlap of 2 because Otis and Erik wrote that.\nThe book \"Java Development with Ant\" would not match because only 1 element in\nthe list (Erik) was selected.\n\n2) CustomQueryParserExample\nA customised QueryParser that allows definition of\nCoordConstrainedBooleanQueries. The solution (mis)uses fieldnames to pass\nparameters to the custom query.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-03-12T17:34:21+0000",
            "content": "Hello,\nMy name is Ivan Biggs and I'm very interested in working with Lucene for my Google Summer of Code Project. I've read  a lot of the relevant documentation and currently have my eye on this issue, however It is my understanding that if I work on this, I  should likely work on another more minor issue in addition to constitute a more suitable work load this summer.\n\nIf anyone has any interest in mentoring, giving relevant ideas, suggesting another related issue, or generally giving me an idea of what sort of proposal Apache would be looking for it'd be greatly appreciated.\n\nThanks,\nIvan ",
            "author": "Ivan Biggs",
            "id": "comment-13932049"
        },
        {
            "date": "2014-03-12T22:12:49+0000",
            "content": "After reviewing other GSoC 2014 tagged issues for LUCENE, I believe (due to the relative simplicity of updating the query parsers) that it would be fairly interesting and doable to work out LUCENE-4892 dur9ing my GSoC work this summer.\nThanks again,\nIvan ",
            "author": "Ivan Biggs",
            "id": "comment-13932503"
        },
        {
            "date": "2014-03-19T10:23:28+0000",
            "content": "Can any Lucene/Solr committer volunteer to mentor this project and/or LUCENE-4892? ",
            "author": "Michael McCandless",
            "id": "comment-13940369"
        }
    ]
}