{
    "id": "LUCENE-6739",
    "title": "Upgrade ant requirement to 1.9 in trunk (6.0)",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "6.0",
        "components": [
            "general/build"
        ],
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "priority": "Major",
        "status": "Open",
        "type": "Task"
    },
    "description": "In trunk, I think we should upgrade the ant requirement to 1.9, both for the main build and for the smoketester.  Ant 1.9 was released two years ago and the ant version packaged with Ubuntu 14 is 1.9.3.  I'm not sure what comes with recent versions of Redhat systems and their derivatives, but the way that Redhat packages ant is completely incompatible with our build system anyway, requiring a manual install.",
    "attachments": {
        "LUCENE-6739.patch": "https://issues.apache.org/jira/secure/attachment/12750650/LUCENE-6739.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14698034",
            "author": "Shawn Heisey",
            "date": "2015-08-15T01:32:13+0000",
            "content": "Related but not exactly on-topic:\n\nI've been able to run the smoketester on official 4.x and 5.x release candidates despite having the wrong version of ant, which initially confused me, because nightly-smoke fails for me.  I'm wondering if perhaps the smoketester should verify that the tester's ant version also matches the official requirement.  Is ant sufficiently removed from smoketester operation that it can't impact the validity of the test?\n\nI've realized that testing release candidates works for me because the explicit ant version comparison is only checked in the release artifacts.  The official RC builds are built with the correct ant version.  The information found in the artifacts is correct, even though my version of ant doesn't match.  When I run nightly-smoke, I am building the artifacts locally, and the comparison fails. "
        },
        {
            "id": "comment-14698195",
            "author": "Uwe Schindler",
            "date": "2015-08-15T09:27:06+0000",
            "content": "-1 to upgrade minimum dependency to ANT 1.9 on trunk, because people using MacOSX would have problems (build would not run as MacOSX bundles 1.8.2 by default). This is exactly the reason why we use 1.8.2 as minimum by default.\n\nWe can discuss about the smoke tester requirement! My comment: as with Java version, I think the person building the artifacts should use the oficial minimum version. Otherwise release artifacts are not reproducible. A normal user / developer won't run \"ant nightly-smoke\" unless you fix some stuff in there. This is meant as a Jenkins-only task... "
        },
        {
            "id": "comment-14698233",
            "author": "Robert Muir",
            "date": "2015-08-15T11:12:38+0000",
            "content": "Agreed, don't make the whole system hard to use, to make a JENKINS task more user-friendly. Wrong tradeoff! "
        },
        {
            "id": "comment-14698236",
            "author": "Uwe Schindler",
            "date": "2015-08-15T11:27:38+0000",
            "content": "I would suggest to add a <antversion/> check to nightly smoke so it fails early. Should I do this as a quick fix? "
        },
        {
            "id": "comment-14698240",
            "author": "Uwe Schindler",
            "date": "2015-08-15T11:45:22+0000",
            "content": "Patch checking minimum/maximum ant version for \"nightly-smoke\" target. "
        },
        {
            "id": "comment-14698472",
            "author": "Ryan Ernst",
            "date": "2015-08-15T22:14:59+0000",
            "content": "> people using MacOSX would have problems (build would not run as MacOSX bundles 1.8.2 by default). This is exactly the reason why we use 1.8.2 as minimum by default.\n\nSince OS X Yosemite, ant is no longer bundled with OS X. You now must use homebrew or other similar package manager to install ant, and the default is the latest. For example, I installed using brew install ant and have version 1.9.4. "
        },
        {
            "id": "comment-14698473",
            "author": "Ryan Ernst",
            "date": "2015-08-15T22:17:01+0000",
            "content": "Requiring 1.8 actually makes it harder for developers on Mac to run the smoke tester, because getting older binaries is a lot more work than using the above command to install ant. "
        }
    ]
}