{
    "id": "LUCENE-8321",
    "title": "Allow composite readers to have more than 2B documents",
    "details": {
        "components": [],
        "status": "Open",
        "resolution": "Unresolved",
        "fix_versions": [],
        "affect_versions": "None",
        "labels": "",
        "priority": "Minor",
        "type": "Improvement"
    },
    "description": "I would like to start discussing removing the limit of ~2B documents that we have for indices, while still enforcing it at the segment level for practical reasons.\n\nPostings, stored fields, and all other codec APIs would keep working on integers to represent doc ids. Only top-level doc ids and numbers of documents would need to move to a long. I say \"only\" because we now mostly consume indices per-segment, but there is still a number of places where we identify documents by their top-level doc ID like IndexReader#document, top-docs collectors, etc.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16480325",
            "author": "Simon Willnauer",
            "content": "I like this idea a lot. It's progress over perfection and it would simplify the accounting in IW dramatically (on the other hand I think it's nice to have this accounting for assertion purposes ie. just to make sure we have correct counts)!! ",
            "date": "2018-05-18T08:14:45+0000"
        },
        {
            "id": "comment-16480479",
            "author": "Robert Muir",
            "content": "I have thought about this, I am personally against the idea because we won't be able to merge segments that large, hence creating a really big trap. ",
            "date": "2018-05-18T10:50:20+0000"
        },
        {
            "id": "comment-16480519",
            "author": "Robert Muir",
            "content": "Also I think the IW accounting needs to stay. Considering we can reasonably merge segments of ~ 1B docs then i think it makes sense to up the limit to 16B or so, but any higher gets into trappy territory. Strongly feel it can't be \"unlimited\" as long as a single segment is limited.\n\nBut I'm concerned this small increase is worth the complexity cost: both on users and on the code: it certainly won't make things any simpler. Also I can see people complaining about what seems like an \"arbitrary\" limit in the code, even though its no more arbitrary than 2B. But we could try it out and see what it looks like? ",
            "date": "2018-05-18T11:41:27+0000"
        },
        {
            "id": "comment-16480675",
            "author": "Adrien Grand",
            "content": "we could try it out and see what it looks like?\n\n+1 I'd be curious to know how much of a rabbit hole this change would end up being. ",
            "date": "2018-05-18T13:53:10+0000"
        }
    ]
}