{
    "id": "LUCENE-6638",
    "title": "Factor graph flattening out of SynonymFilter",
    "details": {
        "resolution": "Duplicate",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "priority": "Major",
        "status": "Resolved",
        "type": "New Feature"
    },
    "description": "Spinoff from LUCENE-6582.\n\nSynonymFilter is very hairy, and has known nearly-impossible-to-fix bugs: it produces the wrong graph, both accepting too many phrases and not enough phrases, because it never creates new positions.\n\nThis makes improvements like LUCENE-6582, to fix some of its bugs, unnecessarily hard.\n\nI'd like to pull out the graph flattening into its own token filter, and I think I have a starting patch that works.  I started with the \"sausagizer\" stage on the branch from LUCENE-5012, but changed the approach so that it should not have so many adversarial cases.\n\nI think this should make SynonymFilter quite a bit simpler, hopefully to the point where we can just fix its bugs already.",
    "attachments": {
        "LUCENE-6638.patch": "https://issues.apache.org/jira/secure/attachment/12742600/LUCENE-6638.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14606428",
            "author": "Michael McCandless",
            "date": "2015-06-29T21:20:48+0000",
            "content": "Starting patch, full of nocommits, probably violating TokenFilter requirements, but the few tests (including the wtf/wow that's funny/what the fudge example from LUCENE-6582) seem to pass \n\nI think the hardest thing still needing fixing is properly dealing with holes which are quite difficult for graph processing because they essentially produce a fully disconnected graph... "
        },
        {
            "id": "comment-14611742",
            "author": "Michael McCandless",
            "date": "2015-07-02T10:06:44+0000",
            "content": "New patch, now working with holes e.g. from a StopFilter.  I also added a test case to simulate the \"StopFilter after SynFilter\" case.  I think it's close ... another couple nocommits though. "
        },
        {
            "id": "comment-14713357",
            "author": "Shalin Shekhar Mangar",
            "date": "2015-08-26T13:13:15+0000",
            "content": "Bulk move to 5.4 after 5.3 release. "
        },
        {
            "id": "comment-15819624",
            "author": "Michael McCandless",
            "date": "2017-01-12T00:12:08+0000",
            "content": "This was done with LUCENE-6664, as the new FlattenGraphFilter. "
        }
    ]
}