{
    "id": "LUCENE-771",
    "title": "Change default write lock file location to index directory (not java.io.tmpdir)",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/store"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.1"
        ],
        "affect_versions": "2.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Now that readers are read-only, we no longer need to store lock files\nin a different global lock directory than the index directory.  This\nhas been a source of confusion and caused problems to users in the\npast.\n\nFurthermore, once the write lock is stored in the index directory, it\nno longer needs the big digest prefix that was previously required\nto make sure lock files in the global lock directory, from different\nindexes, did not conflict.\n\nThis way, all files related to an index will appear in a single\ndirectory.  And you can easily list that directory to see if a\n\"write.lock\" is present to check whether a writer is open on the\nindex.\n\nNote that this change just affects how FSDirectory creates its default\nlockFactory if no lockFactory was specified.  It is still possible\n(just no longer the default) to pick a different directory to store\nyour lock files by pre-instantiating your own LockFactory.\n\nAs part of this I would like to remove LOCK_DIR and the no-argument\nconstructor, in SimpleFSLockFactory and NativeFSLockFactory.  I don't\nthink we should have the notion of a global default lock directory\nanymore.  This is actually an API change.  However, neither\nSimpleFSLockFactory nor NativeFSLockFactory haver been released yet,\nso I think this API removal is allowed?\n\nFinally I want to deprecate (but not yet remove, because this has been\nin the API for many releases) the static LOCK_DIR that's in\nFSDirectory.  But it's now entirely unused.\n\nSee here for discussion leading to this:\n\n  http://www.gossamer-threads.com/lists/lucene/java-dev/43940",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2007-01-12T20:48:59+0000",
            "content": "Sounds good, I agree with all the changes you outlined. ",
            "author": "Yonik Seeley",
            "id": "comment-12464350"
        },
        {
            "date": "2007-01-12T22:15:47+0000",
            "content": "Thanks for the review Yonik!\n\nAnd thanks for pointing this out Marvin!\n\nI've committed this. ",
            "author": "Michael McCandless",
            "id": "comment-12464371"
        },
        {
            "date": "2007-01-13T00:43:48+0000",
            "content": "I have a question on this change - though I didn't look at the code yet - we don't support backwards compatability with regard to existing lock files, right?  Specifically, if there exist an older version index with locks in tmp dir, and the Lucene lib is replaced for one client at a time, while other clients are running, there would be a problem, possible corruption. So who ever is migrating from an index before this change to an index with this change should make sure that all clients are upgraded at the time. At least all clients that may attempt to write. ",
            "author": "Doron Cohen",
            "id": "comment-12464385"
        },
        {
            "date": "2007-01-13T02:01:20+0000",
            "content": "Yes, that is true.\n\nBut there are also quite a few other changes in 2.1 (eg the file format changes) that would also generally necessitate that all places that will share the given index, upgrade to 2.1 at once. ",
            "author": "Michael McCandless",
            "id": "comment-12464393"
        },
        {
            "date": "2007-01-13T02:07:31+0000",
            "content": "Is that true? I thought that for previous format changes, the combination of - \n{ (1) point-in-time index reading by readers (2) backwards compatibility (3) locks }\n - allowed not to require this.  ",
            "author": "Doron Cohen",
            "id": "comment-12464395"
        },
        {
            "date": "2007-01-13T03:34:52+0000",
            "content": "You're right, backwards compatibility will allow a 2.1 client to\nread/write to an older index, but as soon as a 2.1 client writes to\nthe index then all pre-2.1 readers won't be able to read it.  You're\nright that if these readers are not reopened then \"point in time\"\nwould allow them to keep running pre-2.1.\n\nSo I think you could individually update each reader to 2.1, but then\n(after readers are updated), all writers would need to go to 2.1 at\nonce, to make sure they all \"agree\" that the write lock is now in the\nindex. ",
            "author": "Michael McCandless",
            "id": "comment-12464409"
        },
        {
            "date": "2007-01-13T14:29:50+0000",
            "content": "Woops, I committed a silly violation of the LockFactory abstraction\n(I'm removing files in FSDirectory when that should only occur inside\nthe LockFactory implementation.)  I'm re-opening and I'll get the\ncorrected fix in soon.\n ",
            "author": "Michael McCandless",
            "id": "comment-12464466"
        },
        {
            "date": "2007-02-27T18:10:39+0000",
            "content": "Closing all issues that were resolved for 2.1. ",
            "author": "Michael McCandless",
            "id": "comment-12476281"
        }
    ]
}