{
    "id": "LUCENE-526",
    "title": "FieldSortedHitQueue - subsequent String sorts with different locales sort identically",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.0.0"
        ],
        "affect_versions": "1.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "From my own post to the java-user list. I have looked into this further and am sure it's a bug.\n\n—\n\nIt seems to me that there's a possible bug in FieldSortedHitQueue, specifically in getCachedComparator(). This is showing up on our 1.4.3 install, but it seems from source code inspection that if it's a bug, it's in 1.9.1 also.\n\nThe issue shows up when you need to sort results from a given IndexReader multiple times, using different locales. On line 180 (all line numbers from the 1.9.1 code), we have this:\n\nScoreDocComparator comparator = lookup (reader, fieldname, type, factory);\n\nThen, if no comparator is found in the cache, a new one is created (line 193) and then stored in the cache (line 202). HOWEVER, both the cache lookup() and store() do NOT take into account locale; if we, on the same index reader, try to do one search sorted by Locale.FRENCH and one by Locale.ITALIAN, the first one will result in a cache miss, a new French comparator will be created, and stored in the cache. Second time through, lookup() finds the cached French comparator – even though this time, the locale parameter to getCachedComparator() is an Italian locale. Therefore, we don't create a new comparator and we use the wrong one to sort the results.\n\nIt looks to me (unless I'm mistaken) that the FieldCacheImpl.Entry class should have an additional property, .locale, to ensure that different locales get different comparators.\n\n—\n\nPatch (well, most of one) to follow immediately.",
    "attachments": {
        "LUCENE-526-d.txt": "https://issues.apache.org/jira/secure/attachment/12324432/LUCENE-526-d.txt",
        "LUCENE-526-c.txt": "https://issues.apache.org/jira/secure/attachment/12324430/LUCENE-526-c.txt",
        "LUCENE-526-b.txt": "https://issues.apache.org/jira/secure/attachment/12324357/LUCENE-526-b.txt",
        "LUCENE-526.txt": "https://issues.apache.org/jira/secure/attachment/12324355/LUCENE-526.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2006-03-20T14:31:02+0000",
            "content": "Attached is a patch that provides an additional test case to TestSort.java for this issue (currently fails on latest trunk code) and patches to FieldCacheImpl.java and FieldSortedHitQueue.java which allow the test case to pass.\n\nThis is not an idea solution as it lumbers FieldCacheImpl.Entry with a locale field which is only used by the cache in FieldSortedHitQueue, and not the main cache from FieldCacheImpl. This means that ONLY the FieldSortedHitQueue is locale-aware; the FieldCache itself isn't (there are no locales used in the interface). I thought I would provide this \"prototype\" patch, though, as an example. I am open to suggestions about how best to implement this. Options include\n\n\tsubclass FieldCacheImpl.Entry into a locale-aware version, which FieldSortedHitQueue uses\n\tchange the FieldCache interface to take in a locale for the various getXxxx methods (or possibly only the String ones?)\n\tsomething else I haven't thought of...?\n\n\n\nI look forward to your thoughts.  ",
            "author": "Paul Cowan",
            "id": "comment-12371039"
        },
        {
            "date": "2006-03-20T14:48:59+0000",
            "content": "New version of the patch with unicode escapes instead of hard-coded non-ASCII characters (which are bound to cause problems later) in the test case. ",
            "author": "Paul Cowan",
            "id": "comment-12371043"
        },
        {
            "date": "2006-03-22T07:19:28+0000",
            "content": "It seems that there are more issues with locale-based sorting than just the above.\n\nAttached is LUCENE-526-c.txt, a new version of the TestSort.java patch which adds another test case. Even after LUCENE-526-b is applied, and hence the first new test passes, the second fails.\n\nThe second test takes the existing IndexSearcher, wraps it up as the only Searcher in a MultiSearcher, and then searches the MultiSearcher. It seems that the results come out of the IndexSearcher in the right order, but when MultiSearcher merges the results from all of its Searchers (in this case, just one) the local-specific sorting isn't done correctly.\n\nI will investigate further today, with a patch hopefully to follow. ",
            "author": "Paul Cowan",
            "id": "comment-12371335"
        },
        {
            "date": "2006-03-22T07:32:36+0000",
            "content": "Thanks for looking into this Paul!\nA quick pointer... a Multisearcher uses different sorting code than an IndexSearcher.  IIRC, MultiSearcher uses FieldDocSortedHitQueue and an IndexSearcher uses FieldSortedHitQueue.\n\nIt wouldn't be the first time that a bug was fixed in one but forgotten about in the other. ",
            "author": "Yonik Seeley",
            "id": "comment-12371341"
        },
        {
            "date": "2006-03-22T08:59:32+0000",
            "content": "Another patch, to fix the last-described issue.\n\nTurns out the problem was the FieldSortedHitQueue constructor; when building the fields[] array, it was ignoring the locale if there was one. The comparators[] array is correct, so FieldSortedHitQueue sorts fine, but the topdocs that come out of the search have no locale in the fields[]; therefore, the in-order insertion in MultiSearcher screws up the order as it now no longer knows what locale to use.\n\nTest case from LUCENE-526-c.txt now passes. ",
            "author": "Paul Cowan",
            "id": "comment-12371367"
        },
        {
            "date": "2006-04-06T12:02:58+0000",
            "content": "I've reviewed and committed these patches.\nThanks again Paul! ",
            "author": "Yonik Seeley",
            "id": "comment-12373469"
        }
    ]
}