{
    "id": "LUCENE-1603",
    "title": "Changes for TrieRange in FilteredTermEnum and MultiTermQuery improvement",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "2.4,                                            2.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This is a patch, that is needed for the MultiTermQuery-rewrite of TrieRange (LUCENE-1602):\n\n\tMake the private members protected, to have access to them from the very special TrieRangeTermEnum\n\tFix a small inconsistency (docFreq() now only returns a value, if a valid term is existing)\n\tImprovement of MultiTermFilter.getDocIdSet to return DocIdSet.EMPTY_DOCIDSET, if the TermEnum is empty (less memory usage) and faster.\n\tAdd the getLastNumberOfTerms() to MultiTermQuery for statistics on different multi term queries and how may terms they affect, using this new functionality, the improvement of TrieRange can be shown (extract from test case there, 10000 docs index, long values):\n\n[junit] Average number of terms during random search on 'field8':\n[junit]  Trie query: 244.2\n[junit]  Classical query: 3136.94\n[junit] Average number of terms during random search on 'field4':\n[junit]  Trie query: 38.3\n[junit]  Classical query: 3018.68\n[junit] Average number of terms during random search on 'field2':\n[junit]  Trie query: 18.04\n[junit]  Classical query: 3539.42\n\n\n\n\n\nAll core tests pass.",
    "attachments": {
        "LUCENE-1603.patch": "https://issues.apache.org/jira/secure/attachment/12405432/LUCENE-1603.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-04-14T16:36:58+0000",
            "content": "The patch is here. Maybe the javadocs of getLastNumberOfTerms could be improved... ",
            "author": "Uwe Schindler",
            "id": "comment-12698825"
        },
        {
            "date": "2009-04-14T16:57:26+0000",
            "content": "Patch looks good.  Should we allow lastNumberOfTerms to be the sum of all invocations?  (Instead of clearing it per segment)?  And maybe add a resetLastNumberOfTerms, in case one wants to re-use a MultiTermQuery and recheck that count. ",
            "author": "Michael McCandless",
            "id": "comment-12698831"
        },
        {
            "date": "2009-04-14T17:37:03+0000",
            "content": "This is also another idea. The sum is interesting, too, but not so helpful, if the segments share the same terms. But for the number of seeks in TermDocs its interesting. Even if it sums up, the numbers in the Trie tests are the same, because index is optimized. So the note could be: For real numbers to analyze your query, use a optimized index, for real seek counts on a complex index/query structure, do not optimize.\n\nBy the way: Are queries also rewritten per segment with the new Searchers? If not, one could use the BooleanQuery variant, if he wants to have real term numbers on unoptimized index.\n\nI am +/- 0 about the change. In case of a change, the method should be called getCurrentNumberOfTerms() or something like that – naming is the hardest one. ",
            "author": "Uwe Schindler",
            "id": "comment-12698846"
        },
        {
            "date": "2009-04-14T17:48:38+0000",
            "content": "I was thinking that this count is a good way to measure how much net work was done, hence the switch to sum.  EG you could compare that count vs the count you get after having optimized the index to get a sense of how much you gained by optimizing.\n\nWhereas now, with the count only showing the # terms from the last segment searched, is not really useful at all.\n\nAre queries also rewritten per segment with the new Searchers? If not, one could use the BooleanQuery variant, if he wants to have real term numbers on unoptimized index.\n\nThey are rewritten at the MultiReader level, so you're right one could use that to get \"number of unique terms\" vs \"amount of work (seeks) done\".\n\nIf we do change it, ow about \"get/clearTotalNumberOfTerms()\"? ",
            "author": "Michael McCandless",
            "id": "comment-12698851"
        },
        {
            "date": "2009-04-14T17:49:51+0000",
            "content": "Maybe declare the term number as transient, it should not be serialized... ",
            "author": "Uwe Schindler",
            "id": "comment-12698852"
        },
        {
            "date": "2009-04-14T19:15:40+0000",
            "content": "Here the patch with the suggested changes.\nTrieRange test changes and so on come later. ",
            "author": "Uwe Schindler",
            "id": "comment-12698884"
        },
        {
            "date": "2009-04-14T19:27:33+0000",
            "content": "Looks good Uwe, thanks.  I plan to commit shortly.  I changed one sentence in the javadoc to:\n\n\n* If you re-use the same query instance for another\n* search, be sure to first reset the term counter\n* with {@link #clearTotalNumberOfTerms}.\n\n\n\n(It was missing the \"reuse\" part, making it sound like you always must call clear first). ",
            "author": "Michael McCandless",
            "id": "comment-12698887"
        },
        {
            "date": "2009-04-14T19:36:50+0000",
            "content": "Thanks Uwe! ",
            "author": "Michael McCandless",
            "id": "comment-12698891"
        },
        {
            "date": "2009-04-15T06:44:36+0000",
            "content": "Just for completeness: Should we add the number of terms methods also to the *Filter counterparts of the MultiTermQueries (as the new methods are only automatically appear in subclasses, but not in related pass-to-query-only classes)?\nIn trie-range I have these pass-to-query methods. ",
            "author": "Uwe Schindler",
            "id": "comment-12699087"
        },
        {
            "date": "2009-04-15T06:48:25+0000",
            "content": "An idea how to achive this, would be to make the *Filter counterparts subclasses of a new superclass MutiTermFilter, that just passes all methods to the corresponding query. This would make the filter classes simplier and one must only add the new methods to this superclass not to every filter class manually.\nShould I add a patch? ",
            "author": "Uwe Schindler",
            "id": "comment-12699088"
        },
        {
            "date": "2009-04-15T12:33:37+0000",
            "content": "An idea how to achive this, would be to make the *Filter counterparts subclasses of a new superclass MutiTermFilter, that just passes all methods to the corresponding query.\n\nThat'd be great – can you reopen this & attach patch? ",
            "author": "Michael McCandless",
            "id": "comment-12699169"
        },
        {
            "date": "2009-04-15T16:25:57+0000",
            "content": "To also expose getTotalTermCount to the Filter counterparts, I provide a new supercalss for those filters MultiTermQueryWrapperFilter (name to be discussed). ",
            "author": "Uwe Schindler",
            "id": "comment-12699260"
        },
        {
            "date": "2009-04-15T16:28:40+0000",
            "content": "Patch that provides that filter.\n\nMike: Can you please test drop-in-backwards-compatibility with this patch applied, with Windows, the checkout through Ant does not work correctly? I also set the native line ending svn property of the new file in the patch.\n\nThe update of the TrieRange follows after this is committed, code not affected, compiles still fine. ",
            "author": "Uwe Schindler",
            "id": "comment-12699261"
        },
        {
            "date": "2009-04-16T11:34:53+0000",
            "content": "Patch looks good – I'll commit shortly.  Thanks Uwe! ",
            "author": "Michael McCandless",
            "id": "comment-12699647"
        },
        {
            "date": "2009-04-16T11:43:59+0000",
            "content": "Do you think the name is good? MultiTermQueryWrapperFilter or simplier MultiTermFilter? Its not really one of both, its a mix between wrapper and the real filter: It wraps the query, but does the getDocIdSet and TermEnums himself. ",
            "author": "Uwe Schindler",
            "id": "comment-12699654"
        },
        {
            "date": "2009-04-16T11:52:17+0000",
            "content": "I think the name is good, so it's clear you have to provide a MultiTermQuery yourself (via subclass) to use it. ",
            "author": "Michael McCandless",
            "id": "comment-12699660"
        }
    ]
}