{
    "id": "LUCENE-3964",
    "title": "Stage Maven release artifacts",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "general/build"
        ],
        "type": "New Feature",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We need a way to stage Maven artifacts to the Apache release repository.",
    "attachments": {
        "LUCENE-3964.patch": "https://issues.apache.org/jira/secure/attachment/12521685/LUCENE-3964.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-04-06T15:04:32+0000",
            "content": "Confused about the component: build. \n\nI certainily hope the build need not be changed to do this (certainly not for 3.6)\n\nI think we should generate an RC like we do now, putting it on p.a.o, vote on it,\nand this is merely a deployment issue. \n\nIf there are any scripts involved in this, i think they should go in dev-tools instead,\n(like other release deployment scripts)? ",
            "author": "Robert Muir",
            "id": "comment-13248408"
        },
        {
            "date": "2012-04-06T15:55:51+0000",
            "content": "Trunk patch for a new target stage-maven-artifacts in lucene/common_build.xml, which:\n\n\n\tcalls a Perl script in dev-tools/scripts/ to recurse over the Maven dist directory (specified via property maven.dist.dir, which has default values under lucene/ and solr/) to find Maven artifacts, and then write an Ant build file (by default ./build/stage_maven_build.xml); and\n\tinvokes the stage-maven target in the Ant build file produced by the Perl script to stage each artifact, along with its POM, sources and javadoc jars, and signatures for each, to the staging repository specified in properties m2.repository.id and m2.repository.url.\n\n\n\nAlso included in the patch: a shell script to crawl Maven release distribution artifacts using wget: dev-tools/scripts/crawl.maven.release.dist.sh\n\nI have successfully run this target on the Lucene artifacts in Robert's RC0 release candidate, and then \"closed\" the resulting staging repository (\"closing\" disallows further uploads to the staging repository, and also does some quality checks, e.g. valid POMs, valid signatures) using this cmdline:\n\nant clean stage-maven-artifacts -Dmaven.dist.dir=~/temp/lucene -Dm2.repository.id=apache.releases.https -Dm2.repository.url=https://repository.apache.org/service/local/staging/deploy/maven2\n\n\nThe process took a little less than ten minutes.\n\nAlthough this patch is against trunk, it will work on any version's release, so I think it won't be necessary to commit it to branch_3x.\n\nLeft to do: test against the RC0 Solr artifacts. ",
            "author": "Steve Rowe",
            "id": "comment-13248427"
        },
        {
            "date": "2012-04-06T15:58:38+0000",
            "content": "But again: this is for deployment correct?\n\nI don't want to change our release process for 3.6 ",
            "author": "Robert Muir",
            "id": "comment-13248432"
        },
        {
            "date": "2012-04-06T15:59:52+0000",
            "content": "Confused about the component: build.\n\nFeel free to change it to a more appropriate component (not sure what that would be).\n\nI certainily hope the build need not be changed to do this (certainly not for 3.6)\n\nNo, it does not.  As I mentioned in my previous post on this issue, the patch is against trunk, and it works against your 3.6.0 RC0 (Lucene only at this point; Solr still needs to be tested.)\n\nI think we should generate an RC like we do now, putting it on p.a.o, vote on it, and this is merely a deployment issue.\n\n+1\n\nIf there are any scripts involved in this, i think they should go in dev-tools instead, (like other release deployment scripts)?\n\nYup, that's what I've done.\n\nThis is a work in progress - please review if you're interested! ",
            "author": "Steve Rowe",
            "id": "comment-13248434"
        },
        {
            "date": "2012-04-06T16:00:42+0000",
            "content": "But again: this is for deployment correct?\n\nYes.\n\nI don't want to change our release process for 3.6\n\n+1 ",
            "author": "Steve Rowe",
            "id": "comment-13248438"
        },
        {
            "date": "2012-04-06T16:03:43+0000",
            "content": "OK cool, my questions are mostly about process (not technicals).\n\nAs far as adding scripts to deploy to maven, I'm happy with whatever you figure out.\nI was planning on bailing on this part and leaving it to more capable hands anyway...  ",
            "author": "Robert Muir",
            "id": "comment-13248444"
        },
        {
            "date": "2012-04-06T16:27:40+0000",
            "content": "Patch fixing a bug in the naming of the Solr war's POM.\n\nAfter fixing the POM name problem, I successfully staged Solr 3.6.0 RC0 here: https://repository.apache.org/content/repositories/orgapachelucene-016/.\n\nI think it's ready to commit, but I'll wait until tomorrow to do so. ",
            "author": "Steve Rowe",
            "id": "comment-13248475"
        },
        {
            "date": "2012-04-08T04:15:41+0000",
            "content": "Committed to trunk. ",
            "author": "Steve Rowe",
            "id": "comment-13249469"
        }
    ]
}