{
    "id": "LUCENE-3331",
    "title": "consider allowing ScorerContext to specify that you dont need freqs/scores",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This is just an idea for discussion (I have not yet thought everything through: know of a non-scary way to do the patch yet).\n\nBut I think that it would be useful for ScorerContext to specify something like 'docsOnly', e.g. ConstantScoreQuery could pass this down here:\n\ndisi = innerWeight.scorer(context, scorerContext);\n\n\n\nBasically this flag would specify that the caller does not care about freq() and score(), and in this case e.g. TermScorer could use a \ndocs-only bulkpostings for example, and never pull freqs. \n\nAdditionally, it wouldn't need to create a Similarity.DocScorer, which is just wastefully computing score cache in this case, \nit could instead pass null, creat a scorer that does not use one, or use a Constant impl that always returns 1 or throws UOE, \ndepending on how we want to specify that score()/freq() should act if the caller does actually call it when this flag is set.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-07-22T13:40:52+0000",
            "content": "Sounds like a good idea! QueryWrapperFilter can do the same. ",
            "author": "Uwe Schindler",
            "id": "comment-13069545"
        },
        {
            "date": "2011-10-11T15:28:45+0000",
            "content": "Also i think its a good idea if we do this to cleanup some of the things are scorers do.\n\nCurrently we have some scorers that defer things until you call score(), in case you dont call it, but\nthis causes things like the scorer-navigation/freq api to behave strangely.\n\nSo doing this now would give us a way fix these bugs, e.g. if scores/freqs are not requested, and\nBQ has a mandatory clause it can just drop the optionals completely (return a simpler scorer) ",
            "author": "Robert Muir",
            "id": "comment-13125117"
        },
        {
            "date": "2011-10-11T16:43:44+0000",
            "content": "+1 ",
            "author": "Michael McCandless",
            "id": "comment-13125179"
        }
    ]
}