{
    "id": "LUCENE-2929",
    "title": "all postings enums must explicitly declare what they need up-front.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Currently, the DocsEnum api assumes you might consumes freqs at any time.\nAdditionally the DocsAndPositionsEnum api assumes you might consume a payload at any time.\n\nHigh level things such as queries know what kinds of data they need from the index up-front,\nand the current APIs are limiting to codecs (other than Standard, which has these intertwined).\n\nSo, we either need DocsAndFreqsEnum, DocsPositionsAndPayloadsEnum, or at least booleans\nin the methods that create these to specify whether you want freqs or payloads.\n\nwe did this for freqs in the bulkpostings API, which is good, but these DocsEnum apis\nare also new in 4.0 and there's no reason to introduce non-performant APIs.\n\nadditionally when/if we add payloads to the bulkpostings API, we should make sure we keep\nthe same trend and require you to specify you want payloads or not up-front.",
    "attachments": {
        "LUCENE-2929.patch": "https://issues.apache.org/jira/secure/attachment/12504230/LUCENE-2929.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-02-19T14:12:57+0000",
            "content": "And: if you ask for docs and freqs but the field omitTFAP, we should return\nan error in some fashion similar to what the bulk API does.\n\nI think we do this now if you ask for a DocsAndPositionsEnum when the field omitTFAP,\nbut we continue to lie and return TF=1 freqs in this case, which is not true,\nthere is simply no freq data at all. ",
            "author": "Robert Muir",
            "id": "comment-12996779"
        },
        {
            "date": "2011-11-18T17:12:43+0000",
            "content": "Patch, splitting out DocsAndFreqsEnum from DocsEnum, and fixing all\nplaces to pull the actual enum they need.\n\nI also added helper methods in _TestUtil to pull Docs/AndFreqsEnum,\nrandomly sometimes \"upgrading\" the enum pulled (eg, if you wanted\nDocsEnum you might get a DocsAndFreqsEnum instead).\n\nThe codec is allowed to return null from TermsEnum.docsAndFreqs, which\nmeans term freqs were not indexed for that field (ie IndexOptions.DOCS_ONLY).\n\nJust like the bulk branch, I broke out a MatchOnlyTermScorer, and also\nMatchOnlyConjunctionTermScorer.\n\nStill have to make \"and payloads\" strongly typed as well... ",
            "author": "Michael McCandless",
            "id": "comment-13152973"
        },
        {
            "date": "2011-12-03T18:20:45+0000",
            "content": "New patch; I think it's ready.\n\nInstead of making a new class for every combination of attrs, I think\nwe should have \"class per dimension\", ie DocsEnum is used if you only\niterate over docs, no matter which attrs you pull.  So now you pass in\nan up front boolean needsFreqs to TermsEnum.docs. ",
            "author": "Michael McCandless",
            "id": "comment-13162193"
        },
        {
            "date": "2011-12-03T19:27:33+0000",
            "content": "Another patch... last one had \"svn rm'd\" DocsEnum for some reason... ",
            "author": "Michael McCandless",
            "id": "comment-13162199"
        },
        {
            "date": "2011-12-04T13:11:05+0000",
            "content": "\nInstead of making a new class for every combination of attrs, I think\nwe should have \"class per dimension\"\n\n+1 ",
            "author": "Robert Muir",
            "id": "comment-13162394"
        },
        {
            "date": "2012-03-20T15:21:05+0000",
            "content": "Still need \"requiresPayloads\" boolean. ",
            "author": "Michael McCandless",
            "id": "comment-13233479"
        },
        {
            "date": "2013-07-23T18:44:23+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716934"
        },
        {
            "date": "2014-04-16T12:54:30+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970779"
        }
    ]
}