{
    "id": "LUCENE-4829",
    "title": "Tokenizer and char and token filter subclasses are not listed in Javadoc for the parent abstract classes",
    "details": {
        "components": [
            "general/javadocs"
        ],
        "fix_versions": [],
        "affect_versions": "4.0,                                            4.1,                                            4.2",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Not A Problem",
        "status": "Resolved"
    },
    "description": "Unlike in Lucene 3.6, the various subclasses of tokenizers, char filters, and token filters are not listed as subclasses on the Javadoc page for their abstract parent classes. Someone wanting to browse the full list of Lucene 4.x token filters cannot simply go to the javadoc for TokenFilter.\n\nMy understanding is that this is a side effect of the reorganization of \"modules\" in Lucene that occurred in 4.0. The various subclasses are reported as expected in Lucene 3.6.\n\nUnfortunately, it is not just \"optional\" filters that are considered optional, but even the most basic \"core\" filters such as the lower case filter whose package name is in fact \"org.apache.lucene.analysis.core\", whcih seems to bear an obvious relationship to the package of TokenFilter, org.apache.lucene.analysis.\n\nI consider this a regression from 3.6.\n\nRelevant Javadoc:\nhttp://lucene.apache.org/core/4_1_0/core/org/apache/lucene/analysis/TokenFilter.html\nhttp://lucene.apache.org/core/4_1_0/analyzers-common/org/apache/lucene/analysis/core/LowerCaseFilter.html\nhttp://lucene.apache.org/core/3_6_0/api/all/org/apache/lucene/analysis/TokenFilter.html\n\nThe good news is that the various subclasses of TokenFilterFactory are in fact reported on the Javadoc for TokenFilterFactory.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-03-12T23:18:08+0000",
            "content": "This bug is bogus and was discussed endless while adding modules to Lucene (>2 years ago!). This is not a bug with Javadocs, the problem here is that the lucene-core.jar file does not contain any concreate analyzer or tokenstream. It is perfectly possible to use lucene-core.jar without a concrete analyzer (you can e.g. pass null to IndexWriter and only create StringFields). Or you have you own language specific analysis.\n\nIndeed the pkgname \"core\" for LowercaseFilter is somehow stupid, but changing it to some other package name is now too late.\n\nBy the way: lucene-core.jar also contains no query parser anymore, which is great (because I never use them, i define my own query parsing in my apps, Lucene's is just too crazy in my opinion).\n\nThe good news is that the various subclasses of TokenFilterFactory are in fact reported on the Javadoc for TokenFilterFactory.\n\nThe factories are not core functionality (not needed for Lucene) and are just all in the analysis-common module. ",
            "author": "Uwe Schindler",
            "id": "comment-13600603"
        }
    ]
}