{
    "id": "LUCENE-5108",
    "title": "poll-mirrors.pl should let you check multiple paths on each mirror",
    "details": {
        "components": [],
        "fix_versions": [],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Improvement",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Idea spun off from LUCENE-5104 based on sarowe's experience dealing with mirrors that are only partially updated (this is all very doable, but requires some major rewriting of hte logic flow in the script, so i wanted to break it out into it's own issue)...\n\n\nThere's a separate (but maybe related to what you want to do here) issue with poll-mirrors.pl - when Shalin did the 4.3.1 release, he didn't upload all of the artifacts at once, and as a result, the script reported that \"the release\" was on all mirrors, even though some parts weren't there yet, rendering the information useless.\n\nMaybe the script could take one or more suffixes, so that it could find any number of things on each mirror, and report how many mirrors have all of them?\n\n...\n\n\ndoes it really matter \"what percentage have X and Y?\" or just \"what percentage have X? what percentage have Y?\"\n\nThe way I've used that script, the question has been: Can I announce that the release is available? This is answered when all parts of the release are downloadable from some threshold percentage of mirrors, thus \"what percentage have X AND Y\". As you say, though, this could be performed by running the script in multiple terminals with different paths. One goal of the script, though, was having just one place to go to get the answer to the question (thus lumping Maven in there too). Maybe the script could be (eventually - shouldn't block the nice changes you've made here) changed to allow multiple -path options, and print a number instead of a \".\" for presence or \"X\" for absence, representing how many of the files are downloadable at each mirror: \"0\", \"3\", etc.",
    "attachments": {},
    "issue_links": {},
    "comments": []
}