{
    "id": "LUCENE-192",
    "title": "[PATCH] Allowing '-'/'+' in terms",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/queryparser"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I suggest to change the definition of term character in QueryParser.jj\nfrom \n\n\n\n <#_TERM_CHAR: ( <_TERM_START_CHAR> \n <_ESCAPED_CHAR> ) >\nto\n\n\n <#_TERM_CHAR: ( <_TERM_START_CHAR> \n <_ESCAPED_CHAR> \n \"-\" \n \"+\" ) >\n\n\n\n\n\nAs a result query parser will read '-' and '+' within words (such as tft-monitor\nor Sysh1-1) as one term, which will be tokenized by the used analyzer\nand end up in a term query or phrase query depending if it create one ore\nmore tokens.\nSo with StandardAnalyzer a query tft-monitor would get a phrase query \"tft\nmonitor\" and Sysh1-1 a term query for \"Sysh1-1\". \nSearching tft-monitor as a phrase \"tft monitor\" is not exact but the best\naproximation possible once you indexed tft-monitor as tokens tft and monitor.\nCurrently query parser interpret every '-' or '+' as operators, which means\nthat 'tft-monitor' gets parsed as tft AND NOT monitor, which probably isn't what\n the user wanted.\nThe effect of '-'/'+' not occuring within a word is not changed, so\ntft -monitor will still search for 'tft AND NOT monitor'.\n\nAll regression tests pass with the change.\n\nI didn't add a patch-file, because I think it's easy to change queryParser.jj by\nhand.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2004-03-24T18:10:30+0000",
            "content": "Although tft-monitor should not really result in a phrase query \"tft monitor\", I\nagree that this is better than converting it to tft AND NOT monitor (tft -monitor).\nMoreover, I have seen query syntax where '-' characters are used for phrase\nqueries instead or in addition to quotes, so one could use either morus-walter\nor \"morus walter\".\n\nI applied your change, as it doesn't look like it breaks anything, and I hope\nnobody relied on ill behaviour where tft-monitor would result in AND NOT query. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321592"
        }
    ]
}