{
    "id": "LUCENE-5826",
    "title": "Support proper hunspell case handling and related options",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.10",
            "6.0"
        ]
    },
    "description": "When ignoreCase=false, we should accept title-cased/upper-cased forms just like hunspell -m. Furthermore there are some options around this:\n\n\tLANG: can turn on alternate casing for turkish/azeri\n\tKEEPCASE: can prevent acceptance of title/upper cased forms for words\n\n\n\nWhile we are here setting up the same logic anyway, add support for similar  options:\n\n\tNEEDAFFIX/PSEUDOROOT: form is invalid without being affixed\n\tONLYINCOMPOUND: form/affixes only make sense inside compounds.\n\n\n\nThis stuff is unrelated to the ignoreCase=true option. If you use that option though, it does use correct alternate casing for tr_TR/az_AZ now though.\n\nI didn't yet implement CHECKSHARPS because it seems more complicated, I have to figure out what the logic there should be first.",
    "attachments": {
        "LUCENE-5826.patch": "https://issues.apache.org/jira/secure/attachment/12655983/LUCENE-5826.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14063141",
            "author": "Robert Muir",
            "content": "Patch with tests for these options and casing behavior. ",
            "date": "2014-07-16T04:50:54+0000"
        },
        {
            "id": "comment-14063799",
            "author": "Ryan Ernst",
            "content": "Looks good.  A couple minor comments.\n\n\n\tCan the TODO around line 176 of Stemmer.java be removed?\n\tstem() is pretty long.  Can the block that computes compatible be moved out? It is almost exactly the same for the prefix and suffix loops?\n\n ",
            "date": "2014-07-16T17:57:24+0000"
        },
        {
            "id": "comment-14063821",
            "author": "Robert Muir",
            "content": "Thanks for looking.\n\nhmm, I removed the TODO locally, i dont know how it didnt make it into the patch.\n\nAs far as refactoring stem(), I am opposed to this, its too early for that. Once the core features (e.g. decompounding) are implemented, then I think it will be the right time. Until then it will just cause pain with zero gain: create useless abstractions, oversharing, and bugs. ",
            "date": "2014-07-16T18:04:58+0000"
        },
        {
            "id": "comment-14063855",
            "author": "Robert Muir",
            "content": "I created a followup issue to try to factor that big method after decomposition is implemented: LUCENE-5829 ",
            "date": "2014-07-16T18:25:19+0000"
        }
    ]
}