{
    "id": "LUCENE-4101",
    "title": "Remove XXXField.TYPE_STORED",
    "details": {
        "labels": "",
        "priority": "Blocker",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-ALPHA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Spinoff from LUCENE-3312.\n\nFor 4.0 I think we should simplify the sugar field APIs by requiring\nthat you add a StoredField if you want to store the field.  Expert users\ncan still make a custom FieldType that both stores and indexes...",
    "attachments": {
        "LUCENE-4101.patch": "https://issues.apache.org/jira/secure/attachment/12530655/LUCENE-4101.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-06-02T17:58:19+0000",
            "content": "Rote patch ... I'd like to commit soon since it'll quickly age... ",
            "author": "Michael McCandless",
            "id": "comment-13287985"
        },
        {
            "date": "2012-06-02T21:37:08+0000",
            "content": "having to now add 2 fields (stored and indexed separately) is a pretty big change.\n\nI'm not sure we should rush it in: personally i dont like the fact you have to\nadd the field twice.\n\nI think we should have a completed design hashed out for LUCENE-3312\nbefore we go committing intermediate changes to our stable branch. Why must this\nissue block 4.0? Can't we do it iteratively in trunk or a development branch, only \nbackporting when/if things are solidified and that makes sense? ",
            "author": "Robert Muir",
            "id": "comment-13288027"
        },
        {
            "date": "2012-06-03T07:52:43+0000",
            "content": "I'm not sure we should rush it in: personally i dont like the fact you have to\nadd the field twice.\n\nI have the same feeling though. Can't we branch and do development there and see how it goes API wise before we make those things blockers? Maybe two fields are overengineering? ",
            "author": "Simon Willnauer",
            "id": "comment-13288109"
        },
        {
            "date": "2012-06-03T07:56:24+0000",
            "content": "Hi,\nI am strong +1 for adding the field twice! But it's a little bit too late for Lucene 4.0.\n\nWe should do this together with the other changes of Nikola in a separate branch! ",
            "author": "Uwe Schindler",
            "id": "comment-13288112"
        },
        {
            "date": "2012-06-03T09:24:32+0000",
            "content": "Sorry, I don't intend to rush this.\n\nI set it to blocker because I think the 4.0 API for creating stored\nfields is confusing now (separate from the changes being explored in\nLUCENE-3312).\n\nThis (XXXField/FieldType) is one of the major changed APIs in 4.0 so\nit's worth spending effort reviewing/fixing it before we ship it.  The\nsame goes for all our other new AIPs in 4.0: we should scrutinize them.\n\npersonally i dont like the fact you have to add the field twice.\n\nExpert users don't have to (they can make a custom field type, at least\nuntil 5.0).  This API is just for basic usage, and I think it's\nimportant that API be really easy to use.\n\nToday in 4.0 you do this for an un-stored field:\n\nnew StringField(\"title\", \"...\");\n\n\n\nand this for a stored field:\n\n\nnew Field(\"title\", \"...\", StringField.TYPE_STORED);\n\n\n\nI think that's a confusing API.  EG, you don't know whether StringField,\nIntField, etc., are stored by default.  When you do want to store a\nfield you suddenly must use the expert API (Field directly) and specify\nthis custom FieldType.  So I think we should improve this... we already\nhave StoredField and I think a strong decoupling of \"it's stored\" from\n\"all the other neat ways the field can be indexed\" is clean.\n\nI guess another option would be to splinter out StoredXXXField?  Ie:\n\nnew StoredStringField(\"title\", \"...\");\n\n\n\nBut that's gonna double all the XXXFields we have. ",
            "author": "Michael McCandless",
            "id": "comment-13288123"
        },
        {
            "date": "2012-06-03T13:31:54+0000",
            "content": "\nI set it to blocker because I think the 4.0 API for creating stored\nfields is confusing now (separate from the changes being explored in\nLUCENE-3312).\nThis (XXXField/FieldType) is one of the major changed APIs in 4.0 so\nit's worth spending effort reviewing/fixing it before we ship it. The\nsame goes for all our other new AIPs in 4.0: we should scrutinize them.\n\nOK: I totally agree with scrutinizing the API. I also feel bad about\nmaking the comment here because I know its really a ton of work to make\npatches like this... and delays can cause lots of merging grief.\n\n\npersonally i dont like the fact you have to add the field twice.\nExpert users don't have to (they can make a custom field type, at least\nuntil 5.0). This API is just for basic usage, and I think it's\nimportant that API be really easy to use.\n\nI think this is where my concern lies? I think its the wrong way around:\nbasic users should be able to add the field once and just say its indexed & stored \n\nI agree that TYPE_STORED is confusing, and I also agree that StoredXXX is not great.\nI guess i just want to know that we've had a little time to think about the different\noptions here, maybe there is a better solution. ",
            "author": "Robert Muir",
            "id": "comment-13288157"
        },
        {
            "date": "2012-06-03T13:58:09+0000",
            "content": "Superficially, the new concept of a field  that is stored and indexed being two fields - both with the same name - sounds confusing, but it all depends on how this will be presented to users. What \"model\" of the relationship between \"index\", \"field\", and \"document\" are users expected to understand with respect to how fields are \"stored\" vs. \"indexed\"? Show me the model, and then I could judge whether it is truly confusing.\n\nUsers generally need to be concerned about storage capacity and performance, so a model that clarifies (and separates) the impact that a stored field has on index vs. query result performance would be helpful.\n\nFinally, maybe down the road it would be advantageous to have a stronger separation of indexed and stored fields, even to the point of using separate JVMs or even machines (e.g., one to identiy results and one or more separate JVMs/machines to retrieve stored fields for query response) so that index lookup throughput can be faster and index size can be larger without reducing the ability to have large numbers of large stored fields. I only mention this in the context of how it might make sense to migrate users away from the concept that the \"indexed\" and \"stored\" aspects (maybe that's a better word than just \"field\") are forever tightly rather than loosely linked. ",
            "author": "Jack Krupansky",
            "id": "comment-13288164"
        },
        {
            "date": "2012-06-04T16:27:57+0000",
            "content": "A third option is to add boolean isStored to each of XXXFields?  So, it's not stored by default, but then you can do:\n\nnew StringField(\"foo\", \"bar\", true);\n\n\n\nTo make a both indexed and stored StringField ...\n\nBut I don't really like that; I think it doesn't read as well as adding a separate StoredField also added to the doc.  And I'd rather keep the XXXField ctors simple... ",
            "author": "Michael McCandless",
            "id": "comment-13288654"
        },
        {
            "date": "2012-06-05T02:32:46+0000",
            "content": "A third option is to add boolean isStored to each of XXXFields? So, it's not stored by default, but then you can do:\n\nI think this would be a step backwards in some ways.  As you say, it doesn't read well and then it's also a question of why stop there? why not set other metadata via the constructor and we end up where we once were.\n\nAt the same time maybe it's a good intermediate step for 4.x while we tackle the large issue of stored field decoupling in 5.0.  Users will be able to fairly easily control whether the field is stored or not without having to use any of the expert APIs. ",
            "author": "Chris Male",
            "id": "comment-13289093"
        },
        {
            "date": "2012-06-06T16:00:11+0000",
            "content": "I can't see a situation where having to add the same field twice with different flags is good from a usability standpoint. ",
            "author": "Grant Ingersoll",
            "id": "comment-13290228"
        },
        {
            "date": "2012-06-06T16:39:34+0000",
            "content": "OK, I think the best compromise here is to add StoredXXXField... ",
            "author": "Michael McCandless",
            "id": "comment-13290253"
        },
        {
            "date": "2012-06-08T12:50:56+0000",
            "content": "New patch, adding StoredStringField and StoredTextField (instead of StringField.TYPE_STORED / TextField.TYPE_STORED).  I think it's ready. ",
            "author": "Michael McCandless",
            "id": "comment-13291749"
        },
        {
            "date": "2012-06-08T14:28:29+0000",
            "content": "Thinking about this issue a bit, I think its bad if you have to use Field/FieldType api just to store a field.\nSo I agree this should be fixed.\n\nSeparately we should also make it easy to have a stored-only (not indexed) field. \n\nI felt like both of these things were easy with the old document API.\n\n\nA third option is to add boolean isStored to each of XXXFields? So, it's not stored by default, but then you can do:\n\nI don't like that we are making our apis hard to use just because java doesn't have named parameter passing or something.\nI think the old API was great here: it had an enum for Stored so it was totally obvious from your code if it was stored or not,\nor indexed or not.\n\nI think if we dont like booleans for this silly reason, then we should just use an enum like the old API!\n\nExtra Stored* classes for each field are just overwhelming.\n\n\nI can't see a situation where having to add the same field twice with different flags is good from a usability standpoint.\n\nWe can never force that. People who are experts or committers are free to add the field twice if \nthey want to (nothing stops them), but I don't want to see this forced in our APIs, its too difficult. ",
            "author": "Robert Muir",
            "id": "comment-13291797"
        },
        {
            "date": "2012-06-08T21:49:10+0000",
            "content": "do we really need to block 4.0 for this issue? ",
            "author": "Simon Willnauer",
            "id": "comment-13292022"
        },
        {
            "date": "2012-06-09T10:25:21+0000",
            "content": "I think if we dont like booleans for this silly reason, then we should just use an enum like the old API!\n\nOK, I'm attaching a new patch, using a Store.YES/NO enum, passed to TextField and StringField.  I also renamed TYPE_UNSTORED -> TYPE to make it clear that's the default type.\n\nIf nobody disagrees w/ this approach ... I'll add the Store enum to the numeric fields as well, then fix all tests to use it instead of XXXField.TYPE_STORED. ",
            "author": "Michael McCandless",
            "id": "comment-13292285"
        },
        {
            "date": "2012-06-09T10:26:24+0000",
            "content": "do we really need to block 4.0 for this issue?\n\nYes, I think so, for the reasons I explained above... This need not block\n4.0-ALPHA, just GA (we are still free to change APIs up until 4.0 GA). ",
            "author": "Michael McCandless",
            "id": "comment-13292286"
        },
        {
            "date": "2012-06-09T10:51:58+0000",
            "content": "\nYes, I think so, for the reasons I explained above... This need not block\n4.0-ALPHA, just GA (we are still free to change APIs up until 4.0 GA).\n\nWell according to the original discussion, the BETA would guarantee API stability\nfor public apis (unless we need to fix bugs).\n\nhttp://www.lucidimagination.com/search/document/6fc4a3f1994358ef#50ed6c2a517edaca\n\nSo my vague plan was we could just setup backwards/ tests after BETA as\nusual.\n\nWe can discuss that when the time comes though, we don't need to worry about it here\nor now.  ",
            "author": "Robert Muir",
            "id": "comment-13292294"
        },
        {
            "date": "2012-06-09T11:12:02+0000",
            "content": "\nOK, I'm attaching a new patch, using a Store.YES/NO enum, passed to TextField and StringField. I also renamed TYPE_UNSTORED -> TYPE to make it clear that's the default type.\n\nI'm a little confused about the changes here (it maybe something obviously I'm missing).  \n\nSo with this patch, StringField and TextField now have a TYPE which is just indexed not stored, and a TYPE_STORED which is just stored not indexed.  So to store and index a TextField for example, I have to create two? ",
            "author": "Chris Male",
            "id": "comment-13292297"
        },
        {
            "date": "2012-06-09T11:16:03+0000",
            "content": "So with this patch, StringField and TextField now have a TYPE which is just indexed not stored, and a TYPE_STORED which is just stored not indexed.\n\nNo actually TYPE_STORED is just like TYPE but it also has setStored(true).  I simplified the code so that TYPE_STORED first starts with TYPE and then only changes stored bit (vs the code dup we had before). ",
            "author": "Michael McCandless",
            "id": "comment-13292300"
        },
        {
            "date": "2012-06-09T11:17:19+0000",
            "content": "I think the key is:\n\n\npublic StringField(String name, String value, Store stored) {\n\n\n\netc.\n\nActually i think whats confusing about the patch is the way we do newField() in tests.\n\nI would prefer that we make newStringField and friends for LuceneTestCase so that our tests look like our real APIs:\nthis way we eat our own dog food and know if the APIs are annoying.\n\nHappy to help with that if we get consensus here. ",
            "author": "Robert Muir",
            "id": "comment-13292302"
        },
        {
            "date": "2012-06-09T11:23:55+0000",
            "content": "\nNo actually TYPE_STORED is just like TYPE but it also has setStored(true). I simplified the code so that TYPE_STORED first starts with TYPE and then only changes stored bit (vs the code dup we had before).\n\nGotcha.  I didn't really mind the code dup since it spelled out clearly what the type definitions were to prevent misreading like I just did, but no biggie.\n\n\nI would prefer that we make newStringField and friends for LuceneTestCase so that our tests look like our real APIs:\nthis way we eat our own dog food and know if the APIs are annoying.\n\n+1 I think this would be a great improvement. ",
            "author": "Chris Male",
            "id": "comment-13292303"
        },
        {
            "date": "2012-06-09T11:35:46+0000",
            "content": "\nGotcha. I didn't really mind the code dup since it spelled out clearly what the type definitions were to prevent misreading like I just did, but no biggie.\n\nI think I might tend to agree with Chris here: on one hand I like the purity of just having a .TYPE, on the other hand i think clarity might be worth it,\nafter all its a tad confusing since e.g. StringField has a parameter asking for Stored/Unstored, so which one is its .TYPE? (of course the javadocs\ndocument this, but still). \n\nBut seeing as this is the \"expert\" api I don't feel very strongly about this.\n\nMore important is that the easy API is fixed here in a way that doesn't require adding the field twice: I like that. ",
            "author": "Robert Muir",
            "id": "comment-13292305"
        },
        {
            "date": "2012-06-09T11:36:27+0000",
            "content": "Quickly throwing out an idea, what about instead of using an enum we use some factory methods? TextField.newIndexedField(..) and TextField.newStoredField(..) ",
            "author": "Chris Male",
            "id": "comment-13292307"
        },
        {
            "date": "2012-06-09T11:38:39+0000",
            "content": "Personally I would prefer we avoid the factory methods, I think these make code hard to read. \nNothing beats a good old constructor for creating java objects.\n\nAs for just a boolean or enum, i could go either way. ",
            "author": "Robert Muir",
            "id": "comment-13292308"
        },
        {
            "date": "2012-06-09T11:48:22+0000",
            "content": "Okay that's cool.  I'm comfortable using them and I think they make code actually easier to read in these circumstances, but I'm more than happy with going for the approach which has consensus. ",
            "author": "Chris Male",
            "id": "comment-13292313"
        },
        {
            "date": "2012-06-09T11:58:33+0000",
            "content": "Well I think for people like you, if you enjoy that type of API you should be able to do it.\nBut such a factory API ultimately requires a real CTOR anyway \nSo it can just be seen as sugar-on-top.\n\nAs far as doc/field I think we should just provide the most minimal/simplest api that meets two use cases:\n\n\tnon-expert users just trying to use our simple apis to get stuff indexed.\n\texpert users trying to build things on top.\n\n\n\nI think its this mix of use cases that makes this API such a bikeshed.\n\nBut i totally think something like this patch is the right way to go so that non-expert users can\nstore things! \n\nPerhaps the issue title should be renamed, i could care less if XXXField.TYPE_STORED \nis there or not, thats the expert API? I think it should take a backseat to the non-expert API. ",
            "author": "Robert Muir",
            "id": "comment-13292315"
        },
        {
            "date": "2012-06-09T12:19:08+0000",
            "content": "You're absolutely right in which case this is going in the right direction. ",
            "author": "Chris Male",
            "id": "comment-13292317"
        },
        {
            "date": "2012-06-09T12:42:07+0000",
            "content": "\nWell according to the original discussion, the BETA would guarantee API stability\nfor public apis (unless we need to fix bugs).\n\nAhh woops you're right ... so I think this issue blocks 4.0-BETA.  But it looks like we have tentative consensus here so I'll finish the current approach ...\n\nI didn't really mind the code dup since it spelled out clearly what the type definitions were to prevent misreading like I just did, but no biggie.\n\nOK I'll put it back.  It's a tiny code dup and mis-reading risk is bad... ",
            "author": "Michael McCandless",
            "id": "comment-13292324"
        },
        {
            "date": "2012-06-09T12:43:47+0000",
            "content": "I would prefer that we make newStringField and friends for LuceneTestCase so that our tests look like our real APIs\n\n+1, I'll take that approach... ",
            "author": "Michael McCandless",
            "id": "comment-13292326"
        },
        {
            "date": "2012-06-09T15:50:18+0000",
            "content": "New patch, with tests cutover to LTC. newString/TextField; I haven't added newXXXField for numeric fields (maybe we can do this separately).  I put the code dup back, and added TYPE_STORED/Store for the numeric fields. ",
            "author": "Michael McCandless",
            "id": "comment-13292372"
        },
        {
            "date": "2012-06-09T16:08:15+0000",
            "content": "hmm, i think when i referred to 'code dup' it was to having TYPE_UNSTORED/TYPE_STORED... not how these are actually calculated in static blocks.\n\nI think we should not have TYPE but keep it as TYPE_UNSTORED? Its confusing. There really isnt a default, just one ctor that has a default, and actually, I think we should nuke that?\n\nOlder lucene versions have to specify the Store and users are used to this already... I think the default ctor is confusing!!!! ",
            "author": "Robert Muir",
            "id": "comment-13292373"
        },
        {
            "date": "2012-06-09T16:14:08+0000",
            "content": "also i dont think we should add the new class to o.a.l.document\n\nI think instead we should just undeprecated Field.Store (which people have used forever).\nwe can deprecate its isStored method instead: i dont know what this does but its unnecessary.\n\nI think using Field.Store will be a lot more intuitive for existing lucene users. ",
            "author": "Robert Muir",
            "id": "comment-13292376"
        },
        {
            "date": "2012-06-09T17:13:29+0000",
            "content": "I like all those ideas!  New patch:\n\n\n\tKeeps XXXField.TYPE_UNSTORED naming\n\n\n\n\n\tUse pre-existing Field.Store enum (great to have that API continuity)\n\n\n\n\n\tNukes default XXXField ctor (you now must provide Field.Store.YES/NO)\n\n\n\n\n\tAdds LTC.newString/TextField (the numeric fields are still a future TODO).\n\n ",
            "author": "Michael McCandless",
            "id": "comment-13292385"
        },
        {
            "date": "2012-06-10T03:28:41+0000",
            "content": "Keeps XXXField.TYPE_UNSTORED naming\n\nMaybe TYPE_NOTSTORED? To me it sounds a little better. ",
            "author": "Chris Male",
            "id": "comment-13292468"
        },
        {
            "date": "2012-06-10T12:53:43+0000",
            "content": "How about TYPE_NOT_STORED? ",
            "author": "Michael McCandless",
            "id": "comment-13292512"
        },
        {
            "date": "2012-06-10T13:18:02+0000",
            "content": "I like that more.  Another alternative instead of using negations, TYPE_INDEXED? ",
            "author": "Chris Male",
            "id": "comment-13292516"
        },
        {
            "date": "2012-06-10T13:33:13+0000",
            "content": "Well ... both types are indexed; the only difference is one is stored and one isn't.  I think negation is OK since it's right there next to the positive form too.\n\nWe could, alternatively, not make these TYPE_XXX's public (then their names matter much less!) ... but I think it's useful having them public so an app can start from a known type and then change it. ",
            "author": "Michael McCandless",
            "id": "comment-13292519"
        },
        {
            "date": "2012-06-10T13:39:10+0000",
            "content": "We could, alternatively, not make these TYPE_XXX's public (then their names matter much less!) ... but I think it's useful having them public so an app can start from a known type and then change it.\n\nYeah for many of the reasons Robert mentions in LUCENE-4126, we need to let users work from a pre-existing type and make the changes they want.  \n\nOkay I can live with TYPE_NOT_STORED. ",
            "author": "Chris Male",
            "id": "comment-13292520"
        },
        {
            "date": "2012-06-10T13:45:46+0000",
            "content": "I like TYPE_UNSTORED better than TYPE_NOT_STORED (less syllables).\n\nI am +1 to the current patch. ",
            "author": "Robert Muir",
            "id": "comment-13292521"
        },
        {
            "date": "2012-06-10T13:49:54+0000",
            "content": "The Type doesn't unstore anything though.  That implies something is stored and is going to be unstored. ",
            "author": "Chris Male",
            "id": "comment-13292522"
        },
        {
            "date": "2012-06-10T13:51:29+0000",
            "content": "I like TYPE_UNSTORED better than TYPE_NOT_STORED (less syllables).\n\nFewer words, you mean? ",
            "author": "Steve Rowe",
            "id": "comment-13292523"
        },
        {
            "date": "2012-06-10T14:03:22+0000",
            "content": "yeah less words \n\nbut this matters much less to me if this issue is part of the alpha release.\nthe current patch is backwards compatible, it just adds ctors.\n\ni know we only commit to the index format for alpha, but we shouldnt just break\nthings like .document package for naming reasons alone once we released it: i think\nthat would be really confusing. the .document package is used by EVERYONE.\n\nso in my opinion (which i dont expect to be the consensus opinion, its just how I feel),\nif we want NOT_STORED or whatever, we should rename it before alpha release. ",
            "author": "Robert Muir",
            "id": "comment-13292526"
        }
    ]
}