{
    "id": "LUCENE-4980",
    "title": "Can't use DrillSideways with both RangeFacetRequest and non-RangeFacetRequest",
    "details": {
        "components": [
            "modules/facet"
        ],
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I tried to combine these two and there were several issues:\n\n\n\tIt's ... really tricky to manage the two different\n    FacetAccumulators across that N FacetCollectors that DrillSideways\n    creates ... to fix this I added a new MultiFacetsAccumulator that\n    switches for you.\n\n\n\n\n\tThere was still one place in DS/DDQ that wasn't properly handling\n    a non-Term drill-down.\n\n\n\n\n\tThere was a bug in the \"collector method\" for DrillSideways\n    whereby if a given segment had no hits, it was skipped, which is\n    incorrect because it must still be visited to tally up the\n    sideways counts.\n\n\n\n\n\tSeparately I noticed that DrillSideways was doing too much work:\n    it would count up drill-down counts and drill-sideways counts\n    against the same dim (but then discard the drill-down counts in\n    the end).",
    "attachments": {
        "LUCENE-4980.patch": "https://issues.apache.org/jira/secure/attachment/12581836/LUCENE-4980.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-05-05T22:11:49+0000",
            "content": "Patch w/ test case + fixes. ",
            "author": "Michael McCandless",
            "id": "comment-13649450"
        },
        {
            "date": "2013-05-06T10:20:23+0000",
            "content": "I was confused by the name MultiFacetsAccumulator as I thought it takes something like a Map<FacetRequest,FacetsAccumulator>, but I see that it only distinguishes RangeAccumulator from others. So I'm worried about someone gets confused about the name and use it incorrectly. I don't have a better name in mind though ... RangeAndRegularFacetsAccumulator?\n\nWhat if RangeAccumulator did that under the covers? I.e. instead of rejecting non-RangeFacetRequest, it created FA over all such requests? Multi is quite simple though, so I like it .. maybe FacetAccumulatorRangeWrapper? I think as long as we keep the word Range in the name, it's less likely users will get confused.\n\nMinor comments about the class: (a) can you rename 'a' and 'ra'? (b) why do you need to hold onto fspOrig? Is it because FA.searchParams isn't final? ",
            "author": "Shai Erera",
            "id": "comment-13649638"
        },
        {
            "date": "2013-05-06T11:22:21+0000",
            "content": "What if RangeAccumulator did that under the covers?\n\nWell ... I have a TODO to also support SortedSetDocValuesAccumulator.  So I'm not quite sure what to name it / where to put it.\n\nAnother option here is to commit this class only under src/test ... it's technically only needed right now by the test case to expose the bugs ... but then I'm using the class in the Jira search app, because I need to use DrillSideways with range and non-range facets, and without it things get very messy.  So we need to fix something here, but we can do it in a separate issue after fixing these bugs.\n\nMinor comments about the class: (a) can you rename 'a' and 'ra'? \n\nWill do ...\n\n(b) why do you need to hold onto fspOrig? Is it because FA.searchParams isn't final?\n\nI need fspOrig in accumulator() to un-collate the wrapped List<FacetResult> back in the same order as the original requests ... ",
            "author": "Michael McCandless",
            "id": "comment-13649661"
        },
        {
            "date": "2013-05-07T15:33:24+0000",
            "content": "New patch, folding in Shai's feedback.\n\nI just renamed MFA -> RangeFacetsAccumulatorWrapper for now ... in a followon issue we can generalize this better (eg to include SortedSetDV facets too). ",
            "author": "Michael McCandless",
            "id": "comment-13650968"
        },
        {
            "date": "2013-05-07T17:04:43+0000",
            "content": "Thanks Mike. I think the TODO is a bit trickier than what it writes ... you cannot decide to create SortedSetDVAccumulator based on a FacetRequest. App needs to create it only if it indexed facets with SSDVFacetFields, right? This might be possible if we had an index schema, of somehow expressed that information in FacetIndexingParams.\n\nSo it's up to you to remove the TODO, but I don't think you can actually handle it, currently, without app specifically telling you that it's ok. ",
            "author": "Shai Erera",
            "id": "comment-13651063"
        },
        {
            "date": "2013-05-07T18:54:28+0000",
            "content": "I think the TODO is a bit trickier than what it writes ... you cannot decide to create SortedSetDVAccumulator based on a FacetRequest.\n\nHmm true.  Maybe we need a separate SSDVFacetRequest?  Not sure ...\n\nI don't think I'll remove the TODO: I think it's still important that (somehow) we are able to send an FSP requiring different FacetsAccumulators and something figures out which ones to instantiate, and then collates the FacetResults back in order, somehow ... I will fixup the TODO to reflect its difficulty though  ",
            "author": "Michael McCandless",
            "id": "comment-13651179"
        },
        {
            "date": "2013-07-23T18:37:07+0000",
            "content": "Bulk close resolved 4.4 issues ",
            "author": "Steve Rowe",
            "id": "comment-13716755"
        }
    ]
}