{
    "id": "LUCENE-3197",
    "title": "Optimize runs forever if you keep deleting docs at the same time",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "3.3",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Because we \"cascade\" merges for an optimize... if you also delete documents while the merges are running, then the merge policy will see the resulting single segment as still not optimized (since it has pending deletes) and do a single-segment merge, and will repeat indefinitely (as long as your app keeps deleting docs).",
    "attachments": {
        "LUCENE-3197.patch": "https://issues.apache.org/jira/secure/attachment/12482705/LUCENE-3197.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-06-14T10:33:25+0000",
            "content": "One simple way to fix this would be to have IW disregard the MergePolicy if ever it asks to do a single-segment merge of a segment that had already been produced by merging for the current optimize call.\n\nBut... I don't really like this, as it could be some unusual MergePolicy out there sometimes wants to do such merging.\n\nSo I think a better solution, but API breaking to the MergePolicy, which is OK because it's @experimental, is to change the segmentsToOptimize argument; currently it's just a set recording which segments need to be optimized away.  I think we should change it to a Map<String,Boolean>, where the Boolean indicates whether this segment had been created by a merge in the current optimize session.  Then I'll fix our MPs to not cascade in such a case. ",
            "author": "Michael McCandless",
            "id": "comment-13049109"
        },
        {
            "date": "2011-06-14T16:21:44+0000",
            "content": "is the possibility of a never ending optimize in this situation (never ending deletes) really something we need to \"fix\" ?\n\ni mean ... isn't this what hte user should expect?  they've asked for a single segment w/o deletes, and then while we try to give it to them they keep deleting – how is it bad that we optimize doesn't stop until it's completely done ? ",
            "author": "Hoss Man",
            "id": "comment-13049254"
        },
        {
            "date": "2011-06-14T17:30:42+0000",
            "content": "Regardless of if one views this as a bug or not, I think the more useful semantics are to at least \"merge all of the current segments into 1 and remove all currently deleted docs\" (i.e. I agree with Mike).  The alternative is that optimize is dangerous in the presence of index updates (i.e. applications should discontinue updates if they call optimize). ",
            "author": "Yonik Seeley",
            "id": "comment-13049298"
        },
        {
            "date": "2011-06-15T14:21:29+0000",
            "content": "Right, this has been the intended semantics of a background optimize for some time, ie, when it returns it only ensures that whatever was not optimized as of when it was called has been merged away.\n\nThis already works correctly for newly added docs, meaning if you continue adding docs / flushing new segments while the optimize runs, it knows that the newly flushed segments do not have to be merged away.\n\nBut for new deletions we are not handling it correctly, which leads to the forever running merges. ",
            "author": "Michael McCandless",
            "id": "comment-13049786"
        },
        {
            "date": "2011-06-15T20:06:16+0000",
            "content": "Patch. ",
            "author": "Michael McCandless",
            "id": "comment-13049986"
        },
        {
            "date": "2011-07-02T02:40:14+0000",
            "content": "bulk close for 3.3 ",
            "author": "Robert Muir",
            "id": "comment-13058923"
        }
    ]
}