{
    "id": "LUCENE-4650",
    "title": "Test framework should be more robust under OOM conditions",
    "details": {
        "components": [
            "general/test"
        ],
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "When tests OOM (or run out of their permgen space) things to wild (hung runner, etc.).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2013-01-02T08:13:01+0000",
            "content": "randomizedtesting 2.0.8 has some tweaks to make it work. I tend to believe a \"real\" solution doesn't exist, this is the best I could come up with – there is a preallocated last-resort memory pool of 1MB that gets released when OOM is thrown. A small delay is introduced to allow concurrent GC threads to do their job, then the process attempts to serialize the exception and write back some messages about the OOM.\n\nIt still doesn't always work: I had some random OOMs even in System.out.printlns on J9, whether the GC does or doesn't reclaim the released memory is unknown and is an inherent race condition, the VM itself (hotspot) seems to require some memory when it does Runtime.halt; under low-memory conditions it always returns with exit code 1, regardless of the status passed to halt.\n\nPermGen space errors are even more difficult. I tried preloading classes at startup but this turns out to be such an unholy mess (and still without the guarantee that something is not omitted) that I reverted this change. To my defense – I tried with Maven's surefire and it also craps out (hangs) under such conditions. ",
            "author": "Dawid Weiss",
            "id": "comment-13542049"
        },
        {
            "date": "2013-01-02T08:18:33+0000",
            "content": "[trunk commit] Dawid Weiss\nhttp://svn.apache.org/viewvc?view=revision&revision=1427696\n\nLUCENE-4650: Upgrade randomized testing to version 2.0.8: make the test framework more robust under low memory conditions. ",
            "author": "Commit Tag Bot",
            "id": "comment-13542052"
        },
        {
            "date": "2013-01-02T08:25:00+0000",
            "content": "[branch_4x commit] Dawid Weiss\nhttp://svn.apache.org/viewvc?view=revision&revision=1427697\n\nLUCENE-4650: Upgrade randomized testing to version 2.0.8: make the test framework more robust under low memory conditions. ",
            "author": "Commit Tag Bot",
            "id": "comment-13542055"
        }
    ]
}