{
    "id": "LUCENE-3791",
    "title": "ant eclipse should setup default project formatting.",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "general/build"
        ],
        "type": "Improvement",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I admit it's selfish. I have a git workflow and I often do \"git clean -xfd\" which restores a pristine state of the current branch (faster than ant clean . Unfortunately this also results in removal of Eclipse files. \"ant eclipse\" doesn't reset formatting properly so I need to restore it manually.\n\nThis patch does two things:\n\n\tit sets project formatting automatically on \"ant eclipse\",\n\tit removes explicit Lucene-formatting.xml to avoid duplication (and potential inconsistencies) between project-specific formatter rules contained in org.eclipse.jdt.core.prefs and the formatter's XML. The XML can be exported manually if needed.",
    "attachments": {
        "LUCENE-3791.patch": "https://issues.apache.org/jira/secure/attachment/12514695/LUCENE-3791.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-02-15T19:30:20+0000",
            "content": "I don't think its selfish, +1 for configuring the project formatting in 'ant eclipse'\n\nthe reason it doesnt do this now: i thought that formatters were 'global' in eclipse, and didnt know we could register one and then set it to the project automatically...  ",
            "author": "Robert Muir",
            "id": "comment-13208708"
        },
        {
            "date": "2012-02-15T19:34:36+0000",
            "content": "Hey cool, how does that work? I only know the same like Robert said: the format template has to be imported globally and can assigned per project. ",
            "author": "Uwe Schindler",
            "id": "comment-13208711"
        },
        {
            "date": "2012-02-15T19:53:15+0000",
            "content": "I really can't explain how it works other than I know it does on my eclipse. I forgot to attach a patch – please check if this works for you (various Eclipse flavors and systems) and if we're sure it works everywhere I'll commit in. Patch follows. ",
            "author": "Dawid Weiss",
            "id": "comment-13208733"
        },
        {
            "date": "2012-02-15T19:54:25+0000",
            "content": "git patch, but should work with patch -p0 <... ",
            "author": "Dawid Weiss",
            "id": "comment-13208737"
        },
        {
            "date": "2012-02-15T20:06:49+0000",
            "content": "This patch actually works, at first it seems like its not working, \nbecause if you click on project and look at the formatting, it looks \nlike it isn't working (shows a project-specific 'default eclipse' \nconfiguration with tabs, etc).\n\nBut what that configuration screen shows is just a lie, this \npatch is somehow tricking eclipse and it actually does work \nwhen you go to write/format code. ",
            "author": "Robert Muir",
            "id": "comment-13208747"
        },
        {
            "date": "2012-02-15T20:15:52+0000",
            "content": "Yes, you won't have a \"named\" formatter – this is something I couldn't achieve. It's more like project-specific settings based on the default formatter. But they are versioned and everything seems to work fine. ",
            "author": "Dawid Weiss",
            "id": "comment-13208755"
        },
        {
            "date": "2012-02-15T20:26:58+0000",
            "content": "But it does work, +1 ",
            "author": "Robert Muir",
            "id": "comment-13208767"
        }
    ]
}