{
    "id": "LUCENE-4248",
    "title": "Producers to the Codec API don't always follow the spec",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We added AssertingCodec etc and have lots of tests that consumers of the codec api follow a strict set of rules: but nothing checks the producers feeding these apis (IndexWriter, codec merge implementations, etc).\n\nWe should beef up AssertingCodec to validate these things: this way the API is being followed.\n\nSimple examples of things include checking that producers are feeding terms to the consumers consistent with their comparator, that they aren't providing bogus or out of band statistics, and that they are invoking the right methods consistently (e.g. not forgetting to call finishDoc or something that might confuse someones codec).\n\nThis is also nice since now we have quite a few tests (TestCodecs, TestPostingsFormat, etc) that feed these APIs directly, it could find some test bugs.",
    "attachments": {
        "LUCENE-4248.patch": "https://issues.apache.org/jira/secure/attachment/12537588/LUCENE-4248.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-23T18:26:16+0000",
            "content": "the start to a patch: some tests still fail.\n\nI figure we can get everything cleaned up for postings and then if we feel like it later, add stuff for the other parts of the codec API. ",
            "author": "Robert Muir",
            "id": "comment-13420845"
        },
        {
            "date": "2012-07-23T18:58:36+0000",
            "content": "Updated patch: fixing some more bugs in these producers.\n\nI added a simple state machine as well, but because of the \"startTerm without corresponding finishTerm is allowed if all docs are deleted for that term\", the check is not that great right now.\n\nOnce we add an AssertingPostingsConsumer of some sort we can actually validate no docs were added in that case and i think it will be fine... \n\nBut I'd like to commit this for now as a start. ",
            "author": "Robert Muir",
            "id": "comment-13420873"
        },
        {
            "date": "2012-07-23T19:16:21+0000",
            "content": "one more check, and also fix a bad assert in BlockTree writer ",
            "author": "Robert Muir",
            "id": "comment-13420886"
        },
        {
            "date": "2012-07-23T20:34:57+0000",
            "content": "Here's a patch for the rest of the postings API.\n\nFreqProxTermsWriter was inconsistent here (depending upon when the omitTF bit got set in the indexing process).\n\nI added javadocs for these apis to clarify these things (freq, offsets, etc) are all -1 when they are not being indexed.\n\nTestCodecs didnt call finishDoc()... other than that things look good. ",
            "author": "Robert Muir",
            "id": "comment-13420942"
        }
    ]
}