{
    "id": "LUCENE-4526",
    "title": "Allow runtime settings on Codecs",
    "details": {
        "components": [
            "core/codecs"
        ],
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "4.0",
        "priority": "Major",
        "labels": "",
        "type": "Bug",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Today we expose termIndexInterval and termIndexDivisor via several APIs and they are deprecated. Those settings are 1. codec / postingformat specific and 2. not extendable. We should provide a more flexible way to pass information down to our codecs.",
    "attachments": {
        "LUCENE-4526.patch": "https://issues.apache.org/jira/secure/attachment/12551849/LUCENE-4526.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-11-02T11:54:04+0000",
            "content": "here is an starting point with lots of no-commits but something like this would be very powerful for users that have their own codecs.\n\nits really just a start for discussion. all test pass so far  ",
            "author": "Simon Willnauer",
            "id": "comment-13489373"
        },
        {
            "date": "2012-11-02T15:52:36+0000",
            "content": "I just glanced through in general: this is similar to the hack patch i used exploring LUCENE-4089, though I just used a Map<String,String>.\n\nThe part i didnt like when exploring was more related to how term index/term dictionary are separated:\n\ndivisor: generalize this into something simple like a Map<String,String> of codec \"parameters\" that you set on IWC/IR. split divisor from \"don't load terms index\". define these as constants where they belong. I got unhappy here in the \"splitting\" part because I wanted the divisor part in TermsIndexReaderBase, but that doesnt extend FieldsProducer (where i wanted the \"don't load\" part) and wrap the terms dict, instead its backwards and terms dict wraps the TermsIndexReaderBase... maybe we should fix that too? I think this confusing the way it is but I didnt look at how difficult this would be.\n\nBut I think maybe I was trying to tackle too much at once... still as an \"untyped\" parameter I thought it would be useful to fix the semantics all in one break rather than causing confusion down the road. ",
            "author": "Robert Muir",
            "id": "comment-13489501"
        },
        {
            "date": "2013-07-23T18:44:28+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13716961"
        },
        {
            "date": "2014-04-16T12:54:39+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970827"
        }
    ]
}