{
    "id": "LUCENE-7271",
    "title": "Cleanup jira's concept of 'master' and '6.0'",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Resolved",
        "type": "Bug"
    },
    "description": "Jira's concept of \"Fix Version: master\" is currently screwed up, as noted & discussed in this mailing list thread...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201604.mbox/%3Calpine.DEB.2.11.1604131529140.15570@tray%3E\n\nThe current best plan of attack (summary) is:\n\n\tuse Jira's \"Merge Versions\" feature to merge master into 6.0\n\tadd a new master (7.0) to use moving forward\n\tmanually audit/fix the fixVersion of some clean up issues as needed.\n\n\n\nI'm using this issue to track this work.\n\n\n\nDetailed Check list of planned steps:\n\n\n\tS1: Generate a CSV report listing all resolved/closed Jira's with 'fixVersion=master AND fixVersion=6.1'\n\t\n\t\thttps://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20status%20in%20%28Resolved%2C%20Closed%29%20AND%20fixVersion%20%3D%20master%20AND%20fixVersion%20%3D%206.1%20ORDER%20BY%20resolved%20DESC%2C%20key%20DESC\n\t\t\n\t\t\tcurrently about ~100 issues\n\t\t\n\t\t\n\t\tThe operating assumption is that any non-resolved issues should have the fixVersion set correctly if/when they are resolved in the future\n\t\n\t\n\tS2: Generate two CSV reports containing all issues that match these 2 queries for fixVersion=master and fixVersion=6.0\n\t\n\t\t\n\t\t\n\t\t\tmaster: https://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20fixVersion%20%3D%20master%20ORDER%20BY%20key%20DESC\n\t\t\t6.0: https://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20fixVersion%20%3D%206.0%20ORDER%20BY%20key%20DESC\n\t\t\n\t\t\n\t\tthese reports can be attached to this issue (LUCENE-7271) for posterity in case people want to later review what the state of any issue was before this whole process was started and versions were changed/merged\n\t\n\t\n\tS3: Use Jira's \"Merge Versions\" feature to merge \"master\" into \"6.0\"\n\t\n\t\tThis needs to be done distinctly for both LUCENE and SOLR\n\t\n\t\n\tS4: Add a new \"master (7.0)\" version to Jira\n\t\n\t\tThis needs to be done distinctly for both LUCENE and SOLR\n\t\n\t\n\tS5: audit every issue in the CSV file from S1 above to determine if/when the issue should get fixVersion=\"master (7.0)\" added to it or fixVersion=\"6.0\" removed from it:\n\t\n\t\tif it only ever had commits to master (ie: before branch_6x was made on March 2nd) then no action needed.\n\t\tif it has distinct commits to both master after branch_6x was made on March 2nd, then fixVersion=\"master (7.0)\" should definitely be added.\n\t\tif it has no commits to branch_6_0, and the only commits to branch_6x are after branch_6_0 was created on March 3rd, then fixVersion=\"6.0\" should be removed.\n\t\tif there are no obvious commits in the issue comments, then sanity check why it has any fixVersion at all (can't reproduce? dup? etc...)\n\t\n\t\n\tS6: Audit CHANGES.txt & git commits and replace fixVersion=6.0 with fixVersion=\"master (7.0)\" on the handful of issues where appropriate in case they fell through the cracks in S5:\n\t\n\t\tLook at the 7.0 section of lucene/CHANGES.txt & solr/CHANGES.txt for new features\n\t\t\n\t\t\tcurrently only 1 jira mentioned in either files in 7.0 section\n\t\t\n\t\t\n\t\tUse git co releases/lucene-solr/6.0.0 && git cherry -v master | egrep '^+' to find changesets on master that were not included in 6.0\n\t\t\n\t\t\tcurrently ~40 commits\n\t\t\n\t\t\n\t\tbefore removing fixVersion=6.0 from any of these issues, sanity check if this is a deprecation type situation (involving diff commits in both 6.0 and master) in which case fixVersion=\"master (7.0)\" should be added in addition to fixVersion=6.0",
    "attachments": {
        "jira_export.pl": "https://issues.apache.org/jira/secure/attachment/12803042/jira_export.pl",
        "LUCENE-7271_S2_6.0_report.xml": "https://issues.apache.org/jira/secure/attachment/12803043/LUCENE-7271_S2_6.0_report.xml",
        "LUCENE-7271_S6_report.txt": "https://issues.apache.org/jira/secure/attachment/12803118/LUCENE-7271_S6_report.txt",
        "LUCENE-7271_S1_report.xls": "https://issues.apache.org/jira/secure/attachment/12802698/LUCENE-7271_S1_report.xls",
        "LUCENE-7271_S1_report.csv": "https://issues.apache.org/jira/secure/attachment/12802697/LUCENE-7271_S1_report.csv",
        "LUCENE-7271_S2_master_report.tgz": "https://issues.apache.org/jira/secure/attachment/12803041/LUCENE-7271_S2_master_report.tgz",
        "LUCENE-7271_S5_hoss_todo.txt": "https://issues.apache.org/jira/secure/attachment/12803117/LUCENE-7271_S5_hoss_todo.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15272913",
            "author": "Hoss Man",
            "date": "2016-05-05T19:25:52+0000",
            "content": "I haven't seen any objections to this plan, and i haven't been able to think of any flaws or possible improvements.\n\nMy plan is to start working through these steps tomorrow (Friday) morning ~9AM my time, (~1600 UTC)\n\nSteps S1-S4 will need to be done carefully and in a single block to reduce the risk of missing issues edited between steps (but obviously skimming mail for issues people modify during that window can be done after the fact).\n\nSteps S5 & S6 should be done ASAP after that to reduce confusion as people read/edit jiras, but don't need to be rushed (ie: i'll go to lunch at some point) and can be divided up among multiple people if other folks want to volunteer.\n\nI'll track progress with comments here, and attach the reports i generate from S1, S5, and S6 to this issue as i go.\n\nI'll be on freenodes #lucene IRC channel the whole time if people have concerns or want to coordinate on helping out with S5 & S6. "
        },
        {
            "id": "comment-15272996",
            "author": "Anshum Gupta",
            "date": "2016-05-05T20:18:03+0000",
            "content": "LGTM Hoss. There's on thing that I don't have clarity on though. \n\nS5: if it only ever had commits to master (ie: before branch_6x was made) then no action needed\nHow would this be ever true, considering that the list that you'd generate would have fix version as master AND 6.1?\n\nI would like to help but I'm not sure if I'd be available as I'm traveling for Apache Big Data tomorrow. I'll try and sync up on IRC if I can help. "
        },
        {
            "id": "comment-15273007",
            "author": "Michael McCandless",
            "date": "2016-05-05T20:25:41+0000",
            "content": "Thank you Hoss Man! "
        },
        {
            "id": "comment-15273147",
            "author": "Hoss Man",
            "date": "2016-05-05T21:42:23+0000",
            "content": "How would this be ever true, considering that the list that you'd generate would have fix version as master AND 6.1?\n\nIt shouldn't ever be true, and it might be paranoied overkill on my part, but ultimately i'm just trying to cover all the basis in terms of \"this issue has 'master' in fixVersion, what was the intent when that was added?\"\n\nImagine this hypothetical timeline...\n\n\n\tmaster and branch-5x are the only active branches\n\tcommit#1 for JIRA-XXX is commited to master\n\tJIRA-XXX is marked fixVersion=master and resolved\n\tbranch_6x is created\n\tbranch_6_0 is created\n\ta bug is noticed in the new functionality added by JIRA-XXX and the issue is re-opened\n\ta fix is created and commit#2 is made to master & backported to both branch-6x and branch_6_0\n\tJIRA-XXX is updated to include fixVersion=6.1, but the dev doesn't notice that 6.0 is missing and doesn't think to add for some reason\n\twe merge master -> 6.0, and now the issue only lists fixVersion=\"6.0, 6.1\" w/o listing \"master\"\n\n\n\nThat said, your question made me realize i overlooked something that should definitely be part of S5: We need to keep an eye out for issues that were backported to branch_6x after branch_6_0 was created, and were not backported to branch-6_0 – in which case fixVersion=6.0 needs removed in S5.\n\nIn my original brainstorming of this plan, i was going to do this audit twice (once before merging the versions when \"master\" could be removed from issues w/only \"master\" commits, and once after to add 6.0 in the paranoia case described above) making this extra check unneccessary.  But this order seemed better because it means we only have to audit the list one time, w/o any time pressure and w/o the list continually growing as people resolve more 6.1 issues.\n\n(S6 should also catch these issues, but i wanted redundency since it's possible people made issue# typos in the git commit messages)\n\nI've updated the steps in the issue description accordingly.\n "
        },
        {
            "id": "comment-15274079",
            "author": "Steve Rowe",
            "date": "2016-05-06T14:13:18+0000",
            "content": "Looking at a different JIRA version problem (see http://markmail.org/message/6ac5szyce3qhoo3l), I noticed that LUCENE (and not SOLR) has version contstants 6.x and 5.x - there are 38 issues with these as fixVersion-s: https://issues.apache.org/jira/issues/?jql=project+in+(LUCENE,SOLR)+AND+(fixVersion=6.x+OR+fixVersion=5.x).\n\nI think this is a related problem to the master->6.0 issue being dealt with here.\n\nShould we even have 6.x and 5.x versions at all? "
        },
        {
            "id": "comment-15274293",
            "author": "Hoss Man",
            "date": "2016-05-06T16:16:38+0000",
            "content": "I think this is a related problem to the master->6.0 issue being dealt with here.\n\nI think it is a similar class of problem, and a similar audit could/should be done to fix those issues, but the specific steps needed to assess those issues and deal with that confusion will be distinctly diff from what needs done here to fix \"master\" (which affects a few order of magnitude more issues)\n\nI'd really prefer not discuss 5.x/6x anymore in this jira and confuse/complicate the issue anymore. "
        },
        {
            "id": "comment-15274312",
            "author": "Hoss Man",
            "date": "2016-05-06T16:31:48+0000",
            "content": "Step S1...\n\nAttaching 2 files:\n\n\n\tLUCENE-7271_S1_report.xls - Using \"Export to Excel (Current Fields)\" option from Jira for this URL...\n\t\n\t\thttps://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20status%20in%20%28Resolved%2C%20Closed%29%20AND%20fixVersion%20%3D%20master%20AND%20fixVersion%20%3D%206.1%20ORDER%20BY%20resolved%20DESC%2C%20key%20DESC\n\t\n\t\n\tLUCENE-7271_S1_report.csv - using OpenOffice to convert LUCENE-7271_S1_report.xls to plain text on my local machine.\n\n "
        },
        {
            "id": "comment-15274321",
            "author": "Steve Rowe",
            "date": "2016-05-06T16:36:43+0000",
            "content": "I'd really prefer not discuss 5.x/6x anymore in this jira and confuse/complicate the issue anymore.\n\nI created LUCENE-7275 for this. "
        },
        {
            "id": "comment-15274364",
            "author": "Hoss Man",
            "date": "2016-05-06T17:09:50+0000",
            "content": "Didn't even make it to Step #2 before i discovered a problem...\n\nJira's \"Bulk Edit\" feature has been seriously hobbled since the last time i used it...\n\n\n\tYou can only bulk edit up to  1000 issues at a time now.\n\t\n\t\tThis makes it impossible to do a bulk edit on all 4K+ issues with fixVersion=master\n\t\tI could work around this by crafting 5 distinct queries, but...\n\t\n\t\n\tThe options you can do when Bulk Editing are really limited...\n\t\n\t\tI tried doing a bulk edit on the 186 issues with fixVersion=6.0\n\t\tthe \"Edit Issues\" option was disabled with the text: NOTE: You do not have permission to edit the selected 186 issues or at least one issue has a status that forbids editing.\n\t\tThe remaining options are \"Move Issues\" (really bad idea), \"Delete Issues\" (even worse idea), \"Transition Issues\" (through workflow), \"Watch Issues\" and \"Stop Watching Issues\"\n\t\tthe start/stop watching issues options don't let you add a comment\n\t\tthe \"Transition Issues\" option seemed like a last hope, but it's too smart – it makes you pick a specific transition like \"Resolved -> Closed\" (no No-Op options listed) and knows that that each specific option will only affect a subset of the issues (the ones in the iniial state of the option you pick)\n\t\n\t\n\n\n\n\n\nI think Step S2 needs to be scrapped.  I would really like to have distinct comments identifying all of the issues, both because it would make it easy to search for all affected issues (and filter that search by other factors) but also so it shows up if/when people read the comments in these issues in case something gets missing in Steps S5 and S6 – but I just don't think that's possible.\n\nMy next best suggestion is to just run excel/csv reports for the queries in S2 (just like S1) and attache them to this issue for posterity.\n\nI'll revise the description of the issue to reflect the new plan, and put everythine on hold until monday in case anyone has better suggestions.\n "
        },
        {
            "id": "comment-15274373",
            "author": "Hoss Man",
            "date": "2016-05-06T17:14:01+0000",
            "content": "revised description based on the fact that jira bulk edits are fucking useless now.\n\nI'll start this process over again at S1 on monday unless i hear otherwise. "
        },
        {
            "id": "comment-15274403",
            "author": "Cassandra Targett",
            "date": "2016-05-06T17:30:00+0000",
            "content": "the \"Edit Issues\" option was disabled with the text: \"NOTE: You do not have permission to edit the selected 186 issues or at least one issue has a status that forbids editing.\"\n\nOh right, if the issue is closed already, you can't edit the fix version at all (and it gives that rather unhelpful message about permissions). Assuming that is the problem for those issues, we would need to reopen all those in order to fix the version then close them again. "
        },
        {
            "id": "comment-15274422",
            "author": "Hoss Man",
            "date": "2016-05-06T17:40:28+0000",
            "content": "Assuming that is the problem for those issues, we would need to reopen all those in order to fix the version then close them \n\nBulk Edit is already stressfull enough, I'd really really rather not Bulk Edit once to re-open the subset of issues that are currently closed issues (and add one comment to keep track of them) then Bulk Edit (2 more times) to add the comments i originally wanted to add, then Bulk Edit a third time to re-close issues from the 1st time ... \n\n...particulaly since we're only assuming that's the problem.  who knows what other \"workflow\" constraints might be in place to prevent me from doing a No-op Bulk Edit to add a comment to all the issues (they've clearly added a lot more \"smarts\" to bulk editing lately, so i'm not even sure a No-Op edit that just adds a comment will even work at this point)\n\nAt this point I personally just really want to avoid the Bulk Edits – but i'm happy to hand this issue off to someone else if they feel more confident then me about being able to follow the original plan \n "
        },
        {
            "id": "comment-15275341",
            "author": "Anshum Gupta",
            "date": "2016-05-07T19:00:21+0000",
            "content": "Hoss, I need to close out the issues for 5.5.1 and also move the unresolved ones to 5.5.2 but I'm sure there's an intersection there with the issues here. If you haven't already started on that OR think that my update wouldn't interfere, I'd go ahead with mine.\n\n\tchange fixVersion from 5.5.1 -> 5.5.2 for all unresolved issues which also contain a fixVersion of 5.5.1 (might also contain master/6.0 here, which is what I'm worried about)\n\tClosing out the issues with 5.5.1 as a fixVersion  (again the same problem).\n\n\n\nI'm traveling so I may only be able to check on this later at night (or right now). "
        },
        {
            "id": "comment-15275399",
            "author": "Chris Hostetter (Unused)",
            "date": "2016-05-07T22:15:40+0000",
            "content": "Closing all issues with a certain fix version affects nothing.\n\nYou can't do any bulk changing of fix versions w/o completely replacing all fix versions on an issue, so don't bother trying - that's completely independent from anything I've got planned. Just leave unresolved issues alone, (or edit them individually) \n\n-Hoss\n "
        },
        {
            "id": "comment-15276692",
            "author": "Hoss Man",
            "date": "2016-05-09T17:37:40+0000",
            "content": "\n\n\nStarting again today...\n\n....AAAAANNNNNDDDDD Aparently Jira silently drops anything after the first 100 issues when exporting.\n\nSo, we can work around this by doing an export with \"pagination\", but for our 3 diff reports that's ~45 URLs to keep straight, so i'm going to try and bang out a little perl script to make sure i don't miss something.\n\n\n "
        },
        {
            "id": "comment-15276766",
            "author": "Hoss Man",
            "date": "2016-05-09T18:26:39+0000",
            "content": "\nOk ... i will not let jira defeat me.\n\nAttaching many files...\n\n\n\tS1\n\t\n\t\tmanually did the S1 export to excel after tweaking the URL to use tempMax=200 (that apears to be the true hard limit on our jira install)\n\t\t\n\t\t\tURL: https://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20status%20in%20%28Resolved%2C%20Closed%29%20AND%20fixVersion%20%3D%20master%20AND%20fixVersion%20%3D%206.1%20ORDER%20BY%20resolved%20DESC%2C%20key%20DESC\n\t\t\traw export: LUCENE-7271_S1_report.xls\n\t\t\tconverted to CSV using ooffice: LUCENE-7271_S1_report.csv\n\t\t\n\t\t\n\t\n\t\n\tS2\n\t\n\t\t6.0 list\n\t\t\n\t\t\tLess then 200 issues, so i manually exported to XML (to be consistent with the master list, see below)\n\t\t\tURL: https://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20fixVersion%20%3D%206.0%20ORDER%20BY%20key%20DESC\n\t\t\traw data: LUCENE-7271_S2_6.0_report.xml\n\t\t\n\t\t\n\t\tmaster list\n\t\t\n\t\t\t4827 total issues when report was run\n\t\t\tURL: https://issues.apache.org/jira/issues/?jql=project%20in%20%28LUCENE%2C%20SOLR%29%20AND%20fixVersion%20%3D%20master%20ORDER%20BY%20key%20DESC\n\t\t\tScript used to fetch pages of results 200 at a time: jira_export.pl\n\t\t\tResult files: LUCENE-7271_S2_master_report_*.xml (x25) - in LUCENE-7271_S2_master_report.tgz\n\t\t\tNote: 2 files were evidently truncated by jira before returning successfully, so I manually refectched those URLs after the fact using curl\n\t\t\t\n\t\t\t\tLUCENE-7271_S2_master_report_800.xml and LUCENE-7271_S2_master_report_2800.xml\n\t\t\t\tproblem discovered & final results verified via grep \"<link>https://issues.apache.org/jira/browse/\" LUCENE-7271_S2_master* | sort -u | wc -l\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\n\t\n\n\n\n\n...moving on to S3 & S4 "
        },
        {
            "id": "comment-15276823",
            "author": "Hoss Man",
            "date": "2016-05-09T19:02:57+0000",
            "content": "\nVersions merged ... no going back now.\n\n\n\tS3\n\t\n\t\tLUCENE: master merged into 6.0\n\t\tSOLR: master merged into 6.0\n\t\n\t\n\tS4\n\t\n\t\tLUCENE: added master (7.0)\n\t\tSOLR: added master (7.0)\n\t\n\t\n\n\n\n\nGoing ot grab some lunch and then start working my way through S5 and S6 this afternoon\n\n\n\nFYI: Jira's \"Merge Versions\" feature is really weird (and really slow) now .... it spins for a while and then returns, but hte \"old\" version is still listed on the version screen (for a while).  It appears that it spins up a background thread that iterates over every individual issue in the background and change them, causing concurrent queries you try from the browser for the \"old\" version to slowly see decreasing results over time, until evnetually there are no results found, and then the old version disappears from the list of Verions.  \n\nIn fact: If you view \"All\" Activity for any of the issues that use to be assocaited with the (old) 'master' version, it says i edited the fixVersion and changed it to 6.0, and it says the \"updated\" date for all of these issues is \"Just now\"\n "
        },
        {
            "id": "comment-15276839",
            "author": "Hoss Man",
            "date": "2016-05-09T19:08:44+0000",
            "content": "Oh, and before i forget: Since it took so long to run the reports & merge the versions, I reviewed all jira email notifications from this morning (up until my last comment made it to my mail spool) to sanity check there were no issues that got \"resolved\" with fixVersion=master after/during running the above reports, but before i merged the versions – there was nothing there to worry about. "
        },
        {
            "id": "comment-15277339",
            "author": "Hoss Man",
            "date": "2016-05-09T23:39:57+0000",
            "content": "\nStatus update...\n\n\n\n\tS5\n\t\n\t\tMaking progress manually reviewing issues from the S1 report – about 50 issues left to review.\n\t\t\n\t\t\tattaching LUCENE-7271_S5_hoss_todo.txt which is my personal checklist i'm working through (deleeting as i go)\n\t\t\n\t\t\n\t\n\t\n\tS6\n\t\n\t\tSOLR-4509 was the only issue in either CHANGES.txt 7.0 section, so i went ahead and updated it in jira to master (7.0)\n\t\tAttaching LUCENE-7271_S6_report.txt containing the GIT SHAs on master but not 6.0.0 that still need reviewed\n\t\t\n\t\t\tI won't bother worrying about this until Step # S5 is done, but I wanted to go ahead and generate this report now so the list of commits wouldn't keep growing with stuff i didn't need to worry about it.\n\t\t\n\t\t\n\t\n\t\n\n "
        },
        {
            "id": "comment-15279126",
            "author": "Hoss Man",
            "date": "2016-05-10T22:28:08+0000",
            "content": "S5 complete, moving on to S6. "
        },
        {
            "id": "comment-15279280",
            "author": "Hoss Man",
            "date": "2016-05-11T00:13:44+0000",
            "content": "S6: DONE\nLUCENE-7271: DONE\n\n...and now returning to my regularly scheduled life. "
        },
        {
            "id": "comment-15279357",
            "author": "Anshum Gupta",
            "date": "2016-05-11T01:38:20+0000",
            "content": "Thanks Hoss! "
        }
    ]
}