{
    "id": "LUCENE-5395",
    "title": "Upgrade Spatial4j to 0.4",
    "details": {
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [
            "modules/spatial"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7"
        ]
    },
    "description": "Spatial4j 0.4 should be released the week of January 13th; a snapshot is published.  A longer version of the delta from 0.4 is in CHANGES.md\n\nA couple notable new features are:\n\n\tBuilt-in WKT parser without relying on JTS.  The older shape string format is deprecated.\n\tA binary shape codec for reading & writing the shapes to a byte-stream in a reasonably compact manner.",
    "attachments": {
        "LUCENE-5395_Spatial4j_0_4.patch": "https://issues.apache.org/jira/secure/attachment/12623907/LUCENE-5395_Spatial4j_0_4.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-13870449",
            "author": "David Smiley",
            "content": "Spatial4j deprecated shape string formats other than WKT, leaving such things (like \"lat,lon\" and a couple other formats) for clients to do in any way they want.  The non-WKT parser is now in LegacyShapeReadWriterFormat.  I'd like to roll this change on through Lucene-spatial.  So a Lucene-spatial user that wants to parse a \"lat,lon\" format or whatever has to handle this themselves.  It's easy; I've updated the example demo test accordingly.  They can still call ctx.readString(str) to get the legacy behavior, but I'm going to modify SpatialArgsParser to not use it; just WKT.  SpatialArgsParser is what parses strings like \"Intersects(SHAPE_FORMAT) distErrPct=0.025\".  I'll make it easy to subclass the parser for a client to parse other formats.\n\nOn the Solr subclass of SpatialArgsParser, I'll use LegacyShapeReadWriterFormat in the 4x branch for back-compat, but on trunk I want to only support \"lat, lon\" and \"x y\"  (and WKT of course) – no more \"Circle(x y d=mydist)\" and no more \"xMin, xMax, yMin, yMax\".  People using these should use {!geofilt} when possible.  The WKT (as implemented in Spatial4j) equivalents to the 2 deprecated formats are \"BUFFER(POINT(X Y), MYDIST)\" and \"ENVELOPE(xMin, xMax, yMax, yMin)\" respectively.  Note the quirky arg order for ENVELOPE (blame OGC's spec for that one).\n\nIf anyone has input on preferences as to which layer (Lucene/Solr) at which version (trunk/4x) should support what syntax then please share – otherwise I'll go with the plan above.  I'm almost done with the patch. ",
            "date": "2014-01-14T06:50:47+0000"
        },
        {
            "id": "comment-13870881",
            "author": "Ryan McKinley",
            "content": "+1 to update spatial4j\n\nIn 4x, we should make sure existing user query syntax continues to work (perhaps logging a warning in solar).  5x can drop the funky syntax ",
            "date": "2014-01-14T16:43:53+0000"
        },
        {
            "id": "comment-13872163",
            "author": "David Smiley",
            "content": "I'm moving some point parsing utilities and some specialized distance calculations (e.g. DistanceUtils.vectorDistance()) from Spatial4j that are only used by Solr, into Solr. ",
            "date": "2014-01-15T15:11:00+0000"
        },
        {
            "id": "comment-13876185",
            "author": "David Smiley",
            "content": "Patch attached.  It was a bit of work because I weened Lucene/Solr off all of Spatial4j's deprecated things.  I added a test to show that the old circle and rect syntax still work in Solr but there's no trace of it anywhere else.  And instead of simply copying ParseUtils into Solr, I really wanted to improve and simplify it and all code using it.  It's now \"SpatialUtils\" with just one real point parsing method. Arguably that should have been a separate Solr issue, but it's just an internal refactor.\n\nI still need to actually release Spatial4j 0.4 but I was waiting for me to finish this patch.  I'll release it tomorrow.\n\nI'll commit this patch in ~24 hours, subject to feedback.  I will open a separate issue for Solr to remove the old circle & rect format from trunk, and to ask a relation question about point formats. ",
            "date": "2014-01-20T06:38:50+0000"
        },
        {
            "id": "comment-13877284",
            "author": "David Smiley",
            "content": "Updated patch for released version of Spatial4j today, including sha1's, and the notice.txt.  Also, I added back-compat for the worldBounds option to rewrite the old rect syntax, if supplied, to ENVELOPE.\n\nI meant to say commit in 48 hours, not 24. And I'm on travel this week (NYC) so we'll see. ",
            "date": "2014-01-21T06:59:46+0000"
        },
        {
            "id": "comment-13881355",
            "author": "ASF subversion and git services",
            "content": "Commit 1561129 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1561129 ]\n\nLUCENE-5395: Upgrade Spatial4j 0.4. Moved away from stuff deprecated in Spatial4j. ",
            "date": "2014-01-24T19:40:15+0000"
        },
        {
            "id": "comment-13881380",
            "author": "ASF subversion and git services",
            "content": "Commit 1561142 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1561142 ]\n\nLUCENE-5395: Upgrade Spatial4j 0.4. Moved away from stuff deprecated in Spatial4j. ",
            "date": "2014-01-24T20:16:50+0000"
        },
        {
            "id": "comment-13881557",
            "author": "ASF subversion and git services",
            "content": "Commit 1561238 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1561238 ]\n\nLUCENE-5395: calculated sha1 via \"ant jar-checksums\" this time ",
            "date": "2014-01-25T00:29:29+0000"
        },
        {
            "id": "comment-13881558",
            "author": "ASF subversion and git services",
            "content": "Commit 1561239 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1561239 ]\n\nLUCENE-5395: calculated sha1 via \"ant jar-checksums\" this time ",
            "date": "2014-01-25T00:30:41+0000"
        },
        {
            "id": "comment-13881646",
            "author": "ASF subversion and git services",
            "content": "Commit 1561250 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1561250 ]\n\nLUCENE-5395: use Locale.ROOT ",
            "date": "2014-01-25T03:48:14+0000"
        },
        {
            "id": "comment-13881647",
            "author": "ASF subversion and git services",
            "content": "Commit 1561251 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1561251 ]\n\nLUCENE-5395: use Locale.ROOT ",
            "date": "2014-01-25T03:49:51+0000"
        }
    ]
}