{
    "id": "LUCENE-2499",
    "title": "Many of the links on the LuceneFAQ result in 404 errors",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/website"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "http://wiki.apache.org/lucene-java/LuceneFAQ\n\nexmples:\nhttp://lucene.apache.org/java/docs/api/org/apache/lucene/queryParser/QueryParser.html#setLowercaseExpandedTerms(boolean)\nhttp://lucene.apache.org/java/docs/api/org/apache/lucene/search/Filter.html\nhttp://lucene.apache.org/java/docs/api/org/apache/lucene/search/CachingWrapperFilter.html\n\n\nUwe's comment:\nWe could add an additional entry to .htaccess that redirects to the latest released version. We have something similar, but that points to Hudson.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-06-14T22:09:18+0000",
            "content": "at the current moment, the problem is that those links do redirect to hudson, but the redirect doesn't use the correct base path.\n\nThe way we got to this situation (as i understand it)\n\n\n\tnightly docs use to be hosted on lucene.apache.org\n\tit was decided that only the \"official\" docs for each released version should live on lucene.apache.org, and that the nightly docs should only exist on hudson since they are for developers only - a redirect was added for any old links\n\tthe javadoc directory structure was changed, so that there is a top level directory, with subdirectories for \"all\", \"core\" and each contrib.\n\n\n\nThe simplest way to make those URLs work is to update the existing hudson redirect so that http://lucene.apache.org/java/docs/api/ redirects to http://hudson.zones.apache.org/hudson/job/Lucene-trunk/javadoc/all/ instead of http://hudson.zones.apache.org/hudson/job/Lucene-trunk/javadoc/\n\nBut that still doesn't address the original reason why the redirect was added: to stop \"featuring\" nightly docs for typical users.\n\nI would suggest that what we should do (especially now that we have parallel development going on in both 3x and 4x branches) is support long lived URLs for the docs from the \"latest\" release of each branch\n\nAll of these URLs should \"work\", and none should redirect anywhere else – they should surface identical content...\n\n\n\thttp://lucene.apache.org/java/3_0_1/\n\thttp://lucene.apache.org/java/3_0-latest/\n\thttp://lucene.apache.org/java/3-latest/\n\thttp://lucene.apache.org/java/latest/\n\n\n\n...when 3.0.2 is an official release, we add http://lucene.apache.org/java/3_0_2/ and the content on all of the \"latest\" URLs becomes identical to it.  when 4.0.0 is released then we add...\n\n\thttp://lucene.apache.org/java/4_0_0/\n\thttp://lucene.apache.org/java/4_0-latest/\n\thttp://lucene.apache.org/java/4-latest/\n...which are all identical, and make http://lucene.apache.org/java/latest/ a mirror of them as well.\n\n\n\nThe main idea being: you can link to the docs at whatever level of granularity makes sense based on context.  In a FAQ about IndexSearcher, you can probably just link to the javadocs under http://lucene.apache.org/java/latest/ ... but if you are referencing a new method added in 4.2, then you probably want to link to http://lucene.apache.org/java/4-latest/ ... and if you are referencing a bug fix in a partiular point release, then you might want to link directly to it.\n\nAs far as the implementation – simple directory symlinks are probably the easiest way to go.\n ",
            "author": "Hoss Man",
            "id": "comment-12878772"
        }
    ]
}