{
    "id": "LUCENE-791",
    "title": "Update the Wiki",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "general/website"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "The wiki needs updating.  For starters, the URL is still Jakarta.  I think infrastructure needs to be contacted to do this move.  If someone is so inclined, it might be useful to go through and cleanup/organize what is there.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2007-02-01T21:16:16+0000",
            "content": "I consider it important for old urls to still work after the move. If this is not possible, I'd suggest we just ignore the \"wrong\" url. ",
            "author": "Daniel Naber",
            "id": "comment-12469586"
        },
        {
            "date": "2007-02-21T07:14:21+0000",
            "content": "minor thing to keep in mind when/if doing this: when changing the wiki name from \"jakarta-lucene\" to something else, that something should be \"java-lucene\" or \"lucene-java\" ... but it really shouldn't be \"lucene\" just inc ase we ever want to set up a central wiki for the Lucene PMC (not subproject specific) ",
            "author": "Hoss Man",
            "id": "comment-12474651"
        },
        {
            "date": "2007-02-21T17:49:19+0000",
            "content": "To summarize: someone should file an issue in the Infrastructure Jira requesting that the jakarta-lucene wiki be renamed \"lucene-java\", and for links to pages in http://wiki.apache.org/jakarta-lucene/ to redirect to the corresponding pages in http://wiki.apache.org/lucene-java/. ",
            "author": "Doug Cutting",
            "id": "comment-12474773"
        },
        {
            "date": "2007-02-24T20:26:45+0000",
            "content": "something to consider...\n\nis it worth migrating to cwiki.apache.org ?\n\nhttp://cwiki.apache.org/confluence/display/CWIKI/Index\n\nhttp://www.nabble.com/Created%3A-%28LUCENE-805%29-New-Lucene-Demo-tf3234570.html#a9131628\n\n\n ",
            "author": "Hoss Man",
            "id": "comment-12475650"
        },
        {
            "date": "2007-03-09T20:20:28+0000",
            "content": "OK, https://issues.apache.org/jira/browse/INFRA-1173 has been resolved.  I will update the main links when I get a chance.  It is redirecting just fine.  New location is http://wiki.apache.org/jakarta-lucene/ ",
            "author": "Grant Ingersoll",
            "id": "comment-12479699"
        },
        {
            "date": "2007-03-09T22:06:11+0000",
            "content": "oops, good catch by Steve Rowe, the new location is actually properly specified on the issue as http://wiki.apache.org/lucene-java/\n\nI will commit the updates shortly to the documentation. ",
            "author": "Grant Ingersoll",
            "id": "comment-12479735"
        },
        {
            "date": "2007-03-10T13:42:05+0000",
            "content": "OK, I have reorganized the Front Page wiki a bit.  Hopefully a little easier to navigate, a little more like Solr.  Also added a UseCases section where it would be cool if people donated how they solved a particular problem in Lucene.\n\nMoved some of the old planning pages to the Archives section.\n\nStill would like to know how to set it up to send edit notifications to the commit list.  Is this an Infrastructure issue or is it something that can be handled by either the PMC or the committers? ",
            "author": "Grant Ingersoll",
            "id": "comment-12479839"
        },
        {
            "date": "2007-03-10T16:17:38+0000",
            "content": "Well, individuals can get commits themselves by registering and then, under UserPreferences, specifying .* for Subscribed wiki pages.\n\nOne can imagine setting up a pseudo-account on the wiki to represent the commit list, using the commit list as the e-mail address, and then subscribing. At least one issue there is that you can ask to have your info sent to you (including a link that allows you to change your password), and that's would go to the whole list. ",
            "author": "Steven Parkes",
            "id": "comment-12479849"
        },
        {
            "date": "2007-03-12T20:59:03+0000",
            "content": "1) at the moment, the old URLs are still working, these should probably be issuing 301 redirects so that Search Engines update to point to the new URLs (instead of different competing URLs with the same content both getting indexed)...\n\nhttp://wiki.apache.org/jakarta-lucene/LuceneFAQ\n\n\n2) on the issue of having updates sent to the commit list, this is currently working for Solr, and we don't have any pseudo-account setup monitoring the pages so there must be some lower level way to configure this ... consulting with infra may be wise\n(you can tell by looking at the general info for each page:   http://wiki.apache.org/solr/FAQ?action=info&general=1  ) ",
            "author": "Hoss Man",
            "id": "comment-12480184"
        },
        {
            "date": "2007-03-17T15:29:25+0000",
            "content": "Requested that infrastructure change the notification email for the wiki ",
            "author": "Grant Ingersoll",
            "id": "comment-12481863"
        },
        {
            "date": "2007-03-31T01:05:39+0000",
            "content": "Change notifications are now being sent to java-commits per INFRA-1197 ",
            "author": "Grant Ingersoll",
            "id": "comment-12485685"
        },
        {
            "date": "2007-05-31T01:42:35+0000",
            "content": "I think I am more or less happy with the changes at this point and am going to close this and specific issues w/ the wiki can be brought up with new issues. ",
            "author": "Grant Ingersoll",
            "id": "comment-12500268"
        }
    ]
}