{
    "id": "LUCENE-112",
    "title": "[PATCH] Add an IndexReader implementation that frees resources when idle and refreshes itself when stale",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "Here is a little something I worked on this weekend that I wanted to contribute \nback as I think others might find it very useful.\n\nI extended IndexReader and added support for configuring an idle timeout and \nrefresh interval.\n\nIt uses a monitoring thread to watch for the reader going idle. When the reader \ngoes idle it is closed. When the index is read again it is re-opened.\n\nIt uses another thread to periodically check when the reader needs to be \nrefreshed due to a change to index. When the reader is stale, it closes the \nreader and reopens the index.\n\nIt is acually delegating all the work to another IndexReader implementation and \njust handling the threading and synchronization. When it closes a reader, it \ndelegates the close to another thread that waits a bit (configurable how long) \nbefore actually closing the reader it was delegating to. This gives any \nconsumers of the original reader a chance to finish up their last action on the \nreader.\n\nThis implementation sacrifices a little bit of speed since there is a bit more \nsynchroniztion to deal with and the delegation model puts extra calls on the \nstack, but it should provide long running applications that have idle periods \nor frequently changing indices from having to open and close readers all the \ntime or hold open unused resources.",
    "attachments": {
        "ASF.LICENSE.NOT.GRANTED--IdleTimeoutRefreshingIndexReader.java": "https://issues.apache.org/jira/secure/attachment/12312238/ASF.LICENSE.NOT.GRANTED--IdleTimeoutRefreshingIndexReader.java",
        "ASF.LICENSE.NOT.GRANTED--IdleTimeoutRefreshingIndexReader.html": "https://issues.apache.org/jira/secure/attachment/12312239/ASF.LICENSE.NOT.GRANTED--IdleTimeoutRefreshingIndexReader.html"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2003-05-19T00:08:16+0000",
            "content": "Created an attachment (id=6408)\nThe java source for the class mentioned in the bug report. ",
            "author": "Eric Isakson",
            "id": "comment-12321308"
        },
        {
            "date": "2003-05-19T00:09:17+0000",
            "content": "Created an attachment (id=6409)\nJavadoc for the class described in this bug report ",
            "author": "Eric Isakson",
            "id": "comment-12321309"
        },
        {
            "date": "2003-09-10T23:10:11+0000",
            "content": "Eric,\nI took a quick glance at the code.  I have not tried using it.  Are you using it\nand are you happy with it?\n\nI don't think this is something we want to include in the core Lucene API, but\nperhaps this is something that we could put in lucene-sandbox, as an alternative\nimplementation of IndexReader.\n\nIt would be nice to put it in the CVS along with a unit test for it. ",
            "author": "Otis Gospodnetic",
            "id": "comment-12321310"
        },
        {
            "date": "2008-09-11T14:22:13+0000",
            "content": "This is pretty old (2003) and seems unlikely to go any further. Anyone object to closing this? ",
            "author": "Mark Miller",
            "id": "comment-12630203"
        },
        {
            "date": "2008-09-11T17:29:12+0000",
            "content": "+1 for closing it.  Half a decade ago.... ",
            "author": "Otis Gospodnetic",
            "id": "comment-12630265"
        },
        {
            "date": "2008-10-12T20:27:08+0000",
            "content": "The idea is not bad. And I think other frameworks based on Lucene use a similar approach. I implemented something similar using an FilterIndexReader with TimerTasks (but more complicated). But this could be rewritten using FilterIndexReader very easy. ",
            "author": "Uwe Schindler",
            "id": "comment-12638898"
        }
    ]
}