{
    "id": "LUCENE-2426",
    "title": "change sort order to binary order",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "3.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Since flexible indexing, terms are now represented as byte[], but for backwards compatibility reasons, they are not sorted as byte[], but instead as if they were char[].\n\nI think its time to look at sorting terms as byte[]... this would yield the following improvements:\n\n\tterms are more opaque by default, they are byte[] and sort as byte[]. I think this would make lucene friendlier to customizations.\n\tnumerics and collation are then free to use their own encoding (full byte) rather than avoiding the use of certain bits to remain compatible with char[] sort order.\n\tautomaton gets simpler because as in LUCENE-2265, it uses byte[] too, and has special hacks because terms are sorted as char[]",
    "attachments": {
        "LUCENE-2426.patch": "https://issues.apache.org/jira/secure/attachment/12447475/LUCENE-2426.patch",
        "LUCENE-2426_automaton.patch": "https://issues.apache.org/jira/secure/attachment/12447476/LUCENE-2426_automaton.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-05-02T14:33:42+0000",
            "content": "by the way: as mentioned above, as far as numerics and collation goes, \nboth of these today avoid any of the parts of unicode that are sensitive to such a sort order change.\n\nSo these already \"backwards compatible\" in the sense that numeric fields or \ncollated fields will sort the same way in either UTF-8/UTF-32 byte[] order or UTF-16 char[] order. ",
            "author": "Robert Muir",
            "id": "comment-12863137"
        },
        {
            "date": "2010-05-02T15:11:43+0000",
            "content": "big +1\nthe more we get to pure bytes, the better IMO. ",
            "author": "Yonik Seeley",
            "id": "comment-12863146"
        },
        {
            "date": "2010-05-02T16:22:52+0000",
            "content": "I think most apps will be unaffected by this change (if the prefix-flex index convertor can sort the terms in binary, too).\n\nBut we need to lookout for some traps:\n\n\tThings that use String.compareTo are dangerous, as it uses code unit order (e.g. i see a binary search w/ this in FieldCache)\n\tIn general assuming a term can be a String at all is problematic with using byte[] terms, if numeric wants to use full byte, etc.\nSo we should think about changing Term, too.\n\n\n\nthe best way to avoid problems is to stick with byte[] as much as possible and try to avoid using String for terms...  ",
            "author": "Robert Muir",
            "id": "comment-12863154"
        },
        {
            "date": "2010-05-03T10:14:48+0000",
            "content": "Big +1 too \n\nFor FieldCache, we need to do LUCENE-2380 (creates a BytesRef field cache) and switch Lucene to use it – I'll add a dependency. ",
            "author": "Michael McCandless",
            "id": "comment-12863297"
        },
        {
            "date": "2010-06-18T15:48:35+0000",
            "content": "Checkpointing my current state here... it should compile but tests are probably failing from the mods in preflex codec. ",
            "author": "Michael McCandless",
            "id": "comment-12880232"
        },
        {
            "date": "2010-06-20T23:11:59+0000",
            "content": "Attached patch, changing term sort order to unicode codepoint!  All tests pass.  I fixed preflex codec to seek around surrogates, and then back again, so that preflex indices also sort properly; it's rather hairy... I added a new randomized test that writes a preflex segment (just the terms dict) with random terms and then asserts the order. ",
            "author": "Michael McCandless",
            "id": "comment-12880689"
        },
        {
            "date": "2010-06-22T00:33:17+0000",
            "content": "How to deal with Term? \n\nI really don't like that Term.compareTo uses String.compareTo, for example MultiTermQuery uses this in TopTermsBooleanQueryRewrite for comparing terms in its priority queue. \n\nI don't think it should block this patch either, but we should at least open a second issue to figure out what to do about this.\nTerm needs to either go away, or use BytesRef w/ the codec's comparator in cases like this, or some things like FuzzyQuery will be technically wrong (i should add a test for this too, I think) ",
            "author": "Robert Muir",
            "id": "comment-12880974"
        },
        {
            "date": "2010-06-22T14:51:03+0000",
            "content": "How to deal with Term?\n\nMaybe we should keep it, but do a hard cutover of its .text from String to BytesRef, and also change its .compareTo to compare text by unicode code point order?\n\nI agree we should do this as a followon issue; in fact I think another issue is already open.\n\nNote, though, that field names still sort by UTF16 (String.compareTo) order. ",
            "author": "Michael McCandless",
            "id": "comment-12881220"
        }
    ]
}