{
    "id": "LUCENE-1451",
    "title": "Can't create NIOFSDirectory w/o setting a system property",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "NIOFSDirectory.getDirectory() returns a FSDirectory object",
    "attachments": {
        "LUCENE-1451.patch": "https://issues.apache.org/jira/secure/attachment/12393804/LUCENE-1451.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-11-12T20:38:48+0000",
            "content": "The actual class used for making new instances of Directory is FSDirectory.IMPL, set via the system property \"org.apache.lucene.FSDirectory.class\".\n\nIt seems like we should make it  possible to create multiple FSDirectory implementations of different types in the same JVM.\nThe simplest workaround would be to create a\n  protected static FSDirectory getDirectory(File file, LockFactory lockFactory, Class impl)\nSubclasses could implement their own getDirectory calls that pass down the appropriate class.\n\nNot the most elegant solution if one were starting from scratch, but it seems like it would be completely backward compatible, while allowing NIOFSDirectory.getDirectory() to do what it looks like it should do. ",
            "author": "Yonik Seeley",
            "id": "comment-12647047"
        },
        {
            "date": "2008-11-12T20:50:18+0000",
            "content": "Attaching untested patch implementing logic above. ",
            "author": "Yonik Seeley",
            "id": "comment-12647058"
        },
        {
            "date": "2008-11-12T20:53:20+0000",
            "content": "That looks like a good approach to me.\n\nThough, should we make the new getDirectory that takes the Class directoryImpl arg public, so that external subclasses of FSDirectory could also create their own instances? ",
            "author": "Michael McCandless",
            "id": "comment-12647061"
        },
        {
            "date": "2008-11-12T21:02:16+0000",
            "content": "Hmmm, external subclasses should be able to call the protected getDirectory method, right?\nBut perhaps a test case for external subclasses is warranted. ",
            "author": "Yonik Seeley",
            "id": "comment-12647065"
        },
        {
            "date": "2008-11-12T22:07:27+0000",
            "content": "It seems like we should make it possible to create multiple FSDirectory implementations of different types in the same JVM.\n\nAs mentioned in the thread that spawned this issue...\n\n1. i'm not sure i see any real motivation for this.  the biggest motivation to use an alternate impl will be OS (which is fixed for the whole JVM)\n1. if i'm reading it right, this patch won't work if two different callers ask for Directories backed by the same File using different directoryImpl instances ... the first one will go into the DIRECTORIES cache and \"win\" for all future calls.\n\n\nthat second problem can be solved in a similar way to the lockFactory check ... but like i said: this seems like a can of worms, with very little real advantage over a simple static setter. ",
            "author": "Hoss Man",
            "id": "comment-12647077"
        },
        {
            "date": "2008-11-12T22:08:56+0000",
            "content": "Attaching patch with tests. ",
            "author": "Yonik Seeley",
            "id": "comment-12647078"
        },
        {
            "date": "2008-11-12T22:21:27+0000",
            "content": "1. if i'm reading it right, this patch won't work if two different callers ask for Directories backed by the same File using different directoryImpl instances ... the first one will go into the DIRECTORIES cache and \"win\" for all future calls.\n\nHmm good point.  Actually why do we do this 'single instance of FSDir per File' again?  Is it really needed? ",
            "author": "Michael McCandless",
            "id": "comment-12647085"
        },
        {
            "date": "2008-11-12T22:21:38+0000",
            "content": "Hmmm, external subclasses should be able to call the protected getDirectory method, right?\n\nWoops sorry you're right. ",
            "author": "Michael McCandless",
            "id": "comment-12647086"
        },
        {
            "date": "2008-11-12T23:08:12+0000",
            "content": "Hmm good point. Actually why do we do this 'single instance of FSDir per File' again? Is it really needed?\n\nWhile it might be useful sometimes, I don't see how it really is needed. I think a better solution is allowing for direct instantiation while providing a factory class if for some reason you need that behavior. Most apps I have worked with do not need it and I don't understand why its forced on you, other than a bit of overprotection. ",
            "author": "Mark Miller",
            "id": "comment-12647103"
        },
        {
            "date": "2008-11-12T23:22:03+0000",
            "content": "if i'm reading it right, this patch won't work if two different callers ask for Directories backed by the same File using different directoryImpl instances ... the first one will go into the DIRECTORIES cache and \"win\" for all future calls.\n\nRight... the tests in the patch test for this too.  If an instance already exists, then it's returned.  If all the instances are closed, the desired implementation can be returned.   So it won't be for all future calls, but it would be difficult to ensure you got the implementation you wanted.\n\nHmm good point. Actually why do we do this 'single instance of FSDir per File' again? Is it really needed?\n\nI had assumed it was locking.... but it goes outside of the FSDirectory and operates directly on File.  So, I'm not sure.\n ",
            "author": "Yonik Seeley",
            "id": "comment-12647109"
        },
        {
            "date": "2008-11-13T00:03:56+0000",
            "content": "Right... the tests in the patch test for this too. If an instance already exists, then it's returned.\n\nMiller is probably right and we should just remove the cache anyway – but if we do leave it in this still seems dangerous to me, clients aren't guaranteed to get what they ask for.\n\nAdopting the same pattern as with LockType (throw an Exception if a Directory is in the cache but doens't match the class specified) seems safer. ",
            "author": "Hoss Man",
            "id": "comment-12647129"
        },
        {
            "date": "2008-11-13T10:14:51+0000",
            "content": "I think we should simply allow direct instantiation of NIOFSDirectory, and not map to a singular instance per-File.  But we should keep it for FSDir for back-compat. ",
            "author": "Michael McCandless",
            "id": "comment-12647249"
        },
        {
            "date": "2008-11-13T21:26:36+0000",
            "content": "Ok, here's a version that adds public constructors, and a test that ensures that reading, writing, and locking all work concurrently in the same directory with different FSDirectory implementations.\n\nAFAIK, there's nowhere in Lucene that synchronizes on the Directory instance (where it matters), so multiple instances per path should be safe. ",
            "author": "Yonik Seeley",
            "id": "comment-12647406"
        },
        {
            "date": "2008-11-14T15:41:48+0000",
            "content": "This looks good, Yonik.  Should we deprecate FSDirectory.getDirectory? ",
            "author": "Michael McCandless",
            "id": "comment-12647636"
        },
        {
            "date": "2008-11-14T15:53:30+0000",
            "content": "Should we deprecate FSDirectory.getDirectory? \n\nPerhaps... it would cut down the number of silly future errors in the form of NIOFSDirectory.getDirectory(). ",
            "author": "Yonik Seeley",
            "id": "comment-12647638"
        },
        {
            "date": "2008-11-14T15:58:34+0000",
            "content": "True.  And in general I don't like have more than one way to do basically the same thing.  People can always do the single-Directory-instance-per-File thing externally if they need to. ",
            "author": "Michael McCandless",
            "id": "comment-12647642"
        },
        {
            "date": "2008-11-14T16:03:01+0000",
            "content": "When I was reviewing getDirectory() I can across a race condition anyway - could lead to handing out a closed directory.  But people would need to be opening and closing directories rapidly from multiple threads, so I'm not sure if it's actually bitten anyone. ",
            "author": "Yonik Seeley",
            "id": "comment-12647644"
        },
        {
            "date": "2008-11-14T16:07:36+0000",
            "content": "Any preferences on the public constructor signature... File or String for the path? ",
            "author": "Yonik Seeley",
            "id": "comment-12647645"
        },
        {
            "date": "2008-11-14T16:21:55+0000",
            "content": "I think File is fine?  But I don't have a strong preference (I can't think of any tradeoffs). ",
            "author": "Michael McCandless",
            "id": "comment-12647651"
        },
        {
            "date": "2008-11-14T19:23:07+0000",
            "content": "Committed.  Thanks for the input guys! ",
            "author": "Yonik Seeley",
            "id": "comment-12647703"
        },
        {
            "date": "2008-11-24T21:52:51+0000",
            "content": "A bit of history, if any care.\n\nOriginally Lucene synchronized only on the Directory to coordinate index writes.  This was the primary motivation for the Directory cache.\n\nhttp://tinyurl.com/62ugs9#l120\n\nLater, lock files were added, but Directory synchronization remained as an optimization, to avoid hitting the filesystem when coordinating threads in the same process.\n\nhttp://tinyurl.com/5dzsyq#l125\n\nNow Directory-based synchronization has been dropped entirely, so the Directory cache can now go too.\n\n ",
            "author": "Doug Cutting",
            "id": "comment-12650344"
        }
    ]
}