{
    "id": "LUCENE-592",
    "title": "Create compound file after addIndexes but before rewrite of segments",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "2.1"
        ],
        "affect_versions": "1.9,                                            2.0.0",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "When compound file format is used new 'segments' file is written before cfs is created. If there is an exception (disk full, etc.) or it is opened before cfs exists, segments points to non-existing file.\n\nThis is a small change in index/IndexWriter.java, just a swap a block of code beginning with if(useCompoundFile) ...",
    "attachments": {
        "createCfthanSegments.diff": "https://issues.apache.org/jira/secure/attachment/12335165/createCfthanSegments.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2006-06-08T04:36:25+0000",
            "content": "patch swaps described parts of code in IndexWriter.\n\nThat is my first use of jira,svn and diff, please be patient if smthg is wrong. ",
            "author": "Karel Tejnora",
            "id": "comment-12415213"
        },
        {
            "date": "2007-02-26T00:27:09+0000",
            "content": "The described problem can not occur with Lucene 2.1 anymore. Now in SegmentInfo is stored whether a segment is in cfs format. After the IndexWriter created a segment in non-cfs format this new segment is committed with SegmentInfo.isCompoundFile = false. Only if a cfs file can be written successfully thereafter, the segment is committed with SegmentInfo.isCompoundFile == true. \nSo even if the writing of the cfs file fails for some reason and there is a corrupted cfs file on disk, it is not referenced by the segments file and thus an IndexReader/writer would not try to open it. ",
            "author": "Michael Busch",
            "id": "comment-12475796"
        }
    ]
}