{
    "id": "LUCENE-3587",
    "title": "Attempting to link to Java SE JavaDocs is competely unreliable",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "As noted several times since Oracle bought Sun, the canonical links to the Java SE JavaDocs have been unreliable and frequently cause warnings.\n\nSince we choose to fail the build on javadoc warnings, this is a serious problem for anyone trying to build from source if/when the package-list we reference in our common-build.xml is not available. \n\nWe should eliminate this dependency.",
    "attachments": {
        "LUCENE-3587.3x.patch": "https://issues.apache.org/jira/secure/attachment/12504826/LUCENE-3587.3x.patch",
        "LUCENE-3587.trunk.patch": "https://issues.apache.org/jira/secure/attachment/12504825/LUCENE-3587.trunk.patch",
        "LUCENE-3587.keep-javadoc-link.3x.patch": "https://issues.apache.org/jira/secure/attachment/12504847/LUCENE-3587.keep-javadoc-link.3x.patch",
        "LUCENE-3587.keep-javadoc-link.trunk.patch": "https://issues.apache.org/jira/secure/attachment/12504848/LUCENE-3587.keep-javadoc-link.trunk.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-11-22T23:59:30+0000",
            "content": "Patch against trunk demonstrating the change i suggest we make (to both trunk and 3x, and ideally the 3.5 release branch as well assuming we want to go with an RC3)\n\nThis doesn't prevent us from continuing to use a local version of the package-list in our jenkins build, but since we can't ship that file in our releases, this is a good compromise that eliminates our dependency on a the flaky and ever changing URL for javadocs. ",
            "author": "Hoss Man",
            "id": "comment-13155577"
        },
        {
            "date": "2011-11-23T00:03:08+0000",
            "content": "equivalent patch for the 3x (and 3.5) branches. ",
            "author": "Hoss Man",
            "id": "comment-13155582"
        },
        {
            "date": "2011-11-23T02:08:29+0000",
            "content": "+1 to the patch (i think its the best solution), on the condition that the release process \ndoesn't change... this means we won't have these links on the website. \n\nI don't want to make releases any harder so I don't think putting the burden on the RM to do something crazy to\nget those links on the website is worth it... for the most part lucene's classes extend other lucene classes\nor java.lang.Object so I don't think this is a bad compromise at all. ",
            "author": "Robert Muir",
            "id": "comment-13155622"
        },
        {
            "date": "2011-11-23T02:30:45+0000",
            "content": "I think we should just stop failing the build for this particular warning.  I'll work up a patch. ",
            "author": "Steve Rowe",
            "id": "comment-13155634"
        },
        {
            "date": "2011-11-23T04:50:55+0000",
            "content": "Trunk & branch_3x versions of patch to ignore the package-list download warning.\n\nThis way we at least attempt to do the right thing, but don't fail the build when Oracle fails to not suck. ",
            "author": "Steve Rowe",
            "id": "comment-13155681"
        },
        {
            "date": "2011-11-23T08:34:32+0000",
            "content": "Thanks for the alternative patch Steven.\n\nMy question remains: what is the release process?\n\nIf we are going to let this warning 'thru' but then the onus is on the RM to ensure\nthat these links are in fact actually working for release candidate builds etc,\nthen I'm against the patch, because its a step backwards from releasing (back to\nmanual inspections of everything).\n ",
            "author": "Robert Muir",
            "id": "comment-13155749"
        },
        {
            "date": "2011-11-23T17:58:27+0000",
            "content": "rmuir: I'm not sure where/how you got the impression that anything about the release process should change.  If someone intended that, they should have said so yes/no?\n\nPersonally i'd prefer my patch to sarowe's, because then the generated javadocs don't change depending on if/when the oracle URL is up.  In general I disagree with sarowe's comment that ignoring the warning would mean we \"attempt to do the right thing\" – because that implies that linking to the oracle.com URL is \"the right thing\" ... i think we should move away from that thinking.  In my opinion \"the right thing\" is to build our own docs and not make assumptions about external docs.  If the end user wants to build docs that hyperlink to oracle.com (or my.company.com/javadocs) that can be their choice, and if the URL is down and the linkage fails then the build.xml should fail to generate the docs because it couldn't do what the user asked it to.\n\nbut honestly: either patch is better then what we've got now. ",
            "author": "Hoss Man",
            "id": "comment-13156003"
        },
        {
            "date": "2011-11-23T18:28:27+0000",
            "content": "Hoss, whatever happened to LUCENE-3228 ? ",
            "author": "Steve Rowe",
            "id": "comment-13156034"
        },
        {
            "date": "2011-11-23T21:33:48+0000",
            "content": "+1 on the patch.  Javadoc external links should not destroy a build. ",
            "author": "Jason Rutherglen",
            "id": "comment-13156300"
        },
        {
            "date": "2011-12-03T22:03:36+0000",
            "content": "LUCENE-3228 addresses this issue by maintaining local copies of external package-list files. ",
            "author": "Steve Rowe",
            "id": "comment-13162220"
        }
    ]
}