{
    "id": "LUCENE-6880",
    "title": "Add document oriented collector for NRTSuggester",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "6.7",
            "7.0"
        ],
        "priority": "Major",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "Currently NRTSuggester collects completions iteratively as they are accepted by the TopNSearcher, implying that a document can be collected more than once. In case of indexing a completion with multiple context values, the completion leads to num_context paths in the underlying FST for the same docId and gets collected num_context times, when a query matches all its contexts. \n\nIdeally, a document-oriented collector will collect top N documents instead of top N completions by handling the docId deduplication while collecting the completions. This could be used to collect n unique documents that matched a completion query.",
    "attachments": {
        "LUCENE-6880.patch": "https://issues.apache.org/jira/secure/attachment/12770189/LUCENE-6880.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14986241",
            "author": "Areek Zillur",
            "date": "2015-11-02T23:13:05+0000",
            "content": "Initial patch:\n\n\tadds a document-oriented collector: TopSuggestionDocumentsCollector w/ tests\n\tadds TopSuggestsCollector collector to collect docs if docId deduplication is acceptable\n\n "
        },
        {
            "id": "comment-14987327",
            "author": "Michael McCandless",
            "date": "2015-11-03T14:16:34+0000",
            "content": "The javadoc for TopSuggestDocs.SuggestScoreDoc needs to be fixed (it implies there's only one key now).\n\nWhen a SuggestScoreDocs has multiple keys/contexts/scores, is there any implication to order?  Is it always sorted \"best to worst\" score?\n\nI wonder if instead of 3 parallel lists, we should just have a list of SuggestScoreDoc (as it is in trunk today) for each doc hit?  In fact, this is really like grouping?  Maybe it should be a TopGroups?\n\nIt should be \"fewer\" not \"less\" in here  : // This can still lead to collecting less paths then needed... "
        },
        {
            "id": "comment-15439093",
            "author": "Michael McCandless",
            "date": "2016-08-26T14:06:29+0000",
            "content": "Bulk move of still open issues from 6.2 to 6.3. "
        }
    ]
}