{
    "id": "LUCENE-7026",
    "title": "AnalyzingInfixSuggester doesn't support Phrase Queries for contexts",
    "details": {
        "resolution": "Cannot Reproduce",
        "affect_versions": "5.3.1",
        "components": [
            "core/index"
        ],
        "labels": "",
        "fix_versions": [],
        "priority": "Major",
        "status": "Resolved",
        "type": "Bug"
    },
    "description": "AnalyzingInfixSuggester uses Term Queries for filtering out the contexts. If the StandardAnalyzer is used while indexing , since all the contexts are stored as StringField and analyzed , spaces in them  are removed and words converted to tokens. So contexts having spaces in their terms can't be queried , And we also can't pass a PhraseQuery as a BooleanQuery to lookup() since Phrase Queries won't work on string fields where positions of tokens are not stored. \n\nOption left is to use a different analyzer while indexing \n\nAnalyzing Infix Suggester should store contexts as TextField instead of StringField so they can be queried.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15144368",
            "author": "Michael McCandless",
            "date": "2016-02-12T10:22:51+0000",
            "content": "Hmm, the contexts are indexed using StringField, which does not tokenize?\n\nSo I'm confused why you are seeing analysis being applied to the contexts field. "
        },
        {
            "id": "comment-15146627",
            "author": "Kamaldeep Singh",
            "date": "2016-02-14T16:11:28+0000",
            "content": "Michael McCandless thanks for your reply. I think we do specify the analyzer while doc creation - https://github.com/apache/lucene-solr/blob/master/lucene/core/src/java/org/apache/lucene/index/DocumentsWriterPerThread.java#L220 . I will recheck this . The lookup() for context having terms with spaces is not working for us . ( using StandardAnalyzer)  "
        },
        {
            "id": "comment-15147162",
            "author": "Michael McCandless",
            "date": "2016-02-15T10:11:47+0000",
            "content": "Are you sharing your own index with the index that AnalyzingInfixSuggester creates?  I.e. are you indexing your own context fields directly using your own IndexWriter?\n\nYou are not supposed to do that.  Instead, give AnalyzingInfixSuggester its own private index and let it do all indexing into that. "
        }
    ]
}