{
    "id": "LUCENE-7696",
    "title": "Remove ancient projects from the dist area",
    "details": {
        "labels": "",
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None",
        "status": "Open",
        "type": "Task",
        "components": [
            "general/website"
        ],
        "fix_versions": []
    },
    "description": "In http://www.apache.org/dist/lucene/ we have these folders:\n\n[DIR] java/                   2017-02-14 08:33    -   \n[DIR] mahout/                 2015-02-17 20:27    -   \n[DIR] nutch/                  2015-02-17 20:29    -   \n[DIR] pylucene/               2017-02-13 22:00    -   \n[DIR] solr/                   2017-02-14 08:33    -   \n[DIR] tika/                   2015-02-17 20:29    -   \n[   ] KEYS                    2016-08-30 09:59  148K  \n\n\n\nNobody will expect to find mahout, nutch and tika here anymore, and they are only redirect links, so why not clean up?\n\nRegarding the archive, we'll keep all historic releases as is but ask Nutch if they want to either copy the oldest releases to their archive or provide a link to the lucene/nutch archive for the oldest releases. Tika already have such a link, and hadoop already has a complete set of artifacts in their main repo.",
    "attachments": {
        "LUCENE-7696.patch": "https://issues.apache.org/jira/secure/attachment/12855374/LUCENE-7696.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15867877",
            "date": "2017-02-15T14:01:51+0000",
            "content": "One clear reason to move stuff over is that Nutch and Tika do not point to the earliest releases in lucene from their download pages at all, so their history is not complete. ",
            "author": "Jan Høydahl"
        },
        {
            "id": "comment-15867878",
            "date": "2017-02-15T14:03:08+0000",
            "content": "+1 for your plan, Jan, thanks. ",
            "author": "Steve Rowe"
        },
        {
            "id": "comment-15868652",
            "date": "2017-02-15T22:05:12+0000",
            "content": "Important to note that the mirrors and the main Apache dist site http://www.apache.org/dist/lucene/ have a .htaccess redirect for mahout, nutch and tika, and do not contain hadoop at all. So it is only those that dig for archived versions inside dist/lucene that will ever land here, no route from the TLP sites...\n\nThe Hadoop TLP issue is https://issues.apache.org/jira/browse/INFRA-1477\nThe Mahout TLP issue is https://issues.apache.org/jira/browse/INFRA-2643\nThe Tika TLP issue is https://issues.apache.org/jira/browse/INFRA-2692 but it does not mention archives\nThe Nutch TLP issue is https://issues.apache.org/jira/browse/INFRA-2693, no discussion about archives\n\nSuggest I start by sending an email to dev@tika (DONE), then see what they say before we tackle the other projects. ",
            "author": "Jan Høydahl"
        },
        {
            "id": "comment-15876431",
            "date": "2017-02-21T18:25:12+0000",
            "content": "The archive is, by design, suppose to be a permanent archive of everything ever released, at the path where it was released.  I'm not sure if we (lucene) even have a mechanism to remove things from it – pretty sure only infra has that power?\n\n(Not saying cleanup wouldn't be nice, just saying i don't think there's much we can do about it other then filing an INFRA request) ",
            "author": "Hoss Man"
        },
        {
            "id": "comment-15879215",
            "date": "2017-02-22T20:56:50+0000",
            "content": "Yea, looks like the archive normally stays as-is, and that's fine I guess, People only go there if they explicitly look for old versions. For the archive I'll follow-up with Nutch to ask if they want to write a few words on their download site about the oldest releases being found in the lucene area.\n\nI'll rewrite the issue description to focus on the dist area and the mirrors that people normally see, e.g. http://www.apache.org/dist/lucene/\nHere, hadoop is no longer there, but mahout, nutch and tika folders are .htaccess redirects. Assuming these are no longer needed, I plan to remove them. ",
            "author": "Jan Høydahl"
        },
        {
            "id": "comment-15890245",
            "date": "2017-03-01T14:20:23+0000",
            "content": "Attaching a patch against https://dist.apache.org/repos/dist/release/lucene/ which removes the folders and .htaccess files for mahout, nutch and tika.\n\nThis will cause these folders to be gone from the mirrors, but remain as-is in the archive.\n\nAgree? ",
            "author": "Jan Høydahl"
        }
    ]
}