{
    "id": "LUCENE-1918",
    "title": "Adding empty ParallelReader indexes to an IndexWriter may cause ArrayIndexOutOfBoundsException or NoSuchElementException",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.4.1",
            "2.9"
        ],
        "affect_versions": "2.4.1,                                            2.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Hi,\nI recently stumbled upon this:\n\nIt is possible (and perfectly legal) to add empty indexes (IndexReaders) to an IndexWriter. However, when using ParallelReaders in this context, in two situations RuntimeExceptions may occur for no good reason.\n\nCondition 1:\nThe indexes within the ParallelReader are just empty.\n\nWhen adding them to the IndexWriter, we get a java.util.NoSuchElementException triggered by ParallelTermEnum's constructor. The reason for that is the TreeMap#firstKey() method which was assumed to return null if there is no entry (which is not true, apparently – it only returns null if the first key in the Map is null).\n\n\nCondition 2 (Assuming the aforementioned bug is fixed):\nThe indexes within the ParallelReader originally contained one or more fields with TermVectors, but all documents have been marked as deleted.\n\nWhen adding the indexes to the IndexWriter, we get a java.lang.ArrayIndexOutOfBoundsException triggered by TermVectorsWriter#addAllDocVectors. The reason here is that TermVectorsWriter assumes that if the index is marked to have TermVectors, at least one field actually exists for that. This unfortunately is not true, either.\n\nPatches and a testcase demonstrating the two bugs are provided.\n\nCheers,\nChristian",
    "attachments": {
        "LUCENE-1918.patch": "https://issues.apache.org/jira/secure/attachment/12419998/LUCENE-1918.patch",
        "ParallelReaderWithEmptyIndex-testcase.patch": "https://issues.apache.org/jira/secure/attachment/12419934/ParallelReaderWithEmptyIndex-testcase.patch",
        "ParallelReaderWithEmptyIndex.patch": "https://issues.apache.org/jira/secure/attachment/12419935/ParallelReaderWithEmptyIndex.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-09-17T21:25:00+0000",
            "content": "Testcase and bugfixes for trunk (should also be applicable to 2.4.1) ",
            "author": "Christian Kohlschütter",
            "id": "comment-12756798"
        },
        {
            "date": "2009-09-18T09:34:49+0000",
            "content": "Patch looks good!  Thanks Christian.  Good catches!\n\nI made minor changes to it – added CHANGES entry, fixed indentaiton, switched the test over to MockRAMDir (and closed them) and added checkIndex calls. ",
            "author": "Michael McCandless",
            "id": "comment-12757079"
        },
        {
            "date": "2009-09-18T09:35:09+0000",
            "content": "Mark, I think we should commit this for 2.9? ",
            "author": "Michael McCandless",
            "id": "comment-12757080"
        },
        {
            "date": "2009-09-18T10:28:33+0000",
            "content": "I have no problem with this. I think we need a new RC for sure because of LUCENE-1919, which is very tricky and it should be tested by public, who have for sure lot of old-styled TokenStreams. ",
            "author": "Uwe Schindler",
            "id": "comment-12757090"
        },
        {
            "date": "2009-09-18T11:48:21+0000",
            "content": "Agreed - we are now stuck with a new rc it sounds, so let's fix what we can.  ",
            "author": "Mark Miller",
            "id": "comment-12757125"
        },
        {
            "date": "2009-09-18T12:34:06+0000",
            "content": "Thanks Christian! ",
            "author": "Michael McCandless",
            "id": "comment-12757138"
        }
    ]
}