{
    "id": "LUCENE-8149",
    "title": "NRTCachingDirectory does not need to preemptively delete segment files and generate exceptions",
    "details": {
        "labels": "",
        "priority": "Minor",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Closed",
        "type": "Improvement",
        "components": [],
        "fix_versions": [
            "7.3"
        ]
    },
    "description": "Moving over here from SOLR-11892. After getting through my confusion I've found the following: NRTCachingDirectory.createOutput tries to delete segment files before creating them. We should at least add a bit of commentary as to what the pre-emptive delete is there for since on the surface it's not obvious.\n\ntry {\n  in.deleteFile(name);\n{{ } catch (IOException ioe) {}}\n  // This is fine: file may not exist\n{{ }}}\n\nIf I change to using MMapDirectory or NIOFSDirectory these exceptions are not thrown. What's special about NRTCachingDirectory that it needs this when two of the possible underlying FS implementations apparently do not? Or is this necessary for, say, Windows or file systems than the two I tried? Or is it some interaction between the RAM based segments and segments on disk?",
    "attachments": {
        "LUCENE-8149.patch": "https://issues.apache.org/jira/secure/attachment/12909103/LUCENE-8149.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16348144",
            "date": "2018-02-01T07:41:33+0000",
            "content": "I suspect NRTCachingDirectory is a bit outdated. Those deletes should not be necessary since we never overwrite files? Extensions of FSDirectory like MMapDirectory or NIOFSDirectory would actually fail in such a case due to the StandardOpenOption.CREATE_NEW flag. ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16349022",
            "date": "2018-02-01T18:05:25+0000",
            "content": "I'll be happy to just remove it and run the test suite and report back. I'm always reluctant to just take stuff out when I don't understand why it was put in in the first place, people don't put code in just for no reason.\n\nI'll try that Friday, tied up today. ",
            "author": "Erick Erickson"
        },
        {
            "id": "comment-16349708",
            "date": "2018-02-02T02:59:56+0000",
            "content": "FWIW, simply taking that code out passes all the test suite. What I have not tested is things like killing Solr while actively indexing and the like. I'll be able to do some of that ad-hoc type testing Friday.... ",
            "author": "Erick Erickson"
        },
        {
            "id": "comment-16351428",
            "date": "2018-02-03T16:06:16+0000",
            "content": "So here's what the patch looks like. All tests pass.\n\nAlso, based on Adrien's comment I decided to just go with it for a test. So over last night I ran a test that randomly killed one of 4 jvms while indexing on the theory that if the preemptive deletes were cleaning up after some kind of anomaly it might trigger and it was fine.\n\nI'll look this over to get a better understanding of the code, but are people OK with this approach?\n\n \n\n  ",
            "author": "Erick Erickson"
        },
        {
            "id": "comment-16352388",
            "date": "2018-02-05T13:41:31+0000",
            "content": "+1 ",
            "author": "Adrien Grand"
        },
        {
            "id": "comment-16352801",
            "date": "2018-02-05T19:22:58+0000",
            "content": "Commit 709c7f081245ed56aaa5e7176d8f44c7d3dcb1c4 in lucene-solr's branch refs/heads/branch_7x from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=709c7f0 ]\n\nLUCENE-8149: NRTCachingDirectory does not need to preemptively delete segment files and generate exceptions\n\n(cherry picked from commit 4bd4972) ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-16352805",
            "date": "2018-02-05T19:24:40+0000",
            "content": "Commit 4bd49726c1416a6146c9bbb86fdf4d7c2adc2b1c in lucene-solr's branch refs/heads/master from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4bd4972 ]\n\nLUCENE-8149: NRTCachingDirectory does not need to preemptively delete segment files and generate exceptions ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-16352810",
            "date": "2018-02-05T19:26:17+0000",
            "content": "Thanks Robert and Adrien! ",
            "author": "Erick Erickson"
        }
    ]
}