{
    "id": "LUCENE-1465",
    "title": "NearSpansOrdered.getPayload does not return the payload from the minimum match span",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "core/search"
        ],
        "type": "Bug",
        "fix_versions": [
            "2.4.1",
            "2.9"
        ],
        "affect_versions": "2.4",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "",
    "attachments": {
        "LUCENE-1465.patch": "https://issues.apache.org/jira/secure/attachment/12394451/LUCENE-1465.patch",
        "Test.java": "https://issues.apache.org/jira/secure/attachment/12395020/Test.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2008-11-21T21:45:40+0000",
            "content": "Fix + test ",
            "author": "Mark Miller",
            "id": "comment-12649809"
        },
        {
            "date": "2008-11-21T21:46:21+0000",
            "content": "See LUCENE-1001 for discussion of the bug. ",
            "author": "Mark Miller",
            "id": "comment-12649811"
        },
        {
            "date": "2008-11-24T19:33:19+0000",
            "content": "I plan on committing this soon. This is a real deal breaker if you are trying to use the new getPayload API with ordered nearspans.\n\nThe attached path has java 1.5 code in the test which I'll remove. ",
            "author": "Mark Miller",
            "id": "comment-12650290"
        },
        {
            "date": "2008-11-24T22:02:48+0000",
            "content": "Bah. Its even worse than that. Even after you get down to a min match, it might not meet the slop requirements! You have to load the payloads and then dump them if the slop is not met.\n\nI don't like all this extra payload loading. Come to think of it, if you don't use the getPayload, your still paying for it! I don't have  a way around it, but I don't like it. In this case, not only do you pay for loading, you also pay for loading the payloads of a bunch of possible matches that don't end up being a match!\n\nOver a large index with lots of hits, its a lot of payloads to load...\n\nI havn't thought about any of it at a high level, but I think this has to be addressed somehow...maybe you have to turn on payload collecting first, or it doesnt do it? We need something...\n\nbut until then, I think this still has to be fixed, and we are loading them one way or another now...might as well add a few more \"possible\" wrong loads (this last patch added a couple as well) to make the behavior correct - somewhat useless otherwise  ",
            "author": "Mark Miller",
            "id": "comment-12650349"
        },
        {
            "date": "2008-11-24T23:33:34+0000",
            "content": "That still wasn't quite right. A third test and a third fix. I am pretty sure this solves it, but my previous concerns still concern me. ",
            "author": "Mark Miller",
            "id": "comment-12650382"
        },
        {
            "date": "2008-11-25T23:40:12+0000",
            "content": "Thanks Jonathan and Greg! ",
            "author": "Mark Miller",
            "id": "comment-12650793"
        },
        {
            "date": "2008-12-01T14:16:00+0000",
            "content": "Hi\nIt seems that the fix does not cover the case where 2 terms are indexed at the same position.\nI attach a sample program illustrating the issue. Each 2 terms are indexed at the same position.\nBest regards,\nJonathan ",
            "author": "Jonathan Mamou",
            "id": "comment-12652010"
        },
        {
            "date": "2008-12-03T16:48:14+0000",
            "content": "Let's backport fix to 2.4 branch (for eventual 2.4.1). ",
            "author": "Michael McCandless",
            "id": "comment-12652852"
        },
        {
            "date": "2008-12-04T12:22:38+0000",
            "content": "Whats involved in a backport - just commit it to the 2.4 branch and thats all?\n\nLooks like I have to look into terms indexed at the same position first - I'll try to get to that soon.\n\n\n\tMark\n\n ",
            "author": "Mark Miller",
            "id": "comment-12653277"
        },
        {
            "date": "2008-12-04T13:13:54+0000",
            "content": "Whats involved in a backport - just commit it to the 2.4 branch and thats all? \n\nYup.  \"svn merge\" works well as long as the code hasn't diverged much, eg running this in a 2.4 branch checkout:\n\n\nsvn merge -r(N-1):N https://svn.apache.org/repos/asf/lucene/java/trunk\n\n\n\nwhere N was the revision committed to trunk. ",
            "author": "Michael McCandless",
            "id": "comment-12653292"
        },
        {
            "date": "2008-12-18T03:37:46+0000",
            "content": "This is an odd one Jonathan. Its actually for the unordered case (the others were for the ordered). I am not exactly clear on whats going on yet.\n\nWhen I look at the payloads coming back, it would seem we are get 0,7,7 when we should get 6,7,7. When I look at the offsets for the spans that I get the payloads from though - they appear correct. Its returning the payloads from the right offsets it seems, but somehow one of those payloads is from the term at position 0? Very odd. So when I debug in, it does indeed look like the first match happens at index 6...but the term offsets are start: 2147483647, end:-2147483648. What the heck? This is going to take some more time... ",
            "author": "Mark Miller",
            "id": "comment-12657662"
        },
        {
            "date": "2008-12-22T13:07:10+0000",
            "content": "Mark, I would expect to get 0,0,3,6,7,7 and not only 6,7,7. \n\nAs you wrote, \"a SpanAndQuery could easily be a SpanNearQuery if a huge distance was allowed.\" at http://www.gossamer-threads.com/lists/lucene/java-user/51983 ",
            "author": "Jonathan Mamou",
            "id": "comment-12658530"
        },
        {
            "date": "2008-12-22T13:11:46+0000",
            "content": "Hmmm...I think thats true, but thats for finding 'a hit' on a document, not for finding every possible sequence of spans that could cause hit. Spans work by finding a minimum match, not greedily finding every match (which is a different algorithm). ",
            "author": "Mark Miller",
            "id": "comment-12658531"
        },
        {
            "date": "2009-02-23T14:08:12+0000",
            "content": "This has been backported to 2.4 and is resolved. The unresolved dangling issue is a separate issue involving a different class, and is being tracked with LUCENE-1542. ",
            "author": "Mark Miller",
            "id": "comment-12675904"
        }
    ]
}