{
    "id": "LUCENE-5526",
    "title": "Forced merges",
    "details": {
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem",
        "components": [],
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": []
    },
    "description": "IndexWriter.forceMerge allows to force merges if the number of segments is higher than a configured limit. I would like to have the ability to also force a merge if there is a single segment in the directory. This is possible today by closing the IndexWriter, reopening with a custom merge policy such as UpgradeIndexMergePolicy, running a forceMerge and finally reopening again with the original merge policy but this is a bit impractical and if possible I would like to be able to do it without reopening the writer twice.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14086946",
            "author": "Uwe Schindler",
            "content": "How about adding MergePolicy as optional parameter to IndexWriterl#forceMerge(int, boolean, MergePolicy)\n\nWhen doing the forceMerge, IndexWriter will then use the given MergePolicy instead of the default (this can easily be separated). This would also not interfere with other merges going on.\n\nThe good thing: You could also start a forceMerge with UpgradeIndexMergePolicy and then proceed with normal indexing. Elasticssearch or Solr can use this to allow forced merges or upgrading all segments written with an older version, without reopening a new IndexWriter or doing crazy hacks in a custom wrapper merge policy.\n\nAnother cool use would be: We could remove forceMergeDeletes from IndexWriter and just implement that by wrapping the current mergePolicy with one that only selects segments with deletions on forceMerge()? By that all mergePolicies don't need to implement a specific logic for deletes, this can be done just in the wrapper only and would be identical in all merge policies. ",
            "date": "2014-08-05T23:02:59+0000"
        },
        {
            "id": "comment-14096888",
            "author": "Shai Erera",
            "content": "On LUCENE-5883 I moved MergePolicy to LiveIndexWriterConfig. This means that applications can now do this (to address this issue):\n\n\nwriter.getConfig().setMergePolicy(upgradeIndexMP);\nwriter.forceMerge(1);\nwriter.getConfig().setMergePolicy(origMP);\n\n\n\nI think that's acceptable and adding another API to IW is not needed. This is anyway not something that apps do on an hourly basis ... ",
            "date": "2014-08-14T11:46:34+0000"
        },
        {
            "id": "comment-14197939",
            "author": "Adrien Grand",
            "content": "Agreed, I guess this is not needed anymore since the merge policy can be changed on a live index. ",
            "date": "2014-11-05T09:03:42+0000"
        }
    ]
}