{
    "id": "LUCENE-643",
    "title": "Error when tried to index with IndexWriter on Luncene 2.0",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "2.0.0",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Dear Sir,\n\nI am getting the following runtime exception when I tried to integrate Lucene 2.0 with my java application. \n\nJava.lang.ExceptionInInitializerError:Java.lang.NullPointerException\nat org.apache.lucene.index.IndexWriter.addDocument(IndexWriter)\n\nI have identified that the exception occurs at execution of the following line of code which indexes a document.\n\nIndexWriter iwriter=new IndexWriter(directory,analyzer,true);\nwriter.addDocument(doc);\nwriter.close\n\nI have checked all objects like directory,doc and analayzer for null conditions but they all have specific values.  I have even tried to execute the sample code provided with the javadoc API documentation but in vain.\n\nAny kind of solutions (including pseudo codes) are welcome\n\nThanks in advance,\nSherin George",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2006-08-01T11:24:54+0000",
            "content": "Can you please provide more information?  Line numbers for the stack trace, the code used to setup.  A nice JUnit test that shows the error.\n\nThanks,\nGrant ",
            "author": "Grant Ingersoll",
            "id": "comment-12424828"
        },
        {
            "date": "2006-08-02T03:12:58+0000",
            "content": "also please bear in mind that if you are having dificulty getting somethign to work that you think should be fairly straight forward (like example code in a javadoc) your best bet for gettign help is to start be emailing your questions to hte java-user list.\n\na bug should only be opened once you have a high level of confidence that the problem you are experiencing is in fact a bug. ",
            "author": "Hoss Man",
            "id": "comment-12425105"
        },
        {
            "date": "2007-05-27T04:43:31+0000",
            "content": "I'm closing this because no further information have been provided about this problem for several months. ",
            "author": "Michael Busch",
            "id": "comment-12499384"
        }
    ]
}