{
    "id": "LUCENE-7457",
    "title": "Default doc values format should optimize for iterator access",
    "details": {
        "resolution": "Fixed",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "priority": "Blocker",
        "status": "Resolved",
        "type": "Improvement"
    },
    "description": "In LUCENE-7407 we switched doc values consumption from random access API to an iterator API, but nothing was done there to improve the codec.  We should do that here.\n\nAt a bare minimum we should fix the existing very-sparse case to be a true iterator, and not wrapped with the silly legacy wrappers.\n\nI think we should also increase the threshold (currently 1%?) when we switch from dense to sparse encoding.  This should fix LUCENE-7253, making merging of sparse doc values efficient (\"pay for what you use\").\n\nI'm sure there are many other things to explore to let codecs \"take advantage\" of the fact that they no longer need to offer random access to doc values.",
    "attachments": {
        "LUCENE-7457.patch": "https://issues.apache.org/jira/secure/attachment/12829908/LUCENE-7457.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15514128",
            "author": "Adrien Grand",
            "date": "2016-09-22T18:42:10+0000",
            "content": "Here is a patch implementing what Mike describes above as the bare minimum. I'm not sure it is worth spending too much time on this since we will probably want to build a new DV format that better takes advantage of the iterator-style API until 7.0 is released? "
        },
        {
            "id": "comment-15514530",
            "author": "Michael McCandless",
            "date": "2016-09-22T21:29:46+0000",
            "content": "Thanks Adrien Grand, this looks great!  Should we also increase the sparse threshold (currently 1%) when writing doc values?  Or we can wait for a followon issue... "
        },
        {
            "id": "comment-15515643",
            "author": "Adrien Grand",
            "date": "2016-09-23T07:10:41+0000",
            "content": "I don't mind increasing it to something like 10%. However I hope this will never be useful and we will write a DV format that better takes advantage of the iterator-style API before 7.0 is released? "
        },
        {
            "id": "comment-15515646",
            "author": "Adrien Grand",
            "date": "2016-09-23T07:12:08+0000",
            "content": "Something to be aware of when increasing it is that in the case that values require few bits (eg. an enum or a boolean field), the doc ids can quickly start to use significant disk space and could make doc values use more disk space than when they were densely encoded. "
        },
        {
            "id": "comment-15516680",
            "author": "Michael McCandless",
            "date": "2016-09-23T14:55:48+0000",
            "content": "OK let's leave it at 1% for this issue? "
        },
        {
            "id": "comment-15541777",
            "author": "ASF subversion and git services",
            "date": "2016-10-03T07:34:21+0000",
            "content": "Commit 2f88bc80c2c1afed975199adb3f340fcec8179aa in lucene-solr's branch refs/heads/master from Adrien Grand\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2f88bc8 ]\n\nLUCENE-7457: Make Lucene54DocValuesFormat's sparse case actually implement an iterator. "
        },
        {
            "id": "comment-15541786",
            "author": "Adrien Grand",
            "date": "2016-10-03T07:38:38+0000",
            "content": "+1 I'll consider bumping it on LUCENE-7463. "
        }
    ]
}