{
    "id": "LUCENE-5708",
    "title": "Remove IndexWriterConfig.clone",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [
            "core/index"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ]
    },
    "description": "We originally added this clone to allow a single IWC to be re-used against more than one IndexWriter, but I think this is a mis-feature: it adds complexity to hairy classes (merge policy/scheduler, DW thread pool, etc.), I think it's buggy today.\n\nI think we should just disallow sharing: you must make a new IWC for a new IndexWriter.",
    "attachments": {
        "LUCENE-5708.patch": "https://issues.apache.org/jira/secure/attachment/12646887/LUCENE-5708.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14009557",
            "author": "Michael McCandless",
            "content": "Initial patch, tests seem to pass.  IWC already detects if it's illegally re-used across more than one IW. ",
            "date": "2014-05-27T10:35:04+0000"
        },
        {
            "id": "comment-14009560",
            "author": "Michael McCandless",
            "content": "Woops, wrong patch ... this one should work. ",
            "date": "2014-05-27T10:45:52+0000"
        },
        {
            "id": "comment-14009722",
            "author": "Shai Erera",
            "content": "I think the way you fixed some tests that used clone is incorrect. You should at least call newIndexWriterConfig(random) w/ the same random and seed, so the exact IWC is created each time. At least, that's what these tests now rely on, even if they don't break. Otherwise, they just create a random IWC each time they open a writer, which is not the intention I believe. ",
            "date": "2014-05-27T14:44:15+0000"
        },
        {
            "id": "comment-14009824",
            "author": "Michael McCandless",
            "content": "Hmm which tests rely on using the same IWC?  I thought I was improving the tests by switching up the config... ",
            "date": "2014-05-27T15:48:29+0000"
        },
        {
            "id": "comment-14009930",
            "author": "Adrien Grand",
            "content": "I don't know about these tests that expect the same config but I'm +1 in general to remove all that cloning. It looks to me that we should be able to make some fields final now that we don't have a clone method anymore (eg. MergePolicy.writer)? ",
            "date": "2014-05-27T17:28:29+0000"
        },
        {
            "id": "comment-14009988",
            "author": "Shai Erera",
            "content": "Hmm which tests rely on using the same IWC?\n\nHmm ... I don't remember. All I remember is that while I worked on preventing sharing IWC between writers (LUCENE-4876), there were a bunch of tests that reused the IWC. I fixed them by simply cloning it, but I admit I didn't check if initializing a new IWC each time serves their purpose. I just assume that if so many tests did that, there ought to be a reason beyond just convenience, but I could be wrong.\n\nWhat I'm worried is that by not cloning Jenkins will trip (which is good!), or worse - that those tests will stop asserting what they asserted before. So I just wanted to point that out. If we're ready to take the risk, I'm fine with it, because eventually we're discussing tests here .. there's nothing functionally impossible from an app's perspective. ",
            "date": "2014-05-27T17:55:50+0000"
        },
        {
            "id": "comment-14011085",
            "author": "Simon Willnauer",
            "content": "part of the problem is that we holding IW state on MergePolicy and MergeScheduler. Both classes should get the IW passed to the relevant methods so we can share them across as many instances we want... ",
            "date": "2014-05-28T13:35:55+0000"
        },
        {
            "id": "comment-14013393",
            "author": "Michael McCandless",
            "content": "New patch, I think it's ready; I'll commit soon...\n\nIt looks to me that we should be able to make some fields final now that we don't have a clone method anymore\n\n+1, I fixed a few of these, and found a couple more \"implements Cloneable\" to remove.\n\n(eg. MergePolicy.writer)\n\nLooks like we'll remove IW as a field in MP/MS with LUCENE-5711. ",
            "date": "2014-05-30T07:47:52+0000"
        },
        {
            "id": "comment-14013408",
            "author": "ASF subversion and git services",
            "content": "Commit 1598489 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1598489 ]\n\nLUCENE-5708: remove IWC.clone ",
            "date": "2014-05-30T08:16:38+0000"
        },
        {
            "id": "comment-14013412",
            "author": "ASF subversion and git services",
            "content": "Commit 1598492 from Michael McCandless in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1598492 ]\n\nLUCENE-5708: remove IWC.clone ",
            "date": "2014-05-30T08:20:22+0000"
        },
        {
            "id": "comment-14013424",
            "author": "ASF subversion and git services",
            "content": "Commit 1598496 from Michael McCandless in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1598496 ]\n\nLUCENE-5708: fix test bug ",
            "date": "2014-05-30T08:43:16+0000"
        },
        {
            "id": "comment-14013426",
            "author": "ASF subversion and git services",
            "content": "Commit 1598497 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1598497 ]\n\nLUCENE-5708: fix test bug ",
            "date": "2014-05-30T08:43:42+0000"
        },
        {
            "id": "comment-14013434",
            "author": "ASF subversion and git services",
            "content": "Commit 1598502 from Michael McCandless in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1598502 ]\n\nLUCENE-5708: fix test bug ",
            "date": "2014-05-30T08:57:44+0000"
        },
        {
            "id": "comment-14013437",
            "author": "ASF subversion and git services",
            "content": "Commit 1598503 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1598503 ]\n\nLUCENE-5708: fix test bug ",
            "date": "2014-05-30T08:58:34+0000"
        },
        {
            "id": "comment-14013454",
            "author": "Robert Muir",
            "content": "Can we remove the \"fix test bugs\" commits and fix the true underlying issue?\n\nTests arent testing what they should, we need to fix the disease or back this change out. ",
            "date": "2014-05-30T09:27:54+0000"
        },
        {
            "id": "comment-14013459",
            "author": "Michael McCandless",
            "content": "Tests arent testing what they should, we need to fix the disease or back this change out.\n\nI'm happy to back this change out if you want.\n\nBut, I'm confused: are you talking about how these tests hardwire the PF to Lucene41?  I agree we should fix that, but this is a pre-existing issue. ",
            "date": "2014-05-30T09:33:31+0000"
        },
        {
            "id": "comment-14013477",
            "author": "Robert Muir",
            "content": "All these \"PostingsFormat\" tests wire their codec to themselves. This allows us to implement generic base classes with tests that all codecs should pass, as well as codec-specific tests (e.g. in lucene41) that test particular corner cases of importance.\n\nthis worked well in knocking out bugs for postings, so the whole scheme was duplicated to docvalues, storedfields, vectors, everything.\n\nNow here comes this commit, and these tests (which are important to ensure the index format is working) are no longer testing what they are supposed to. For example the tests in Lucene41 package explicitly test special cases of that codec that would otherwise be extraordinarily rare in the existing random tests. If they are executing against random codecs or even random configurations then they just became useless.\n\nSo thats why I'm concerned: I see this commit causing these failures, and I know we just experienced a significant loss of test coverage to the index format. We are relying upon tests to fail to detect this, but unfortunately 'loss of test coverage' doesn't always trigger a jenkins build.\n\nSo maybe instead of playing whack-a-mole with jenkins tests failures, we should pay more attention reviewing all changes to unit tests where clone() was previously used. The patch is buggy here, and I just want to ensure its taken seriously so that we do not lose coverage ",
            "date": "2014-05-30T09:57:16+0000"
        },
        {
            "id": "comment-14013498",
            "author": "Michael McCandless",
            "content": "I agree that the distinction of \"randomly test this PF via the generic\nbase test class\" and the \"specifically test tricky corner cases for\nthis particular PF\" (e.g. TestBlockPostingsFormat/2/3.java) is\nimportant, and the specific IWC settings for those tests are\nnecessary.\n\nI reviewed all the test changes more closely, and found a couple other\nplaces that needed to carry over explicit IWC changes after pulling a\nrandom IWC (I'll commit shortly).\n\nI think this is net/net good vs the clone we had before: it means we\nare still randomly changing the things the test didn't care about, and\nfixing the settings that it does. ",
            "date": "2014-05-30T10:38:03+0000"
        },
        {
            "id": "comment-14013506",
            "author": "ASF subversion and git services",
            "content": "Commit 1598543 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1598543 ]\n\nLUCENE-5708: fix these tests to also 'mimic' previous IWC.clone ",
            "date": "2014-05-30T10:44:59+0000"
        },
        {
            "id": "comment-14013508",
            "author": "ASF subversion and git services",
            "content": "Commit 1598545 from Michael McCandless in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1598545 ]\n\nLUCENE-5708: fix these tests to also 'mimic' previous IWC.clone ",
            "date": "2014-05-30T10:47:11+0000"
        }
    ]
}