{
    "id": "LUCENE-4273",
    "title": "Fix DocsEnum freq flag consistent with DocsAndPositionsEnum flags",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Followup from LUCENE-4230\n\nCurrently today to pull freq() from a docsEnum, you have to pass a boolean 'needsFreqs=true'. If the field omitsTF, then it returns null (and you need to call it again, with 'needsFreqs=false', in which case you are not supposed to call freq().\n\nWe fixed this in D&PEnum in 4230: as you can tell from the fieldinfos whether they are there or not, there is no need to return null, it makes consumer code complicated.\n\nSo this issue is just to have docs(Bits, reuse) which calls docs(Bits, reuse, FLAG_FREQS) by default. if they arent there, the docsenum returns 1 for freq(). \n\nSo calling docs(Bits, reuse, 0) is just an optimization hint to the codec that you never need them (same as the payload/offset flags for docsAndPositions)",
    "attachments": {
        "LUCENE-4273.patch": "https://issues.apache.org/jira/secure/attachment/12538496/LUCENE-4273.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-31T12:07:12+0000",
            "content": "Patch looks great!\n\nI tweaked javadocs and fixed one NPE in DirectPostingsFormat ... I think it's ready. ",
            "author": "Michael McCandless",
            "id": "comment-13425695"
        },
        {
            "date": "2012-07-31T12:59:13+0000",
            "content": "Thanks Mike!\n\nUpdated patch with more fixes to checkindex. Actually there were several problems (leniency):\n\n\twe weren't validating sum of term frequencies against sumTotalTF in the case of DOCS_AND_FREQS\n\twe weren't validating sum of term frequencies against sumTotalTF in the case of term vectors (there is no way there yet to omit them).\n\twe weren't necessarily reading offsets from term vectors, because we were going by fieldinfos for the postings.\n\n ",
            "author": "Robert Muir",
            "id": "comment-13425736"
        }
    ]
}