{
    "id": "LUCENE-5188",
    "title": "Make CompressingStoredFieldsFormat more friendly to StoredFieldVisitors",
    "details": {
        "components": [],
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "affect_versions": "None",
        "priority": "Minor",
        "labels": "",
        "type": "Improvement",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The way CompressingStoredFieldsFormat works is that it first decompresses data and then consults the StoredFieldVisitor. This is a bit wasteful in case documents are big and only the first field of a document is of interest so maybe we could decompress and consult the StoredFieldVicitor in a more streaming fashion.",
    "attachments": {
        "LUCENE-5188.patch": "https://issues.apache.org/jira/secure/attachment/12601240/LUCENE-5188.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-09-03T21:00:13+0000",
            "content": "Here is a patch that slices large chunks (>= twice the configured chunk size) into several LZ4 blocks (of chunkSize bytes each). The LZ4 blocks will be decompressed as needed so that you don't end up decompressing everything if you only need the first field of your document.\n\nA nice side-effect of this patch is that it reduces memory pressure as well when working with big documents (LUCENE-4955): since big documents are sliced into fixed-size blocks, it is not needed anymore to allocate a byte[] of the size of the document (potentially several MB) to decompress it. ",
            "author": "Adrien Grand",
            "id": "comment-13757063"
        },
        {
            "date": "2013-09-03T21:37:42+0000",
            "content": "nice idea! ",
            "author": "Robert Muir",
            "id": "comment-13757111"
        },
        {
            "date": "2013-09-04T08:57:01+0000",
            "content": "I will commit later today if there is no objection. ",
            "author": "Adrien Grand",
            "id": "comment-13757570"
        },
        {
            "date": "2013-09-04T10:34:27+0000",
            "content": "cool stuff adrien!\nOne thing I wonder is if we should use a specialized DataInput maybe SkippableDataInput in that class to prevent the static method. That shared byte array worries me. Aside of this, I wonder if we had this method in DataInput or however we gonna do this would it be possible to skip an entire decompression step if we know that the amount of bytes we skip is larger than one or more decompression blocks. I have to admit I don't exactly know how this works and if what I propose is possible but that would help me to better understand why we need to read all the data and decompress if we trash it anyway. ",
            "author": "Simon Willnauer",
            "id": "comment-13757635"
        },
        {
            "date": "2013-09-04T10:43:46+0000",
            "content": "These bytes can be shared because they are write-only, kind of like /dev/null. Having this on DataInput to be able to skip an entire decompression would be nice but unfortunately with the current design, the field numbers are stored in the compressed stream, so you need to decompress anyway to know whether you should skip (StoredFieldVisitor allows to skip based on the FieldInfo, that my StoredFieldReader computes from the field number). But your idea is something I would like to explore for the next StoredFieldsFormat, along with preset dictionaries. ",
            "author": "Adrien Grand",
            "id": "comment-13757641"
        },
        {
            "date": "2013-09-04T11:18:39+0000",
            "content": "thanks adrien for elaborating... progress over perfection so lets move on here. +1 to commit ",
            "author": "Simon Willnauer",
            "id": "comment-13757666"
        },
        {
            "date": "2013-09-04T14:00:35+0000",
            "content": "Commit 1520025 from Adrien Grand in branch 'dev/trunk'\n[ https://svn.apache.org/r1520025 ]\n\nLUCENE-5188: Make CompressingStoredFieldsFormat more friendly to StoredFieldVisitors. ",
            "author": "ASF subversion and git services",
            "id": "comment-13757789"
        },
        {
            "date": "2013-09-05T10:55:07+0000",
            "content": "Commit 1520278 from Adrien Grand in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1520278 ]\n\nLUCENE-5188: Make CompressingStoredFieldsFormat more friendly to StoredFieldVisitors. ",
            "author": "ASF subversion and git services",
            "id": "comment-13758977"
        },
        {
            "date": "2013-10-05T10:19:24+0000",
            "content": "4.5 release -> bulk close ",
            "author": "Adrien Grand",
            "id": "comment-13787137"
        }
    ]
}