{
    "id": "LUCENE-3380",
    "title": "enable FileSwitchDirectory randomly in tests and fix compound-file/NoSuchDirectoryException bugs",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Looks like FileSwitchDirectory has the same bugs in it as LUCENE-3374.\n\nWe should randomly enable this guy in tests and flush them all out the same way.",
    "attachments": {
        "LUCENE-3380.patch": "https://issues.apache.org/jira/secure/attachment/12490816/LUCENE-3380.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2011-08-18T07:30:34+0000",
            "content": "I assume the bugs in FileSwitchDirectory are the same NotExists Exceptions thrown \n\nWe should maybe also add FileSwitchDirectory to the list of random directories. It could create two random directories (using LTC.newDirectory(false) 2 times with a suffix on the dir name like \".1\" and \".2\") and combine them with a FileSwitchDirectory. The Set<String> of extensions could be a random list of extensions from the IndexFileNames collection. ",
            "author": "Uwe Schindler",
            "id": "comment-13086858"
        },
        {
            "date": "2011-08-18T08:05:52+0000",
            "content": "no, there are problems involving compoundfilewriter as well! ",
            "author": "Robert Muir",
            "id": "comment-13086870"
        },
        {
            "date": "2011-08-18T08:16:03+0000",
            "content": "the compound file directory can be thought of easily:\nImagine FileSwitchDirectory (F) which contains two directories (A and B)\nand in the configuration, \"cfs\" files go to A, everything else to B.\n\nso currently it calls F.createCompoundOutput(\"xxxx.cfs\") which delegates to A.createCompoundOutput(\"xxxx.cfs\") ->> CompoundFileWriter(A, \"xxxx.cfs\"), which then, new since LUCENE-3218, will create a.createOutput(\"xxxx.cfe\")\n\nThe problem is that this cfe file is created under the wrong directory, and you will get FNFE.\n\nWe can use the solution I provided in  LUCENE-3374, but seriously maybe we should rethink LUCENE-3218 before releasing, because this could break similar delegators and basically they will experience what is like index corruption. ",
            "author": "Robert Muir",
            "id": "comment-13086872"
        },
        {
            "date": "2011-08-18T09:04:04+0000",
            "content": "In my opinion, the createCompoundOutput/Input should get both files then the directory can wrap correctly. Maybe the underlying CFWriter/Reader should only get 2 IndexInput/Output, no filenames, so the delegation can completely done in the directory. ",
            "author": "Uwe Schindler",
            "id": "comment-13086900"
        },
        {
            "date": "2011-08-18T09:10:28+0000",
            "content": "I think so too, this means that the createCompoundInput for example is going to have to read the version header and deal with the backwards case where there is no CFE file, but we can create a utility for this. ",
            "author": "Robert Muir",
            "id": "comment-13086906"
        },
        {
            "date": "2011-08-18T09:44:22+0000",
            "content": "and thinking about it more, that makes this approach hard too, because how would the delegation work?\n\nan alternative is for both these dirs (NRTCachingDIr/FileSwitchDIr) to implement special CompoundFileDirectories, or maybe we make a DelegatingCompoundFileDirectory even that they share, but this still doesn't solve the root problem: that its going to be even more confusing for the future and potentially a problem for any custom directories out there. ",
            "author": "Robert Muir",
            "id": "comment-13086917"
        },
        {
            "date": "2011-08-18T16:34:28+0000",
            "content": "here's a patch with tests for the problems, and bugfixes.\n\nI didn't enable it randomly yet as thats more complicated and first I want to get these bugs fixed in trunk/branch. ",
            "author": "Robert Muir",
            "id": "comment-13087105"
        },
        {
            "date": "2013-07-23T18:44:49+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 ",
            "author": "Steve Rowe",
            "id": "comment-13717069"
        },
        {
            "date": "2014-04-16T12:54:26+0000",
            "content": "Move issue to Lucene 4.9. ",
            "author": "Uwe Schindler",
            "id": "comment-13970752"
        }
    ]
}