{
    "id": "LUCENE-4255",
    "title": "clean up analysis factory exception handling",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I don't like wrapping everything in the InitializationException, or that inform() gets a resourceloader (whose methods throw IOExceptions), but every analysis factory that implements this then needs to wrap the IOExceptions as something else.\n\nI think its way more intuitive to use IllegalArgumentException in init(args), and change inform() to throw IOException.",
    "attachments": {
        "LUCENE-4255.patch": "https://issues.apache.org/jira/secure/attachment/12537886/LUCENE-4255.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-07-26T01:01:09+0000",
            "content": "I originally added InitializationException as a way to have consistent Exceptions thrown since some Factories threw IAEs, others through SolrExceptions, others just generic RuntimeExceptions.  If we're going to consistently use IAEs, I'm all for it +1 ",
            "author": "Chris Male",
            "id": "comment-13422788"
        },
        {
            "date": "2012-07-26T01:09:14+0000",
            "content": "Yes: I think the original solution was fine as an intermediate step.\n\nBut I think its better to do like this patch:\n\n\tinit(args) <-- this is doing argument processing, if they are illegal, throw IllegalAgumentException \n\tinform(ResourceLoader) <-- this is loading resources, so I added throws IOException: don't wrap it, just throw it.\n\tcreate() <-- if there is some error here, its happening at runtime so it throws RuntimeException.\n\n\n\nI think this at least makes logical sense: the latter case we should really try to harden these factories\nagainst to detect earlier in init/inform (in other issues), because its expensive to the user to not know \ntheir configuration is wrong until indexing documents or processing queries.\n\nSo I think this patch is ready, unless you see any problems? ",
            "author": "Robert Muir",
            "id": "comment-13422796"
        },
        {
            "date": "2012-07-26T01:20:45+0000",
            "content": "Yup it's good! +1 ",
            "author": "Chris Male",
            "id": "comment-13422803"
        }
    ]
}