{
    "id": "LUCENE-2510",
    "title": "migrate solr analysis factories to analyzers module",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/analysis"
        ],
        "type": "Task",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "affect_versions": "4.0-ALPHA",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In LUCENE-2413 all TokenStreams were consolidated into the analyzers module.\n\nThis is a good step, but I think the next step is to put the Solr factories into the analyzers module, too.\n\nThis would make analyzers artifacts plugins to both lucene and solr, with benefits such as:\n\n\tusers could use the old analyzers module with solr, too. This is a good step to use real library versions instead of Version for backwards compat.\n\tanalyzers modules such as smartcn and icu, that aren't currently available to solr users due to large file sizes or dependencies, would be simple optional plugins to solr and easily available to users that want them.\n\n\n\nRough sketch in this thread: http://www.lucidimagination.com/search/document/3465a0e55ba94d58/solr_and_analyzers_module\n\nPractically, I havent looked much and don't really have a plan for how this will work yet, so ideas are very welcome.",
    "attachments": {
        "LUCENE-2510-simplify-tests.patch": "https://issues.apache.org/jira/secure/attachment/12526151/LUCENE-2510-simplify-tests.patch",
        "LUCENE-2510-multitermcomponent.patch": "https://issues.apache.org/jira/secure/attachment/12525946/LUCENE-2510-multitermcomponent.patch",
        "LUCENE-2510-parent-classes.patch": "https://issues.apache.org/jira/secure/attachment/12525037/LUCENE-2510-parent-classes.patch",
        "LUCENE-2510-resourceloader-bw.patch": "https://issues.apache.org/jira/secure/attachment/12525249/LUCENE-2510-resourceloader-bw.patch",
        "LUCENE-2510.patch": "https://issues.apache.org/jira/secure/attachment/12522373/LUCENE-2510.patch",
        "LUCENE-2510-movefactories.sh": "https://issues.apache.org/jira/secure/attachment/12526108/LUCENE-2510-movefactories.sh"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-06-23T13:18:57+0000",
            "content": "+1 to this idea.\n\nFrom my perspective the only issue is loading resources used in the factories, which in Solr is currently handled through the SolrResourceLoader.  My suggestion for this is to migrate Solr's ResourceLoader interface, and maybe provide simple FileResourceLoader and ClassPathResourceLoaders that Lucene users can use. ",
            "author": "Chris Male",
            "id": "comment-12881685"
        },
        {
            "date": "2010-06-23T13:35:04+0000",
            "content": "Chris, yes I think at a glance this is where I got stuck \n\nRelated to this, there is duplication in resource loading code already that would be nice to clean up.\n\nFor example, Lucene and Solr have their own separate stopword-loading code etc. But I don't really like some of the things Lucene's WordListLoader does:\n\n\tThe lucene WordListLoader builds HashMaps and HashSets but this is wasteful since these are always then copied to CharArraySet/Maps... Solr's just builds CharArraySet/Map up front.\n\tthe Solr file loading code has some features like trying to guess the size of the set/map up front for faster loading.\n\tthe Solr stopword loading code is more user-friendly as it ignores BOM markers etc.\n\n\n\nI think it would be good to only have one piece of code for this functionality and for it to be optimal. ",
            "author": "Robert Muir",
            "id": "comment-12881692"
        },
        {
            "date": "2010-06-23T13:44:31+0000",
            "content": "I think if we consolidate how to load resources, then we can easily reduce the loading of word lists to a single optimal way. ",
            "author": "Chris Male",
            "id": "comment-12881694"
        },
        {
            "date": "2010-12-05T04:30:56+0000",
            "content": "Heres a few things I think we should do as part of this work:\n\n\n\tConvert the factories to beans.  This will make the properties that a Factory has a great deal clearer as it won't be necessary to initialize the Factory using a Map.  It'll also increase their testability.  Part of this will require changing how Solr initializes the Factories from its XML configuration.  The simplist way is to change the attribute names in the configuration to match the bean property.\n\n\n\n\n\tEither move the ResourceLoader interface to Lucene, or do some fancy property injection just in Solr and remove ResourceLoading from factories.  The former option means Lucene, Solr and any future modules can all use a single consist interface for resource loading.  But it may also introduce something which isn't Lucene's responsibility.  The latter would involve the factories having List<String> properties for example, and Solr detecting this and injecting the list from its own ResourceLoader.  It introduces more complexity into Solr, but presents a very clean interface in the Factory which increases its readability, testability, and makes them more programmatically friendly.\n\n ",
            "author": "Chris Male",
            "id": "comment-12966896"
        },
        {
            "date": "2012-04-12T03:38:54+0000",
            "content": "I'm getting this issue back online.\n\nFirst step, moving ResourceLoader/Aware into the analysis module.  I can imagine later on different implementations of ResourceLoader which maybe just uses the Classpath or something.\n\nCommand for patch:\n\n\nsvn mv solr/solrj/src/java/org/apache/solr/common/ResourceLoader.java modules/analysis/common/src/java/org/apache/lucene/analysis/util/ResourceLoader.java\nsvn mv solr/core/src/java/org/apache/solr/util/plugin/ResourceLoaderAware.java modules/analysis/common/src/java/org/apache/lucene/analysis/util/ResourceLoaderAware.java\n\n ",
            "author": "Chris Male",
            "id": "comment-13252165"
        },
        {
            "date": "2012-04-12T03:46:31+0000",
            "content": "Hmm looking at this ResourceLoader, what is the purpose of the newInstance method?\n\nIt seems to be unrelated to the 'resource loading', i think it should be something else?\n\nSeparately, do we have any vague idea of a plan of how WordListLoader can implement this interface?\nI don't think we have to do that immediately to proceed, but long term I think it would make sense,\nsince currently we have some duplicate code between lucene and solr here:\n\n\ttake a look at wordlistloader\n\ttake a look at the protected methods in BaseTokenStreamFactory.\n\n ",
            "author": "Robert Muir",
            "id": "comment-13252172"
        },
        {
            "date": "2012-04-12T04:02:19+0000",
            "content": "what is the purpose of the newInstance method?\n\nIf you take a look at org.apache.solr.analysis.DelimitedPayloadTokenFilterFactory you'll see an example of how it's used.\n\nLooking at the implementation in SolrResourceLoader, it seems to facilitate two things:\n\n\n\tThe use of simplified solr.* package names\n\tIn FSTSynonymFilterFactory for example, newInstance is used to load other components.  Consequently SolrResourceLoader adds the instantiated classes to its tracking of SolrCoreAware, ResourceLoaderAware, etc.\n\n\n\nWith all that said, its only used in 3 Factories (but a lot of other Solr code).  Perhaps we can break it out somehow.\n\nSeparately, do we have any vague idea of a plan of how WordListLoader can implement this interface?\n\nI don't at this stage, but you're right, there is duplication.  Off the top of my head I think we'd want to move everything over to using ResourceLoader, but somehow incorporate the WordlistLoader logic somewhere. ",
            "author": "Chris Male",
            "id": "comment-13252179"
        },
        {
            "date": "2012-04-12T04:35:59+0000",
            "content": "\nWith all that said, its only used in 3 Factories (but a lot of other Solr code). Perhaps we can break it out somehow.\n\nI guess my main problem with it is the generics (it returns Object).\nSeems like the generics could be fixed so its parameterized to return ? extends X.\nIf we add generics violations to the analyzers module, Uwe will not be happy \n\n\nI don't at this stage, but you're right, there is duplication. Off the top of my head I think we'd want to move everything over to using ResourceLoader, but somehow incorporate the WordlistLoader logic somewhere.\n\nRight I was just thinking really this stuff should be mostly in one place. I think\nits a little better now but there is some stuff in both places. I guess I can let\nthat go, but it would be cool to have some sort of plan here, and if we don't tackle\nit, at least open up a followup issue since we are talking about an interface here:\nwe won't be able to easy fix it without hard API breaks if we need.\n\nDon't get me wrong: when interfaces are the right choice, we should use them without fear! \nI think we just need to be extra careful up-front since we really should not break\nthem across minor releases. ",
            "author": "Robert Muir",
            "id": "comment-13252191"
        },
        {
            "date": "2012-04-12T04:44:48+0000",
            "content": "\nI guess my main problem with it is the generics (it returns Object).\nSeems like the generics could be fixed so its parameterized to return ? extends X.\nIf we add generics violations to the analyzers module, Uwe will not be happy \n\n+1\n\nI thought along the same lines so we can definitely clean it up.  Wouldn't want to get a ticket from the policeman.\n\n\nRight I was just thinking really this stuff should be mostly in one place. I think\nits a little better now but there is some stuff in both places. I guess I can let\nthat go, but it would be cool to have some sort of plan here, and if we don't tackle\nit, at least open up a followup issue since we are talking about an interface here:\nwe won't be able to easy fix it without hard API breaks if we need.\n\nI'll think on it a bit and see if anybody else has any opinions.  I agree that we need to be extra careful here. ",
            "author": "Chris Male",
            "id": "comment-13252194"
        },
        {
            "date": "2012-04-17T02:21:48+0000",
            "content": "Patch updated to trunk.\n\nI'm going to commit this shortly and then tackle the factories themselves. ",
            "author": "Chris Male",
            "id": "comment-13255260"
        },
        {
            "date": "2012-04-17T02:26:55+0000",
            "content": "Err... patch is broke, will fix. ",
            "author": "Chris Male",
            "id": "comment-13255261"
        },
        {
            "date": "2012-04-17T02:30:39+0000",
            "content": "Actually it works, just needed to rebuild analysis/common. ",
            "author": "Chris Male",
            "id": "comment-13255262"
        },
        {
            "date": "2012-04-30T01:11:03+0000",
            "content": "Updated patch for moving ResourceLoader/Aware with a new command:\n\n\nsvn mv solr/solrj/src/java/org/apache/solr/common/ResourceLoader.java lucene/analysis/common/src/java/org/apache/lucene/analysis/util/ResourceLoader.java\nsvn mv solr/core/src/java/org/apache/solr/util/plugin/ResourceLoaderAware.java lucene/analysis/common/src/java/org/apache/lucene/analysis/util/ResourceLoaderAware.java\n\n\n\nI'm going to commit this and then start moving the Factory classes incrementally. ",
            "author": "Chris Male",
            "id": "comment-13264656"
        },
        {
            "date": "2012-04-30T03:21:23+0000",
            "content": "Patch which moves the Factory interfaces and base implementations (and some associated classes).  \n\nCommand:\n\n\nsvn mkdir lucene/analysis/common/src/java/org/apache/lucene/analysis/factory\nsvn mv solr/core/src/java/org/apache/solr/analysis/BaseCharFilterFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/BaseCharFilterFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/BaseTokenFilterFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/BaseTokenFilterFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/BaseTokenizerFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/BaseTokenizerFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/BaseTokenStreamFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/BaseTokenStreamFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/CharFilterFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/CharFilterFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/MultiTermAwareComponent.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/MultiTermAwareComponent.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/TokenFilterFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/TokenFilterFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/TokenizerFactory.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/TokenizerFactory.java\nsvn mv solr/core/src/java/org/apache/solr/analysis/InitializationException.java lucene/analysis/common/src/java/org/apache/lucene/analysis/factory/InitializationException.java\n\n\n\nA big TODO after all this moving is to collapse the base implementations into a single BaseAnalysisFactory class and get rid of FactoryUtils.\n\nTests pass. ",
            "author": "Chris Male",
            "id": "comment-13264665"
        },
        {
            "date": "2012-04-30T03:22:22+0000",
            "content": "Need to also fix the relationship between the Solr uima contrib and analyzers-common in appropriate configuration files too. ",
            "author": "Chris Male",
            "id": "comment-13264666"
        },
        {
            "date": "2012-05-02T01:20:56+0000",
            "content": "Actually I think I've been a little naive with backwards compatibility here.  I think I need to ensure that any user created Factory implementations continue to work and existing schemas continue to load.  Otherwise upgrading to Solr 4 is going to be an epic hassle. ",
            "author": "Chris Male",
            "id": "comment-13266280"
        },
        {
            "date": "2012-05-02T02:10:41+0000",
            "content": "Patch which does some backwards compat work for ResourceLoader/Aware.  \n\nDeprecated versions of both are added in their old locations and they extend from those in the new locations.  SolrResourceLoader implements the deprecated ResourceLoader so it can continue to be used with Factories expecting the old ResourceLoader.  It also includes a check for plugins using the old ResourceLoaderAware and logs a warning recommending that they are upgraded. ",
            "author": "Chris Male",
            "id": "comment-13266295"
        },
        {
            "date": "2012-05-04T14:54:53+0000",
            "content": "Chris, before the changes made here, solrj did not have a dependency on lucene-core, but now it does.  Is it possible to move the dependency to solr-core?\n\nThe Maven build failed today because of this <https://builds.apache.org/job/Lucene-Solr-Maven-trunk/476/consoleText>:\n\n\n[INFO] Error for project: Apache Solr Solrj (during install)\n[INFO] ------------------------------------------------------------------------\n[INFO] Compilation failure\n/usr/home/hudson/hudson-slave/workspace/Lucene-Solr-Maven-trunk/checkout/solr/solrj/src/java/org/apache/solr/common/ResourceLoader.java:[25,71] package org.apache.lucene.analysis.util does not exist\n\nThe short-term fix for the Maven build would be just adding a lucene-core dependency to the solrj POM. ",
            "author": "Steve Rowe",
            "id": "comment-13268413"
        },
        {
            "date": "2012-05-04T15:08:39+0000",
            "content": "before the changes made here, solrj did not have a dependency on lucene-core, but now it does\nUgh... can we avoid this extra dependency?  SolrJ is just a client and is not supposed to depend on lucene or solr core. ",
            "author": "Yonik Seeley",
            "id": "comment-13268424"
        },
        {
            "date": "2012-05-04T17:40:30+0000",
            "content": "The only reason solrj has that dependency is for the deprecated interface:\n\npublic interface ResourceLoader extends org.apache.lucene.analysis.util.ResourceLoader \n\n\n\nI vote we just drop ResourceLoader from the solrj client API at 4.0 rather then 5.0\n\nalternatively, we could put the deprecated interface in solr-core, but that makes a mess of OSGI bundles (i think) ",
            "author": "Ryan McKinley",
            "id": "comment-13268565"
        },
        {
            "date": "2012-05-05T00:31:24+0000",
            "content": "Ah sorry guys, I went to a lot of effort to avoid this dependency, then went and added it myself.  \n\nI still think just dropping the interface at this stage is going to make upgrading to Solr 4 a hassle so I think the best option is to move the interface into solr-core under the same package name.  I don't see why that would hurt OSGI? ",
            "author": "Chris Male",
            "id": "comment-13268825"
        },
        {
            "date": "2012-05-05T00:42:26+0000",
            "content": "Tests pass so I've moved it into solr-core to remove this dependency issue.  If there is some problem related to OSGI, we can then decide if we really do want to drop the interface at this stage. ",
            "author": "Chris Male",
            "id": "comment-13268827"
        },
        {
            "date": "2012-05-05T00:55:44+0000",
            "content": "I don't see why that would hurt OSGI\n\nI think OSGI gets upset when you have different .jar files have classes in the same package – I don't really know or care though.\n\n------\n\nShouldn't SolrResourceLoader depend on org.apache.lucene.analysis.util.ResourceLoader rather then the deprecated one? ",
            "author": "Ryan McKinley",
            "id": "comment-13268830"
        },
        {
            "date": "2012-05-05T01:11:35+0000",
            "content": "Shouldn't SolrResourceLoader depend on org.apache.lucene.analysis.util.ResourceLoader rather then the deprecated one?\n\nNo, that would prevent SolrResourceLoader from being able to be used with classes that still use the deprecated ResourceLoader.  This way an analysis Factory which relies on the deprecated ResourceLoader can be loaded into Solr 4 without error. ",
            "author": "Chris Male",
            "id": "comment-13268841"
        },
        {
            "date": "2012-05-07T11:19:28+0000",
            "content": "New massive patch for handling the Base parent classes and interfaces.\n\nOriginally I wanted to remove the Base parent classes but I think they'll be useful for validation and any future backwards compat logic.\n\nFocus is on bw compat here, so nothing is removed (except InitializationException which I only added recently), only deprecated. ",
            "author": "Chris Male",
            "id": "comment-13269533"
        },
        {
            "date": "2012-05-07T11:29:18+0000",
            "content": "I dont think back compat is really important?\n\nNo ones code is going to work without changes for 4.0 anyway... \nI dont think we should add a bunch of dead weight classes for no reason.\n\nIf we remove these, then do we need a .factories package? Cant we just \nput these couple classes in .util?  ",
            "author": "Robert Muir",
            "id": "comment-13269534"
        },
        {
            "date": "2012-05-07T11:34:06+0000",
            "content": "I think the interfaces are also unnecessary. Why not something like:\n\n\n\tAnalysisFactory (has init(Args), luceneMatchVersion, etc etc)\n\t\n\t\tTokenizerFactory\n\t\tTokenFilterFactory\n\t\tCharFilterFactory\n\t\n\t\n\n\n ",
            "author": "Robert Muir",
            "id": "comment-13269536"
        },
        {
            "date": "2012-05-07T11:34:39+0000",
            "content": "No ones code is going to work without changes for 4.0 anyway... \n\nFair point\n\n\nIf we remove these, then do we need a .factories package? Cant we just \nput these couple classes in .util?\n\nYeah I can make that change.  I'll update the patch. ",
            "author": "Chris Male",
            "id": "comment-13269537"
        },
        {
            "date": "2012-05-07T11:37:22+0000",
            "content": "\nTokenizerFactory\nTokenFilterFactory\nCharFilterFactory\n\nAs classes instead of interfaces? ",
            "author": "Chris Male",
            "id": "comment-13269539"
        },
        {
            "date": "2012-05-07T11:39:24+0000",
            "content": "Yes. practically, all of the impls 'extend UselessBaseXXXFactory' today anyway  ",
            "author": "Robert Muir",
            "id": "comment-13269540"
        },
        {
            "date": "2012-05-07T11:41:20+0000",
            "content": "Okay, good idea. ",
            "author": "Chris Male",
            "id": "comment-13269541"
        },
        {
            "date": "2012-05-07T11:59:44+0000",
            "content": "re: what is the purpose of the newInstance method?\n\n\nIf you take a look at org.apache.solr.analysis.DelimitedPayloadTokenFilterFactory you'll see an example of how it's used.\n\nLooking at the implementation in SolrResourceLoader, it seems to facilitate two things:\n\nThe use of simplified solr.* package names\nIn FSTSynonymFilterFactory for example, newInstance is used to load other components. Consequently bq. bq. SolrResourceLoader adds the instantiated classes to its tracking of SolrCoreAware, ResourceLoaderAware, bq. etc.\nWith all that said, its only used in 3 Factories (but a lot of other Solr code). Perhaps we can break it bq. out somehow.\n\nI think we should revisit this. I don't like placing this into the analyzers module when not many factories actually use it, instead a lot of unrelated code in solr actually uses it. I think this could cause a mess.\n\nOn the other hand, both the things this provides can be achieved in other ways. For example, if we use NamedSPILoader instead to allow components such as factories to be found by name, then we can support \"solr.WhitespaceTokenizerFactory\" because TokenizerFactory.forName(\"WhitespaceTokenizerFactory\") works. Using the SPI mechanism would allow for us to have completely pluggable analysis modules, also operations like listAll() work in case you want to enumerate a list (imagine someone that doesnt want a xml configuration but configured by a GUI or something like that instead). We also keep sane packaging within the analysis modules and keep type safety, and solr still keeps its solr.XXX syntax without reflecting a zillion packages or other crazy things.\n\n\n ",
            "author": "Robert Muir",
            "id": "comment-13269551"
        },
        {
            "date": "2012-05-07T13:21:30+0000",
            "content": "New patch which follows Robert's suggestions.\n\nAll parent classes are distilled down to 4 classes: AbstractAnalysisFactory, TokenizerFactory, TokenFilterFactory and CharFilterFactory.\n\nAll implementations, Solr code and Javadocs have been updated.  Tests pass. ",
            "author": "Chris Male",
            "id": "comment-13269596"
        },
        {
            "date": "2012-05-07T13:24:13+0000",
            "content": "\nI think we should revisit this. I don't like placing this into the analyzers module when not many factories actually use it, instead a lot of unrelated code in solr actually uses it. I think this could cause a mess.\n\nI agree.  It feels messy where it is currently.\n\n\nFor example, if we use NamedSPILoader instead to allow components such as factories to be found by name, then we can support \"solr.WhitespaceTokenizerFactory\" because TokenizerFactory.forName(\"WhitespaceTokenizerFactory\") works.\n\nI don't really know much about NamedSPILoader but I think what you're suggesting.  How would we support Factories loading unrelated classes like they can through ResourceLoader now? Assume they're on the classpath and use Class.forName? ",
            "author": "Chris Male",
            "id": "comment-13269598"
        },
        {
            "date": "2012-05-07T13:36:00+0000",
            "content": "\nI don't really know much about NamedSPILoader but I think what you're suggesting. How would we support Factories loading unrelated classes like they can through ResourceLoader now? Assume they're on the classpath and use Class.forName?\n\nIt needs more discussion (and input from Uwe would help!), but it works like Charset.forName(\"ASCII\") etc. We use this already for codecs and postingsformats (Codec.forName, Codec.listAllCodecs, ...).\n\nHave a look at lucene/core/src/resources/META-INF/services for the idea. Basically you \"register\" your classes in\nyour jar file this way: additional jar files (e.g. look at lucene/test-framework/src/resources/META-INF) can load more classes.\n\nSo this could support some idea like TokenizerFactory.forName(\"Whitespace\") or something simple like that. So someone would not need to use org.apache.solr.analysis.xxx namespace to be able to load their analyzer stuff easily, they use whatever package they want and register in their META_INF. And added jar files (other analysis jars), are automatically available this way.\n\nI think Uwe mentioned this idea before, though I think he had Analyzers in mind (e.g. provide language code and get back analyzer or something). Anyway thats for another issue \n\nJust something worth consideration if we want to make these modules really pluggable. On the other hand we shouldn't use anything overkill if its not the right fit...  ",
            "author": "Robert Muir",
            "id": "comment-13269610"
        },
        {
            "date": "2012-05-07T14:11:50+0000",
            "content": "\nHow would we support Factories loading unrelated classes like they can through ResourceLoader now? Assume they're on the classpath and use Class.forName?\n\nI think there are only a few situations of this? Like your payload example? If PayloadEncoder really needs to be\npluggable by class then you always also put it under SPI too (PayloadEncoder.forName).\n\nIn general if we decide on the SPI approach, I think it would be useful to think of improving the solr config too,\nbecause the current configuration is so verbose and redundant.\ne.g. for backwards compat we could support:\n\n\n<charFilter class=\"solr.HtmlStripCharFilterFactory\"/>\n<tokenizer class=\"solr.StandardTokenizerFactory\"/>\n<filter class=\"solr.LowerCaseFilterFactory\"/>\n<filter class=\"solr.PorterStemFilterFactory\"/>\n\n\n\nbut going forward this would be cleaner IMO, just use the SPI name directly:\n\n\n<charFilter name=\"HtmlStrip\"/>\n<tokenizer name=\"Standard\"/>\n<filter name=\"LowerCase\"/>\n<filter name=\"PorterStem\"/>\n\n ",
            "author": "Robert Muir",
            "id": "comment-13269636"
        },
        {
            "date": "2012-05-07T14:19:02+0000",
            "content": "That would be of a huge benefit, I definitely think it's something we should pursue. ",
            "author": "Chris Male",
            "id": "comment-13269642"
        },
        {
            "date": "2012-05-07T14:37:11+0000",
            "content": "We're actually going to need this sooner rather than later, in order to continue to support the \n{solr.*}\n suffix for analysis factories.  Currently SolrResourceLoader just has a list a directories it tries when presented with the suffix.  When we move all the factories into their directories, it won't be able to do that any more.  \n\nI'll experiment with this once I've committed my latest patch. ",
            "author": "Chris Male",
            "id": "comment-13269659"
        },
        {
            "date": "2012-05-07T14:42:02+0000",
            "content": "I will try to convince Uwe to look at the issue as well. He is the SPI expert, he\nwill probably have some good ideas about the best approach.\n\nWorst case I see him tomorrow or something and hassle him about it. ",
            "author": "Robert Muir",
            "id": "comment-13269666"
        },
        {
            "date": "2012-05-07T17:15:27+0000",
            "content": "On trunk (1335132) I am getting this error with windows Java(TM) SE Runtime Environment (build 1.6.0_31-b05)\n\n\ncommon.compile-core:\n    [javac] Compiling 1 source file to C:\\workspace\\apache\\lucene\\solr\\build\\contrib\\solr-analysis-extras\\classes\\java\n    [javac] warning: [options] bootstrap class path not set in conjunction with -source 1.6\n    [javac] C:\\workspace\\apache\\lucene\\solr\\contrib\\analysis-extras\\src\\java\\org\\apache\\solr\\schema\\ICUCollationField.java:89: error: method setup in class ICUCollationField cannot be applied to given types;\n    [javac]     setup(schema.getResourceLoader(), args);\n    [javac]     ^\n    [javac]   required: ResourceLoader,Map<String,String>\n    [javac]   found: SolrResourceLoader,Map<String,String>\n    [javac]   reason: actual argument SolrResourceLoader cannot be converted to ResourceLoader by method invocation conversion\n    [javac] 1 error\n    [javac] 1 warning\n\n\n\nswitching SolrResourceLoader to depend on org.apache.lucene.analysis.util.ResourceLoader fixes it...\n\nI don't know why I see this, but not hudson ",
            "author": "Ryan McKinley",
            "id": "comment-13269783"
        },
        {
            "date": "2012-05-07T17:22:25+0000",
            "content": "Ryan, compilation succeeds for me (at svn r1335131) on Win7+Cygwin, w/ Oracle JDK 1.6.0_21 - I don't see the same failure as you.\n\nMaybe 'ant clean' will help? ",
            "author": "Steve Rowe",
            "id": "comment-13269789"
        },
        {
            "date": "2012-05-07T18:28:29+0000",
            "content": "my bad – i was running ant compile from the solr folder and needed to run clean from up a level. ",
            "author": "Ryan McKinley",
            "id": "comment-13269849"
        },
        {
            "date": "2012-05-08T03:51:23+0000",
            "content": "Patch which moves MultiTermComponent to the analysis module.  Hopefully this is the last thing to move.\n\nTests pass. ",
            "author": "Chris Male",
            "id": "comment-13270166"
        },
        {
            "date": "2012-05-08T04:10:57+0000",
            "content": "I dont like the type-unsafety here... shouldnt it be at least AbstractAnalysisFactory (instead of Object)?  ",
            "author": "Robert Muir",
            "id": "comment-13270179"
        },
        {
            "date": "2012-05-08T04:16:14+0000",
            "content": "I agree but I don't know anything about this functionality so I'll take your word for it. ",
            "author": "Chris Male",
            "id": "comment-13270184"
        },
        {
            "date": "2012-05-08T04:18:59+0000",
            "content": "Looking at the usage of this functionality in FieldTypePluginLoader, yes it can definitely be changed to AbstractAnalysisFactory since the code just checks whether it's a TokenFilterFactory, TokenizerFactory or CharFilterFactory (and throws an error on any other type).\n\nI'll update the patch. ",
            "author": "Chris Male",
            "id": "comment-13270185"
        },
        {
            "date": "2012-05-08T04:38:54+0000",
            "content": "New patch changing MultiTermComponent over to returning an AbstractAnalysisFactory. ",
            "author": "Chris Male",
            "id": "comment-13270191"
        },
        {
            "date": "2012-05-09T05:59:02+0000",
            "content": "Bash file for moving all the non-deprecated non-solr specific factories.\n\nTODO:\n\n\tMake patch correcting package names\n\tCollapse functionality from BaseTokenTestCase into BaseTokenStreamTestCase\n\tAdd test classes to those being moved\n\n ",
            "author": "Chris Male",
            "id": "comment-13271126"
        },
        {
            "date": "2012-05-09T12:01:51+0000",
            "content": "Patch which simplifies the factory tests.  It removes BaseTokenTestCase, moves the tests over to using TEST_CURRENT_VERSION, and cleans up some of the init(args) code. ",
            "author": "Chris Male",
            "id": "comment-13271350"
        },
        {
            "date": "2012-05-10T02:45:21+0000",
            "content": "Updated move script to include tests. ",
            "author": "Chris Male",
            "id": "comment-13272041"
        },
        {
            "date": "2012-07-11T23:03:47+0000",
            "content": "bulk cleanup of 4.0-ALPHA / 4.0 Jira versioning. all bulk edited issues have hoss20120711-bulk-40-change in a comment ",
            "author": "Hoss Man",
            "id": "comment-13412313"
        },
        {
            "date": "2012-07-25T18:04:51+0000",
            "content": "Fixed with merge of sub-task.\n\nWe should open new issues for:\n\n\n\tFix the Factory API to be more useable for Lucene programmers from Hibernate, ES, and other projects needing configureable analyzers\n\tClean up solr/contrib/analysis-extras (this contrib contains no factory code anymore just some JARS + The ICUCollationKeyField). We can nuke the whole contrib now, users can simply extract the analysis/morfologic,icu,smarcn,... JARS and put into their Solr plugins folder. I would move the ICUCollationFieldType to core and add icu.jar there. Its already needed by other contribs, so deduplicating it by adding to core makes much sense\n\tWe should maybe add a script to Solr that downloads the JAR files of the former extra analysis from Maven/Ivy and install in plugin folder. No need to ship this seldom used stuff with the main WAR.\n\tAutomatism to create META-INF/services (also affects Codecs&PostingsFormat). 2 possibilities (using APT and do it in JavaC using custom annotation while compiling, ASM-based ANT task like forbidden APIS to find all subclasses/implementations of an interface after compiling).\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-13422464"
        },
        {
            "date": "2012-08-06T20:26:10+0000",
            "content": "Solr tests have been failing under Maven on ASF Jenkins since the LUCENE-4044 commits on 7/25, because the POMs for two analysis modules (morfologik and phonetic) didn't include ${project.build.resources} definitions for src/resources/, the location of the SPI configuration files META-INF/services/o.a.l.analysis.util.*Factory.  \n\nI've added src/resources/ to these two modules' POMs:\n\n\n\tr1369961: trunk\n\tr1369980: branch_4x\n\n ",
            "author": "Steve Rowe",
            "id": "comment-13429393"
        }
    ]
}