{
    "id": "LUCENE-4309",
    "title": "Not obvious how to find mailing lists",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "general/website"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The website hides mailing lists under the heading \"Discussion\", which is not at all obvious.",
    "attachments": {
        "LUCENE-4309.patch": "https://issues.apache.org/jira/secure/attachment/12541362/LUCENE-4309.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-08-17T13:14:25+0000",
            "content": "Any suggestions on how to improve this? Maybe the tab should just say \"Mailing lists\" ? ",
            "author": "Robert Muir",
            "id": "comment-13436714"
        },
        {
            "date": "2012-08-17T13:33:52+0000",
            "content": "That would be much better.\n\nThere should also be a link to mailing lists on the top-level web page.\n\nThe tab should also be listed earlier, before more developer-oriented stuff such as \"Issues\".\n\nWhere \"Discussion\" is also present in the page body under \"Resources\" it should also be renamed and promoted to the top of the list.\n\nWhile on the subject, the \"License\" link should probably also be under \"Resources\".\nIt's not really appropriate to list it under \"ASF links\", because it needs to be clear it applies to each project.\nProbably best to have it next to Download or \"System Requirements\".\n\nBTW, some components use \"Issue Tracker\" and others use \"Bug Tracker\". Ideally standardise this. ",
            "author": "Sebb",
            "id": "comment-13436723"
        },
        {
            "date": "2012-08-17T13:57:08+0000",
            "content": "patch with most of the suggestions. \n\nTODO is still where to put the License link.  ",
            "author": "Robert Muir",
            "id": "comment-13436738"
        },
        {
            "date": "2012-08-17T14:02:24+0000",
            "content": "Also there is no consolidated lists yet of MLs across the TLP... this was just a quick find/replace/etc ",
            "author": "Robert Muir",
            "id": "comment-13436742"
        },
        {
            "date": "2012-08-17T14:03:28+0000",
            "content": "If you're taking suggestions, i always love it when projects puts a copy pasteable maven dependency snippets on the download page. I think most people use maven/ivy/.. now instead of archive downloads? (I could be hugely mistaken tho)\n\nCheers ",
            "author": "selckin",
            "id": "comment-13436743"
        },
        {
            "date": "2012-08-17T14:15:30+0000",
            "content": "I'm taking suggestions or patches or anything  But I am no web developer and don't even know markdown.\n\nThats why i basically did the find/replace only for now.\n\nIf you have changes in general you want to make please don't hesitate (http://www.apache.org/dev/cmsref.html#non-committer)\n\n\ni always love it when projects puts a copy pasteable maven dependency snippets on the download page. \n\nIt sounds to me that such a thing would be version-dependent though? Like we would want it underneath\na (auto-generated) page like http://lucene.apache.org/core/4_0_0-BETA/index.html, constructed automatically\nas part of that process? ",
            "author": "Robert Muir",
            "id": "comment-13436751"
        },
        {
            "date": "2012-08-17T15:48:25+0000",
            "content": "TODO is still where to put the License link.\n\nAbove the DOWNLOAD buttons - where they exist.\n\nOr under the \"About\" heading would be better than where it is now.\n ",
            "author": "Sebb",
            "id": "comment-13436812"
        },
        {
            "date": "2012-08-23T17:31:09+0000",
            "content": "FYI: i pushed the current patch as a start, and moved License under the About sections. ",
            "author": "Robert Muir",
            "id": "comment-13440478"
        }
    ]
}