{
    "id": "LUCENE-5152",
    "title": "Lucene FST is not immutable",
    "details": {
        "components": [
            "core/FSTs"
        ],
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "affect_versions": "4.4",
        "priority": "Blocker",
        "labels": "",
        "type": "Bug",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "a spinnoff from LUCENE-5120 where the analyzing suggester modified a returned output from and FST (BytesRef) which caused sideffects in later execution. \n\nI added an assertion into the FST that checks if a cached root arc is modified and in-fact this happens for instance in our MemoryPostingsFormat and I bet we find more places. We need to think about how to make this less trappy since it can cause bugs that are super hard to find.",
    "attachments": {
        "LUCENE-5152.patch": "https://issues.apache.org/jira/secure/attachment/12594961/LUCENE-5152.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-07-30T14:05:04+0000",
            "content": "here is a patch with the assert and a nocommit in MemoryPostingsFormat ",
            "author": "Simon Willnauer",
            "id": "comment-13723880"
        },
        {
            "date": "2013-07-30T14:15:49+0000",
            "content": "So its really just a BytesRef bug right? Because root arcs cache uses copyFrom, but this does a shallow copy of the output/nextFinalOutput, and in this case they are pointing to the same bytes (which gives someone the chance to muck with them). ",
            "author": "Robert Muir",
            "id": "comment-13723890"
        },
        {
            "date": "2013-07-30T14:48:20+0000",
            "content": "So its really just a BytesRef bug right? \n+1, so tricky ",
            "author": "Han Jiang",
            "id": "comment-13723922"
        },
        {
            "date": "2013-07-30T19:12:08+0000",
            "content": "So its really just a BytesRef bug right? \nwell in theory that is true. Yet, if you have an arc in your hand you can basically change it by passing it to a subsequent call to readNextTargetArc or whatever that would override the values completely. BytesRef is tricky but not the root cause of this issue. I do think that if you call:\n\n\n \npublic Arc<T> findTargetArc(int labelToMatch, Arc<T> follow, Arc<T> arc, BytesReader in) throws IOException\n\n\n\nit should always fill the arc that is provided so everything you do with it is up to you. Aside of this I agree BytesRef is tricky and we should fix if possible. ",
            "author": "Simon Willnauer",
            "id": "comment-13724280"
        },
        {
            "date": "2013-08-01T12:51:53+0000",
            "content": "here is a patch that adds a #deepCopy method to Outputs that allows me to do a deep copy if the actual arc that is returned is a cached root arc. I think we should never return a pointer into the root arcs though. this is way to dangerous! I haven't run any perf tests will do once I am on my worksstation again.. if somebody beats me go ahead! ",
            "author": "Simon Willnauer",
            "id": "comment-13726401"
        },
        {
            "date": "2013-08-01T13:45:31+0000",
            "content": "immutale\n\nIs that the Latin term for \"immutable\"??\n\n(spelling in summary line) ",
            "author": "Jack Krupansky",
            "id": "comment-13726429"
        },
        {
            "date": "2013-08-01T16:22:09+0000",
            "content": "I guess one question would be if its FSTs job to defend against bytesref bugs.\n\nThis issue was driven because there was a bytesref bug for suggester payloads.\nThe same kind of bug could happen, e.g. if someone uses DirectPostings and modifies the payload coming back from the postings lists.\n\nShould we clone payload bytes in the postings lists too? what about term dictionaries?\n\nAt some point then BytesRef is useless as a reference class because of a few bad apples trying to use it as a ByteBuffer.\nIdeally we would remove code that abuses BytesRef as a ByteBuffer instead. \n\nI don't mean to pick on your issue Simon, and it doesnt mean I object to the patch (though I wonder about performance implications), I just see this as one of many in a larger issue. ",
            "author": "Robert Muir",
            "id": "comment-13726569"
        },
        {
            "date": "2013-08-01T20:32:30+0000",
            "content": "Should we clone payload bytes in the postings lists too? what about term dictionaries?\nI agree we can be less conservative here and just use the payload and copy it into a new BytesRef or whatever is needed. I will bring up a new patch.\n\nAt some point then BytesRef is useless as a reference class because of a few bad apples trying to use it as a ByteBuffer. Ideally we would remove code that abuses BytesRef as a ByteBuffer instead.\n\nagreed again. We just need to make sure that we have asserts in place that check for that. \n\nI don't mean to pick on your issue Simon, and it doesnt mean I object to the patch (though I wonder about performance implications), I just see this as one of many in a larger issue.\n\nno worries. I am really concerned about this since it took me forever to figure out the problems this caused. I just wanna have an infra in place that catches those problems. I am more concerned about users that get bitten by this. I agree we should figure out the bigger problem eventually but lets make sure that we fix the bad apples first ",
            "author": "Simon Willnauer",
            "id": "comment-13726847"
        },
        {
            "date": "2013-08-01T21:35:14+0000",
            "content": "this patch only adds the assert and fixes the problems in MemoryPostings. This could solve the immediate issue and adds some more asserts to make sure we realise if something modifies the arcs outputs. ",
            "author": "Simon Willnauer",
            "id": "comment-13726928"
        },
        {
            "date": "2013-08-02T18:28:35+0000",
            "content": "I've been bitten by bugs in my code related to sharing BytesRefs.  It's not clear in the APIs who \"owns\" a BytesRef received from a method call.  In other words, can a recipient know wether it can safely cache it for use later or wether it's not safe because it could change suddenly later.  It's not even just that since there are two levels of ownership, the BytesRef instance and then the underlying char array.  This could be partially addressed with more documentation; I did that in my own code but that didn't stop another bug.  \n\nI have a rough idea in which a BytesRef has a boolean flag or two to indicate how share-able it is, and then a conditional clone method that either returns the current instance or returns shallow copy, or does a deep copy depending on those flags.  I dunno, just a half-baked idea. ",
            "author": "David Smiley",
            "id": "comment-13727927"
        },
        {
            "date": "2013-08-02T18:54:26+0000",
            "content": "Commit 1509805 from Simon Willnauer in branch 'dev/trunk'\n[ https://svn.apache.org/r1509805 ]\n\nLUCENE-5152: Fix MemoryPostingsFormat to not modify borrowed BytesRef from FSTEnum ",
            "author": "ASF subversion and git services",
            "id": "comment-13727956"
        },
        {
            "date": "2013-08-02T18:56:49+0000",
            "content": "I committed the latest patch to get the assert in and fix memory postings format. I will keep this issue open for further discussions ",
            "author": "Simon Willnauer",
            "id": "comment-13727958"
        },
        {
            "date": "2013-08-02T19:01:33+0000",
            "content": "Commit 1509812 from Simon Willnauer in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1509812 ]\n\nLUCENE-5152: Fix MemoryPostingsFormat to not modify borrowed BytesRef from FSTEnum ",
            "author": "ASF subversion and git services",
            "id": "comment-13727963"
        },
        {
            "date": "2013-08-02T19:27:34+0000",
            "content": "I know we make no claims about performance when assertions are enabled...\n\nBut it seems like this commit could substantially slow things down, since we call assertRootArcs, which is O(N) where N = number of root arcs, for every call to findTargetArc = likely called in hotspots.\n\nMaybe, we could move the call to e.g. FST.getBytesReader? ",
            "author": "Michael McCandless",
            "id": "comment-13727986"
        },
        {
            "date": "2013-08-02T19:36:05+0000",
            "content": "how is getBytesReader related to the root arcs? unless this slows things down when assertions are not enabled I'd vote for not moving it. This is a very trappy thing and we should catch any violation IMO very quickly. ",
            "author": "Simon Willnauer",
            "id": "comment-13727993"
        },
        {
            "date": "2013-08-03T00:31:29+0000",
            "content": "how is getBytesReader related to the root arcs?\n\nWell, anything that works with the FST APIs needs to call\ngetBytesReader first, e.g. MemoryPF does this every time you pull a\nTermsEnum from it.\n\nThis is a very trappy thing and we should catch any violation IMO very quickly.\n\nI agree it's trappy and it's great to add this check.\n\nI'm simply proposing moving it to less of a hot-spot, and I don't\nthink this will affect how quickly we catch violations but should\nreduce the cost of this added assertion.\n\nIn fact, I think findTargetArc isn't great in this regard; e.g. I\nthink MemoryPF only uses this API if the caller calls seekExact?  So I\nthink the current location of the assert is both more costly and lower\ncoverage than if we moved it to FST.getBytesReader. ",
            "author": "Michael McCandless",
            "id": "comment-13728317"
        },
        {
            "date": "2013-08-07T15:11:16+0000",
            "content": "In fact, I think findTargetArc isn't great in this regard; e.g. I\nthink MemoryPF only uses this API if the caller calls seekExact? So I\nthink the current location of the assert is both more costly and lower\ncoverage than if we moved it to FST.getBytesReader.\n\nI am not sure if that is true actually since findTargetArc is the only place where we actually use this cache? I mean I don't wanna be in the way of moving it but what kind of message are we sending here. We don't guarantee that asserts are fast but they won't slow you down massively? I mean we can call this assert in the getBytesReader as well to increase coverage, can you elaborate what you are concerned about? ",
            "author": "Simon Willnauer",
            "id": "comment-13732088"
        },
        {
            "date": "2013-08-08T12:41:11+0000",
            "content": "can you elaborate what you are concerned about?\n\nI'm worried about the O(N^2) cost of the assert: for every arc (single\nbyte of each term in a seekExact) we are iterating over all root arcs\n(up to 256 arcs) in this assert.\n\nfindTargetArc is the only place where we actually use this cache?\n\nAhh that's true, I hadn't realized that.\n\nMaybe, instead, we can move the assert just inside the if that\nactually uses the cached arcs?  Ie, put it here:\n\n\n  if (follow.target == startNode && labelToMatch < cachedRootArcs.length) {\n    assert assertRootArcs();\n    ...\n  }\n\n\n\nThis would address my concern: the cost becomes O(N) not O(N^2).  And\nthe coverage is the same? ",
            "author": "Michael McCandless",
            "id": "comment-13733454"
        },
        {
            "date": "2013-08-08T13:18:35+0000",
            "content": "This would address my concern: the cost becomes O(N) not O(N^2). And the coverage is the same?\n\nThe problem here is that we really need to check after we returned from the cache and that might be the case only once in a certain test. Yet, I think it's OK to do it there. I still don't get what you are concerned of we only have -ea in tests and the tests don't seem to be any slower? Can you elaborate what you are afraid of? ",
            "author": "Simon Willnauer",
            "id": "comment-13733474"
        },
        {
            "date": "2013-08-08T15:27:53+0000",
            "content": "Can you elaborate what you are afraid of?\n\nIn general I think it's bad if an assert changes too much how the code\nwould run without asserts.  E.g., maybe this O(N^2) assert alters how\nthreads are scheduled and changes how / whether an issue appears in\npractice.\n\nSimilarly, if a user is having trouble, I'll recommend turning on\nasserts to see if one trips, but if this causes a change in how the\ncode runs then this can change whether the issue reproduces.\n\nI also just don't like O(N^2) code, even when it's under an assert \n\nI think asserts should minimize their impact to the real code when\npossible, and it certainly seems possible in this case.\n\nSeparately, we really should run our tests w/o asserts, too, since\nthis is how our users typically run (I know some tests fail if\nassertions are off ... we'd have to fix them).  What if we accidentally\ncommit \"real\" code behind an assert?  Our tests wouldn't catch it ... ",
            "author": "Michael McCandless",
            "id": "comment-13733598"
        },
        {
            "date": "2013-08-10T20:11:32+0000",
            "content": "This is what I have in mind ... just moving the assert inside the if that actually uses the cached root arcs. ",
            "author": "Michael McCandless",
            "id": "comment-13736017"
        },
        {
            "date": "2013-08-14T16:03:36+0000",
            "content": "I plan to commit that last patch soon... ",
            "author": "Michael McCandless",
            "id": "comment-13739809"
        },
        {
            "date": "2013-08-14T17:32:38+0000",
            "content": "sorry for the late reply busy times... +1 to commit ",
            "author": "Simon Willnauer",
            "id": "comment-13739912"
        },
        {
            "date": "2013-08-15T22:42:55+0000",
            "content": "Commit 1514520 from Michael McCandless in branch 'dev/trunk'\n[ https://svn.apache.org/r1514520 ]\n\nLUCENE-5152: make assert less costly ",
            "author": "ASF subversion and git services",
            "id": "comment-13741604"
        },
        {
            "date": "2013-08-15T22:45:59+0000",
            "content": "Commit 1514521 from Michael McCandless in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1514521 ]\n\nLUCENE-5152: make assert less costly ",
            "author": "ASF subversion and git services",
            "id": "comment-13741609"
        },
        {
            "date": "2013-10-05T10:18:47+0000",
            "content": "4.5 release -> bulk close ",
            "author": "Adrien Grand",
            "id": "comment-13787022"
        }
    ]
}