{
    "id": "LUCENE-4742",
    "title": "Rename SpatialPrefixTree's \"Node\" back to \"Cell\"",
    "details": {
        "components": [
            "modules/spatial"
        ],
        "fix_versions": [
            "4.3"
        ],
        "affect_versions": "None",
        "priority": "Trivial",
        "labels": "",
        "type": "Improvement",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "SpatialPrefixTree makes \"Node\"s which are basically a rectangular spatial region that is more colloquially referred to as a \"Cell\".  It was named \"Cell\" in the first place and for whatever reason, Ryan and/or Chris renamed it as part of extracting it to a top level class from an inner class.  Most comments and variable names still use the \"cell\" terminology.  I'm working on an algorithm that keeps track of a tree of \"nodes\" and it has gotten confusing which kind of node I'm referring to, as each Node has one cell.\n\nIn maybe a week or so if there isn't discussion to the contrary, I'm going to commit a rename it back to \"Cell\".  And... while we're on this naming subject, perhaps \"SpatialPrefixTree\" could be named \"SpatialGrid\" ?  FWIW the variables referring to it are always \"grid\".",
    "attachments": {
        "LUCENE-4742_Rename_spatial_Node_back_to_Cell.patch": "https://issues.apache.org/jira/secure/attachment/12575713/LUCENE-4742_Rename_spatial_Node_back_to_Cell.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2013-03-27T14:58:45+0000",
            "content": "The attached patch renames all \"node\" terminology back to \"cell\" in the API and code, comments, etc.  I think it deserves a mention in backwards-compatibility in CHANGES.txt.\n\nI'll wait until your +1 Ryan. ",
            "author": "David Smiley",
            "id": "comment-13615349"
        },
        {
            "date": "2013-03-27T15:19:29+0000",
            "content": "this is fine – the term \"node\" came from QuadTree structures.  If it conflicts with something else then use \"Cell\" ",
            "author": "Ryan McKinley",
            "id": "comment-13615375"
        },
        {
            "date": "2013-03-27T15:28:18+0000",
            "content": "Wether it's QuadTree or whatever other tree, I don't think matters.  The reason why I think \"Cell\" is much better is that it evokes a conceptual understanding that people grok more easily in the context of spatial, I think, and it's thus colloquially also referred to as a \"cell\".  \"node\" is just too generic.  So using \"cell\" will hopefully be easier for people to understand as they use the API.  Hypothetically one might create a SpatialPrefixTree with a different number of dimensions than 2, and then \"cell\" is less convincing of an ideal name, but nonetheless I think that's okay. ",
            "author": "David Smiley",
            "id": "comment-13615386"
        },
        {
            "date": "2013-03-28T14:01:40+0000",
            "content": "Node->Cell is committed on both branches, including a short note in the API changes section of CHANGES.txt.\n\nI'm not sure wether to take this further and have SpatialPrefixTree be SpatialGrid.  It makes sense for basically the same reason as Node->Cell, but this class is more used and thus will more likely be breaking, and it also triggers other possible renames like the prefix and prefix.tree packages, and ...PrefixTree... classes.  Though it'd be nice to substitute the short 'n sweet \"Grid\" for the longer and compound word \"PrefixTree\".   ",
            "author": "David Smiley",
            "id": "comment-13616264"
        },
        {
            "date": "2013-04-01T16:43:29+0000",
            "content": "I've got the latest branch_4x and trunk pulled up in eclipse, and the Cell class (as well as the old Node class) seems to be missing.  Did you forget to svn add it? ",
            "author": "Shawn Heisey",
            "id": "comment-13618897"
        },
        {
            "date": "2013-04-01T16:52:57+0000",
            "content": "Um; it's in source control: http://svn.apache.org/repos/asf/lucene/dev/branches/branch_4x/lucene/spatial/src/java/org/apache/lucene/spatial/prefix/tree/Cell.java\nJenkins would have had a fit if it wasn't.  I'm not sure what is amiss in your local environment. ",
            "author": "David Smiley",
            "id": "comment-13618912"
        },
        {
            "date": "2013-04-01T18:45:58+0000",
            "content": "I'm not sure what is amiss in your local environment.\n\nSorry for the false alarm.  I'm not sure what went wrong either.  I did completely redo the checkout and 'ant eclipse' followed by a clean/refresh, but it didn't recover properly until I completely removed the project from eclipse, deleted the checkout, and did it all again.\n\nUnfortunately I had deleted everything before I thought to check the filesystem for the .java file rather than the eclipse project view, so I have no way of knowing whether it was the checkout or eclipse that was screwed up. ",
            "author": "Shawn Heisey",
            "id": "comment-13619038"
        },
        {
            "date": "2013-05-10T18:22:29+0000",
            "content": "Closing against 4.3 where it Node->Cell done. ",
            "author": "David Smiley",
            "id": "comment-13654689"
        }
    ]
}