{
    "id": "LUCENE-1712",
    "title": "Set default precisionStep for NumericField and NumericRangeFilter",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "2.9"
        ],
        "affect_versions": "2.9",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "This is a spinoff from LUCENE-1701.\n\nA user using Numeric* should not need to understand what's\n\"under the hood\" in order to do their indexing & searching.\n\nThey should be able to simply:\n\ndoc.add(new NumericField(\"price\", 15.50);\n\n\n\nAnd have a decent default precisionStep selected for them.\n\nActually, if we add ctors to NumericField for each of the supported\ntypes (so the above code works), we can set the default per-type.  I\nthink we should do that?\n\n4 for int and 6 for long was proposed as good defaults.\n\nThe default need not be \"perfect\", as advanced users can always\noptimize their precisionStep, and for users experiencing slow\nRangeQuery performance, NumericRangeQuery with any of the defaults we\nare discussing will be much faster.",
    "attachments": {
        "LUCENE-1712.patch": "https://issues.apache.org/jira/secure/attachment/12413342/LUCENE-1712.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2009-06-22T21:12:14+0000",
            "content": "Should be:\n\n\ndoc.add(new NumericField(\"price\").setFloatValue(15.50f));\n\n\n\nWith a direct constructor, there would be the problem of missing data type information. ",
            "author": "Uwe Schindler",
            "id": "comment-12722831"
        },
        {
            "date": "2009-06-22T21:19:30+0000",
            "content": "With a direct constructor, there would be the problem of missing data type information.\n\nSorry, what does that mean? ",
            "author": "Michael McCandless",
            "id": "comment-12722835"
        },
        {
            "date": "2009-06-22T21:27:06+0000",
            "content": "The methods setFloatValue() etc are for specifying the exact data type. If you would do it in the constructor, the resulting code would be very error-prone. e.g., new NumericField(\"price\", 12.5): Does this mean 12.5 as double or float, is 15 alone meant as (in future) short, byte or int? OK users can add \"f\" in the float case to it, but this makes it very hard to prevent errors, because Java automatically casts all numeric types to each other suddenly. This is why I added these factories for NumericRangeQuery and the setters here. ",
            "author": "Uwe Schindler",
            "id": "comment-12722839"
        },
        {
            "date": "2009-06-22T21:30:37+0000",
            "content": "OK, I agree it's dangerous to let javac auto cast.\n\nSo, can we set an across the board default of 4? ",
            "author": "Michael McCandless",
            "id": "comment-12722840"
        },
        {
            "date": "2009-06-22T21:35:44+0000",
            "content": "Am I misunderstanding something or the problem still persists?\nEven if you use a common default, what is your base type - int or long? Are floats converted to ints, or to longs? ",
            "author": "Earwin Burrfoot",
            "id": "comment-12722843"
        },
        {
            "date": "2009-06-22T21:38:37+0000",
            "content": "I think this is simple, we just overload all ctors and factories and remove the precisionStep there. These methods use NumericUtils.DEFAULT_PRECISION_STEP = 4 then. But thee should be a clear not, to do also tests with other step values.\n\nadditional variants:\n\n\tNumericField(name), NumericField(name,store,index)\n\tNumericTokenStream()\n\tNumericRangeQuery.newXxxRange(field, min, max,...)\n\n\n\nI am currentlly not sure (I was thinking the whole time during including into core) to also make NumericRangeQuery work like the other two classes: generic Constructor without datatype and then set the range explicit:\n\n\nnew NumericRangeQuery(fieldname[, precisionStep]).setFloatRange(....)\n\n\n\nNot sure, in this case the API where similar and I have to override only one ctor for different construction parameters. My only problem is, that Queries are normally almost everywhere in Lucene static and unmodifable  (beyond boost). ",
            "author": "Uwe Schindler",
            "id": "comment-12722845"
        },
        {
            "date": "2009-06-22T21:41:21+0000",
            "content": "Even if you use a common default, what is your base type - int or long? Are floats converted to ints, or to longs? \nFloat are indexed like ints and doubles like longs.\n\nThe problem here is more that if you would specify the value direct in the constructor, you cannot for sure always give the right type (because Java auto-casts). This is why I have these setFloatValue(), setLongValue() and so on. ",
            "author": "Uwe Schindler",
            "id": "comment-12722849"
        },
        {
            "date": "2009-06-22T21:45:41+0000",
            "content": "Aha! And each time you invoke setFloatValue/setDoubleValue it switches base type behind the scenes? Eeek. ",
            "author": "Earwin Burrfoot",
            "id": "comment-12722851"
        },
        {
            "date": "2009-06-22T22:08:54+0000",
            "content": "each time you invoke setFloatValue/setDoubleValue it switches base type behind the scenes?\n\nI think that's an acceptable risk.  I suppose we could add checking to catch you but I don't think that's needed (we should document clearly that you can't \"mix types\"). ",
            "author": "Michael McCandless",
            "id": "comment-12722859"
        },
        {
            "date": "2009-06-22T22:53:42+0000",
            "content": "behind the scenes precision changes based on which set*Value() method is called smells really wrong.\n\nI'm not overly familiar with NumericField, but i'm i'm understanding the current suggestion, wouldn't that mkae situations like this come up...\n\n\nNumericField a = new NumericField(\"price\", MY_CUSTOM_PRECISION_STEP, ...);\na.setFloatValue(23.4f); // blows away my custom precision\n\nNumericField b = new NumericField(\"price\", ...);\nb.setPrecisionStep(MY_CUSTOM_PRECISION_STEP);\nb.setFloatValue(23.4f); // blows away my custom precision\n\nNumericField c = new NumericField(\"price\", ...);\nc.setFloatValue(23.4f); \nc.setPrecisionStep(MY_CUSTOM_PRECISION_STEP); // only way to get my value used\n\n\n\n...that seems sketchy, and really anoying if people try reusing NumericField instances.\n\nIf the goal is to have good \"defaults\" based on type then why not just have a constant per type that people can refer to explicitly? if they don't know what number to pick ... as well as a true \"default\" if they pick nothing.\n\n\nint DEFAULT_STEP = ...;\nint SUGGESTED_INT_STEP = ...;\nint SUGGESTED_FLOAT_STEP = ...;\n\n\n\n\n\n ",
            "author": "Hoss Man",
            "id": "comment-12722878"
        },
        {
            "date": "2009-06-23T07:35:52+0000",
            "content": "In my opinion, I would like to keep the precisionStep parameter required and give the 4 constants for each data type in NumericUtils.\n\nOn the other hand 4 is a (maybe) good default, so I propose, that all ctors/factories getting a precisionStep default it to 4, if left out. precisionStep is a final variable in NumericTokenStream (and so in NumericField), because it does not make sense to change it. If \"field\" is final, also precisionStep should be final (one field must always use the same precision step). In principle Mike is right, the type is also fixed after first calling setXxxValue, so I could throw an IAE, if somebody calles a setter for a different datatype after the first one. A IllegalStateEx is thrown, when the value was not initialized and the docinverter tries to use the token stream.\n\nHere are two ideas to fix this the defaultPrecStep per type:\n\n1. Special value 0 as default precStep:\n\n\tthe no-precStep ctor sets the precStep in NumTokenStream to 0 (invalid value), if one is given it must be >0 and <=valsize\n\twhen delivering the tokens, NumTokenStream uses the default for this data type if precStep==0 and the given value in all other cases\nIn this case the precStep is still final in NumericTokenStream, with 0 means \"automatic\".\n\n\n\n\n2. There is one other idea:\nNumericField/-TokenStream could have a required ctor param type that can be NumericField.Type.INT,... In this case the default could be choosen very simple at the beginning. And it also fixes the data type. If somebody calls setDoubleValue but has initialized the TokenStream with NumericField.Type.INT, he will get an UOE.\n\n\nThe javadocs should always clearly note, that one should check out a good precStep.\n\n—\nBy the way: It is also a good idea to use valSize (32 or 64) as precisionStep in the case that you do not want to do range queries on the field (and use it only for sorting). RangeQueries would still work, but are as slow as conventional ones (current solr trunk contains this hint in its TrieField docs/schema) ",
            "author": "Uwe Schindler",
            "id": "comment-12722993"
        },
        {
            "date": "2009-06-23T08:02:36+0000",
            "content": "Having half of your methods constantly fail with an exception depending on constructor parameter. That just screams - \"Split me into two classes!\" ",
            "author": "Earwin Burrfoot",
            "id": "comment-12722996"
        },
        {
            "date": "2009-06-23T08:09:54+0000",
            "content": "Four classes! And with LUCENE-1710 there will be six! Not a good idea. 6 classes for NumericTokenStream, 6 for NumericField and maybe 6 for NumRangeQuery/Filter. brrrrr ",
            "author": "Uwe Schindler",
            "id": "comment-12723000"
        },
        {
            "date": "2009-06-23T08:13:17+0000",
            "content": "...and unmaintainable. I merged the two classes from contrib because of this. It was just duplicate code with some small variances. Always a problem for copy/paste operations. ",
            "author": "Uwe Schindler",
            "id": "comment-12723001"
        },
        {
            "date": "2009-06-23T10:33:37+0000",
            "content": "I propose, that all ctors/factories getting a precisionStep default it to 4\n\n+1, with javadocs encouraging experimentation.\n\nI think the ideas to conditionalize the default according to type add\nspooky complexity\n\nBy the way: It is also a good idea to use valSize (32 or 64) as precisionStep in the case that you do not want to do range queries on the field (and use it only for sorting).\n\nLet's be sure to call out this use-case in the javadocs! ",
            "author": "Michael McCandless",
            "id": "comment-12723031"
        },
        {
            "date": "2009-06-23T21:59:22+0000",
            "content": "\nBy the way: It is also a good idea to use valSize (32 or 64) as precisionStep in the case that you do not want to do range queries on the field (and use it only for sorting).\n\nThis screams out for additional (redundant) constants that are self documenting in their names...\n\n\nint PRECISION_STEP_DEFAULT = 4; // i think?\nint PRECISION_STEP_SUGGESTED_INT_RANGEANDSORT = ...; // no idea what this should be\nint PRECISION_STEP_SUGGESTED_INT_SORTONLY = 32; // i think?\nint PRECISION_STEP_SUGGESTED_FLOAT_RANGEANDSORT = ...; // no idea what this should be\nint PRECISION_STEP_SUGGESTED_FLOAT_SORTONLY = 32; // i think?\n...\n\n ",
            "author": "Hoss Man",
            "id": "comment-12723324"
        },
        {
            "date": "2009-07-09T22:29:11+0000",
            "content": "How about we add PRECISION_STEP_DEFAULT=4, make that the default for all types, and then note in the javadocs the \"interesting\" values for precision step (ie for sorting only)? ",
            "author": "Michael McCandless",
            "id": "comment-12729432"
        },
        {
            "date": "2009-07-09T22:30:39+0000",
            "content": "I'm assuming this one is yours Uwe! ",
            "author": "Michael McCandless",
            "id": "comment-12729433"
        },
        {
            "date": "2009-07-13T20:59:41+0000",
            "content": "Attached is a patch with the default precisionStep of 4. The javadocs of NumericRangeQuery list all possible and senseful values.\n\nThis patch also contains some cleanup in NumericUtils (rename constants) and a lot of other JavaDocs fixes. It also changes the token types of the TokenStream (no difference between 32/64 bit vals needed) and adds a test for them. ",
            "author": "Uwe Schindler",
            "id": "comment-12730512"
        },
        {
            "date": "2009-07-13T21:50:47+0000",
            "content": "Patch looks good Uwe! ",
            "author": "Michael McCandless",
            "id": "comment-12730538"
        },
        {
            "date": "2009-07-14T09:14:03+0000",
            "content": "Some updates:\n\n\tremove the limitation of the precisionStep to the value size (32 or 64). To index a non-trie-encoded numeric field, you can simply use Integer.MAX_VALUE or any other value>=64 as precStep. The lower limit of precStep is 1.\n\tadd a test for 64 bit values with recommended precStep=6\n\tadd simple test for unlimited precStep as above\nI will commit this shortly.\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-12730743"
        },
        {
            "date": "2009-07-14T09:18:24+0000",
            "content": "Committed revision: 793823\n\nThanks Mike! ",
            "author": "Uwe Schindler",
            "id": "comment-12730746"
        }
    ]
}