{
    "id": "LUCENE-6390",
    "title": "WeightedSpansTermExtractor has a broken IndexReader",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [
            "5.2",
            "6.0"
        ],
        "priority": "Critical",
        "status": "Open",
        "type": "Bug"
    },
    "description": "The DelegatingLeafReader there is broken, it does not implement getFieldInfos. This is not an optional method, and this is blocking performance improvements to spans.\n\nI'm gonna work around it for now, but if it won't be fixed, then this DelegatingLeafReader optimization should be removed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14394471",
            "author": "Robert Muir",
            "date": "2015-04-03T14:25:41+0000",
            "content": "This is actually a pretty serious bug. It means none of the query stack can use FieldInfos without breaking highlighting. "
        },
        {
            "id": "comment-14394473",
            "author": "Robert Muir",
            "date": "2015-04-03T14:27:01+0000",
            "content": "I set this as a 5.1 blocker because it will easily break highlighting for arbitrary queries. "
        },
        {
            "id": "comment-14394806",
            "author": "David Smiley",
            "date": "2015-04-03T18:09:15+0000",
            "content": "I agree it should be fixed, but I don't see this as a blocker, unless I'm misunderstanding the scope.  This feature was added back in 4.2 by Simon Willnauer and has been there since.  I've scanned through the usages of the method and I didn't see an occurrence from a Query.  Of course a user might have something custom, but that seems awfully rare.  Is there something I'm missing?  Anyway, if you can get this fixed then great; I just don't see it as blocking. "
        },
        {
            "id": "comment-14394811",
            "author": "David Smiley",
            "date": "2015-04-03T18:15:06+0000",
            "content": "I just noticed LUCENE-6388 (though that's targeting 5.2) and see it has a perfectly fine work-around.\nMaybe I'm splitting hairs; 5.1 doesn't seem held up at the moment on the account of this any how. "
        },
        {
            "id": "comment-14394862",
            "author": "Robert Muir",
            "date": "2015-04-03T18:34:29+0000",
            "content": "I think our query stack should have the ability to check fieldinfos and use everything it knows to make things efficient.\n\nIt bothers me that I can make a perfectly valid improvement to what queries do behind the scenes, but highlighter tests will fail, because they have broken code.\nMaybe i should have just disabled their tests?\n\nWe cannot let the highlighter hold back our core search code. "
        },
        {
            "id": "comment-14394897",
            "author": "Robert Muir",
            "date": "2015-04-03T18:42:49+0000",
            "content": "I unset blocker. I can work to fix this, that is going to be by removing the optimization. The current optimization is incorrect so just pretend like it does not exist. "
        }
    ]
}