{
    "id": "LUCENE-2320",
    "title": "Add MergePolicy to IndexWriterConfig",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "core/index"
        ],
        "type": "Improvement",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Now that IndexWriterConfig is in place, I'd like to move MergePolicy to it as well. The change is not straightforward and so I've kept it for a separate issue. MergePolicy requires in its ctor an IndexWriter, however none can be passed to it before an IndexWriter actually exists. And today IW may create an MP just for it to be overridden by the application one line afterwards. I don't want to make iw member of MP non-final, or settable by extending classes, however it needs to remain protected so they can access it directly. So the proposed changes are:\n\n\n\tAdd a SetOnce object (to o.a.l.util), or Immutable, which can only be set once (hence its name). It'll have the signature SetOnce<T> w/ synchronized set<T> and T get(). T will be declared volatile, so that get() won't be synchronized.\n\tMP will define a protected final SetOnce<IndexWriter> writer instead of the current writer. NOTE: this is a bw break. any suggestions are welcomed.\n\tMP will offer a public default ctor, together with a set(IndexWriter).\n\tIndexWriter will set itself on MP using set(this). Note that if set will be called more than once, it will throw an exception (AlreadySetException - or does someone have a better suggestion, preferably an already existing Java exception?).\n\n\n\nThat's the core idea. I'd like to post a patch soon, so I'd appreciate your review and proposals.",
    "attachments": {
        "LUCENE-2320.patch": "https://issues.apache.org/jira/secure/attachment/12438760/LUCENE-2320.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2010-03-14T10:16:25+0000",
            "content": "This sounds good Shai!\n\nThis is technically a back-compat break, but, these are experimental APIs, and this is an easy fix for users who have impl'd their own MPs, so I think it's OK to make an exception.  Make sure you note it in the bw break section in CHANGES... ",
            "author": "Michael McCandless",
            "id": "comment-12845064"
        },
        {
            "date": "2010-03-14T13:28:40+0000",
            "content": "Ok, I'll update that part of CHANGES. The conversion is very straightforward - instead of calling writer.doXYZ(), the code becomes writer.get().doXYZ(). ",
            "author": "Shai Erera",
            "id": "comment-12845077"
        },
        {
            "date": "2010-03-14T15:46:28+0000",
            "content": "Patch with the proposed changes including:\n\n\tSetOnce (+ test)\n\tDeprecations in IW\n\tAdds MP to IWC\n\tChanges needed in MP and extensions\n\tConverted tests code to not use the deprecated API.\n\n\n\nAll tests pass, including core, contrib and backwards ",
            "author": "Shai Erera",
            "id": "comment-12845099"
        },
        {
            "date": "2010-03-15T01:59:38+0000",
            "content": "Or, maybe, we should think of MergePolicy API that doesn't require one to keep a reference to IW?\nThe more you struggle to control such circular multistage initializations and check their validity, the more their ugliness stands out and screams - refactor meee! ",
            "author": "Earwin Burrfoot",
            "id": "comment-12845167"
        },
        {
            "date": "2010-03-15T15:44:15+0000",
            "content": "Or, maybe, we should think of MergePolicy API that doesn't require one to keep a reference to IW?\n\nLooks like IW is used pretty widely: for messaging (when infoStream is set), for retrieving the merges, for getting the Directory, and for getting number of deleted docs for a given segment.  I guess an option would be to simply pass it around everywhere.  Then we wouldn't have to break the circular dependendy.\n\nThis is what MergeScheduler appears to do – it's passed to .merge, and then each bg thread in CMS holds a reference to the writer (since it needs to ask for followon merges). ",
            "author": "Michael McCandless",
            "id": "comment-12845370"
        },
        {
            "date": "2010-03-15T20:05:15+0000",
            "content": "The thing is that we were at that position already, before I changed it so that MP requires writer up front. The reason was, like Mike mentioned, that writer had to be passed on all method calls, for really no good reason. A MP is usually coupled w/ an IW instance and I don't think we should opt for decoupling them.\n\nMost of this patch removes MP setting from IW to IWC (and hence changes test code to use the new API). The SetOnce juggling is done only to ensure an IW is set exactly once on MP, and allows us to resolve that circular dependency. We can do two things:\n\n\tContinue w/ SetOnce as introduced in this patch.\n\tIntroduce a setIndexWriter on MP which anyone can call, even more than once.\n\n\n\nWith (1) I don't think we complicate anything, and SetOnce can be useful in other places as well. (2) is really like passing writer on all method calls, so let's at least not have it as part of all methods signature. I prefer (1) slightly over (2) but am fine w/ (2) as well. I wouldn't want to change MP back to require IW on all its methods. ",
            "author": "Shai Erera",
            "id": "comment-12845490"
        },
        {
            "date": "2010-03-15T21:13:54+0000",
            "content": "We could split MergePolicy in two - class that represents the policy (config/factory) and class that acts on that policy (instance).\n\nSo IW gets a MergePolicy that has no outside references, and creates a MergePoliceman from it, supplying 'this' on construction.\nThus, circular reference still exists, but is contained for good.\n\nNot sure I totally love the idea myself though. ",
            "author": "Earwin Burrfoot",
            "id": "comment-12845530"
        },
        {
            "date": "2010-03-16T15:14:40+0000",
            "content": "But it's MP which requires IW. So how will your policeman (like the name ) proposal prevent it? I think that setting IW on MP is not such a bad thing. If MP needs it then it needs. The question now is to what length do we want to go w/ it: make it sort of final (in which case SetOnce makes sense) or settle w/ a setIW which is simpler.\n\nThis issue is more about moving MP into IWC than refactor MP. I'd like to keep it focused on that as much as possible. I don't mean that we should stop discussing the refactoring, just to say it can be done separately. After MP moves to IWC and all code is converted to use the new API, refactoring MP internally should not affect the API level, right?\n\nIf u agree w/ that, then how do u propose to continue? W/ SetOnce or a simple setter?   ",
            "author": "Shai Erera",
            "id": "comment-12845930"
        },
        {
            "date": "2010-03-17T16:17:01+0000",
            "content": "Patch looks good Shai!  I'd rather go with the SetOnce approach than introduce a single-use factory for IW to create the MP.\n\nBut, I don't think we should keep the MP ctors that take IW?  Ie, you make the MP then call .setIW on it?  We can just remove them (and advertise this in the CHANGES bw break entry) since it's an experimental API... ",
            "author": "Michael McCandless",
            "id": "comment-12846451"
        },
        {
            "date": "2010-03-17T20:53:37+0000",
            "content": "Attached patch w/ removing the IW-related ctors from MPs, as well as fixing backwards. All tests pass, including javadocs ",
            "author": "Shai Erera",
            "id": "comment-12846579"
        },
        {
            "date": "2010-03-17T21:24:31+0000",
            "content": "Updating to the latest revision. This should be ok now. ",
            "author": "Shai Erera",
            "id": "comment-12846600"
        },
        {
            "date": "2010-03-17T21:57:53+0000",
            "content": "Sorry ... I generated the patch on the wrong backwards folder (the one before Uwe's changes) . I hope this time it's ok ... ",
            "author": "Shai Erera",
            "id": "comment-12846610"
        },
        {
            "date": "2010-03-17T22:06:51+0000",
            "content": "Its normally not the idea of backwards tests to change the src/java part of the backwards part, as this would hide a backwards break. You should only change only src/tests in backwards! src/java is only for compiling a JAR file of the old lucene version, if you change it, you test against the wrong classes!\n\nUwe ",
            "author": "Uwe Schindler",
            "id": "comment-12846614"
        },
        {
            "date": "2010-03-17T22:10:27+0000",
            "content": "Uwe, I'm pretty familiar w/ how backwards goes .. I've had a lot of bw breaks in my contributions history . This patch + issue removes the MP ctor which accepts IW and exposes the default ctor only. That's a bw break, which is documented in CHANGES as well as was agreed on here because MP is experimental and gives us the freedom to do that (not that it's such a drastic change). Therefore I had to update the src/java section of bw, so that its tests would compile against MPs that expose the default ctor, and not the one accepting IW. ",
            "author": "Shai Erera",
            "id": "comment-12846615"
        },
        {
            "date": "2010-03-17T22:15:43+0000",
            "content": "In that case just remove the test in backwards. If you just replicate it in the same way like in trunk, it does not make sense. ",
            "author": "Uwe Schindler",
            "id": "comment-12846619"
        },
        {
            "date": "2010-03-17T22:23:27+0000",
            "content": "I think it's OK to add stubs to src/* under backwards branch, in cases like this?  Ie when an experimental API is changed.\n\nJust removing the tests that use the affected API isn't really an option here – eg some tests explicitly set up a LogDocMergePolicy (not sure exactly why) and we in general can't just remove that. ",
            "author": "Michael McCandless",
            "id": "comment-12846621"
        },
        {
            "date": "2010-03-17T22:29:54+0000",
            "content": "+1 - I've had to do this in the past too. Just dropping tests doesn't seem like the way to go in many cases. ",
            "author": "Mark Miller",
            "id": "comment-12846622"
        },
        {
            "date": "2010-03-17T23:25:59+0000",
            "content": "Shai this patch looks good – thanks!  Somehow you keep getting yourself sucked into the issues that need big patches to fix.... ",
            "author": "Michael McCandless",
            "id": "comment-12846665"
        },
        {
            "date": "2010-03-18T09:29:56+0000",
            "content": "Fixed a copy-paste comment error in IndexWriter (introduced in LUCENE-2294). ",
            "author": "Shai Erera",
            "id": "comment-12846812"
        },
        {
            "date": "2010-03-18T16:58:54+0000",
            "content": "Mike - are you reviewing it? I think I fixed all mentioned comments. ",
            "author": "Shai Erera",
            "id": "comment-12846997"
        },
        {
            "date": "2010-03-18T17:19:08+0000",
            "content": "The patch looks great Shai – I plan to commit in a day or two.\n\nI added @lucene.experimental to SetOnce's jdocs, and also removed stale javadoc in MP and MS saying that you need access to package-private APIs (unrelated to this issue but spotted it . ",
            "author": "Michael McCandless",
            "id": "comment-12847008"
        },
        {
            "date": "2010-03-18T18:04:31+0000",
            "content": "Thanks Mike ! ",
            "author": "Shai Erera",
            "id": "comment-12847034"
        },
        {
            "date": "2010-03-19T22:34:11+0000",
            "content": "Thanks Shai! ",
            "author": "Michael McCandless",
            "id": "comment-12847623"
        }
    ]
}