{
    "id": "LUCENE-3681",
    "title": "FST.BYTE2 should save as fixed 2 byte not as vInt",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We currently write BYTE1 as a single byte, but BYTE2/4 as vInt, but I think that's confusing.  Also, for the FST for the new Kuromoji analyzer (LUCENE-3305), writing as 2 bytes instead shrank the FST and ran faster, presumably because more values were >= 16384 than were < 128.\n\nSeparately the whole INPUT_TYPE is very confusing... really all it's doing is \"declaring\" the allowed range of the characters of the input alphabet, and then the only thing that uses that is the write/readLabel methods (well and some confusing sugar methods in Builder!).  Not sure how to fix that yet...\n\nIt's a simple change but it changes the FST binary format so any users w/ FSTs out there will have to rebuild (FST is marked experimental...).",
    "attachments": {
        "LUCENE-3681.patch": "https://issues.apache.org/jira/secure/attachment/12509856/LUCENE-3681.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2012-01-08T18:40:38+0000",
            "content": "Related to that old issue I don't have the time to work on. It would be nice to have a top-level symbols set/ algebra definition and build things on top of that. ",
            "author": "Dawid Weiss",
            "id": "comment-13182264"
        },
        {
            "date": "2012-01-08T18:45:40+0000",
            "content": "Simple patch... ",
            "author": "Michael McCandless",
            "id": "comment-13182268"
        },
        {
            "date": "2012-01-08T19:11:39+0000",
            "content": "+1 to this patch initially. I agree we should try to improve later and make it more extensible, even if its some steps like moving readLabel() to BytesReader, with concrete impls for BYTE1/2/4 and later maybe this can be customized or something like that. ",
            "author": "Robert Muir",
            "id": "comment-13182271"
        },
        {
            "date": "2012-01-08T19:46:11+0000",
            "content": "I like the idea of moving read/writeLabel to BytesReader/Writer and then specializing... ",
            "author": "Michael McCandless",
            "id": "comment-13182278"
        }
    ]
}