{
    "id": "LUCENE-2646",
    "title": "Implement the Military Grid Reference System for tiling",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "modules/spatial"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The current tile based system in Lucene is broken.  We should standardize on a common way of labeling grids and provide that as an option.  Based on previous conversations with Ryan McKinley and Chris Male, it seems the Military Grid Reference System (http://en.wikipedia.org/wiki/Military_grid_reference_system) is a good candidate for the replacement due to its standard use of metric tiles of increasing orders of magnitude (1, 10, 100, 1000, etc.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2010-09-16T00:17:37+0000",
            "content": "+1\n\nDo you have an implementation in mind/already started? ",
            "author": "Chris Male",
            "id": "comment-12909962"
        },
        {
            "date": "2010-09-16T07:07:06+0000",
            "content": "Would Geohash be better? One of the features of Geohash is substring searching. ",
            "author": "Lance Norskog",
            "id": "comment-12910028"
        },
        {
            "date": "2010-09-16T07:08:46+0000",
            "content": "From the wikipedia page:\n\nIn the polar regions, a different convention is used.\n\nhttp://earth-info.nga.mil/GandG/publications/tm8358.1/tr83581f.html ",
            "author": "Lance Norskog",
            "id": "comment-12910029"
        },
        {
            "date": "2010-09-16T11:53:03+0000",
            "content": "We have geohash already, tiling is a different approach ",
            "author": "Grant Ingersoll",
            "id": "comment-12910112"
        },
        {
            "date": "2010-09-16T13:54:51+0000",
            "content": "I hope you guys can make it to my session at LuceneRevolution at which I'll describe my geohash prefix filtering technique.  I'm working on an open-source contribution but the public release process is slow at MITRE.  I'm not yet employing a tiling technique but it's where I want to go. ",
            "author": "David Smiley",
            "id": "comment-12910157"
        },
        {
            "date": "2010-09-16T15:56:34+0000",
            "content": "spell check police ",
            "author": "Erik Hatcher",
            "id": "comment-12910199"
        },
        {
            "date": "2013-12-02T04:17:12+0000",
            "content": "I'm tempted to close this old issue as \"won't fix\" because there is already two working tiling systems (geohash & quad). It would add complications of dealing with overlap that exists between MGRS tiles, and needing additional projections for the poles.\n\nThe only benefit I can think of is that you might want to support shapes defined as existing on this projection (technically \"these projections\" as each tile is its own projection).  So a circle (point-radius), for example, isn't a true geodetic point-radius, it's a 2D point-radius as projected on a particular MGRS tile.  Is there much value?  Shrug; I don't think so.  My preference is to close this and only re-open when some user/app want this for some unique value that such a tiling system would provide over existing ones we have. ",
            "author": "David Smiley",
            "id": "comment-13836223"
        }
    ]
}