{
    "id": "LUCENE-7883",
    "title": "Remove references to Thread#getContextClassLoader() from Lucene/Solr codebase",
    "details": {
        "labels": "",
        "priority": "Critical",
        "resolution": "Fixed",
        "affect_versions": "None",
        "status": "Resolved",
        "type": "Improvement",
        "components": [],
        "fix_versions": [
            "7.0"
        ]
    },
    "description": "As discussed in LUCENE-7873, the use of Thread.currentThread().getContextClassLoader() is in most cases a bug caused by sloppy usage of ClassLoader APIs and should be replaced by getClass().getClassLoader().\n\nIn Lucene we only have the ClassPathResourceLoader, but this one can be solved by removing the \"default\" constructor. It only affects CustomAnalyzer, that should also be extended in Lucene 7.\n\nThe uses in Solr and its test are all to be replaced by getClass().getClassLoader() (except some workaround with clustering using a try-finally). This is in most cases historical code, when Solr was a web application to workaround some buggy webapp containers. In the current state, the code is \"just wrong\".\n\nFinally, we should add java.lang.Thread#getContextClassLoader() to forbidden-apis.\n\nI'd like to get this into Lucene 7, as it affects some APIs in Lucene.",
    "attachments": {
        "LUCENE-7883.patch": "https://issues.apache.org/jira/secure/attachment/12873742/LUCENE-7883.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16055537",
            "date": "2017-06-20T10:35:20+0000",
            "content": "I can look into the clustering plugin's use of it. I recall it was unfortunately required, but will have to go into this again to remind myself why. ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-16056530",
            "date": "2017-06-20T21:51:26+0000",
            "content": "Patch removing context classloader usage. Tests seem to pass, unfortunately Solr trunk is very unstable. Some unrelated tests also fail on Jenkins, so I cannot be sure all is fine.\n\nThis patch also adds context class loaders on te forbidden api list. Because of that I used the withContextClassLoader(ClassLoader, () -> { ... }) lambda method. ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-16057316",
            "date": "2017-06-21T10:43:34+0000",
            "content": "Looks good to me. I'll check why the context classloader is required in clustering later on. I think the case was that clustering was under shared libraries and resources loaded per-core couldn't figure where to load classes from. ",
            "author": "Dawid Weiss"
        },
        {
            "id": "comment-16057907",
            "date": "2017-06-21T17:44:28+0000",
            "content": "I did some live test with the standalone techproducts example. I have seen no issues, so I think this should be fine to commit. I will add a CHANGES entry in both Lucene and Solr, because this affects both projects. ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-16057910",
            "date": "2017-06-21T17:47:06+0000",
            "content": "Unfortunately the latest test failures on master make it hard to differentiate between failures caused by my changes and ones already there. But all failures in tests that I see here, look like the ones Jenkins is drinking with his beers!\n\nThis is not a good state, the test suite should pass for a clean checkout. ",
            "author": "Uwe Schindler"
        },
        {
            "id": "comment-16059812",
            "date": "2017-06-22T18:22:06+0000",
            "content": "Commit 5de15ff403fbf4afe68718151617e6104f7e3888 in lucene-solr's branch refs/heads/master from Uwe Schindler\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5de15ff ]\n\nLUCENE-7883: Lucene/Solr no longer uses the context class loader when resolving resources ",
            "author": "ASF subversion and git services"
        },
        {
            "id": "comment-16059814",
            "date": "2017-06-22T18:23:23+0000",
            "content": "I added changes and migrate entries and committed to master (7.0). ",
            "author": "Uwe Schindler"
        }
    ]
}