{
    "id": "LUCENE-5692",
    "title": "Deprecate spatial DisjointSpatialFilter",
    "details": {
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed",
        "components": [
            "modules/spatial"
        ],
        "affect_versions": "6.0",
        "status": "Resolved",
        "fix_versions": [
            "4.10",
            "6.0"
        ]
    },
    "description": "The spatial predicate \"IsDisjointTo\" is almost the same as the inverse of \"Intersects\", except that it shouldn't match documents without spatial data.  In another sense it's as if the query shape were inverted.\n\nDisjointSpatialFilter is a utility filter that works (or worked, rather) by using the FieldCache to see which documents have spatial data (getDocsWithField()). Calculating that was probably very slow but it was at least cacheable. Since LUCENE-5666 (v5/trunk only), Rob replaced this to use DocValues.  However for some SpatialStrategies (PrefixTree based) it wouldn't make any sense to use DocValues just so that at search time you could call getDocsWithField() when there's no other need for the un-inversion (e.g. no need to lookup terms by document).\n\nPerhaps an immediate fix is simply to revert the change made to DisjointSpatialFilter so that it uses the FieldCache again, if that works (though it's not public?).  But stepping back a bit, this DisjointSpatialFilter is really something unfortunate that doesn't work as well as it could because it's not at the level of Solr or ES – that is, there's no access to a filter-cache.  So I propose I simply remove it, and if a user wants to do this for real, they should index a boolean field marking wether there's spatial data and then combine that with a NOT and Intersects, in a straight-forward way.  \n\nAlternatively, some sort of inverting query shape could be developed, although it wouldn't work with the SpatialPrefixTree technique because there is no edge distinction – the edge matches normally and notwithstanding changes to RPT algorithms it would also match the edge of an inverted shape.",
    "attachments": {
        "LUCENE-5692_Deprecate_DisjointSpatialFilter__RPT_stops_using_it.patch": "https://issues.apache.org/jira/secure/attachment/12654167/LUCENE-5692_Deprecate_DisjointSpatialFilter__RPT_stops_using_it.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-14049652",
            "author": "Ryan McKinley",
            "content": "+1 to remove DisjointSpatialFilter\n\nusing another boolean field to represent if a shape exists seems very easy and this would avoid using the FieldCache ",
            "date": "2014-07-02T05:56:23+0000"
        },
        {
            "id": "comment-14052792",
            "author": "David Smiley",
            "content": "Ok; I'm going to mark it deprecated, and add an Ignore annotation to RPT's Disjoint test.  And I'll have the trunk RecursivePrefixTreeStrategy remove support for it, leaving it in 4x.\n\nNote to self: I do think I could make a simple variation of IntersectsPrefixTreeFilter (IPTF isn't much code any way) to implement disjoint.  Perhaps I'll do that sometime but not now.  But even if I did... it wouldn't be as fast as what should be recommended (what I said in the description):\nand if a user wants to do this for real, they should index a boolean field marking wether there's spatial data and then combine that with a NOT and Intersects, in a straight-forward way. ",
            "date": "2014-07-05T04:52:25+0000"
        },
        {
            "id": "comment-14053761",
            "author": "ASF subversion and git services",
            "content": "Commit 1608488 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1608488 ]\n\nLUCENE-5692: Deprecate DisjointSpatialFilter; RPT stops using it ",
            "date": "2014-07-07T15:31:04+0000"
        },
        {
            "id": "comment-14053772",
            "author": "ASF subversion and git services",
            "content": "Commit 1608499 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1608499 ]\n\nLUCENE-5692: Deprecate DisjointSpatialFilter; (in 4x RPT still uses it) ",
            "date": "2014-07-07T15:42:30+0000"
        },
        {
            "id": "comment-14053773",
            "author": "David Smiley",
            "content": "I put the CHANGES.txt in the 5x area because there RPT removes support for it.  It's debatable, but this is a fairly minor thing. ",
            "date": "2014-07-07T15:45:13+0000"
        },
        {
            "id": "comment-14053778",
            "author": "ASF subversion and git services",
            "content": "Commit 1608501 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1608501 ]\n\nLUCENE-5692: Removed deprecated DisjointSpatialFilter on trunk. Moved CHANGES.txt deprecation note to 4.10 ",
            "date": "2014-07-07T15:49:51+0000"
        },
        {
            "id": "comment-14053782",
            "author": "ASF subversion and git services",
            "content": "Commit 1608503 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1608503 ]\n\nLUCENE-5692: Moved deprecation CHANGES.txt note to 4.10 ",
            "date": "2014-07-07T15:52:04+0000"
        },
        {
            "id": "comment-14053783",
            "author": "David Smiley",
            "content": "On second thought it makes more sense to put deprecation note into CHANGES.txt for 4x, and delete from trunk, so that's what I did. ",
            "date": "2014-07-07T15:53:13+0000"
        },
        {
            "id": "comment-14056198",
            "author": "ASF subversion and git services",
            "content": "Commit 1609139 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1609139 ]\n\nLUCENE-5692: remove need for uninversion for RandomSpatialOpFuzzyPrefixTreeTest ",
            "date": "2014-07-09T13:00:43+0000"
        },
        {
            "id": "comment-14056304",
            "author": "ASF subversion and git services",
            "content": "Commit 1609189 from David Smiley in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1609189 ]\n\nLUCENE-5692: remove need for uninversion for RandomSpatialOpFuzzyPrefixTreeTest ",
            "date": "2014-07-09T14:47:20+0000"
        }
    ]
}