{
    "id": "LUCENE-1731",
    "title": "Allow ConstantScoreQuery to use custom rewrite method if using for highlighting",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "modules/highlighter"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "2.4,                                            2.4.1",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "I'd like to submit a patch for ConstantScoreQuery which simply contains a setter method to state whether it is being used for highlighting or not. \n\nIf it is being used for highlighting, then the rewrite method can take each of the terms in the filter and create a BooleanQuery to return (if the number of terms in the filter are less than 1024), otherwise it simply uses the old rewrite method.\n\nThis allows you to highlight upto 1024 terms when using a ConstantScoreQuery, which since it is a filter, will currently not be highlighted.\n\nThe idea for this came from Mark Millers article \"Bringing the Highlighter back to Wildcard Queries in Solr 1.4\", I would just like to make it available in core lucene",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2009-07-09T03:51:36+0000",
            "content": "Hey Ashley,\n\nThis was added to the SpanScorer Scorer for the Highlighter a while back as part of resolving that Solr issue. Hopefully I will have to time to make it the default by 2.9's release, but its there as an option now if you use the SpanScorer.\n\nThe issue was:  \t LUCENE-1425 - Add ConstantScore highlighting support to SpanScorer ",
            "author": "Mark Miller",
            "id": "comment-12729034"
        },
        {
            "date": "2009-07-10T07:30:48+0000",
            "content": "Hi Mark,\n\nYeah i was aware the of the addition made but am i correct in saying this is only supported by the Solr highlighter (i.e. the \"usePhraseHighlighting\" params, etc)? ... Maybe i'm missing the point but i couldn't get any queries based on a TermsFilter to work with the lucene highlighter\n\n– Forget that, i've looked at the patches and i see how the improvement has been made. I'll just use my work around until lucene 2.9 is released but thanks for your help! ",
            "author": "Ashley Sole",
            "id": "comment-12729557"
        },
        {
            "date": "2009-07-10T07:52:05+0000",
            "content": "This has already been fixed for lucene 2.9 ",
            "author": "Ashley Sole",
            "id": "comment-12729566"
        }
    ]
}