{
    "id": "LUCENE-3164",
    "title": "consolidate various CHANGES.txt into two files: lucene and solr",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "There are CHANGES.txt files everywhere: lucene/contrib has a CHANGES.txt, the benchmark package has its own CHANGES.txt, in trunk all the modules have their own CHANGES.txt, and each solr contrib has its own CHANGES.txt\n\nI propose we merge these files into a CHANGES.txt for each \"product\" we make. so that means lucene/CHANGES.txt and solr/CHANGES.txt",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2011-05-31T04:36:54+0000",
            "content": "Specifically, current files are:\n\nlucene:\n\n\tCHANGES.txt\n\tcontrib/benchmark/CHANGES.txt\n\tcontrib/CHANGES.txt\n\tcontrib/grouping/CHANGES.txt\n\n\n\nsolr\n\n\tCHANGES.txt\n\tclient/ruby/flare/vendor/plugins/engines/CHANGELOG (?)\n\tclient/ruby/solr-ruby/CHANGES.yml (?)\n\tcontrib/analysis-extras/CHANGES.txt\n\tcontrib/clustering/CHANGES.txt\n\tcontrib/dataimporthandler/CHANGES.txt\n\tsolr/contrib/extraction/CHANGES.txt\n\tsolr/contrib/uima/CHANGES.txt\n\n\n\nIn favor of this, all changes would become more easily readable for users in the HTML format.\n\nThere is a risk that changes in contribs/modules would clutter the core changes. For example, today, even small changes in contrib/benchmark are listed in the changes file. But when this becomes part of the global changes file, not sure if all bm changes would be adequate to be listed there? ",
            "author": "Doron Cohen",
            "id": "comment-13041409"
        },
        {
            "date": "2011-05-31T04:42:19+0000",
            "content": "\nThere is a risk that changes in contribs/modules would clutter the core changes. For example, today, even small changes in contrib/benchmark are listed in the changes file. But when this becomes part of the global changes file, not sure if all bm changes would be adequate to be listed there?\n\nWell, I agree there is that risk, especially if releases continue to be yearly instead of more often.\n\nHowever, I think if we release more often, the risk subsides, because we would be presenting regular releases with a manageable set of consolidated CHANGES.\n\nIn other words, if you combine the core+contrib+benchmark+grouping changes in 3.2, is it really cluttered?\nI think the same goes for the solr changes.\n\nPersonally, if I was looking at the lucene CHANGES for version X, I would want to know that there is a new NRTCachingDirectory, that there are performance improvements to the Highlighter, and that lucene now supports result grouping...  ",
            "author": "Robert Muir",
            "id": "comment-13041413"
        },
        {
            "date": "2011-05-31T05:08:44+0000",
            "content": "I agree that with frequent releases this is less of an issue.\n\nWhat are your thoughts about trunk in this regard - would you like there 3 changes files, i.e. keep one for modules? ",
            "author": "Doron Cohen",
            "id": "comment-13041425"
        },
        {
            "date": "2011-05-31T05:18:18+0000",
            "content": "\nWhat are your thoughts about trunk in this regard - would you like there 3 changes files, i.e. keep one for modules?\n\nI guess I'd still like to say CHANGES should correspond to a product. If modules was actually a lucene-subproject, then\nI would say yes it should have a CHANGES, but I don't think thats what it is, and I'm not sure thats what we want it to be.\n\nCurrently its described as \"shared code\" between lucene and solr, but its such a work in progress its hard to tell...\nMaybe next week someone proposes a huge refactoring of lucene core into modules/index, modules/codecs, modules/search or \nsomething (we could still produce one jar file, this is just about how we manage the source!)\n\nI guess thats my personal opinion of what I'd love to see happen, that lucene/ goes away and our source code really is\nmodular and organized in a way that makes sense... and that all the code in there is first-class (no contribs), if we \nwant a sandbox we can do that somewhere else.\n\nHaving said all this, I know I didn't actually answer your question... I guess for now we could have a third CHANGES file\nat least temporarily until we figure it all out? 3 is still a lot better than 12, but 2 would be best! ",
            "author": "Robert Muir",
            "id": "comment-13041429"
        },
        {
            "date": "2011-05-31T05:45:24+0000",
            "content": "Agreed, 3 for now, and then we'll see... ",
            "author": "Doron Cohen",
            "id": "comment-13041439"
        },
        {
            "date": "2013-10-02T00:20:25+0000",
            "content": "this was resolved long, long ago.... ",
            "author": "Hoss Man",
            "id": "comment-13783514"
        }
    ]
}