{
    "id": "LUCENE-6916",
    "title": "BaseDirectoryTestCase should use try-with-resources for its Directories",
    "details": {
        "resolution": "Unresolved",
        "affect_versions": "None",
        "components": [],
        "labels": "",
        "fix_versions": [],
        "priority": "Minor",
        "status": "Open",
        "type": "Improvement"
    },
    "description": "I'm playing around with writing a nio2 FileSystem implementation for HDFS that will work with Directory, and it currently leaks threads everywhere because if a BaseDirectoryTestCase test fails it doesn't close its Directory.  This obviously won't be a problem if everything passes, but it will probably be a while before that's true and it makes iterative development a bit of a pain.",
    "attachments": {
        "LUCENE-6916.patch": "https://issues.apache.org/jira/secure/attachment/12775305/LUCENE-6916.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-15035898",
            "author": "Alan Woodward",
            "date": "2015-12-02T14:45:51+0000",
            "content": "Patch.  I've only wrapped Directory usage with try-with-resources for now, but it could be extended to all the input and outputstreams as well. "
        },
        {
            "id": "comment-15035901",
            "author": "Robert Muir",
            "date": "2015-12-02T14:47:09+0000",
            "content": "I'm not sure we should do this, it makes test cases significantly harder to read, but at what benefit?\n\nWe should not be failing on file leaks if the test already fails. "
        },
        {
            "id": "comment-15035909",
            "author": "Alan Woodward",
            "date": "2015-12-02T14:57:03+0000",
            "content": "It's FileSystem leaks rather than file leaks for me, but it's a fairly unusual case I know.\n\nIt doesn't seem harder to read to me, but I guess that's subjective anyway   I can always just copy the test into my own project and make the changes there if it makes things more difficult for everybody else. "
        },
        {
            "id": "comment-15035919",
            "author": "Robert Muir",
            "date": "2015-12-02T15:01:21+0000",
            "content": "\nWell, my issue is that:\n\n\ttry-with definitely adds complexity, its like try/catch but with more complexity on top.\n\tits \"optimizing for a failure case\"\n\tit is not an issue for any directories in lucene.\n\tonce its done here, i am worried about a precedent, where every single lucene test must be in try-with.\n\n "
        },
        {
            "id": "comment-15035927",
            "author": "Robert Muir",
            "date": "2015-12-02T15:06:49+0000",
            "content": "And by the way, I am ok with the change if its contained to just this one file: because its purpose is to test directories. But I don't think we should do this across all tests in general, it has a real cost. "
        }
    ]
}