{
    "id": "SOLR-10113",
    "title": "hl.multiValuedSeparatorChar is undocumented",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Invalid",
        "status": "Resolved"
    },
    "description": "This parameter was created back in 2011, but isn't documented. Does it exist? Is it real? What does it do? Without docs, nobody knows.\n\nHere's the ticket that created it:\n\nhttps://issues.apache.org/jira/browse/SOLR-2049\n\nThis is the kind of thing that makes me feel crazy while using Solr.",
    "attachments": {
        "out-fullpage.png": "https://issues.apache.org/jira/secure/attachment/12852183/out-fullpage.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-02-11T05:45:36+0000",
            "content": "I see it documented:  https://cwiki.apache.org/confluence/display/solr/Highlighting   It's for the FastVectorHighlighter and PostingsHighlighter.  It's also listed in HighlightParams https://github.com/dsmiley/lucene-solr/blob/f5c6c3b796ff6be59a9811f0f4f69cd6e8c0a3cd/solr/solrj/src/java/org/apache/solr/common/params/HighlightParams.java#L78-L78  with the markings for FVH and PH.  In my IDE I can click on this param and easily see the referring call sites.\n\nCan you offer a specific suggestion to improve the documentation? ",
            "author": "David Smiley",
            "id": "comment-15862234"
        },
        {
            "date": "2017-02-11T05:59:49+0000",
            "content": "A just attached a screenshot of Google....Cwiki is nowhere to be found. ",
            "author": "Mike Lissner",
            "id": "comment-15862237"
        },
        {
            "date": "2017-02-11T05:59:55+0000",
            "content": "Sorry, weird. I think Google is just utterly failing us here, because the cwiki page doesn't come up at all when searching for parameter. In fact, I never once landed on the cwiki while trying to debug my highlighting this week, so something weird is going on there. Maybe it's time to redirect the old wiki pages? At least in this case the new page looks MUCH better. ",
            "author": "Mike Lissner",
            "id": "comment-15862238"
        },
        {
            "date": "2017-02-11T06:02:02+0000",
            "content": "I'm resolving, but I still think something is super weird here, and my needs for documentation weren't met without filing this issue. You could say I need to just go straight to the cwiki, but that's not what I do for any other project. Google is to go to, and it's failing. Weird. ",
            "author": "Mike Lissner",
            "id": "comment-15862240"
        },
        {
            "date": "2017-02-11T06:19:36+0000",
            "content": "I agree that Google's results in this instance aren't good.  Just now I wiped out the wiki's HighlightingParameters page and pointed it at The Solr Reference Guide, because the wiki now offers no special value on this matter.  I'm glad you like the new ref guide page; I spent a lot of time refactoring and improving highlight documentation (with help from others too!) a few weeks ago.  BTW the ref guide online is always for the latest & greatest Solr changes so, for example, if you want to try out the UnifiedHighlighter and you aren't yet using 6.4 then you'll have to upgrade. ",
            "author": "David Smiley",
            "id": "comment-15862251"
        },
        {
            "date": "2017-02-11T06:20:34+0000",
            "content": "One point in Google's favor though is an excerpt from my book :-P ",
            "author": "David Smiley",
            "id": "comment-15862252"
        },
        {
            "date": "2017-02-11T06:26:04+0000",
            "content": "I mean, really, I should just be using your book, obviously. \n\nThanks again. Glad we could wipe out some old junk. Always satisfying. ",
            "author": "Mike Lissner",
            "id": "comment-15862254"
        },
        {
            "date": "2017-02-11T20:34:24+0000",
            "content": "Mike:\n\nMy motivation is a little different, I'm just tired of wading through Google searches that are from 2009 or something... so my go-to is to download the entire PDF version of the ref guide (any CWiki page has a link in the upper left to download older versions too) and search that local PDF first. All 600+ (700?) pages.....\n ",
            "author": "Erick Erickson",
            "id": "comment-15862519"
        }
    ]
}