{
    "id": "SOLR-10044",
    "title": "Snap package for Solr",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Do",
        "status": "Closed"
    },
    "description": "Yesterday I completed code for having a snap package for Solr. You can find source code in https://github.com/rmescandon/solr-snap.\nIncludes:\n\n\tSolr 6.4.0 release as a daemon\n\tHook creating a core for nextant by default, when installed\n\n\n\nObviously this is an initial idea and can be modified or complete with whatever you consider needed or better.\n\nYou can clone source code and try it:\n\n\tgit clone git@github.com:rmescandon/solr-snap.git\n\tsnapcraft\n\tsnap install <package> --dangerous",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-01-27T15:34:32+0000",
            "content": "I wasn't sure what a snap package was and found http://snapcraft.io/. There aren't any packages (deb, rpm, etc) within Solr yet. It you are looking for people to test/try it you probably want to post on the solr-user mailing list.  ",
            "author": "Kevin Risden",
            "id": "comment-15843005"
        },
        {
            "date": "2017-01-27T18:56:28+0000",
            "content": "What does this do that's different/better than the service installer script that comes with Solr?  Have we made some kind of mistake in that script that you're trying to correct?\n\nThe config seems to be limiting the download to a single Apache mirror in Madrid.  That's will probably be less than ideal for anyone outside of Europe, and if enough people use it, will result in that mirror server's Internet connection getting overloaded.  Also, the tarball you've referenced is going to disappear from that mirror server as soon as 6.4.1 or 6.5.0 is released. ",
            "author": "Shawn Heisey",
            "id": "comment-15843326"
        },
        {
            "date": "2017-01-27T19:31:05+0000",
            "content": "The .tgz is only downloaded at built-time, so it really only matters to the person building the .snap package. Once built, the .snap can be hosted anywhere, but ideally it would at least be in the Snap Store hosted by Canonical, because that's used by default. New snaps can be built that use 6.4.1 or 6.5.0 once those are released (or even before, and published to the 'edge' and 'beta' release channels in the store) ",
            "author": "Michael Hall",
            "id": "comment-15843367"
        },
        {
            "date": "2017-01-27T20:02:02+0000",
            "content": "Linking SOLR-5176 as semi-related i.e. also about packaging. ",
            "author": "Christine Poerschke",
            "id": "comment-15843402"
        },
        {
            "date": "2017-05-13T21:47:31+0000",
            "content": "Roberto Mier, I believe your best chance if you want to see a maintained snap package is simply to go ahead and submit it and maintain it yourself, then invite interested committers and others to join as admins. ",
            "author": "Jan Høydahl",
            "id": "comment-16009514"
        },
        {
            "date": "2017-05-16T09:38:58+0000",
            "content": "I cannot see that there is any code changes in Solr required in order to provide a Solr snap package. Is that correct, Roberto Mier?\n\nTherefore I'll close this here as Won't do. Please re-open if there is actually a need for some code/config changes in solr core to ease the creation of a Snap package.\n\nI will encourage those who want to help with the snap package development to head over to the GitHub linked in the issue description and join the discussion there. ",
            "author": "Jan Høydahl",
            "id": "comment-16012069"
        }
    ]
}