{
    "id": "SOLR-1030",
    "title": "Facet counts are not correct (or total document count is not correct as they do not match) on some searches",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "There isn't much detailed evidence for this one yet, but hopefully it rings a bell with someone who made changes in this area recently...\n\nSince updating to the tip from our previous use of the tip from around Jan 9, 2009 (seems to be previous to r733656 as well) we are now seeing facet counts no longer match total document count.  This is through distributed search and I have not verified that it only happens on distributed vs. single shard search so it could be on both.\n\nFor example, on a single valued field with one facet value set as a fq filter, combined with a text search on a simple term \"science\", the following is the facet count:\n\n8,294,284\n\nAnd the total document count for the same results is:\n\n8,294,274\n\nsome debug info (not sure why the filter query is replicated more than once, but that shouldn't be harmful):\n\n\nuerystring\t  \t(science)\nQParser\t  \tOldLuceneQParser\nfilter_queries\t  \t[sys_content_type:(\"Journal Article\"), sys_content_type:(\"Journal Article\"), \nsys_content_type:(\"Journal Article\"), sys_content_type:(\"Journal Article\"), \nsys_content_type:(\"Journal Article\"), sys_content_type:(\"Journal Article\"), \nsys_content_type:(\"Journal Article\"), sys_content_type:(\"Journal Article\"), \nsys_content_type:(\"Journal Article\"), sys_content_type:(\"Journal Article\")]\nrawquerystring\t  \t(science)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jayson Minard",
            "id": "comment-12675405",
            "date": "2009-02-20T17:27:04+0000",
            "content": "The last known working revision should be 733,656 as that includes patches we passed through Shalin and counts matched at that time.  Appears to be previous to this revision. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12675412",
            "date": "2009-02-20T17:52:45+0000",
            "content": "maybe we time out on some shards?\n\nA timeout will log an exception. Might be worth combing through the log files to be sure. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12675413",
            "date": "2009-02-20T17:55:30+0000",
            "content": "Another point, consistency is not guaranteed between query phases in the current implementation. So if a commit happens on a shard in between a query phase and facet refinement phase, you may see different counts. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675415",
            "date": "2009-02-20T17:57:02+0000",
            "content": "The data is static, no updates. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675416",
            "date": "2009-02-20T17:57:51+0000",
            "content": "And the data hasn't changed since the last version of Solr was used (roughly r733656) and either no one noticed it before, or the problem didn't previously exist.  Checking now for timeouts in the logs. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675417",
            "date": "2009-02-20T18:00:35+0000",
            "content": "Logs on aggregator instance of Solr show no exceptions.  Logs on query slaves show no exceptions.  (or errors) "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675418",
            "date": "2009-02-20T18:02:01+0000",
            "content": "We are reverting to r733656 to test there again and see if the problem is new since that revision or if we just now noticed it.  There is a bug in our database showing a count problem from last month but it appears to be related to duplicate docs on different shards rather than this issue. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675421",
            "date": "2009-02-20T18:11:25+0000",
            "content": "I just found a bug in our database from the 27th showing this issue dates back to r733656 as well and before.  So it is an older issue.\n\nEnd up with cases where facets show counts such as 264 where total results are 249.   "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675436",
            "date": "2009-02-20T18:51:40+0000",
            "content": "I think this might indeed be duplicate docs between shards causing the difference.  As we increate page size from 0 to 20, going by 1 each time, we slowly get a higher and higher count difference.  And we find duplicate docs across shards in this result set for the page of results being shown. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12675447",
            "date": "2009-02-20T19:38:10+0000",
            "content": "Yes, duplicate docs on shards would indeed cause facet counts to be too high.\nDuplicate docs is an error condition that we can handle relatively gracefully, but not without some inconsistencies. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12675466",
            "date": "2009-02-20T20:35:09+0000",
            "content": "Yeah, we had the assumption that the source data did not have duplicate docs across shards, turns out that it does.  Otherwise we would have checked that first.  I'll keep an eye on this one for a bit, but most likely just the duplicate doc issue. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12706212",
            "date": "2009-05-05T21:41:01+0000",
            "content": "Closing... assuming that this is a duplicate docs on shards issue since we haven't seen it elsewhere. "
        }
    ]
}