{
    "id": "SOLR-12867",
    "title": "Async request status: Not getting all status messages because a response from one node will overwrite previous responses from that node",
    "details": {
        "type": "Improvement",
        "status": "Resolved",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Major",
        "resolution": "Duplicate",
        "affect_versions": "None"
    },
    "description": "Problem noticed with REQUESTSTATUS on an async collections API BACKUP call.\n\nNot all of the responses from different nodes in the collection are being reported.  According to Shalin Shekhar Mangar, this is because multiple responses from a node are overwriting earlier responses from that node.\n\nSteps to reproduce:\n\n\n\tStart a cloud example with \"bin/solr -e cloud\" in a 7.5.0 binary download.  Tell it that you want 3 nodes, accept defaults for all other questions.\n\tCreate a collection with 30 shards:\n\t\n\t\tbin\\solr create -c test2 -shards 30 -replicationFactor 2\n\t\n\t\n\tStart an async backup of the collection.  On a Windows system, the URL might look like this:\n\t\n\t\thttp://localhost:8983/solr/admin/collections?action=BACKUP&name=test2&collection=test2&location=C%3A%5CUsers%5Celyograg%5CDownloads%5Csolrbackups&async=sometag\n\t\n\t\n\tAfter a few seconds (to give the backup time to complete), request the status of the async operation:\n\t\n\t\thttp://localhost:8983/solr/admin/collections?action=REQUESTSTATUS&requestid=sometag\n\t\n\t\n\n\n\nThe response will only contain individual statuses for 3 of the 30 shards.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16649730",
            "content": "Filed the issue as a general async problem.  If it turns out that it's not a general problem and is in fact only happening with the BACKUP action, we'll adjust the description. ",
            "author": "Shawn Heisey",
            "date": "2018-10-15T05:08:49+0000"
        },
        {
            "id": "comment-16649738",
            "content": "Something that might indicate a related but separate problem:  The user who reported this issue on the IRC channel got responses about 10 shards from a 30 shard collection ... but they have more than ten nodes in their cluster.  So there MIGHT be something artificially limiting the response count to 10. ",
            "author": "Shawn Heisey",
            "date": "2018-10-15T05:13:47+0000"
        },
        {
            "id": "comment-16650291",
            "content": "Hi Shawn,\n\nUnfortunately this has been a known bug for a while :/ I had created SOLR-12291 to track the work but neer got around to committing it. ",
            "author": "Varun Thacker",
            "date": "2018-10-15T14:27:14+0000"
        },
        {
            "id": "comment-16650300",
            "content": "Varun Thacker, sounds like the correct thing to do is close this as a duplicate and add a note to SOLR-12291 saying that BACKUP is also affected. ",
            "author": "Shawn Heisey",
            "date": "2018-10-15T14:35:42+0000"
        }
    ]
}