{
    "id": "SOLR-5591",
    "title": "SolrJ should use multipart forms for Solr Cloud",
    "details": {
        "affect_versions": "4.5.1",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Once SOLR-5590 is fixed, and the proper content-encoding is specified in SolrJ's HttpSolrServer class, SolrJ should completely support multipart forms once more.  When that is done, SolrCloud should also use multipart forms, since otherwise the http GET/POST headers may exceed web server limits.  See CONNECTORS-839 for a description of the issue.  (Once again, the ManifoldCF project overrode SolrJ classes to make the right thing happen, but we'd like to remove our hack eventually.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Uwe Schindler",
            "id": "comment-13858798",
            "date": "2013-12-30T13:39:23+0000",
            "content": "This is no longer a web server limitation. Solr completely parses the POST content on its own. The multipart or formdata limits are solely solrconfig settings. The servlet container has no limitations anymore.  Solr just parses the input stream. "
        },
        {
            "author": "Karl Wright",
            "id": "comment-13858805",
            "date": "2013-12-30T13:48:05+0000",
            "content": "Hi Uwe,\n\nThanks for the clarification.  When did this change?  I'd like to make sure the person who filed CONNECTORS-839 is aware of it. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13858806",
            "date": "2013-12-30T13:48:22+0000",
            "content": "In addition multipart parsing has a temporary file overhead. So I would only use it for huge POST data. But take care: it is also limited by default. "
        },
        {
            "author": "Karl Wright",
            "id": "comment-13858810",
            "date": "2013-12-30T13:52:36+0000",
            "content": "Hi Uwe,\n\nSolr behavior differs when multipart post is used vs. other methods, specifically when Solr Cell is in use.  If this could be resolved so that there were indeed no differences, I would be happy to use multipart only conditionally.  See CONNECTORS-623. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13858814",
            "date": "2013-12-30T13:58:34+0000",
            "content": "Hi. I am on mobile only. Please look in Changes.txt. I think it changed during this year. But the solrconfig defaults for formdata and multipart limits are different, too. But webserver is now out of game. "
        }
    ]
}