{
    "id": "SOLR-1939",
    "title": "DataImportHandler reports success after running out of disk space",
    "details": {
        "affect_versions": "1.4",
        "status": "Reopened",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "DataImportHandler reports success after running out of disk space (.properties file is updated with new time stamps and status page reports success). Out of disk space exceptions should be treated more like datasource-level exceptions than like document-level exceptions (i.e. they should cause the import to report failure).\n\nOriginal discussion here:\nhttp://lucene.472066.n3.nabble.com/DataImportHandler-and-running-out-of-disk-space-td835125.html",
    "attachments": {
        "notes_for_SOLR1939.rtf": "https://issues.apache.org/jira/secure/attachment/12554429/notes_for_SOLR1939.rtf",
        "SOLR-1939.patch": "https://issues.apache.org/jira/secure/attachment/12554430/SOLR-1939.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13043688",
            "date": "2011-06-03T16:46:32+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106248",
            "date": "2011-09-16T14:50:14+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237077",
            "date": "2012-03-23T20:31:41+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13294750",
            "date": "2012-06-14T00:30:01+0000",
            "content": "Removing fix version since this issue hasn't gotten much attention lately and doesn't appear to be a priority for anyone.  \n\nAs always: if someone wants to take on this work they are welcome to do so at any time and the target release can be revisited\n "
        },
        {
            "author": "John Whelan",
            "id": "comment-13501614",
            "date": "2012-11-21T00:36:49+0000",
            "content": "I added an attempt at a fix for this issue. I also attached a 'notes' file that discusses some of the shortcomings of the fix. (This is my first attempt at following http://wiki.apache.org/solr/HowToContribute ) "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13835742",
            "date": "2013-11-30T13:30:01+0000",
            "content": "2013 Old JIRA cleanup "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13836065",
            "date": "2013-12-01T16:51:46+0000",
            "content": "Thanks for the patch John and sorry that I'm so late in reviewing it.\n\nI think a better way to handle this would be to throw a SEVERE level wrapped exception from the SolrWriter itself instead of handling it in DocBuilder. That is also how data source level exceptions are handled.\n\nThe problem with this patch is that it aborts on any IOException which means that a connect or read timeout can also abort indexing. So we need to be very careful about throwing this only if Solr runs out of disk space. "
        },
        {
            "author": "James Strassburg",
            "id": "comment-14241299",
            "date": "2014-12-10T16:00:15+0000",
            "content": "Would it be worthwhile to, in the case of IOException, attempt to check if free disk space was below some threshold and only abort in that case. If the free disk space check failed with IOException or if free disk space was above the threshold we could fail the document and attempt to continue as before. I think this would be better than, say, attempting to parse exception messages which could vary from platform to platform. The problem then becomes choosing the free disk space threshold to use. "
        }
    ]
}