{
    "id": "SOLR-8033",
    "title": "useless if branch (commented out log.debug in HdfsTransactionLog constructor)",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.0,                                            5.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "In method HdfsTransactionLog() of class HdfsTransactionLog (solr\\core\\src\\java\\org\\apache\\solr\\update\\HdfsTransactionLog.java)\n\nThe if branch presented in the following code snippet performs no actions, we should add more code to handle this or directly delete this if branch.\n\nHdfsTransactionLog(FileSystem fs, Path tlogFile, Collection<String> globalStrings, boolean openExisting) {\n  ...\n    try {\n      if (debug) \n{\n        //log.debug(\"New TransactionLog file=\" + tlogFile + \", exists=\" + tlogFile.exists() + \", size=\" + tlogFile.length() + \", openExisting=\" + openExisting);\n      }\n...\n}",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-10T19:48:16+0000",
            "author": "Shawn Heisey",
            "content": "It looks like that entire if statement can be removed ... but it was likely left in place, commented out, on purpose, so that the next time the developer needs to figure out a problem in that code, it can be easily re-added for testing, and then commented out again.  HDFS support in Solr is a fairly recent addition, and tracking down problems is likely not very easy, so code like this can be critical for developer sanity. ",
            "id": "comment-14739462"
        },
        {
            "date": "2015-10-14T21:19:06+0000",
            "author": "Christine Poerschke",
            "content": "TransactionLog as the base class of HdfsTransactionLog has an equivalent (not commented out) log.debug statement i.e. perhaps just removing the commenting out i.e. re-instating the debug log statement is an alternative to removal of the entire if-statement?\n\nI also notice that the HdfsTransactionLog constructor takes a tlogDfsReplication argument and we might wish to include that in a re-instated debug log statement. ",
            "id": "comment-14957797"
        },
        {
            "date": "2015-10-23T19:43:19+0000",
            "author": "Christine Poerschke",
            "content": "Hello songwanging - if you'd like to create and attach a patch for this change (removal or re-instatement), I'd be happy to apply and commit it.\n\ncc/fyi Mark Miller if you have any thoughts on removal vs. re-instatement of this logging, please let us know. Thank you. ",
            "id": "comment-14971710"
        },
        {
            "date": "2015-10-24T02:47:39+0000",
            "author": "songwanging",
            "content": "Hi Christine Poerschke, could you help create a patch for this issue, thanks a lot, I am not familiar with the process of creating a patch.  ",
            "id": "comment-14972307"
        },
        {
            "date": "2015-10-24T12:34:54+0000",
            "author": "Mark Miller",
            "content": "Looks commented out in the hdfs version and not the regular version because it's a cut and paste and Path does not have the same methods as File. So it would need a simple tweak or two to work. ",
            "id": "comment-14972574"
        },
        {
            "date": "2015-10-24T16:21:19+0000",
            "author": "Erick Erickson",
            "content": "songwanging It's pretty easy, assuming you have subversion on your machine, just switch to the base directory (the parent of solr) and type:\nsvn diff > SOLR-8033.patch\n\nIf you have an IDE, there's usually a \"vcs\" menu and an option to create a patch.\n\nThere's lots of detail here:\nhttps://wiki.apache.org/solr/HowToContribute#Generating_a_patch\n ",
            "id": "comment-14972671"
        }
    ]
}