{
    "id": "SOLR-7137",
    "title": "Upgrade to Tika 1.7 in 4_10_3 branch",
    "details": {
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.3",
        "status": "Closed",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "I have been trying out SolrCell as an alternative to ingesting around 40M images using Tesseract/OCR and Tika. I noticed in 4.10.3 Tika is pinned to 1.5. In 1.5 Tika and in SolrCell 4.10.3, only about 5600 images of a subset of 50,000 are ingested when I run a series of 50k cURL commands to the extract handler. I had a feeling it has something to do with the fact that some of the characters extracted are oddball characters (4@#@#/ ^^^^) due to Tesseract not always extracting the right text. But then I remembered Tesseract didn't land in Tika until 1.7.\n\nSo regardless, I thought I'd upgrade the 4.10.x branch to Tika 1.7. This is a trivial patch to do so, attached (Tika + compress updates). Now all 50K images on the 50K subset are ingested, but I'm noticing something else weird. Despite the fact that Tesseract is called, and despite the fact that on certain images I can verify text is extracted by running Tesseract from the command line on that file, all I am getting in the \"content\" field of SolrCell is a bunch of \"\\n \\n \\n \\n \\n \\n\" text. So the text is extracted, there are weird characters, but they don't make it into Solr. Extremely odd.",
    "attachments": {
        "SOLR-7137.Mattmann.022115.patch.txt": "https://issues.apache.org/jira/secure/attachment/12700065/SOLR-7137.Mattmann.022115.patch.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-21T23:50:53+0000",
            "author": "Chris A. Mattmann",
            "content": "I originally set this to a blocker, sorry. To me this is a blocker, since now I have to use my alternative method to ingest (which pushes Tika to the client side using OODT; but I was hoping to do all of this with SolrCell). So to me it's at least critical/Major, but it's up to you guys to decide of course. ",
            "id": "comment-14331949"
        },
        {
            "date": "2015-02-22T19:20:50+0000",
            "author": "Uwe Schindler",
            "content": "Use Solr 5. It has Tika 1.7 ",
            "id": "comment-14332318"
        },
        {
            "date": "2015-02-22T19:38:49+0000",
            "author": "Uwe Schindler",
            "content": "We will not update TIKA in a bugfix version.\n\nYou can replace the JAR files easily in Solr 4.10, so it would run with TIKA 1.7 (just some test cases may fail because of some minor problems). But the problem with Tesseract parser is a different issue. We may fix it in a possible 4.10.4 release. ",
            "id": "comment-14332323"
        },
        {
            "date": "2015-02-22T19:41:39+0000",
            "author": "Uwe Schindler",
            "content": "Sorry, resolution was wrong ",
            "id": "comment-14332327"
        },
        {
            "date": "2015-02-22T19:43:31+0000",
            "author": "Uwe Schindler",
            "content": "FYI, the patch for a full upgrade to TIKA 1.7 is in SOLR-6991 (yours is missing to upgrade all required dependencies). ",
            "id": "comment-14332329"
        },
        {
            "date": "2015-02-22T19:44:55+0000",
            "author": "Uwe Schindler",
            "content": "See also SOLR-6488 (must be applied first). ",
            "id": "comment-14332332"
        },
        {
            "date": "2015-02-22T19:47:54+0000",
            "author": "Chris A. Mattmann",
            "content": "Wow that's a lot Uwe! My patch worked for me on the 4_10_3 branch, along with SOLR-7139 (and updating solrconfig.xml to not set div tags to _ignored), so maybe it's b/c I'm only doing image parsing/OCR and not running any of the other deps. ",
            "id": "comment-14332334"
        },
        {
            "date": "2015-02-22T20:05:11+0000",
            "author": "Uwe Schindler",
            "content": "Most of those patches is hashes of JAR files and some License changes. In fact, its indeed enough to update the ivy.properties file with all upgraded versions; it would just be the release process and validation tasks of Solr not pass.\n\nAs said before, it is also enough to download TIKA 1.7 and drop its JAR files into the contrib/extraction/lib folder of your Solr installation  ",
            "id": "comment-14332336"
        },
        {
            "date": "2015-02-22T20:07:13+0000",
            "author": "Chris A. Mattmann",
            "content": "Thanks dude got it ",
            "id": "comment-14332337"
        }
    ]
}