{
    "id": "SOLR-2723",
    "title": "If you don't choose a shard name for a SolrCore, the system should auto assign shard names.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When you first boot up a node with the collection files to use, you might also pass how many slices you want - if you choose 3 slices, the first 3 nodes that come up would each go to a different slice and get a unique shard name - further nodes that come up would be replicas in each slice and get one of the 3 shard names.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13094407",
            "date": "2011-08-31T10:01:33+0000",
            "content": "Hmm, should startup sequence determine role? Sceptical, but if this is on first boot only, and only if not choosing a shard name, perhaps... "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13116788",
            "date": "2011-09-28T20:52:58+0000",
            "content": "I've committed some initial work here on the solrcloud branch. Super early stuff, just working on getting frameworks out so we can iterate, but has a basic collection lock impl, and assigns 3 slices before it starts evenly adding replicas.\n\nStill need a way to set the number of slices (core creation param?) - it's conveniently hard coded to 3.\n\nMight want to make this pluggable, but def not yet. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13141182",
            "date": "2011-11-01T13:57:42+0000",
            "content": "This is currently implemented with a very simple collection lock - since we are likely going to have an overseer, we should likely move from this impl to having the overseer assign. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13161392",
            "date": "2011-12-02T03:09:40+0000",
            "content": "Sami has refined this with SOLR-2880 - now an Overseer assigns nodes to shards rather than using the simple collection lock. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13196318",
            "date": "2012-01-30T19:01:18+0000",
            "content": "Thanks! "
        }
    ]
}