{
    "id": "SOLR-6624",
    "title": "Spelling mistakes in the Java source",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "affect_versions": "6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Trivial"
    },
    "description": "I found spelling mistakes in the Solr java source files viz. recieved instead of received.",
    "attachments": {
        "solr-6624.patch": "https://issues.apache.org/jira/secure/attachment/12674860/solr-6624.patch",
        "SweetSpotSimilarityFactory.patch": "https://issues.apache.org/jira/secure/attachment/12674879/SweetSpotSimilarityFactory.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-10-14T22:06:11+0000",
            "author": "Gregory Chanan",
            "content": "+1. ",
            "id": "comment-14171613"
        },
        {
            "date": "2014-10-14T23:44:00+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1631924 from gchanan@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1631924 ]\n\nSOLR-6624: Spelling mistakes in the Java source ",
            "id": "comment-14171725"
        },
        {
            "date": "2014-10-14T23:48:01+0000",
            "author": "Ahmet Arslan",
            "content": "a few typos more ",
            "id": "comment-14171727"
        },
        {
            "date": "2014-10-15T01:41:45+0000",
            "author": "Yonik Seeley",
            "content": "Feel free to just report spelling mistakes on the mailing lists... we don't have to go through JIRA for trivial changes.\n\nOh, and we shouldn't add CHANGES.txt entries for trivial changes either... source code control systems keep an exhaustive list for those who are really interested. ",
            "id": "comment-14171860"
        },
        {
            "date": "2014-10-15T01:46:52+0000",
            "author": "Mark Miller",
            "content": "If you are a committer I agree. If not, I don't. An email about a fix is easily ignored and lost. And any contribution, no matter how small, should go into changes as credit IMO. This is exactly what the trivial priority is for.  ",
            "id": "comment-14171863"
        },
        {
            "date": "2014-10-15T02:18:27+0000",
            "author": "Yonik Seeley",
            "content": "And any contribution, no matter how small, should go into changes as credit IMO. \n\nI disagree.  CHANGES serves a dual purpose.  The primary purpose is for users to read through to discover non-trivial changes and bug fixes.  The secondary purpose is to give credit to contributions, but we only tack those on if it's a change that merits going into CHANGES in the first place.  Trivial changes should not be added to CHANGES.  If people are interested in them, we can give a URL that has everything (or we can programmatically construct it).\n\nThere have been tons of spelling mistakes and people pointing them out in the past.  This is the first time an entry into CHANGES has been made.\n\n/opt/code/heliosearch/solr$ grep -i spelling CHANGES.txt\n* SOLR-6624 Spelling mistakes in the Java source (Hrishikesh Gadre)\n* SOLR-2585: Context-Sensitive Spelling Suggestions & Collations.  This adds support\n* SOLR-2576: Remove deprecated SpellingResult.add(Token, int).\n* SOLR-2576: Deprecate SpellingResult.add(Token token, int docFreq), please use\n  SpellingResult.addFrequency(Token token, int docFreq) instead.\n  methods using the new SpellingOptions class, but are not required to.  While this change is\n  backward compatible, the trunk version of Solr has already dropped support for all but the SpellingOptions method. (gsingers)\n57. SOLR-1204: Enhance SpellingQueryConverter to handle UTF-8 instead of ASCII only.\n52. SOLR-572: Added SpellCheckComponent and org.apache.solr.spelling package to support more spell \n\n ",
            "id": "comment-14171894"
        },
        {
            "date": "2014-10-15T03:51:25+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "I agree with Yonik. Fixing typos (and code formatting) shouldn't be required to go via Jira and they don't belong in the change log. ",
            "id": "comment-14171949"
        },
        {
            "date": "2014-10-15T07:41:11+0000",
            "author": "Gregory Chanan",
            "content": "Thanks for the feedback Yonik, Mark, and Shalin.\n\nNot outright requiring a JIRA seems fine, though for me personally I'd end up filing them since it doesn't take much longer than sending an e-mail, gives a a central place for discussion (like this one!) that won't be lost in the depths of mail archives, and gives a a referenceable name.  Seems the benefit outweighs the cost to me.\n\nOn modifying CHANGES.txt I'm sensitive to to the concerns of keeping the changes in CHANGES.txt significant while also giving credit to contributors.  Perhaps it makes sense it cases like this to just include the contributors name in the commit message [i.e. \"SOLR-6624: Spelling mistakes in the Java source (Hrishikesh)]\" and not add it to the CHANGES.txt?  Thoughts? ",
            "id": "comment-14172105"
        },
        {
            "date": "2014-10-15T10:24:42+0000",
            "author": "Mark Miller",
            "content": "Jiras are up to the individual. Email is a poor substitute. A JIRA is not required, but a good idea if you actually want to see something changed. \n\nFor credit, there is plenty of insignificant stuff in Other. If a non committer is willing to take the time to contribute, we should credit them in CHANGES. I'll stick to erroring on providing credit to contributors for positive changes to the code. \n\nIn the end it is up to each committer. Personal, I won't waste my time trying to minimize anyone's contributions. Changes is as much about credit for non committers as anything. If someone takes the time to make a patch, into changes I'll put them.  ",
            "id": "comment-14172229"
        },
        {
            "date": "2014-10-17T00:21:40+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1632453 from gchanan@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1632453 ]\n\nSOLR-6624: Spelling mistakes in the Java source ",
            "id": "comment-14174518"
        },
        {
            "date": "2014-10-17T00:22:28+0000",
            "author": "Gregory Chanan",
            "content": "Committed to 5.0 and trunk, thanks for the patch Hrishikesh. ",
            "id": "comment-14174520"
        },
        {
            "date": "2015-02-23T05:01:24+0000",
            "author": "Anshum Gupta",
            "content": "Bulk close after 5.0 release. ",
            "id": "comment-14332699"
        }
    ]
}