{
    "id": "SOLR-6688",
    "title": "There should be no error about a non-required file admin-extra.html",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Minor"
    },
    "description": "I am using SOLR 4.10.1. I have a simple configuration with 2 cores. Every time I open the SOLR admin interface, I get the following errors:\n\n\nCan not find: admin-extra.html\nCan not find: admin-extra.menu-top.html\nCan not find: admin-extra.menu-bottom.html\n\n\n\nAs far as I know, the files are optional. Therefore I should not get any error, not even a warning.\n\nI do not want to create the files because I do not need them. The error should simply not be there.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-11-22T19:09:10+0000",
            "author": "Alexandre Rafalovitch",
            "content": "This is still happening in Solr 5 build with default examples (e.g. schemaless) once somebody starts clicking around the AdminUI. The Log and AdminUI gets 3 ERROR level messages:\n\n22/11/2014 14:03:51 \tERROR \tShowFileRequestHandler \tCan not find: admin-extra.menu-top.html [../solr-5.0.0-SNAPSHOT/server/solr/configsets/data_driven_schema_configs/conf/admin-extra.menu-top.html]\n22/11/2014 14:03:51 \tERROR \tShowFileRequestHandler \tCan not find: admin-extra.menu-bottom.html [.../solr-5.0.0-SNAPSHOT/server/solr/configsets/data_driven_schema_configs/conf/admin-extra.menu-bottom.html]\n22/11/2014 14:03:51 \tERROR \tShowFileRequestHandler \tCan not find: admin-extra.html [.../solr-5.0.0-SNAPSHOT/server/solr/configsets/data_driven_schema_configs/conf/admin-extra.html]\n\nI think this used to be on SEVERE level, but even on ERROR level it still implies that an action by user is required. ",
            "id": "comment-14222114"
        },
        {
            "date": "2015-05-06T10:35:48+0000",
            "author": "Marcos Loureiro",
            "content": "Alexandre Rafalovitch\n\nI was having the same issue, on the solrconfig.xml removed the tag <admin>\nAnd the error vanished\n\n  <!-- Legacy config for the admin interface -->\n  <admin>\n    <defaultQuery>:</defaultQuery>\n  </admin> ",
            "id": "comment-14530314"
        },
        {
            "date": "2015-07-24T15:05:11+0000",
            "author": "Tramel Jones",
            "content": "Is this still the preferred solution to the admin-extra errors?\n\nShould I keep the <admin> block commented out, or remove it completely?\n\nI am still experiencing the errors with the block commented out.  ",
            "id": "comment-14640547"
        },
        {
            "date": "2015-09-30T21:58:21+0000",
            "author": "Hoss Man",
            "content": "I am still experiencing the errors with the block commented out. \n\nyeah, i'm not sure what else Marcos may have done/tried but even w/o an <admin/> block in solrconfig.xml the UI still asks for those files and the ShowFileRequestHandler will still log an ERROR if the files can't be found – because as a generalized feature it doesn't know if/when a file not found is \"non important\"\n\nOne possibility would be to add an option to the ShowFileRequestHandler to indicate \"don't treat it as an error if this file can't be found\" but that seems really ugly to me.\n\nIn my opinion, the best option would be to update the Admin UI code so that it takes advantage of the \"list files\" feature that already exists in the ShowFileRequestHandler (ie: a request w/o a \"file\" param - which is how the \"Files\" tab in the UI is populated) so that the Overview tab only request the various \"admin extra\" files that the UI is looking for if it knows they exist (and are not hidden – which is already dealt with by the \"list files\" code).\n\nUpayavira - what do you think? that should be fairly straight forward right? ",
            "id": "comment-14938945"
        },
        {
            "date": "2015-09-30T22:14:15+0000",
            "author": "Upayavira",
            "content": "Chris Hostetter (Unused) I haven't yet implemented admin-extra in the new UI. I haven't yet seen any clear use-cases documented to give me any real idea of how it would be used.\n\nIf updating the ShowFileRequestHandler is possible, then I'd request a request param of ignoreMissingFiles=true. If that is set, and a file is missing, it just returns a 200 with content of \"\".\n\nWith this tweak, the old admin UI could easily be extended to request admin-extra.html?ignoreMissingFiles=true, and thus errors go away.\n\nPossible? ",
            "id": "comment-14938963"
        },
        {
            "date": "2015-09-30T22:49:12+0000",
            "author": "Hoss Man",
            "content": "Possible?\n\nPossible, but as I mentioned before – really ugly ... for example: someone looking at their Solr logs would see \"successful\" requests for these files, even if the file themselves were not surfaced in the UI.  this could be really confusing/frustrating if: a) you had a file permissions problem and couldn't figure out why the files you wanted weren't showing up; b) you'd deliberateily deleted (or hidden via the handler config) those files and couldn't understand why the logs are still there.\n\nAs i said: i really think the \"right\" solution is for the UI to look at the \"file listing\" from \"/admin/files\" and only ask for the \"extra\" files that it knows exist ... then there are no unneccessary requests from the UI for bogus files, no weird requests in the logs with HTTP status codes that are a \"lie\", and anyone trying to debug why a file they expect isn't showing up won't be lead astray.\n\nhaven't yet implemented admin-extra in the new UI. I haven't yet seen any clear use-cases documented to give me any real idea of how it would be used.\n\nis there a specific issue tracking the inclusion of (or the decision to deprecate/remove) that feature in the angular UI?  if the new UI officially eliminates this feature then this issue can probably be resolved as \"Not a problem\" as of 6.0, but i'd rather not hijack/conflate a long standing bug report with longer discussion about the merits of (re-)implementing the feature the bug affects in the new UI.\n\n(searching around I see some hodge podge comments from various people answering your question in the context of broader issues/threads but no single specifically on topic place for folks to document usages/goals for \"admin-extra\" and/or alternative solutions) ",
            "id": "comment-14939004"
        },
        {
            "date": "2016-05-09T21:14:29+0000",
            "author": "James Sterling",
            "content": "This is happening to me too on 5.3.1 ",
            "id": "comment-15277054"
        },
        {
            "date": "2016-05-09T21:19:12+0000",
            "author": "Upayavira",
            "content": "The new admin UI, which is the default on 6.0+, does not implement the admin-extra functionality, for want of a good reason to implement it.\n\nI agree with Chris Hostetter (Unused) above, we should have a separate \"we won't implement admin-extra\" ticket, and mark this one as \"not a problem for 6.0+. ",
            "id": "comment-15277060"
        },
        {
            "date": "2016-07-23T13:19:13+0000",
            "author": "Alexandre Rafalovitch",
            "content": "We can probably close this one by now. ",
            "id": "comment-15390691"
        },
        {
            "date": "2016-09-30T12:28:53+0000",
            "author": "Gethin James",
            "content": "Are you, at least, going to remove the \"admin-extra\" div from the screen? Its rather misleading if it can't be used. ",
            "id": "comment-15535856"
        },
        {
            "date": "2016-10-03T10:27:39+0000",
            "author": "Alexandre Rafalovitch",
            "content": "SOLR-8140 is where that will happen. ",
            "id": "comment-15542082"
        }
    ]
}