{
    "id": "SOLR-1999",
    "title": "Download HEADER should not have pointer to nightly builds",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Resolved"
    },
    "description": "The file HEADER.html should not have a pointer to nightly builds.\n\nNightly builds should be reserved for developers, and not advertised to the general public.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12888640",
            "date": "2010-07-15T00:31:47+0000",
            "content": "Nightly builds should be reserved for developers, and not advertised to the general public.\n\nCorrect, I updated that file (on minotaur should take a bit to show up on www) to remove that link and replaced it with...\n\n\n<p>For information about working with the most current (unofficial, unreleased)\nsource code for Solr, please see the <a href=\"http://wiki.apache.org/solr/HackingSolr\">Solr Wiki</a>.\n\n "
        },
        {
            "author": "Sebb",
            "id": "comment-12891116",
            "date": "2010-07-22T12:11:38+0000",
            "content": "Sorry, but that is still advertising nightly builds to the general public, albeit indirectly.\n\nIf a developer really wants to find nightly builds, they should be able to do so via the developer pages, not the pages intended for all users. "
        },
        {
            "author": "Sebb",
            "id": "comment-12891369",
            "date": "2010-07-22T22:31:31+0000",
            "content": "See:\n\nhttp://www.apache.org/dev/release.html#what\n\n\"Do not include any links on the project website that might encourage non-developers to download and use nightly builds, snapshots, release candidates, or any other similar package.\" "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12891376",
            "date": "2010-07-22T22:39:14+0000",
            "content": "\nDevelopers are members of the general public – any page a developer can see can be seen by anybody else as well.\n\nWhile i agree the previous link was bad, i quite frankly don't understand your concern with the current situation....\n\nHEADER.html doesn't even mention nightly builds – it directs people interested in \"(unofficial, unreleased) source code for Solr\" to a wiki page which makes it very clear it's audience is developers, and which has info on how to check out the development branches.\n\nAdmittedly that HackingSolr page does mention that we have a nightly build system, so a non-developer might click the link about hacking on the source and then get intersted in the nightly builds – but it doesn't even link directly to any builds – instead it links to a hudson page where there is a list of branches that have builds, and if you click on one of those you can get a branch build status page and from there you can scroll all the way to the bottom to click on an artifacts link and from there you can actually click on a link to download something that could be called a nightly build.\n\nThat seems like it fits the definition of \"developer pages, not the pages intended for all users.\"\n\nI'm hard pressed to imagine a way to make it harder for non-developers to find those builds while still linking to those hudson pages for \"developers\" "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12891378",
            "date": "2010-07-22T22:45:01+0000",
            "content": "\"Do not include any links on the project website that might encourage non-developers to download and use nightly builds, snapshots, release candidates, or any other similar package.\"\n\nPersonally I think this is a load of crap. How should we get quality releases without encouraging users to test things before its officially released?\n\nGetting feedback from users that are willing to deal with trunk and patches, and letting things \"bake\" in trunk is really valuable, and I think its also a step towards encouraging them to participate in development. "
        },
        {
            "author": "Sebb",
            "id": "comment-12891379",
            "date": "2010-07-22T22:48:13+0000",
            "content": "The download pages are intended for all users of the software, and must only include released (voted on) software.\n\nIt is not appropriate to mention non-released code on the official page for releases. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12891384",
            "date": "2010-07-22T23:01:30+0000",
            "content": "It is not appropriate to mention non-released code on the official page for releases.\n\nwhy?\n\ni can (moderately) understand that we should not \"encourage\" non-devleopers to use unofficial versions, and i recognize that linking directly to nightlys from the \"official\" release page is a very bad idea .. but how far down the rabbit hole do we have to go to avoid links to links to links to links for nightly builds?\n\nEven following the letter of the policy you linked to, i don't see how we anyone could possibly construe that we are \"encourage(ing) non-developers to download and use nightly builds, snapshots, release candidates, or any other similar package\"  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12891440",
            "date": "2010-07-23T01:06:26+0000",
            "content": "I've been around the ASF long enough now to know that what seems like iron clad policy, often isn't.\nIt's often just someone editing a page to reflect what they think should be the policy,  and no one else complaining too much - even in cases when there clearly was no consensus.\n\nRelated to this issue, I remember the last big thread back in '06 on the infra list.  And in that case too, it was a single individual that took it upon themselves to add the text you now see (and there certainly was no previous consensus or even discussion on the text added).\n\nTrying to draw sharp lines between developers and users is a lost cause... lucene and solr are for developers themselves and it's one big continuum between user and developer.  Having people use nightly builds is very important for lucene/solr development.  Having a pointer to developer resources from anywhere should be fine.\n\nThe only important point I see is to clearly communicate that a nightly build is not an official ASF release. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539952",
            "date": "2016-10-02T07:40:12+0000",
            "content": "Solr now has a very clear release policy, so the discussion no longer makes sense to stay open. "
        }
    ]
}