{
    "id": "SOLR-9587",
    "title": "Script for creating a redacted tech support package",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "When users need help with Solr from the project, relevant config and log information from their install is usually the best way that we can help them.  If we had an easy way to gather all useful information into a single compressed file that a user could place onto a file sharing site, we'd be in awesome shape.\n\nIf the script was smart enough to try and keep the final size of the package under 1MB, which might be challenging until we have a better handle on logfile rotation, most users would be able to share the package using Apache's own pastebin, which can be found here: http://apaste.info\n\nIf we pass control to the SolrCLI Java class as part of the script functionality, we can also automatically redact any config information that we know to be sensitive, like passwords.  Automatic redaction of logfiles might be nearly impossible, but we should be making efforts in our standard INFO-level logging to never log anything most users would consider to be sensitive.  If the user bumps to DEBUG or TRACE, all bets are off.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-01T13:17:55+0000",
            "author": "Shawn Heisey",
            "content": "If zkHost info is available to it, SolrCLI would also be able to reach into zookeeper for cloud installs to pull out cloud-wide config and collection state information, but the locally stored info (core.properties, etc) might only be for the solr instance where the script was run.  I notice that the \"Files\" API only looks in conf ... maybe it needs extending so it can obtain other things like core.properties.\n\nMaking this script zookeeper aware might require fiddling a little bit with how we store that information for the rest of the scripts. ",
            "id": "comment-15538516"
        },
        {
            "date": "2016-10-01T15:09:37+0000",
            "author": "Alexandre Rafalovitch",
            "content": "We had a similar discussion before.  Also - nitpicking - I am not sure apaste is actually available to non-comitters. ",
            "id": "comment-15538663"
        },
        {
            "date": "2016-10-01T15:38:33+0000",
            "author": "Shawn Heisey",
            "content": "I looked for a previous issue before opening this one.  I couldn't find anything related, even though I was sure I HAD seen one before.  If I had found one, I would have updated the old issue.\n\nThe apaste site is available to anyone.  It's https://paste.apache.org/ that only allows committers to make pastes.  I use apaste all the time, but I have rarely used the committer version.\n\nWe will need some information available to ensure that we don't put a large burden on infra through heavy use of the paste bucket by our userbase – initially we may not want to mention apaste at all to users with this script, at least until we've discussed it with infra, and maybe taken steps with infra to create something specifically for these compressed packages.  We might not want to use infra resources at all – have users rely on existing file-sharing sites like dropbox, etc.\n\nThis particular script can place a link to a community wiki page about support packages in its output, where we have fairly detailed information about how to best use the package to get help. ",
            "id": "comment-15538696"
        },
        {
            "date": "2016-10-01T15:41:32+0000",
            "author": "Shawn Heisey",
            "content": "Attachments to the mailing list seem to work only a small percentage of the time.  I will ask Infra to clarify what the attachment policies are, and help us figure out the best way to approach the dilemma of easily transporting these packages for support. ",
            "id": "comment-15538701"
        },
        {
            "date": "2017-12-07T20:48:38+0000",
            "author": "Shawn Heisey",
            "content": "I've begun some initial work on a script for this.  For now, I'm ignoring the fact that we don't have any kind of infrastructure for collecting packages from users.  I will write up a wiki page with some suggestions about file sharing sites like Dropbox, and have the script output the URL for that page.\n\nDespite my personal opinion that I could do a better job with the script if I wrote it in perl, I have decided to write it as a shell script for better portability.  I'm trying very hard to NOT use any bashisms, so the script will work on the original bourne shell (/bin/sh), but since all of the systems I have easy access to use either bash or dash for /bin/sh, I can't be 100 percent certain that I've succeeded.\n\nOnce I've finished the first draft, a review with suggestions for any mistakes I've made would be appreciated.  Additional ideas for information that can easily be gathered are also appreciated. ",
            "id": "comment-16282504"
        }
    ]
}