{
    "id": "SOLR-8462",
    "title": "Improve error reporting for /stream handler",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Trivial"
    },
    "description": "Currently, the /stream request handler reports errors by adding an \"EXCEPTION\" name/value pair on a tuple in the TupleStream where the error arose.  The \"value\" in this name/value pair is the message attached to the exception.\n\nThis works well in most instances, however it could be better in a few ways:\n\n1.) Not all exceptions have messages.  For instance, NullPointerExceptions and other run time exceptions fall into this category.  This causes the /stream handler to return the relatively unhelpful value: \n{\"EXCEPTION\":null,\"EOF\":true}\n.  The /stream handler should make sure the exception has a message, and if not, it should report some other information about the error (exception class name?).\n\n2.) There are some common error cases that can arise from mis-use of the API.  For instance, if the 'expr' parameter is missing.  Detecting and handling these cases specifically would allow users to get back clearer, more useful error messages.",
    "attachments": {
        "SOLR-8462.patch": "https://issues.apache.org/jira/secure/attachment/12779467/SOLR-8462.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-24T17:53:47+0000",
            "author": "Jason Gerlowski",
            "content": "Attached patch addresses case (1) from the description above.  Haven't yet set out at improving case (2), though I will in a subsequent patch.\n\nTests all pass locally for me. ",
            "id": "comment-15071158"
        },
        {
            "date": "2015-12-27T15:37:56+0000",
            "author": "Jason Gerlowski",
            "content": "Updated patch adds a check for the missing required 'expr' parameter (which was the original cause of the NullPointerException that raised the \"EXCEPTION: null\" behavior I initially ran into) ",
            "id": "comment-15072172"
        },
        {
            "date": "2016-05-11T15:48:04+0000",
            "author": "Kevin Risden",
            "content": "Jason Gerlowski - Is it possible to add some tests to exercise these cases? I know I have run into some NPEs and other unhelpful messages when developing as well. ",
            "id": "comment-15280311"
        },
        {
            "date": "2016-05-13T12:06:32+0000",
            "author": "Jason Gerlowski",
            "content": "Sure; I'll take a look at it this weekend. ",
            "id": "comment-15282645"
        }
    ]
}