{
    "id": "SOLR-9175",
    "title": "classes referenced in schema.xml should also support loading from the blob store",
    "details": {
        "components": [
            "blobstore"
        ],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.4.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "It appears that only the Config API and solrconfig.xml support loading custom classes from the Blob Store.  It seems to me like any directive for a collection which references a class attribute should also support loading this class from the Blob Store via a runtimeLib=\"true\" attribute.\n\nThe obvious use case here is custom analyzers, but similarity is also a candidate.\n\nThe documentation in this area (eg. \"add-runtimelib\") is pretty vague.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-01T16:06:45+0000",
            "author": "Rupendra Peddacama",
            "content": "I ran into the same issue with using a customer similarity class deployed into blobstore. I would like to contribute to resolve this issue. Could you provide some pointers as to next steps and areas affected in the codebase. Thanks. ",
            "id": "comment-15455872"
        },
        {
            "date": "2016-09-01T17:44:20+0000",
            "author": "Noble Paul",
            "content": "Yes, only components specified in solrconfig.xml can be loaded from blob store. Schema components are not yet loaded from blob store.\n\nYou should probably start with Indexschema.java\n\n ",
            "id": "comment-15456123"
        },
        {
            "date": "2017-08-10T21:41:54+0000",
            "author": "Webster Homer",
            "content": "This is a significant limitation on the BLOB API. It should be explicitly documented! All of my needs for adding custom code to Solr are either overriding similarity or specialized filter factories!\nPlease update the documentation on the blob store api to reflect this severe limitation! I wasted several hours on it. ",
            "id": "comment-16122387"
        },
        {
            "date": "2017-08-11T06:52:49+0000",
            "author": "Noble Paul",
            "content": "Webster Homer. I have added a note in documentation. The next release will carry that information ",
            "id": "comment-16122934"
        }
    ]
}