{
    "id": "SOLR-686",
    "title": "single lock factory overwrites previous",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "update"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "On a core reload, the Directory is retrieved and a new single lock factory is set, effectively removing all previous locks.",
    "attachments": {
        "SOLR-686.patch": "https://issues.apache.org/jira/secure/attachment/12387843/SOLR-686.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12621010",
            "date": "2008-08-08T19:01:48+0000",
            "content": "attaching patch that first checks existing lock factory on the Directory, and removes the dangerous \"none\" locking option from the example schema. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12621159",
            "date": "2008-08-09T17:11:49+0000",
            "content": "\nand removes the dangerous \"none\" locking option from the example schema.\n\nwhy remove the none example? (and add a SEVERE error log when it get's used)  It was clearly commented as being for read only indexes ... isn't that a valid and safe use case for NoLockFactory? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12621160",
            "date": "2008-08-09T17:35:15+0000",
            "content": "I guess because I don't see any use-case or reason for using NoLockFactory other than some kind of testing.\nIf an index is truly read-only then a real lock factory won't have any overhead.\nBut a real lock factory is a nice backup in the event that the configuration is incorrect and it becomes writable.  People may also mistakenly believe that using \"none\" is more efficient somehow on read-only indexes.\n\nSo since I'd never recommend using \"none\" in any scenario, it doesn't seem like it should even be listed as an option in the example schema.  One could make the case that \"none\" should be removed altogether, but I didn't go quite that far. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12621163",
            "date": "2008-08-09T17:49:07+0000",
            "content": "Ah ... see, i actually took it for granted that NoLockFactory would be a little more efficient if you knew your index was read only (ie: served from read only disk).  If \"single\" is just as good, then i'm totally on board with you... and the SEVERE makes sense.\n\nwe should tweak the example config to mention \"single\" as the recommended option for read only indexes in that case. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12621183",
            "date": "2008-08-09T20:34:59+0000",
            "content": "committed. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12621346",
            "date": "2008-08-11T02:30:00+0000",
            "content": "Attaching patch which removes all references to lock type none in the various *solrconfig.xml scattered over the source tree. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12638778",
            "date": "2008-10-11T17:50:50+0000",
            "content": "Syncing patch with trunk – should I perhaps file this as a separate issue? "
        }
    ]
}