{
    "id": "SOLR-8245",
    "title": "Explain in Solr's Filter class should return noMatch if the document is not a match",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "In Solr's Filter class, createWeight method the explain method should return noMatch if the document is not a match (that was the case before 4/21/15 change)",
    "attachments": {
        "SOLR-8245__return_noMatch_if_the_document_is_not_a_match.patch": "https://issues.apache.org/jira/secure/attachment/12770918/SOLR-8245__return_noMatch_if_the_document_is_not_a_match.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-06T00:50:42+0000",
            "author": "Alexander Kanarsky",
            "content": "Patch is attached. ",
            "id": "comment-14992818"
        },
        {
            "date": "2015-11-06T08:50:08+0000",
            "author": "Jan Høydahl",
            "content": "Can you explain how a user will see the effect of this bug? Do you have an example query, perhaps on the techexample dataset, which triggers this bug?\nAre you indicating that the bug was introduced in Solr 5.2?\nAre you able to write a JUnit test which proves the fix? ",
            "id": "comment-14993374"
        },
        {
            "date": "2015-11-06T20:14:00+0000",
            "author": "Alexander Kanarsky",
            "content": "Jan, I think the problem is quite obvious just by looking at the code; however I discovered today that this problem was also reported before as LUCENE-6679, I linked it to this ticket. The LUCENE-6679 seems to have a test patch that shows up the problem. Note that back then the Filter code was on a Lucene side, now it is a part of org.apache.solr.search package, at least in the trunk (that's why I filed this ticket as a Solr ticket). ",
            "id": "comment-14994353"
        },
        {
            "date": "2015-11-06T22:53:51+0000",
            "author": "Alexander Kanarsky",
            "content": "Please review discussion in LUCENE-6679 since it seems that the issue is still present in both branch_5x and the trunk (but in different classes). ",
            "id": "comment-14994625"
        }
    ]
}