{
    "id": "SOLR-4140",
    "title": "Collection API: CloudSolrServer cannot be used to create collection without referencing an existing collection",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "multicore",
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "CloudSolrServer needs an existing collection to be able to forward requests. For some requests it is not logical that you ned to have or reference an existing collection. E.g. if you want to use CloudSolrServer to create a collection - especially:\n\n\tIf you have no collections already and want to create your first collection\n\tIf you like to create your CloudSolrServer once and for all, and want to set default-collection on it to point to your favorite collection, but also use this CloudSolrServer to create this favorite collection\n\n\n\nYes, HttpSolrServer can be used, but\n\n\tSome of us like to use CloudSolrServer for everything\n\tUsing HttpSolrServer you need to check youself which nodes are running, in order to send the create-request to one of them",
    "attachments": {
        "SOLR-4140_trunk.patch": "https://issues.apache.org/jira/secure/attachment/12555774/SOLR-4140_trunk.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Per Steffensen",
            "id": "comment-13508812",
            "date": "2012-12-03T15:43:06+0000",
            "content": "SOLR-4140_trunk.patch fits on top of trunk (5.x)\n\nEssence of patch:\n\n\tIn CloudSolrServer, if it is a \"/admin/collections\" request, use all live-nodes as potential receivers of the request. Do not consider collection provided in request or default-collection\n\tIn BasicDistributedZkTest.testCollectionsAPI, we already create at least 3 new \"awholynewcollection_X\" collections. Used to be created using HttpSolrServer. Now create the first using a CloudSolrServer without default-collection, and create the second using a CloudSolrServer with a non-existing default-collection. The rest of the collections are still created using HttpSolrServer\n\t\n\t\tRefactored a little to be able to use the existing code in AbstractFullDistribZkTestBase for CloudSolrServer instance creation. Dont copy code - reuse!\n\t\n\t\n\n\n\nBasicDistributedZkTest is still green, but didnt run entire test-suite. Couldnt imagine that the fix destroied any existing test. Committer should of course run entire test-suite before commit (asuming you are running test-suite pre-commit). Let me know if something fails, even though I didnt expect it. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13508925",
            "date": "2012-12-03T18:28:52+0000",
            "content": "I think this duplicates or overlaps with an existing issue (which has no patch if I remember right, so this can supersede).\n\nI'll try and find it and link it to this issue later today. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13509326",
            "date": "2012-12-03T23:28:59+0000",
            "content": "On first glance, I think SOLR-3425 is the one this is related to. "
        },
        {
            "author": "Per Steffensen",
            "id": "comment-13509774",
            "date": "2012-12-04T14:46:37+0000",
            "content": "SOLR-3425 is certainly related, but if there are parts in it that are not solved with SOLR-4140, I am not sure. I posted a comment to SOLR-3425, describing this and that, and basically asking for a new evaluation of whether SOLR-3425 is still relevant (or can be closed) after SOLR-4140 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530621",
            "date": "2012-12-13T02:55:05+0000",
            "content": "I skipped playing a video game to get this patch merged up to trunk  I'm very happy to have patches that are targeted and include good tests - those are much faster/easier to commit without taking much time or thinking too hard. Looks like tests are passing after my merge up - I'll commit shortly. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13530645",
            "date": "2012-12-13T03:46:15+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1421072\n\nSOLR-4140: Allow access to the collections API through CloudSolrServer without referencing an existing collection.  "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13530646",
            "date": "2012-12-13T03:46:16+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1421071\n\nSOLR-4140: Allow access to the collections API through CloudSolrServer without referencing an existing collection.  "
        },
        {
            "author": "Per Steffensen",
            "id": "comment-13530792",
            "date": "2012-12-13T08:35:36+0000",
            "content": "I verified the changes on branch_4x and it seems to be good. Assuming you did the same changes to trunk. Closing the ticket.\n\nI skipped playing a video game to get this patch merged up to trunk\n\n "
        }
    ]
}