{
    "id": "SOLR-6053",
    "title": "搜索文档总数不一致",
    "details": {
        "affect_versions": "4.7",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "http://192.168.3.21:8901/sentiment/search?q=%E6%B2%A5%E9%9D%92%E7%BD%90%E8%B5%B7%E7%81%AB&hlfl=title,content&hlsimple=red&start=0&rows=10\n\nstart 切换不同的数值就能看到效果了 \n\nAs my in deep test find out, if the rows=0, the results size is consistently the total sum of the documents on all shards regardless there is any duplicates; if the rows is a number larger than the supposedly returned the merge document number, the result numFound is accurate and consistent, however, if the rows is with a number smaller than the supposedly merge results size, it will be non-deterministic.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ahmet Arslan",
            "id": "comment-13998705",
            "date": "2014-05-15T11:53:10+0000",
            "content": "Hi wanggang can you explain in detail what the problem is  here? Is this a SolrJ thing? It this a solr-cloud setup? Can you update summary of the ticket in English language? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13998839",
            "date": "2014-05-15T15:23:12+0000",
            "content": "Trying to read between the lines (because as Ahmet has noted, you haven't really given us anything to go on)...\n\nIf you have a sharded index and the numFound changes when you run the same query more than once, then it is likely that you have documents with the same uniqueKey field value in more than one shard.  Solr assumes that every document across all shards has a unique value in the uniqueKey field.  If this is not the case, then Solr cannot guarantee correct results.\n\nSolr is smart enough to eliminate duplicates from any results that are returned, but in order for that to happen across the whole index, every document must be considered – which is why it works properly when rows is larger than numFound.\n\nThis should have been brought up on the solr-user mailing list, not as an issue in Jira.\n\nhttp://lucene.apache.org/solr/discussion.html\n\nClosing as Not a Problem.  If further investigation via regular support avenues (like the mailing list or the IRC channel) reveals that there is a bug, we can reopen. "
        }
    ]
}