{
    "id": "SOLR-1163",
    "title": "Solr Explorer - A generic GWT client for Solr",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The attached patch is a GWT generic client for solr. It is currently standalone, meaning that once built, one can open the generated HTML file in a browser and communicate with any deployed solr. It is configured with it's own configuration file, where one can configure the solr instance/core to connect to. Since it's currently standalone and completely client side based, it uses JSON with padding (cross-side scripting) to connect to remote solr servers. Some of the supported features:\n\n\n\tSimple query search\n\tSorting - one can dynamically define new sort criterias\n\tSearch results are rendered very much like Google search results are rendered. It is also possible to view all stored field values for every hit.\n\tCustom hit rendering - It is possible to show thumbnails (images) per hit and also customize a view for a hit based on html templates\n\tFaceting - one can dynamically define field and query facets via the UI. it is also possible to pre-configure these facets in the configuration file.\n\tHighlighting - you can dynamically configure highlighting. it can also be pre-configured in the configuration file\n\tSpellchecking - you can dynamically configure spell checking. Can also be done in the configuration file. Supports collation. It is also possible to send \"build\" and \"reload\" commands.\n\tData import handler - if used, it is possible to send a \"full-import\" and \"status\" command (\"delta-import\" is not implemented yet, but it's easy to add)\n\tConsole - For development time, there's a small console which can help to better understand what's going on behind the scenes. One can use it to:\n\t\n\t\tview the client logs\n\t\tbrowse the solr scheme\n\t\tView a break down of the current search context\n\t\tView a break down of the query URL that is sent to solr\n\t\tView the raw JSON response returning from Solr\n\t\n\t\n\n\n\nThis client is actually a platform that can be greatly extended for more things. The goal is to have a client where the explorer part is just one view of it. Other future views include: Monitoring, Administration, Query Builder, DataImportHandler configuration, and more...\n\nTo get a better view of what's currently possible. We've set up a public version of this client at: http://search.jteam.nl/explorer. This client is configured with one solr instance where crawled YouTube movies where indexed. You can also check out a screencast for this deployed client: http://search.jteam.nl/help\n\nThe patch created a new folder in the contrib. directory. Since the patch doesn't contain binaries, an additional zip file is provides that needs to be extract to add all the required graphics. This module is maven2 based and is configured in such a way that all GWT related tools/libraries are automatically downloaded when the modules is compiled. One of the artifacts of the build is a war file which can be deployed in any servlet container.\n\nNOTE: this client works best on WebKit based browsers (for performance reason) but also works on firefox and ie 7+. That said, it should be taken into account that it is still under development.",
    "attachments": {
        "graphics.zip": "https://issues.apache.org/jira/secure/attachment/12408006/graphics.zip",
        "SOLR-1163.zip": "https://issues.apache.org/jira/secure/attachment/12443375/SOLR-1163.zip",
        "solr-explorer.patch": "https://issues.apache.org/jira/secure/attachment/12408005/solr-explorer.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Uri Boness",
            "id": "comment-12709196",
            "date": "2009-05-13T22:52:34+0000",
            "content": "fixed the groupId in the pom "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12722748",
            "date": "2009-06-22T18:36:13+0000",
            "content": "I just got a chance to check out your demo site... cool stuff Uri!\nIs the Console on that demo site somewhere, or is it command line?\nI'll have to leave other technical comments to people who know more about GUIs.... but where do you see this fitting?  Default search screen when you hit http://localhost:8983/solr/??? or something else? "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12722763",
            "date": "2009-06-22T18:55:32+0000",
            "content": "Thanks Yonik.\n\nThe console is in the application. If you look down at the lower right corner, you'll find a small console icon (a la FireBug), click on it and the console will open up.\n\nWhere do I see it fitting? Well, if http://localhost:8983/solr/admin is for the admin page, then I guess http://localhost:8983/solr/explorer can be for the explorer. I don't know, what do you think? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12746261",
            "date": "2009-08-21T21:58:07+0000",
            "content": "Does a GWT client application have a clean license? Are there any other GWT apps in the Apache project?\n\n+1. This is great.\n\nThe Simile project has some nice data explorer UIs. The Simile-Widget gallery displays them. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12746395",
            "date": "2009-08-22T02:17:08+0000",
            "content": "Does a GWT client application have a clean license?\nIf having a pure Apache 2 license is considered to be clean, then yes.\n\nAre there any other GWT apps in the Apache project? \nNo as far as I know. But you do have LucidGaze which is a Solr monitoring tool and I think it's also a GWT application.\n\n+1. This is great.\nThanks, you can also vote for it \n\nThe Simile project has some nice data explorer UIs. The Simile-Widget gallery displays them.\nThanks for the suggestion. I know this project, but from my experience some of their widgets don't perform really well. Personally, when it comes to data visualization I think flash is the best technology we have at the moment and it's quite easy to interact with it via Javascript and GWT (that's how Google does for most of their applications/services: analytics, finances, etc..) "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12746528",
            "date": "2009-08-23T00:45:42+0000",
            "content": "Voted! I'm an American, so no democracy jokes, please.\n\nAbout licensing - does Google put any license restrictions on distributed code? \n\n\n\n\n "
        },
        {
            "author": "kaoul kae",
            "id": "comment-12749256",
            "date": "2009-08-30T13:42:12+0000",
            "content": "I'm new to GWT and would like to know how to setup this application for solr. Could you make a little step by step how-to as I don't know what to do with the patch. Does it go in solr src ? In a gwt project ? Where do I need to patch ?\n\nIn advance, thank you. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12749259",
            "date": "2009-08-30T14:17:56+0000",
            "content": "Hi Kaoul,\n\nThe solr explorer is a maven project. This patch adds a new folder in the contrib director. Once patched, you can go to the contrib/solrexplorer directory and build the maven project (ie. mvn clean package). One of the artifacts of the build is the directory where the application sits in. \n\nIt's a stand-alone application that runs in the browser. As such, to run the application all you need to do is to open the SolrExplorer.html file in your browser. \n\nTo configure the application you can customize the solr-explorer.xml which sits in the same directory. \n\nThe main reason I made this patch is to contribute this whole code base to the Solr project and hopefully make it an integral part of Solr. If you want to use this tool without concerning yourself with the patch, you can also download it from:\n\nhttp://www.jteam.nl/news/solrexplorer\n\nI'm still working on the user documentation there, but it's a working version nonetheless. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12749686",
            "date": "2009-08-31T23:52:00+0000",
            "content": "Hi Uri-\n\n(You did not mention the console button at the lower right corner.  This is very very useful!)\n\nEditing a query facet did not work for me. After I made one with 'New Facet' plus-sign, I tried to edit it. I got this message:\n\nError occured: (TypeError): h is undefined\n\n fileName: http://localhost:8983/solr-explorer/org.apache.solr.explorer.SolrExplorer/D95BC0B1FD429F7CB277268102D19B3E.cache.html\n lineNumber: 2057\n stack: vVc([object Object],[object Object],[object Object])@http://localhost:8983/solr-explorer/org.apache.solr.explorer.SolrExplorer/D95BC0B1FD429F7CB277268102D19B3E.cache.html:2057\nzVc([object Object],[object Object])@http://localhost:8983/solr-explorer/org.apache.solr.explorer.SolrExplorer/D95BC0B1FD429F7CB277268102D19B3E.cache.html:2049\n([object Object])@http://localhost:8983/solr-explorer/org.apache.solr.explorer.SolrExplorer/D95BC0B1FD429F7CB277268102D19B3E.cache.html:2993\n@http://localhost:8983/solr/select?version=2.2&q=*:*&start=0&facet=on&facet.query=samsung&wt=json&indent=true&json.wrf=callback6:160\n\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12749691",
            "date": "2009-09-01T00:06:09+0000",
            "content": "Also, spellcheck build gets an error in the Solr servlet. It needs a query string; what for, I don't know.\n\nINFO: [] webapp=/solr path=/select params={spellcheck=true&json.wrf=callback21&i\nndent=true&start=0&q=&wt=json&spellcheck.build=true} status=500 QTime=23\nAug 31, 2009 5:00:05 PM org.apache.solr.common.SolrException log\nSEVERE: java.lang.NullPointerException\n        at java.io.StringReader.<init>(StringReader.java:33)\n        at org.apache.lucene.queryParser.QueryParser.parse(QueryParser.java:173)\n\n        at org.apache.solr.search.LuceneQParser.parse(LuceneQParserPlugin.java:7\n8)\n        at org.apache.solr.search.QParser.getQuery(QParser.java:131)\n        at org.apache.solr.handler.component.QueryComponent.prepare(QueryCompone\nnt.java:89)\n        at org.apache.solr.handler.component.SearchHandler.handleRequestBody(Sea\nrchHandler.java:174)\n        at org.apache.solr.handler.RequestHandlerBase.handleRequest(RequestHandl\nerBase.java:131)\n        at org.apache.solr.core.SolrCore.execute(SolrCore.java:1299)\n        at org.apache.solr.servlet.SolrDispatchFilter.execute(SolrDispatchFilter\n.java:338)\n        at org.apache.solr.servlet.SolrDispatchFilter.doFilter(SolrDispatchFilte\nr.java:241)\n        at org.mortbay.jetty.servlet.ServletHandler$CachedChain.doFilter(Servlet\nHandler.java:1089)\n        at org.mortbay.jetty.servlet.ServletHandler.handle(ServletHandler.java:3\n65)\n        at org.mortbay.jetty.security.SecurityHandler.handle(SecurityHandler.jav\na:216)\n        at org.mortbay.jetty.servlet.SessionHandler.handle(SessionHandler.java:1\n81)\n        at org.mortbay.jetty.handler.ContextHandler.handle(ContextHandler.java:7\n12)\n        at org.mortbay.jetty.webapp.WebAppContext.handle(WebAppContext.java:405)\n\n        at org.mortbay.jetty.handler.ContextHandlerCollection.handle(ContextHand\nlerCollection.java:211)\n        at org.mortbay.jetty.handler.HandlerCollection.handle(HandlerCollection.\njava:114)\n        at org.mortbay.jetty.handler.HandlerWrapper.handle(HandlerWrapper.java:1\n39)\n        at org.mortbay.jetty.Server.handle(Server.java:285)\n        at org.mortbay.jetty.HttpConnection.handleRequest(HttpConnection.java:50\n2)\n        at org.mortbay.jetty.HttpConnection$RequestHandler.headerComplete(HttpCo\nnnection.java:821)\n        at org.mortbay.jetty.HttpParser.parseNext(HttpParser.java:513)\n        at org.mortbay.jetty.HttpParser.parseAvailable(HttpParser.java:208)\n        at org.mortbay.jetty.HttpConnection.handle(HttpConnection.java:378)\n        at org.mortbay.jetty.bio.SocketConnector$Connection.run(SocketConnector.\njava:226)\n        at org.mortbay.thread.BoundedThreadPool$PoolThread.run(BoundedThreadPool\n.java:442)\n\n\n\n "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12749693",
            "date": "2009-09-01T00:15:18+0000",
            "content": "Hi Lance,\n\nGreat feedback, thanks!\n\nYou did not mention the console button at the lower right corner. This is very very useful!\n(well, you always have to leave some room for surprises )\n\nObviously the two issues are bugs. I'll try to find some time this week to fix them and upload a new patch.\n\nCheers,\nUri\n "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12805511",
            "date": "2010-01-27T14:05:44+0000",
            "content": "Uri,\n\nIs this patch still up to date? "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12805601",
            "date": "2010-01-27T18:21:07+0000",
            "content": "Actually I've been working on a new version for the explorer which I plan to put soon as a patch here. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12854155",
            "date": "2010-04-06T20:19:04+0000",
            "content": "working on a new improved patch for the explorer. But I'm at a bit of a dilemma here regarding exactly it should integrate with Solr. There are basically 3 options:\n\n1. Tight integration, where the explorer will be bound to each core and there will be a dedicated URL for it (say /corename/explorer). This is nice as the user gets this functionality out of the box, but on the other hand, I'm not sure users want it to be there out of the box (most of the time, if not always, the explorer will not be used as the final UI, but more of a temporary one, just to have something up and running... in production I can imagine users will not need it). This tight integration also means quite a lot of changes to the current configuration, well, first the dispatch filter will need to change a bit, but also a default request handler will need to be defined for all cores.\n\n2. The other option is to keep the explorer as an external tool. The idea is to have it as a separate war file which can be deployed in the same servlet container as solr. I'm working on removing the current xml configuration and make it more dynamic. So when the user enters the application, she can configure a core by following a wizard-like process... this wizard will create a configuration which will be saved on the server for future \"logins\". \n\n3. Well, the third option is just to leave things as they are now. That is, there is on configuration file which defines all the solr cores the explorer can communicate with. This configuration file is loaded when the web page is loaded. Like option 2, this is also a standalone mode.\n\nany comments? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12854494",
            "date": "2010-04-07T13:38:27+0000",
            "content": "I vote for separate .war that can be installed with or without Solr in the same container. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12854648",
            "date": "2010-04-07T19:04:11+0000",
            "content": "yeah... I'm leaning toward that option as well. First, it's less intrusive, but also, using a proxy servlet I won't need to use XSS for the communication (which opens up all the XML-only api for me). "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12854658",
            "date": "2010-04-07T19:25:27+0000",
            "content": "+1 on a separate war file. Solr Explorer is a large standalone piece that does not need to be in lockstep with the Solr/Lucene internals.\n\nThis is a great candidate for a separate \"Solr Apps Project\": something hosted on SourceForge/Google/Github with large standalone projects like clustering, Tika, archiving logs as a web service, archiving IM sessions via Jabber, etc. It would be a better home that Solr JIRA patches. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12854664",
            "date": "2010-04-07T19:43:06+0000",
            "content": "The only downside to this is that it requires extra setup. A lot of people (incl. myself) like to use the bundled jetty instance for development and only deploy solr in a different servlet container in production. In that sense, it would be nice to get something ready out of the box with solr distribution (or at least that it would be easy to set it up with the examples directory).  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12855079",
            "date": "2010-04-08T18:48:14+0000",
            "content": "I vote for a separate war: primarily because i think it would be a good way to encourage/force us to make sure that all the functionality needed to power a good GUI is exposed via RequestHandlers, (wheich will help make it easy for other people to write their own custom tools for controlling solr in non-standartd ways).  \n\nIf it lives in the same war, it's too easy to just directly access \"public\" Java level APIs that don't have an HTTP corollary.\n\nThat said: i don't see any downside to it being a \"contrib\" living right in the solr code base. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12855097",
            "date": "2010-04-08T19:09:52+0000",
            "content": "even with a separate WAR, we can still have this built into Solr's example webapps directory so only a single Jetty is needed and Solr Explorer works out of the box with a single Jetty. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12855200",
            "date": "2010-04-08T23:06:57+0000",
            "content": "Right... ok... so I think a separate war is definitely the preferred way by all. And yes, putting it in contrib and integrating it with the embedded Jetty of the examples would be ideal. \n\nSo a decision is made \n\nThanks guys, for helping me get there. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12861923",
            "date": "2010-04-28T20:02:41+0000",
            "content": "So, how hard would it be to get this in Ant instead of Maven?  I don't see Solr converting to Maven anytime soon and I certainly am against 2 build systems.\n\nAlso, dependency-wise, I see:\nGWT\nGWToolbox – which has dependencies on Spring.  So, now we're effectively adding GWT and Spring into this Solr contrib, right?  Not against it, just want it to know for sure what we are getting into. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12861968",
            "date": "2010-04-28T22:20:18+0000",
            "content": "So, how hard would it be to get this in Ant instead of Maven? I don't see Solr converting to Maven anytime soon and I certainly am against 2 build systems.\n\nFigured this one out already, the new version will solely be based on Ant \n\nAs for the dependencies, the two main dependencies are indeed GWT and GWToolbox. Spring is not really a must as I can use pure Servlets for the backend. That said, integrating with Spring as the backend might still be an option just to simplify things... but I still need to figure whether we really need it or we can just do without it. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12862231",
            "date": "2010-04-29T15:46:49+0000",
            "content": "\n1) org.gwtoolbox:gwtoolbox-ioc-core:jar:0.6.1\n\n  Try downloading the file manually from the project website.\n\n  Then, install it using the command: \n      mvn install:install-file -DgroupId=org.gwtoolbox -DartifactId=gwtoolbox-ioc-core -Dversion=0.6.1 -Dpackaging=jar -Dfile=/path/to/file\n\n  Alternatively, if you host your own repository you can deploy the file there: \n      mvn deploy:deploy-file -DgroupId=org.gwtoolbox -DartifactId=gwtoolbox-ioc-core -Dversion=0.6.1 -Dpackaging=jar -Dfile=/path/to/file -Durl=[url] -DrepositoryId=[id]\n\n  Path to dependency: \n        1) org.apache.solr:solr-explorer:war:1.0-SNAPSHOT\n        2) org.gwtoolbox:gwtoolbox-ioc-core:jar:0.6.1\n\n2) org.gwtoolbox:gwtoolbox-widget:jar:0.4.1\n\n  Try downloading the file manually from the project website.\n\n  Then, install it using the command: \n      mvn install:install-file -DgroupId=org.gwtoolbox -DartifactId=gwtoolbox-widget -Dversion=0.4.1 -Dpackaging=jar -Dfile=/path/to/file\n\n  Alternatively, if you host your own repository you can deploy the file there: \n      mvn deploy:deploy-file -DgroupId=org.gwtoolbox -DartifactId=gwtoolbox-widget -Dversion=0.4.1 -Dpackaging=jar -Dfile=/path/to/file -Durl=[url] -DrepositoryId=[id]\n\n  Path to dependency: \n        1) org.apache.solr:solr-explorer:war:1.0-SNAPSHOT\n        2) org.gwtoolbox:gwtoolbox-widget:jar:0.4.1\n\n\nLooks like it isn't finding the JTeam repo properly.  Anyone else having that problem? "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12862236",
            "date": "2010-04-29T15:56:09+0000",
            "content": "yeah... our repository has changed and some libs are missing in the new one.\n\nThing is, the current patch version is quite out dated and the new version it will also have completely different dependencies. \n\nwhat I'll do, is take the current patch and move it to ant and make it workable (though it is going to change quite a lot in the next version) "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12862442",
            "date": "2010-04-29T22:11:10+0000",
            "content": "what I'll do, is take the current patch and move it to ant and make it workable (though it is going to change quite a lot in the next version)\n\n+1! It's a really handy tool as-is. The best is the enemy of the good. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12863010",
            "date": "2010-05-01T11:50:22+0000",
            "content": "A flavor of the current version with the following changes:\n\n1. Ant script instead of maven pom\n2. Jar dependencies are included\n3. Upgraded GWT to 2.0.3\n4. Upgraded GWToolbox to 2.0.0-SNAPSHOT\n\nA few notes:\n\n\tAttaching as zip instead of a patch as there are quite a few binary files (jars and graphics). The content can be dropped anywhere and built (so it does not depend on solr per se).\n\tTo keep the zip file somewhat small in size, I didn't include the GWT libraries in it. When running the build for the first time, it will try to download the gwt libs from maven central repository. This will only be done once... the libs will not be downloaded if they already exist in the lib folder\n\ttwo main ant targets:\n\t\n\t\tbuild - will clean and rebuild the application. The process places its artifacts under target folder\n\t\tdist - will build and create distributable artifact of the application under the dist folder. There are two artifact there - a standalone version (just open the SolrExplorer.html file in the browser) and a war file.\n\t\n\t\n\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12863647",
            "date": "2010-05-04T03:38:49+0000",
            "content": "Thanks!\n\nHow do you set the directory for solr-explorer.xml file?\n\nAlso, an improvement: for multicore, one common configuration for many cores would help  And some default core, or name wildcarding.\n\nAlso, it still has the bug in editing query facets  "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12863892",
            "date": "2010-05-04T17:08:33+0000",
            "content": "Hi Lance,\n\nHow do you set the directory for solr-explorer.xml file?\nThe solr-explorer.xml is configured in the host html file SolrExplorer.html as a gwtoolbox:property <meta> tag. Currently the value needs to be relative to SolrExplorer.html, though I'm planning to make it more flexible so when deploying on a web server it'd be possible to put it anywhere on that server (it will not be possible to load it from external server due to XSS limitations).\n\nAlso, an improvement: for multicore, one common configuration for many cores would help  And some default core, or name wildcarding.\nAs I understand, you basically want to be able to define default config template which you can base your specific configurations on. Did I get it right?\n\nAlso, it still has the bug in editing query facets \nCan you elaborate on this one... I didn't experience problems when defining query facets. How do you define them? Can you give an example of a facet that failed? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12864006",
            "date": "2010-05-04T21:22:26+0000",
            "content": "The solr-explorer.xml is configured in the host html file SolrExplorer.html as a gwtoolbox:property <meta> tag. Currently the value needs to be relative to SolrExplorer.html, though I'm planning to make it more flexible so when deploying on a web server it'd be possible to put it anywhere on that server (it will not be possible to load it from external server due to XSS limitations).\nOk, I see the problem. If there is any way to make this more flexible? For example, a list of places to look?\n\nAs I understand, you basically want to be able to define default config template which you can base your specific configurations on. Did I get it right?\nYes. Most multicore sites use the same schema etc. for all of their cores, so a default template would be very useful.\n\nCan you elaborate on this one... I didn't experience problems when defining query facets. How do you define them? Can you give an example of a facet that failed?\nCreating facets works. I edited an existing facet with the left-button pulldown. I changed the query. When I saved it, I got this popup error:\n\nError occured: (TypeError): h is undefined\n stack: hLb([object Object],[object Object],[object Object])@http://localhost:9963/solr-explorer/explorer/558095973C1D0840259C75524EE8A354.cache.html:4251\n$Kb([object Object],[object Object])@http://localhost:9963/solr-explorer/explorer/558095973C1D0840259C75524EE8A354.cache.html:2487\n([object Object])@http://localhost:9963/solr-explorer/explorer/558095973C1D0840259C75524EE8A354.cache.html:4293\n@http://localhost:9963/solr/errors/select?version=2.2&q=*:*&start=0&facet=on&facet.query=stamp_dt:%5B*%20TO%20*%5D&wt=json&indent=true&json.wrf=callback7:104\n fileName: http://localhost:9963/solr-explorer/explorer/558095973C1D0840259C75524EE8A354.cache.html\n lineNumber: 4251\n\n "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12864081",
            "date": "2010-05-05T00:03:00+0000",
            "content": "Ok, I see the problem. If there is any way to make this more flexible? For example, a list of places to look?\nCan you give an example of where you'd like to look for the config files? Do you mean you want to have multiple files in different locations and merge them, or just define possible locations and the first solr-explorer.xml that is found in one of the location is loaded.\n\nYes. Most multicore sites use the same schema etc. for all of their cores, so a default template would be very useful.\nI understand this need.. makes sense. I can add it to the todo list for later on. There are quite a lot of other features to implement which relate to the configuration and they have higher priority (get rid of the xml configuration for example). Once we have a solid configuration mechanism we can then add this feature as well.\n\nCreating facets works. I edited an existing facet with the left-button pulldown. I changed the query. When I saved it, I got this popup error:\nA bug indeed. I'll soon add a new version with a fix to this (it appears that the same bug occurs for the field facets as well) "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12864583",
            "date": "2010-05-05T23:29:59+0000",
            "content": "Fixed the issues where editing a query/field facet fails. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12865396",
            "date": "2010-05-08T04:35:59+0000",
            "content": "Thank you! Editing works great.\n\nIs there a new timeout feature? I'm getting timeouts loading large cores.\n\nThere is a slight problem in searching for facet values. I'm indexing logs, so my facets have weird names. \nThis facet from field 'name_s':\n[http-8080-Processor8]\n\ncreated this search (which I cannot figure out how embed in the wiki):\nname_s: \\ \\ ]http\\ -8080\\ -Processor8]\nPretend that the previous line has no spaces, and that is what Explorer sent in as the facet query. It should be backslash-leftbracket, not backslash-backslash-rightbracket. And the final rightbracket should probably be escaped also?\n\n "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12865441",
            "date": "2010-05-08T10:45:20+0000",
            "content": "For drilling into facets using fq, the queries really should be in the form of fq=\n{!raw f=field_name}\nvalue to avoid query parser escaping/quoting issues. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12865445",
            "date": "2010-05-08T11:44:44+0000",
            "content": "@Lance\nthere was always a timeout in solr explorer which is set to 5 seconds. In the new version this will be configured per core & request type (for example, building a spellcheck index differs in the time takes between different cores and configurations)\nWhat is the problem exactly with the facet filters? they are not escaped or are they escaped incorrectly? Currently, (as noted below) I'm not using the _\n{!raw f=X}\nvalue_ query but escape the query explicitly.\n\n@Erik\nYes, I know... this version of the explorer is still from the 1.3 release days so I need to update it to use the query parser functionality.\n\nI don't want to spend too much time on this version, and soon I'll put a new version in which I'll apply all changes and bug fixes (that's the downside of developing something based on JIRA patches). To speed up things, I'll put aside the whole server side support for dynamic configuration and first issue a release of the new version that works with xml configuration (as it works now). One thing to take into consideration is that the new xml configuration is somewhat not BWC as it also reflects the change in the explorer architecture. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12865513",
            "date": "2010-05-08T23:13:07+0000",
            "content": ".bq In the new version this will be configured per core & request type \nGreat! I'm used to large indexes and have done facet queries that took half an hour \n\n.bq What is the problem exactly with the facet filters? they are not escaped or are they escaped incorrectly?\nThe query name_s: with leftbracket followed by stuff\nbecame name_s: backslash-backslash-rightbracket followed by stuff\n\nThe leftbracket got changed to right-bracket and got 2 escapes. As an old Unix coder, I know all about extra escapes. But switching the left-bracket to a right-bracket is a more strange bug. "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12865521",
            "date": "2010-05-09T00:23:17+0000",
            "content": "@Lance\n\nOh... right... indeed that's a bug . Since I don't want to add another patch for this version, perhaps you can fix it yourself and rebuild it (now with the ant build it should be easier). to fix it, simply look at the org.apache.solr.explorer.client.manager.solr.search.SolrQueryBuilder, line: 232... the method escapeLuceneQuery... change the following line:\n\n.replace(\"[\", \"\\\\]\")\n\n\n\nto\n\n\n.replace(\"]\", \"\\\\]\")\n\n\n\nSorry for pushing this bug fix on you.... I just want to focus on the next version release and continue all bug fixes on that one. does this make sense? Or should I upload another patch for it? "
        },
        {
            "author": "David Smiley",
            "id": "comment-12865749",
            "date": "2010-05-10T12:55:00+0000",
            "content": "Uri, you're comment about the downside of developing something based on JIRA patches is so true.  I realize this is a bit of a tangent, but I think a git w/ github model could bring about more velocity on Solr improvement.  Unfortunately the interest among Solr committers appears to be anemic. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12865905",
            "date": "2010-05-10T20:16:44+0000",
            "content": "No, that's fine, I'll try it! "
        },
        {
            "author": "Peter Sturge",
            "id": "comment-12866674",
            "date": "2010-05-12T18:14:16+0000",
            "content": "Hi Uri,\n\nReally like what you've done here. +1 +vote!\n\nI've had a go on your demo site and that looks cool.\n\nWhen I download and try to connect to a core (I've tried my own core, and the Solr 'example'), I always get:\n\n   'Could not load solr core ('corename'): The JSON request failed or timed out'\n\nIf I turn on Firebug, the only msg I get is this:\n\nreference to undefined property window[c + x$]\n[Break on this error] function DKd(h,d,e,b,f){var c=gM+CKd++;i...)}},5000);document.body.appendChild(g)}\\n\n\nThere doesn't seem to be any log/debug of what the problem might be. Are there any logging options that can be enabled?\n\nMany thanks,\nPeter "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12866769",
            "date": "2010-05-12T22:44:40+0000",
            "content": "Hi Peter,\n\nThe explorer communicates with Solr via http request json calls. In the current version there's a 5 seconds timeout on this connection attempt (this will change to be configurable in the upcoming version). Since you're using the example directory and the index is small, assuming you're running on localhost, the only reason I can think of for this timeout is simple bad configuration. The solr-explorer.xml defines the core and the base solr URL to connect to it... make sure this URL is indeed correct. \n\nLogging is current available, but not at connection time. Once you're logged in, solr explorer has a \"firebug-like\" console with a logging tab (which gives you an insight at what's going on).\n\nCheers,\nUri "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12866926",
            "date": "2010-05-13T00:11:07+0000",
            "content": "That works great.\n\nAnother problem I've encountered is that I'm making facets that are 2000-3000 characters long. This does not work with a GET, so it needs a POST.\nOf course, this is not a common use case. "
        },
        {
            "author": "Peter Sturge",
            "id": "comment-12867080",
            "date": "2010-05-13T08:17:15+0000",
            "content": "Hi Uri,\n\nThe configuration for url connections in \n{solr-explorer.xml}\n looks pretty straightforward. For the example instance, there is no 'named' core, so I used an empty string here. \nFor my own core, I used the name ('active'), and the URLs work fine when put straight into a browser:\n\nSo, this works:\n{   http://localhost:8983/solr/active/select/?&q=*:*&wt=json&indent=on}\n\n\nBut this gives the JSON timeout error:\nsolr-explorer.xml [excerpt]\n    <solr-core name=\"active\">\n\n        <server baseUrl=\"http://localhost:8983/solr/\"/>\n\n        <search>\n            <default-query>*:*</default-query>\n        </search>\n\n        <hit-rendering>\n            <title-field default=\"[unknown]\">name</title-field>\n            <summary-field default=\"No special features\">features</summary-field>\n        </hit-rendering>\n    </solr-core>\n\n\n\n(in FireFox 3.6)\n\nThanks,\nPeter "
        },
        {
            "author": "Uri Boness",
            "id": "comment-12867148",
            "date": "2010-05-13T14:37:58+0000",
            "content": "@Peter\n\nTry removing the trailing slash in the URL (I know.... in the next version I'll make sure to handle these edge cases)\n\n@Lance\nIndeed the limitation of the current version is that it uses XSS for the communication with Solr. This limits it to GET methods. In the upcoming release, since a server side layer is added, this will be solved and all communication will be done using POST via a proxy servlet.\n\nThe next version is basically ready... the only thing that I still have to fix are some UI issues with IE and a few with Chrome. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12873205",
            "date": "2010-05-29T00:59:52+0000",
            "content": "A deployment suggestion: since the solr-explorer.xml file has to be in the war file, please add an ant rule that takes a file name (from the command line or property) and places that into the war as /solr-explorer.xml ? This would make it easy to make different war files for different projects.\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12996635",
            "date": "2011-02-18T22:54:04+0000",
            "content": "Any plans to continue with this? If not, check out Vaadin. It's a UI widget toolkit layer on GWT, with an Eclipse UI builder. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13698889",
            "date": "2013-07-03T12:19:25+0000",
            "content": "Long time since any activity. For those interested, we have put up a recent version of the explorer on GitHub:\nhttps://github.com/cominvent/solr-explorer "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15388844",
            "date": "2016-07-22T03:55:22+0000",
            "content": "Can this be closed? Great idea, but all discussions are completely irrelevant now if this was restarted. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15641121",
            "date": "2016-11-06T04:30:19+0000",
            "content": "Close as suggested. "
        }
    ]
}