{
    "id": "SOLR-4401",
    "title": "Move the stress test in SOLR-4196 into a junit test",
    "details": {
        "affect_versions": "4.2,                                            6.0",
        "status": "Closed",
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "components": [],
        "type": "Test",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As part of SOLR-4196, I created a stress test proces for rapidly opening and closing cores. It'd probably be useful to make this into a junit test that ran nightly (it needs some time in order to show anything, as in minutes). Typical failures are 20 minutes into the run, but occasionally they're faster.",
    "attachments": {
        "SOLR-4401.patch": "https://issues.apache.org/jira/secure/attachment/12571778/SOLR-4401.patch",
        "StressTest.zip": "https://issues.apache.org/jira/secure/attachment/12567829/StressTest.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13570116",
            "date": "2013-02-04T11:36:25+0000",
            "content": "Stand-alone test harness. \n\nprior art in TestReplicationHandler?\n\nAlso, tag as nightly? Weekly? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13570330",
            "date": "2013-02-04T15:34:15+0000",
            "content": "prior art in TestReplicationHandler?\n\nNot specifically I don't think, but it's probably an option - lot's of prior art to go around that should fit this.\n\nI think largely you can keep the machinery as it is. You probably want to use JettySolrRunner to take the place of starting up Solr (currently a user action). Extend SolrTestCase4j but don't call initCore. Then the tmp directory should be chosen in a manner similar to other tests. Then add some asserts, some polish, and I think it may be a fairly easy job.\n\n\n\tAlso, tag as nightly? Weekly?\n\n\n\nI think it should actually be run frequently for short intervals - like 30 seconds - and then long runs more like nightly or weekly. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13570336",
            "date": "2013-02-04T15:39:10+0000",
            "content": "Also, I'd probably take the config files out of the src - and either preferably use an existing test config or add a new one. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13588947",
            "date": "2013-02-28T00:08:56+0000",
            "content": "I'm going to try to put this into a junit test over the weekend. It can run really long or really short. I'm thinking of providing three methods, one that runs all the time and takes 30 seconds? a minute? Label it as \"slow\" either way.\n\nA nightly that runs for 10 minutes\n\nA weekly that runs for an hour\n\nThe background here is that I see issues after 1-2 hours running on my machine, occasionally as little as 30 minutes. I suppose if it runs more often it'd have a better chance of hitting at shorter intervals. I'm open to suggestions, so let me know.... I really don't have a sense of how onerous a really long-running test would be....\n\nMark:\nWhen I mentioned \"prior art\" it was mostly a shorthand to myself that there seemed to be code I could use as a model in TestReplicationHandler in terms of starting up servers and all that rot. But I'll look at JettySolrRunner as you indicated, thanks for the pointer. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13588960",
            "date": "2013-02-28T00:22:20+0000",
            "content": "The times seem reasonable to me. I'm not so worried about it running forever - we can always do that manually. You will still get a lot of testing out of the many different envs and the fact that those jenkins are cranking all day long. You are probably just as likely to find it cranking for 30 seconds on 20 vm's 15 timdes a day as on one machine cranking for 6 hours or whatever. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13591617",
            "date": "2013-03-03T03:18:36+0000",
            "content": "[trunk commit] Erick Erickson\nhttp://svn.apache.org/viewvc?view=revision&revision=1451997\n\nSOLR-4401 adding rapidly opening/closing cores to unit tests "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13591618",
            "date": "2013-03-03T03:20:13+0000",
            "content": "Committed trunk, r: 1451997\nThen took out some debugging junk I inadvertently left in in r: 1451998. Harmless...\n\nI'll fold this into 4x when I merge SOLR-4196 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13591619",
            "date": "2013-03-03T03:20:48+0000",
            "content": "[trunk commit] Erick Erickson\nhttp://svn.apache.org/viewvc?view=revision&revision=1451998\n\ntook out soe debugging info I left in by mistake when checking in SOLR-4401 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13597309",
            "date": "2013-03-08T17:27:22+0000",
            "content": "Merged into 4x, r: 1454477 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13597317",
            "date": "2013-03-08T17:36:14+0000",
            "content": "[branch_4x commit] Erick Erickson\nhttp://svn.apache.org/viewvc?view=revision&revision=1454477\n\nMerging code for SOLR-4196, SOLR-4401, SOLR-4525. All about obsoleting solr.xml and supporting a large number of cores "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653787",
            "date": "2013-05-10T10:32:59+0000",
            "content": "Closed after release. "
        }
    ]
}