{
    "id": "SOLR-12863",
    "title": "Provide a way in the admin UI to reload cores that failed to start",
    "details": {
        "type": "Improvement",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "7.5"
    },
    "description": "Imagine a situation where a core fails to load because there's some kind of minor problem with the configuration for the core/collection.\n\nOnce you've fixed whatever caused the core to fail, there is no way provided in the admin UI to reload the core so it will start working.  The CoreAdmin API can be accessed directly to initiate the RELOAD action, if the user is able to figure out how to do that.  Restarting the entire node would take care of it, potentially with major disruption.\n\nIt would be really good to have cores that fail to initialize show up in the CoreAdmin section of the admin UI, in a different color and with some kind of visual indicator for the color blind, with a limited set of options that includes RELOAD.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16649016",
            "content": "I haven't checked what happens in cloud mode with collections.  Is RELOAD available for collections even if none of the cores for the collection can initialize successfully? ",
            "author": "Shawn Heisey",
            "date": "2018-10-13T16:47:58+0000"
        },
        {
            "id": "comment-16658000",
            "content": "Linking to SOLR-10021.  Looks like I was lucky when I was helping the end users that ran into this issue.  They might have needed to restart Solr entirely after fixing the config problem! ",
            "author": "Shawn Heisey",
            "date": "2018-10-20T21:38:35+0000"
        },
        {
            "id": "comment-16658012",
            "content": "I've been trying to decipher the javascript and html for the admin UI and it is proving to be difficult.  My javascript knowledge is only a little bit past beginner.\n\nThe CoreAdmin API action STATUS does return the names of cores that fail to initialize, in an \"initFailures\" section.  I've been doing some tests to see what actions can be taken on failed cores, and filed SOLR-12889 for cleaning that up. ",
            "author": "Shawn Heisey",
            "date": "2018-10-20T22:24:31+0000"
        }
    ]
}