{
    "id": "SOLR-4817",
    "title": "Solr should not fall back to the back compat built in solr.xml in SolrCloud mode.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A hard error is much more useful, and this built in solr.xml is not very good for solrcloud - with the old style solr.xml with cores in it, you won't have persistence and with the new style, it's not really ideal either.\n\nI think it makes it easier to debug solr.home to fail on this instead - but just in solrcloud mode for now due to back compat. We might want to pull the whole internal solr.xml for 5.0.",
    "attachments": {
        "SOLR-4817.patch": "https://issues.apache.org/jira/secure/attachment/12599681/SOLR-4817.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13656264",
            "date": "2013-05-13T19:07:18+0000",
            "content": "+1\n\n4.4 non/cloud mode: warn that implicit solr.xml is being used.\n4.4 in cloud mode: fail if no solr.xml\n5.0 in either mode: fail if no solr.xml "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717273",
            "date": "2013-07-23T18:47:42+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13748829",
            "date": "2013-08-23T18:28:49+0000",
            "content": "Patch for trunk only, it'll take a bit of work for back-compat in 4x.\n\nAlan WoodwardMark Miller I had to do a bit of violence to the persist test and a couple of ZK tests just in case you want to take a quick glance at them.\n\nAll tests passed a bit ago, I'm trying it again now. If that works, I'll see what it would take to make it work with 4x and, if I'm lucky, get it committed over the weekend. "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13748845",
            "date": "2013-08-23T18:40:44+0000",
            "content": "I may be missing something, but this looks like it removes the 'fall back to built in solr.xml' code entirely?  Rather than just in cloud-mode. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13748891",
            "date": "2013-08-23T19:14:59+0000",
            "content": "Alan Woodward Yes, it does remove fallback entirely, but this is for trunk only. The 4x patch will have the fallback in it, which is what's behind my comment about for trunk only and back-compat needing more work for 4x. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13748927",
            "date": "2013-08-23T19:48:42+0000",
            "content": "Also note I'm still dealing with a couple of failed tests, they don't appear to show up if other tests fail...\n\nNothing difficult so far, just a bit of slogging. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13749415",
            "date": "2013-08-24T15:37:27+0000",
            "content": "I think this is good-to-go for trunk. Since this really is changing behavior between trunk and 4x I'll put up a separate patch for 4x, I hope today.\n\nOne thing this patch does is completely get rid of the fallback solr.xml string in ConfigSolrXmlOld.xml, it's made available for tests by being put in a test file solr-old-default.xml. The non-test code doesn't have any references to it. This is a stopgap during this period between deprecating persistence and getting rid of it altogether. There's a couple of odd test cases that work if the core container uses this default file but don't work if you use the standard solr.xml file, I don't have the bandwidth to chase that down now, but it'll come out when we remove persistence. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13749489",
            "date": "2013-08-24T22:40:28+0000",
            "content": "Latest patch, all tests pass. That said, I still need to look all the changes over in the morning. I suspect there are some changes that need to be modified re: getting tests to pass But now that all tests pass, perhaps I can be a bit more discriminating in terms of what changes are really necessary.\n\nIn particular, SolrTestCaseJ4.copyTestSolrHome is a nocommit at this point. It's used once, but I'm thinking of leaving it in for the future as a handy method of copying all of a conf directory to a temp dir. It might replace a number of custom copy methods in various tests going forward. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13749724",
            "date": "2013-08-25T19:21:40+0000",
            "content": "Re-worked it in light of lessons learned, it's cleaner now.\n\nI think it's ready to commit, all tests pass etc. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13749742",
            "date": "2013-08-25T20:49:13+0000",
            "content": "Final version I think. I'll probably be checking this in this evening. I tried applying it directly to 4x and it works fine, which is not surprising since I changed all the tests to NOT use the default configuration.\n\nSo I'll add another test in to the 4x version to insure we create the default solr.xml when we should after I merge. It turns out that there are only a few small changes to the patch needed for 4x, the aforementioned test and putting the hard-coded bit back in and reverting removing the string from SolrConfigXmlOld.java "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13749771",
            "date": "2013-08-26T00:06:07+0000",
            "content": "Commit 1517398 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1517398 ]\n\nSOLR-4817 Solr should not fall back to the back compat built in solr.xml in SolrCloud mode. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13750064",
            "date": "2013-08-26T12:54:30+0000",
            "content": "Commit 1517530 from Erick Erickson in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1517530 ]\n\nSOLR-4817 Solr should not fall back to the back compat built in solr.xml in SolrCloud mode. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13750071",
            "date": "2013-08-26T13:07:19+0000",
            "content": "I suspect that most of the default solr.xml was actually used by tests, and often not by intention...\n\nSo the code checked in for 4x is slightly different than the patch for 5 in that it puts back the default solr.xml and includes an explicit test for constructing the default since the point of the other changes is to remove the dependency on the hard-coded solr.xml.\n\nSo going forward, when people write tests they'll have to either\n1> reference a solrhome that contains a solr.xml file\nor\n2> copy the solr.xml file to \"the right place\". There are several methods in SolrTestCaseJ4 to help here:\ncopyMinConf - copies a very tiny schema and config file. Does NOT copy solr.xml\ncopyMinFullSetup - as copyMinConf but DOES copy solr.xml\ncopySolrHomeToTemp - copies a robust schema and config and solr.xml to a temp dir. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13750208",
            "date": "2013-08-26T16:28:08+0000",
            "content": "I suspect that most of the default solr.xml was actually used by tests, and often not by intention...\n\nMany of the tests were written before solr.xml existed - the built in solr.xml was included for back compat on those pre existing installs. Because it worked with back compat, the people that added solr.xml did not have to update all the tests at the time - something that's commonly done.\n\nI think that is totally okay though, because we are here to do it now that it actually must be done for 5.0  It's actually probably simpler to deal with now than it was back then. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13760008",
            "date": "2013-09-06T07:03:46+0000",
            "content": "Just fyi, the copyMinConf, copyMinFullSetup and copySolrHomeToTemp methods throw the following exception with Solrj tests:\n\n\njunit4] ERROR   0.69s | MultiCoreExampleJettyTest.testDeleteInstanceDir <<<\n   [junit4]    > Throwable #1: java.lang.RuntimeException: Cannot find resource: /Users/shalinmangar/work/oss/solr-trunk/solr/build/solr-solrj/test/J0/solr/collection1\n   [junit4]    > \tat __randomizedtesting.SeedInfo.seed([2AFBC83FDA207BB2:4160F4A68E96AEF0]:0)\n   [junit4]    > \tat org.apache.solr.SolrTestCaseJ4.getFile(SolrTestCaseJ4.java:1571)\n   [junit4]    > \tat org.apache.solr.SolrTestCaseJ4.TEST_HOME(SolrTestCaseJ4.java:1576)\n   [junit4]    > \tat org.apache.solr.SolrTestCaseJ4.copyMinConf(SolrTestCaseJ4.java:1618)\n   [junit4]    > \tat org.apache.solr.SolrTestCaseJ4.copyMinConf(SolrTestCaseJ4.java:1603)\n   [junit4]    > \tat org.apache.solr.client.solrj.embedded.MultiCoreExampleJettyTest.testDeleteInstanceDir(MultiCoreExampleJettyTest.java:117)\n\nYou can reproduce the error above with the patch in SOLR-5023 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13760221",
            "date": "2013-09-06T14:17:28+0000",
            "content": "I think it's all a bit of a mess right now (the test configs situation) - we should clean this up more. I intend to take a crack at it at some point. It's still too haphazard what is done in what tests and too difficult to understand and follow when writing new tests or debugging old ones.  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13760226",
            "date": "2013-09-06T14:32:08+0000",
            "content": "bq: I think it's all a bit of a mess right now \n\nYeah, it certainly is but I haven't had the energy to try to straighten it out either. Maybe we can share some of the work....\n "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787001",
            "date": "2013-10-05T10:18:40+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}