{
    "id": "SOLR-12236",
    "title": "Admin UI logging page: \"Core\" column never gets populated",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Admin UI",
            "logging"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.6.3,                                            7.3",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The logging page in the admin UI has a \"Core\" column, but there is never anything in that column.  I fired up the techproducts example, then used the Documents tab to try to index a document missing the \"id\" field, and got this error in the logfile:\n\nERROR - 2018-04-18 18:51:31.232; [   x:techproducts] org.apache.solr.common.SolrException; org.apache.solr.common.SolrException: Document is missing mandatory uniqueKey field: id\n\nThe core name (techproducts) is in the logfile as seen above, but when looking at the logging page in the UI, it can't be found anywhere.\n\nThis is the case in both master and branch_7x.  I also tried it on the 6.6.3 version (binary package) with the same results.  On version 5.3.2-SNAPSHOT, the Core column says \"null\" for all logs, instead of being blank.  That column does not appear to be present in 4.x versions.",
    "attachments": {
        "SOLR-12236.patch": "https://issues.apache.org/jira/secure/attachment/12919678/SOLR-12236.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-04-18T19:07:33+0000",
            "content": "I noticed that the 7.3 version still shows up as unreleased in Jira. ",
            "author": "Shawn Heisey",
            "id": "comment-16443047"
        },
        {
            "date": "2018-04-18T20:03:22+0000",
            "content": "Attached a patch against master that appears to fix the problem.\n\nWe were using a deprecated method in the log4j2 \"LogEvent\" class.  Switching to the recommended replacement appears to be all that was needed to fix it.  This might be a bug in LogEvent.  I am verifying this. ",
            "author": "Shawn Heisey",
            "id": "comment-16443114"
        },
        {
            "date": "2018-04-18T20:18:16+0000",
            "content": "It appears that I was wrong about the Core column being empty on master.  It shows up as \"x:techproducts\" on master if the code is unmodified.  But it is empty on branch_7x.  So there is no bug in LogEvent, but we might have a code problem in 7x.  And the string does need to have the \"x:\" stripped out.\n ",
            "author": "Shawn Heisey",
            "id": "comment-16443137"
        },
        {
            "date": "2018-04-18T20:21:58+0000",
            "content": "Attached updated patch for master.  Will look at 7x now. ",
            "author": "Shawn Heisey",
            "id": "comment-16443142"
        },
        {
            "date": "2018-04-18T20:31:38+0000",
            "content": "Now I can't even reproduce the problem on branch_7x with a clean checkout.  This is confusing, because I was seeing the problem just a little while ago!  (the core name does have the x: with 7x as well) ",
            "author": "Shawn Heisey",
            "id": "comment-16443149"
        }
    ]
}