{
    "id": "SOLR-382",
    "title": "SpellCheckerRequestHandler does not apply the onlyMorePopular flag.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The onlyMorePopular member does not have its value changed to meet the parameter when it is passed in.  On top of that, even when it is passed in, the suggestSimilar method on SpellChecker will ignore it anyway because the ir and field parameters are passed in as null.\n\nThis patch sets onlyMorePopular according to the request, and passes in a non-null IndexReader and the search field we've already initialized.\n\nBecause the IndexReader currently being used is named nullReader, I may be missing a reason it is disabled on purpose.\n\nThis patch is working well for us so far.",
    "attachments": {
        "SpellCheckRequestHandler.patch": "https://issues.apache.org/jira/secure/attachment/12367843/SpellCheckRequestHandler.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Dave Lewis",
            "id": "comment-12535391",
            "date": "2007-10-17T01:30:21+0000",
            "content": "The patch to set the value of onlyMorePopular from the request and to pass non-null IndexReader and search field to SpellChecker.suggestSimilar(). "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12535789",
            "date": "2007-10-17T23:57:39+0000",
            "content": "I've committed a modified patch that only passes in the IndexReader if the parameter is set (r585760).  Thanks!\n\nNote: might we want to rename the request parameters before 1.3 to use a common prefix, like spell.* or sp.*? "
        },
        {
            "author": "Dave Lewis",
            "id": "comment-12539856",
            "date": "2007-11-03T05:42:34+0000",
            "content": "That's great Mike, thanks!  And thanks for sprucing up the patch as  \nwell. \n\ndave\n\n\n "
        }
    ]
}