{
    "id": "SOLR-131",
    "title": "tutorial update: faceting, highlighting, etc",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "The tutorial hasn't really been changed since we entered the incubator.  Highlighting and Faceting might be nice additions.\n\nLooking back, I wish I had chosen a different data set like books or movies (or a mix of both)... something that wouldn't get out of date as fast as electronics, and that more people could identify with.  The biggest downside is examples in the Wiki refer to the current example docs.\n\nbreaking into multiple pages, and a screenshot or two wouldn't be bad idea either.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Daniel Naber",
            "id": "comment-12482950",
            "date": "2007-03-21T23:01:58+0000",
            "content": "Also, the tutorial refers to \"post.jar\", but this isn't part of the 1.0 release, it's only in trunk. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12482951",
            "date": "2007-03-21T23:05:45+0000",
            "content": "FYI: the decision was made when post.jar was created that the tutorial on the site should refer to the current trunk, since the releases each contain their own snapshot of the tutorial at the moment of the release "
        },
        {
            "author": "Furkan KAMACI",
            "id": "comment-13851642",
            "date": "2013-12-18T12:30:00+0000",
            "content": "Hi Yonik Seeley\n\nThis is an old issue and tutorial has changed and improved since then. If we still need something like you described at this issue I can explain some key points with screenshots and different examples?  "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14228977",
            "date": "2014-11-29T23:34:58+0000",
            "content": "Close? Tutorial was redone in SOLR-6077, though some new issues now need to be addressed. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14228986",
            "date": "2014-11-30T00:18:11+0000",
            "content": "Superseded by SOLR-6077 "
        }
    ]
}