{
    "id": "SOLR-9184",
    "title": "Add convenience method to ModifiableSolrParams",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.6"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "Add a static convenience method ModifiableSolrParams#of(SolrParams) which returns the same instance if it already is modifiable, otherwise creates a new ModifiableSolrParams instance.\n\nRationale: when writing custom SearchComponents, we find that we often need to ensure that the SolrParams are modifiable. The copy constructor of ModifiableSolrParams always creates a copy, even if the SolrParms already are modifiable.\n\nAlternatives: The method could also be added as a convenience method in SolrParams itself, which already has static helper methods for wrapDefaults and wrapAppended.",
    "attachments": {
        "SOLR-9184.patch": "https://issues.apache.org/jira/secure/attachment/12807966/SOLR-9184.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-03T14:41:58+0000",
            "author": "Shawn Heisey",
            "content": "There's no need to remove previous patches.  Jira automatically handles marking the old ones differently than the newest one with the same filename.  Having previous versions of a patch available helps to understand the thought processes of the person who created the patches – we prefer to keep that history, even if the older patches are blatantly wrong.\n\nAlthough I like this change, it probably should be restricted to master (7.0-SNAPSHOT) because it could break existing code.  There are likely people who intentionally use the constructor to copy one MSP object, creating a new one that can be modified independently of the original.  If we change that behavior in a minor release, any user who depends on that behavior will have a broken program after upgrading SolrJ.  There might even be instances in the Solr main or test code that rely on this behavior – all uses must be reviewed.\n\nEdit: Closer reading reveals that you want to add a method.  Which makes my concern moot. ",
            "id": "comment-15314206"
        },
        {
            "date": "2016-06-03T14:49:14+0000",
            "author": "Jörg Rathlev",
            "content": "Sorry about removing the first patch file. I accidentally left a println added for debugging in the first version and removed it.\n\nThis change simply adds a static factory method, it does not propose to modify the existing constructor. I agree that intentional use of the copy constructor is a valid use case that must be supported. ",
            "id": "comment-15314218"
        },
        {
            "date": "2016-06-06T04:10:57+0000",
            "author": "David Smiley",
            "content": "+1 to this.  Solr should use this internally at any applicable spot where it's doing the instanceof check today. ",
            "id": "comment-15316174"
        },
        {
            "date": "2017-03-22T03:04:24+0000",
            "author": "Koji Sekiguchi",
            "content": "I think this is almost ready. How about adding assertNotSame for the first test? ",
            "id": "comment-15935705"
        },
        {
            "date": "2017-03-22T12:25:41+0000",
            "author": "Jörg Rathlev",
            "content": "I agree, that's a good idea. I also noticed that the null-input case was not tested yet, so I've added that as well.\n\nUpdated patch attached. ",
            "id": "comment-15936206"
        },
        {
            "date": "2017-03-23T05:58:07+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 583fec1a58b41a0562529e6228a29728a790d87c in lucene-solr's branch refs/heads/master from koji\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=583fec1 ]\n\nSOLR-9184: Add a static convenience method ModifiableSolrParams#of(SolrParams) which returns the same instance if it already is modifiable, otherwise creates a new ModifiableSolrParams instance. ",
            "id": "comment-15937779"
        },
        {
            "date": "2017-03-23T06:45:12+0000",
            "author": "ASF subversion and git services",
            "content": "Commit bcd452c6a1026bcec814e355b8366c9b4ece49e0 in lucene-solr's branch refs/heads/branch_6x from koji\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=bcd452c ]\n\nSOLR-9184: Add a static convenience method ModifiableSolrParams#of(SolrParams) which returns the same instance if it already is modifiable, otherwise creates a new ModifiableSolrParams instance. ",
            "id": "comment-15937823"
        },
        {
            "date": "2017-03-23T06:53:31+0000",
            "author": "Koji Sekiguchi",
            "content": "Thanks, Jörg! ",
            "id": "comment-15937835"
        },
        {
            "date": "2017-03-23T13:08:37+0000",
            "author": "David Smiley",
            "content": "Koji Sekiguchi  Welcome back to committing to Solr  ",
            "id": "comment-15938251"
        }
    ]
}