{
    "id": "SOLR-6006",
    "title": "Separate test and compile scope dependencies in the Solrj and Solr contrib ivy.xml files, so that the derived Maven dependencies get filled out properly in the corresponding POMs",
    "details": {
        "affect_versions": "4.7.2",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I'm not sure what version this first appeared in, as we just bumped from 4.5 to 4.7, but log4j is specified as a dependency in the solr-solrj pom.xml, and without the optional flag. I checked out the source to verify that there isn't actually a dependency on log4j (doesn't seem to be), but I wasn't able to decipher the ant build (looks like there's a pom.xml.template that generates the pom with dependencies coming from Ivy?)\n\nAnyway, this is an issue since now we have to manually <exclude> log4j from every project that depends on SolrJ.",
    "attachments": {
        "SOLR-6006-contribs.patch": "https://issues.apache.org/jira/secure/attachment/12641893/SOLR-6006-contribs.patch",
        "SOLR-6006.patch": "https://issues.apache.org/jira/secure/attachment/12641491/SOLR-6006.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13977961",
            "date": "2014-04-23T08:09:02+0000",
            "content": "As of Lucene/Solr 4.7, the POM dependencies are built using a custom Ant task that collects compile-phase and test-phase dependencies from each module's ivy.xml file - see LUCENE-5217.  \n\nSolrj's ivy.xml includes a compile-phase dependency on log4j, even though non-test compilation succeeds without it - it's needed only for test-phase compilation; unfortunately, there are no test-phase dependencies defined in that module, so compile- and test- phase dependencies are mixed.  By contrast, modules solr-core, morphlines-core and dataimporthandler declare test dependencies, which are retrieved into per-module test-lib/ directories (as opposed to lib/ for non-test dependencies). \n\nThe fix is to distinguish test-phase dependencies, including log4j, from compile-phase dependencies.  I'll work on a patch. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13978327",
            "date": "2014-04-23T15:47:23+0000",
            "content": "Patch, retrieves Solrj test deps to solr/solrj/test-lib/.  Solr-core ivy.xml needed to changes too, since the solr-core classpath includes solr/solrj/lib/.  Tests pass under Ant and, after ant get-maven-poms, under Maven.\n\nThe only compile-phase logging dependency Solrj retains is slf4j-api - turns out Solrj doesn't need the log4j dependency, even for tests.\n\nI'll see if it's useful to make the same change in the Solr contribs other than dataimporthandler, which already has the test-lib/ setup. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13980731",
            "date": "2014-04-25T06:12:46+0000",
            "content": "Commit 1589937 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1589937 ]\n\nSOLR-6006: Separate test and compile scope dependencies in the Solrj ivy.xml file, so that the derived Maven dependencies get filled out properly in the Solrj POM "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13980734",
            "date": "2014-04-25T06:28:45+0000",
            "content": "Commit 1589940 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1589940 ]\n\nSOLR-6006: IntelliJ config for solrj/test-lib/ "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13980808",
            "date": "2014-04-25T08:50:40+0000",
            "content": "I neglected to test the Solr contribs, and they were failing after I committed the patch on trunk because they all have a test-scope dependency on jcl-over-slf4j - Uwe's Jenkins has made its unhappiness known: http://jenkins.thetaphi.de/job/Lucene-Solr-trunk-Linux/10156/\n\nThis patch fixes the build by giving each Solr contrib a test-lib/ if it doesn't already have it, and adding jcl-over-slf4j to its test scope dependencies.\n\nCommitting shortly. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13980813",
            "date": "2014-04-25T08:55:06+0000",
            "content": "Commit 1589953 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1589953 ]\n\nSOLR-6006: fix Solr contrib test dependencies by adding jcl-over-slf4j and retrieving it into each contrib's test-lib/ directory "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13980832",
            "date": "2014-04-25T09:23:19+0000",
            "content": "Commit 1589959 from Steve Rowe in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1589959 ]\n\nSOLR-6006: Separate test and compile scope dependencies in the Solrj and Solr contrib ivy.xml files, so that the derived Maven dependencies get filled out properly in the corresponding POMs (merged trunk r1589937, r1589940, and r158953) "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13980834",
            "date": "2014-04-25T09:25:40+0000",
            "content": "Committed to trunk and branch_4x. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13980839",
            "date": "2014-04-25T09:30:49+0000",
            "content": "Thanks for reporting, Steven! "
        }
    ]
}