{
    "id": "SOLR-1251",
    "title": "Add quartz-like scheduling capability to DIH",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Add capability to schedule in a cron-like way DIH imports. I'm thinking mostly for delta imports, but could be configurable for full imports as well. Ideally something where you could set a cron expression in the DIH configuration:\n\n   <requestHandler name=\"/indexer/someContent\" class=\"org.apache.solr.handler.dataimport.DataImportHandler\">\n    <lst name=\"defaults\">\n        <str name=\"config\">somecontent-config.xml</str>\n    </lst>\n    <lst name=\"invariants\">\n      <str name=\"scheduleFullImport\">0 15 10 15 * ?</str>\n      <str name=\"scheduleDeltaImport\">0 0 12 * * ?</str>\n\n    </lst>\n  </requestHandler>",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12725734",
            "date": "2009-06-30T18:12:12+0000",
            "content": "FWIW: when this idea has been discussed in the past, one of the key issues was that the \"scheduling\" feature probably shouldn't be part of DIH.  it would be just as easy (and more flexible) if it was a separate request handler that could be configured to trigger*any* other request handler on a set schedule (ie: ping DIH's delta command, ping DIH's full build command, ping spellcheckerhander's rebuild command, ping some other custom request handler for triggering special recurring logic, etc....\n\npersonally: I think a generic servlet, not even living inside the solr webapp, would be just as simple, and more generally reusable to the entire world, but i recognize that having this be a request handler, configured directly in solrconfig.xml, would be the easiest thing for most solr users to deal with. "
        }
    ]
}