{
    "id": "SOLR-8903",
    "title": "Move SolrJ DateUtil to Extraction module as ExtractionDateUtil",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Task",
        "labels": "",
        "fix_versions": [
            "6.0",
            "6.1",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "SolrJ doesn't need a DateUtil class, particularly since we're on Java 8 and can simply use new Date(Instant.parse(d).toEpochMilli()); for parsing and DateTimeFormatter.ISO_INSTANT.format(d.toInstant()) for formatting.  Yes, they are threadsafe.  I propose that we deprecate DateUtil from SolrJ, or perhaps outright remove it from SolrJ for Solr 6.  The only SolrJ calls into this class are to essentially use it to format or parse in the ISO standard format.\n\nI also think we should move it to the \"extraction\" (SolrCell) module and name it something like ExtractionDateUtil.  See, this class has a parse method taking a list of formats, and there's a static list of them taken from HttpClient's DateUtil.  DateUtil's original commit was SOLR-284 to be used by SolrCell, and SolrCell wants this feature.  So I think it should move there.\n\nThere are a few other uses:\n\n\tMorphlines uses it, but morphlines depends on the extraction module so it could just as well access it if we move it there.\n\tThe ValueAugmenterFactory (a doc transformer).  I really doubt whoever added it realized that DateUtil.parseDate would try a bunch of formats instead of only supporting the ISO canonical format.  So I think we should just remove this reference.\n\tDateFormatUtil.parseMathLenient falls back on this, and this method is in turn called by just one caller – DateValueSourceParser, registered as ms.  I don't think we need leniency in use of this function query; values given to ms should be computer generated in the ISO format.\n\n\n\n\nedit: added ms().",
    "attachments": {
        "SOLR_8903_DateUtil_deprecate.patch": "https://issues.apache.org/jira/secure/attachment/12795446/SOLR_8903_DateUtil_deprecate.patch",
        "SOLR_8903.patch": "https://issues.apache.org/jira/secure/attachment/12795842/SOLR_8903.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-25T18:35:56+0000",
            "author": "David Smiley",
            "content": "The attached patch shows some small changes to DateUtil itself, and a few callers (for ms() and [value]).  This patch shows it as deprecated but what I'd really like to do is move it to extraction module as ExtractingDateUtil (rename test similarly) and then simply outright remove the deprecated stuff.  But it's in SolrJ... yet this is a major release and this utility isn't very front & center.  Any opinions?  If I get none I will go with my preference of removing it from SolrJ.\n\nNote: the changes in SOLR-8904 result in DateUtil not being called from SolrJ any more.  So this patch is somewhat dependent on that one. ",
            "id": "comment-15212219"
        },
        {
            "date": "2016-03-29T13:31:15+0000",
            "author": "David Smiley",
            "content": "Updated patch which moves DateUtil to the extraction module as ExtractionDateUtil.  It depends on SOLR-8904 in that some call sites into DateUtil are updated in that patch, not this one now.  DateMathParser is not referred to at all.  I also added some tests, ported from DateMathParserTest.\n\nSuggested CHANGES.txt:\n\n(in upgrading)\n* SolrJ no longer includes DateUtil.  If for some reason you need to format or parse dates, simply use Instant.format() and Instant.parse().\n\n(in other)\n* SOLR-8904: DateUtil in SolrJ moved to the extraction contrib as ExtractionDateUtil.  Obsolete methods were removed.\n\n ",
            "id": "comment-15215998"
        },
        {
            "date": "2016-03-30T17:06:13+0000",
            "author": "Steve Rowe",
            "content": "+1, LGTM\n\nFYI I had to apply the patch using IntelliJ - git apply (git v2.7.4) doesn't grok the file rename/move syntax that is used in this IntelliJ-produced patch - here's the errors I got:\n\n\nerror: solr/contrib/extraction/src/test/org/apache/solr/handler/extraction/TestExtractionDateUtil.java: No such file or directory\nerror: solr/contrib/extraction/src/java/org/apache/solr/handler/extraction/ExtractionDateUtil.java: No such file or directory\n\n\n\nAlso, this patch (and the SOLR-8904 patch) don't apply at the top-level of the project - I had to run git apply under solr/. ",
            "id": "comment-15218327"
        },
        {
            "date": "2016-03-30T19:08:25+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 44e0ac38567e19465ebf74a160064b8a642ec6b6 in lucene-solr's branch refs/heads/branch_6x from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=44e0ac3 ]\n\nSOLR-8903: Move SolrJ DateUtil to contrib/extraction as ExtractionDateUtil.\nAnd removed obsolete methods.\n(cherry picked from commit 5e5fd66) ",
            "id": "comment-15218626"
        },
        {
            "date": "2016-03-30T19:10:01+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 479f0e06343df51a8076dca386cc902f85c3c8fc in lucene-solr's branch refs/heads/branch_6_0 from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=479f0e0 ]\n\nSOLR-8903: Move SolrJ DateUtil to contrib/extraction as ExtractionDateUtil.\nAnd removed obsolete methods.\n(cherry picked from commit 44e0ac3) ",
            "id": "comment-15218630"
        },
        {
            "date": "2016-03-30T19:24:13+0000",
            "author": "David Smiley",
            "content": "Thanks for the review Steve!  Maybe I should start generating patches from the command line.  FWIW looking at the patch I do see the leading solr/ but I know many patches I've seen out there have some sort of nominal a/ or b/ or something like that in front. ",
            "id": "comment-15218652"
        },
        {
            "date": "2016-05-11T00:09:33+0000",
            "author": "Hoss Man",
            "content": "\nManually correcting fixVersion per Step #S6 of LUCENE-7271\n\n\n\nNOTE: master commit (overlooked by gitbot) was 5e5fd662575105de88d8514b426bccdcb4c76948 ",
            "id": "comment-15279278"
        }
    ]
}