{
    "id": "SOLR-6618",
    "title": "SolrCore Initialization Failures when the solr is restarted, unable to Initialization a collection",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.8",
        "status": "Closed",
        "resolution": "Cannot Reproduce",
        "priority": "Major"
    },
    "description": "I have uploaded  one config:default and  do specify collection.configName=default when I create the collection\nand when solr is restart I get this error org.apache.solr.common.cloud.ZooKeeperException:org.apache.solr.common.cloud.ZooKeeperException: Could not find configName for collection overnighttest found:[default, collection1, collection2 and so on]\n\nThese collection1 and collection2 empty configs are created when I run DataImportHandler using ZKPropertiesWriter",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-10-23T08:14:08+0000",
            "author": "Anurag Sharma",
            "content": "From the exception it looks like that ZK failed to find configName for \"overnighttest\" collection in multiple attempts. This looks like a problem with the configuration files. Request you share the configuration on which solr initialization failure is seen. ",
            "id": "comment-14181113"
        },
        {
            "date": "2014-10-29T11:48:38+0000",
            "author": "Vijaya Jonnakuti",
            "content": "Thanks for the reply. Cannot say exactly when it happens, most likely when one of the solr node is restarted.\n\nConfiguration is 3 zookeeper ensemble/3 solr node & 3 client nodes\nall the collections are created with a default config which is uploaded to zookeeper.\n\nBut when dih is run the different config folders with the corresponding collection name are created in the zookeeper with.\nupdate_dih_store.properties in them and no configs in it.\n\nAfter which the system thinks overnighttest should have its own config set in zookeeper, dih is not run for overnighttest collection so that folder is not created.\n\nWe do give configName as \"default\" for the collection creation api through solrj.\n\n  configs\n              /default\n\n\n\n\n\n\n\n               ------has the configs in here \n              /collection1\n\n\n\n\n\n\n\n               ---update_dih_generic.properties but no configs\n             /collection2\n\n\n\n\n\n\n\n               ---update_dih_generic.properties but no configs\n\n\nLet me know if you need more details ",
            "id": "comment-14188263"
        },
        {
            "date": "2018-01-12T18:33:13+0000",
            "author": "Cassandra Targett",
            "content": "A problem like this is likely tied to either the configuration files or the startup params used, but neither are supplied here. There's nothing to go on to troubleshoot this. ",
            "id": "comment-16324352"
        }
    ]
}