{
    "id": "SOLR-7734",
    "title": "MapReduce Indexer can error when using secure collection",
    "details": {
        "components": [
            "contrib - MapReduce"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Closed",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "When running the MapReduceIndexerTool, it will usually pull a solrconfig.xml from ZK for the collection that it is running against. This can be problematic for several reasons:\n\n\n\tPerformance: The configuration in ZK will likely have several query handlers, and lots of other components that don't make sense in an indexing-only use of EmbeddedSolrServer (ESS).\n\tClasspath Resources: If the Solr services are using some kind of additional service (such as Sentry for auth) then the indexer will not have access to the necessary configurations without the user jumping through several hoops.\n\tDistinct Configuration Needs: Enabling Soft Commits on the ESS doesn't make sense. There's other configurations that\n\tUpdate Chain Behaviours: I'm under the impression that UpdateChains may behave differently in ESS than a SolrCloud cluster. Is it safe to depend on consistent behaviour here?",
    "attachments": {
        "SOLR-7734.branch5x.patch": "https://issues.apache.org/jira/secure/attachment/12751727/SOLR-7734.branch5x.patch",
        "SOLR-7734.patch": "https://issues.apache.org/jira/secure/attachment/12742585/SOLR-7734.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-06-29T20:08:11+0000",
            "author": "Mike Drob",
            "content": "Attached a patch that adds a new (embedded) solrconfig.xml file to the map-reduce contrib module. This config will be loaded in lieu of the one found in ZK for the collection. The embedded config features a minimal operational footprint, disabling most request handlers, update chains, and soft commits. It can be overridden by explicitly specifying a --solr-home-dir argument on the command line when launching the job. ",
            "id": "comment-14606291"
        },
        {
            "date": "2015-06-30T20:29:17+0000",
            "author": "Mike Drob",
            "content": "New patch that moves the System.setProperty calls out of SolrRecordWriter, since we explicitly control the configuration now. Also, disabled nrt cache and block cache, since there is a single write and no reads in the MR job. ",
            "id": "comment-14609008"
        },
        {
            "date": "2015-07-08T20:40:24+0000",
            "author": "Mike Drob",
            "content": "Updated patch to have a (help-suppressed) flag that allows old behaviour. I don't think this is a big issue since the contrib is documented as experimental, but I've added it regardless.\n\nCan any committers take a look at this? ",
            "id": "comment-14619323"
        },
        {
            "date": "2015-07-14T23:38:54+0000",
            "author": "Gregory Chanan",
            "content": "\n+import com.google.common.base.Charsets;\n\nThis is necessary?\n\n\n+ \"may be downloaded from this ZooKeeper ensemble.\"));\n\nIt's \"may\" because you might have specified --use-zk-solrconfig.xml?  And you want to leave it vague because the help on --use-zk-solrconfig.xml is suppressed?  This seems more confusing to me than just specifying everything in the help.\n\n\n+        if (!options.useZkSolrConfig) {\n+          // replace downloaded solrconfig.xml with embedded one\n+          InputStream source = MapReduceIndexerTool.class.getResourceAsStream(\"/solrconfig.indexer.xml\");\n+          FileOutputStream destination = new FileOutputStream(getSolrConfig(tmpSolrHomeDir));\n+          ByteStreams.copy(source, destination);\n+\t  destination.close();\n+\t  source.close();\n+        }\n\n\nThe spacing looks off here.  Maybe better to close everything in a finally as well.\n\n\n+      <solr-jarify-filesets>\n+        <fileset dir=\"src/resources\" />\n+      </solr-jarify-filesets>\n\n\nWhen i try to run \"ant jar\" on the map-reduce contrib I get \"solr/contrib/map-reduce/src/resources does not exist\" – did you mean for solrconfig.indexer.xml to be there?\n\n\n+  <luceneMatchVersion>4.10.3</luceneMatchVersion>\n\n\nWhy the old version?  Should this be 6.0.0 for trunk, 5.something for branch_5x?  (I assume you want it in both, tell me if that's incorrect)\n\n\nTo enable dynamic schema REST APIs, use the following for <schemaFactory>:\n+\n+       <schemaFactory class=\"ManagedIndexSchemaFactory\">\n+         <bool name=\"mutable\">true</bool>\n+         <str name=\"managedSchemaResourceName\">managed-schema</str>\n+       </schemaFactory>\n\n\nDoes this work with managed  schemas?  What about if the resource name isn't the default?\n\n\n+  <!-- JMX\n+\n+       This example enables JMX if and only if an existing MBeanServer\n+       is found, use this if you want to configure JMX through JVM\n+       parameters. Remove this to disable exposing Solr configuration\n+       and statistics to JMX.\n+\n+       For more details see http://wiki.apache.org/solr/SolrJmx\n+    -->\n+  <jmx />\n\n\nDo we want jmx?  Is it even possible to use in an MR job?\n\n\n+  <requestDispatcher handleSelect=\"false\" >\n+    <!-- Request Parsing\n\nDo we need this whole section?\n\nAbout testing: I assume the existing tests now use the new (non-overwrite behavior).  What about adding a test for the new option (--use-zk-solrconfig.xml).  Maybe something simple like have your own update chain that adds a field/value that you expect to see.  And possibly the converse, where you add an update.chain and check that the new behavior is actually working, i.e. that it doesn't use the solrconfig in zk. ",
            "id": "comment-14627281"
        },
        {
            "date": "2015-07-15T21:37:24+0000",
            "author": "Mike Drob",
            "content": "Updated patch:\n\n\tFixed imports.\n\tUsed try-with-resources for streams.\n\tFixed file location.\n\tUpdated Lucene match version.\n\tRemoved request dispatcher section\n\n\n\nI don't have a good answer for what to do with the docs. Trying to enumerate all the possibilities - use embedded solrconfig, use solrconfig from zk, use solrconfig from solr home dir, got really messy, so I tried to hedge. I'm now leaning toward it being worth the additional complexity in documentation to spell everything out explicitly but don't have a good handle on it.\n\nI'm not sure about working with managed schemas. I can remove the comment to prevent confusion - it was originally copied from another example file.\n\nJMX on MapReduce tasks can be enabled through mapreduce.map.java.opts - I've seen it used for attempting to monitor memory usage. If somebody wants to try to do this, then I don't intend to give them more hoops to jump through. If jmx is disabled, then I think we end up ignoring that directive, so it's fine.\n\nI will look at how we can add additional tests to verify everything. ",
            "id": "comment-14628791"
        },
        {
            "date": "2015-08-14T17:21:39+0000",
            "author": "Mike Drob",
            "content": "Attached is a patch that adds additional tests for the new solrconfig.xml behaviour in map-reduce. As part of this, I refactored one of the tests to reduce duplication. ",
            "id": "comment-14697414"
        },
        {
            "date": "2015-08-18T01:33:40+0000",
            "author": "Gregory Chanan",
            "content": "Looks good, I really like the new test.  All of my previous comments seem to be addressed.  Just a few minor issues/comments below:\n\nIssue #1:\nWhen I try \"ant test\" I get:\n\n   [junit4]    > Throwable #1: java.lang.RuntimeException: Suite class org.apache.solr.hadoop.MiniMRTest should be a concrete class (not abstract).\n\n\n\nIssue #2:\n\npublic void useSolrHomeDir() throws Exception {\n    String[] prepend = {\"--solr-home-dir=\" + DROPALL_CONF_DIR.getAbsolutePath()};\n\n\nyou can't actually tell if this is going to zk or not.  Maybe overwrite zk with the \"good\" version or something beforehand?\n\nIssue #3:\n\nsolr/contrib/morphlines-core/src/test-files/solr/dropall/conf/stopwords.txt \t\n\n\nDo we need this file?  I don't see it referenced.\n\nIssue #4:\n\n    try (InputStream source = MapReduceIndexerTool.class.getResourceAsStream(\"/solrconfig.indexer.xml\");\n              FileOutputStream destination = new FileOutputStream(getSolrConfig(tmpSolrHomeDir))) {\n            ByteStreams.copy(source, destination);\n          }\n          LOG.debug(\"Replaced zookeeper's solrconfig.xml with embedded version.\");\n\n\nThis spacing looks funky here.\n\nIssue #5:\n\nSolrConfigMRTest\n\n\ncan you put the license first?  all the other test have the license first (or after the package).  I don't know if this fails the rat check or not, but seems good to be consistent.\n ",
            "id": "comment-14700579"
        },
        {
            "date": "2015-08-18T22:44:46+0000",
            "author": "Mike Drob",
            "content": "1) Renamed to MiniMRBase.java\n2) Fixed.\n3) stopwords, synonyms, and protwords were all referenced from schema.xml via the text_en type. I copied that from the other mr conf, though. Can look into removing this if you think that's a worthwhile effort.\n4) You lost some of the leading spaces when copying to JIRA, but it's 4 spaces for a continuation (the try resource declaration) and then 2 spaces for the body of the try. What should it be?\n5) Fixed.\n\nWill upload a new patch once I finish re-running tests with these changes. ",
            "id": "comment-14702126"
        },
        {
            "date": "2015-08-18T22:56:30+0000",
            "author": "Gregory Chanan",
            "content": "3) stopwords, synonyms, and protwords were all referenced from schema.xml via the text_en type. I copied that from the other mr conf, though. Can look into removing this if you think that's a worthwhile effort.\n\nI saw stopwords_en.txt being referenced, not stopwords.  But I just looked quickly – if you try to remove and it doesn't work just leave it in.\n\n4) You lost some of the leading spaces when copying to JIRA, but it's 4 spaces for a continuation (the try resource declaration) and then 2 spaces for the body of the try. What should it be?\n\nMy mistake. ",
            "id": "comment-14702146"
        },
        {
            "date": "2015-08-19T00:40:29+0000",
            "author": "Mike Drob",
            "content": "Attaching a new patch that addresses the issues. I was able to reduce the number of conf files a bit too. ",
            "id": "comment-14702240"
        },
        {
            "date": "2015-08-21T00:59:22+0000",
            "author": "Gregory Chanan",
            "content": "+1 lgtm.\n\nI'll commit to trunk assuming the tests/precommit pass.  If you want it in 5.x as well please create a new patch  (probably need to change the xml for the version). ",
            "id": "comment-14706037"
        },
        {
            "date": "2015-08-21T14:20:03+0000",
            "author": "Mike Drob",
            "content": "The patch applied cleanly to branch_5x for me, and the tests ran without issue. Is there something specific I can check? ",
            "id": "comment-14706781"
        },
        {
            "date": "2015-08-21T14:23:59+0000",
            "author": "Mike Drob",
            "content": "Attached is an addendum patch for branch_5x to be applied on top of the original patch. ",
            "id": "comment-14706786"
        },
        {
            "date": "2015-08-28T18:56:53+0000",
            "author": "Mike Drob",
            "content": "Attaching a patch based on latest trunk, since there were some conflicts that came up since my last submission. ",
            "id": "comment-14720407"
        },
        {
            "date": "2015-10-30T16:21:19+0000",
            "author": "Mike Drob",
            "content": "Gregory Chanan - did you have any other feedback on this? ",
            "id": "comment-14982787"
        }
    ]
}