{
    "id": "SOLR-5446",
    "title": "Admin UI - Allow changing Schema and Config",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "As a follow up to SOLR-5287, this is the UI related part for implementing a file-viewer and the possibility to change files (like schema & config) via the UI.",
    "attachments": {
        "SOLR-5446.patch": "https://issues.apache.org/jira/secure/attachment/12614150/SOLR-5446.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13823874",
            "date": "2013-11-15T18:02:20+0000",
            "content": "Just checked in the code for trunk, 4x in another hour or so.\n\nThere are some TBDs on this page we'll want to fill re: where this functionality is in the UI\nhttps://wiki.apache.org/solr/Editing%20configuration%20files%20in%20the%20admin%20UI "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13824177",
            "date": "2013-11-15T22:25:39+0000",
            "content": "First shot, contains basic tree - will continue tomorrow, showing the current content of the selected file and sending modified content back. step after that would be to integrate fileupload. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13824462",
            "date": "2013-11-16T12:44:56+0000",
            "content": "Next Version, including form to modify the selected file and button to save the changed file back on disk/to ZK "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13824463",
            "date": "2013-11-16T12:50:25+0000",
            "content": "Man, I just downloaded our other patch!\n\nAnyway, it'll be a busy morning here but I should be able to take a look this afternoon.\n\nI'm geeked by this! I think it'll let people get started using Solr easier.. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13824473",
            "date": "2013-11-16T13:32:51+0000",
            "content": "Sweet! On a quick look, this looks near done!\n\nOne thing that would be really cool is if xml files had syntax highlighting. Don't know how possible that is, if it's easy.... If it's not easy, let someone do that in the future .\n\nI know, \"what have you done for me lately?\" \n\nThanks! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13824531",
            "date": "2013-11-16T16:57:53+0000",
            "content": "based on the selected file, the tree is expanded until the correct directory is open.\n\nnext steps: integrate file-upload and a bit error handling "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13824534",
            "date": "2013-11-16T17:02:11+0000",
            "content": "One thing that would be really cool is if xml files had syntax highlighting. Don't know how possible that is, if it's easy.... If it's not easy, let someone do that in the future . \n\nHmm, since that's a normal <textarea> .. that's actually text-only, but i'll see what's possible there (: "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13824565",
            "date": "2013-11-16T18:44:52+0000",
            "content": "Ready to go :> Needs testing, will do that tomorrow\n\nErick Erickson any comments so far? will open another issue for the xml validation thing, so we can implement that afterwards "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13824594",
            "date": "2013-11-16T19:32:39+0000",
            "content": "Waaaaay cool! I especially like the \"upload file\" option.\n\nThree things come to mind:\n\n1> What about an \"add new file\" that would put a new file up to whatever directory is currently open? Maybe from the screen just before the file-edit screen? NOTE: This could very well be a follow-on JIRA.\n\n2> Rather than \"upload file\", maybe something like \"Replace current file\"? Just some indicator that this action will replace the currently open file. I managed to replace schema.xml with a patch file when I was testing...\n\n3> Maybe a \"reload core/collection\" button so you could make the changes \"live\"? Whether the button says core or collection could be dependent on whether we're in SolrCloud mode or not....\n\nFrankly, though, I don't care much if any of these suggestions is adopted immediately, they can always be follow-on JIRAs. Making this available in the UI is cool IMO!\n\nAs soon as this is committed, I'll blast a message out to the Solr list to see what people think. I think this is one of those things that people will really like.\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13824613",
            "date": "2013-11-16T20:16:33+0000",
            "content": "One other thought occurred to me. Does it make sense to remove the 'config' and 'schema' links on the left after you've selected the core? They seem unnecessary with this new capability.\n\nNo big deal either way. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13824830",
            "date": "2013-11-17T13:23:56+0000",
            "content": "Commit 1542720 from Stefan Matheis (steffkes) in branch 'dev/trunk'\n[ https://svn.apache.org/r1542720 ]\n\nSOLR-5446: Admin UI - Allow changing Schema and Config "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13824831",
            "date": "2013-11-17T13:25:19+0000",
            "content": "Commit 1542721 from Stefan Matheis (steffkes) in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1542721 ]\n\nSOLR-5446: Admin UI - Allow changing Schema and Config (merge r1542720) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13824832",
            "date": "2013-11-17T13:27:48+0000",
            "content": "I've committed the current state (including the change, renaming the button for uploading a new file). All the other suggestions are tracked within new issues (already linked to that one).\n\nErick Erickson removing the schema & config links is a nice idea, makes sense. perhaps it would be a nice to have, to say the file browser is showing files first (there we could have xml highlighting) with an option \"edit this file\" which switches over to a simple <textarea> where you could modify and save the file? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13824843",
            "date": "2013-11-17T14:19:24+0000",
            "content": "Stefan Matheis (steffkes): You're the UI person .\n\nReally, whatever you think best. I'm adding a bit of infrastructure to prevent editing the managed schema file... "
        }
    ]
}