{
    "id": "SOLR-2785",
    "title": "DateField timezone handling",
    "details": {
        "affect_versions": "3.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "The Solr DateField appears to only be partially ISO 8601 compliant.\n\nThe DateMathParser requires Timezone modifications to be in the format \"+nMINUTES\", \"+xHOURS\", \"+yDAYS\" etc.\n\nhttp://lucene.apache.org/solr/api/org/apache/solr/schema/DateField.html\n\n\nISO 6801 states that timezone modifications should be in the format +00:01, +01:00\n\nhttp://en.wikipedia.org/wiki/ISO_8601#Time_offsets_from_UTC\n\nIt would be useful if Solr DateField could parse both (I presume there's a reason for +nMINUTE etc somewhere in Java.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Howard Cox",
            "id": "comment-13108600",
            "date": "2011-09-20T11:28:38+0000",
            "content": "When I get a free moment I'm going to look at the code and see how easy it would be to slot in a check on DateTime formatting to include +01:01 timezone modifiers "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13108606",
            "date": "2011-09-20T11:39:47+0000",
            "content": "DateField in Solr is using UTC timezone (\"Z\" notation). "
        },
        {
            "author": "Howard Cox",
            "id": "comment-13108609",
            "date": "2011-09-20T11:45:07+0000",
            "content": "not a major bug, I missed that field in the submission form, oops "
        },
        {
            "author": "Howard Cox",
            "id": "comment-13108613",
            "date": "2011-09-20T11:49:38+0000",
            "content": "I realise DateTime uses UTC timzones, I'm saying the modifier from UTC could also accept the format +01:00 as well as +1HOUR, as the former is what the ISO spec mentions. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13109012",
            "date": "2011-09-20T21:46:06+0000",
            "content": "the DateMathParser is not about supporting timezones, it's just a syntax that is supported for modifying dates so clients don't have to do the math themselves (ie in in range queries you can do \"myField:[NOW/HOUR TO NOW/HOUR+1HOUR]\" etc...)\n\nthe decision to only support canonical UTC in the DateField format is very deliberate because it removes any ambiguity and concerns about expecatations of parsing/formatting (ie: if a user indexes doc A using a TZ of \"+07:00\" and doc B using a TZ of \"-04:00\" will the expect searches matching those docs to have those exact values as the stored field in the result?  if all docs were indexed using the same TZ, will users expect faceting to implicitly use that TZ?\n\nthe point of the canonical format is to force the client(s) to be aware that in the index, everything is in UTC.\n\nif you are interested in helping to support dealing with other date formats and parsing of timezones in insides solr – but at a higher level then the DateField class – those features are definitely desirable.  See SOLR-2690 for more discussion "
        }
    ]
}