{
    "id": "SOLR-4514",
    "title": "Need tests for OpenExchangeRatesOrgProvider",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.2"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "the schema.xml used by CurrencyFieldTest declares a fieldType named \"openexchangeratesorg_currency\" using OpenExchangeRatesOrgProvider pointed at a local copy of open-exchange-rates.json, but field type is completley unused, so nothing about this provider's behavior is ever really tested.\n\nWe should change the test such that all of the functionality tested against the \"amount\" field is also tested against some new field using this OER provider based fieldType, where the copied data (and static exchange rates) are identical.\n\n(esasiest way would probably be to introduce a test variable for the field name and let a new subclass override it)",
    "attachments": {
        "SOLR-4514.patch": "https://issues.apache.org/jira/secure/attachment/12571533/SOLR-4514.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13590205",
            "date": "2013-03-01T03:15:11+0000",
            "content": "one aspect specific to the xml file provider is that it supports asymetrical conversion rates – so i refactored a new AbstractCurrencyField test for the common stuff, put the test for the asymetric conversion in a subclass that uses the \"amount\" field and added another subclasses that uses a new \"oer_amount\" field.\n\ni also updated the (stale) open-exchange-rates.json file to have rates that match the (symetric) rates from currency.xml so the tests would all pass regardless of which file is used "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13590274",
            "date": "2013-03-01T06:08:13+0000",
            "content": "Oy, that last patch sucked so hard i don't even have the energy to list all the things wrong with it. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13590856",
            "date": "2013-03-01T19:26:16+0000",
            "content": "[trunk commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1451691\n\nSOLR-4514: better tests for CurrencyField using OpenExchangeRatesOrgProvider "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13590894",
            "date": "2013-03-01T20:02:13+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1451699\n\nSOLR-4514: better tests for CurrencyField using OpenExchangeRatesOrgProvider (merge r1451691) "
        }
    ]
}