{
    "id": "SOLR-7725",
    "title": "Solr tests should have a easy way to not start up with the bootstrapped collections",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Tests which want to run in its own collection and do not need the default collection still extend AbstractFullDistribZkTestBase\n\nWe are paying the penalty of creating these extra collections with potentially more servers than required. This can add a few seconds to each test at least. \n\nI tried moving the test I wrote on SOLR-5750 to using a MiniSolrCloudCluster and got a 10s improvement.  The downside is I can't use methods such as getDoc() , waitForRecoveriesToFinish() since I am now extending SolrTestCaseJ4.\n\nAn easy solution right now is to move methods like waitForRecoveriesToFinish to a util class and have all tests which don't rely on the default collection or the control_collection to use MiniSolrCloudCluster. \n\nA longer term solution would be to provide this from the test framework itself.\n\nAn easy way to check how many tests don't need the default collection is to see which all tests are calling - waitForRecoveriesToFinish(String collection, boolean verbose) I can see roughly ~25 test classes calling it.",
    "attachments": {
        "SOLR-7725.patch": "https://issues.apache.org/jira/secure/attachment/12742184/SOLR-7725.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-06-26T17:06:15+0000",
            "author": "Varun Thacker",
            "content": "An easy solution right now is to move methods like waitForRecoveriesToFinish to a util class\nwaitForRecoveriesToFinish is a static method. We'll have to see which other methods are important ",
            "id": "comment-14603207"
        },
        {
            "date": "2015-06-26T18:12:39+0000",
            "author": "Varun Thacker",
            "content": "Took the first test I could find and moved it to using MiniSolrCloudCluster. The test used to take approximately 45s on my system before but now takes 28s. \n\nI haven't looked into why we need - \n\nSystem.setProperty(\"solr.test.sys.prop2\", \"proptwo\"); etc but if the approach looks fine we can change the other tests as well.  ",
            "id": "comment-14603343"
        }
    ]
}