{
    "id": "SOLR-6909",
    "title": "Allow pluggable atomic update merging logic",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.1",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Clients should be able to introduce their own specific merging logic by implementing a new class that will be used by the DistributedUpdateProcessor. This is particularly useful if you require a custom hook to interrogate the incoming document with the document that is already resident in the index as there isn't the ability to perform that operation nor can you currently extend the DistributedUpdateProcessor to provide the modifications.",
    "attachments": {
        "SOLR-6909.patch": "https://issues.apache.org/jira/secure/attachment/12689993/SOLR-6909.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-01-05T01:49:13+0000",
            "author": "Steve Davids",
            "content": "Attached a patch which pulls the current merging implementation out from the DistributedUpdateProcessor into a new AtomicUpdateDocumentMerger class. This DistributedUpdateProcessorFactory instantiates a new AtomicUpdateDocumentMerger and passes it to the DistributedUpdateProcessor. This approach allows clients to extend the DistributedUpdateProcessorFactory and instantiate their own custom AtomicUpdateDocumentMerger which is then passed along to the DistributedUpdateProcessor. One thing that I'm not thrilled about is having a static 'isAtomicUpdate' method (currently in the code), I tried to remove the static but a couple other classes require that static method to be there and having a merger member variable didn't quite make sense in those cases so I left it a static. ",
            "id": "comment-14264132"
        },
        {
            "date": "2015-01-05T13:17:18+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "FYI. One idea I was once looking at was to provide the ability of updating a field value using a javascript expression. SOLR-5979.\nSome code is in here, https://issues.apache.org/jira/secure/attachment/12639276/SOLR-5944.patch (the \"expr\" operation, along with \"add\" and \"inc\"). ",
            "id": "comment-14264578"
        },
        {
            "date": "2015-01-09T02:26:44+0000",
            "author": "Steve Davids",
            "content": "The javascript approach is interesting but would seem overly complex when you always want the merging logic to work a specific way all the time. Additionally, I have a user case where I download a document in an update processor, extract fields from downloaded content, and index that document. The interesting thing here is that if I can't download the document I set the doc's status to error, though this is only valid if a good document doesn't already exists in the index, so if an error doc is trying to be merged on top of an existing document an exception is thrown and won't clobber the good document. As you can see with the approach taken in this ticket it allows you the added flexibility with a customizable AtomicUpdateDocumentMerger.\n\nAnother added benefit is that it cleans up the DistributedUpdateProcessor a little. One modification I might want to make is to the attached patch is to make a `doSet` and `doAdd` which would be allow overrides of each specific merge type. ",
            "id": "comment-14270431"
        },
        {
            "date": "2015-01-09T03:39:50+0000",
            "author": "Steve Davids",
            "content": "Updated patch to add a 'doSet' and 'doAdd' method which allows clients to override specific implementations of any atomic update command. ",
            "id": "comment-14270506"
        },
        {
            "date": "2015-01-17T20:04:28+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1652660 from Yonik Seeley in branch 'dev/trunk'\n[ https://svn.apache.org/r1652660 ]\n\nSOLR-6909: Extract atomic update handling logic into AtomicUpdateDocumentMerger ",
            "id": "comment-14281517"
        },
        {
            "date": "2015-01-17T20:42:00+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1652670 from Yonik Seeley in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1652670 ]\n\nSOLR-6909: Extract atomic update handling logic into AtomicUpdateDocumentMerger ",
            "id": "comment-14281530"
        },
        {
            "date": "2015-01-17T20:46:45+0000",
            "author": "Yonik Seeley",
            "content": "Thanks Steve, I've been meaning to extract that logic for some time now...\nI've also slapped an experimental tag on the class to allow easy modification in the future. ",
            "id": "comment-14281533"
        },
        {
            "date": "2015-04-15T00:30:54+0000",
            "author": "Timothy Potter",
            "content": "Bulk close after 5.1 release ",
            "id": "comment-14495386"
        }
    ]
}