{
    "id": "SOLR-7565",
    "title": "Adding new Manning Publications MEAP \"Relevant Search\" to official Solr website book section and news",
    "details": {
        "components": [
            "documentation"
        ],
        "type": "Task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Duplicate",
        "priority": "Minor"
    },
    "description": "Doug Turnbull, John Berryman and Manning Publications are proud to announce the new MEAP Relevant Search.\n\nRelevant Search demystifies relevance work. It teaches you how to return engaging search results to your users, helping you understand and leverage the internals of Lucene-based search engines. Relevant Search walks through several real-world problems using a cohesive philosophy that combines text analysis, query building, and score shaping to express business ranking rules to the search engine. It outlines how to guide the engineering process by monitoring search user behavior and shifting the enterprise to a search-first culture focused on humans, not computers. You'll see how the search engine provides a deeply pluggable platform for integrating search ranking with machine learning, ontologies, personalization, domain-specific expertise, and other enriching sources.",
    "attachments": {
        "Turnbull-RS-HI.jpg": "https://issues.apache.org/jira/secure/attachment/12733760/Turnbull-RS-HI.jpg"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-05-19T09:13:31+0000",
            "author": "Nicole Butterfield",
            "content": "Book Cover ",
            "id": "comment-14550089"
        },
        {
            "date": "2015-05-19T17:15:11+0000",
            "author": "David Smiley",
            "content": "This book's ETA is \"early 2016\":  http://www.manning.com/turnbull/  I'm looking forward to this book (I paid for the MEAP in fact)!  But I don't think we should list books on the website that haven't been released yet. ",
            "id": "comment-14550796"
        },
        {
            "date": "2015-05-19T17:26:09+0000",
            "author": "David Smiley",
            "content": "— though if other committers think it's fine then I'm not going to stand in the way. I guess I was a bit surprised to see this issue thinking the book came out early or something. ",
            "id": "comment-14550823"
        },
        {
            "date": "2015-05-20T04:28:50+0000",
            "author": "Steve Rowe",
            "content": "I don't think we should list books on the website that haven't been released yet.\n\nI don't think we ever have done so before. ",
            "id": "comment-14551791"
        },
        {
            "date": "2015-05-20T11:15:30+0000",
            "author": "Nicole Butterfield",
            "content": "Hello All,\nThank you for the clarification. I did not know this was the case. We can certainly hold off on announcing this publication until it is complete. Many thanks for your help and patience.\n ",
            "id": "comment-14552144"
        },
        {
            "date": "2015-05-21T19:56:06+0000",
            "author": "Hoss Man",
            "content": "please re-open (or just create a new jira) once the book is finalized and available for purchase. ",
            "id": "comment-14554952"
        },
        {
            "date": "2016-10-03T01:26:16+0000",
            "author": "Alexandre Rafalovitch",
            "content": "The book is now available.\n\nIt may also be possible to ask for a discount code to list next to the book for the people who discovered it from the Solr documentation page.  ",
            "id": "comment-15541286"
        },
        {
            "date": "2016-10-25T19:57:30+0000",
            "author": "Alexandre Rafalovitch",
            "content": "The other issue is more recent, so this one can be closed. ",
            "id": "comment-15606299"
        }
    ]
}