{
    "id": "SOLR-12469",
    "title": "Use the term TLS instead of SSL in documentation",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Resolved"
    },
    "description": "In our documentation we should use the correct term TLS instead of SSL. We could still mention SSL in the text for searchability. We should probably not rename the refguide page file name in https://lucene.apache.org/solr/guide/7_3/enabling-ssl.html and the title of this page could be \"Enabling TLS / SSL\" since our refguide search is title-only right now  \n\nI'm not proposing to rename the solr.in.sh environment variables for SSL or java code.\n\nCassandra Targett",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-08T15:43:29+0000",
            "content": "I guess you pinged me because you want me to make the changes you propose? I don't know enough about TLS or SSL or whatever to really understand what you're saying should be done. Or did you want to dig at me about search for the Ref Guide?\n\nI will suggest instead that it seems you have a better grasp on what the page should say, so you could go ahead and change it if you think that's what it needs. ",
            "author": "Cassandra Targett",
            "id": "comment-16506157"
        },
        {
            "date": "2018-06-08T21:17:59+0000",
            "content": "I was simply pinging you, not assuming you would do any work for me \n\nIt is no secret that SSL is outdated and deprecated and that TLS is the protocol we all use for HTTPS these days. However, after reading a bit more about the terminology confusion, see this article: https://certsimple.com/blog/ssl-or-tls, I think I've changed my mind about the priority. Since \"everyone\" are still saying SSL we could keep SSL as the main term, but add TLS in addition for findability. So perhaps the page title should be \"Enabling SSL/TLS\" and also mention TLS elsewhere on the page? ",
            "author": "Jan Høydahl",
            "id": "comment-16506570"
        }
    ]
}