{
    "id": "SOLR-2916",
    "title": "UpdateRequestProcessor.processCommit not Called as Lucene Commits Documents to the Index",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "While running the DIH import handler for a document store of any size, UpdateRequestProcessor.processCommit is not being called when Lucene is intermittently committing documents during the process. The method seems to be called one time at the end of the import process.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13159060",
            "date": "2011-11-29T03:20:05+0000",
            "content": "Matt: As noted in SOLR-2915 and on the mailing list, i think you have a misunderstanding of how the UpdateRequestProcessor APIs work ... the  RunUpdateProcessor.processCommit method is what is responsible for executing the underlying commit on the index – it is not a callback method notified if/when a commit happens.  If you are looking for a callback method, please see the event listener API...\n\nhttps://builds.apache.org/job/Solr-trunk/javadoc/org/apache/solr/core/SolrEventListener.html\n\nfurthermore, i'm not sure i understand what you mean by \"when Lucene is intermittently committing documents during the process\" — The underlying Lucene IndexWriter does not intermittently commit anything ... perhaps you are asking about segment merging? or Solr's autoCommit?\n\nPlease follow up by starting a thread on the solr-user mailing list with more information about what exactly it is you are trying to achieve, and what behavior you are seeing – because from what i can tell there doesn't seem to be a bug here. "
        }
    ]
}