{
    "id": "SOLR-9241",
    "title": "Rebalance API for SolrCloud",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "6.1"
        ],
        "affect_versions": "6.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "This is the v1 of the patch for Solrcloud Rebalance api (as described in http://engineering.bloomreach.com/solrcloud-rebalance-api/) , built at Bloomreach by Nitin Sharma and Suruchi Shah. The goal of the API  is to provide a zero downtime mechanism to perform data manipulation and  efficient core allocation in solrcloud. This API was envisioned to be the base layer that enables Solrcloud to be an auto scaling platform. (and work in unison with other complementing monitoring and scaling features).\n\n\nPatch Status:\n===============\nThe patch is work in progress and incremental. We have done a few rounds of code clean up. We wanted to get the patch going first to get initial feed back.  We will continue to work on making it more open source friendly and easily testable.\n\n Deployment Status:\n====================\nThe platform is deployed in production at bloomreach and has been battle tested for large scale load. (millions of documents and hundreds of collections).\n\n Internals:\n=============\nThe internals of the API and performance : http://engineering.bloomreach.com/solrcloud-rebalance-api/\n\nIt is built on top of the admin collections API as an action (with various flavors). At a high level, the rebalance api provides 2 constructs:\n\nScaling Strategy:  Decides how to move the data.  Every flavor has multiple options which can be reviewed in the api spec.\nRe-distribute  - Move around data in the cluster based on capacity/allocation.\nAuto Shard  - Dynamically shard a collection to any size.\nSmart Merge - Distributed Mode - Helps merging data from a larger shard setup into smaller one.  (the source should be divisible by destination)\nScale up -  Add replicas on the fly\nScale Down - Remove replicas on the fly\n\nAllocation Strategy:  Decides where to put the data.  (Nodes with least cores, Nodes that do not have this collection etc). Custom implementations can be built on top as well. One other example is Availability Zone aware. Distribute data such that every replica is placed on different availability zone to support HA.\n\n Detailed API Spec:\n====================\n  https://github.com/bloomreach/solrcloud-rebalance-api\n\n Contributors:\n=====================\n  Nitin Sharma\n  Suruchi Shah\n\n Questions/Comments:\n=====================\n  You can reach me at nitinssn@gmail.com",
    "attachments": {
        "Replace_Before.jpeg": "https://issues.apache.org/jira/secure/attachment/12818663/Replace_Before.jpeg",
        "Redistribute_call.jpeg": "https://issues.apache.org/jira/secure/attachment/12818665/Redistribute_call.jpeg",
        "Redistribute_After.jpeg": "https://issues.apache.org/jira/secure/attachment/12818666/Redistribute_After.jpeg",
        "Replace_After.jpeg": "https://issues.apache.org/jira/secure/attachment/12818662/Replace_After.jpeg",
        "Redistribute_Before.jpeg": "https://issues.apache.org/jira/secure/attachment/12818667/Redistribute_Before.jpeg",
        "SOLR-9241-4.6.patch": "https://issues.apache.org/jira/secure/attachment/12818671/SOLR-9241-4.6.patch",
        "SOLR-9241-6.1.patch": "https://issues.apache.org/jira/secure/attachment/12818669/SOLR-9241-6.1.patch",
        "Replace_Call.jpeg": "https://issues.apache.org/jira/secure/attachment/12818664/Replace_Call.jpeg"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-21T18:26:35+0000",
            "author": "Nitin Sharma",
            "content": "Rebalance API for SolrCloud ",
            "id": "comment-15342391"
        },
        {
            "date": "2016-06-21T22:54:53+0000",
            "author": "Joel Bernstein",
            "content": "Very excited to see this patch! \n\nThe ticket has this for 4.6.1. Do you believe it will be difficult to get this working on master?\n\nOne small suggestion, if you name the patch SOLR-9241.patch it will conform to the standard practice.\n\nThanks for submitting the patch. ",
            "id": "comment-15342974"
        },
        {
            "date": "2016-06-22T02:36:08+0000",
            "author": "Trey Grainger",
            "content": "I'm also very excited to see this patch. For the next evolution of Solr's scalability (and ultimately auto-scaling), these are exactly the kinds of core capabilities we need for seamlessly scaling up/down, resharding, and redistributing shards and replicas across a cluster. \n\nThe smart merge looks interesting - seems like effectively a way to index into a larger number of shards (for indexing throughput) while merging them into a smaller number of shards for searching, enabling scaling of indexing and searching resourced independently. This obviously won't work well with Near-Realtime Searching, but I'd be curious to hear more explanation about how this works in practice for SolrCloud clusters that don't need NRT search.\n\nAgreed with Joel's comments about the update to trunk vs. 4.6.1. One thing that seems to have been added since 4.6.1 that probably overlaps with this patch is the Replica Placement Strategies (SOLR-6220) vs. the Allocation Strategies implemented here.\n\nThe rest of the patch seems like all new objects that don't overlap much with the current code base. Would be interesting to know how much has changed between 4.6.1 to 6.1 collections/SolrCloud-wise that would create conflicts with this patch. Am obviously hoping not too much...\n\nEither way, very excited about the contribution and about the potential for getting these capabilities integrated into Solr. ",
            "id": "comment-15343228"
        },
        {
            "date": "2016-06-22T17:28:56+0000",
            "author": "Nitin Sharma",
            "content": "I am in parallel trying to port my patch to master and testing out the API. I will update the jira either if I am successful or if I run into issues in porting. Thanks for the feedback! \n\nJoel: I will update the patch with the right naming convention too.  ",
            "id": "comment-15344786"
        },
        {
            "date": "2016-07-07T18:12:29+0000",
            "author": "Noble Paul",
            "content": "This issue can be split into multiple subtasks and we can attack them one by one. One huge patch is very difficult to push through ",
            "id": "comment-15366531"
        },
        {
            "date": "2016-07-08T21:10:34+0000",
            "author": "Nitin Sharma",
            "content": "Noble Paul Let me know if you would want to split this feature wise? (A separate patch for every scaling strategy ?) Kindly advise.  ",
            "id": "comment-15368480"
        },
        {
            "date": "2016-07-09T18:50:09+0000",
            "author": "Noble Paul",
            "content": "Yes, we would need one sub task per strategy and attack them one at a time ",
            "id": "comment-15369243"
        },
        {
            "date": "2016-07-18T21:56:54+0000",
            "author": "Nitin Sharma",
            "content": "This contains two changes. \n\n1) SOLR-9241-4.6.1 (patch) - The original diff has been modified to adhere to the naming conventions. \n\n2) SOLR-9241-6.1 (patch) -  The patch of Redistribute, Replace scaling strategies of the rebalance api on top of 6.1. \n\nAlso attached are screenshots of the api calls and cluster state before vs after.  ",
            "id": "comment-15383154"
        },
        {
            "date": "2016-07-19T13:19:43+0000",
            "author": "Noble Paul",
            "content": "After Going through the patch and discussing with others I would recommend the following for incorporating these features. \n\nAllocationStrategy\nThis will have to be replaced with the Replica placement strategy. If there are missing features that we can add them\n\nRedistribute\nThis will be a new collection admin action REDISTRIBUTE. Optionally, the command should accept node names\n\nScale Up\nThis should be merged into the ADDREPLICA command. That command should accept  a call with a collection name (shard-name can be optional) and nu:of replicas to be added. The system should automatically identify the nodes and create replicas\n\nScale down\n\nFold this into DELETEREPLICA command. The command should accept the no:of replicas to remove \n\nRemove dead nodes\n\nA new command DELETENODE to clean up all replicas in that node\n\nReplace\n\nA new command called REPLACENODE to be created. \n\n\nAuto Shard\n\nWe need to revisit the whole strategy. The current model is neither scalable nor useful. It is not possible to merge all shards into one and split them later. That cannot work for a seriously sized cluster. We need a new mechanism to intelligently to merge shards. We then need to identify new hash ranges in such a way that the no:of splits and merges are minimal. The command would be called as RESHARD and we should pass it the no:of new shards to be created. \n\n\n\n\n ",
            "id": "comment-15384130"
        },
        {
            "date": "2016-07-19T15:19:18+0000",
            "author": "Nitin Sharma",
            "content": "Noble Paul Thanks for the feedback.  Those are some major changes to be made. I will submit a patch only for REDISTRIBUTE/REPLACE with the recommended changes and we can iterate from there. \n\nA few clarifications\n\n1) REPLACENODE: Do you want this to be a seperate admin action? or as a sub action of REBALANCE? Ex. /solr/admin?action=REPLACENODE.... or /solr/admin/collections?action=REBALANCE&scaling_strategy=REPLACENODE? \n\n2) What is the default behavior of the replica replacement strategy? Does it pick unused nodes or just uses round robin to pick the next replica? We have unused and least used as 2 allocation strategies. I can fold them as separate replica replacement strategies if we like.  ",
            "id": "comment-15384337"
        },
        {
            "date": "2016-07-19T15:23:23+0000",
            "author": "Noble Paul",
            "content": "REPLACENODE: Do you want this to be a seperate admin action? \n\nWe will not have a REBALANCE command. The name is ambiguous. Instead, we will have explicit actions for each\n\nWhat is the default behavior of the replica replacement strategy? \n\nNothing. It just randomly assigns nodes in the absence of rules.  We should add a default strategy and make it kick in when no rules are specified. ",
            "id": "comment-15384346"
        },
        {
            "date": "2016-07-20T09:09:05+0000",
            "author": "Noble Paul",
            "content": "The autosharding feature needs a more comprehensive change. I have opened SOLR93-22 to capture that ",
            "id": "comment-15385578"
        },
        {
            "date": "2016-07-21T10:27:43+0000",
            "author": "Yago Riveiro",
            "content": "This will work with shards with 300G? The actual SPLITSHARD command never ends successfully in my case \n\nOther important thing to be in mind:\n\n\tThe operation can take 1 week if necessary, but can't crash the cluster ...\n\tThe level of resource allocated to this task should be configurable, I don't know how, but something like maximum memory and threads to do the task\n\n\n\nP.S: This feature is like ... awesome   ",
            "id": "comment-15387498"
        },
        {
            "date": "2016-07-21T14:09:48+0000",
            "author": "Nitin Sharma",
            "content": "I have tested it with upto 200G index and split from 10-50 shards. It takes around 20 mins but finished everytime. We have another api called SMART_MERGE (used to go from larger shard setup to smaller shard), that is way more optimized in terms of computing num of merges required. It merges around 100G of index from 60 shards in 10 shards in around 7.5 mins. ",
            "id": "comment-15387742"
        },
        {
            "date": "2016-07-21T14:40:32+0000",
            "author": "Yago Riveiro",
            "content": "I have one collection with 6 shards, 200G each (1.2T in total), hypothetically using this API I want transform it in a 12 shards collection, my concern is if this API will get the job done or will fail. ",
            "id": "comment-15387792"
        },
        {
            "date": "2016-07-23T03:02:51+0000",
            "author": "Nitin Sharma",
            "content": "I looked back some stats and found that I have run this upto close to 1T. 10 shards of 100 G each.\n We split that into 20 shards using merge based auto shard - Took around 1 hour but works reliably. \n\nAnother index of size 2T with 50 shards (of 40 G each). We merged that into 10 shards using the smart merge strategy. That took around 10-15 mins. (Depending on machine type, ssd and network bandwidth) ",
            "id": "comment-15390486"
        },
        {
            "date": "2016-08-12T10:55:52+0000",
            "author": "Yago Riveiro",
            "content": "This feature will be released in 6.x branch or will be a 7.x feature? ",
            "id": "comment-15418672"
        },
        {
            "date": "2016-08-12T11:12:11+0000",
            "author": "Noble Paul",
            "content": "It will be released in the next version after it is committed ",
            "id": "comment-15418692"
        },
        {
            "date": "2016-08-12T13:07:06+0000",
            "author": "Varun Thacker",
            "content": "FYI I am working on a patch to improve the logging. I'll post a patch soon ",
            "id": "comment-15418789"
        },
        {
            "date": "2016-11-09T15:47:55+0000",
            "author": "Noble Paul",
            "content": "Other than the RESHARD API, the rest of it is now covered under SOLR-9735.  ",
            "id": "comment-15651272"
        },
        {
            "date": "2016-12-27T16:52:25+0000",
            "author": "Yago Riveiro",
            "content": "Any progress on this? ",
            "id": "comment-15780767"
        },
        {
            "date": "2016-12-28T14:22:33+0000",
            "author": "Noble Paul",
            "content": "This has many sub issues. Which one are you specifically interested in? ",
            "id": "comment-15782978"
        },
        {
            "date": "2016-12-28T14:29:03+0000",
            "author": "Yago Riveiro",
            "content": "Issue SOLR-9322, the RESHARD command. ",
            "id": "comment-15782991"
        },
        {
            "date": "2018-04-03T13:02:50+0000",
            "author": "Alexey Ponomarenko",
            "content": "Hi, sorry, I can not install your patch. Do you have some docs or manual how to install it?  ",
            "id": "comment-16423982"
        },
        {
            "date": "2018-04-03T15:03:03+0000",
            "author": "Jan Høydahl",
            "content": "This patch seems to have a lot of overlap with the new autoscaling feature in Solr. Is there any plans to align this effort with what's in Solr 7? ",
            "id": "comment-16424149"
        },
        {
            "date": "2018-04-03T23:43:50+0000",
            "author": "Noble Paul",
            "content": "This does not do resharding. BTW ,the autoscaling will have some kind of rebalance feature soon ",
            "id": "comment-16424767"
        },
        {
            "date": "2018-04-04T09:18:20+0000",
            "author": "Jan Høydahl",
            "content": "Noble Paul, can you link to that rebalance Jira issue and perhaps mark this as a duplicate? ",
            "id": "comment-16425229"
        },
        {
            "date": "2018-04-04T09:30:03+0000",
            "author": "Noble Paul",
            "content": "There is no such jira ticket now. We need to create one that will work off of the new autoscaling framework and close this as duplicate ",
            "id": "comment-16425241"
        },
        {
            "date": "2018-04-04T21:22:07+0000",
            "author": "Nitin Sharma",
            "content": "Sorry i haven't kept this patch up with the latest solr releases. Last was 6.1.  Noble Paul There is a basic version of resharding in this patch but it has not been ported yet. It does reduce/increase number of shards based on the following commands. \n\n \n\nAuto Shard - Dynamically shard a collection to any size.\nSmart Merge - Distributed Mode - Helps merging data from a larger shard setup into smaller one. (the source should be divisible by destination) ",
            "id": "comment-16426189"
        },
        {
            "date": "2018-04-05T08:43:18+0000",
            "author": "Alexey Ponomarenko",
            "content": "Nitin Sharma so as far as I understand this patch is not very useful regarding that we have autoscaling API in solr 7 ? \n\nDo you have plans to continue work on this path\\merge it to autoscale api\\contribute to autoscale api?  ",
            "id": "comment-16426636"
        },
        {
            "date": "2018-06-23T20:47:38+0000",
            "author": "Nitin Sharma",
            "content": "Alexey Ponomarenko I am currently not actively working on this patch. If I find time, i can look at the autoscale api and see how to rewrite some of my patches to fit that.  ",
            "id": "comment-16521254"
        }
    ]
}