{
    "id": "SOLR-11108",
    "title": "Shorten _default configset warning and use ConfigTool",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.3",
            "master (8.0)"
        ],
        "affect_versions": "7.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In SOLR-10920 a WARNING was added when creating a data driven collection with config-set _default.\n\nThat output from bin/solr is quite heavy:\n\n\nWARNING: Using _default configset. Data driven schema functionality is enabled by default, which is\n         NOT RECOMMENDED for production use.\n\n         To turn it off:\n            curl http://localhost:8983/solr/foo/config -d '{\"set-user-property\": {\"update.autoCreateFields\":\"false\"}}'\n\n\n\n Suggest this output instead, avoiding cURL:\n\n\nWARNING: Using _default configset with data driven schema functionality. NOT RECOMMENDED for production use.\n         To turn off: bin/solr config -c mycoll -p myport -property update.autoCreateFields -value false\n\n\n\nWe already have the ConfigTool in SolrCLI, but it needs to understand -c in addition to -collection and -p in addition to -solrUrl to be more familiar.\n\nAlso suggest to move the printout from bin/solr and bin/solr.cmd to SolrCLI at the same time.",
    "attachments": {
        "SOLR-11108.patch": "https://issues.apache.org/jira/secure/attachment/12885084/SOLR-11108.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-18T09:14:15+0000",
            "content": "+1. Maybe we can still reuse the SOLR-10920 issue and release it with 7.0? ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-16091326"
        },
        {
            "date": "2017-07-18T09:17:22+0000",
            "content": "Sure, I did not wanted to shoehorn anything in, but if we manage in time, it can be committed under that other JIRA-ID and close this as duplicate. Some ConfigTool development is needed. I don't think we need to add full cmdline parsing to both bin/solr and bin/solr.cmd for the ConfigTool, we can simply pass $* to the tool and let all parsing happen there. ",
            "author": "Jan Høydahl",
            "id": "comment-16091330"
        },
        {
            "date": "2017-07-18T12:30:34+0000",
            "content": "IMHO It is a usability improvement and should be good to have in 7.0. Anshum Gupta, do you have any objections? For the next 2-3 days, I'm a little busy, so if you have some time, please go ahead. ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-16091486"
        },
        {
            "date": "2017-08-31T03:08:58+0000",
            "content": "I set in to work on this, but I'm having trouble using the ConfigTool as the proposed new warning message suggests:\n\n\n[~/c/l/solr] $ bin/solr config -h\n\nERROR: config is not a valid command!\n\n\nUsage: solr COMMAND OPTIONS\n       where COMMAND is one of: start, stop, restart, status, healthcheck, create, create_core, create_collection, delete, version, zk, auth, assert\n\n  Standalone server example (start Solr running in the background on port 8984):\n\n    ./solr start -p 8984\n[...skipped for brevity...]\n\n\n\nTaking a peek at bin/solr it does look like there's no plumbing that would allow bin/solr config to work.  I assumed from Jan's comment above that \"bin/solr config\" would work, but that it was missing support for a few options.  Maybe the implied first step is that ConfigTool needs exposed from the control scripts in the first place. ",
            "author": "Jason Gerlowski",
            "id": "comment-16148383"
        },
        {
            "date": "2017-08-31T07:43:23+0000",
            "content": "There is java support for config tool, but not bin/solr support. I propose to just pass-through all arguments from shell to SolrCLI.java ($*) and parse this in Java-land. That's why I propose to add support for -c for collection, and -p for port number instead of needing to pass the full Solr URL. ",
            "author": "Jan Høydahl",
            "id": "comment-16148585"
        },
        {
            "date": "2017-09-02T15:07:11+0000",
            "content": "Attached a patch with the approach outlined by Jan above.  Some notes:\n\n\n\ttests and precommit pass on Linux; I aim to test it on Windows later today.\n\tAlong with a port option, I also added a -scheme option for specifying http/https.  If users need more flexibility, they can ditch scheme/port and specify the endpoint with the solrUrl argument instead.\n\tWith the argument parsing entirely in Java-land, ConfigTool isn't smart enough currently to know about any values specified in solr.in.sh (AFAIK).  Really speaks to the value of SOLR-7871 so we can move that code into Java-land too.\n\n ",
            "author": "Jason Gerlowski",
            "id": "comment-16151523"
        },
        {
            "date": "2017-10-21T17:13:48+0000",
            "content": "I hadn't been able to test this on Windows until recently.  But I've verified that the newly-exposed ConfigTool works on both Windows and Linux.\n\nThis patch should be ready-for-review if anyone finds time to circle back to it. ",
            "author": "Jason Gerlowski",
            "id": "comment-16214031"
        },
        {
            "date": "2017-11-24T20:19:08+0000",
            "content": "Anyone have a chance to look at this?  It's admittedly not very important, but would make some of our bin/solr output a little friendlier. ",
            "author": "Jason Gerlowski",
            "id": "comment-16265513"
        },
        {
            "date": "2018-02-17T18:26:39+0000",
            "content": "I'm going to reexamine the patch here and see if it needs anything else before being merged.  If there are no problems with the tests I hope to merge this later today. ",
            "author": "Jason Gerlowski",
            "id": "comment-16368308"
        },
        {
            "date": "2018-02-17T21:14:49+0000",
            "content": "+1 ",
            "author": "Jan Høydahl",
            "id": "comment-16368364"
        }
    ]
}