{
    "id": "SOLR-4028",
    "title": "When using ZK chroot, it would be nice if Solr would create the initial path when it doesn't exist.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I think this would make it easier to test and develop with SolrCloud, in order to start with a fresh ZK directory now the approach is to delete ZK data, with this improvement one could just add a chroot to the zkHost like:\n\njava -DzkHost=localhost:2181/testXYZ -jar start.jar\n\nRight now this is possible but you have to manually create the initial path.",
    "attachments": {
        "SOLR-4028.patch": "https://issues.apache.org/jira/secure/attachment/12551858/SOLR-4028.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13489904",
            "date": "2012-11-03T02:21:43+0000",
            "content": "I've been considering the one for a while - last bit of feedback I got on it is that it would be better if we didn't do this automatically - that it's better to have to be explicit. I think I still lean towards doing it though.                                               "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13490557",
            "date": "2012-11-05T10:40:07+0000",
            "content": "What's the argument against doing this automatically? I'm not a ZK expert so I may be missing something, but I do think it would make it easier while developing and testing, as you don't need to start zkClient or anything like that to create these directories, and you don't need delete zk data directory, restart zk nodes, etc. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13505415",
            "date": "2012-11-28T12:37:08+0000",
            "content": "I think I see the issue here, the problem would be if someone mistype the initial path, instead of throwing exceptions and stopping, we would be creating a new path and probably hiding an error. \nHowever, we do create paths for overseer and upload configs automatically, I think creating the initial path is more consistent with the current behavior than stopping startup. Other options I thought are:\n•\tOnly create the initial path when bootstrap_conf is true (or bootstrap_confdir). This could still have the same issue described above.\n•\tAdd a new parameter to force creation, something like –DzkHost.create=true. This could add unnecessary parameters and configuration complexity. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13505462",
            "date": "2012-11-28T14:15:01+0000",
            "content": "Yeah, I think that was perhaps the concern - basically, it seems ops type people prefer being explicit. Other paths are auto-created, but they are not arbitrary paths supplied by the user as a connect string - I guess it's a little different. If you are trying to connect to an existing node and type something wrong, you just create a new one rather than getting an error.\n\nI don't know what's best, but like I said, I guess I lean towards auto creating. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13505493",
            "date": "2012-11-28T14:34:29+0000",
            "content": "I think I see the issue here, the problem would be if someone mistype the initial path, instead of throwing exceptions and stopping, we would be creating a new path and probably hiding an error. \n\nThat can go the other direction too?  A config could be created under /solr and then someone could try to join it by forgetting to specify that root in zkHost.\n\nOnly create the initial path when bootstrap_conf is true (or bootstrap_confdir). \n\nAs long as we need some sort of explicit bootstrap, that seems reasonable.\n\nAdd a new parameter to force creation, something like –DzkHost.create=true.\n\nAnything that creates a skeleton layout of a new cluster should work the same (auto-create the rot if it doesn't exist).  \"ZkCLI -cmd bootstrap\" for example.  Not sure if there are others. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13505500",
            "date": "2012-11-28T14:44:16+0000",
            "content": "That can go the other direction too? A config could be created under /solr and then someone could try to join it by forgetting to specify that root in zkHost.\nThis can happen today too\nAnything that creates a skeleton layout of a new cluster should work the same (auto-create the rot if it doesn't exist). \"ZkCLI -cmd bootstrap\" for example. Not sure if there are others.\nYes, I agree "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13528101",
            "date": "2012-12-10T17:54:30+0000",
            "content": "With this patch, the initial path is created only when bootstrap_conf or boostrap_confdir are specified. \nZkCli also creates the initial path when the command is upconfig or bootstrap are used "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13528140",
            "date": "2012-12-10T18:29:35+0000",
            "content": "Cool, thanks. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13528418",
            "date": "2012-12-10T23:20:40+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1419866\n\nSOLR-4028: When using ZK chroot, it would be nice if Solr would create the initial path when it doesn't exist. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13528441",
            "date": "2012-12-10T23:38:00+0000",
            "content": "Thanks Tomas! Great patch! I've committed it. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13528444",
            "date": "2012-12-10T23:42:10+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1419870\n\nSOLR-4028: When using ZK chroot, it would be nice if Solr would create the initial path when it doesn't exist. "
        }
    ]
}