{
    "id": "SOLR-1469",
    "title": "TestReplicationHandler failure",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "TestReplicationHandler seems to fail often.",
    "attachments": {
        "fail1.txt": "https://issues.apache.org/jira/secure/attachment/12451041/fail1.txt",
        "SOLR-1469.patch": "https://issues.apache.org/jira/secure/attachment/12451042/SOLR-1469.patch",
        "TestReplicationHandler.FAILED.210743": "https://issues.apache.org/jira/secure/attachment/12420669/TestReplicationHandler.FAILED.210743"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12760133",
            "date": "2009-09-28T01:44:52+0000",
            "content": "Attaching one particular worrying failure.\n\nTestcase: testReplicateAfterWrite2Slave took 2.656 sec\n        FAILED\nexpected:<1> but was:<0>\njunit.framework.AssertionFailedError: expected:<1> but was:<0>\n        at org.apache.solr.handler.TestReplicationHandler.testReplicateAfterWrite2Slave(TestReplicationHandler.java:424)\n\nSo replication was disabled, a doc was added to the slave, but then the search for it failed.  How can that be? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12760134",
            "date": "2009-09-28T01:56:14+0000",
            "content": "Are you using Windows? Havn't gotten it to fail on Linux yet.\n\nPerhaps we should add a check of the status returned from index in there? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12760146",
            "date": "2009-09-28T04:30:49+0000",
            "content": "OK, I think this particular one might be a bug in the test.\nReplication is disabled only after the master commit - and in the test log provided it looks like the start of a replication sneeks in there, and finishes after the addDoc() on the slave.\n\nI'll leave the tests running in a loop tonight and see if moving the disableReplication before the master commit fixes things. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12760236",
            "date": "2009-09-28T12:47:28+0000",
            "content": "I just committed the fix for the assertion failure above. \nThe failures left now are due to connection refused exceptions. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12761947",
            "date": "2009-10-03T19:48:40+0000",
            "content": "Jetty still fails to come up occasionally, even after waiting 2 minutes.  I also tested with the latest Jetty 6.1.21 - same results.\nAt this point, it could still be a Solr bug or a Jetty bug. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894452",
            "date": "2010-08-02T03:12:36+0000",
            "content": "The Jetty bug has been fixed by SOLR-2019.\n\nThe failures that Mark & I recently saw http://search.lucidimagination.com/search/document/6d3f4d23cde4f1bd/solr_replication_test_case_failure\nlooks due to sharing servers across test cases.\n\nsetUp() cleans up inbetween, but that's part of the problem.  The commit from setup() can start replication before it can be disabled... and then it can complete right after the last add on the slave, wiping out the adds and causing the test to fail. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894551",
            "date": "2010-08-02T13:38:01+0000",
            "content": "Here's the log of the failure (fail1.txt)\nThe fix would seem to be simple.... but I'm seeing some other strange stuff that looks off.\n\nLine 12818: you can see replication start right before it's disabled.\nIt's going after master index version 1280686155645.\nBut if we look back to Line 16046, we see that that is not the newest master index! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894554",
            "date": "2010-08-02T14:23:46+0000",
            "content": "OK, it looks like the previous test method set up the master to only replicate on startup, and hence that would seem to be the reason why the wrong index version was being replicated.  The test only checked that when replication was enabled again that the doc added to the slave directly was gone - it did not check that it got the correct version of the index. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894556",
            "date": "2010-08-02T14:45:25+0000",
            "content": "OK, here's a patch that fixes some issues.\n\n\tTo avoid the commit() in setUp() causing an unwanted replication event, it now first queries the master and if  there are any docs it deletes the index on the master and waits for that to replicate to the slave.\n\tI moved testReplicateAfterWrite2Slave up in the file so it will run before anything that changes the default server configs (this gets around the problem where it was only replicating on startup)\n\tI added some test code at the end of  testReplicateAfterWrite2Slave to ensure that the correct index was replicated\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894612",
            "date": "2010-08-02T17:35:41+0000",
            "content": "committed to trunk and 3x. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-12894626",
            "date": "2010-08-02T18:01:57+0000",
            "content": "Hmm TestReplicationHandler now takes much longer for me (~149 seconds).  Previously it was ~30 seconds.  Is this expected? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894630",
            "date": "2010-08-02T18:13:43+0000",
            "content": "grrr... no it's not expected.\nI moved one testcase around (that shouldn't matter).\nOnly thing I can figure is it might be when I'm waiting for the empty index to replicate to the slave.  I'll look into it. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894664",
            "date": "2010-08-02T19:28:02+0000",
            "content": "That was the problem.  I'm making slow progress... the test methods have so many side effects it's hard to order them correctly and return things to enough of a correct state though.\n\nIt's also the case that all of the methods indexed and tested for 500 docs, so it was also possible to get false passes.  I'm changing this to use a different number for each test method. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12894697",
            "date": "2010-08-02T20:32:19+0000",
            "content": "OK, here's a patch that removes setUp()... we can't really automatically clean the indexes with the servers in unknown states as they are at the end of many test methods.  The calls are now somewhat explicit.\n\nThere were some tests that rearranging didn't fix and I had to add more server bounces to restore the correct state, so the test will be a few seconds longer than it was before. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013181",
            "date": "2011-03-30T15:45:47+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}