{
    "id": "SOLR-3972",
    "title": "Missing admin-extra files result in SEVERE log entries with giant stacktrace",
    "details": {
        "affect_versions": "4.0,                                            4.1",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Missing admin-extra files result in SEVERE log entries with giant stacktrace.\n\nIf a log entry is warranted at all, it should just be a one-line warning.",
    "attachments": {
        "SOLR-3972.patch": "https://issues.apache.org/jira/secure/attachment/12562131/SOLR-3972.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13480567",
            "date": "2012-10-20T00:51:12+0000",
            "content": "Full log/stacktrace:\n\nOct 19, 2012 6:38:15 PM org.apache.solr.common.SolrException log\nSEVERE: org.apache.solr.common.SolrException: Can not find: admin-extra.menu-bottom.html [/index/solr4/cores/inc_0/conf/admin-extra.menu-bottom.html]\n        at org.apache.solr.handler.admin.ShowFileRequestHandler.showFromFileSystem(ShowFileRequestHandler.java:231)\n        at org.apache.solr.handler.admin.ShowFileRequestHandler.handleRequestBody(ShowFileRequestHandler.java:122)\n        at org.apache.solr.handler.RequestHandlerBase.handleRequest(RequestHandlerBase.java:129)\n        at org.apache.solr.core.SolrCore.execute(SolrCore.java:1750)\n        at org.apache.solr.servlet.SolrDispatchFilter.execute(SolrDispatchFilter.java:455)\n        at org.apache.solr.servlet.SolrDispatchFilter.doFilter(SolrDispatchFilter.java:276)\n        at org.eclipse.jetty.servlet.ServletHandler$CachedChain.doFilter(ServletHandler.java:1337)\n        at org.eclipse.jetty.servlet.ServletHandler.doHandle(ServletHandler.java:484)\n        at org.eclipse.jetty.server.handler.ScopedHandler.handle(ScopedHandler.java:119)\n        at org.eclipse.jetty.security.SecurityHandler.handle(SecurityHandler.java:524)\n        at org.eclipse.jetty.server.session.SessionHandler.doHandle(SessionHandler.java:233)\n        at org.eclipse.jetty.server.handler.ContextHandler.doHandle(ContextHandler.java:1065)\n        at org.eclipse.jetty.servlet.ServletHandler.doScope(ServletHandler.java:413)\n        at org.eclipse.jetty.server.session.SessionHandler.doScope(SessionHandler.java:192)\n        at org.eclipse.jetty.server.handler.ContextHandler.doScope(ContextHandler.java:999)\n        at org.eclipse.jetty.server.handler.ScopedHandler.handle(ScopedHandler.java:117)\n        at org.eclipse.jetty.server.handler.ContextHandlerCollection.handle(ContextHandlerCollection.java:250)\n        at org.eclipse.jetty.server.handler.HandlerCollection.handle(HandlerCollection.java:149)\n        at org.eclipse.jetty.server.handler.HandlerWrapper.handle(HandlerWrapper.java:111)\n        at org.eclipse.jetty.server.Server.handle(Server.java:351)\n        at org.eclipse.jetty.server.AbstractHttpConnection.handleRequest(AbstractHttpConnection.java:454)\n        at org.eclipse.jetty.server.BlockingHttpConnection.handleRequest(BlockingHttpConnection.java:47)\n        at org.eclipse.jetty.server.AbstractHttpConnection.headerComplete(AbstractHttpConnection.java:890)\n        at org.eclipse.jetty.server.AbstractHttpConnection$RequestHandler.headerComplete(AbstractHttpConnection.java:944)\n        at org.eclipse.jetty.http.HttpParser.parseNext(HttpParser.java:634)\n        at org.eclipse.jetty.http.HttpParser.parseAvailable(HttpParser.java:230)\n        at org.eclipse.jetty.server.BlockingHttpConnection.handle(BlockingHttpConnection.java:66)\n        at org.eclipse.jetty.server.bio.SocketConnector$ConnectorEndPoint.run(SocketConnector.java:254)\n        at org.eclipse.jetty.util.thread.QueuedThreadPool.runJob(QueuedThreadPool.java:599)\n        at org.eclipse.jetty.util.thread.QueuedThreadPool$3.run(QueuedThreadPool.java:534)\n        at java.lang.Thread.run(Thread.java:722) "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13534955",
            "date": "2012-12-18T15:14:39+0000",
            "content": "There is a workaround.  Just create 0 byte files in the conf directory with these names:\n\nadmin-extra.html\nadmin-extra.menu-bottom.html\nadmin-extra.menu-top.html\n\nThe unix touch command works great for this. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13535627",
            "date": "2012-12-19T04:24:43+0000",
            "content": "As someone on the mailing list pointed out, my workaround is a poor one.  It does work, and gets rid of the glaring error message, but it complicates HOWTO sort of documentation and is difficult for a novice to grasp. "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-13535783",
            "date": "2012-12-19T08:48:03+0000",
            "content": "Any reason to not just put in some blank files for the example app?   With maybe a HTML comment telling folks to put in their own custom links etc?   Why leave it to be magic?   And when folks are browsing the /conf directory they will see these files and immediately grasp what they are for!  That would be much simpler then having complex logic in the ShowFileHandler that decides when a missing a file is a INFO level error and when it is a WARNing. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13535788",
            "date": "2012-12-19T08:54:57+0000",
            "content": "This would work for an example up, but suddenly increases the minimum number of files for a solr instance from 3 (solr.xml, solrconfig.xml, schema.xml) to 5 (6?).\n\nActually, I am not sure where the files themselves are requested from. Is it from UI/Ajax? Or somewhere from a server logic? "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-13535791",
            "date": "2012-12-19T08:58:32+0000",
            "content": "It's from the new UI, it makes Ajax calls to load these files.  And I guess I don't think of them as \"required\", since if your core doesn't have them, then things would still work, you would just get the error.  I do think that having them in the ./example app would make it easier for folks to actually adopt that functionality. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13535802",
            "date": "2012-12-19T09:15:00+0000",
            "content": "The problem is that we don't have just 'example' instance, the problem will show up in DIH example for each core. So, it is a lot of empty files lying around. And, like I mentioned elsewhere, they are not even very useful, because all the formatting seems to be reset by the CSS.\n\nIf we really do want them, can we request them with optional flag (e.g. ?optional=true) and check for that in file handler? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13536013",
            "date": "2012-12-19T15:04:07+0000",
            "content": "I agree with Alexandre.  When I was copying from the example, which included copying the included jetty and creating an init script for it, I looked at the three extra html files, which ARE included there.\n\nI figured since they were \"-extra\" they were not necessary.  I did look into their actual content and found it useless, so I didn't copy them to my installation.  That's when I ran into the stacktrace - the 20 cores I had when I first set it up (deriving from my 3.x config) produced sixty of these huge log entries, even when logging at WARN.  Now I have 16 cores on the server and my workaround has eliminated the error.\n\nIf a fix for this issue were implemented (using log.warn()) and I deleted the empty html files, I would end up with 48 consecutive single log line entries if I left logging at WARN.  If the logging were at INFO (which I believe is the default), they would probably be scattered throughout the log and not make much difference in its size.  That's actually a good argument for making the message log at info and not warn. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13536017",
            "date": "2012-12-19T15:11:42+0000",
            "content": "It looks like the only non-test place that these filenames are mentioned is in a javascript file, and the error comes from core/src/java/org/apache/solr/handler/admin/ShowFileRequestHandler.java.  It shows up twice - once when pulling from Zookeeper, and once when pulling from the filesystem.\n\nI will take a deeper look and attempt a patch when I make it to work and get it pulled into eclipse. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13537832",
            "date": "2012-12-21T12:53:59+0000",
            "content": "Let's just nuke them. Frankly, this seems like one of those features that someone can implement in their very own installation if it's important. Solr has never been about providing a user-facing interface, the admin UI is a dev tool.\n\nI'd (grudgingly) go along with hardening the code to never log an error if these files aren't found, but inserting some junk like \"if (filename == admin-extras.html) don't log\" is really ugly in the code. All to make up for something that, IMO, shouldn't be there in the first place.\n\nFWIW\nErick "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13538321",
            "date": "2012-12-21T19:23:37+0000",
            "content": "I'm pretty sure this was already fixed as part of SOLR-4019 ... if not, then builidng off of those changes the fix should be easy.  i'll do some testing "
        },
        {
            "author": "Upayavira",
            "id": "comment-13538380",
            "date": "2012-12-21T20:23:27+0000",
            "content": "This has to be one of the easier patches. This removes the admin-extra functionality from the admin UI.\n\nThis patch appears to apply to both 4x and trunk. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13538490",
            "date": "2012-12-21T22:41:29+0000",
            "content": "This removes the admin-extra functionality from the admin UI.\n\nUpayavira: as mentioned in my previous comment, the idea behind the changes in SOLR-4019 was to eliminate these exceptions from the log, that patch just didn't address all of the code paths in ShowFileRequestHandler.   While your patch completely removes the admin-extra UI feature, and eliminates the exceptions when using the UI – it doesn't address  the underlying issue: ShowFileRequestHandler shouldn't log a big loud ugly stack trace for the understandable error of a 404 \"file not found\"\n\nThis new patch fixes the remaining code paths in ShowFileREquestHandler to \"return\" the 404 exception instead of throwing it and includes tests for this – which should be done regardless of anything else.  It also leaves the admin-extra functionality in place, since it's no longer noisy if the files 404.\n\nDoes any one actually object to leaving this admin-extras functionality in place with this fix? "
        },
        {
            "author": "Upayavira",
            "id": "comment-13538511",
            "date": "2012-12-21T23:01:36+0000",
            "content": "I don't object to leaving the code in place. Our JIRA comments crossed and I didn't see yours until straight after I clicked 'go'. \n\nGiven the exceptions have been fixed, the principal incentive to remove this code has been taken away. Good luck to anyone who finds out the functionality exists  "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538516",
            "date": "2012-12-21T23:06:34+0000",
            "content": "Does any one actually object to leaving this admin-extras functionality in place with this fix?\n\nI do like the anmin-extras functionality.  Just because I don't have a use for it right now doesn't mean that I won't in the future - it would make it a lot easier to hand off some admin responsibilities to untrained personnel if I could put docs and links for common tasks right in the UI.\n\nI filed the issue to eliminate the incredible noise in the logs.  Looking at the patch, I can't tell what happens in the log.  I'll test it later when I have a free moment.  IMHO it ought to be logged at INFO, but WARN would be understandable too.  Thanks! "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13538564",
            "date": "2012-12-22T00:10:10+0000",
            "content": "[trunk commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1425207\n\nSOLR-3972: Fix ShowFileRequestHandler to not log a warning in the (expected) situation of a file not found. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13538576",
            "date": "2012-12-22T00:34:31+0000",
            "content": "Thanks!\n\nNo, thank you for creating the issue – i really thought this was already fixed by SOLR-4019 or i would have dealt with it already. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13538583",
            "date": "2012-12-22T00:38:10+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1425213\n\nSOLR-3972: Fix ShowFileRequestHandler to not log a warning in the (expected) situation of a file not found. (merge r1425207) "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13538730",
            "date": "2012-12-22T11:04:25+0000",
            "content": "I do like the admin extra files as well, if they don't cause the exception. But if we are keeping them, can somebody have a look at Admin CSS as well (as a separate issue probably) and see why all the formatting in those admin extra files seem to be reset (e.g. H1, H2 all look the same as body text).  "
        }
    ]
}