{
    "id": "SOLR-1780",
    "title": "existence of exactly one value for uniqueKey field is not checked when overwrite=false or allowDups=true",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As noted in SOLR-1695, DirectUpdateHandler(2) when a document is added, the uniqueKey field is only asserted to contain exactly one value if overwrite=true.  If overwrite=false (or allowDups=true) then the uniqueKey field is not checked at all.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12835420",
            "date": "2010-02-18T21:41:56+0000",
            "content": "As mentioned in SOLR-1695 it's somewhat debatable whether this is a bug.\n\nIn one common use case: allowDups=true may be used for faster bulk indexing, but user could still expect Solr to error if a doc doesn't contain a uniqueKey value (or contains more then one) so that the index remains internally consistent – subsequent attempts to \"update\" documents in the index will expect all docs to have exactly one uniqueKey value.  This would make validating uniqueKey on par with validating the presence of required fields, or that multiValued=false fields contain no more then one value.\n\nOn the other hand: people may be using allowDups=true to index \"meta\" documents that exist outside of the normal document space, and don't want to be constrained by the uniqueKey rules ... even though they are currently constrained by the required & multiValued rules (not to mention the general list of schema fields)\n\nPersonally: it seems like a bug to me, and the first case seems more common then the second.  People wanting that kind of \"meta\" doc behavior when using overwrite=false could always just specify a bogus artificial value for the uniqueKey field (it wouldn't even have to be unique, all meta docs could use the same value) "
        }
    ]
}