{
    "id": "SOLR-5060",
    "title": "4.4 refguide pages on hdfs support",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "breaking off from parent...\n\n\n\n\tCompletley new docs about the HDFS SolrCloud support ... somewhere....\n\t\n\t\tSOLR-4916: Add support to write and read Solr index files and transaction log files to and from HDFS. (phunt, Mark Miller, Greg Chanan)\n\t\t\n\t\t\tCT: Without studying this more, it's hard to know where this should go. It's not really SolrCloud, and it's not really a client, but depending on why it's being done it could overlap with either...If someone writes up what you'd tell someone about using it, I could give a better idea of where it fits in the existing page organization (if it does).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13717317",
            "date": "2013-07-23T18:47:51+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13717623",
            "date": "2013-07-23T21:05:39+0000",
            "content": "Any comments on a good location for sticking this? It seems perhaps another top level topic. It simply lets you put the index, lock and transaction log in hdfs rather than on the local filesystem. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13717646",
            "date": "2013-07-23T21:29:35+0000",
            "content": "Maybe under https://cwiki.apache.org/confluence/display/solr/Managing+Solr? It's a teeny bit of a stretch for what's already there, but not wildly so (since logging is under there).\n\nIf not there, I don't think there's a big problem with a top level topic for now. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13717650",
            "date": "2013-07-23T21:33:41+0000",
            "content": "Thanks, Managing+Solr looks good. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13717679",
            "date": "2013-07-23T22:03:51+0000",
            "content": "It simply lets you put the index, lock and transaction log in hdfs rather than on the local filesystem.\n\nhow is it enabled/configured?  would it make sense just to mention the details on the appropriate sub-pages of https://cwiki.apache.org/confluence/display/solr/Configuring+solrconfig.xml ? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13718551",
            "date": "2013-07-24T16:34:38+0000",
            "content": "I think Managing+Solr is a good spot - you really want one small and nice location for knowing what you need to know to use HDFS I think.\n\nThere should probably be additional material in the 'appropriate sub-pages', but I think that can come later.\n\nI've made a first stab at what I think is the right approach for getting something useful in by today. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13719119",
            "date": "2013-07-25T00:52:14+0000",
            "content": "looks like miller finished this but didn't resolve "
        }
    ]
}