{
    "id": "SOLR-6107",
    "title": "Sort on Phrase Frequency",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "I am using Solr 4.6.1 and solr is new for me to use,  \nFollowing is my problem which currently facing. \nMy requirement is when i search in solr i want to the entire documents sort on term frequency desc order.\nFor ex. if i search space shuttle so i can get tf(term frequency) of space and  tf of shuttle individual, so i can sort  all the documents  base on sum of  the both tf.\nBut when i search \"space  shuttle\" so can get 0 tf for all the solr documents result.\ni have search on google and i can get result that solr only return s terms frequency of single word and solr also consider \"space shuttle\" as a  phrase not a terms so it return 0 count for all documents.\nCan I get phrase frequency count and sort on that?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ahmet Arslan",
            "id": "comment-14005895",
            "date": "2014-05-22T13:13:07+0000",
            "content": "Hi Kamlesh, please ask this kind of questions to solr-user mailing list. Here is information about how you can subscribe and start sending e-mails. \nhttps://lucene.apache.org/solr/discussion.html You will get a lot of answers. "
        },
        {
            "author": "Ahmet Arslan",
            "id": "comment-14005900",
            "date": "2014-05-22T13:23:39+0000",
            "content": "I am closing this one, in favor of moving the question to mailing list. You probably want to look at solr.ShingleFilterFactory "
        },
        {
            "author": "kamlesh",
            "id": "comment-14006783",
            "date": "2014-05-23T04:36:21+0000",
            "content": "Hi Ahmet,\nThanks for the reply. \ni will look into solr.ShingleFilterFactory and next time i will post my further query in above link.\n "
        }
    ]
}