{
    "id": "SOLR-4907",
    "title": "Discuss and create instructions for taking Solr from the example to robust multi-server production",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Information Provided"
    },
    "description": "There are no good step-by-step instructions for taking the Solr example and producing a robust production setup on multiple servers.",
    "attachments": {
        "SOLR-4907-install.sh": "https://issues.apache.org/jira/secure/attachment/12586766/SOLR-4907-install.sh"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13677743",
            "date": "2013-06-07T01:37:23+0000",
            "content": "As we create and tweak said instructions, we may discover that the example directory layout needs some changes.  Installation scripts would be an awesome thing.  If it's possible without gymnastics, we should have a batch file that someone could use (possibly with a user-downloaded copy of SRVANY) to install the example jetty as a Windows service. "
        },
        {
            "author": "jmlucjav",
            "id": "comment-13677889",
            "date": "2013-06-07T08:28:19+0000",
            "content": "Just a comment in case it's useful, I always install solr service with http://yajsw.sourceforge.net/ whether it's Windows/Linux (yajsw supports other unixes too but I have not used it myself there).\n\nRegarding a batch to properly install Solr, this would be helpful. I currently use one that does this, but I bet one included by Solr but do things much better regarding permissions etc. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13677953",
            "date": "2013-06-07T11:01:31+0000",
            "content": "jm:\n\nYonik's Law Of Patches reads:\n\"A half-baked patch in Jira, with no documentation, no tests\nand no backwards compatibility is better than no patch at all.\"\n\nSo if you can share your install script that would be a great\nhelp, you've probably had to work through a bunch of issues\ncreating it that would help anyone picking up on this JIRA.\n "
        },
        {
            "author": "jmlucjav",
            "id": "comment-13677967",
            "date": "2013-06-07T11:37:20+0000",
            "content": "Erick,\n\nI am not sure how helpful my script would be, it is very targeted to the way I install solr, and OTOH my unix skills are not too sharp and I might be doing stupid/less than optimal things.\n\nOther than that I would have no issue sharing it. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13677974",
            "date": "2013-06-07T12:02:53+0000",
            "content": "jm:\n\nNot a problem, just note whatever reservations you have. Anyone picking up on this can just ignore it if they want. You'll see patches put up with \"nocommit\" in comments, patches that don't compile etc. that are all considered works in progress.\n\nIt's likely, even if someone is starting from scratch, they'll look over your approach and say \"Wow! I didn't think of that, I'll have to do something to take care of that case.\"... "
        },
        {
            "author": "jmlucjav",
            "id": "comment-13677989",
            "date": "2013-06-07T12:34:42+0000",
            "content": "Ok, I had a look at my script...I have not touched it in some months so I didnt remember the details. What I do is:\n\n1. using Ant, create a zip of custom stuff for current installation (conf files)\n2. deploy a sh on the server, that:\n\n\tinstall dependencies (java, ant...)\n\tdownloads solr\n\tdownloads yajsw\n\tinstall both\n\tdownloads the zip I built for this installation\n\trun ant target that deploys the zip, and removes other dirs/files that I'm not using. Also configures yajsw\n\tstart service and check starts fine\n\n\n\nSo I am not sure a pure sh solution would be preferred instead of depending on ant... "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13678052",
            "date": "2013-06-07T14:17:54+0000",
            "content": "jmlucjav I agree with Erick, having your script available would be helpful.  Even if it never makes it into the final patch, it can serve as inspiration.  Since it's probably named 'build.xml' you could attach it as SOLR-4907-ant-install.xml.\n\nOn Linux, I have a pretty good init script for older RPM based systems like RHEL/CentOS.  It does need some work to make it more generic and make sure it's bulletproof.  I believe it would also work on newer Fedora systems that use systemd.  It would be easy to adapt to Debian, but I believe that the latest Ubuntu is using upstart, and I have zero knowledge of what to do there.  Hopefully we could find kind souls willing to work on scripts for Solaris, AIX, and other big iron systems.\n\nExactly what to do for Windows is a bit of a sticky point.  If we can find a wrapper whose license allows us to include it, should we do so, or would it be better to ask the user to download one that we support, regardless of the licensing?  I personally use Windows as a client, but avoid using it as a server. "
        },
        {
            "author": "jmlucjav",
            "id": "comment-13678296",
            "date": "2013-06-07T18:45:06+0000",
            "content": "my simple installation file, used on ubuntu "
        },
        {
            "author": "jmlucjav",
            "id": "comment-13678299",
            "date": "2013-06-07T18:48:15+0000",
            "content": "Ok, I attached my installation file, I already warned its possibly sub-par. Some notes:\n\n1. I run this as root\n2. it uses a project.solr.zip (that contains sorlconfig.xml etc) and a build.xml to overwrite default files that come with the example. It also moves some dir around, renames etc, in order to set a layout of dirs I like.\n3. some stuff is needed cause I develop on windows (like fromdos)\n4. yajsw is LGPL "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13678816",
            "date": "2013-06-08T18:48:15+0000",
            "content": "\nOn Linux, I have a pretty good init script for older RPM based systems like RHEL/CentOS. It does need some work to make it more generic and make sure it's bulletproof. I believe it would also work on newer Fedora systems that use systemd. It would be easy to adapt to Debian, but I believe that the latest Ubuntu is using upstart, and I have zero knowledge of what to do there. Hopefully we could find kind souls willing to work on scripts for Solaris, AIX, and other big iron systems.\n\nI would prefer we leave this as something for downstream packaging maintainers to do instead. Otherwise, how can we maintain and test all this stuff? I don't think an answer of 'release manager does it' is a good one here.\n\nIf someone is really inspired to e.g. ensure that Ubuntu has robust support, then isn't it better to contribute directly to them, so that it just works via the natural methods of installing packages like 'apt-get'? "
        },
        {
            "author": "Steve Davids",
            "id": "comment-14619695",
            "date": "2015-07-09T01:21:19+0000",
            "content": "I created a Solr RPM (yum) and DEB (apt-get) package builder here: https://github.com/sdavids13/solr-os-packager. It would be great if those packages can be built and pushed out with new Solr releases to make life a bit easier for clients to install and update to newer versions of Solr. The real meat is happening in the Gradle build file which uses Netflix's gradle-os-package plugin: https://github.com/sdavids13/solr-os-packager/blob/master/build.gradle. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15488670",
            "date": "2016-09-13T22:36:59+0000",
            "content": "There has since been a change in SOLR-8101 where solr.in.sh is moved to /etc/default/.\n\nDo you have an idea of how we could get such packages included in the disto's? Who would do the work after each release? Do people see a benefit in having an apt-get install solr command available on e.g. Ubuntu? "
        },
        {
            "author": "Steve Davids",
            "id": "comment-15489470",
            "date": "2016-09-14T05:26:56+0000",
            "content": "Thanks, I just updated the repo to move solr.in.sh to /etc/default/. In an ideal world the current Lucene/Solr build system would be modernized a bit (LUCENE-5755) and would then allow you to build the RPM + DEB packages along with the ZIP and TAR files which would all be uploaded to the mirrors with a standard release. The nice thing with using a native package installer is that clients can easily uninstall the package if they don't want it and during upgrades old items are cleaned up and removed appropriately since all of the files are being tracked. I personally think it's just one less barrier to entry and much more natural than: `wget http://apache.claz.org/lucene/solr/6.2.0/solr-6.2.0-src.tgz && tar xzf solr-6.2.0.tgz solr-6.2.0/bin/install_solr_service.sh --strip-components=2`. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15489706",
            "date": "2016-09-14T07:43:19+0000",
            "content": "But if we support prm/deb formats, will we not also need to support upgrade of Solr in a more intelligent way, so search don't break after an upgrade due to deprecated APIs. Or would we publish solr5, solr6, solr7 etc, so that people would get automatic minor (compatible) upgrades, but need to do a manual install for the next major version? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16051556",
            "date": "2017-06-16T08:03:37+0000",
            "content": "Closing this long running issue, since the Reference Guide now contains instructions about taking solr to production, and we have linux install script that works.\n\nIf anyone want to explore PRM, DEB packaging, please open a new targeted JIRA for it. "
        }
    ]
}