{
    "id": "SOLR-11054",
    "title": "Add SoftAutoCommitTest.testSoftAndHardCommitMaxDocs",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "SoftAutoCommitTest should have a testSoftAndHardCommitMaxDocs that checks the maxDocs option for autocommit using the same monitor polling used by other existing SoftAutoCommitTest tests.",
    "attachments": {
        "SOLR-11054.patch": "https://issues.apache.org/jira/secure/attachment/12876923/SOLR-11054.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-12T19:02:27+0000",
            "content": "Here's a patch that i think would work well for this.\n\nit covers that basics of asserting via the monitor that the each type of commit is fired no sooner then expected, and that no extra commits are fired, and doesn't get bogged down in any assumptions about the searcher ",
            "author": "Hoss Man",
            "id": "comment-16084508"
        },
        {
            "date": "2017-07-13T18:58:07+0000",
            "content": "we should hold off on committing this until we're confident in (the latest) changes commited in SOLR-10109.\n\n(the changes in these 2 jiras are largely unrelated, but since it's the same test class and the same core is re-used by all test methods, we should be cautious about how commits/docs leaking between the tests might cause confusing &  hard to reproduce failures on slow jenkins boxes) ",
            "author": "Hoss Man",
            "id": "comment-16086229"
        },
        {
            "date": "2017-08-11T07:22:39+0000",
            "content": "We will replace AutoCommitTest.testMaxDocs() with this, so I think we should assert that all docs from 0 -> softCommitMaxDocs must be searchable. The rest looks very good to me. ",
            "author": "Cao Manh Dat",
            "id": "comment-16122963"
        },
        {
            "date": "2017-08-11T17:24:07+0000",
            "content": "We will replace AutoCommitTest.testMaxDocs() with this, so I think we should assert that all docs from 0 -> softCommitMaxDocs must be searchable. The rest looks very good to me.\n\nCao Manh Dat:\n\n\n\tyour patch seems to have re-arranged SoftAutoCommitTest, moving the testSoftAndHardCommitMaxDocs method i added in my early patch, making it hard to compare your patch with mine to understand what changes you are suggesting (ie: I applied my patch to one checkout, and your patch to a diff checkout, and tried to diff them and the results showed that the method moved completely so individual changes inside the method weren't obvious) ... so it's not clear to me at first glance how you suggest we \"assert that all docs from 0 -> softCommitMaxDocs must be searchable\"\n\tI think, in general, given how flakey and timing sensitive these autocommit tests can be, that we should focus on making incremental small changes and letting them soak on jenkins for several weeks – hence the reason i created individual sub-tasks (like this one) of SOLR-11053.\n\tIf you think that there are (purely additive) additional assertions/improvements that can/should be made to my proposed SoftAutoCommitTest.testSoftAndHardCommitMaxDocs, i would suggest splitting your additional assertions out into a new sub-task, and committing my earlier patch first – following up with your additions later – to help isolate them if there are any potential timing issues on jenkins machines (and make it simple to review & comment on your suggested improvements in isolation)\n\tmy chief concern being that the additional \"all docs ... must be searchable\" assertions you are suggesting may be just as problematic in SoftAutoCommitTest as AutoCommitTest is currently.  (as i mentioned: the motivation of these individual subtasks for SOLR-11053 is to focus on small, discrete, self contained, improvements – and then in the parent issue ultimately ask the question: \"have we duplicated the (viable) code coverage to the point we can remove AutoCommitTest?\"\n\n ",
            "author": "Hoss Man",
            "id": "comment-16123674"
        },
        {
            "date": "2017-08-12T01:26:42+0000",
            "content": "So in AutoCommitTest.testMaxDocs() we actually test for one more thing. All indexed docs are searchable, therefore my opinion for testSoftAndHardCommitMaxDocs() is we also should add this check. But sure, we can commit your patch first then adding necessary changes later. ",
            "author": "Cao Manh Dat",
            "id": "comment-16124387"
        },
        {
            "date": "2017-08-12T01:38:06+0000",
            "content": "Commit a7bb00ab54f36ea43b9d92e94c34e617127cb44c in lucene-solr's branch refs/heads/master from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a7bb00a ]\n\nSOLR-11054: Add SoftAutoCommitTest.testSoftAndHardCommitMaxDocs ",
            "author": "ASF subversion and git services",
            "id": "comment-16124395"
        },
        {
            "date": "2017-08-12T05:52:54+0000",
            "content": "So in AutoCommitTest.testMaxDocs() we actually test for one more thing. All indexed docs are searchable, therefore my opinion for testSoftAndHardCommitMaxDocs() is we also should add this check. ...\n\nOk – but the key questions then are:\n\n\n\tshould we really be testing searchability in these tests? the point of the test isn't really to test anything about searchers/searching, it's about testing autocommit – all that should matter is if the commits actually happen.\n\tif we're going to include searchability in these tests, then how do we do it robustly w/o getting false failures? ... if you look at the unreliable failures from AutoCommitTest, most of them come from asserts that attempt to verify correct behaviour by executing a \"search\" against the docs that it expects to have been autocommitted – we shouldn't just copy that test logic as is from AutoCommitTest to SoftAutoCommitTest.\n\n\n\n...hence my question asking for clarification/illumination as to how you suggested we should \"assert that all docs from 0 -> softCommitMaxDocs must be searchable\" – in a reliable way and my suggestion that we do it in a new (sibling) sub-task so the change can be tracked/assessed independently.\n ",
            "author": "Hoss Man",
            "id": "comment-16124478"
        },
        {
            "date": "2017-08-12T06:54:46+0000",
            "content": "According to my understanding about AutoCommitTest and SoftAutoCommitTest, the source of AutoCommitTest failure belong to its NewSearcherListener, SoftAutoCommitTest with better listener won't meet the same problem. Therefore we can include searchability in the test in a reliable way.\n\nYou're right about whether we should adding searchability in our test or not. Yes we don't have to. But from my point of view, we will feel much confident when remove AutoCommitTest.testMaxDocs() if testSoftAndHardCommitMaxDocs() test the same thing, right? ",
            "author": "Cao Manh Dat",
            "id": "comment-16124489"
        },
        {
            "date": "2017-08-21T08:32:07+0000",
            "content": "Commit fdbb810d78ad39a87df16cf28d606fe1e514d1b8 in lucene-solr's branch refs/heads/branch_7x from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=fdbb810 ]\n\nSOLR-11054: Add SoftAutoCommitTest.testSoftAndHardCommitMaxDocs ",
            "author": "ASF subversion and git services",
            "id": "comment-16134882"
        },
        {
            "date": "2017-08-21T08:36:36+0000",
            "content": "Commit 04956b8a9075e15b4d633d254e035b781694da1e in lucene-solr's branch refs/heads/master from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=04956b8 ]\n\nSOLR-11054: In SoftAutoCommitTest.testSoftAndHardCommitMaxDocs() all indexed docs must be searchable ",
            "author": "ASF subversion and git services",
            "id": "comment-16134884"
        },
        {
            "date": "2017-09-01T03:46:44+0000",
            "content": "Commit ea76351419095e156b8adc78de6dfd1e35094ee2 in lucene-solr's branch refs/heads/master from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ea76351 ]\n\nSOLR-11054: Revert the last commit since we found a test failure ",
            "author": "ASF subversion and git services",
            "id": "comment-16149995"
        },
        {
            "date": "2017-09-01T03:48:00+0000",
            "content": "The test failure for commit 04956b8a9075e15b4d633d254e035b781694da1e can be found at http://jenkins.sarowe.net/job/Lucene-Solr-tests-master/12726/consoleText.  ",
            "author": "Cao Manh Dat",
            "id": "comment-16149996"
        }
    ]
}