{
    "id": "SOLR-12786",
    "title": "Upgrade refGuide build to Asciidoctor 1.5.7 and new link structure",
    "details": {
        "type": "Improvement",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [
            "Build",
            "documentation"
        ],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "master (8.0)"
    },
    "description": "Currently the refguide build requires asciidoctor 1.5.6.2.\n\nPeople using gem install jekyll-asciidoc will end up with version 1.5.7, causing different header ID syntax and the build will break.\n\nLong term we should move to latest asciidoctor.\n\nIt is already documented in README how to install the older 1.5.6.2 version.",
    "attachments": {
        "SOLR-12786.patch": "https://issues.apache.org/jira/secure/attachment/12940583/SOLR-12786.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16621951",
            "content": "Patch attached ",
            "author": "Jan Høydahl",
            "date": "2018-09-20T12:45:09+0000"
        },
        {
            "id": "comment-16622115",
            "content": "Before you commit this, can you please tell me the version of Asciidoctor that you are using? This looks very similar to a problem I saw using Asciidoctor 1.5.7 and higher, which changed the way section IDs are created automatically.\n\nIn May I changed the solr-ref-guide/REAMDE.txt to provide instructions to force the installation of Asciidoctor 1.5.6.2 instead of 1.5.7. The latter version will be installed by default if you only install the jekyll-asciidoctor gem. (See https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=7bb3e5c2482c7b73ed2dd26ff4be4613e7f44872)\n\nThe problem with this patch is that everyone will need to be on v1.5.7 after these changes in your patch. Anyone with an earlier Asciidoctor version will get errors because the way the section IDs are created will be incorrect for them. We have no way to enforce this version with build scripts, so I thought it was simpler to stay on an earlier version for the time being.\n\nSee also this discussion with the Asciidoctor team: http://discuss.asciidoctor.org/Force-Asciidoctor-version-when-installed-as-a-jekyll-asciidoc-dependency-td6338.html ",
            "author": "Cassandra Targett",
            "date": "2018-09-20T14:16:19+0000"
        },
        {
            "id": "comment-16622124",
            "content": "Yep, you're right. I'm on Asciidoctor 1.5.7.1. I tried to find that version requirement, but could not.\nIs there no way to configure the rules for translating headers to ID's either?\nAnyway - I won't commit this now. But perhaps we can consider to standardise on the new version at some point? ",
            "author": "Jan Høydahl",
            "date": "2018-09-20T14:25:01+0000"
        },
        {
            "id": "comment-16622143",
            "content": "Yes, we need to move up at some point. Ideas on how to enforce/check for the Asciidoctor version are welcome.\n\nFrom the discuss.asciidoctor.org thread I pointed to, the 2nd variation of the problem is the one that will cause us some ongoing issues - if you look at a page like format-of-solr.adoc, the change makes it somewhat non-intuitive on how links are constructed. AFIAK, the only way to force a link format is to manually put anchors on every section, which I strive to avoid because it complicates making correct links in other ways. \n\nOverall, I'm sorry about this; I thought I'd filed an issue about the version requirement, but see from the commit I did not. That time period in May was very hectic for me, so after spending a couple hours figuring out what was wrong and then deciding what to do about it, I probably  then had to move on to something else and subsequently forgot about filing an issue. ",
            "author": "Cassandra Targett",
            "date": "2018-09-20T14:35:54+0000"
        },
        {
            "id": "comment-16622459",
            "content": "From updated issue description:\n\nShort term we can document how to install jekyll-asciidoc with the exact version needed:\n\n?? I mentioned earlier that I added this already to the README.txt in the solr/solr-ref-guide directory, which is where we've declared everything else required to build the Ref Guide. ",
            "author": "Cassandra Targett",
            "date": "2018-09-20T18:17:09+0000"
        },
        {
            "id": "comment-16622655",
            "content": "That's right, I changed the description. ",
            "author": "Jan Høydahl",
            "date": "2018-09-20T20:17:48+0000"
        },
        {
            "id": "comment-16681694",
            "content": "I don't see I mentioned it before, but we would also need to make sure the asciidoctor-ant version we're using is also updated to Asciidoctor 1.5.7 before we can update the jekyll-asciidoc gem. The latest release of asciidoctor-ant includes only Asciidoctor 1.5.6.2. ",
            "author": "Cassandra Targett",
            "date": "2018-11-09T16:50:08+0000"
        }
    ]
}