{
    "id": "SOLR-6143",
    "title": "Bad facet counts from CollapsingQParserPlugin",
    "details": {
        "affect_versions": "4.8.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "query parsers"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "I'm noticing a very weird bug using the CollapsingQParserPlugin. We tried to use this plugin when we realized that faceting on the groups would take a ridiculous amount of time. To its credit, it works very quickly, however the facet counts that it gives are incorrect. \n\nWe have a smallish index of about 200k documents with about with about 50k distinct groups within it. \n\nWhen we use the group implementation (&group=true&group.field=PrSKU&group.facet=true) which I believe this attempts to emulate, the facet counts are totally correct. \n\nWhen we use the field collapsing implementation, it will show an incorrect count for the non-filtered query, but when we go to the filtered query, the facet count corrects itself and matches the document count. \n\nHere are some SOLR responses:\n\nsolrslave01:8983/index/select?q=classIDs:12&fl=PrSKU&fq=\n{!collapse%20field=PrSKU}&facet=true&facet.field=at_12_wood_tone\n\nThe facet field will return \n\n<int name=\"Dark Wood\">867</int>\n<int name=\"Medium Wood\">441</int>\n<int name=\"Light Wood\">253</int>\n\nWhen I actually apply a filter query like so:\n\nsolrslave01:8983/index/select?q=classIDs:12&fl=PrSKU&fq={!collapse%20field=PrSKU}\n&facet=true&facet.field=at_12_wood_tone&fq=at_12_wood_tone:%22Light%20Wood%22\n\nI actually pull back 270 results and the facet updates itself with the correct number at the bottom\n\n<int name=\"Light Wood\">270</int>\n<int name=\"Dark Wood\">68</int>\n<int name=\"Medium Wood\">66</int>\n\nIf this were the same number pre and post filter query I would assume that it was simply my data that was bad, however I've pored over this for the better part of a day and I'm pretty sure it's the plugin. For reference, this field that I'm faceting on is a multiValued field, however I have noticed the exact same behavior on non multiValued fields (such as price). \n\nI can provide any other details you might need",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Joel Bernstein",
            "id": "comment-14020051",
            "date": "2014-06-06T17:03:39+0000",
            "content": "Let's move this discussion to the users list. I'll provide my answer here and close out the ticket unless a bug comes up during the discussion on the list. I'll repost this to users list also.\n\nThe CollapsingQParserPlugin should give you the same facet counts as group.truncate.\n\nYou're using group.facets, which the CollapsingQParserplugin doesn't yet support. I think this would be an excellent feature, so we could make a jira ticket to add this feature.\n\n\n "
        },
        {
            "author": "Rebecca Tang",
            "id": "comment-14343576",
            "date": "2015-03-02T19:00:29+0000",
            "content": "Did anyone log an enhancement bug for the CollapsingQParserPlugin to support group.facets?  Please let me know.  If not, I would like to log an enhancement bug. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-14593669",
            "date": "2015-06-19T17:27:50+0000",
            "content": "Hello Rebecca Tang, I'd say go ahead and log the enhancement request.  Ideally maybe with some sample data and specific example URLs, maybe even examples showing the old vs. new facet counts, etc.\n\nI had wondered about this topic last week, and then this week I'm chatting about it with a customer, so I think there's an appetite for it. "
        }
    ]
}