{
    "id": "SOLR-6082",
    "title": "Umbrella JIRA for Admin UI and SolrCloud.",
    "details": {
        "affect_versions": "4.9,                                            6.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It would be very helpful if the admin UI were more \"cloud friendly\". This is an umbrella JIRA so we can collect sub-tasks as necessary. I think there might be scattered JIRAs about this, let's link them in as we find them.\n\nStefan Matheis (steffkes) - I've taken the liberty of assigning it to you since you expressed some interest. Feel free to assign it back if you want...\n\nLet's imagine that a user has a cluster with no collections assigned and start from there.\n\nHere's a simple way to set this up. Basically you follow the reference guide tutorial but don't define a collection.\n1> completely delete the \"collection1\" directory from example\n2> cp -r example example2\n3> in example, execute \"java -DzkRun -jar start.jar\"\n4> in example2, execute \"java -Djetty.port=7574 -DzkHost=localhost:9983 -jar start.jar\"\n\nNow the \"cloud link\" appears. If you expand the tree view, you see the two live nodes. But, there's nothing in the graph view, no cores are selectable, etc.\n\nFirst problem (need to solve before any sub-jiras, so including it here): You have to push a configuration directory to ZK.\n\n[~thetapi] The last time Stefan and I started allowing files to be written to Solr from the UI it was...unfortunate. I'm assuming that there's something similar here. That is, we shouldn't allow pushing the Solr config to ZooKeeper through the Admin UI, where they'd be distributed to all the solr nodes. Is that true? If this is a security issue, we can keep pushing the config dirs to ZK a manual step for now...\n\nOnce we determine how to get configurations up, we can work on the various sub-jiras.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14084985",
            "date": "2014-08-04T17:58:57+0000",
            "content": "I am working on this. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14259693",
            "date": "2014-12-28T18:25:55+0000",
            "content": "Shalin Shekhar Mangar Don't know whether this is getting much of your attention, but see SOLR-5507. Upayavira is working on moving the admin UI to AngularJS, coordinating the two efforts seems like A Good Thing....\n\nAn open question is how to prioritize this and the work on SOLR-5507. How/when should priority be given to reproducing the current admin UI which looks at things largely on the basis of individual nodes with SolrCloud bolted on as opposed to adding SolrCloud-centric features to the admin UI?\n\nRecording here for posterity, as always the people doing the work are the ones who get to choose. "
        },
        {
            "author": "Upayavira",
            "id": "comment-14556820",
            "date": "2015-05-22T20:59:11+0000",
            "content": "I've started thinking about a collections API panel. Here's what I have in mind:\n\nA list of collections down the left hand side. A list of nodes down the right hand side. Each of these lists is independently scrollable.\n\nAt the top of the collections box is a big  symbol, clicking on which allows us to create a new collection.\n\nClick on a collection, it will expand to show its shards. Click on a node, it will expand to show the shards/collections it hosts.\n\nYou can drag a shard from a collection over onto a node. You can drag a shard from one node to another (visually, it will leave the shard behind which will make it clear that you are cloning). \n\nThere's more to it than this, but this is the basic idea.\n\nThis should all be pretty straightforward. Ironically, the one thing I've got to work out now is how to work with the CSS, as, to-date I've always had the old UI to base my work upon \n\nI am deliberately not addressing configurations as a part of the above. I am working on the assumption that relevant configs are already in place. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15055064",
            "date": "2015-12-13T17:47:14+0000",
            "content": "SOLR-6082 is the only remaining JIRA lined to this one, and I'm working on closing that. Once that's resolved, I'll close this one.\n\nMeanwhile, I think this is pretty obsolete with the Angular JS work that Upayavira & co. have done.\n\nI think any additional work on the admin UI will make its way into new tickets.\n\nShalin Shekhar Mangar Don't really mean to steal this, if you want it back just grab it.. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-15055141",
            "date": "2015-12-13T20:57:48+0000",
            "content": "It's all yours, Erick. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15488043",
            "date": "2016-09-13T18:43:55+0000",
            "content": "Erick Erickson, You said in December you were waiting to finish SOLR-6082 before resolving this one, but this one is SOLR-6082, so I wonder if you really meant SOLR-6083 (which is relatively recently closed)?\n\nThe only other issue open that's linked to this one is SOLR-5128, but that's a rather large issue on its own. One could keep an \"umbrella\" issue open forever, but it feels to me like this one has served its purpose for now. WDYT? "
        },
        {
            "author": "Upayavira",
            "id": "comment-15488077",
            "date": "2016-09-13T18:56:24+0000",
            "content": "This ticket has served its purpose. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15488451",
            "date": "2016-09-13T21:17:00+0000",
            "content": "Upayavira was driving this bus, so if he closed it that's \"the final word\"  "
        },
        {
            "author": "Mikhail Khludnev",
            "id": "comment-15503324",
            "date": "2016-09-19T12:44:17+0000",
            "content": "Just a note: if zookeeper is unavailable new ui freezes for a long time and then respond with placehoders. Old UI is musch responsive in such disaster.  "
        },
        {
            "author": "Upayavira",
            "id": "comment-15503407",
            "date": "2016-09-19T12:50:24+0000",
            "content": "Mikhail Khludnev please create a separate ticket. The two UIs should be using the same back-end so should exhibit the same behaviour. "
        },
        {
            "author": "Mikhail Khludnev",
            "id": "comment-15507358",
            "date": "2016-09-20T18:31:10+0000",
            "content": "sure! SOLR-9539 "
        }
    ]
}