{
    "id": "SOLR-9196",
    "title": "Dead link on SolrConfigXml wiki page",
    "details": {
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Trivial"
    },
    "description": "Under the headline http://wiki.apache.org/solr/SolrConfigXml#lib the link to the example solrconfig.xml at https://svn.apache.org/repos/asf/lucene/dev/trunk/solr/example/solr/collection1/conf/solrconfig.xml is a 404\n\nShould perhaps point to https://raw.githubusercontent.com/apache/lucene-solr/master/solr/example/files/conf/solrconfig.xml instead?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-08T10:21:45+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "I've fixed the link you've mentioned and another one pointing to the very same broken destination - it's currently persisting, which takes quite some time. just so you're not wondering why the change itself might not yet be visible.\n\nSince the Solr Wiki is maintained by the Community, you can always get an account and help improve the documentation on your own Steen Manniche - if you like to do so, drop a short note on the mailing list requesting access as wiki contributor. ",
            "id": "comment-15320340"
        },
        {
            "date": "2016-06-08T12:57:42+0000",
            "author": "Jan Høydahl",
            "content": "Should we not delete the contents of the page and instead put a link to https://cwiki.apache.org/confluence/display/solr/Configuring+solrconfig.xml\nIf there is crucial info in wiki that is not present in refGuide, we should update refGuide first? ",
            "id": "comment-15320496"
        },
        {
            "date": "2016-06-08T13:02:43+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "Excellent Point Jan, didn't think about that before applying the change. At least put a large banner on top of the page as we did on other pages as well, in case we're not entirely sure that all relevant content got already moved into the ref guide - until we're done with that migration. ",
            "id": "comment-15320505"
        },
        {
            "date": "2016-06-08T14:02:53+0000",
            "author": "Cassandra Targett",
            "content": "There is already some template language and some discussion about what to do here in the INTERNAL pages of the Solr Ref Guide: https://cwiki.apache.org/confluence/display/solr/Internal+-+Maintaining+Documentation#Internal-MaintainingDocumentation-Migrating\"Official\"DocumentationfromMoinMoin\n\nIMO, we should update pages as we come across them. There are many cases where the content in the old wiki is completely replaced/superseded by the current Solr Ref Guide, and those can just be updated without a lot of additional discussion. It would be nice if we could do a band-aid style migration of everything, but at this point the reality is that no one is volunteering to do that so there's no point in waiting. ",
            "id": "comment-15320596"
        }
    ]
}