{
    "id": "SOLR-3931",
    "title": "Turn off coord() factor for scoring",
    "details": {
        "affect_versions": "4.0",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "We would like to remove coordination factor from scoring.\n\nFOr small fields (like name of doctor), we want to not score higher if the same term is in the field more than once. Makes sense for books, not so much for formal names.\n\n/solr/select?q=:&coordFactor=false\n\nDefault is true.\n\n(Note: we might want to make each of these optional - tf, idf, coord, queryNorm\n\ncoord(q,d) is a score factor based on how many of the query terms are found in the specified document. Typically, a document that contains more of the query's terms will receive a higher score than another document with fewer query terms. This is a search time factor computed in coord(q,d) by the Similarity in effect at search time.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Joel Nothman",
            "id": "comment-13492300",
            "date": "2012-11-07T12:41:02+0000",
            "content": "Version 4.0.0 allows the specification of a custom similarity factory for each field in schema.xml (see SOLR-2338; it seems documentation is a bit lacking). So these options are not per-query, but per-core.\n\nIt would be possible to copy or patch Lucene's DefaultSimilarity and Solr's DefaultSimilarityFactory to take useCoord and useQueryNorm parameters. "
        },
        {
            "author": "Ivan Provalov",
            "id": "comment-14938785",
            "date": "2015-09-30T20:17:57+0000",
            "content": "Ideally, I would like to plug in a similarity class at search time, given the norm encoding is compatible across the index time and search time.  Right now, this requires a lot of custom extensions. "
        }
    ]
}