{
    "id": "SOLR-2618",
    "title": "Indexing and search on more then one type (Mapping)",
    "details": {
        "affect_versions": "3.2",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It would be very beneficial for a project that I am currently working on to have the ability to index and search on various subclasses of an object and map the objects directly to the actual domain-object. This functionality exist in Hibernate search for instance. Is this something that future releases have in mind? I would think that this is something that will make the value of Solr more efficient to a lot of users. \n\nWe are testing SolrJ 3.2 with the use of the SolrJ client and the web interface to index change and search. It should be possible to make a solution that map against a special type field(like <field name=\"classtype\" type=\"class\">) in schemas.xml that are indexed every time and use reflection against the actual class?\n\n\n\tMonica",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13055041",
            "date": "2011-06-26T09:56:19+0000",
            "content": "You might want to talk to Chris Male who held a talk about improving SolrJ for interacting with domain objects at Berlin Buzzwords: http://berlinbuzzwords.de/sites/berlinbuzzwords.de/files/IntegratingSolrJEEApplications.pdf\n\nI think your idea about storing a class name with the document and using reflection to pick the right domain object is interesting.. "
        },
        {
            "author": "Monica Storfjord",
            "id": "comment-13056338",
            "date": "2011-06-28T06:35:43+0000",
            "content": "Thank you for the link. It was an interesting article. \n\n\n\tMonica\n\n "
        }
    ]
}