{
    "id": "SOLR-10893",
    "title": "SolrClients used by streaming should support setting max connections",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Not A Problem",
        "status": "Closed"
    },
    "description": "All the streaming expressions , SQL queries use a common SolrClientCache for issuing the underlying queries. \n\nToday we use a default HttpClient while creating this which means if we running many parallel stream queries or deeply nested queries we can exhaust this.\n\nWe should allow users to set higher defaults for max connections, max connections per route etc.\n\nToday since we use a default HttpClient does Streaming work with auth enabled or in kerberos mode? I'll look into this and confirm.\n\nMy idea is we could probably refactor in a way that CoreContainer keeps an object of SolrClientCache which uses the httpclient that is currently used for searches ( HttpShardHandlerFactory ) . This means we don't need to introduce more settings . \n\nThoughts? Do we want to keep search threads and streaming threads part of separate pools?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-15T15:14:48+0000",
            "content": "Thoughts? Do we want to keep search threads and streaming threads part of separate pools?\n\nI am currently inclined to use the same httpclient that is used in the HttpShardHandlerFactory. \n\nEven if we have separate thread pools for httpShardHandlerFactory and streaming , a user cannot limit parallel analytic queries by reducing the thread pool as they all come from the same jetty thread pool? Maybe it would be part of SOLR-7344 or can be separate after that issue get's committed? ",
            "author": "Varun Thacker",
            "id": "comment-16050602"
        },
        {
            "date": "2017-07-13T18:24:22+0000",
            "content": "I'm going to start working on this again. Currently more inclined to keep it part of a separate thread pool . That way we in the future when we have different jetty thread pools we can make use of it   ",
            "author": "Varun Thacker",
            "id": "comment-16086153"
        },
        {
            "date": "2017-07-20T23:20:27+0000",
            "content": "In 7.0 and master when we create a HttpSolrClient and CloudSolrClient without providing a default httpclient both max connections and max connections per host is set to 10k . This was not the case in the 6.x line of code though. ",
            "author": "Varun Thacker",
            "id": "comment-16095543"
        }
    ]
}