{
    "id": "SOLR-1570",
    "title": "Complain loudly if uniqueKey field is definied but not stored=true,multiValued=false",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.5",
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When loading a new schema, Solr should log some \"SEVERE\" warnings if the schema uses a uniqueKey field, but that field/type don't match the expected needs of unieuqKey field for most functionality to work (stored=true, multiValued=false) ... that way people won't (have any reason to) be suprised when things break later)",
    "attachments": {
        "SOLR-1570.patch": "https://issues.apache.org/jira/secure/attachment/12425330/SOLR-1570.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12779079",
            "date": "2009-11-17T19:40:21+0000",
            "content": "recent example of confusion...\n\nhttp://old.nabble.com/java.lang.NullPointerException-at-org.apache.solr.handler.component.QueryComponent.mergeIds%28QueryComponent.java%3A421%29-to26392614.html "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12779678",
            "date": "2009-11-18T21:32:48+0000",
            "content": "Please do not require indexed=true. There are use cases where it is fine to have search terms that find a document, but searching by the ID is not needed. If there are a huge number of documents and only a few search terms per document, indexing the ID is a noticeable addition to the index file size.\n\n(These are situations where deduplication is not necessary.) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12779699",
            "date": "2009-11-18T22:34:21+0000",
            "content": "Lance: i wasn't suggesting that we required unieuqKey to be indexed, and shalin's patch doesn't do this ... my concern is merely that we log a an error – if you know what you're doing and want to ignore that erorr then that's totally your choice.\n\nI'm curious however: the only purpose for having a uniqueKey field in solr is the deduping and delete by id ... if you don't make your uniqueKey field indexed, then neither of those things are possible, so why bother using the <uniqueKey> declaration at all? ... you can still have an 'id\" field without using  <uniqueKey>, so maybe we should require uniqueKey to be indexed?\n\nShalin: your patch looks good to me, except that it doesn't warn about the indexed=false case. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12779887",
            "date": "2009-11-19T09:01:25+0000",
            "content": "Shalin: your patch looks good to me, except that it doesn't warn about the indexed=false case.\n\nThe getIndexedField method already does this but it throws an exception instead of logging a warning. Should we change that and allow un-indexed uniqueKeys (at least highlighting can still work)? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12780135",
            "date": "2009-11-19T16:33:25+0000",
            "content": "The getIndexedField method already does this but it throws an exception instead of logging a warning.\n\nOH ... right, missed that.\n\nShould we change that and allow un-indexed uniqueKeys (at least highlighting can still work)?\n\nI don't understand – highlighting should work fine if you don't declare a uniqueKey (it just requires you to match up the highlighting sections by position instead of by key) so if we've already been requiring that uniqueKey be indexed i'm cool with leaving it that way.\n\nstill interested in Lance's use cases though (ie: what advantage there is in declaring a field the unqiqueKey even if you aren't going to delete/update it that can't be gained just by having aa regular stored field named \"id\" or soemthing) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12780136",
            "date": "2009-11-19T16:34:41+0000",
            "content": "And FWIW: even if Lance has a really compelling reason, i think we should just commit this patch, resolve this issue, and open a new issue to make indexed=false ok since it's significantly different from this one "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12780838",
            "date": "2009-11-20T23:51:02+0000",
            "content": "the only purpose for having a uniqueKey field in solr is the deduping and delete by id\n\nThere's a third reason: integration with other data stores with a common id. The use case is to search by terms, get ids back, and do joins against another database. Some of these systems have very large data volumes and want to minimise indexing time and disk size. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12780875",
            "date": "2009-11-21T01:49:40+0000",
            "content": "There's a third reason: integration with other data stores with a common id.\n\nI dont' understand ... what you're describing makes total sense for why you want to put those ids into some \"myExternalId\" field in solr (as a stored field), but do you have any reason to put \"<uniqueKey>myExternalId</uniqueKey>\" into your schema that doesn't already require \"myExternalId\" to be indexed ?\n\nyou can put ids into solr w/o telling it their are uniqueKeys and still use them for external purposes ... my point was that the only reason to tell solr about them is for deduing and delete by Id – both of which require that it be indexed. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12782599",
            "date": "2009-11-25T20:20:53+0000",
            "content": "And FWIW: even if Lance has a really compelling reason, i think we should just commit this patch, resolve this issue, and open a new issue to make indexed=false ok since it's significantly different from this one\n\nOK, I'll commit this soon. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12782614",
            "date": "2009-11-25T20:48:57+0000",
            "content": "Committed revision 884263.\n\nThanks! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872699",
            "date": "2010-05-27T23:14:58+0000",
            "content": "\nCorrecting Fix Version based on CHANGES.txt, see this thread for more details...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013222",
            "date": "2011-03-30T15:45:54+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}