{
    "id": "SOLR-1571",
    "title": "unicode collation support",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.5",
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "This patch adds support for unicode collation (searching and sorting).\nUnicode collation is helpful in a search engine, for many languages you want things to match or sort differently.\nYou might even want to use copyfield and support different sort orders/matching schemes if you need to support multiple languages.\n\nThis is simply a factory for lucene's CollationKeyFilter, which indexes binary collation keys in a special format that preserves binary sort order.\n\nI've added support for creating a Collator in two ways:\n\n\tsystem collator from a Locale spec (language + country + variant)\n\ttailored collator from custom rules in a text file\n\n\n\nin no way is there an option to use the \"default\" locale of the jvm, (I consider this a bit dangerous)\nin this patch, it is mandatory to define the locale explicitly for a system collator.\n\nThe required lucene-collation-2.9.1.jar is only 12KB.",
    "attachments": {
        "SOLR-1571.patch": "https://issues.apache.org/jira/secure/attachment/12425307/SOLR-1571.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-12779317",
            "date": "2009-11-18T06:00:27+0000",
            "content": "initial patch. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12781053",
            "date": "2009-11-21T21:06:46+0000",
            "content": "Hi, i wonder if anyone has any comments on this.\n\nI know this is an invisible/covert JIRA issue right now \n\nespecially I am curious if the approach is sound, particularly regarding using the ICUCollationFilter instead.\nIn my opinion, this should be a separate integration, even though it will index at a significantly faster speed with much smaller keys.\nThe reason is that it is not compat with the JDK collation keys, and has different properties, such as the fact Collator is thread-safe in the JDK, but not thread-safe in ICU.\nBecause of this, I decided to stick with the JDK impl initially. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12783448",
            "date": "2009-11-29T18:54:07+0000",
            "content": "I tried the patch. All tests pass.\n\nYou know more about this topic than I do so if you feel ICUCollationFilter should be a separate issue, that is fine with me. As far as this patch is concerned, it is well baked and I'd be happy to commit it. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12783466",
            "date": "2009-11-29T20:17:48+0000",
            "content": "Shalin, yes I think the ICUCollationFilter is much better (faster and smaller index, more languages), but should be a separate factory imo. \nI figured I would start with the JDK impl. since there is no external dependency, its the simplest.\n\nThe icu impl has slightly different options and behavior, and doing something fancy like detecting which impl to use with reflection I don't much like either... if the ICU jar file was no longer in the classpath or its version changed, things could suddenly silently stop working correctly. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12783537",
            "date": "2009-11-30T05:02:54+0000",
            "content": "\nShalin, yes I think the ICUCollationFilter is much better (faster and smaller index, more languages), but should be a separate factory imo.\nI figured I would start with the JDK impl. since there is no external dependency, its the simplest.\n\nSure, sounds good. I'll commit this soon. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12783547",
            "date": "2009-11-30T06:09:19+0000",
            "content": "Committed revision 885338.\n\nThanks Robert! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872700",
            "date": "2010-05-27T23:15:25+0000",
            "content": "\nCorrecting Fix Version based on CHANGES.txt, see this thread for more details...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013029",
            "date": "2011-03-30T15:45:21+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}