{
    "id": "SOLR-5856",
    "title": "Add new Solr book to the Solr homepage",
    "details": {
        "affect_versions": "4.7",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A new Solr book (Solr in Action) has just been published by Manning publications (release date 3/15). I am providing the patch to update the website pages corresponding to the slideshow on https://lucene.apache.org/solr/ and https://lucene.apache.org/solr/books.html . The patch has updates to html/text files and there is a binary image file as well.",
    "attachments": {
        "SOLR-5856.patch": "https://issues.apache.org/jira/secure/attachment/12634350/SOLR-5856.patch",
        "book_sia.png": "https://issues.apache.org/jira/secure/attachment/12634351/book_sia.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Trey Grainger",
            "id": "comment-13932876",
            "date": "2014-03-13T05:13:10+0000",
            "content": "Patch attached. Uploading the image separately. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13932994",
            "date": "2014-03-13T08:28:00+0000",
            "content": "I am not sure the screen space was able to fit four books. Solr 3 book may need to go. But maybe the wiki maintainers have a trick, they did last time. "
        },
        {
            "author": "Trey Grainger",
            "id": "comment-13933162",
            "date": "2014-03-13T12:19:42+0000",
            "content": "Hi Alexandre,\n\nI agree with you. It looks like there are two Solr 3.x books, and the older one has already been previously \"cut\" from the rotating slideshow. At this point, I think the other 3.x book is going to have to be bumped. The good news is that those authors are working on a 4.x refresh that should be released in a few months, so they'll likely be back up there soon.\n\nOf course, all of the books are still on the books page, just not in the \"Latest books published about Apache Solr\" list in the header slideshow.\n\nThe patch I included makes bumps the 3x book and inserts Solr in Action. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13933559",
            "date": "2014-03-13T17:11:24+0000",
            "content": "Personally, i've never been a fan of the cover pics in the slideshow linking out directly to 3rd party sites – it was done that way initially before we actually had a books.html page when there was only 1 (2?) book(s).\n\nNow that we do have a books.html page, and are editing this slideshow & page again anyway, i think it would be best to make all of the images in the slideshow link to books.html.\n\nthoughts?\n\n\n(If i get my head above water on my current deliverables before i leave town on Saturday, I'll try to work on committing this) "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13933907",
            "date": "2014-03-13T19:08:59+0000",
            "content": "Now that we do have a books.html page, and are editing this slideshow & page again anyway, i think it would be best to make all of the images in the slideshow link to books.html.\n\n+1 Linking from the slideshow to external websites is not good, as the user generally expects that links in navigation areas like the slideshow stay on-site. "
        },
        {
            "author": "Trey Grainger",
            "id": "comment-13934381",
            "date": "2014-03-14T00:58:38+0000",
            "content": "That makes sense... I agree that is probably a better user experience to link to the books page. I'll update all of the slideshow links to point to the books page and resubmit the patch shortly. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13934389",
            "date": "2014-03-14T01:06:11+0000",
            "content": "I think the two+ clicks experience is not as good from SEO point of view. The users are much less likely to actually go get the books. Might as well get rid of slideshow and stick to making book page link more prominent on the page.\n\nNot saying it is wrong thing to do, just that there is a particular aspect of this to take into account. And - maybe - the SEO discussion is something that should be happening elsewhere. I, for one, would be happy to have at Solr's content Google Analytics analysis (if given access) and see what we can tell from it. "
        },
        {
            "author": "Trey Grainger",
            "id": "comment-13934520",
            "date": "2014-03-14T03:29:38+0000",
            "content": "This updated patch modifies the slideshow to link to the books.html page as opposed to going directly to the Publisher's page (as requested by Hoss and Uwe).\n\nIn order to make the site more consistent (since we're now making more than just the change to add Solr in Action), I also made the images for each of the books on the books.html page also clickable as a link to the publisher's page in order to increase the likelihood of a click-through. One of the books already did this, but it was missing on the others, and this is one of the things visitors are probably most likely to click on to try to get the book. "
        },
        {
            "author": "Trey Grainger",
            "id": "comment-13934528",
            "date": "2014-03-14T03:41:28+0000",
            "content": "@Alexandre,\nYeah, making the homepage links go to a secondary books page probably will detract from both SEO and sales, but it's a better user experience for those visiting the Solr homepage, no? One silver lining is that it makes the books page more prominent by still having the recent book pictures on the homepage linking over the books page, making it easier to find and compare each of the different books.\n\n@Hossman\nThanks for tentatively signing up to commit this. If you see anything else that needs changing, please let me know and I'd be happy to put together another patch. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13934530",
            "date": "2014-03-14T03:45:52+0000",
            "content": "I certainly agree that the book page does not get sufficient attention. I feel if we could just drive the beginners to the right book at the right time, at least some of the questions may be answered that way. Obviously, I am aware that many beginners do not want to buy books at all as well. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13939525",
            "date": "2014-03-18T17:44:47+0000",
            "content": "Commit 1578978 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1578978 ]\n\nSOLR-5856: Add \"Solr in Action\" book "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13939532",
            "date": "2014-03-18T17:48:17+0000",
            "content": "Commit 1578981 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1578981 ]\n\nSOLR-5856: Add \"Solr in Action\" book image "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13939545",
            "date": "2014-03-18T17:54:39+0000",
            "content": "Commit 1578986 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1578986 ]\n\nSOLR-5856: Linkify other book images "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13939563",
            "date": "2014-03-18T18:08:48+0000",
            "content": "Commit 1578991 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1578991 ]\n\nSOLR-5856: Add \"Solr In Action\" book to slide show; link book cover images to the books page instead of to the publishers' websites "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13939580",
            "date": "2014-03-18T18:20:30+0000",
            "content": "Commit 1578998 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1578998 ]\n\nSOLR-5856: Try to expand mantle area to include four books "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13939659",
            "date": "2014-03-18T19:04:38+0000",
            "content": "Trey, I've committed your changes, with one modification: I expanded the book slide to show four books, so that I didn't have to remove one of the ones that were already there.  I viewed the 4-book slide in IE, Chrome, Firefox and Safari, and it looks fine in all of them. "
        },
        {
            "author": "Trey Grainger",
            "id": "comment-13939836",
            "date": "2014-03-18T21:34:51+0000",
            "content": "Hi Steve - thanks so much for getting this committed so quickly! Everything\nlooks great, except for the 4 book layout in the slideshow doesn't render\nwell for me in Chrome on either Windows or a Mac (the fourth book wraps to\nthe next line). IE, Firefox, and Safari all looked good, though.\nhttps://www.dropbox.com/s/hkcz8xzxtgfvexw/4Books.png\n\nI'd guess other Chrome users are likely seeing the same thing.\n\n\n\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13939898",
            "date": "2014-03-18T22:30:02+0000",
            "content": "\n(the fourth book wraps to the next line) [...]\nhttps://www.dropbox.com/s/hkcz8xzxtgfvexw/4Books.png\nI'd guess other Chrome users are likely seeing the same thing.\n\nI saw the same overflow thing on the staging site, before I published to production, until I changed content/css/solr.css to shift the books to the left.\n\nTrey responded on the lucene-dev mailing list:\n\n\nA few minutes after I sent my e-mail the page started rendering correctly in Chrome on both my windows and mac computers, so either this was just fixed or there was some temporary weirdness (perhaps on my end). At any rate, it looks good for me now. Thanks!\n\nI'm guessing it was some form of caching of the changed CSS file? "
        }
    ]
}