{
    "id": "SOLR-3901",
    "title": "Highlighting: InvalidTokenOffsetsException: ReversedWildcardFilter",
    "details": {
        "affect_versions": "3.6",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Using Highlighting together with the ReversedWildcardFilter does not work in our case. We (sometimes) get InvalidTokenOffsetExceptions. Removing the ReversedWildcardFilterFactory from all analysis chains solves the problem.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ahmet Arslan",
            "id": "comment-13465037",
            "date": "2012-09-27T20:13:48+0000",
            "content": "I think this duplicate of https://issues.apache.org/jira/browse/SOLR-3193 ? "
        },
        {
            "author": "jerico",
            "id": "comment-13465051",
            "date": "2012-09-27T20:29:45+0000",
            "content": "I wasn't sure, as I get the error the first time I query and my field is indexed. Feel free to close as a duplicate. I can test again and (if necessary) re-open this bug if the problem does not go away with the fix for the other bug.\n\nQuestion: Why does this exception result in a complete failure of solr to return results? This seems too much. You could catch it and just not return highlighting info but leave the response otherwise intact. Then clients could deal gracefully with such an error and the impact of the bug would be much less grave. "
        },
        {
            "author": "Ahmet Arslan",
            "id": "comment-13465116",
            "date": "2012-09-27T21:27:36+0000",
            "content": "Description SOLR-3193 is misleading. After creating the ticket, I found that If solr.ReversedWildcardFilterFactory is removed, then exception does not occur. "
        },
        {
            "author": "Ken Fergus",
            "id": "comment-13652898",
            "date": "2013-05-09T12:16:18+0000",
            "content": "I've recently run into this issue using 3.6. Is there a fix for this version? There are currently no plans to upgrade to version 4. If there is a workaround, please let me know of one. Thanks. "
        },
        {
            "author": "Holger Floerke",
            "id": "comment-13653578",
            "date": "2013-05-10T06:00:59+0000",
            "content": "@Ken: In fact the problem still persists in version 4.x\n\nIs anybody able to have a look at this bug if I post testdata? "
        },
        {
            "author": "Ahmet Arslan",
            "id": "comment-13988825",
            "date": "2014-05-03T22:09:47+0000",
            "content": "Holger Floerke and jerico, do you have HTMLStripCharFilterFactory along with ReversedWildcardFilterFactory? Can you give exact field type?\n\nBy the way, failing test case in SOLR-3193 now passes with trunk. "
        },
        {
            "author": "Ahmet Arslan",
            "id": "comment-14014815",
            "date": "2014-05-31T21:00:17+0000",
            "content": "It looks like this is caused by a bug in OffsetLimitTokenFilter as reveled in  SOLR-5426 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14031056",
            "date": "2014-06-13T19:36:45+0000",
            "content": "resolving as a dup of SOLR-5426 which already has a test with patch "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-14031066",
            "date": "2014-06-13T19:40:56+0000",
            "content": "It looks like this is caused by a bug in OffsetLimitTokenFilter as reveled in SOLR-5426\n\nOffsetLimitTokenFilter is not the bug, it is the ReverseWildcardFilter not cleaning state in reset(). "
        }
    ]
}