{
    "id": "SOLR-1043",
    "title": "Issue while persisting sharedLib attribute in multicore solr.xml",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I executed a core admin command to dynamically create a new core in Solr with the persist flag set to true as mentioned here: http://wiki.apache.org/solr/CoreAdmin#head-7ca1b98a9df8b8ca0dcfbfc49940ed5ac98c4a08. \n\nThe core properties like name and instanceDir were persisted properly in the solr.xml. However, the relative path specified in the sharedLib attribute of the top level \"solr\" element got converted by its absolute path. This caused errors in loading the classes in the sharedLib when the server is subsequently restarted. Manually changing the sharedLib back to its relative path fixes this issue.",
    "attachments": {
        "SOLR-1043.patch": "https://issues.apache.org/jira/secure/attachment/12401195/SOLR-1043.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "karthik c",
            "id": "comment-12677777",
            "date": "2009-03-01T06:47:59+0000",
            "content": "Looks like the libDir variable  contains the value of the sharedLib attribute. However, this variable is getting reset to the full path of the sharedLib folder. The only place this variable is currently used is write the sharedLib attribute back into the solr.xml file. \n\nI have removed the line that resets this variable so that the value of sharedLib is retained as is. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12682694",
            "date": "2009-03-17T15:17:06+0000",
            "content": "Yeah, i wasn't sure what that line was doing in there either ... i removed it as part of SOLR-1072 "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775469",
            "date": "2009-11-10T15:50:35+0000",
            "content": "Bulk close Solr 1.4 issues "
        }
    ]
}