{
    "id": "SOLR-8627",
    "title": "Retrieve position ranking in json facets",
    "details": {
        "components": [
            "Facet Module"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "It would be fantastic to have the position (in terms of a specific stat or count) ranking in the json facets. Let's suppose we have the field \"client\" of type string and we make a facet to see the top 10 (limit:10, offset:0), so the first bucket will have the ranking 1, the second bucket will have the ranking 2, and so on. Now we ask for the top 10 starting from 10 (limit:10, offset:10) so the first bucket will have the ranking 11, the second one ranking 12, and so on. Until now, there is no big deal, you just sum the offset with the bucket position.\nBut what happens if I want to know the ranking of a specific client (or a list of them)? One possible way would be to ask for all clients (limit:-1), but it will have performance issues on fields with big cardinality.\n\nSo, I'm asking for an option that receives a list of terms and a stat, and returns the list of terms with their respective position (or ranking) that produce the query.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-02T22:27:10+0000",
            "author": "Yonik Seeley",
            "content": "Thanks for the idea Pablo, that does sound like an interesting feature... ",
            "id": "comment-15129189"
        },
        {
            "date": "2016-02-02T22:46:43+0000",
            "author": "Yonik Seeley",
            "content": "For an API, perhaps adding bucketVals and bucketPos parameters?\n\ntype:field,\nfield:customer,\n[...]\nbucketVals:[\"customer10\",\"customer345\",\"customer72\"],\nbucketPos:true  // returns the position of the bucket in the full list of buckets\n\n\n\nAnd in the response, each bucket could have a \"pos\" attribute if bucketPos==true (since bucketVals by itself can still be useful). ",
            "id": "comment-15129226"
        },
        {
            "date": "2016-02-03T12:26:41+0000",
            "author": "Pablo Anzorena",
            "content": "Yes, that's an excellent way of asking it.\n\nOne question, if bucketPos==false && bucketVals = [\"customer10\",\"customer345\",\"customer72\"], what is the behaviour? It brings you just those 3 customers? If that is the behaviour, isn't it the same as asking for a type:query (q:customer\"customer10\" \"customer345\" \"customer72\")) and then nest it with type:terms(field:customer) ?\n\nThe behaviour I think is the correct is: If you ask for a top 10 customers and also add bucketVals\ntype:terms,\nfield:customer,\nlimit:10,\n[...],\nbucketVals:[\"customer10\",\"customer345\",\"customer72\"]\n\nthen it will retrieve the top 10 customers and also these other 3 customers (if they don't belong to the top 10). Also if bucketPos == true, it will have the position of all of them.\n\nWhat do you think? ",
            "id": "comment-15130302"
        }
    ]
}