{
    "id": "SOLR-12381",
    "title": "facet query causes down replicas",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.6.1",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "Cluster description:\n\n\nI have a solr cluster with 3 nodes(node1, node2, node3).\n\nEach node has:\n30 GB memory.\n3 TB SATA Disk\n\nMy cluster involves 5 collections which contain more than a billion document.\n\nI have a collection(news_archive collection) which contain 30 million document. This collection is divided into 3 shards which each of them contains 10 million document and occupies 100GB on the Disk. Each of the shards has 3 replicas.\n\nEach of the cluster nodes contains one of the replicas of each shard. in fact, the nodes are similar, i.e:\n\nnode1 contains:\nshard1_replica1\nshard2_replica1\nshard3_replica1\nnode2 contains:\nshard1_replica2\nshard2_replica2\nshard3_replica2\nnode3 contains:\nshard1_replica3\nshard2_replica3\nshard3_replica3\n\nProblem description:\n\n\nwhen I run a heavy facet query, \nsuch as http://Node1IP:xxxx/solr/news_archive/select?q=*:*&fq=pubDate:[2018-1-18T12:06:57Z%20TO%202018-4-18T12:06:57Z]&facet.field=ngram_content&facet=true&facet.mincount=1&facet.limit=2000&rows=0&wt=json,\n the solr instances are killed by the OOM killer in almost all of the nodes.\nI found the bellow log in solr/logs/solr_oom_killer-xxxx-2018-05-21_19_17_41.log in each of the solr instances,\n\n\"Running OOM killer script for process 2766 for Solr on port xxxx\nKilled process 2766\"\n\n\nIt seems that the query is routed into different nodes of the clusters and with attention to exhaustively use of memory which is caused by the query the solr instances are killed by OOM Killer.\n\n \n\ndespite the fact that how the query is memory demanding, I think the cluster's nodes should be preserved from being killed by any read query.\n\nfor example by limiting the amount of memory which can be used by any query.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-21T17:43:55+0000",
            "content": "Max heap size should be set below oom_killer boundary, in this case Solr might have a chance to respond with OOME, and starting from 7.3 Solr survive after that. \nAnyway, for the sane regular cases the suggestion is to use docValues, but giving the name of the field, it's not an  option.  ",
            "author": "Mikhail Khludnev",
            "id": "comment-16482783"
        },
        {
            "date": "2018-05-23T16:26:40+0000",
            "content": "Thank you very much for your consideration.\n\ncould you please know what oom_killer boundary means?\n Would you mind providing some details how I can set SOLR_JAVA_M. As its suggested, I have set it a half of the physical memory(SOLR_JAVA_ME=\"-Xms512m -Xmx15240m\").\n\nIn addition, I wanted to know if my problem is a bug which won't be fixed in version 6. ",
            "author": "kiarash",
            "id": "comment-16487582"
        },
        {
            "date": "2018-05-24T13:32:51+0000",
            "content": "There are no generic answers regarding the required heap size.  It will depend on details of your specific installation.  It is usually impossible for anyone to tell you that number.  We can make guesses with very detailed information about your setup, but the only way to know if the guess is right is to try it.\n\nRecommendations like \"half of physical memory\" are often completely wrong.  The best value is a number that's as large as you need, and no larger.\n\nhttps://wiki.apache.org/solr/SolrPerformanceProblems#Java_Heap\n\nThe oom killer script included with Solr is designed to kill Solr when Java throws ANY OutOfMemoryException.  There are multiple resource types that can result in OOME errors, not just heap space.  The 'boundary' that was mentioned just refers to the amount of heap memory that Solr needs for YOUR installation.  It is not something configurable. ",
            "author": "Shawn Heisey",
            "id": "comment-16488989"
        },
        {
            "date": "2018-05-24T15:08:30+0000",
            "content": "ok. I haven't realized that it's Solr's oomkiller. So, it's just a dead end.  ",
            "author": "Mikhail Khludnev",
            "id": "comment-16489179"
        }
    ]
}