{
    "id": "SOLR-11704",
    "title": "sample_techproducts_configs is really out-of-date",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "examples"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "7.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Configs in sample_techproducts_configs seem to be very old.\n\n\ncd server/solr/configsets\ndiff _default/conf/managed-schema sample_techproducts_configs/conf/managed-schema | wc -l\n\n\n=>   744\n\nIt seems sample_techproducts_configs have been ignored for any kind of updates and it would be good to bring it up-to-date with the other configs otherwise it is very difficult to know what is different among the 2 and how to switch from one config to other (like after playing around with sample_techproducts_configs and then deciding to move to the actual one for production use-case)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-02-01T16:26:42+0000",
            "content": "It's not true that the techproducts example has been ignored, but it may still have issues. However, a diff between it and the _default configset doesn't illuminate what problems might exist because it's not meant to be a copy of the _default configset. The two examples have different use cases:\n\n\n\t_default is meant to be a bare-bones config and schema. Out of the box it only provides access to minimal features of Solr - you would need to customize it extensively according to your needs implementing Solr.\n\ttechproducts is meant to be a more robust example that is tailored to the documents in example/exampledocs, with many of Solr's features already configured out of the box.\n\n\n\nThe differences between these configsets are described in bin/solr help text, in the Ref Guide, in Solr's main README, and in the README contained in the example directory. I feel like we have tried hard to make it plain that they are different by intention.\n\nWithout more description of specific ways the techproducts example fails or is insufficient, there isn't much we can do here. ",
            "author": "Cassandra Targett",
            "id": "comment-16348849"
        }
    ]
}