{
    "id": "SOLR-3986",
    "title": "index version and generation not changed in admin UI after delete by query on master",
    "details": {
        "affect_versions": "4.0",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Here are the steps to reproduce this:\n\n\n\tfollow steps in Solr 4.0 tutorial to set up a master and a slave to use Java/HTTP replication\n\n\n\n\n\tindex example documents on master:\njava -jar post.jar *.xml\n\n\n\n\n\tmake a note of the index version and generation the on both the replication section of the summary screen of core collection1 and the replication screen on both the master and slave\n\n\n\n\n\trun a delete by query on the master\njava -Ddata=args -jar post.jar \"<delete><query>name:DDR</query></delete>\"\n\n\n\n\n\ton master reload the summary screen for core collection1.  The Num Docs field decreased but the index version and generation are unchanged in the replication section.  The index version and generation are also unchanged in the replication screen.\n\n\n\n\n\ton the slave, wait for replication to kick in or trigger it manually.  On the summary screen for core collection1, the Num DOcs field decreased to match what's on the master.  The index version and generation of the master remain unchanged but the index version and generation of the slave both changed.  The same goes for the index version and generation of the master and slave on the replication screen.\n\n\n\n\nThe replication handler on the master does report changed index version and generation:\n\nlocalhost:8983/solr/collection1/replication?command=indexversion\n\nIt is only the admin UI that reporting the older index version and generation on both the core summary screen and replication screen.\n\nThis only happens with delete by query.  There is no problem with delete with id or add.\n\nBoth the index version and generation do get updated on subsequent delete by query but both remain one cycle behind on the master.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Bill Au",
            "id": "comment-13483273",
            "date": "2012-10-24T14:32:34+0000",
            "content": "By the way, the request URL for the summary screen for core collection1:\n\nlocalhost:8983/solr/#/collection1\n\nthe request URL for the replication screen:\n\nlocalhost:8983/solr/#/collection1/replication "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13564421",
            "date": "2013-01-28T17:25:07+0000",
            "content": "Bill Au is the still valid? Even for 4.1 and maybe trunk as well? "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15388878",
            "date": "2016-07-22T04:16:05+0000",
            "content": "can this be closed? Old non-reproduced bug report against old UI in ancient version. "
        }
    ]
}