{
    "id": "SOLR-11656",
    "title": "TLOG replication doesn't work properly after rebalancing leaders.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "7.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "With TLOG replica type, the replication may stop after invoking rebalance leaders API.\nThis can be reproduced by following steps:\n\n\n\tCreate SolrCloud with TLOG replica type.\n\tSet perferredleader flag to some of no-leader nodes.\n\tInvoke rebalance leaders API.\n\tThe replication stops in nodes which were \"leader\" before rebalancing.\n\n\n\nBecause the leader node doesn't have the replication thread, we need to create it when the status is changed from \"leader\" to \"replica\". On the other hand, rebalance leaders API doesn't consider this matter, and the replication may stop if the status is changed from \"leader\" to \"replica\" by rebalance leaders.\n\nNote that, we can avoid this problem if we reload or restart Solr after rebalancing leaders.",
    "attachments": {
        "SOLR-11656.patch": "https://issues.apache.org/jira/secure/attachment/12898186/SOLR-11656.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-11-17T10:52:10+0000",
            "content": "Add code for restarting replication threads while rebalancing leaders. ",
            "author": "Yuki Yano",
            "id": "comment-16256830"
        },
        {
            "date": "2017-11-17T14:44:10+0000",
            "content": "I'll take a look over the weekend. Meanwhile I'd note that the whole REBALANCELEADER functionality is only there for extreme cases (i.e. 100+ of leaders happened to land on the same node). The additional burden of being a leader is pretty miminal, to the point of being hard to measure if there just a few leaders on a particular node.\n\nThis is still a bug, thanks for bringing it up and providing a patch. I'm just suggesting you may just be better off avoiding REBALANCELEADERS altogether, but then I don't know your setup so it may indeed be beneficial.\n ",
            "author": "Erick Erickson",
            "id": "comment-16257055"
        },
        {
            "date": "2017-12-28T01:22:57+0000",
            "content": "Now I'm wondering if there's some generic issue with replicas changing roles and coordinating with non NRT replica types?\n\nThese may not be related, but they seem like they're in the same ballpark. ",
            "author": "Erick Erickson",
            "id": "comment-16304974"
        },
        {
            "date": "2017-12-28T19:26:23+0000",
            "content": "Erick Erickson I have observed that, once a reload command is issued on a collection, all PULL replicas stop replicating. Thought this may be similar to the issue being discussed here. Check https://issues.apache.org/jira/browse/SOLR-11794 for more details. ",
            "author": "Samuel Tatipamula",
            "id": "comment-16305680"
        }
    ]
}