{
    "id": "SOLR-10692",
    "title": "Split Streaming Expressions docs into more manageable parts",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "fix_versions": [
            "6.6",
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The Streaming Expressions page is too big and a mix of How To and Reference materials. It should be split up a bit to make it easier to use.\n\nFirst pass at this will split all the expression types into new pages according to the type, so there will be 3 new sub-pages:\n\n\n\tStream Sources\n\tStream Decorators\n\tStream Evaluators\n\n\n\nOnce that's done, we'll see if there's more we can do with this.\n\nAttn Joel Bernstein.",
    "attachments": {
        "solr-10692.patch": "https://issues.apache.org/jira/secure/attachment/12868555/solr-10692.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-15T18:55:29+0000",
            "content": "+1\n\nI'll start reviewing the tickets around the new documentation so I can get the 6.6 Streaming Expressions documented.\n\nI'm not sure when you plan to release the 6.6 docs. The Streaming Expressions documentation may not finish in time for the official 6.6 docs release. But I think that's OK, as I think now the goal is really to work towards a much more manageable Streaming Expression documentation format. Once it's more manageable we can catch up and expand the scope to include more usage examples. I think the lack of usage examples right now makes it hard for people to understand how to use all the different functions. ",
            "author": "Joel Bernstein",
            "id": "comment-16011116"
        },
        {
            "date": "2017-05-17T16:40:07+0000",
            "content": "The attached patch pulls the details of each expression in the streaming-expressions.adoc into 3 new files, stream-sources.adoc, stream-decorators.adoc and stream-evaluators.adoc. It adds a short section linking the old Streaming Expressions page to these new files.\n\nIn order to allow the docs build to pass, every section must have a unique title or a unique anchor tag. This is to protect inter-document linking, particularly in the PDF where all pages get combined into one massive page. The net effect of this is that we can't have repeated sections like \"Parameters\" or \"Syntax\" - I could have added unique anchors to each one, but for ease of linking, I changed them to \"search Parameters\", \"commit Parameters\", \"search Syntax\", \"commit Syntax\", etc. for each expression.\n\nMy hope is that we can put in an alternate layout as described in my patch to SOLR-10612 with a TOC on the right side to make long pages like these will be easier to use.\n\nThere are also some minor changes to the glossary to make the docs build pass the unique title requirement. ",
            "author": "Cassandra Targett",
            "id": "comment-16014367"
        },
        {
            "date": "2017-05-19T18:18:48+0000",
            "content": "Hoss added some nice new flexibility for how and where to place a table of contents, so that solves one of my big issues with splitting the pages. I'll commit the splitting of the pages I did to master using those options & backport so you have stuff to work with. ",
            "author": "Cassandra Targett",
            "id": "comment-16017783"
        },
        {
            "date": "2017-05-19T19:35:33+0000",
            "content": "Commit bc89757acc696f4b001b6b79af43141647650d85 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=bc89757 ]\n\nSOLR-10692: Split streaming-expressions.adoc into 4 total files; fix section titles ",
            "author": "ASF subversion and git services",
            "id": "comment-16017898"
        },
        {
            "date": "2017-05-19T19:36:16+0000",
            "content": "Commit 86ae153d8465934abd4332c53e9777ea466fdc6e in lucene-solr's branch refs/heads/branch_6x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=86ae153 ]\n\nSOLR-10692: Split streaming-expressions.adoc into 4 total files; fix section titles ",
            "author": "ASF subversion and git services",
            "id": "comment-16017899"
        },
        {
            "date": "2017-05-19T19:36:36+0000",
            "content": "Commit aa60a78e540571c78e18c061f150620edc2e198c in lucene-solr's branch refs/heads/branch_6_6 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=aa60a78 ]\n\nSOLR-10692: Split streaming-expressions.adoc into 4 total files; fix section titles ",
            "author": "ASF subversion and git services",
            "id": "comment-16017901"
        },
        {
            "date": "2017-05-19T19:38:21+0000",
            "content": "I'm going to resolve this as I've committed changes to split the one big file up, and added the TOC options I wanted.\n\nYou should be able to see this tomorrow in the Ref Guide build: https://builds.apache.org/job/Solr-reference-guide-6.6/ (it currently only runs once a day). ",
            "author": "Cassandra Targett",
            "id": "comment-16017905"
        }
    ]
}