{
    "id": "SOLR-549",
    "title": "Enable configurable logging (jul or log4j)",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "java.util.logging does not allow to easily create a self-sufficient 'war' with respect to logging configuration.\nThe java.util.logging.LogManager used by the application is always created by the container and is thus only configurable through the container; furthermore, if one already uses say log4j in a webapp that embeds Solr, it does not even seem possible to re-route jul logging into log4j just by configuration.",
    "attachments": {
        "solr-log4j.patch": "https://issues.apache.org/jira/secure/attachment/12380769/solr-log4j.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Henri Biestro",
            "id": "comment-12591669",
            "date": "2008-04-23T16:04:46+0000",
            "content": "This patch allows to re-route jul logging to log4j if desired; this does not try to change the logging API - ie, the jul logging remains the choice- but gives the web application a chance to initialize logging a bit differently and become log4j firendly.\n\nIt introduces a 'org.apache.solr.logging' package from which jul loggers are obtained; instead of writing 'Logger log = java.util.logging.Logger.getLogger(\"blah\");' you write 'Logger log = org.apache.solr.logging.Logger(\"blah\");'. The default behavior is maintained and so are the dependencies.\n\nThe implementation classes that depend on log4j (1.2.15) are 'optionally' compiled so far by changing the build.xml 'compile-common' target dependency from 'compile-logging' to 'compile-logging-log4j'. More precisely if the 'org.apache.solr.logging.Configuration' class can be loaded , the framework will return anonymous j.u.l.Loggers having one handler that convert their LogRecords into log4j events, the log4j logger having the name of the intended j.u.l.Logger.\nThe code comments go through more details. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12591672",
            "date": "2008-04-23T16:20:21+0000",
            "content": "This solves the \"how do I use log4j in solr\" problem, but I think it sends solr down the wrong path.  I really don't think we want to deal with configuring the logging internally.  That is what the logging frameworks are supposed to do for us!\n\nRather then taking this approach, I think we should just use SLF4J (http://www.slf4j.org/), it does what this patch does, but it is supported elsewhere and has more options  "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12591680",
            "date": "2008-04-23T16:45:58+0000",
            "content": "I agree on all terms; it only solves the \"how do I use log4j in solr\" and as as such is definitely not as feature-full nor as generic as slf4j.\nI also agree that the logging configuration issue is not something that Solr can or should take care of; and I'm not suggesting that we try. I'm just seeking a way to open a door so logging is a choice that can be configured & packaged easily.\nThe only plus of the patch is that it avoids adding a hard library-dependency (whether on slf4j or log4j) which seemed to be one the blockers in past threads.\nIf this constraint is relaxed, let's by all means use slf4j and be done! "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12591998",
            "date": "2008-04-24T12:01:07+0000",
            "content": "Another way is to abstract away logging by using org.apache.commons as in SOLR-548. "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12592050",
            "date": "2008-04-24T13:13:19+0000",
            "content": "Added target 'dist-log4j' in build.xml to optionally compile the log4j adapter as a jar named 'apache-solr-log4j-1.3-dev'; if the jar in in the classpath, log4j enabled logging is loaded.\n\nThe target also copies the produced jar into the tests/lib and adds it to the tests classpath.\nNote that log4j.1.2.15.jar must be added in the lib directory. "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12614728",
            "date": "2008-07-18T13:49:23+0000",
            "content": "updated for current trunk;\nadded an 'update' method to Configuration to allow jul logging levels to be reflected into log4j loggers - should allow solr-554 to perform with minor modification "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12632244",
            "date": "2008-09-18T15:15:48+0000",
            "content": "resolved with  SOLR-560    "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775508",
            "date": "2009-11-10T15:51:42+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}