{
    "id": "SOLR-5970",
    "title": "Create collection API always has status 0",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The responses below are from a successful create collection API (https://cwiki.apache.org/confluence/display/solr/Collections+API#CollectionsAPI-CreateormodifyanAliasforaCollection) call and an unsuccessful create collection API call. It seems the 'status' is always 0.\n\nSuccess:\n{u'responseHeader': \n{u'status': 0, u'QTime': 4421}\n, u'success': {u'': {u'core': u'test1_shard1_replica1', u'responseHeader': {u'status': 0, u'QTime': 3449}}}}\n\nFailure:\n{u'failure': \n  \n{u'': u\"org.apache.solr.client.solrj.impl.HttpSolrServer$RemoteSolrException:Error CREATEing SolrCore 'test43_shard1_replica1': Unable to create core: test43_shard1_replica1 Caused by: Could not find configName for collection test43 found:[test1]\"}\n,\n u'responseHeader': \n{u'status': 0, u'QTime': 17149}\n}\n\nIt seems like the status should be 400 or something similar for an unsuccessful attempt?",
    "attachments": {
        "schema.xml": "https://issues.apache.org/jira/secure/attachment/12863252/schema.xml",
        "solrconfig.xml": "https://issues.apache.org/jira/secure/attachment/12863253/solrconfig.xml",
        "SOLR-5970.patch": "https://issues.apache.org/jira/secure/attachment/12948426/SOLR-5970.patch",
        "bad.jar": "https://issues.apache.org/jira/secure/attachment/12863251/bad.jar",
        "SOLR-5970-test.patch": "https://issues.apache.org/jira/secure/attachment/12863255/SOLR-5970-test.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Gregory Chanan",
            "id": "comment-14000606",
            "date": "2014-05-17T02:02:43+0000",
            "content": "I looked into this a bit.  It looks like the collection creation always returns status 0, and returns the failures of the individual shards in the \"failure\" field of the response and successes in \"success.\"  That's interesting information, although I'm not sure it's that more useful for the end-user than just throwing an exception listing all the failures or just the first failure.\n\nThis also appears to be an issue with the other OverseerCollectionProcessor, although I'm not sure if there is any case where an individual operation is not successful, but we'd want to not throw an exception.  Anyone have an opinion?  Mark Miller? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14000814",
            "date": "2014-05-17T16:07:24+0000",
            "content": "Collections API responses really need an overhaul I think. One of those things that has gotten no real attention. Very hard to process the response currently I think.\n\nI do think we need fine grained results available of some kind, unless we change how things work - for instance, you can create a collection and it fails to create on 4 nodes and succeeds on 3 - that collection will exist regardless the way things currently work - it just won't be what you wanted. That's a lot more effort to improve I think, but an all or nothing system would be nicer at some point IMO. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14326340",
            "date": "2015-02-18T18:39:21+0000",
            "content": "Good Collection API responses makes my top list of SolrCloud issues that still need to be completed: https://www.evernote.com/shard/s6/sh/e21837fe-d1d1-4f26-9dbe-fefce9a9feff/0c0f9d8224956916883bc6ffc40a6bba "
        },
        {
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15938610",
            "date": "2017-03-23T15:52:12+0000",
            "content": "Until we fix the collections API properly, should we, at the least, throw a non zero status upon a failed core creation for any replica? The CollectionAdminResponse#getErrorMessages() contain exceptions, if any. Perhaps the presence of errors in the CollectionAdminResponse could set the status code to be non 0. "
        },
        {
            "author": "Esther Quansah",
            "id": "comment-15945711",
            "date": "2017-03-28T18:44:03+0000",
            "content": "processResponse() in OverseerCollectionMessageHandler.java logs the exception and outputs it in the response but never actually throws an exception, which is probably why the status is 0... I'm not able to replicate this issue though...I'm always getting a 400 status when I attempt to create a collection with a non-existent configset. Abraham Elmahrek could you list simple steps to reproduce this? if not, do you have debug enabled logs?  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15946069",
            "date": "2017-03-28T22:17:04+0000",
            "content": "Probably at the time my thinking was something like, well the request succeeded, but maybe some of the sub  request failed and you can read about the parts within the response. The request itself could also fail, and then you would get a failed status. \n\nWe could change this for 7. "
        },
        {
            "author": "Esther Quansah",
            "id": "comment-15959357",
            "date": "2017-04-06T17:20:50+0000",
            "content": "Mark Miller Ishan Chattopadhyaya I tested this out in master and the status code returned is 400, so evidently this has been fixed. Not sure if a 400 code is what you were looking for though - in my opinion, it's most appropriate option. "
        },
        {
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15967443",
            "date": "2017-04-13T11:32:42+0000",
            "content": "Thanks for looking into this, Esther. Here's a situation where I still see status 0 for a failed collection creation.\n\n\n$ cd solr; ant server\n\nCreate a directory, \"badconf\" containing the schema.xml and solrconfig.xml that I've attached here.\nCopy the bad.jar file to {{server/solr-webapp/webapp/WEB-INF/lib}}. It is just a compiled version of the ThrowErrorOnInitRequestHandler.java.\n\n$ bin/solr -c\n$ bin/solr zk -upconfig -d badconf -n bad -z localhost:9983\n\nConnecting to ZooKeeper at localhost:9983 ...\nUploading /home/ishan/code/lucene-solr/solr/badconf for config bad to ZooKeeper at localhost:9983\n\n$ curl \"http://localhost:8983/solr/admin/collections?action=CREATE&name=test1&numShards=1&replicationFactor=2&maxShardsPerNode=2&collection.configName=bad\"\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response>\n<lst name=\"responseHeader\"><int name=\"status\">0</int><int name=\"QTime\">32069</int></lst><lst name=\"failure\"><str name=\"192.168.137.211:8983_solr\">org.apache.solr.client.solrj.impl.HttpSolrClient$RemoteSolrException:Error from server at http://192.168.137.211:8983/solr: Error CREATEing SolrCore 'test1_shard1_replica1': Unable to create core [test1_shard1_replica1] Caused by: Doing my job, throwing a java.lang.Error</str><str name=\"192.168.137.211:8983_solr\">org.apache.solr.client.solrj.impl.HttpSolrClient$RemoteSolrException:Error from server at http://192.168.137.211:8983/solr: Error CREATEing SolrCore 'test1_shard1_replica2': Unable to create core [test1_shard1_replica2] Caused by: Doing my job, throwing a java.lang.Error</str></lst>\n</response>\n\n\n\nAs you see, the collection creation failed, yet the status was 0. Also attaching a unit test that demonstrates the problem. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-16186421",
            "date": "2017-09-29T21:05:33+0000",
            "content": "On SOLR-11406, I saw the core creation failure equivalent of the failures reported here: because pre-7.0 indexes can't be opened with Solr 7.0, core creation over a 6.x index fails, but bin/solr start -s contains/6.x/index nevertheless acts as if everything went fine - only the success message is printed: Started Solr server on port 8983 (pid=XXXX). Happy searching!.\n\nLikely the fix here for collections will take individual cores into account too, so I don't think a separate JIRA is warranted. "
        },
        {
            "author": "Jason Gerlowski",
            "id": "comment-16687447",
            "date": "2018-11-15T03:47:52+0000",
            "content": "Until we fix the collections API properly, should we, at the least, throw a non zero status upon a failed core creation for any replica?\n+1.\n\nStarted taking a look at a possible fix for this earlier this afternoon.  Few notes from things:\n\nFirst, I ran into two easy ways to reproduce the behavior on master.  You can use the invalid configset method that Ishan suggested above.  That still works great.  Or, if you prefer, you can chmod Solr's data dir to be read only (chmod 444 solr/server/solr) and then create a collection however you'd like.\n\nSecond, the overseer processing reports back an error message under the key \"failure\" (you can see this in the curl response in Ishan's example above).  Naively, it seems like we could rely on this key as an indicator that the request-processing failed, and that the status should be non-zero.  I'll probably go down that route tomorrow morning.\n\nLastly, and this is a bit of a side note, but I notice that when I reproduce the problem, the create-collection call repeatedly takes upwards of 30 seconds.  I suspect this a secondary result of not noticing that the overseer processing ran into an error - Solr thinks creation has succeeded so it waits 30 seconds to see the collection become \"active\"  (see the line here).  Hopefully a fix for the route cause here will also help us avoid this issue too! "
        },
        {
            "author": "Jason Gerlowski",
            "id": "comment-16688919",
            "date": "2018-11-16T02:23:12+0000",
            "content": "Attached a patch which takes a stab at this.  With this change, the badconf reproductions Ishan outlines above returns the following response:\n\n\n{\n  \"responseHeader\":{\n    \"status\":400,\n    \"QTime\":2816},\n  \"failure\":{\n    \"192.168.1.194:8983_solr\":\"org.apache.solr.client.solrj.impl.HttpSolrClient$RemoteSolrException:Error from server at http://192.168.1.194:8983/solr: Error CREATEing SolrCore 'D827ACAB-8C4A-4C67-80B7-3DA93066FD6D_shard1_replica_n1': Unable to create core [D827ACAB-8C4A-4C67-80B7-3DA93066FD6D_shard1_replica_n1] Caused by: solr.ThrowErrorOnInitRequestHandler\"},\n  \"Operation create caused exception:\":\"org.apache.solr.common.SolrException:org.apache.solr.common.SolrException: Underlying core creation failed while creating collection: foo\",\n  \"exception\":{\n    \"msg\":\"Underlying core creation failed while creating collection: foo\",\n    \"rspCode\":400},\n  \"error\":{\n    \"metadata\":[\n      \"error-class\",\"org.apache.solr.common.SolrException\",\n      \"root-error-class\",\"org.apache.solr.common.SolrException\"],\n    \"msg\":\"Underlying core creation failed while creating collection: foo\",\n    \"code\":400}}\n\n\n\nMiscellaneous Notes on the Patch\n\n\tSolrJ code that encounters similar collection-creation error conditions will see a RemoteSolrException be thrown.  This is standard in SolrJ, just mentioning it.\n\texisting tests pass, but I'd like to add a more explicit test for this case (or adopt the one attached here already)\n\tThe patch here only addresses this behavior for the create-collection API.  I could've made a broader change that affected other collection-admin APIs, but didn't want to exceed the original intent here.\n\tWould love to get some feedback on the new response.  Otherwise though I'll commit in a few days.\n\n\n\nAs a side note, I hadn't paid attention to the collection-admin responses in a while, and they were worse than I remembered.  We have 4 different things that readers might look at to check for problems: (1) the integer property \"status\", (2) a top level \"failure\" property, (3) a top level \"exception\" property, (4) a top level \"error\" property.  Yikes.  Def worth some further attention and (maybe drastic) change.  I'd be interested in helping where I can if anyone else gets involved here. "
        }
    ]
}