{
    "id": "SOLR-3457",
    "title": "Spellchecker always incorrectly spelled",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "correctlySpelled is always false with default configuration, example config and example documents:\nhttp://localhost:8983/solr/collection1/browse?wt=xml&spellcheck.extendedResults=true&q=samsung\n\n\n<lst name=\"spellcheck\">\n  <lst name=\"suggestions\">\n   <bool name=\"correctlySpelled\">false</bool>\n  </lst>\n</lst>",
    "attachments": {
        "SOLR-3457-4.0-1.patch": "https://issues.apache.org/jira/secure/attachment/12528041/SOLR-3457-4.0-1.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Markus Jelsma",
            "id": "comment-13278751",
            "date": "2012-05-18T11:56:09+0000",
            "content": "Patch for trunk. It seems the isCorrectlySpelled flag is not correctly initialized. In the example samsun is incorrectly spelled, has freqInfo and zero suggestions so it's never set to true. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13279162",
            "date": "2012-05-18T20:28:48+0000",
            "content": "I can reproduce this problem running the solr example.  The fix looked straighforward but unfortunately it causes 2 of the \"SpellCheckComponentTest\" cases to fail.  The code, unfortunately, is a bit squirrely here.\n\nI'm going to take a look at SOLR-2585 to see if applying that fixes this issue also.  SOLR-2585 included rewritten logic for the \"correctlySpelled\" flag. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13280554",
            "date": "2012-05-21T22:22:18+0000",
            "content": "I've found this happens with DirectSolrSpellChecker, which the example was migrated to somewhat recently.  I have a fix incorporated into SOLR-2585, which I will commit soon unless there are objections.  This changes the behavior of \"correctlySpelled\" slightly.  The new behavior sets it to \"true\" if the user's query has at least 1 hit.  The exception to this is if the new \"maxResultsForSuggest\" parameter is invoked, the value supplied here would be the threshold hits that flips \"correctlySpelled\".  All tests pass with this logic change.\n\nMy feeling is that possibly in the past certain proxy metrics were used to determine if FileBasedSpellChecker was being used and if so, \"correctlySpelled\" was supposed to behave differently.  I can't tell this for sure because there doesn't seem to be any explicit tests that enforce such behavior.  Unfortunately DirectSolrSpellChecker also triggers some of this logic.  Removing this extra logic around the \"correctlySpelled\" flag fixes the problem described here.  If this somehow breaks expected (but not covered in unit test) behavior with FileBasedSpellchecker, we can handle that separately should someone speak up. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13281668",
            "date": "2012-05-23T15:34:25+0000",
            "content": "Fixed with SOLR-2585 commit (Trunk r1341894). "
        }
    ]
}