{
    "id": "SOLR-8067",
    "title": "Provide an option to retry on session timeout in ZkCmdExecutor#retryOperation",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I was working on adding a retry option on session timeout when loading/reloading cores. Instead of adding the logic in ZkResourceLoader#openResource I thought it would be better for the option to live in ZkCmdExecutor#retryOperation and other methods could also make use if it.",
    "attachments": {
        "SOLR-8067.patch": "https://issues.apache.org/jira/secure/attachment/12757078/SOLR-8067.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-17T13:01:56+0000",
            "author": "Varun Thacker",
            "content": "This patch changes ZkCmdExecutor#retryOperation and provides options for both connection loss and session expiry.\n\nWith this patch ZkSolrResourceLoader#openResource retries on session expiry as well, meaning the when a core is being loaded/reloaded then it will retry on session expiry as well. \n\nA reference to test fail which is relevant : https://issues.apache.org/jira/browse/SOLR-6924?focusedCommentId=14321702&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14321702\n\nI'll add some tests as well. ",
            "id": "comment-14802875"
        },
        {
            "date": "2015-09-17T13:15:04+0000",
            "author": "Varun Thacker",
            "content": "In HttpPartitionTest Line 160, should the delete command be fired with connectionLoss as false? I'm not familiar with the test so it may have been intended but thought I'll ask anyways. ",
            "id": "comment-14802889"
        },
        {
            "date": "2015-09-17T13:22:17+0000",
            "author": "Mark Miller",
            "content": "This looks like you are retrying on session expiration in many other places too though? Can you comment on all the spots that would now retry on session expiration? ",
            "id": "comment-14802903"
        },
        {
            "date": "2015-09-17T13:27:08+0000",
            "author": "Varun Thacker",
            "content": "Sure. I'll do that. \n\nThe patch I put out went with a hammer approach on the other places and retried if we were retrying on connection loss otherwise it did not. ",
            "id": "comment-14802909"
        },
        {
            "date": "2015-09-17T14:12:05+0000",
            "author": "Mark Miller",
            "content": "You have to be careful. On session expiration, we have to make a new zk client and start from scratch basically - we don't necessarily want to retry - we are expected to fail and start from scratch in most cases.\n\nOn connection loss, the session is still there and it is much more likely you want to retry - almost always other than for specific tricky stuff. ",
            "id": "comment-14802959"
        },
        {
            "date": "2015-09-29T09:13:48+0000",
            "author": "Varun Thacker",
            "content": "Hi Mark,\n\nSorry for the delayed reply. Okay I understood your point. I think we can mark this issue as 'Invalid' then?\n\nI'll create a separate ticket for ZkSolrResourceLoader#openResource to deal with Session Expiration and retry  ",
            "id": "comment-14934899"
        }
    ]
}