{
    "id": "SOLR-9578",
    "title": "Implement document level security in Solr",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "SOLR-7275 introduced pluggable authorization framework. Currently it is not supporting document level security (or authorization). This is required for integrating Apache Sentry with this authorization framework (SENTRY-1475).\n\nCurrently Sentry relies on custom Solr components to enforce this authorization. Please refer to \nhttp://blog.cloudera.com/blog/2014/07/new-in-cdh-5-1-document-level-security-for-cloudera-search/\n\nPlease refer to this discussion as well,\nhttps://issues.apache.org/jira/browse/SOLR-7275?focusedCommentId=14490733&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14490733",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-06T22:01:01+0000",
            "author": "Hrishikesh Gadre",
            "content": "The genesis of this feature is the \"document level security\" feature implemented as part of Solr/Sentry integration. In this case, Sentry is implementing a custom SearchComponent which is responsible to add necessary query filters so that users can see only the data they are authorized for.\n\nInterestingly the newer components in Solr (e.g. SQLHandler, GraphHandler, StreamHandler etc.) are not based on SearchHandler. So I am wondering how to integrate \"document level security\" with these newer components? \n\nJoel Bernstein Any thoughts? ",
            "id": "comment-16039734"
        },
        {
            "date": "2017-06-07T07:32:33+0000",
            "author": "Jan Høydahl",
            "content": "ManifoldCF offers a QParser to enforce doc-level security filtering as an alternative to Search Component. Then you add an fq with local-param to the SearchHandler. Perhaps this is a viable path for the other handlers, i.e. accept one or more filter queries in their configuration which is ALWAYS applied (the handler knows how to best apply it)? ",
            "id": "comment-16040402"
        },
        {
            "date": "2017-06-07T12:56:45+0000",
            "author": "Joel Bernstein",
            "content": "I'm currently working on the Streaming Expressions integration to Alfresco Solr, which involves document level security. Alfresco has it's own access control mechanisms which don't use Sentry. But the Alfresco integration may help shape a general design that could be used with Sentry also. I'll report back to this ticket as the Alfresco integration takes shape. ",
            "id": "comment-16040826"
        },
        {
            "date": "2017-06-26T16:58:37+0000",
            "author": "Hrishikesh Gadre",
            "content": "Joel Bernstein That's great. Please let me know if I can help out in the design/implementation of this feature in any way. ",
            "id": "comment-16063401"
        }
    ]
}