{
    "id": "SOLR-2944",
    "title": "Anecdotal evidence that useFilterForSortedQuery has gotten much slower in 3.5 compared to 1.4",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Pawel Rog reported on the user list that he was seeing significantly slower search performance and much higher CPU usage using Solr 3.5 compared to Solr 1.4 when using the same configs he had always used in Solr 1.4 – even though he had a new index built with 3.5\n\nhttps://mail-archives.apache.org/mod_mbox/lucene-solr-user/201111.mbox/%3CCAF9ZkbPHo0Y-PvSkm4dkaNc7aArGacfSSHNQBL+nOOt1aHxLwA@mail.gmail.com%3E\n\nBased on stacktraces from threaddumps the \"useFilterForSortedQuery\" was determined to be a contributing factor, and disabling it improved performance (exact comparison not provided).  \n\nWould be nice to get some more details and a reproducible comparison (SOLR-2646 where are you???) and evluate why useFilterForSortedQuery would be slower in 3.5 then in 1.4 with the same data.\n\nShould consider actively removing the useFilterForSortedQuery=true option if there are no longer any usecases where it's better then useFilterForSortedQuery=false",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Uwe Schindler",
            "id": "comment-13161916",
            "date": "2011-12-02T23:20:04+0000",
            "content": "I have the feeling, SOLR-2429 could cause this. There were no changes in Lucene 3.5 except a refactoring in searchWithFilter (moved to FilteredQuery), but thats not even used by Solr (Solr has its own filter logic not using any line of Lucene code most of the time). "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13161926",
            "date": "2011-12-02T23:42:27+0000",
            "content": "Uwe: totally possible, but he was upgrading from Solr 1.4, so there are lots of changes on the table as possible culprits. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13161933",
            "date": "2011-12-02T23:47:02+0000",
            "content": "Maybe we should ask him to also check Solr 3.3 (the above change was introduced in 3.4). I was just going through the logs of SolrIndexSearcher. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13165820",
            "date": "2011-12-09T03:50:06+0000",
            "content": "I've done some ad-hoc testing using the useFilterForSortedQuery option on 1.4.1 and 3.5.\n3.5 has turned out faster in every case I tested (between 1.3 and 2.1 times faster).\n\nThe indexes built weren't quite equivalent because of the merge policies.\nThe 1.4 index had 6 segments, and the 3.5 index had 17 segments. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15566528",
            "date": "2016-10-11T20:39:27+0000",
            "content": "Old performance discussion that has nowhere to go. "
        }
    ]
}