{
    "id": "SOLR-8931",
    "title": "SolrCloud RebalanceShards API",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Wish",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Duplicate",
        "priority": "Minor"
    },
    "description": "It would be great to have RebalanceShards action in SolrCloud, such like described in this post by Suruchi Shah : \"http://engineering.bloomreach.com/solrcloud-rebalance-api/\"\n\nBy the way, in order to rebalance shards from a collection with replicationFactor > 1, one idea could be to split some shards using the rule-based replica placement.\nSince https://issues.apache.org/jira/browse/SOLR-8728 jira issue, splitShard is using rule-based replica placement (for the \"replication\" replicas).\n\nAs part of a proof of concept, the attached patch introduce a new action to the collections API, named \"REBALANCESHARDS\", to rebalance some or all shards among solrCloud nodes using splitShard.\nAfter each splitShard, a deleteshard of the inactive parent shard is done.\nOne mandatory parameter:\n\n\tcollection: the name of the collection\nTwo parameters:\n\tdeltaMaxFromAverage (default: 20): use to select n shards (<= half of all shards) to be split, whose number of docs are greater than deltaMaxFromAverage percent of the average number of docs per shard\n\tforce (default: false): if true, in case of none shards selected with the deltaMaxFromAverage given, all shards of the collection will be selected to be split\n\n\n\nUse example:\ncurl 'http://ip:port/solr/admin/collections?action=REBALANCESHARDS&collection=collection1&async=2&deltaMaxFromAverage=30'\n\nDrawbacks: replicationFactor must be more than one, select shards based on the average number of docs per shard is not suitable for all cases",
    "attachments": {
        "SOLR-8931.patch": "https://issues.apache.org/jira/secure/attachment/12796507/SOLR-8931.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-01T14:24:28+0000",
            "author": "Mark Miller",
            "content": "Nice patch, this would be a good feature to add. ",
            "id": "comment-15221752"
        },
        {
            "date": "2016-07-08T14:42:47+0000",
            "author": "Cassandra Targett",
            "content": "Bloomreach has now donated their Rebalance API, in SOLR-9241. While there is still a way to go with that issue, olivier soyez, do you think this feature is still needed when it is committed? I'll confess I haven't looked at your patch, just happened to come across this while looking for something else and remembered SOLR-9241 was recently created.  ",
            "id": "comment-15367761"
        },
        {
            "date": "2016-07-08T15:05:23+0000",
            "author": "olivier soyez",
            "content": "Great news about Bloomreach donated their Rebalance API. So, I think this feature is not needed anymore when SOLR-9241 is committed. ",
            "id": "comment-15367791"
        }
    ]
}