{
    "id": "SOLR-2074",
    "title": "GeoRSS ResponseWriter",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "spatial"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "This is another patch from William and I. My contribution to this patch was converting this patch to use the BaseResponseWriter framework I introduced (along with Noble) in SOLR-1516. This patch provides a GeoRSS compatible response writer for use in spatial.",
    "attachments": {
        "SOLR-2074.Mattmann.Quach.082310.2.patch.txt": "https://issues.apache.org/jira/secure/attachment/12452831/SOLR-2074.Mattmann.Quach.082310.2.patch.txt",
        "SOLR-2074.Mattmann.Quach.082210.patch.txt": "https://issues.apache.org/jira/secure/attachment/12452777/SOLR-2074.Mattmann.Quach.082210.patch.txt",
        "SOLR-2074.Mattmann.Quach.Li.042312.patch.txt": "https://issues.apache.org/jira/secure/attachment/12523901/SOLR-2074.Mattmann.Quach.Li.042312.patch.txt",
        "SOLR-2074.Mattmann.Quach.082310.patch.txt": "https://issues.apache.org/jira/secure/attachment/12452820/SOLR-2074.Mattmann.Quach.082310.patch.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Chris A. Mattmann",
            "id": "comment-12901272",
            "date": "2010-08-23T05:47:19+0000",
            "content": "\n\tpatch attached for basic GeoRss writer. solrconfig.xml update to include the writer as well.\n\n "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-12901450",
            "date": "2010-08-23T15:40:53+0000",
            "content": "sorry, original patch used \"get\" instead of \"getFirstValue\", leading to an error. Fix attached. "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-12901462",
            "date": "2010-08-23T16:10:36+0000",
            "content": "Here are some notes from William about the collective of patches:\n\n   NOTE 1: For best results, please use Mozilla Firefox when running the example.\n   NOTE 2: If city contains white space, surround the city in double quotes (\")\n   NOTE 3: State needs to be an abbreviation (e.g. CA for California)\n   NOTE 4: Country must be ISO-3166 2-letter country code (e.g. US for United States). See http://download.geonames.org/export/dump/readme.txt for more details.\n   NOTE 5: If a location cannot be determined from the ct, s, and c parameters. A reverse-ip lookup will be initiated to attempt to determine your location.\n           This will only work if your IP is accessible to the Java servlet. This usually does not work when client and server are on the same machine.\n           The default GeotargetAdapter uses hostip.info webservice, so in order for this service to work, your IP must be located in their database.\n           Visit http://www.hostip.info/ for more information and to add your IP and location to the hostip database.\n   NOTE 6: If your location cannot be determined by either means, then spatial search will be aborted and you will get the results for the default free-text search. If the results contains geo data, then it will still be plotted on the map. "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-12901477",
            "date": "2010-08-23T16:52:58+0000",
            "content": "\n\tmade the code a bit more robust for lats and lons\n\n "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12901521",
            "date": "2010-08-23T18:19:26+0000",
            "content": "out of curiosity, why wouldn't an XSLT stylesheet and the xslt writer suffice for this need? "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-12901526",
            "date": "2010-08-23T18:38:39+0000",
            "content": "well to each their own i guess. XSLT is scary for me, and Java code isn't  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12901549",
            "date": "2010-08-23T19:23:56+0000",
            "content": "how about velocity   maybe that is less scary then XSLT\n\nI fear adding and maintaining even more response writers when the ones we have are such a mess.  How would this new response writer deal with things like location field names changing etc...   "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-12901557",
            "date": "2010-08-23T19:38:01+0000",
            "content": "Heh. Dually noted. The thing is, I'm not against any of the solutions. We just so happened to have cooked one up in Java. If folks want an XSLT version, great, to each their own. I'd be happy to maintain the Java version, but I'm not good at XSLT. I'm not super great at Velocity either. I know Java very well though. So, dunno on this one. It's nice to have the ability to write it in any of these three methodologies, but I'm not sure any of them are better than the other. The benefit here is that we've already written one in Java, so it's there. You can use it, or feel free to rewrite it and start all over in your language/technology of choice.  "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12901826",
            "date": "2010-08-24T11:32:46+0000",
            "content": "I hate XSLT too though pragmatic; for something straightforward like this it seems like a short and sweet stylesheet would do the trick.  \n\nAs for Velocity - having it generate an XML response would work, but care must be taken to XML encode all dynamic text properly so it's not quite the perfect tool for the job.  But it's easy enough to encode XML using $esc.xml(...) in a Velocity template so it'd actually look quite lean and clean as a template. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12901844",
            "date": "2010-08-24T12:26:45+0000",
            "content": "I hate XSLT too though pragmatic; for something straightforward like this it seems like a short and sweet stylesheet would do the trick. \n\nI love XSL, after Java it's my 2nd favorite programming language (really, additionally its also turing complete g). In my opinion, a stylesheet is here the best possibility to choose. Its short and comapct and easy to understand. Here at PANGAEA, our complete metadat processing is based on XSL, so I could possibly produce one (I prefer KML over GeoRSS, but that does not matter - we could possibly provide both).\n\nEDIT:: I think I have seen an GeoRSS/KML XSL in a testcase of another issue. I have to look for the issue number. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12902174",
            "date": "2010-08-25T00:01:50+0000",
            "content": "SOLR-1354 is my attempt at a real XSL. It lets you pass field names and other things in as parameters. The patch includes a one-size-fits-all stylesheet can be reused without copying and changing it.\n\nWith GeoRSS I'm finding I still want to put code into creating the georss data, so I don't think a one-size-fits-all template is good enough. And I am now a well-informed, experienced XSL-hater. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12988440",
            "date": "2011-01-29T12:25:10+0000",
            "content": "Moving out all unassigned issues set to 3.1 per this email: http://www.lucidimagination.com/search/document/f026cc56081b5a51/unassigned_jira_issues_set_for_3_1 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043648",
            "date": "2011-06-03T16:46:19+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106420",
            "date": "2011-09-16T14:51:00+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234624",
            "date": "2012-03-21T18:08:38+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Yiyu Li",
            "id": "comment-13260114",
            "date": "2012-04-24T00:27:40+0000",
            "content": "Patch updated: SOLR-2074.Mattmann.Quach.Li.042312.patch.txt\n\nThis updated patch also outputs the \"pubDate\" for the GeoRSS if the field \"pubDate\" or \"timestamp\" is indexed in solr. "
        }
    ]
}