{
    "id": "SOLR-5674",
    "title": "The rows improvement for QueryComponent",
    "details": {
        "affect_versions": "4.3.1,                                            4.5.1,                                            4.6",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "For solr Rows issues:\n1. Solr don't provide get full results API, usually customer will set the rows is Integer.maxvalue try to get the full results that cause the other issue. OOM issue in solr :SOLR-5661(https://issues.apache.org/jira/browse/SOLR-5661)\nHow about open the API for rows=-1? That means return full results. Sometimes the result count will every biggest that will cause the heap OOM, but usually we can suggest the customer to make sure the result really small that can call this API. Actually we don't want to make the second call to get full results. For one is call API get total number, for two get the result set rows into total number.\n\n2. A litter improve, because every shard node return results has been ordered. Add first shard list into the PriorityQueue that don't need compare again only filter the same unique id.\n\n3. Create the PriorityQueue after check all shard return sizes, that can avoid the unnecessary memory cost especially biggest rows.",
    "attachments": {
        "SOLR-5674.txt": "https://issues.apache.org/jira/secure/attachment/12625816/SOLR-5674.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Raintung Li",
            "id": "comment-13885111",
            "date": "2014-01-29T07:36:01+0000",
            "content": "I don't have environment to test, just take a look.  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13937246",
            "date": "2014-03-16T18:12:30+0000",
            "content": "I haven't gone through the patch yet but is SOLR-5463 useful for you? "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16322679",
            "date": "2018-01-11T18:07:36+0000",
            "content": "I don't think this was ever a bug but instead a set of improvement requests.\n\nSince 2014, we have added Deep Paging support and the /export handler which both allow access to high numbers of results without some of the issues I suspect prompted this issue. Closing as Won't Fix - please reopen if it's still relevant in a way I've misunderstood. "
        }
    ]
}