{
    "id": "SOLR-1170",
    "title": "Java replication replicates lucene lock file",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When using solr 1.4 replication, I see that the lucene-write.lock file is being replicated to slaves.  I'm importing data from a db every 5 minutes using cron to trigger a DIH delta-import.  Replication polls every 60 seconds and the master is configured to take a snapshot (replicateAfter) commit.\n\nWhy should the lock file be replicated to slaves?\n\nThe lock file isn't stale on the master and is absent unless the delta-import is in process.  I've not tried it yet, but with the lock file replicated, it seems like promotion of a slave to a master in a failure recovery scenario requires the manual removal of the lock file.",
    "attachments": {
        "SOLR-1170.patch": "https://issues.apache.org/jira/secure/attachment/12408476/SOLR-1170.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12710716",
            "date": "2009-05-19T12:08:58+0000",
            "content": "are you sure that the lucene-write.lock is actually replicated . It may be created in the slave itself. to confirm it can your check the master with the command=filelist&indexversion=<the version>\n\nthe version can be obtained from the command=indexversion\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12710717",
            "date": "2009-05-19T12:09:34+0000",
            "content": "if it is indeed a problem. Then this patch can solve it "
        },
        {
            "author": "Bryan Talbot",
            "id": "comment-12710767",
            "date": "2009-05-19T15:50:02+0000",
            "content": "The lock file doesn't show up in the filelist.  It always has the same timestamp as other files which were replicated and sticks around until the next replication begins so I had assumed it was replicated.\n\nIf it is created on the slave instead of being replicated, isn't that still an issue?  I'm certain that there are no writes being performed on the slave. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12710775",
            "date": "2009-05-19T16:12:31+0000",
            "content": "The replication handler calls forceOpenWriter to ensure old index files are deleted after a pull. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12711012",
            "date": "2009-05-20T05:27:02+0000",
            "content": "\n\nin that case, if you promote your slave to become a master it should have no problem. the lock is created by the same server ,so it will be removed when you close the writer or restart the server\n\n\n "
        },
        {
            "author": "Bryan Talbot",
            "id": "comment-12711015",
            "date": "2009-05-20T05:52:11+0000",
            "content": "When the slave is cleanly shutdown, the lock file remains.  Doesn't that indicate an index writer got left open and not properly shutdown? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12711034",
            "date": "2009-05-20T06:35:22+0000",
            "content": "even if the lock is present it can be removed if the attribute mainIndex/unlockOnStartup is present in the solrconfig.xml. \n\n\nBut if it does not get removed automatically there could be a problem "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12753183",
            "date": "2009-09-09T17:41:20+0000",
            "content": "issue is marked \"affects 1.4\" and has a patch which comments indicate solves the problem ... marking \"fix for 1.4\" so it's not overlooked prior to code freeze "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12754498",
            "date": "2009-09-12T09:16:17+0000",
            "content": "I guess it safe enough to commit this patch. The .lock file does not need to be replicated in any case "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12755864",
            "date": "2009-09-16T03:40:05+0000",
            "content": "committed r815597 "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775745",
            "date": "2009-11-10T15:52:05+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}