{
    "id": "SOLR-3979",
    "title": "slf4j bindings other than jdk -- cannot change log levels",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [
            "4.3"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Once I finally got log4j logging working, I was slightly surprised by the message related to SOLR-3426.  I did not really consider that to be a big deal, because if I want to look at my log, I'll be on the commandline anyway.\n\nI was even more surprised to find that I cannot change any of the log levels from the admin gui.  My default log level is WARN for performance reasons, but every once in a while I like to bump the log level to INFO to troubleshoot a specific problem, then turn it back down.  This is very easy with jdk logging in either 3.x or 4.0.  I changed to log4j because it easily allows me to put the date of a log message on the same line as the first line of the actual log message, so when I grep for things, I have the timestamp in the grep output.\n\nCurrently the only way for me to change my log level is by updating log4j.properties and restarting Solr.  If the capability to figure this out on a class-by-class basis isn't there with log4j, I would at least like to be able to set the root logging level.  Is that possible?",
    "attachments": {
        "log4j-solr-stuff.zip": "https://issues.apache.org/jira/secure/attachment/12550496/log4j-solr-stuff.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-13482469",
            "date": "2012-10-23T17:10:16+0000",
            "content": "here are some implementations of the LogWatcher that work for log4j\n\nthese were included in the main distribution, but since it makes for a weird compile/test classpath, they were removed.  I think there is a vague plan to switch to log4j as the default provider but no activity there... "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13540759",
            "date": "2012-12-29T04:24:30+0000",
            "content": "SOLR-4129 also touches on this.  Discussions around log4j are quite plentiful. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13603219",
            "date": "2013-03-15T08:00:48+0000",
            "content": "check SOLR-3706 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653857",
            "date": "2013-05-10T10:33:12+0000",
            "content": "Closed after release. "
        }
    ]
}