{
    "id": "SOLR-1848",
    "title": "Add example Query page to the example",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I've wired up a static jetty context and hooked in a simple HTML page that shows off a bunch of the different types of queries people can do w/ the Example data.  Browse to it at http://localhost:8983/example/queries.html\n\nWill commit shortly.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-12850226",
            "date": "2010-03-26T17:26:03+0000",
            "content": "Make that http://localhost:8983/solr/example/queries.html "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850251",
            "date": "2010-03-26T17:51:08+0000",
            "content": "What's the motivation for including them in the solr webapp?\nStuff like this works fine from the tutorial on the website, or from a wiki page.\n\nAnd I've been trying to get rid of the extra directories in \"example\", not add more  "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12850254",
            "date": "2010-03-26T17:55:50+0000",
            "content": "B/c you don't always have access to those.  This is nice and handy and concise and included in the example w/o having to go looking all around.  If anything, the tutorial should be shipped w/ the example. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850256",
            "date": "2010-03-26T17:57:14+0000",
            "content": "I believe the tutorial is already shipped in the solr download. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850257",
            "date": "2010-03-26T18:00:23+0000",
            "content": "This also complicates setting up with different servlet containers.  Someone can't drop the solr.war into tomcat, or in a different jetty container, and follow along with the tutorial anymore.  I think we should revert this and keep things simple. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12850263",
            "date": "2010-03-26T18:04:26+0000",
            "content": "Seriously, Yonik?  This is worth the discussion?  It's a jetty context file and a static HTML page that contains some handy examples of how to work with Solr w/o going all over the place.  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850269",
            "date": "2010-03-26T18:09:55+0000",
            "content": "If it's not worth the discussion, hopefully you won't mind if it's reverted then? "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12850272",
            "date": "2010-03-26T18:16:43+0000",
            "content": "Whatever.  Do as you wish.  Just b/c you don't find something useful doesn't mean others won't. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850274",
            "date": "2010-03-26T18:17:46+0000",
            "content": "I guess an argument could also be made for putting the whole tutorial page in the example server.\nBut it's certainly something that warrants discussion. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850276",
            "date": "2010-03-26T18:21:08+0000",
            "content": "Just b/c you don't find something useful doesn't mean others won't. \n\nOf course... but one could use such an argument to support anything.\nIn this specific case, it doesn't seem like there is enough benefit to outweigh the additional complexity. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12850329",
            "date": "2010-03-26T20:07:07+0000",
            "content": "OK, I've reverted this for now.\nIf people want changes to the current tutorial structure, we can have more discussion to hash out the best way to achieve that. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12851092",
            "date": "2010-03-29T21:06:14+0000",
            "content": "I'm confused by yonik's comment...\n\nbq .What's the motivation for including them in the solr webapp?\n\nI agree, adding things to solr.war just for the purpose of the example/tutorial is a bad idea, but from what i can tell Grant's commit didn't do that – it just added configuration so that people running \"java -jar start.jar\" had both the solr webapp running as well as a \"static\" webapp containing a form.  if they copied the solr.war file, or the \"example/solr\" home they wouldn't be affected at all.\n\nI suppose for people who copy the entire example directory there might be some unnecessary stuff – but that's going to always be true (unless we get rid of exampledocs)\n\nFrankly though: the queries.html is so simple, i really don't understand why we wouldn't just expand the tutorial to include those links. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12851098",
            "date": "2010-03-29T21:12:10+0000",
            "content": "Frankly though: the queries.html is so simple, i really don't understand why we wouldn't just expand the tutorial to include those links.\n\nSpatial is a cool enough feature, it might make sense to add a little section (like faceting has) to the tutorial when it's mature enough.  As long as it's easy and simple enough though... it seems like one of the primary goals of the tutorial should be to give users a feeling of accomplishment  and a feeling of \"this solr stuff is easy to use!\". "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12851131",
            "date": "2010-03-29T22:03:36+0000",
            "content": "Agreed: as we start adding sections, it will maek a lot of sense to split the tutorial out into multiple pages: the (existing) intro page shoiwing how easy it is to load data and do basic queries w/faceting and highlighting, a second page showing off spatial queries, a third page showing spell check (and myabe more like this), DIH should have a page, etc...\n\nWith the possible exception of distributed search (where multiple ports need to be up and running) there's no reason all of these things can't be demoed from a single example. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12851141",
            "date": "2010-03-29T22:29:41+0000",
            "content": "I was just trying to solve something I find to be very annoying in Solr:  I just want some quick examples that are part of the actual example that I can go click on and try out w/o having to go chasing all over creation to find them (wiki, tutorial, various websites, etc.)   Not too mention there is no simple \"reference\" for these examples, all of those things (wiki, tutorial) have a ton of verbiage around them.  For instance, you have to scroll quite a long way in the tutorial to even get to a sample query.  I just want a dumb little page, (ideally, it would actually be the landing page when hitting http://localhost:8983/solr when using the example) that shows me examples of interacting with Solr.  I can click on the link, get results and then introspect what I just did.\n\nHeck, going forward, we could even distribute the example index already built so that people don't have to do the indexing until later.  I often find in my training classes that I get a lot better attention when I do search first instead of indexing.\n\nWho knew such a simple thing was worth so much discussion. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12851725",
            "date": "2010-03-31T04:39:29+0000",
            "content": "Maybe there could be a Solr Apps project somewhere else with all of these cool things like the tutorial, clustering, Uri's lovely GWT browser, spatial demos, etc. A simple content management store that lets you index & save PDFs and then search & display them.\n\nFor one thing, it would be worthwhile to cleave these away from relying on moment-by-moment changes in the core source base. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15517413",
            "date": "2016-09-23T19:54:44+0000",
            "content": "Closing ancient issue. We now have Velocity handler which fills this need I guess. "
        }
    ]
}