{
    "id": "SOLR-2873",
    "title": "StreamingUpdateSolrServer does not provide public access to shutdown ExecutorService scheduler",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Applications do not exit until the StreamingUpdateSolrServer ExecutorService threads have died.  Currently, with no way to manually shut down the ExecutorService, an application that has completed execution will hang for 60s waiting for the keepAlive time on the pooled runner threads to expire.  This could be addressed by adding a single method to StreamingUpdateSolrServer:\n\npublic void shutdown() {\n    scheduler.shutdown();\n}",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Lance Norskog",
            "id": "comment-13145174",
            "date": "2011-11-07T01:03:46+0000",
            "content": "Ah! There is a matching problem lurking here: exceptions. There is no feedback from an executor to the main SUSS thread about a failure in indexing. Please add this to your patch. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13145178",
            "date": "2011-11-07T01:13:45+0000",
            "content": "Also, you will find a design feature in various places: finalize complains if the object not already shut down. You can see how this works in SolrIndexWriter:finalize().\n\nThis design pattern enforces clean programming; but it will add an error message to every existing program that uses SUSS . "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13255499",
            "date": "2012-04-17T12:11:23+0000",
            "content": "Today there is a shutdown method that calls scheduler.shutdown(), perhaps it was added in some other issue. "
        }
    ]
}