{
    "id": "SOLR-12400",
    "title": "SOLR Joins for multiple collections",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "faceting",
            "multicore",
            "search"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "I have the below requirement and need help to know if it is achievable with JOINs or Block Join (Nested documents)-\n\nData\n\nThere are multiple tables, one primary table having all the basic details about product, the primary key is Product ID. There are 6-7 other tables having other details of product, it has Product ID column too but can have multiple entries for single Product ID.\n\nCan you please let me know if the below are possible-\n\n\tCan we get data from multiple collections in the search results. The results should contain only one record for a single product ID?\n\tCan we search across multiple collections in a single query and then club the results, so that final search results will have single result for each Product ID.\n\tCan we perform join on more than 2 collections as we need to search across 6-7 collections and then merge the data based on product ID.\n\tCan we query Parent and child in nested index at the same time. Example- perform search on column1 from Parent and Column2 from Child and get the parent records with nested child in search results?\n\tIf we can perform fielded search across multiple collections in the single query,will the filters from different collections be returned in a single search response",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-25T14:37:41+0000",
            "content": "This issue tracker is not a support portal. Please raise this question on the user's list at solr-user@lucene.apache.org, see: (http://lucene.apache.org/solr/community.html#mailing-lists-irc) there are a lot more people watching that list who may be able to help and you'll probably get responses much more quickly.\n\nIf it's determined that this really is a code issue in Solr and not a configuration/usage problem, we can raise a new JIRA or reopen this one. ",
            "author": "Erick Erickson",
            "id": "comment-16490810"
        }
    ]
}