{
    "id": "SOLR-12809",
    "title": "Upgrading to a more recent Java (JDK 11?)",
    "details": {
        "type": "Improvement",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None"
    },
    "description": "JDK 8 will be EOL early next year (except for \"premier support\"). JDK 9, 10 and 11 all have issues for Solr and Lucene IIUC.\n\nAlso IIUC Oracle will start requiring commercial licenses for 11.\n\nThis Jira is to discuss what we want to do going forward. Among the topics:\n\n\tSkip straight to 11, skipping 9 and 10? If so how to resolve current issues?\n\tHow much emphasis on OpenJDK .vs. Oracle's version\n\tWhat to do about dependencies that don't work (for whatever reason) with the version of Java we go with?\n\t???\n\n\n\nThis may turn into an umbrella Jira with sub-tasks of course. Since JDK 11 has had a GA release, I'd also like to have a record of where the current issues are to refer people to.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16629208",
            "content": "I found this list of open Jira issues with the label \"Java9\". Essentially it's Kerberos and Hadoop that are problematic. If test failures indicate other problems, they haven't been labeled nor mention.\n\nThere are an additional 12 issues that mention Java 10 in the Environment, but it's difficult to know which of those are caused by Java 10 or other bugs/user misconfigurations.\n\nOne thing I'd like to do is be more specific in the Ref Guide about the known issues that exist with JDK 9, 10 & 11, so I'd like to add a short note to the solr-system-requirements.adoc specifically mentioning Hadoop and Kerberos as problematic for Java 9+, without getting into details about what exactly is wrong, which JDK versions specifically, etc. If other general problems are identified, those can be added later. I may point readers to specific Jira issues for more information.\n\nIdeally something similar could be added to CHANGES also - I think it would be helpful to make it more clear for users where Solr stands in support of Java versions. ",
            "author": "Cassandra Targett",
            "date": "2018-09-26T18:08:58+0000"
        },
        {
            "id": "comment-16629257",
            "content": "My thoughts, implement or ignore as you see fit:\n\nIt will be interesting to see how Java fares as a viable platform, especially for open source, as Oracle makes it harder and harder to use Java without paying.\n\nNext year when Oracle puts all support for Java 8 behind a pay wall, it's going to be a problem if users can't use Java 11 to run Lucene-based software like Solr.  We will need to have any problems we currently have fixed by then.  Dependencies like Hadoop face a similar situation, we will need to be prepared to upgrade to new versions of those dependencies.\n\nI think we should explicitly recommend OpenJDK for Lucene/Solr.  Before now, I have always recommended Oracle Java, and said that OpenJDK (as long as it's 7 or later and compatible with the specific Solr version) should work well.  With Oracle requiring a paid license for production use of their Java 11 implementation, I don't think we can recommend it. ",
            "author": "Shawn Heisey",
            "date": "2018-09-26T18:44:38+0000"
        }
    ]
}