{
    "id": "SOLR-11211",
    "title": "Too many documents, composite IndexReaders cannot exceed 2147483519",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I am running a single node Hadoop SOLR machine with 64 GB of ram.\nThe issue is that I was using the machine successfully untill yesterday where I made a restart and one of the indexes I am working on wouldn't start giving the error :Too many documents, composite IndexReaders cannot exceed 2147483519\". \nI wonder how SOLR allowed me to add more documents than what a single shard can take. I need a solution to startup the index and I don't want to loose all the data as I only have a 2 week old backup.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-08-08T17:41:49+0000",
            "content": "bq: I wonder how SOLR allowed me to add more documents than what a single shard can take.\n\nOne possible scenario (and the Lucene guys please step in if this is off the wall)...\n\nsegments have a base+offset for the internal ID. So segment 1 might have\nbase: 1,000,000\ndocs: 0-1,000\n\nSo as long as you're adding documents to Solr (actually Lucene) and not opening searchers you can create segments forever.\n\ncomposite IndexReaders look at all the segments and assemble a (conceptual) list of all the docs in the segment. So the segment above will have docs 1,000,000-1,001,000.\n\nPlus note that numDocs isn't the actual total docs. maxDoc is the one that counts here, it includes deleted documents.\n\nAs far as recovering your data, this occurred to me, but I have not tested whether this idea will work.\n1> copy 1/2 the segments to each of two new cores.\n2> run CheckIndex with -fix. This will drop any \"bad\" segments, in this case I believe it will rewrite your segments file to only include the existing segments.\n3> Examine both cores to see they're what you expect\n4> run MERGEINDEX (https://cwiki.apache.org/confluence/display/solr/Merging+Indexes) to bring them back together.\n\nIt's worth a shot anyway. It's a band-aid, longer term you want to split this shard for a variety of reasons.\n\nThis is actually a Lucene-level limitation, and unlikely to be changed any time soon as it's a very large undertaking. ",
            "author": "Erick Erickson",
            "id": "comment-16118722"
        }
    ]
}