{
    "id": "SOLR-9564",
    "title": "Unable to connect to SOLR CLOUD NODES",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.2.1"
        ],
        "affect_versions": "5.2.1",
        "status": "Closed",
        "resolution": "Invalid",
        "priority": "Blocker"
    },
    "description": "We have two solr cloud nodes setup on the Zookeeper.\n\nSOLR version is 5.2.1 and Zookeeper Version is 3.4.6.\n\nSOLR CLOUD Architecture has Listing which is connected to shards which in turn is connected to 2 SOLR CLOUD NODES.\n\nOur Production API which brings listing from SOLR nodes became unavailable.SOLR nodes logs were not generated  and did not log any activity for 6 hours when Production was unavailable.SOLR files got rotated with the timestamp when we restarted SOLR service and Zookeeper.out showed below errors in log at the start of downtime:\n\nEndOfStreamException: Unable to read additional data from client sessionid 0x156a6ca33180002, likely client has closed socket \n2016-09-26 04:25:07,545 [myid:1] - WARN  [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:NIOServerCnxn@357] - caught end of stream exception\nEndOfStreamException: Unable to read additional data from client sessionid 0x156a6ca33180002, likely client has closed socket\n        at org.apache.zookeeper.server.NIOServerCnxn.doIO(NIOServerCnxn.java:228)\n        at org.apache.zookeeper.server.NIOServerCnxnFactory.run(NIOServerCnxnFactory.java:208)\n        at java.lang.Thread.run(Thread.java:745)\n\n\nZOO.CFG has below settings:\n\n[Replaced IP's Intentionally with x's for security purpose]\nserver.1=172.x.x.x:2888:3888\nserver.2=172.x.x.x:2888:3888\nserver.3=172.x.x.x:2888:3888\n\nPlease let us know what could be the probable cause that our API's were not able to connect to SOLR nodes completely which resulted in Production downtime.\n\n\n\n\nThanks\nPahuni",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-27T07:59:38+0000",
            "author": "Jan Høydahl",
            "content": "This is not a support tracker for questions about production issues.\n\nIt may be a \"blocker\" for your business, but we urge you to contact the party responsible for providing support and operations for your Solr instance. If you do not have any such contract with anyone, you are free to use the channels the Apache Solr™ open source project provides. You will find links here: http://lucene.apache.org/solr/resources.html#community The main channel is to subscribe to and send an email to the solr-user@lucene.apache.org mailing list.\n\nI will now close this JIRA, as this bug tracker is for software bugs only. ",
            "id": "comment-15525417"
        }
    ]
}