{
    "id": "SOLR-12961",
    "title": "Ref Guide: Add keyword metadata to pages",
    "details": {
        "type": "Improvement",
        "status": "Open",
        "labels": "",
        "fix_versions": [
            "7.6",
            "master (8.0)"
        ],
        "components": [
            "documentation"
        ],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None"
    },
    "description": "As a continuation of improvements in SOLR-12746, another thing we should do is add keyword metadata to the HTML pages. Currently our pages have this in the <head> section:\n\n\n<meta name=\"keywords\" content=\" \">\n\n\n\nWe have the structure in place for it in the page templates, we just need to populate with some keywords.\n\nThe idea behind doing this is that these terms could be a source for facet buckets when we get a Ref Guide search going via SOLR-10299.",
    "attachments": {
        "SOLR-12961.patch": "https://issues.apache.org/jira/secure/attachment/12947440/SOLR-12961.patch",
        "keywords.json": "https://issues.apache.org/jira/secure/attachment/12947441/keywords.json",
        "userlevels.json": "https://issues.apache.org/jira/secure/attachment/12947444/userlevels.json"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16675723",
            "content": "There's two ways to approach this, and we can do either or both of them.\n\n\n\tPopulate the keywords with alternate terms or key phrases the give clues to what the page is about. These would not be pre-determined, but instead decided by page authors as they see fit.\n\tPopulate the keywords with a predetermined list of topics the subject of the page fits into and/or relates to. This requires coming up with a reasonably complete list of topics and agreeing on their form. It also requires more precommit-style validation to ensure the entries used by authors fit the accepted form of terms.\n\n\n\n(We could also mix them both and just let everyone do what they want...but if we want to use them for facet buckets, a free-for-all would probably result in GIGO metadata.)\n\nThey both have their place and purpose. The first helps users identify a page based on words they use which may not be in the title of the page. The second helps users find all the pages about the same topic more easily.\n\nI'm a librarian at heart and by training, so of course I like both. The second option is more work, so I'll start out with the first option and see what I can come up with. ",
            "author": "Cassandra Targett",
            "date": "2018-11-05T20:28:58+0000"
        },
        {
            "id": "comment-16680033",
            "content": "I've attached a patch that adds two page-level metadata attributes to almost all the pages of the Ref Guide: a \"user level\", or audience knowledge level, and \"keywords\".\n\nThe user level (page-userlevel) I pretty much settled on Introductory, Beginner, Intermediate, Advanced. The attached \"userlevel.json\" shows how those ended up being distributed page-count-wise.\n\nThe \"keywords.json\" shows the distribution of keywords I chose (so far). I pretty much made these up as I went along and I did it rather free-form without trying to create or adhere to any defined taxonomy. I still need to a bit of review to see if there's consolidation of plurals/singular or similar terms that could happen, so IMO this isn't ready to commit but is ready for some feedback on the general idea. ",
            "author": "Cassandra Targett",
            "date": "2018-11-08T17:17:57+0000"
        }
    ]
}