{
    "id": "SOLR-4019",
    "title": "Service Unavailable errors not being logged",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Due to changes introduced in SOLR-2124, Service Unavailable (503) errors intentionally not logged. This was introduced to avoid the PingRequestHandler to generate exceptions in logs for requests that are not really exceptions for Solr, see http://www.gossamer-threads.com/lists/lucene/java-dev/171982 The problem with this now is that in some cases (like when using SolrCloud), 503 are critic problem and an exception should be logged. \nPer hoss comment:\n\nThe crux of the problem historically, and how we got into the weird\nsituation with the Ping handler is that we wnat to return to the client\nthe 503, so we threw an exception that would propogate up and result in\nSolrDispatchFilter returning the 503 – but in the meantime we had to jump\nthrough a bunch of hoops to deal with the logging because for solr it's\nnot really an error and we shouldn't freak out about logging. (ie: we want\nthe client to know there is an 503 error, but on the server we don't\nrelaly care.\n\nand the hoops we've jumped through for logging are now hurting us in a\ndiffernet situation where the 503 really is a serious problem.\n\nWe have a similar situation in the ShowFileHandler where we want the\nclient to ge a 404 error, so we throw a SolrException witha 404 error,\nbut as a result Solr logs loud and ugly that a 404 error happened.\n\nI think the cleanest way to deal with this now, would be to change\nPingRequestHandler and ShowFileRequestHandler so that instead of\nthrowing a SolrException, their handleRequest methods just construct a\nnew SolrException with the appropraite status code, put that exception in\nthe SolrQueryResponse, and then return.  I think that would ypass\nthe loud conspicous logging that currently happens when exceptions are\nthrown (and would let us remove the \"ignore SERVICE_UNAVAILABLE\nexceptions\" kludge that is huring us in SolrCloud so those exceptions\nwould be logged loud and conspicuously)\n\nThis type of solution is something that we might have been able to do\nalong time ago except that it would have been complicated because of the\ndifferent code paths arround writting successful output using hte response\nwriters vs delegating error responses to the servlet container – but now\nit doesn't matter, we use the response writters either way, so i think\nitwould be relatively striaght forward (although there may be some\nvestigal \"oh no, we found an exception, we must log it\" logic in the\nrequest dispatcher that might need to be tweaked to only do that if the\nexception is thrown and not just an object in the response)",
    "attachments": {
        "SOLR-4019.patch": "https://issues.apache.org/jira/secure/attachment/12551632/SOLR-4019.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13488269",
            "date": "2012-10-31T21:53:04+0000",
            "content": "Here is an initial patch. I would like to test/review it more as this could impact many places. \nIt does sound to me that in most cases you would want Service Unavailable exceptions to be logged, the \"ping\" command is a specific case where you wouldn't. \nI couldn't find 503 exceptions in ShowFileRequestHandler.\nI intentionally left some \"Service Unavailable\" exceptions being throw in the PingRequestHandler in cases where I think ARE unexpected errors (like when trying to enable/disable without a healthcheck file defined). "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13488289",
            "date": "2012-10-31T22:06:30+0000",
            "content": "I couldn't find 503 exceptions in ShowFileRequestHandler.\n\nthe analogous situation i was refering to in ShowFileRequestHandler was when it returns 404s "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13488743",
            "date": "2012-11-01T15:09:36+0000",
            "content": "Updated patch. In the ShowFileRequestHandler I also avoid throwing the exception for the cases where the file has been intentionally hidden.\nI also think there is a bug in the log(Logger log, String msg, Throwable e) method of the SolrException. The code is:\n\n\n  public static void log(Logger log, String msg, Throwable e) {\n    if (e instanceof SolrException\n        && ((SolrException) e).code() == ErrorCode.SERVICE_UNAVAILABLE.code) {\n      log(log, msg);\n    }\n    String stackTrace = msg + ':' + toStr(e);\n    String ignore = doIgnore(e, stackTrace);\n    if (ignore != null) {\n      log.info(ignore);\n      return;\n    }\n    log.error(stackTrace);\n  }\n\n  public static void log(Logger log, String msg) {\n    String stackTrace = msg;\n    String ignore = doIgnore(null, stackTrace);\n    if (ignore != null) {\n      log.info(ignore);\n      return;\n    }\n    log.error(stackTrace);\n  }\n\n\n\nIt looks like exceptions that are logged with this method and have the code 503 are going to be logged twice (the second time with the stacktrace) where the intention was to only log the message. This patch also removes that double logging. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13489749",
            "date": "2012-11-02T21:05:47+0000",
            "content": "Tomas, your patch keeps PingRequestHandler quiet, Kludge-free.  I appreciate your pointing out SolrQueryResponse#setException, a handy method I wasn't aware of.  Your change to ShowFileRequestHandler, while unrelated, seems reasonable.  I would think that any other logging tweaks like these can be handled as they are found, right?  If you are satisfied enough for now, I will go ahead and commit this. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13489760",
            "date": "2012-11-02T21:16:11+0000",
            "content": "Your change to ShowFileRequestHandler, while unrelated, seems reasonable.\nyes, maybe this should have been implemented on a different issue.\n\nI would think that any other logging tweaks like these can be handled as they are found, right?\nAgreed. \n\n\nShould I create a patch for 4.x too? "
        },
        {
            "author": "James Dyer",
            "id": "comment-13489766",
            "date": "2012-11-02T21:29:48+0000",
            "content": "I think svn will merge this just fine so we don't need a 4.x patch.   "
        },
        {
            "author": "James Dyer",
            "id": "comment-13490771",
            "date": "2012-11-05T17:54:39+0000",
            "content": "committed.\n\nTrunk: r1405893\n4x: r1405894 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610598",
            "date": "2013-03-22T16:20:18+0000",
            "content": "[branch_4x commit] James Dyer\nhttp://svn.apache.org/viewvc?view=revision&revision=1405920\n\nSOLR-4019: Fix tests that are invalid due to logging change "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610599",
            "date": "2013-03-22T16:20:23+0000",
            "content": "[branch_4x commit] James Dyer\nhttp://svn.apache.org/viewvc?view=revision&revision=1405913\n\nSOLR-4019:  Ignore tests that are invalid due to logging change "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610600",
            "date": "2013-03-22T16:20:29+0000",
            "content": "[branch_4x commit] James Dyer\nhttp://svn.apache.org/viewvc?view=revision&revision=1405894\n\nSOLR-4019:  Log 503 stack traces unless from PingRequestHandler.  Suppress logging some stack traces with ShowFileRequestHandler. "
        }
    ]
}