{
    "id": "SOLR-4409",
    "title": "Collection creation should succeed if number of shards == number of nodes, regardless of replicationFactor.",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I was expecting that manually calling the Collections API to create a collection with the replicationFactor set to a value higher than numShards/number of nodes would create the collection with no replicants and cap the overall possible number of replicants when the cluster grows larger.\n\nInstead I received this message:\n\n\"SEVERE: Cannot create collection $foo. Value of maxShardsPerNode is 1, and the number of live nodes is 3. This allows a maximum of 3 to be created. Value of numShards is 3 and value of replicationFactor is 2. This requires 6 shards to be created (higher than the allowed number)\"\n\nNot sure what the thinking behind this is, and maybe I'm just not getting it, but I would assume collection creation would succeed if the collection is a valid collection.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13572727",
            "date": "2013-02-06T19:38:47+0000",
            "content": "This is expected behavior. Specifying a greater number of replicas per node allows you to micro shard for future machine expansion - we just require that you are explicit about wanting that and force you to pass maxShardsPerNode.\n\nWe don't currently let you pass a larger number and auto expand as you add new machines. To add a new core on a new machine, just use the core admin api or preconfigure the core in solr.xml to join as new replica. "
        },
        {
            "author": "Michael Della Bitta",
            "id": "comment-13573647",
            "date": "2013-02-07T16:27:37+0000",
            "content": "OK, understood, thanks! "
        }
    ]
}