{
    "id": "SOLR-4546",
    "title": "Separate global/zookeeper info in solr.properties / solr.xml into its own config file",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I know that solr.xml is due to be replaced by solr.properties soon, so I will say solr.* and you can use whatever extension makes sense.\n\nThere is a small but very important amount of information in solr.* that doesn't specifically have to do with the cores that are local to that server.  With the advent of SolrCloud, the amount of such \"global\" information has grown, though it is still relatively small.\n\nIf you want to change these \"global\" options (or you have config files in git/svn), you can't just copy solr.* from one system to another, because that's where cores specific to that server are defined.\n\nI would like to continue to have these options work if they are in solr.*, but have an additional file for global options, with a filename prefix like global, solrglobal, globalsolr, solrcommon, ... whatever bikeshedding comes up with.  That way you could put zkHost, lib, and other things that will be common to all servers in the new file, and put machine-specific things like host and port in solr.*.  Any setting in solr.* would replace the global setting, so you could put port in either file.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13597472",
            "date": "2013-03-08T19:51:27+0000",
            "content": "In SOLR-4083, Erick asked me to raise this issue and assign it to him. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13631393",
            "date": "2013-04-14T21:09:39+0000",
            "content": "Shawn Heisey Mark Miller Since all of the parameters in solr.xml should be overridable via system properties, it seems like there's already a way to do this without the added complication of another config file. I'm inclined to close this \"won't fix\".\n\nI'm not dead set against this, but I don't see the need either and am trying to wrap up this migration. If someone wants to pick this up they should feel free. Mostly I wanted Shawn to assign it to me so it didn't get lost, but upon further reflection I don't think I have any investment in carrying this forward. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13631403",
            "date": "2013-04-14T21:36:35+0000",
            "content": "If it's just system properties, I think there is room for improvement in accepting a known properties file (much like core.properties?) or does that work already, like solrconfig.xml does?\n\nNot only does it let you keep config out of your scripts, it lets you specify this stuff in a non global way. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13632963",
            "date": "2013-04-16T16:21:31+0000",
            "content": "Shawn Heisey Mark Miller Moving the \"what to do with solr.xml\" conversation to SOLR-4718 "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636847",
            "date": "2013-04-19T20:35:25+0000",
            "content": "Erick Erickson can this issue be closed now?\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13655185",
            "date": "2013-05-11T07:27:09+0000",
            "content": "I think this issue is probably unnecessary, the work of moving cores out of solr.xml has happened elsewhere. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717296",
            "date": "2013-07-23T18:47:46+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13754762",
            "date": "2013-08-30T15:00:44+0000",
            "content": "This is superseded by various other changes to solr.xml format and auto-discovery. "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787040",
            "date": "2013-10-05T10:18:53+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}