{
    "id": "SOLR-3895",
    "title": "For several reasons, disabling the resolving of external entities within the Solr UpdateRequestHandler for XML would be good.",
    "details": {
        "affect_versions": "3.6.1,                                            4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The Solr UpdateRequestHandler for XML currently resolves so-called XML External Entities. Not resolving XML External Entities would - among other things - improve Solr's update performance.",
    "attachments": {
        "SOLR-3895.patch": "https://issues.apache.org/jira/secure/attachment/12546667/SOLR-3895.patch",
        "SOLR-3895+3614.patch": "https://issues.apache.org/jira/secure/attachment/12546761/SOLR-3895%2B3614.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Uwe Schindler",
            "id": "comment-13463630",
            "date": "2012-09-26T08:50:03+0000",
            "content": "Hi Martin,\nthanks for your report after our communication about this before. I agree, it would be a good idea to not allow external entities (those can be e.g., references to external DTDs - but we never check XML validity according to a DTD) and also other external entities like &foobar; introduced by those DTDs should not be loaded:\n\n\n\tLot's of XML files come with a DTD declaration (like XHTML document or similar things). If you would pass those XML documents through the update handler (with e.g. XSL transforming to Solr XML), those DTDs would be resolved and loaded by the xml parser - with no use for Solr.\n\tAll documents passed to XMLRequestHandler should be self-complete, means no includes or similar things. xinclude is not enabled for XML-updates, so external entities should also be ignored.\n\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13463634",
            "date": "2012-09-26T08:56:02+0000",
            "content": "Patch. This approach adds a generic EntityResolver for SAX and StaX parsers that can be used also outside XMLUpdateReqHandler, e.g. in DIH. It resolves all external entities to an empty InputStream. By this XMLUpdater ignores external entities like DTDs or entity declarations (&foobar;) and ignores them.\n\nThe downside by this is, that XML documents that actually make use of these features to include some external stuff would silently ignore those &foobar; entities. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13464016",
            "date": "2012-09-26T18:20:35+0000",
            "content": "Arguably this is a feature (using entity includes to split up files and manage updates) – but since it's never one we advertised, and can cause Solr to fetch external URLs like DTD that aren't needed, I agree it should either be off or configurable and off by default (we can worry about that if anyone asks for it)\n\nOne thing we should worry about though is ensuring that named entities still work (because we've definitely seen users take advantage of those) ... i've updated Uwe's patch with a test to ensure we don't break that. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464033",
            "date": "2012-09-26T18:32:33+0000",
            "content": "Thanks Hoss for the test! We should add the same one for XSLReqHandler (because it uses other parser).\n\nIf a user requests this feature, we can enable in a later issue. But then also xinclude should be enabled. Any other opinions? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464040",
            "date": "2012-09-26T18:36:14+0000",
            "content": "Hoss: I can extend the patch to also take care of DIH (SOLR-3614). Instead of the static initializer in SOLR-964, it should call the helper method in the resolver to configure the EnityResolver for DIH's StaX parser! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13464135",
            "date": "2012-09-26T20:15:59+0000",
            "content": "If a user requests this feature, we can enable in a later issue. But then also xinclude should be enabled. Any other opinions?\n\nNope, like i said: we can worry about the detials of making it configurable if/when anyone asks for it.\n\nI can extend the patch to also take care of DIH (SOLR-3614)\n\ni figured maybe we could - but we can also worry about it in that issue after this one gets commited, whatever you think is easier.\n\nWe should add the same one for XSLReqHandler (because it uses other parser).\n\ngood call – i updated the patch to test that named entities still work in XSL transformed docs & stylesheets, and they do.  But this lead me to discover that SYSTEM entities in the xsl docs (aparently) aren't being ignored, so with the patch attached (trying to refer to a bogs file fro mthe XSL) you get a stylesheet compilation error – so i think maybe there is still a code path missing the use of your new EmptyEntityResolver?  (either that or i've just got a silly bug in the stylesheet that isn't obvious to me) "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464151",
            "date": "2012-09-26T20:40:56+0000",
            "content": "But this lead me to discover that SYSTEM entities in the xsl docs (aparently) aren't being ignored, so with the patch attached (trying to refer to a bogs file fro mthe XSL) you get a stylesheet compilation error – so i think maybe there is still a code path missing the use of your new EmptyEntityResolver?\n\nThe XSL stylesheets are loaded by SolrResourceLoader like config files,... All those files use external entities (and SolrResourceLoader has an own EntityResolver to support xinclude and external entities -> it resolves external entities and xincludes using ResourceLoader, too) -> different story. This patch is about disabling entities for loaded documents, not for config files like solrconfig.xml, schema.xml or the transformation. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464188",
            "date": "2012-09-26T21:35:13+0000",
            "content": "Finally: the new patch is fine, I would just revert the changes in the XSL file, this is unrelated to this issue. of course value of \"zippy_s\" is then not \"plop\".  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13464206",
            "date": "2012-09-26T21:46:34+0000",
            "content": "yeah .. that was a brain fart.  \n\nI fixed the test, commit when ready. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464223",
            "date": "2012-09-26T21:59:29+0000",
            "content": "\n+<!-- DOCTYPE is used test that external entities are not resolved, but named entities are -->\n\n\n\nThis should be: \"DOCTYPE is used to test that named entities are resolved\". Or better: revert the whole XSL...\nThere is already a test that explicitely tests external entities for XSLs  You find the test and the entity in TestXSLTResponseWriter and related files. So the whole test with adding entities to the XSL is separately handled, we can undo the XSL change. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464249",
            "date": "2012-09-26T22:25:25+0000",
            "content": "Patch for this issue and SOLR-3614. I removed the changes in the XSL, as this is already tested in a separate test case.\n\nI think it's ready to commit. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464255",
            "date": "2012-09-26T22:37:54+0000",
            "content": "New patch that also includes Hossmans testcase from SOLR-3614.\n\nBy the way, this patch also makes the StAX factory thread safe like in XMLUpdater. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13464599",
            "date": "2012-09-27T10:13:30+0000",
            "content": "Committed trunk revision: 1390921\nCommitted 4.x revision: 1390924 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610740",
            "date": "2013-03-22T16:31:19+0000",
            "content": "[branch_4x commit] Uwe Schindler\nhttp://svn.apache.org/viewvc?view=revision&revision=1390999\n\nMerged revision(s) 1390991 from lucene/dev/trunk:\nSOLR-3895, SOLR-3614: Fix javadocs "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610742",
            "date": "2013-03-22T16:31:38+0000",
            "content": "[branch_4x commit] Uwe Schindler\nhttp://svn.apache.org/viewvc?view=revision&revision=1390924\n\nMerged revision(s) 1390921 from lucene/dev/trunk:\nSOLR-3895, SOLR-3614: XML and XSLT UpdateRequestHandler should not try to resolve external entities; fix XML parsing in XPathEntityProcessor to correctly expand named entities, but ignore external entities "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13836490",
            "date": "2013-12-02T13:13:15+0000",
            "content": "Commit 1547011 from Uwe Schindler in branch 'dev/branches/lucene_solr_3_6'\n[ https://svn.apache.org/r1547011 ]\n\nSOLR-5520: Backports of:\n\n\tSOLR-4881 (Fix DocumentAnalysisRequestHandler to correctly use EmptyEntityResolver to prevent loading of external entities like UpdateRequestHandler does)\n\tSOLR-3895 (XML and XSLT UpdateRequestHandler should not try to resolve external entities)\n\tSOLR-3614 (Fix XML parsing in XPathEntityProcessor to correctly expand named entities, but ignore external entities)\n\n "
        }
    ]
}