{
    "id": "SOLR-2100",
    "title": "Fix for saving commit points during java-based backups",
    "details": {
        "affect_versions": "1.4,                                            1.4.1",
        "status": "Closed",
        "fix_versions": [
            "1.4.2",
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "This patch fixes the saving of commit points during backup operations.\n\nThis fixes the perviously commited (for 1.4) SOLR-1475 patch.\n\n1. In IndexDeletionPolicyWrapper.java, commit points are not saved to the 'savedCommits' map.\n2. Also, the testing of the presence of a commit point uses the contains() method instead of containsKey().\n\nThe result of this means that backups for anything but toy indexes fail, because the commit points are deleted (after 10s) before the full backup is completed.\n\nThis patch addresses these 2 issues.\n\nTested with 1.4.1 release trunk, but should also work fine with 1.4.",
    "attachments": {
        "SOLR-2100.PATCH": "https://issues.apache.org/jira/secure/attachment/12453803/SOLR-2100.PATCH"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12906408",
            "date": "2010-09-06T00:50:58+0000",
            "content": "Thanks for the patch Peter!  Such a small patch... but I've been trying to puzzle out all of the possible ramifications (and going back to puzzle through some of the replication code).\n\nsaveCommitPoint() (which obviously did nothing before this) is called in the postCommit (and postOptimize) events.\nThis doesn't even seem necessary for replication, since SolrDeletionPolicy always saves the last commit point and the last optimized point (if configured to do so, or if replicate on optimize is configured).  Once replication has started, a reservation scheme is used rather than saving a commit point forever.\n\nAlso, if one configures replication onCommit and onOptimize, then the event callback code has some bugs: both refer to indexCommitPoint, and close the previous one.  So if we did rely on saveCommitPoint, a commit after an optimize would release the optimized commit point. "
        },
        {
            "author": "Peter Sturge",
            "id": "comment-12906497",
            "date": "2010-09-06T12:22:41+0000",
            "content": "I'm not really familiar with the reservation code for replication, but will it still save the commit point for replication even if another commit (or many commits) come along during replication?\n\nBy default, it would probably be rare, as the data to be replicated is only a delta and would likely not take too long to complete.\nThis was the problem with backups - it's a full file copy of everything, which typically takes minutes on large indexes - longer if writing to a remote volume. \n\nAs the replication timing is configurable, you could have a scenario where the amount of data to be replicated is very significant, and is generally remote, so could take some time to complete. Would the reserveration mechanism still hold the commit point if 1,2, 5 or 10 commits came along during the replication process?\n\nReplicationHandler.postCommit() calls saveCommitPoint()/releaseCommitPoint(), so as things stand this would preserve the commit point even if a separate reserveration didn't, and there's no price to pay for holding the indexVersion in this way.\n\nNot sure what the standard policy is for marking issues Resolved/Closed, so I'll leave this up to you. But do let me know if you'd like me to perform any additional testing. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12906505",
            "date": "2010-09-06T13:22:06+0000",
            "content": "but will it still save the commit point for replication even if another commit (or many commits) come along during replication? \n\nYes.... that's what the reservation system is for.  When someone asks us for the current  index version, we reserve that version for some amount of time and return that.  When the client is retrieving a file, they also specify what index version it is for so we can periodically renew the reservation during streaming back.\n\nIf we didn't use a reservation system, a client could ask for the index version, die, and then we would save it forever. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12906551",
            "date": "2010-09-06T17:49:49+0000",
            "content": "OK, I've fixed this in 4.x, 3.x, and 1.4.x "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013095",
            "date": "2011-03-30T15:45:31+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}