{
    "id": "SOLR-3980",
    "title": "Incorporate lazily-loaded cores into core listings for clients",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "components": [
            "Admin UI",
            "multicore"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Part of SOLR-1293 (supporting lots of cores) will require we do something to allow clients (particularly the admin GUI) to get a full list of all possible cores, whether they've been loaded or not.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13482371",
            "date": "2012-10-23T14:52:11+0000",
            "content": "Breaking this out of SOLR-880 to track separately "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13486533",
            "date": "2012-10-30T00:02:41+0000",
            "content": "In looking at this a bit more, the only way that currently exists to get a list of cores is to do a core admin STATUS command. Unfortunately, that loads all the cores and in the case where there are a large number of them, this will be unacceptable.\n\nI propose a new core admin command LIST that will return a simple listing of the cores, just the name. The Admin UI will need to use this to display the actual list, then make a STATUS request when the user is drilling down....\n\nI suppose another solution would be an extra parameter for STATUS, namesOnly=true or some such, but I don't really like that, although I'd be willing to be persuaded otherwise. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13486540",
            "date": "2012-10-30T00:14:33+0000",
            "content": "Why should STATUS force a core load - in the world of lazily loaded cores? I would think that STATUS should be changed to indicate that a core might not be loaded. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13486568",
            "date": "2012-10-30T00:57:51+0000",
            "content": "Duh, because it's late and I didn't think of it? But I think you're right, that would make more sense. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13487170",
            "date": "2012-10-30T20:00:50+0000",
            "content": "OK, this is really done as part of SOLR-1306. Lazily-loaded cores get returned with the usual STATUS listing. Do note, however, that for the case of a core that could be loaded but hasn't yet been loaded (or has aged out of the cache), only a subset of data is returned. All that can be relied on is\n\"name\", \"isDefaultCore\", and \"instanceDir\".\n\nAdditional entries if the provider supplies them are:\n\"dataDir\", \"config\", \"schema\".\n\nAdditionally, the STATUS command will return an additional value called isLoaded (\"true\"|\"false\") that can be used to determine what data set to expect. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13554295",
            "date": "2013-01-15T20:34:19+0000",
            "content": "Erick, can this issue be resolved? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13554306",
            "date": "2013-01-15T20:44:34+0000",
            "content": "Same as SOLR-1533, I'll resolve all this stuff as a bunch for 4.2\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13554313",
            "date": "2013-01-15T20:48:35+0000",
            "content": "Same as SOLR-1533, I'll resolve all this stuff as a bunch for 4.2\n\nOk, thanks, I've pushed Fix Version to 4.2. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13561580",
            "date": "2013-01-24T12:16:33+0000",
            "content": "Talking with Stefan, it seems like the right thing to do is make the admin STATUS command return all cores, loaded and unloaded. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13633302",
            "date": "2013-04-16T20:26:26+0000",
            "content": "This has been fixed for a while, see SOLR-1533 for instance. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653914",
            "date": "2013-05-10T10:33:23+0000",
            "content": "Closed after release. "
        }
    ]
}