{
    "id": "SOLR-4890",
    "title": "remove /non/existent/dir/yields/warning from example to eliminate automatic warning for new users",
    "details": {
        "affect_versions": "4.3",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "Admin UI",
            "scripts and tools"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I just did a fresh install of Solr 4.3.0 twice. Both times, the default build yielded this in Logging:\n\nCan't find (or read) directory to add to classloader: /non/existent/dir/yields/warning (resolved as: /non/existent/dir/yields/warning).\n\n\nThis appears to come from line 87 in solrconfig.xml for collection1, which I think is supposed to be commented out. Or maybe it has some other purpose. Either way, the comments in that file, at least regarding this line, are totally unhelpful.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13672818",
            "date": "2013-06-03T04:48:22+0000",
            "content": "Previous Solr versions would silently ignore lib directories that didn't exist, and the ignored entry at the time had an expletive in it.  With the newest version, it issues a warning.  The line is purposely not commented, and the reason is encoded right in it's name - it doesn't exist, which gives you a warning.  The log entry is at the WARN level, it's not an error.\n\nIt could be argued that this should not be uncommented in the config, but it is not an error and doesn't prevent startup, it's there to illustrate what happens with a non-fatal misconfiguration. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13672820",
            "date": "2013-06-03T04:56:13+0000",
            "content": "Additional note: This is something that should have been brought up on the solr-user mailing list.  You might not have known about the mailing list.  I'll let one of the more experienced committers decide whether this should be considered a valid bug, and close it if not. "
        },
        {
            "author": "Aaron Greenspan",
            "id": "comment-13675284",
            "date": "2013-06-04T21:36:21+0000",
            "content": "I don't mean to be inflammatory, but I find this pretty shocking. The mentality that users should be warned (literally, here) up-front as to what consequences may follow if they screw up is perhaps the most backwards and heavy-handed approach to UX I've ever encountered. Even Microsoft, in the worst of its mid-90s products, did not intentionally insert warnings and/or errors that did not have to be there.\n\nA fresh build of a software product should not throw any warnings or errors when its default configuration is set up. If the user eventually encounters an error due to a misconfiguration (which I've noticed with Solr seems to be just about everything I do), then the error should help the user determine not only what went wrong, but how to fix it as well. Ideally, the product should be designed to prevent such misconfigurations from ever occurring.\n\nFor the potential philosophical discussion that could be had on this matter I'll check out the mailing list, but as far as line 87 in solrconfig.xml, I think that it's a legitimate issue worthy of a bug report. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13675345",
            "date": "2013-06-04T22:17:52+0000",
            "content": "the comments in that file, at least regarding this line, are totally unhelpful.\n\nPatches welcome! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13678605",
            "date": "2013-06-08T00:05:44+0000",
            "content": "A fresh build of a software product should not throw any warnings or errors when its default configuration is set up.\n\nIt's he behavior that arises from running a specific example configuration, which has evolved over time but tries to walk a fine line between being useful to everyone as is, but also showing what is possible.\n\nHaving said that – i agree with you. That line existed initially to specifically show off a feature of how lib's were loaded.  when the behavior was changed in SOLR-4653 to remove that feature and cause a wanring to be logged, the corrisponding example should have been commented out.  I suspect that was just an oversight.\n\ni think at this point we should just remove that, and move the comment about the warning up higher in the file wher the concept of <lib/> is introduced. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13678631",
            "date": "2013-06-08T00:54:48+0000",
            "content": "Committed revision 1490889.\nCommitted revision 1490891. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716805",
            "date": "2013-07-23T18:38:38+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}