{
    "id": "SOLR-3753",
    "title": "Core admin and solr.xml documentation for 4.0 needs to be updated for 4.0 changes",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The existing documentation on Solr Cores needs to be updated to reflect changes in Solr 4.0\n\nIf having at least one solr core declared is mandatory for Solr 4.0, that needs to be stated in the release notes, in the example solr.xml file, and on the wiki page for CoreAdmin. http://wiki.apache.org/solr/CoreAdmin.\n\nIn the absence of a solr.xml file, current 4.0 behavior is to use defaults declared in  CoreContainer.java.  This needs to be documented; probably in solr.xml and/or on the CoreAdmin page.  (See line 94 of CoreAdmin.java where the default name \"collection1\" is declared.  Without this documentation, users can get confused about where the \"collection1\" core name is coming from. (I'm one of them).\n\nThe solr.xml file states that paths are relative to the \"installation directory\" This needs to be clarified.  In addition it appears that currently relative paths specified using \".\" or \"..\" are interpreted as string literals.  If that is not a bug, than this behavior needs to be documented.  If it is a bug, please let me know and I'll open another issue.\n\nThe  example/solr/README.txt  Needs to clarify which files need to be in Solr Home and which files are mandatory or optional in the directories containing configuration files (and data files) for Solr cores.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13457178",
            "date": "2012-09-17T17:38:24+0000",
            "content": "I'm pretty sure i dealt with all of these in SOLR-3288.\n\nThe one comment i'm not clear on is this...\n\nIn addition it appears that currently relative paths specified using \".\" or \"..\" are interpreted as string literals. If that is not a bug, than this behavior needs to be documented. If it is a bug, please let me know and I'll open another issue.\n\nI'm not sure what you mean by \"interpreted as string literals\" ... I just did some testing and confirmed that relative paths seemed to work properly – perhaps your confusion is paths are displayed as strings (ie: in log messages or in the Admin UI).  If you specify an absolute path, then you see the absolute path.  but if you specify a relative path, then you see the base path compbined with the relative path prior to resolving it to an asolute path, so the user can see exactly how therelative path they specified is being used.  for example, this is in the logs from my testing...\n\n\nINFO: [other] Opening new SolrCore at solr/../../../../src-tgz/apache-solr-4.0.0-BETA/solr/example/solr/collection1/, dataDir=solr/../../../../src-tgz/apache-solr-4.0.0-BETA/solr/example/solr/collection1/data/\n\n\n\nin this case i configured a core with the instanceDir of \"../../../../src-tgz/apache-solr-4.0.0-BETA/solr/example/solr/collection1/\" and i can see from the log that relative instanceDir is being resolved against the solr home dir of \"solr/\".  This is how solr has reported file paths for a long time, i believe it was a conscious choice made so that people could always know/understand how a final path was chosen.\n\nIf this isn't what you ment, and you are seeing some other bug related to relative paths, please open an issue with a specific example. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653868",
            "date": "2013-05-10T10:33:14+0000",
            "content": "Closed after release. "
        }
    ]
}