{
    "id": "SOLR-53",
    "title": "Allow symbolic links and rsync over ssh in snap scripts",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Our index directories are symbolic links to a shared location because we use capistrano to deploy our Ruby on Rails application.  This caused problems with snappuller and snapinstaller, so I added the -L option to the find command to make it work.\n\nI also modified snappuller to rsync over ssh, which means there is no need to run the rsync daemon - one less service to run.\n\nI will attach the patch.",
    "attachments": {
        "symbolic_links_and_rsync_over_ssh.diff": "https://issues.apache.org/jira/secure/attachment/12342760/symbolic_links_and_rsync_over_ssh.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lee Marlow",
            "id": "comment-12441583",
            "date": "2006-10-11T23:11:47+0000",
            "content": "Here is the patch. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12441716",
            "date": "2006-10-12T12:31:24+0000",
            "content": "The \"-L\" option to find isn't univeral to all versions of Unix/Linux.  For example,\nit doesn't exist for the find in RedHat Enterprise Linux 4.\n\nOur performance testing shows that using ssh instead of rsyncd slows down the file transfer by about 30%.  So the use of ssh should be optional for users where performance is important. "
        },
        {
            "author": "Lee Marlow",
            "id": "comment-12441778",
            "date": "2006-10-12T15:53:06+0000",
            "content": "I was wondering whether -L was available everywhere.  It worked on our Macs and Fedora Core 5 boxes, so I was just hoping it would be close enough to universal.\n\nRsync over ssh works fine for us as our index isn't that large, 10-20 MB. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12766704",
            "date": "2009-10-16T21:07:41+0000",
            "content": "Reading the comments it seems we are not able to support this across platforms. The Java based replication should be able to work with a symbolic link to the index directory. Closing this issue for now, we can open this again if needed. "
        }
    ]
}