{
    "id": "SOLR-5016",
    "title": "Spatial clustering/grouping",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "spatial"
        ],
        "type": "Wish",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Hi,\n\nIt would be great if we could have some sort of spatial clustering/grouping of points for efficiently plotting them on a map.\n\nI could think of clustering based on the following parameters:\n\n\tBased on regions: continents, countries, statis, cities, etc;\n\tA fixed number of clusters;\n\tRadius, bbox, polygon\n\n\n\nRetrieved result would give the center of the cluster, average location or a polygon of the cluster.\n\nAn example of a usecase would be something like this:\nhttps://developers.google.com/maps/articles/toomanymarkers#markerclusterer\n\nJeroen",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13704553",
            "date": "2013-07-10T13:40:05+0000",
            "content": "FWIW I plan to do grid based faceting / heat map in the near-ish future (by October?).  I'll try to keep clustering in mind, that is leave a spot where that could be layered in – but I don't plan on doing clustering.\n\nRegion based clustering in particular is straight-up field value faceting.  It obviously requires that you extracted the containing country at ingest into a separate field. "
        },
        {
            "author": "Jeroen Steggink",
            "id": "comment-13706942",
            "date": "2013-07-12T13:50:25+0000",
            "content": "Grid based faceting is also a kind of clustering, though not dynamic, but fixed, and would be a great addition to the spatial features.\n\nRegion based clustering could indeed be solved by field value faceting on terms. However, if it wouldn't be based on terms but based on polygons it would be something different. I haven't yet tried to create facet queries based on BBOXs. "
        }
    ]
}