{
    "id": "SOLR-3866",
    "title": "CoreAdmin SWAP and RENAME need fixed/defined when using SolrCloud",
    "details": {
        "affect_versions": "4.0-ALPHA,                                            4.0-BETA,                                            4.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "We need to define what the expected behavior of using the CoreAdminHandler's SWAP and RENAME commands is if you are running in SolrCloud mode.\n\nAt the moment, it seems to introduce a disconnect between which \"collection\" the SolrCore thinks it's a part of (and what appears in the persisted solr.xml) vs what collection ZooKeeper thinks the SolrCore(s) that were swaped/renamed are a part of.  We should either \"fix\" this, or document it if it as actually consistent and intentional for low level controls, or disable commands like SWAP/RENAME in SolrCloud mode\n\nhttps://mail-archives.apache.org/mod_mbox/lucene-solr-user/201209.mbox/%3CCALB4QrP2GZAwLeAiy%3DfcmOLYbc5r0i9Tp1DquyPS8mMJPwCgnw%40mail.gmail.com%3E",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan Josal",
            "id": "comment-13496352",
            "date": "2012-11-13T17:25:57+0000",
            "content": "The use case I (and it appears the author of the instigating thread for this issue: http://osdir.com/ml/solr-user.lucene.apache.org/2012-09/msg00893.html) have for CoreAdmin SWAP is to support a backup core (on deck core) that I can rebuild the index from scratch on. "
        },
        {
            "author": "André Bois-Crettez",
            "id": "comment-13510524",
            "date": "2012-12-05T15:11:12+0000",
            "content": "We have a similar use case too, detailed here http://mail-archives.apache.org/mod_mbox/lucene-solr-user/201212.mbox/%3C50BDF33C.6060203%40kelkoo.com%3E\nI understand that CoreAdmin SWAP should first be made to work consistently with ZooKeeper, but then using the collections API for a SWAP rather than lower level CoreAdmin would be even simpler to use.\n\n\nAssumptions:\n\n\t'collection_main' and 'collection_temp' are configured in the same way, but can contain different documents.\nFor example, each solr instance in the SolrCloud have both main and temp collections, sharding is done the same way, etc.\n\n\n\n\n\tIt is not a problem if the SWAP can take some time to be taken into account across all the solr instances.\nUntil the whole SolrCloud has swapped, some queries may show some docs with the old main index, and some docs with the new main, but this is acceptable.\n\n\n\n\nSo the ideal scenario would be :\n\nwe would like that search clients always query the main collection :\nhttp://hostname:8983/solr/collection_main/select?...\n\n1) on our indexing process, we nominally update the same main collection :\nhttp://hostname:8983/solr/collection_main/update?...\n\nbut when we need a full recovery of the index, ie. remove every document and re-index everything, we can not do that on collection_main as search clients will miss documents until the recovery is completed.\n\n2) So during a recovery, the indexing process will now work on a temp collection :\nhttp://hostname:8983/solr/collection_temp/update?... <delete><query>:</query></delete>\nhttp://hostname:8983/solr/collection_temp/update?... <add><doc> ....</add>\nhttp://hostname:8983/solr/collection_temp/update?... <commit/>\n\n3) When we are ready to make this new index available to search clients, the indexing process could trigger this with a swap :\nhttp://hostname:8983/solr/admin/collections?action=SWAP&name=collection_temp&other=collection_main\n\nNow we are back to the situation in 1)\n\n\n\nCurrently in solr-4.0.0, a CoreAdmin SWAP messes the clusterstate in Zk (clearly visible in a setup with 2 shards and 2 replicas), how can we move toward a solution ?\nPlease ask if more information is needed. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13565664",
            "date": "2013-01-29T19:10:47+0000",
            "content": "I wanted to use the RENAME feature so that the core could match a predictable name for its shard no matter which machine is hosting the shard.  This is to work-around the fact that pivot faceting isn't distributed and so I query each shard and merge, as a work-around.  Boy was using the RENAME a mistake as my collection was hosed, especially after I tried to rename the leader's core.  My attempts to delete the collection via the API failed (or at least didn't succeed within the few minutes I gave it).  So I wound up reconfiguring all my collections and related config from scratch    (on Solr 4.1) "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565687",
            "date": "2013-01-29T19:26:23+0000",
            "content": "Seems we should disable these when using SolrCloud as a first step then - that only takes a moment. Then work on adding further functionality. "
        },
        {
            "author": "André Bois-Crettez",
            "id": "comment-13566284",
            "date": "2013-01-30T08:25:07+0000",
            "content": "I have the impression that when a CoreAdmin rename/swap occurs, it is somehow communicated across the whole cloud and messes up the Zk conf (I have not yet been able to trace exactly what happens).\n\nWild guess, but what if the CoreAdmin rename/swap is \"silent\" and only have an effect on the actual shard being addressed ? That means manually sending a rename/swap for each shard to properly change a distributed collection, but it may be cleaner this way ? "
        },
        {
            "author": "wolbi",
            "id": "comment-13566408",
            "date": "2013-01-30T12:09:09+0000",
            "content": "Mark: could you indicate some way to release new indexes in SolrCloud, for example I made some changes in schema.xml and need to reindex collection. Thanks "
        },
        {
            "author": "VIshvendra Singh",
            "id": "comment-14723541",
            "date": "2015-08-31T15:24:30+0000",
            "content": "any Updates on this? I need to re-index the solr Core and then swap it. Is there a Collection API for it? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14723622",
            "date": "2015-08-31T16:19:29+0000",
            "content": "Hmm, the Collections API CREATEALIAS command handles all of the use cases for this functionality I believe. I'll assign this to myself and close it in a day or two unless someone points out cases that aren't covered by the Collections API calls. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539903",
            "date": "2016-10-02T07:05:16+0000",
            "content": "Was marked for closure a year ago. No objections were raised. "
        }
    ]
}