{
    "id": "SOLR-3795",
    "title": "/admin/luke?show=schema is returning raw toString of SchemaField and CopyField objects for \"copyDests\" and \"copySources\"",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "While looking into SOLR-3734 i noticed that the LukeRequestHandler is blindly putting arrays of CopyField and SchemaField objects in the response, when returning copy from/to info, which are then getting written out using their toString.\n\nsteffkes seems to have done a great job of parsing the field name out of the SchemaField.toString, but the CopyField.toString info is useless – and clients shouldn't have to do special string parsing to pull out this info.\n\nI think we should just fix both of these arrays to just be the simple string values that they were most likely intended to be",
    "attachments": {
        "SOLR-3795.patch": "https://issues.apache.org/jira/secure/attachment/12543968/SOLR-3795.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13449345",
            "date": "2012-09-06T01:31:52+0000",
            "content": "discovered a slightly larger problem dealing with dynamic copyFiels that i spun off into SOLR-3798 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13449347",
            "date": "2012-09-06T01:39:23+0000",
            "content": "patch that fixes LukeRequestHandler to return just the names for copyDests and copySources and includes a test case (part of which is commented out because of SOLR-3798)\n\namazingly: this change doesn't totally break the admin ui, which leads me to believe steffkes is even more awesome then i realized, and must have made it assume the strings re field names it if can't \"parse\" them using the bogus absurd \"toString\" format.\n\nI consider this a bug fix, and would definitley like to commit unless stefkes says that it does in fact break the UI in some way i'm not yet realizing.\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13449691",
            "date": "2012-09-06T14:01:37+0000",
            "content": "Perfectly fine Hoss, go ahead! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13449850",
            "date": "2012-09-06T17:41:05+0000",
            "content": "Committed revision 1381685. 4x\nCommitted revision 1381691. trunk "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610904",
            "date": "2013-03-22T16:43:20+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1381691\n\nSOLR-3795: Fixed LukeRequestHandler response to correctly return field name strings in copyDests and copySources arrays (merge r1381685) "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653834",
            "date": "2013-05-10T10:33:07+0000",
            "content": "Closed after release. "
        }
    ]
}