{
    "id": "SOLR-12854",
    "title": "Document steps to improve delta import via DataImportHandler",
    "details": {
        "type": "Improvement",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "7.5"
    },
    "description": "Delta imports in DataImportHandler is sometimes slower than full imports where the delta import makes multiple queries compare to full import and hence making it time complex. Listed in: https://wiki.apache.org/solr/DataImportHandlerDeltaQueryViaFullImport\n\nIn the mailing list; http://lucene.472066.n3.nabble.com/Number-of-requests-spike-up-when-i-do-the-delta-Import-td4338162.html one of the Solr users have noted a workaround which works perfectly and improves delta import performance, where we need to specify ${dataimporter.last_index_time} in the delta_import_query, and not delta_query.\n\n\nI found a hacky way to limit the number of \ntimes deltaImportQuery was executed.\n\nAs designed, solr executes deltaQuery to get a list of ids that need to be indexed. For each of those, it executes deltaImportQuery, which is typically very similar to the full query.\n\nI constructed a deltaQuery to purposely only return 1 row. E.g.\n\ndeltaQuery = \"SELECT id FROM table WHERE rownum=1\" // written for \noracle, likely requires a different syntax for other dbs. Also, it occurred \nto you could probably include the date>= '${dataimporter.last_index_time}' \nfilter here so this returns 0 rows if no data has changed\n\nSince deltaImportQuery now *only gets called once I needed to add the filter logic to *deltaImportQuery *to only select the changed rows (that logic is normally in *deltaQuery). E.g.\n\ndeltaImportQuery = [normal import query] WHERE date >= \n'${dataimporter.last_index_time}'\n\n\n\nA number of other users have adopted the strategy and DIH delta import performance has improved, and henceforth documenting this strategy as TIP will help other users too.",
    "attachments": {},
    "issue_links": {},
    "comments": []
}