{
    "id": "SOLR-6034",
    "title": "Use a wildcard in order to delete fields with Atomic Update",
    "details": {
        "affect_versions": "4.7",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As discussed on the SOLR user group, it would a great feature to be able to remove all fields matching a pattern, using Atomic Updates.\n\nExample:\n<add><doc>\n  <field name=\"id\">100</field>\n  <field name=\"*_day_i\" update=\"set\" null=\"true\"></field>\n</doc></add>\n\nThe *_day_i should be expanded server-side and all fields matching this pattern should be removed from the specified document.\n\nWorkaround: When removing fields from a document, we can make a query to SOLR from the client, in order to see what fields are actually present for the specific document. After that, we can create the XML update document to be sent to SOLR. However, this is going to increase the number of queries to SOLR and for large amount of documents this is going to weigh pretty much. It would be great performance-wise and simplicity-wise to be able to provide wildcards.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Constantin Muraru",
            "id": "comment-13984754",
            "date": "2014-04-29T20:39:42+0000",
            "content": "Let me provide a better example. Suppose we have documents like this:\n\n<doc>\n<field name=\"id\">100</field>\n<field name=\"2_1600_i\">1</field>\n<field name=\"5_1601_i\">5</field>\n<field name=\"112_1602_i\">7</field>\n</doc>\n\nThe schema looks the usual way:\n<dynamicField name=\"*_i\"  type=\"int\"    indexed=\"true\"  stored=\"true\"/>\nThe dynamic field pattern I'm using is this: id_day_i.\n\nEach day I want to add new fields for the current day and remove the fields for the oldest one.\n\n<add><doc>\n  <field name=\"id\">100</field>\n\n  <!-- add fields for current day -->\n  <field name=\"251_1603_i\" update=\"set\">25</field>\n\n  <!-- remove fields for oldest day -->\n  <field name=\"2_1600_i\" update=\"set\" null=\"true\">1</field>\n</doc></add>\n\nThe problem is, I don't know the exact names of the fields I want to remove. All I know is that they end in *_1600_i. It is not currently possible to specify a wildcard when sending an atomic update to SOLR.\n\nWhen removing fields from a document, I want to avoid querying SOLR from the client, in order to see what fields are actually present for the specific document. In this way, hopefully I can speed up the process. Querying to see the schema.xml is not going to help me much, since the field is defined a dynamic field *_i. This makes me think that expanding the documents client-side is not the best way to do it. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13985123",
            "date": "2014-04-30T03:39:49+0000",
            "content": "I don't think this issue is a DataImportHandler component. Though I am not sure which component this should be. "
        }
    ]
}