{
    "id": "SOLR-5946",
    "title": "Need clear docs on how to \"backup\" and \"restore\" indexes",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "5.2"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As pointed out by Maxim Novikov in the comments of the Solr Ref Guide: the instructions on creating index backups are very sparse, and give no clear instructions on how to restore fro ma backup.\n\nThis page really needs to be beefed up with more complete instructions...\n\nhttps://cwiki.apache.org/confluence/display/solr/Backing+Up",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Maxim Novikov",
            "id": "comment-13957257",
            "date": "2014-04-02T02:10:26+0000",
            "content": "\nPlease describe also the strategy for restoring backups, specifically for SorlCloud. From your documentation it is still possible to grasp the idea how to back up the index using HTTP commands, but it is absolutely unclear what to do with those backups if the cluster goes down one day for some reason. So far those are just a bunch of files/directories no one knows how to use.\n\nWould we need to delete the directory with the current index?\nShould we copy one  of the snapshot directories files to the index directory?\nWould we have to do something with transaction logs (delete, modify, etc.)? \nHow to let the other nodes in the cluster know that the index has been restored from an earlier version and trigger the synchronization process?\n\nAlso, it does not seem to be explained anywhere, but it looks like fetching data (triggering that process via HTTP) from master to slave does not work in SolrCloud as all the nodes are considered to me masters.\n\nI believe all these questions (and the others related) should be addressed as for now SolrCloud is not being a comprehensive solution because you need to work around some similar stuff on your own. And it is not really reliable if Solr cannot handle such things at all.\n\nPS My understanding is that currently backups are useless as you cannot do anything with them (at least I have not found any info that would cover that). They may help only in case of complete horrible failure when all the nodes in the cluster got exploded and then you want to restore the index quickly on other ones avoiding the full import from the data source from scratch. But this is really not a real-life use case. The more typical would be \"I want to restore my data after I occasionally cleaned up the index in SolrCloud\" or \"I want to restore my data from a backed up snapshot when the index got corrupted for some reason\", etc. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13957309",
            "date": "2014-04-02T03:51:43+0000",
            "content": "Backup restore in SolrCloud is possible but very difficult currently. There's SOLR-5750 to make it easier. "
        },
        {
            "author": "Maxim Novikov",
            "id": "comment-13957323",
            "date": "2014-04-02T04:16:59+0000",
            "content": "That was the point actually, if it is possible (even if very difficult), please explain in the docs what strategy we could use. "
        },
        {
            "author": "Ralph Tice",
            "id": "comment-14170970",
            "date": "2014-10-14T13:59:50+0000",
            "content": "I just went through this process again, after bailing out a couple times previously after reading the docs and various (incomplete) tickets.\n\nThe only major caveat is that there is no real backup strategy for transaction logs.  I think that's mostly OK as long as you treat your backups as being of a committed version.\n\nMy writeup is here: https://gist.github.com/ralph-tice/887414a7f8082a0cb828\n\nAny feedback – like whether this is appropriate for the community wiki – appreciated.  I am unclear on the details.backup section of the replication DETAILS command – I think currently the only thing you can do is compare the filecount of the backup to the fileset list count, or wait for the file size on disk to approximately match the reported file size, plus a little while longer for \"things to settle\". "
        },
        {
            "author": "Martin Leopold",
            "id": "comment-14507128",
            "date": "2015-04-22T14:04:18+0000",
            "content": "Hi,\nA partial solution is posted here - as far as I can tell it finds a shard leader, starts a replication dump and fetches the dump, but does not back up the schema.\nhttps://github.com/nla/solrbackup\n\nBr,\nMartin "
        },
        {
            "author": "Varun Thacker",
            "id": "comment-14631377",
            "date": "2015-07-17T14:06:58+0000",
            "content": "Here is the page which explains both the backup and restore of a core in detail - https://cwiki.apache.org/confluence/display/solr/Making+and+Restoring+Backups+of+SolrCores "
        }
    ]
}