{
    "id": "SOLR-12713",
    "title": "make \"solr.data.dir\" points to multiple base path, and collection's replicas may distribute in them",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Server"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "As discussion in user mail-list，It's of worthy of making  \"solr.data.dir\" points to multiple base paths, which collection's replicas may distribute in.\n\nCurrently， solr only could points to a single common dataDir，to maximize indexing throughput   in same cases，solr maybe introduce a new feature to support multiple dataDir paths.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-29T16:31:35+0000",
            "content": "Interim workaround:\n\nAfter you create a collection, and before you add data to it, find the \"core.properties\" files for each shard replica in the collection and add/change the dataDir property to manually point it to a different location.  Then reload the collection with the Collections API to make the changes effective. ",
            "author": "Shawn Heisey",
            "id": "comment-16596573"
        },
        {
            "date": "2018-08-29T16:59:19+0000",
            "content": "Slightly safer variant would be create a coreless collection , then add one replica at a time and pass &property.dataDir=/path/to/disk1 and individually stripe it.\n\n+1 to the Jira to have solr support it in a better way. Is this something that you plan on working ?  ",
            "author": "Varun Thacker",
            "id": "comment-16596599"
        },
        {
            "date": "2018-08-30T03:50:43+0000",
            "content": "\nShawn Heisey That sounds work too, I think the approach you mention can be work automatically. \nIn a simple way, when the collection is requested to create，each shard replica will  use one of the data paths  as it's dataDir property, \nand make the distribution more balance overall.  ",
            "author": "weizhenyuan",
            "id": "comment-16597028"
        },
        {
            "date": "2018-08-30T03:56:27+0000",
            "content": "Varun Thacker I do need this feature to improve indexing throughput   in some cases, be my pleasure to implement this if possible. ",
            "author": "weizhenyuan",
            "id": "comment-16597032"
        },
        {
            "date": "2018-08-31T14:11:48+0000",
            "content": "I do need this feature to improve indexing throughput in some cases\n\nPutting different indexes on different disks (or, even better, different servers) can improve indexing speed if all the indexes are receiving data at the same time, but if you want to REALLY make your indexing fast, you need to use a multi-threaded or multi-process indexing system that indexes multiple batches of data to the same index in parallel. ",
            "author": "Shawn Heisey",
            "id": "comment-16598762"
        },
        {
            "date": "2018-09-01T05:58:10+0000",
            "content": "be my pleasure to implement this if possible.\nThat's great! I'd be happy to review\n\nI think it might involve some plumbing though.  We'd need to start with Solr allowing multiple data directories on startup. \n\nThen Core level APIs like create core need to support taking a disk parameter\n\nAnd then Collection level APIs would need to be able to utilize it ( add-replica etc )\n\nWe could tackle these as sub-jiras to make it easier to review and commit smaller chunks. ",
            "author": "Varun Thacker",
            "id": "comment-16599547"
        },
        {
            "date": "2018-09-01T22:52:17+0000",
            "content": "Also, how does the autoscaling effort fit into this? Some of the parameters in terms of autoscaling involve disk space considerations.... ",
            "author": "Erick Erickson",
            "id": "comment-16599828"
        },
        {
            "date": "2018-09-03T01:23:13+0000",
            "content": "Erick Erickson Yeah，some disk statistics should be changed appropriately. ",
            "author": "weizhenyuan",
            "id": "comment-16601723"
        },
        {
            "date": "2018-09-03T01:43:18+0000",
            "content": "Varun Thacker Cool~,that make much sense.  And if no disk paramter provided, those  replicas of  the collection to be created should be \ndistribute in all  available disks，considering the capacity of  each disk  as well.  ",
            "author": "weizhenyuan",
            "id": "comment-16601725"
        }
    ]
}