{
    "id": "SOLR-8713",
    "title": "New UI points to the wiki for Query Syntax instead of the Reference Guide",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "6.0",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Trivial"
    },
    "description": "Old Admin UI points to https://cwiki.apache.org/confluence/display/solr/Query+Syntax+and+Parsing but the new one points to http://wiki.apache.org/solr/SolrQuerySyntax",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-26T18:56:48+0000",
            "author": "Marius Grama",
            "content": "With the changes from SOLR-7858 the welcome-file is not anymore admin.html, but instead index.html .\nindex.html contains an older link for the solr query syntax. ",
            "id": "comment-15169543"
        },
        {
            "date": "2016-02-26T19:20:30+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user mariusneo opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/12\n\n    SOLR-8713 Update wiki-query-syntax link to point towards : https://cw…\n\n    Update wiki-query-syntax link to point towards https://cwiki.apache.org/confluence/display/solr/Query+Syntax+and+Parsing\n\n\n    Along the way I've updated the links that existed in some other solrconfig.xml files.\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/mariusneo/lucene-solr bugfix/SOLR-8713\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/12.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #12\n\n\ncommit e86fa97d5830887d73a275ad3a95e69ac79c6c20\nAuthor: Marius <mariusneo@gmail.com>\nDate:   2016-02-26T19:15:14Z\n\n    SOLR-8713 Update wiki-query-syntax link to point towards : https://cwiki.apache.org/confluence/display/solr/Query+Syntax+and+Parsing\n\n ",
            "id": "comment-15169599"
        },
        {
            "date": "2016-02-26T19:56:23+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user mariusneo opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/14\n\n    SOLR-8713 Update wiki-query-syntax link\n\n    Update wiki-query-syntax link to point towards : https://cwiki.apache.org/confluence/display/solr/Query+Syntax+and+Parsing\n\n\n    Along the way I've updated the Solr query syntax link also within several solrconfig.xml files.\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/mariusneo/lucene-solr bugfix/SOLR-8713\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/14.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #14\n\n\ncommit 9f5e4768a772b4375c5979dd61a440504bfdceb0\nAuthor: Marius <mariusneo@gmail.com>\nDate:   2016-02-26T19:15:14Z\n\n    SOLR-8713 Update wiki-query-syntax link to point towards : https://cwiki.apache.org/confluence/display/solr/Query+Syntax+and+Parsing\n\n ",
            "id": "comment-15169671"
        },
        {
            "date": "2016-02-26T20:08:42+0000",
            "author": "Jack Krupansky",
            "content": "Be careful, because Confluence has the working text of the NEXT release of Solr (6.0 right now), not the current release or even necessarily the release that the admin UI is running.\n\nIt would be nice if the Confluence doc was per-release in addition to the development version, but right now only the PDF is per-release, which is what the admin UI should point to. ",
            "id": "comment-15169703"
        },
        {
            "date": "2016-02-26T20:16:47+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "That's true, but the same thing happens with the wiki (yes, sometimes we put things like \"Only since 4.0\" there, but anyway). I think pointing to the right page in Confluence is good enough, specially since that's what we are currently doing in the deprecated UI. I wouldn't like pointing to the PDF ",
            "id": "comment-15169719"
        },
        {
            "date": "2016-02-26T20:26:46+0000",
            "author": "Marius Grama",
            "content": "Jack Krupansky thank you for the feedback.\nI agree with what you are saying that the wiki page may be misleading pointing towards the NEXT version of Solr (6.0 now), but I see the link \"5.5 Ref Guide (PDF Download)\" referenced in the wiki page. Also the solr ref guide PDF provides not only query syntax help, but is the full reference guide for Solr. In case that the link would point towards this PDF, the name of the link would need to be changed to \"Solr Reference Guide\".\nNevertheless, the current link http://wiki.apache.org/solr/SolrQuerySyntax points towards  Solr 4.x wiki. The solr query syntax link was until recently pointing towards to the https://cwiki.apache.org/confluence/display/solr/Query+Syntax+and+Parsing (from admin.html ) webpage. IMO the link should still point to the confluence query link.\n\nIt would be nice if the Confluence doc was per-release in addition to the development version\nI guess the reason why there is only the one (latest) version of the document present in the wiki, is to avoid the duplication of maintenance. ",
            "id": "comment-15169739"
        },
        {
            "date": "2016-02-26T21:13:51+0000",
            "author": "Shawn Heisey",
            "content": "points towards Solr 4.x wiki\n\nThe moinmoin wiki is not for 4.x.  A lot of the content has gotten out of date, but other parts of it are updated regularly and have fully current information.\n\nThat older wiki needs an overhaul.  Some of the information needs to be removed because the information in the reference guide is better and completely supersedes what's there now, but there is still some value in having duplicate information for certain topics, because the wiki version can be presented differently, in a format that's better for quick lookups than the reference guide, which is intended to be full documentation.  A good example of this is the following page:\n\nhttps://wiki.apache.org/solr/AnalyzersTokenizersTokenFilters\n\nI use this page all the time, because it's easily searchable for a particular analysis component and has quick-n-dirty examples.  I don't recall seeing anything in the reference guide like that page. ",
            "id": "comment-15169829"
        },
        {
            "date": "2016-02-28T01:28:03+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "I do believe that having a documentation snapshot per release (other than the pdf) would be better for linking in the code/UI, but not having that, I think the ref guide is the best place right now. Most parts of the wiki are outdated or not being maintained, plus the old UI is linking to the ref guide, I don't believe the new UI switched back to the wiki intentionally.\nIf nobody is against this change in particular I'll commit it, PR looks good to me.  ",
            "id": "comment-15170784"
        },
        {
            "date": "2016-02-28T21:28:28+0000",
            "author": "Upayavira",
            "content": "It would be great to have online, per release snapshots of the wiki, but in lieu of that, this patch looks good to me. ",
            "id": "comment-15171197"
        },
        {
            "date": "2016-02-29T18:58:31+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Again, not sure why the commit didn't make it to Jira, same as SOLR-8671, not sure what I'm doing wrong...\n\ncommit 20b7453cc8a5f5ad14fb2d2637eb7a31f72d62f7\nAuthor: Tomás Fernández Löbbe <tflobbe@apache.org>\nDate:   Mon Feb 29 08:22:25 2016 -0800\n\n    SOLR-8713: new UI and example solrconfig files point to Reference Guide for Solr Query Syntax instead of the wiki.\n    \n    This closes #12\n\n\n\nThanks Marius! And thanks for all the comments/reviews. ",
            "id": "comment-15172387"
        },
        {
            "date": "2016-03-01T06:18:53+0000",
            "author": "Marius Grama",
            "content": "Tomás Fernández Löbbe shouldn't this commit land also on origin/branch_5_5 ? I see it on origin/master now, which means that it will be available only on version 6.0 of solr. \nAlso the pull request https://github.com/apache/lucene-solr/pull/14 is still open. ",
            "id": "comment-15173296"
        },
        {
            "date": "2016-03-01T20:17:54+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "I was being lazy and not backporting. 6.0 will be out soon, and this Angular UI is not default in 5.x, so the impact is even smaller. \nWe don't need PRs for multiple branches, I can just cherrypick the commit from master to the branch if needed, would you mind close it yourself since I didn't mention it in the commit message? ",
            "id": "comment-15174352"
        }
    ]
}