{
    "id": "SOLR-11615",
    "title": "HowToContribute instructions obsolete",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.2",
            "master (8.0)"
        ],
        "affect_versions": "7.0.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The Solr HowToContribute page has obsolete instructions:\n\n(1) “for very minor changes, spelling errors, grammar corrections and the like it's probably better to just comment on the live page rather than go through the heavyweight process of creating a JIRA and patch”. But the page is immutable. No method for commenting on it is apparent.\n\n(2) “Contributors should join the Solr mailing lists.” The link to mailing lists is obsolete.",
    "attachments": {
        "RefGuideCommentSystemLoginLInk.png": "https://issues.apache.org/jira/secure/attachment/12896662/RefGuideCommentSystemLoginLInk.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-11-07T18:16:30+0000",
            "content": "Thanks!\n\nThe intent of the \"for very minor\" bit was to convey that people should leave a comment on the ref guide page for that level of issue, I reworded that a bit, is it clearer now?\n\nFixed the link. ",
            "author": "Erick Erickson",
            "id": "comment-16242561"
        },
        {
            "date": "2017-11-07T21:42:27+0000",
            "content": "Thanks, Erick Erickson. Yes, the new wording is clearer. I didn’t mention, however, that the last sentence on the page is “If you find problems with the information here, and especially if you subsequently find solutions to the problems you find, please either write to the solr-user mailing list or update this page directly so others can benefit.” That seems to point to that very page, which the user cannot update. ",
            "author": "Jonathan Pool",
            "id": "comment-16242952"
        },
        {
            "date": "2017-11-07T22:44:57+0000",
            "content": "I didn't know that the new reference guide pages had a comment system until just now.  I have never seen any notifications about any of those comments.  The comment system mentions that for some functionality an account must be created, but has no information about how to create an account.\n\nI suspect that for the new ref guide that is generated from the source code, Jira is probably the best way for extensive changes, and a mailing list message (either solr-user or dev) would be a good idea for extremely simple changes.\n\nJonathan Pool, anybody can edit the HowToContribute page.  All that is needed is to create an account on the Solr wiki and request edit permissions on the IRC channel, the solr-user list, or the dev list.\n\nI have fixed a couple of links for Solr mailing lists to point to the correct page. ",
            "author": "Shawn Heisey",
            "id": "comment-16243052"
        },
        {
            "date": "2017-11-08T00:04:29+0000",
            "content": "Thanks for the additional information, Shawn Heisey. It seems to me that the information that “anybody can edit the HowToContribute page. All that is needed is to create an account on the Solr wiki and request edit permissions on the IRC channel, the solr-user list, or the dev list” should be put into the HowToContribute page, so people know how to accept the invitation to edit. ",
            "author": "Jonathan Pool",
            "id": "comment-16243115"
        },
        {
            "date": "2017-11-08T14:46:33+0000",
            "content": "I have never seen any notifications about any of those comments. \n\nThey go to commits@lucene.a.o (which the old Confluence system also did), or as a committer you can subscribe to the comment feed via the the comment management screen. It all comes from ASF Comments System: https://comments.apache.org/help.html, via JavaScript that's inserted into the page (which we cannot control). I thought I had written some docs on this, but apparently I haven't yet.\n\nThe comment system mentions that for some functionality an account must be created, but has no information about how to create an account.\n\nThe same line that has the button to add a comment to a page, has a link to \"Login/Register\". When you follow that, you get a login screen, and a link there says to click a different link if you are a committer. I've added a screenshot.\n\nThis issue isn't about the Ref Guide, though, it's about the Solr Wiki page that describes how to contribute to the project overall. ",
            "author": "Cassandra Targett",
            "id": "comment-16244069"
        },
        {
            "date": "2017-11-08T14:55:59+0000",
            "content": "I've added a paragraph to the HowToContribute page mentioning the method for obtaining edit permission on the wiki.\n\nCassandra Targett, having said that I had never seen those comments ... suddenly I see Jonathan's entries in my 'commits' folder just like you said.  They escaped my notice before! ",
            "author": "Shawn Heisey",
            "id": "comment-16244092"
        },
        {
            "date": "2017-11-08T18:26:39+0000",
            "content": "They escaped my notice before\n\nTo be completely honest I'd neglected to set up sending them to commits@ until a couple weeks or even a month ago. So it isn't crazy that you don't recall seeing them earlier. ",
            "author": "Cassandra Targett",
            "id": "comment-16244479"
        }
    ]
}