{
    "id": "SOLR-12331",
    "title": "How to backup solr collection",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "Backup/Restore"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "7.3.1",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Hello Solr experts,\n\nI am new to solr and have a lot to learn, but I have been tasked with writing a backup and restore demo. I have a question regarding the location of the backup when taking a backup.\n\nIn my address box I have the following URL to get my backup started...\n\nhttp://IPADDRESS:8983/solr/#/collections?action=BACKUP&name=test_catalog&location=\n\n...so the documentation says I should back up to a shared drive, but shared drive where? Is the shared drive on the zookeeper, or on my local machine? If on the zookeeper, do I need to create a backup directory first? And if on my local machine, what do I need to type in?\n\nI am also interested to know if it is possible to backup to an Azure blob?\n\nWhat is the difference between the location and repository?\n\nI would really appreciate any guidance, there appears to be no step by step on the internet (hard to believe I know), but if there is I cannot find it. If I end up creating one from help received here, I will be only too happy to share it to the greater community.\n\n \n\nThank you.\n\nKind Regards,\n\nPaul.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-09T05:27:26+0000",
            "content": "This issue tracker is not a support portal.  Please use support resources like the mailing list or the IRC channel to get help.  If after discussion it is determined that there is a bug in Solr, then we can open an issue in this tracker.\n\nhttp://lucene.apache.org/solr/community.html#mailing-lists-irc\n\nAn example of a shared drive is storage mounted via NFS on all the SolrCloud servers in the same location.  Or in the case of Windows, a shared drive mounted from a file server. ",
            "author": "Shawn Heisey",
            "id": "comment-16468397"
        },
        {
            "date": "2018-05-09T22:56:00+0000",
            "content": "Ah I see, sorry Shawn it was my first post here on Jira. Thank you for\nanswering.\n\nKind regards,\nPaul.\n\n\n\n– \n\n\nCAUTION: This email, links and files included in its transmission by \nWoolworths Group Limited ABN 88 000 014 675 and its group of companies \n(Woolworths Group) are solely intended for the use of the addressee(s) and \nmay contain information that is confidential and privileged. If you receive \nthis email in error, please advise us immediately and delete it without \nreading or copying the contents contained within. Woolworths Group does not \naccept liability for the views expressed within or the consequences of any \ncomputer malware that may be transmitted with this email. The contents are \nalso subject to copyright. No part of it should be reproduced, adapted or \ntransmitted without the written consent of the copyright owner. ",
            "author": "Paul Williams",
            "id": "comment-16469640"
        }
    ]
}