{
    "id": "SOLR-11766",
    "title": "Ref Guide: redesign Streaming Expression reference pages",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation",
            "streaming expressions"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "There are a very large number of streaming expressions and they need some special info design to be more easily accessible. The current way we're presenting them doesn't really work. This issue is to track ideas and POC patches for possible approaches.\n\nA couple of ideas I have, which may or may not all work together:\n\n\n\tProvide a way to filter the list of commands by expression type (would need to figure out the types)\n\tPresent the available expressions in smaller sections, similar in UX concept to https://redis.io/commands. On that page, I can see 9-12 commands above \"the fold\" on my laptop screen, as compared to today when I can see only 1 expression at a time & each expression probably takes more space than necessary. This idea would require figuring out where people go when they click a command to get more information.\n\t\n\t\tOne solution for where people go is to put all the commands back in one massive page, but this isn't really ideal\n\t\tAnother solution would be to have an individual .adoc file for each expression and present them all individually.\n\t\n\t\n\tSome of the Bootstrap.js options may help - collapsing panels or tabs, if properly designed, may make it easier to see an overview of available expressions and get more information if interested.\n\n\n\nI'll post more ideas as I come up with them.\n\nThese ideas focus on the HTML layout of expressions - ideally we come up with a solution for PDF that's better also, but we are much more limited in what we can do there.",
    "attachments": {
        "StreamQuickRef-sample.png": "https://issues.apache.org/jira/secure/attachment/12906422/StreamQuickRef-sample.png",
        "Streaming-expanded-panel.png": "https://issues.apache.org/jira/secure/attachment/12906468/Streaming-expanded-panel.png",
        "Stream-collapsed-panels.png": "https://issues.apache.org/jira/secure/attachment/12906467/Stream-collapsed-panels.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-01-17T17:18:45+0000",
            "content": "I've attached a \"still dirty\" example of one possible approach (StreamQuickRef-sample.png). The idea is that we'd make a new \"Streaming Expression Reference\" page with 3 expressions per row, each showing a basic example, a simple description, and a link to the main section where the expression is defined with more detail & examples.\n\nOne drawback of this approach is that the list of available expressions would be in 2 places - once on the Quick Reference page and again on its main page. \n\nI call it \"dirty\" because it still needs some CSS to make the boxes line up better visually as columns, and I'd prefer some space between each box on each row. But I wanted to share it as a possibility even though it's not perfect yet. ",
            "author": "Cassandra Targett",
            "id": "comment-16329038"
        },
        {
            "date": "2018-01-17T17:55:48+0000",
            "content": "For the Stream Evaluators I think having different sub-sections like:\n\n\tStatistics\n\tProbability Distributions and Simulations\n\tInterpolation, Derivatives and Integrals\n\tLinear Algebra / Vector and Matrix Math\n\tMachine Learning\n\tRegression and Curve Fitting\n\tTime Series Analysis\n\tDigital Signal Processing\n\tNatural Language Processing\n\n\n\nThen in each section there could be a user guide for applying the functions and the reference for each function. ",
            "author": "Joel Bernstein",
            "id": "comment-16329107"
        },
        {
            "date": "2018-01-17T18:16:13+0000",
            "content": "I'm all for organizing them into categories - would you provide a list of which evaluators go in which categories? One reason why I didn't start there is because I didn't know how to split them up but I'm guessing you already have a couple of ideas .\n\nThe Sources and Decorators pages have similar issues, the Decorators more so. Do those split into any natural categories in your opinion? One place to start with those is to simplify the presentation of each section.\n\nI do think it's really worthwhile to have a single place to see a full list of all expression types for those who haven't yet learned if they want a source or a decorator or an evaluator. There are ways we could make the overview \"quick reference\" page auto-generate (it's not in the screenshot, but I think it could be). ",
            "author": "Cassandra Targett",
            "id": "comment-16329137"
        },
        {
            "date": "2018-01-17T18:30:48+0000",
            "content": "A few things:\n\n1. Link to our current Streaming Expressions documentation, for the lazy: http://lucene.apache.org/solr/guide/7_2/streaming-expressions.html\n2. I'm a big fan of the Redis-inspired screenshot you attached above.  It's a big improvement on making these more compact.  A related but different approach would be to have the a small summary line for each Streaming Expression, that expands-on-click to show more details.  The default display for \"Swagger\" docs comes close to what I'm suggesting: http://petstore.swagger.io/#/.  It may be a bit more compact, but is otherwise very similar.  Not sure which people prefer aesthetically.  Just suggesting an alternative.\n\nAnd lastly, a more general question:\n\nideally we come up with a solution for PDF that's better also, but we are much more limited in what we can do there.\n\nThis is the second time (that I know of) where we've run into sticking points dealing with formatting in our PDF vs HTML ref-guide.  (SOLR-11584 being the other).  And I imagine these sorts of issues will continue to come up, as we try to find better, more helpful ways of presenting information to our users.  Do we see ourselves continuing to support both formats for the foreseeable future?  (I'm not questioning the utility of our PDF release format.  Just curious whether anyone else is worried that it'll start to restrict our flexibility sometime soon.  Maybe I should've posted this as a mailing list question instead of tacking it on here...) ",
            "author": "Jason Gerlowski",
            "id": "comment-16329162"
        },
        {
            "date": "2018-01-17T20:08:57+0000",
            "content": "A related but different approach would be to have the a small summary line for each Streaming Expression, that expands-on-click to show more details.\nI've thought of this approach also, but wasn't sure how well it would work (and needed to figure out how to make it work). I've attached a couple of screenshots of what it might look like (needs more styling fixes). One has 2 panels collapsed and the other has one of the panels open. The idea of grouping by category is in there also, in the sense that these are grouped under the same main heading (I realize, of course, these may not logically go together, just trying to convey the idea). ",
            "author": "Cassandra Targett",
            "id": "comment-16329374"
        },
        {
            "date": "2018-01-17T21:19:46+0000",
            "content": "Re the PDF\nDo we see ourselves continuing to support both formats for the foreseeable future?\nThere are reasons why we still not only have it, but consider it the official Ref Guide format, and those would need to change:\n\n\tThe Ref Guide is still not finished at the same time as the code for any particular release (almost, but not quite).\n\tAssuming it was ready at the same time, there's an ASF policy that release artifacts need to be produced by the Release Manager, on a machine he/she has direct control over. We would need everyone who might be an RM to set themselves up to build the HTML, which requires a number of unique dependencies and some have had trouble with it in the past. The PDF has no external dependencies, so is simple for anyone to run.\n\n\n\nI'm pretty sure I'm forgetting a couple of other reasons.\n\nI think, though, that even if we decided that the HTML version is the official format, some people would still want a PDF version (maybe just as a backup in case their networks is down), and we'd want to make sure that whatever we do with the content, those users would not lose anything because of the format. ",
            "author": "Cassandra Targett",
            "id": "comment-16329491"
        },
        {
            "date": "2018-01-19T17:52:38+0000",
            "content": "Before I go too much farther, I've uploaded a couple of sample pages that show what I'm thinking about.\n\n\n\thttp://people.apache.org/~ctargett/StreamingExpressions/streaming-reference.html shows a new page for all the expressions in one place, presented as small boxes with a short description and basic example.\n\t\n\t\tLabels will help users differentiate between the different types of expressions.\n\t\tI haven't decided the order for how to present the summary info yet - you'll see two examples. One is Expression, Description, Example (row 1); while the other is Expression, Example, Description (rows 2 & 3). I feel like the examples are getting lost in either option...I think it might need to be bold and/or another color.\n\t\tLayout of row 3 in the current example is weird because there's only 2 there - should straighten out when a 3rd expression is added to that row.\n\t\n\t\n\thttp://people.apache.org/~ctargett/StreamingExpressions/stream-evaluator-reference.html shows new layout of expression sections: Expression, basic example again, short description. Clicking \"more details\" shows the Parameters & Syntax examples.\n\t\n\t\tThere's more we could do here - change the text \"more details\" to \"less details\" when it's open (or use an icon instead of text or in addition to text).\n\t\n\t\n\n\n\nThoughts?\n\nI realized that I may have misinterpreted Joel Bernstein's comment earlier - I assumed you were only speaking of the Evaluators page when you mentioned categories, but now realize that you may have meant organizing all the expressions into those categories. I like this idea - with a single overview summary page of all the expressions like I've started here, we could put each category into it's own page so someone working with Machine Learning sees all the expressions in one place. ",
            "author": "Cassandra Targett",
            "id": "comment-16332638"
        },
        {
            "date": "2018-01-19T18:18:31+0000",
            "content": "I was mainly thinking about the evaluators with sub-categories.\n\nI think the stream sources and decorators will not grow much further. But the evaluators will keep growing. \n\nI really like the designs you've put up and I think they will be very helpful. Now I think it makes sense to think about the overall structure of the documentation. I think something like this makes sense, and I'll be adding lot's of user guides in the next couple of months:\n\nStream Sources\n\n    * Function Reference\n\n    * User guide\n\nStream Decorators\n\n     * Function Reference\n\n     * User guide\n\nStream Evaluators\n\n     * Function Reference\n\n     * Statistical and Mathematic Programming\n\n     * Covariance, Correlation and Distance\n\n     * Probability Distributions and Simulations\n\n     * Interpolation, Derivatives and Integrals\n\n     * Curve Fitting and Regression\n\n     * Machine Learning and Text Mining\n\n     * Natural Language Processing\n\n     * Time Series Analysis\n\n     * Linear Algebra / Vector & Matrix Math\n\n     * Digital Signal Processing\n\n      \n\n  ",
            "author": "Joel Bernstein",
            "id": "comment-16332680"
        },
        {
            "date": "2018-01-23T23:13:33+0000",
            "content": "I've been working on this the past few days, and have some new pages up at people.apache.org. This is the main page for Streaming Expressions, similar to how it is today: http://people.apache.org/~ctargett/StreamingExpressions/streaming-expressions.html. All the other pages are also there, as well as several new pages. It's still WIP, though - Sources & Decorators have not been touched yet at all.\n\nIn the left-nav, note a new organization for the sub-sections, and new pages for Stream Sources, Decorators, and Evaluators. Under the Evaluators, there are new pages for each of the proposed sub-sections.\n\nI took a crack at splitting up the evaluators - from looking at the evaluator classes, mostly, but there are many leftover and I can't progress without a list or further guidance. The ones I don't know where to put are still on the general \"Stream Evaluator Reference\" page (the idea being that that page will go away once they're all on their proper pages).\n\nMy plan for the next day or two is to work through the Sources and Decorators pages. Once I've done as much as I can, I will put up a patch here but I figured it was easier while iterating to see the built pages rather than trying to apply a patch and build locally. ",
            "author": "Cassandra Targett",
            "id": "comment-16336520"
        },
        {
            "date": "2018-01-25T21:12:17+0000",
            "content": "I took a look the new pages. My first instinct when I saw them was that it may be time to think about putting the Streaming Expressions documentation in it's own guide rather then as part of the reference guide.\n\nHere are three reasons for doing this:\n\n1) Streaming Expressions tend to hold up the release of the main reference guide. If they we're in there own guide they could release later without causing other documentation to slip as well.\n\n2) Right now the Streaming Expression documentation is being wedged into an existing format. If we we're able to break it out this would free us up to find better ways to organize and display the information.\n\n3) Streaming Expression documentation is now so big that it probably deserves it's own guide. The docs include Parallel SQL, Graph, Stream Sources, Stream Decorators, Stream Evaluators and the Statistical programming syntax. With all the new functions and planned user guides the sheer number of pages makes it worthwhile to break out in it's own guide.\n\n \n\n  ",
            "author": "Joel Bernstein",
            "id": "comment-16340090"
        },
        {
            "date": "2018-01-26T16:30:08+0000",
            "content": "An interesting idea, Joel, and I totally understand why you're going that way. A few counter-points, or maybe just additional things to consider.\n\nStreaming Expressions tend to hold up the release of the main reference guide.\n\nAt the risk of sounding flippant or disrespectful, there's a really easy way to solve that: do your doc updates at the same time you add a new expression. The \"wait until the RC has been cut then start doc updates\" approach is the only thing holding up merging the Ref Guide release with the main artifact release (and I'll add it is not in the slightest pleasant for me, the one who is nearly always the RM). Sure, one way around it is to release separately, but a more direct way is to just do them at the same time.\n\nbq, If they we're in there own guide they could release later\n\nAt some point we need to split up the Ref Guide - it's massive (1,200 pages in PDF) and grows more untenable with each release - but there are a number of factors to consider:\n\n\n\tUnless all the separate PDFs are released at the same time, they require VOTE threads for each release.\n\tEven if we changed to consider the HTML as the official format, we would still need a VOTE for each release. That means instead of going to a single release process for Lucene/Solr + Ref Guide, we'd still have at least 2 and possibly 3 or more release processes. The current Ref Guide release takes ~1 week of my time full-time every time - it's not a hit the button and walk away kind of thing if you want it done with any quality. IOW, since I'm the one doing it 99.9% of the time, I don't have time for more than a single release cycle no matter how many PDFs are generated.\n\tI've gone through the exercise in the past of splitting a single massive PDF into multiple separate PDFs, and one of the most hellish aspects of it was trying to handle links to sections that end up in different PDF files (like, I want to link to details about fields while describing the types of fields expressions would support). You can't. And since we have both an HTML and PDF format, links that work for the HTML version won't work for the PDF, so there would be additional issues to straighten out to make that work properly.\n\n\n\nRight now the Streaming Expression documentation is being wedged into an existing format\n\nI infer from this comment that you have ideas but think they may not possible. Beyond splitting the pages into sub-sections, I don't recall other ideas you've shared that were rejected due to format limitations...but perhaps I'm forgetting something?\n\nWe have two real limitations, IMO: 1) the fact that the official release artifact is the PDF, which is very book-like and does not support many  interactive features we may want to include; and 2) our imaginations and skills.\n\nRegarding the first limitation, some users want a PDF. We would still be asked to create one even if it was not the \"official\" format that we vote on. I don't see it going away entirely, so that limitation will always be around.\n\nFor the second - The HTML version is incredibly flexible. We can lay out those pages however we want. We can make the Streaming Expression pages look totally different than other pages by providing a layout template for them and telling each page to use it. We can add javascript this or that to do all kinds of fun things. But we need ideas first (I've shared those I've had), and then possibly someone with deeper skills than mine to make it happen.\n\nIf we do come up with some great ideas, we may need to do a couple of things to make the same info appear properly in the PDF, but nearly anything you can think of for online information design is within our grasp if we have a) the ideas and the ability to implement them, and b) the willingness to maintain it release-to-release as new expressions are added. It's not that hard to make things work properly in the PDF, you just need to be cognizant of the need for it.\n\nAt the very least, I think we should move Streaming Expressions out of the \"Searching\" section and make it a top-level section - the scope of what it can do is way beyond \"Searching\" now and it deserves it - I'll do that in the patch I'm working on with the other changes I've been making. But before we go ahead and make it a standalone Guide on its own, I'd like to hear your point of view on the other issues I've raised here. ",
            "author": "Cassandra Targett",
            "id": "comment-16341225"
        },
        {
            "date": "2018-01-28T18:57:08+0000",
            "content": "Ok, based on your comments I think we can make the new streaming expressions ref guide work as part of larger ref guide.\n\nI can also get the documentation done quicker and not hold things up. The published documentation at this point is mostly function reference, so it's mainly been just putting in a few lines about what each function does. I'll start making a practice of doing this as I go.\n\nAs far as the designs, I didn't like how the sub-sections looked on the left hand menu. They just seemed to get lost in all the other categories, require scrolling to view and the line wrapping makes it look crowed. Perhaps we can figure out another way to display the stream evaluator sub categories. ",
            "author": "Joel Bernstein",
            "id": "comment-16342675"
        },
        {
            "date": "2018-01-29T20:54:24+0000",
            "content": "I've started work on the 7.3 documentation using the existing format. I should be finished this week. We can think about possibly deploying a new format for 7.4. ",
            "author": "Joel Bernstein",
            "id": "comment-16344006"
        },
        {
            "date": "2018-01-31T14:26:55+0000",
            "content": "We can think about possibly deploying a new format for 7.4.\n\nOK, that makes sense. I was hoping to get it done for 7.3 since it's really needed, but I'm not sure if that will be feasible with some other stuff that needs my attention at the day job over the next couple of weeks. One thing we can do for 7.3 is move Streaming Expressions to be a top-level section. I can do that today with the existing pages if you want - WDYT? \n\nAs far as the designs, I didn't like how the sub-sections looked on the left hand menu.\n\nDo you mean the way it is today? Or some of the changes I proposed and put up last week? ",
            "author": "Cassandra Targett",
            "id": "comment-16346901"
        },
        {
            "date": "2018-02-01T03:58:47+0000",
            "content": "Out of curiosity, is it possible to add javascript widgets, such as a filter mechanism for categories of expression, or a text box that culls the boxes on the quick ref page as you type? Obviously this doesn't work in the PDF world, but I'm just wondering if stuff like that can be added in a a way that doesn't hamper the PDF? I notice that in the deployed online html version there's a search box, though (ironically for this project) it's limited to titles of sections and doesn't do full text search. However that seems to say that it's a javascript widget...  ",
            "author": "Gus Heck",
            "id": "comment-16347976"
        },
        {
            "date": "2018-02-01T14:46:33+0000",
            "content": "Out of curiosity, is it possible to add javascript widgets, such as a filter mechanism for categories of expression, or a text box that culls the boxes on the quick ref page as you type? \n\nYes, it is possible, and besides the search box it's done already for the in-page TOC and the inline tabs as seen on a page like https://lucene.apache.org/solr/guide/7_2/adding-custom-plugins-in-solrcloud-mode.html. Because JS only runs on the HTML pages when they're loaded, it doesn't impact the PDF at all (as long as there isn't any information that's only in the script, which wouldn't happen, I think, with what you're describing). We even have the ability to set up a layout that would only call a custom JS on Streaming Expression pages and not every other page that doesn't need it. I would really like to add something like that, but am hampered by my inability to write such a thing on my own.  ",
            "author": "Cassandra Targett",
            "id": "comment-16348668"
        },
        {
            "date": "2018-08-10T17:32:57+0000",
            "content": "Commit 89a1655e7f54fae0a3bd18b4963c9dc5b88d7256 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=89a1655 ]\n\nSOLR-11766: Move Streaming Expressions to be top-level section of Ref Guide ",
            "author": "ASF subversion and git services",
            "id": "comment-16576622"
        },
        {
            "date": "2018-08-13T14:39:42+0000",
            "content": "Commit e7ae83c66a0811f032e8738d66843b3ea5e54c31 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e7ae83c ]\n\nSOLR-11766: Move Streaming Expressions to be top-level section of Ref Guide ",
            "author": "ASF subversion and git services",
            "id": "comment-16578352"
        }
    ]
}