{
    "id": "SOLR-1691",
    "title": "Deal with deleting old index files in Windows auto-magicly",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Windows users are frequently confused/frustrated by the size of an index after making lots of changes/commits because of the way Windows prevents files with open handles from being deleted.\n\nIn Lucene-Java, IndexWriter will attempt to delete any old files whenever it can, but only on a subsequent change – we should see if we could add something to Solr to try and be more proactive about this...\n\nhttp://old.nabble.com/Delete%2C-commit%2C-optimize-doesn%27t-reduce-index-file-size-to26958067.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12795732",
            "date": "2010-01-01T04:03:55+0000",
            "content": "I haven't drilled into the Lucene code to see if this would work, but one idea would be to have Solr attempt to do a flush on the currently open IndexWriter in a background thread after any reader is closed.\n\nthis could be conditional on the OS type, or on a config option, or if there is evidence of deletable files (not sure if it's possible to tell from the Lucene API) "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12867945",
            "date": "2010-05-16T03:25:44+0000",
            "content": "A different method would be: open the index, walk the FSDirectory, and delete every file that Lucene does not care about. Is this possible? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13291196",
            "date": "2012-06-07T18:41:20+0000",
            "content": "I'll warn in advance that this may be completely impractical.  Feel free to dismiss it completely if it's just not workable.\n\nWould it be possible to delegate the removal of old index files to the IndexReader that has them open?  Here's my idea:  Add a close(boolean) method to IndexReader.  If the boolean is true, it would delete any files not currently in use by any other IR.  To make that possible, the IR class would need to have a static member keeping track of all open IR instances.  Each IR would likely know what files it requires.  This new close method could ask each of the other IR instances whether it needed each file.  If a file is not needed, the new close method would delete it.\n\nJavadocs say that write support will be removed from IndexReader in 4.0, and this would violate a strict interpretation.  It may be a bad idea for other reasons that are not apparent to my poor grasp of Lucene internals.  I have no idea how the close() method is currently called when a commit is required, so I can't say whether this is even possible.\n\nIf there are multiple java processes involved, this wouldn't work at all.  In a typical Solr install, I don't think there would be multiple processes, but for other Lucene applications, it may be likely. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15622215",
            "date": "2016-10-31T13:57:23+0000",
            "content": "Is this a practical problem anymore? I have not seen evidence that people suffer from this, and noone have proiritized working on it last 4 years. CLOSE-candidate? "
        }
    ]
}