{
    "id": "SOLR-10213",
    "title": "Copy Fields: remove wiki vs. cwiki overlap (and gap)",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "We just stumbled across the 'are copy fields recursive/cascading' question again and on https://wiki.apache.org/solr/SchemaXml#Copy_Fields found the answer which is \"no\" in the shape of the The copy is done at the stream source level and no copy feeds into another copy. sentence but https://cwiki.apache.org/confluence/display/solr/Copying+Fields didn't seem to obviously have that answer although there is a \"... can/does copying happen recursively?\" question hidden in the comments section.\n\nThis ticket here proposes to:\n\n\tfully remove the wiki section content in favour of just a pointer to the Solr Reference guide (cwiki)\n\treview if anything on the wiki is missing and should be added to the cwiki\n\tmaybe: tidy up/remove some of the comments on the cwiki (the ones unrelated to the cwiki page itself)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-02-28T15:45:30+0000",
            "content": "+1. Removing pages from the Wiki and/or putting big bold WARNING messages has been ongoing. Personally I prefer removing all the text and providing a link as you propose.\n\nAnd I regularly delete comments if we address the question raised in the text or if they're just usage questions. ",
            "author": "Erick Erickson",
            "id": "comment-15888266"
        },
        {
            "date": "2017-02-28T16:11:45+0000",
            "content": "As I have spare time/inclination, I work through the pages in the old wiki and add messages pointing to Confluence. The process I follow is written out here: https://cwiki.apache.org/confluence/display/solr/Internal+-+Maintaining+Documentation#Internal-MaintainingDocumentation-Migrating\"Official\"DocumentationfromMoinMoin. It's ideal if the pages have a consistent message, but that text is really only a recommendation - my point is, though, that sample text already exists, you don't need to try to reinvent the wheel.\n\nThere is a list of pages to be reviewed at: https://wiki.apache.org/solr/WikiManualComparison. This list has a complex history, but probably 3  years ago I asked someone to look at all the pages in the Wiki and compare them to the Ref Guide, and note differences in content. This person had no knowledge of or history with Solr, and that shows. However, it's still a decent list of pages that are (or aren't) replicated in the Ref Guide. The specific notes about the content is out-of-date, but it's a starting point. I've added notes to pages I've completed, from which you can see I've worked through the A's and B's and maybe half of the C's. Only 23 letters of the alphabet to go  ",
            "author": "Cassandra Targett",
            "id": "comment-15888340"
        },
        {
            "date": "2017-03-08T18:36:56+0000",
            "content": "Thanks Erick and Cassandra for your guidance and comments. I have gone and added a small paragraph re: the 'are copy fields recursive/cascading' question to the cwiki page, and have also deleted comments already addressed and/or replied to.  ",
            "author": "Christine Poerschke",
            "id": "comment-15901736"
        },
        {
            "date": "2018-09-15T17:47:08+0000",
            "content": "I had a user complain to me on Thursday on how he was looking for faceting documentation and google lead him to https://wiki.apache.org/solr/SimpleFacetParameters . Obviously this page wasn't up to date and some of the parameters don't work in the same way today.  \n\n  ",
            "author": "Varun Thacker",
            "id": "comment-16616426"
        }
    ]
}