{
    "id": "SOLR-12261",
    "title": "Deleting collections should sync aliases before prematurely failing when alias is deleted",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.4"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "In SOLR-11218 Erick Erickson ensured that we can't delete a collection that is referenced by an alias. However It may be that the alias is deleted but the node servicing the request doesn't know about this yet. It should call AliasesManager.update() first (which now sync()'s with ZK).\n\nI believe this is the cause of some sporadic failures to org.apache.solr.cloud.AliasIntegrationTest#tearDown which deletes the alias then all collections.\n\nIt's debatable if this is an improvement or a bug. Sadly most of SolrCloud simply seems to operate this way despite it being eventually consistent. Thus users using SolrCloud may have to add sleep()s after calls to Solr admin calls :-/",
    "attachments": {
        "SOLR-12261.patch": "https://issues.apache.org/jira/secure/attachment/12920337/SOLR-12261.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-04-24T21:55:04+0000",
            "content": "It's debatable if this is an improvement or a bug.\n\nThats been a ton of SolrCloud. Upsides and downsides of building on an existing system and trying to get something out fast with a few devs (so we could build up to many, many more devs in a reasonable timeframe).\n\nIn the end you end up with many 'unfinished' things living between bug and feature. Things constantly get ticked off the list though.\n\nGood scriptability and the testing of that with the collections API is still something that's on my list, unless it's further than the state I'm aware of. Good responses have been a work in progress, and the lack of some ZK=truth stuff has made deleting and creating the same collection in a script a bit of a nightmare.\n\nIn the end, bug, improvement, take your pick. Stuff that should be fixed and tested.\n\nFor the Alias feature though, I really didn't spend a lot of time thinking out every possible case, I pumped it out during a short hackathon and didn't use it personally. So it's an improvement. I mean a bug. It's been getting fixed and tested. ",
            "author": "Mark Miller",
            "id": "comment-16451272"
        },
        {
            "date": "2018-04-25T03:25:29+0000",
            "content": "Commit 1370f6b520787efdef982620708d0fc070268b6b in lucene-solr's branch refs/heads/master from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=1370f6b ]\n\nSOLR-12261: Collection deletion's check for alias membership should\n sync() aliases with ZK before throwing an error. ",
            "author": "ASF subversion and git services",
            "id": "comment-16451571"
        },
        {
            "date": "2018-04-25T03:26:56+0000",
            "content": "Commit 5a89f604cdfc6fde68c8e6a5fdfb01f5ac3f732d in lucene-solr's branch refs/heads/branch_7x from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5a89f60 ]\n\nSOLR-12261: Collection deletion's check for alias membership should\n sync() aliases with ZK before throwing an error.\n\n(cherry picked from commit 1370f6b) ",
            "author": "ASF subversion and git services",
            "id": "comment-16451575"
        }
    ]
}