{
    "id": "SOLR-3108",
    "title": "Error in SolrCloud's replica lookup code when replica's are hosted in same Solr instance",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "There's a small bug in ZkStateReader.getReplicaProps() when you have multiple replicas of the same shard/slice hosted in one CoreContainer. Not that you would often do this, but I was playing around with shards & replicas using just one Solr instance and noticed it. The attached patch should make it clear, the check on !coreNodeName.equals(filterNodeName) will always be false in such case.",
    "attachments": {
        "SOLR-3108.patch": "https://issues.apache.org/jira/secure/attachment/12513673/SOLR-3108.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13203218",
            "date": "2012-02-08T03:14:09+0000",
            "content": "Thanks Bruno - I'll take a look at this tomorrow. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13203978",
            "date": "2012-02-08T21:02:00+0000",
            "content": "Bruno's fix + a test. To make the test I also did a little around the numShards handling so that you can pass it on core creation with the CoreAdminHandler. Sami, it would prob be good for you to review that a bit - I'm not sure if we can do that in a cleaner way or not? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13204217",
            "date": "2012-02-09T03:16:40+0000",
            "content": "I've committed the fix only for the moment since its very simple and straightforward.\n\nI'll let Sami take a peek at my changes to support the new test before committing that. "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13204408",
            "date": "2012-02-09T09:56:52+0000",
            "content": "Mark, your changes + test looks good to me. The way we can pass data to overseer (via CoreState) is a bit limited. I think we might want to move to different kind of mechanism later, for example a simple work queue hosted in zk. That would make things simpler both in overseer implementation and also the parts that need to pass information to overseer. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13204530",
            "date": "2012-02-09T13:59:51+0000",
            "content": "Thanks Sami and Bruno! "
        }
    ]
}