{
    "id": "SOLR-5120",
    "title": "Solrj Query response error with result number",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "This is my simple code : \n\n QueryResponse qr;\n        try {\n            qr = fs.execute(solrServer);\n\n\n\n            System.out.println(\"QUERY RESPONSE : \" + qr);\n\n            for (Entry<String, Object> r : qr.getResponse()) \n{\n                System.out.println(\"RESPONSE: \" + r.getKey() + \" -> \" + r.getValue());\n            }\n            SolrDocumentList dl = qr.getResults();\n            System.out.println(\"--RESULT SIZE:[ \" + dl.size() );\n\n\n        } catch (SolrServerException e) \n{\n            e.printStackTrace();\n        }\n\nI am using solrj and solr-core version 4.4.0. And there is a bug probably in solrj in query result. I am creating one simple txt doc with content 'anna' and then i am restar solr and try to search this phrase. Nothing is found but this is my query response system out \n{numFound=1,start=1,docs=[]}\n.\n\nSo as you can see ther is info that numFound=1 but docs=[] <-- is empty. Next i add another document with only one word 'anna' and then try search that string and this is sysout; \n\n{numFound=2,start=1,docs=[SolrDocument\n{file_id=9882, file_name=luk-search2.txt, file_create_user=-1, file_department=10, file_mime_type=text/plain, file_extension=.txt, file_parents_folder=[5021, 4781, 341, -20, -1], _version_=1442647024934584320}\n]}\n\n\nSo as you can see ther is numFound = 2 but only one document is listed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13731175",
            "date": "2013-08-06T19:51:20+0000",
            "content": "This should have been brought up on the solr-user mailing list, or perhaps the IRC channel.  Even if it were actually a bug, which it's not, it should have been discussed first.\n\nhttp://lucene.apache.org/solr/discussion.html\n\nYour response indicates that your query has a \"start\" parameter of 1.  If that had been set to zero or omitted entirely, you would have seen both results. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13733589",
            "date": "2013-08-08T15:19:18+0000",
            "content": "Łukasz Woźniczka I have a question to ask you:\n\nWhat resources did you look at in order to decide that you should file a bug to get an answer to your question?  The reason that I ask is because we have been seeing an increase recently in the number of people who file a bug for support issues instead of asking for help via our discussion resources like the mailing list.  This suggests that there might be some incorrect support information out there that needs correction.\n\nRelated to your issue: If setting the start parameter to 0 or omitting the parameter didn't fix your issue, then this issue can be reopened, but I'm confident that this is the problem. "
        },
        {
            "author": "Łukasz Woźniczka",
            "id": "comment-13733606",
            "date": "2013-08-08T15:38:32+0000",
            "content": "Shawn Haisey its my fault sorry. I am setting start parameter = 1  "
        }
    ]
}