{
    "id": "SOLR-4548",
    "title": "Stalled shutdown observed running TestSolrProperties",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Running the full tests suite against trunk r1454630 i noticed \"TestSolrProperties.testProperties\" stalled for a whle and begin taking thread dumps.\n\nAll of the dumps seem to follow the same basic structure: \n\n\n\ta handfull of searcherExecutor threads WAITING on the ThreadPoolExecutor\n\tthe main test thread in CoreContainer.shutdown locked & waiting on CloserThread\n\tCloserThread locked & waiting on an Object\n\n\n\nThere's no indication that the problem has anything to do with this test, it seems like a generic porblem that could affect any solr users on shutdown.",
    "attachments": {
        "TestSolrProperties.testProperties.stalled_788_dump.txt": "https://issues.apache.org/jira/secure/attachment/12572877/TestSolrProperties.testProperties.stalled_788_dump.txt",
        "TestSolrProperties.testProperties.stalled_1208_dump2.txt": "https://issues.apache.org/jira/secure/attachment/12572874/TestSolrProperties.testProperties.stalled_1208_dump2.txt",
        "TestSolrProperties.testProperties.stalled_1328_dump.txt": "https://issues.apache.org/jira/secure/attachment/12572873/TestSolrProperties.testProperties.stalled_1328_dump.txt",
        "TestSolrProperties.testProperties.stalled_788_dump2.txt": "https://issues.apache.org/jira/secure/attachment/12572876/TestSolrProperties.testProperties.stalled_788_dump2.txt",
        "TestSolrProperties.testProperties.stalled_1208_dump.txt": "https://issues.apache.org/jira/secure/attachment/12572875/TestSolrProperties.testProperties.stalled_1208_dump.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13597780",
            "date": "2013-03-09T01:20:13+0000",
            "content": "thread dumps from jstack.  file names are based on the most recent \"stalled for XXXs  at: TestSolrProperties.testProperties\" message logged by the junit runner at the time i took the thread dump. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13601214",
            "date": "2013-03-13T15:05:02+0000",
            "content": "Hoss:\n\nThanks for reporting this, but it's totally impossible (tm)..... Yeah, sure. Seriously though I really don't see how this can come about, which just means I'm missing something. But the code has changed and I'll iterate this all day today on my old machine to see if I can make it happen. Please let me know if you see it again. Except I can't iterate, see the note I just sent to the dev list about -Dtestcase=blahblah. Siiigggghhhh\n\nThat code should\n1> set the shutdown flag in CoreContainer\n2> wake up the sleeping backgroundCloser thread (one place it's blocked). This should immediately stop trying to look at or close anything and should terminate\n3> wait for the backgroundCloser thread to stop (the join). Which it should do immediately after being woken up.\n\nThere's not much else that's happening here. One thread is waiting on the join for the backgroundCloser thread, and the backgroundCloser thread is waiting to be awakened off the wait it's doing. But immediately before the join, and after the shutdown flag has been set, there's a notifyAll happening on the lock object.\n\nNow, the basic assumption I've been operating on all along is that there is one and only one CoreContainer, so the \"volatile boolean isShutdown;\" variable in CoreContainer is the same one accessed in my thread as is set in the code that calls backgroundCloser.join.\n\nBut when I can run individual tests I'll see if I can force this to happen again. If you see it again can you ping this JIRA? And what's the environment you're running on? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13602555",
            "date": "2013-03-14T18:40:41+0000",
            "content": "Hoss:\n\nI finally got by my problem with running this test individually and ran TestSolrProperties 1,000 times both on trunk and 4x. Given that I did re-work the locking code since you reported this and that I can't get it to break I'm closing this JIRA.\n\nThanks for the stack traces, they helped me know where to look....\n\nOf course if you disagree feel free to reopen. And if you see this again, holler. "
        }
    ]
}