{
    "id": "SOLR-3900",
    "title": "LogWatcher Config Not Persisted",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "multicore"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When the solr.xml file is set to persistent=\"true\", the logging element that contains the LogWatcher configuration is not persisted to the new solr.xml file that is written when managing the cores via core admin.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Michael Garski",
            "id": "comment-13543495",
            "date": "2013-01-04T01:14:37+0000",
            "content": "I have some time available and was going to start working on this (I have a custom logback watcher), however I noticed more than once on the mailing list that there is a desire to move away from using solr.xml and instead determining the cores by walking the directories. Would solr.xml still exist in this case but only for configuring application-level items such as a LogWatcher and not contain any core info? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13543550",
            "date": "2013-01-04T02:33:41+0000",
            "content": "The current thinking (subject to change) is that there will be a properties file (typical, simple Java Properties-compliant file of name=value pairs) that'll hold what would currently go in  the  <solr> or <cores> tags. All of the individual <core> tags would be obsoleted, and found through discovery. So you'd have entries like\nsolr.cores.adminpath=\nsolr.cores.defaultCoreName=\n\netc. in solr.properties, all of which could be overridden on by system properties.\n\nCurrently SOLR-4196 is where the action on this is coming from. This will not be available until 4.2, and of course the whole 4.x code line will continue to read the solr.xml file. "
        },
        {
            "author": "Michael Garski",
            "id": "comment-13544071",
            "date": "2013-01-04T17:56:44+0000",
            "content": "Thanks Erick! I'll close this and keep an eye on SOLR-4196. "
        },
        {
            "author": "Michael Garski",
            "id": "comment-13544076",
            "date": "2013-01-04T17:58:43+0000",
            "content": "This will be resolved when SOLR-4196 is completed. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13545414",
            "date": "2013-01-06T14:47:28+0000",
            "content": "Michael:\n\nI'm re-opening this issue, since we'll be supporting solr.xml through the 4.x life cycle. There are a lot of changes necessary for 4196 and this might well be lost if we don't have an open JIRA for it.\n\nTreat the re-opening as a suggestion, feel free to re-close it if you think it should be. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13620440",
            "date": "2013-04-03T00:24:54+0000",
            "content": "I'm not going to be able to work on this, plus I only took it because I was in the code, plus logging is currently changing so I'll leave it to more ambitious souls.\n\nFWIW, solr.xml is making a resurgence so if Michael wants to pick it back up that'd be great! "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13684895",
            "date": "2013-06-17T01:38:30+0000",
            "content": "Fixed as part of SOLR-4910 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716829",
            "date": "2013-07-23T18:38:42+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}