{
    "id": "SOLR-4456",
    "title": "Admin UI: Displays dashboard even if Solr is down",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "1. Run Solr and bruing up the Admin dashboard\n2. Stop Solr\n3. Click around the Admin GUI. It apparently works, but displays a spinning wheel for most panels\n4. Click on \"Dashboard\". An old cached dashboard is displayed\n\nWhat should happen is that once connection to Solr is lost, the whole Admin UI displays a large red box \"CONNECTION LOST\" or something",
    "attachments": {
        "SOLR-4456.patch": "https://issues.apache.org/jira/secure/attachment/12574535/SOLR-4456.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13606966",
            "date": "2013-03-19T22:43:46+0000",
            "content": "Have you seen this, Stefan Matheis (steffkes)? Is it related to caching in any way, like SOLR-4311? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13607497",
            "date": "2013-03-20T10:50:37+0000",
            "content": "Hey Jan Høydahl, yes already saw this, but had no clue until yesterday if there is a way to detect that properly ;o\n\nThat's not related to the caching issue .. that's another kind of caching :/ It's still in the Browser DOM (Document Object Model), that's why you can see it w/o having a server-connection. I'll try to bring up a hackish patch that we can check if the detection works the way it should .. and if it does, i'm going to put some layout over it and we're done, hopefully *g "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13607543",
            "date": "2013-03-20T12:21:06+0000",
            "content": "Jan Høydahl would you mind trying this? I'm mainly interested in the fact if the 'offline'-detection works properly – having said that, if you're using the UI, shutting Solr down and try to continue, if a dark overlay containing a white box which says \"Connection lost ...\" appears on your screen?\n\nIn addition to that, my idea would be:\n\n\tRequesting a ressource (f.e. /admin/system or sth like that) to discover if we're back online\n\tIf so, displaying another note saying \"Reload the Page to continue\"\n\n\n\nWhat i would like to do, is: resume the UI where it stopped – but i'm not sure if that will work out. For that we have to track every single request and try to re-execute it again .. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13607549",
            "date": "2013-03-20T12:36:01+0000",
            "content": "Yep, it works well. I can see the white box in Chrome on Mac.\n\nDon't think it's important to resume the UI where you left. But perhaps the white alert box could have a clickable link \"retry\" which simply reloads the page? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13631951",
            "date": "2013-04-15T18:07:35+0000",
            "content": "Updated Patch. Now, if the Layer appears, the Browser will be checking in the background if the server is available again. (the background check uses a exponential function to avoid hammering the server)\n\nWhen that's the case, all the bad-red things will change into friendly-green ones, telling you that the instance is available again und that you should reload the page.\n\nWhile playing around with it, i though about automatically reloading the page .. but i'm not really sure if that's clear what happend from a users perspective? If you're not sitting in front of the browser (especially this tab) and you view it again and the layer is done w/o you doing anything? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13688426",
            "date": "2013-06-19T20:40:14+0000",
            "content": "committed the current state in\ntrunk r1494765\nbranch_4x r1494768\n\nif there a suggestions for tweaking take, please open a new ticket for that "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716815",
            "date": "2013-07-23T18:38:40+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}