{
    "id": "SOLR-9314",
    "title": "Add all known transformers to TestRandomFlRTGCloud and fix any bugs found",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [
            "6.2",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "SOLR-9285 is/has added a new TestRandomFlRTGCloud for testing out random permutations of fl params in RTG requests.\n\nsimple field names, field renames, field globs, and ValueSources/functions are already tested – adding additional DocTransformers is fairly straight forward by implementing a simple FlValidator.\n\nThis issue is being filed to track the work needed to:\n\n\treview the list of all DocTransformers in solr and add test coverage of them in this method\n\tfile any blocker issues if new bugs are found in this process\n\tonce all DocTransformers are accounted for, update TestRandomFlRTGCloud to programatically compare the list of FlValidator's it knows about with the list of all DocTransformers (similar to how QueryEqualityTest.testParserCoverage works) to fail the test if anyone adds a DocTransformer w/o adding corisponding test coverage to this class.",
    "attachments": {
        "SOLR-9314.patch": "https://issues.apache.org/jira/secure/attachment/12819213/SOLR-9314.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-07-20T22:23:15+0000",
            "author": "Hoss Man",
            "content": "WIP patch with new validators for [shard], [explain], [value],  [geo], and [subquery]\n\nThe subquery validation tries to search for all docs with teh same field value as the current doc, asserting that there is always at least 1 match – but this assertion currently fails ... by the looks of it this is (obviously) because it doesn't know to to use the realtime seracher re-opened by the RTG ... but based on how the SubQueryAugmenter is implemented, i'm not even certain how to go about it. ",
            "id": "comment-15386730"
        },
        {
            "date": "2016-08-03T01:55:07+0000",
            "author": "Hoss Man",
            "content": "Updated patch to include a \"testCoverage\" that compares what validators we have with TransformerFactory.defaultFactories and a new RawFieldValueValidator for testing the [json] and [xml] transformers (backed by RawValueTransformerFactory)\n\nThere's currently test failures related to RawFieldValueValidator – i haven't dug in in depth, but it doesn't look like a test bug, it might be an actual bug in RawValueTransformerFactory when dealing with uncommited docs – need to do some manual testing to sanity check.  (I skimmed teh code in RawValueTransformerFactory but nothing jumped out at me) ",
            "id": "comment-15405169"
        },
        {
            "date": "2016-08-03T21:57:12+0000",
            "author": "Hoss Man",
            "content": "RawValueTransformerFactory is in fact broken in cloud mode (RTG or otherwise) – spun that off into SOLR-9376.  Also filed SOLR-9377 to track fixing [subquery] ... both of those are going to be tricky, and i don't want the rest of these tests to be held up waiting for a fix.\n\nThis updated patch cleans up all the nocommits, adds coverage for [shard] testing (which i thought i already had, but evidently not) and punts on the issue of testing [child] – i just don't see any straight forward way of incorporating testing of that into this class w/o some serious changes to how the randomized updates happen, so i've filed SOLR-9379 to look into that further.\n\n—\n\nI think this patch is good to go as is. ",
            "id": "comment-15406692"
        },
        {
            "date": "2016-08-04T17:36:04+0000",
            "author": "ASF subversion and git services",
            "content": "Commit f5ae939bbd8d8e534e82e310d84f6bb8512b1b50 in lucene-solr's branch refs/heads/branch_6x from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=f5ae939 ]\n\nSOLR-9314: beef up TestRandomFlRTGCloud\n\n(cherry picked from commit d07f2dd87de61674f9685b1c6021e55cdad1158f) ",
            "id": "comment-15408187"
        },
        {
            "date": "2016-08-04T17:36:05+0000",
            "author": "ASF subversion and git services",
            "content": "Commit d07f2dd87de61674f9685b1c6021e55cdad1158f in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d07f2dd ]\n\nSOLR-9314: beef up TestRandomFlRTGCloud ",
            "id": "comment-15408188"
        },
        {
            "date": "2016-08-26T14:00:06+0000",
            "author": "Michael McCandless",
            "content": "Bulk close resolved issues after 6.2.0 release. ",
            "id": "comment-15439020"
        }
    ]
}