{
    "id": "SOLR-4919",
    "title": "Allow setting ResponseParser and RequestWriter on LBHttpSolrServer",
    "details": {
        "affect_versions": "4.3",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Patch to allow setting parser/writer on LBHttpSolrServer.  Will only work if no server objects exist within.  Part of larger issue SOLR-4715.",
    "attachments": {
        "SOLR-4919.patch": "https://issues.apache.org/jira/secure/attachment/12587284/SOLR-4919.patch",
        "SolrExampleStreamingTest-failure-linux.txt": "https://issues.apache.org/jira/secure/attachment/12587489/SolrExampleStreamingTest-failure-linux.txt",
        "SolrExampleJettyTest-testfail.txt": "https://issues.apache.org/jira/secure/attachment/12587375/SolrExampleJettyTest-testfail.txt",
        "TestReplicationHandler-testfail.txt": "https://issues.apache.org/jira/secure/attachment/12587376/TestReplicationHandler-testfail.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13680561",
            "date": "2013-06-11T19:09:34+0000",
            "content": "Attached patch.  In addition to adding methods for setting parser/writer, it removes the unnecessary 'throws MalformedURLException'.  I might need to leave that in for 4.x, would appreciate some advice there. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680680",
            "date": "2013-06-11T21:12:37+0000",
            "content": "Updated patch that actually works.  Tests pass on trunk.  It does change some method signatures so they don't include throwing an exception, is that a bad thing to do for 4x? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13680685",
            "date": "2013-06-11T21:17:05+0000",
            "content": "We tend to be a bit more lax with the java apis than the http apis for back compat - especially since a lot of the java apis could still use improvement.\n\nConsider the affect of the change, is it worth the small hassle, and document well in CHANGES.txt. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680689",
            "date": "2013-06-11T21:21:28+0000",
            "content": "In a later issue I intend to deprecate the constructors on various SolrServer implementations that currently take a parser and replace them with constructors that take a parser and a writer, but that can be done after SOLR-4816 goes in. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680713",
            "date": "2013-06-11T21:40:54+0000",
            "content": "New patch.  Included note on upgrading in CHANGES.txt. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680716",
            "date": "2013-06-11T21:42:31+0000",
            "content": "Left a word out of the new CHANGES.txt note in previous patch.  Fixed in new patch. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13680904",
            "date": "2013-06-12T02:24:10+0000",
            "content": "Doing a quick review of the latest patch...\n\nQQ: the CHANGES entry says \"CloudSolrServer and LBHttpSolrServer methods no longer claim to throw MalformedURLException.\" But, that exception is removed from the sig of LBHttpSolrServer#addSolrServer but is also added to the sig of LBHttpSolrServer#removeSolrServer.\n\nShouldn't we keep it or remove it from all methods? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13680907",
            "date": "2013-06-12T02:31:36+0000",
            "content": "Shouldn't we just require setting the parser/writer in the constructor?\n\nI'm not sure I like this setter methods that only work under certain conditions - it seems much cleaner to require those in the constructor.\n\nI think we should change that, but as it is, the access of aliveServers.size should really be wrapped in a synchronized(aliveServers) block. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680912",
            "date": "2013-06-12T02:52:40+0000",
            "content": "Thanks for the review.  I do have a patch that changes the constructors, I was just trying to get this in so the patch for SOLR-4816 could be simplified. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680920",
            "date": "2013-06-12T03:25:10+0000",
            "content": "I see what I did wrong with removeSolrServer.  I was a little zealous.   I will also incorporate the new constructors.\n\nMy original goal with SOLR-4715 was to mirror (as much as possible) what can be done now with HttpSolrServer.  In pursuit of that goal, I'm inclined to keep the setters, but I could be talked out of it if it's really considered a bad idea. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680967",
            "date": "2013-06-12T05:59:35+0000",
            "content": "A constructor-based patch hits both LBHttpSolrServer and HttpSolrServer.  I'm intentionally not adding a constructor to CloudSolrServer at this time.  After SOLR-4816 I will revisit that in a new issue.\n\nSome tests fail intermittently with this patch.  Sometimes all Solr tests will pass.  In addition to the new patch, I've attached the 'reproduce with' output for the two failures I've noticed so far. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13680968",
            "date": "2013-06-12T06:03:30+0000",
            "content": "Minor update to the patch in CHANGES.txt. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13681219",
            "date": "2013-06-12T13:41:49+0000",
            "content": "A constructor-based patch hits both LBHttpSolrServer and HttpSolrServer. \n\nWhat's wrong with that?\n\nSetters that can only be called in some situations without throwing an exception are pretty ugly little guys - this seems exactly what a construtor is for - what's the motivation for introducing these odd settlers? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13681296",
            "date": "2013-06-12T14:45:08+0000",
            "content": "I don't think there's anything wrong with changing both objects, except that it seems to cause the intermittent test failures.  I can't tell whether my changes are the direct cause or whether they have revealed real bugs, but I do believe that my changes led to the failures.  If anyone has any insight into the attached failures, please let me know.\n\nI took the setter approach initially because I was just trying to duplicate existing HttpSolrServer functionality.  Now that I've been digging around for a while, I see why that approach wasn't taken from the beginning.\n\nRight now I am hoping to get something in quickly so Joel Bernstein can improve CloudSolrServer on SOLR-4816 without needing to internally extend LBHttpSolrServer.  The setter approach seems to do that, although now that I think about it, I would need to create a test to make sure. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13681300",
            "date": "2013-06-12T14:47:50+0000",
            "content": "I would need to create a test to make sure.\n\nYeah, thats the last issue I was going to bring up - we have no new tests yet that call these setters (at least that eclipse could find for me).\n\nRight now I am hoping to get something in quickly \n\nI think we should try and get it right - if we just put this in to get something in, someone will start using these setters or something and then we will just pull them...\n\nLet's figure out what's going on with the test fails. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13681304",
            "date": "2013-06-12T14:49:24+0000",
            "content": "If anyone has any insight into the attached failures, please let me know.\n\nWhat specific patch do I have to apply to get where you got these fails? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13681334",
            "date": "2013-06-12T15:38:46+0000",
            "content": "What specific patch do I have to apply to get where you got these fails?\n\nThe newest patch should do it.  I am about to upload another patch, which if I did everything correctly last night, will only have some updates to javadocs.\n\nI got those failures on Windows 8 with 1.7.0_21 64-bit.  I will try on Linux. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13681336",
            "date": "2013-06-12T15:39:21+0000",
            "content": "New patch with information in javadocs about what happens with null parser/writer values. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13681553",
            "date": "2013-06-12T19:36:36+0000",
            "content": "Applied my latest patch to trunk on Linux.  Got a new test failure similar to one of the ones I got on Windows.  Attaching the full test log. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13681912",
            "date": "2013-06-13T04:54:23+0000",
            "content": "The email from Policeman Jenkins build #2885 that showed up earlier today looks very similar to two of the failures I've attached here, so perhaps those failures are not my patch after all.\n\nThe ThreadLeakError in TestReplicationHandler is really mystifying.  That one seems less likely to be connected to this patch. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13682233",
            "date": "2013-06-13T13:18:05+0000",
            "content": "Updated patch.  The only change is the removal of an import that was no longer needed. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13682238",
            "date": "2013-06-13T13:33:04+0000",
            "content": "I'll take another pass over this today. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13686103",
            "date": "2013-06-17T22:34:06+0000",
            "content": "Updated patch, because previous one has merge conflicts with current trunk.\n\nPoliceman Jenkins build #2939 from today looks nearly identical to build failures I'm seeing. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13702460",
            "date": "2013-07-08T21:31:32+0000",
            "content": "Patch updated to latest trunk. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13702465",
            "date": "2013-07-08T21:34:08+0000",
            "content": "All standard solr tests passed on latest trunk.  I've only run the tests once so far.  I will run them again, then add nightly, then weekly. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717338",
            "date": "2013-07-23T18:47:55+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971023",
            "date": "2014-04-16T12:56:55+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "David Smiley",
            "id": "comment-14116807",
            "date": "2014-08-31T15:49:30+0000",
            "content": "The parser & writer methods are there now.  Apparently it got in as part of SOLR-3249 which landed in Solr 4.5.  Time to close this issue? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14117543",
            "date": "2014-09-01T16:43:42+0000",
            "content": "Looks like my patch was about constructors, not methods.\n\nI did think of something only related by a tangent, so it probably needs a new issue: Should setParser and setRequestWriter throw UnsupportedOperationException (or some other descendant of RunTimeException)) if the LB object already contains HttpSolrServer objects? "
        },
        {
            "author": "Jason Gerlowski",
            "id": "comment-16660692",
            "date": "2018-10-23T13:59:55+0000",
            "content": "Modern LBHttpSolrClient has a setParser and a setRequestWriter method to achieve this, unless I miss the point of this JIRA.  I imagine this can be closed.  Will close in a few days unless anyone corrects me. "
        }
    ]
}