{
    "id": "SOLR-7303",
    "title": "Full import having problem",
    "details": {
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "4.3.1"
        ],
        "affect_versions": "4.0-BETA",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "We have the problem with full-import. if we did the full import also the all documents are not taking the updated data from the database view.\n\nDue to SOLR indexing problem the sort is not working as we expected but the code is updated and it is reflecting for some of the items in the site.\n\nkindly find the steps below for more information.\n\n1. I have updated the database view i.e changed the table name for the single column in the view.\n2. did the full import\n3. But still some of the documents have the old data(for updated single field).\n4. And the document get changed only if the document have changes.\n\nexample.\ni have the field name as \"hits\". now i have taken the \"hits\" from different table than previous so that i did the full import to change the \"hits value\" in all the document in the solr. But some documents still have the old hits value. even i have restarted also the problem not get solved.\n\nkindly check and help me.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-25T15:41:05+0000",
            "author": "Erick Erickson",
            "content": "Please raise issues first on the user's list rather than raising a JIRA. We try to keep the JIRA for code issues rather than what looks, at first glance, like a usage questions. If the consensus is that this is really a code issue, we can re-open.\n\nIn the case almost certainly you are not updating all the documents thus the old values are still seen in certain docs. The other possibility is that you're not issuing a commit afterwards and not waiting until your autocommit kicks in (soft commit or hard commit with openSearcher=true in solrconfig.xml). I don't remember offhand whether DIH issues commits automatically.\n\nSo you have to confirm that all the id's are updated when you do a full import, which may not happen if some of the original records were, say, deleted. ",
            "id": "comment-14380066"
        }
    ]
}