{
    "id": "SOLR-4565",
    "title": "Extend NorwegianMinimalStemFilter to handle \"nynorsk\"",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Norway has two official languages, both called \"Norwegian\", namely Bokmål (nb_NO) and Nynorsk (nn_NO).\n\nThe NorwegianMinimalStemFilter and NorwegianLightStemFilter today only works with the largest of the two, namely Bokmål.\n\nPropose to incorporate \"nn\" support through a new \"vaiant\" config option:\n\n\n\tvariant=\"nb\" or not configured -> Bokmål as today\n\tvariant=\"nn\" -> Nynorsk only\n\tvariant=\"no\" -> Remove stems for both nb and nn",
    "attachments": {
        "SOLR-4565.patch": "https://issues.apache.org/jira/secure/attachment/12588143/SOLR-4565.patch",
        "SOLR-4565-schema-comments.patch": "https://issues.apache.org/jira/secure/attachment/12590433/SOLR-4565-schema-comments.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13600422",
            "date": "2013-03-12T20:19:02+0000",
            "content": "Erlend Garåsen, what do you think about this way of supporting nn in the same stemmer? I think it's better than adding two more classes to Lucene/Solr. Not sure about the name of the config param. Could also use \"language\" as snowball does, but nb and nn are more language variants than languages.. "
        },
        {
            "author": "Erlend Garåsen",
            "id": "comment-13662842",
            "date": "2013-05-21T09:34:38+0000",
            "content": "I think this is a reasonable approach. I will create a patch within a week or so.\n\n\nNot sure about the name of the config param.\n\n\"variant\" is a good suggestion. "
        },
        {
            "author": "Erlend Garåsen",
            "id": "comment-13662871",
            "date": "2013-05-21T10:45:11+0000",
            "content": "There are not so many differences between the stemming rules for these two languages. The only difference is that you must skip some rules for Nynorsk if you have configured the stemmer to only use Bokmål.\n\nBoth Nynorsk and Bokmål have endings with \"-ene\", for instance many feminine indefinite nouns in plural form such as \"jentene\" (same for both languages). For these nouns, you must only exclude stemming for words ending with \"-ane\" if you have configured it for Bokmål.\n\nThe same rules apply to masculine indefinite nouns in plural form for Nynorsk, i.e. endings with \"-ar\". The stemmer must skip those endings as long as only Bokmål is used. "
        },
        {
            "author": "Erlend Garåsen",
            "id": "comment-13685546",
            "date": "2013-06-17T13:25:46+0000",
            "content": "This patch includes Nynorsk support for both NorwegianMinimalStemFilter and NorwegianLightStemFilter. Their test classes have been extended accordingly.\n\nFor backward-compatibility the stemmers will only use Bokmål if no variant is configured. Otherwise, the following variants are valid: no (for both Bokmål and Nynorsk), nn (for only Nynorsk) and nb (for only Bokmål). "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13686263",
            "date": "2013-06-18T00:59:42+0000",
            "content": "This looks nice: maybe instead of using String as a parameter, the stemmer can take enum or int flags? The latter seems simplest to me as \"both\" is allowed, and then we wouldnt need the useNynorsk() or useBokmaal() that do string comparisons. "
        },
        {
            "author": "Erlend Garåsen",
            "id": "comment-13690217",
            "date": "2013-06-21T12:15:02+0000",
            "content": "I think we still need the two methods in order to determine whether we should stem for the two variants respectively, and for readability of course. I will try to explain below.\n\nFor backward-compatibility, only Bokmål should be used if no variant is defined. Therefore, the useBokMaal method will also return true if there are no variants defined. The same applies if \"no\" is set as a variant. This means that both Nynorsk and Bokmål are set, and thus, useBokmaal should return true as well. I encapsulated this into methods for readability reasons. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13690316",
            "date": "2013-06-21T14:17:31+0000",
            "content": "Here's a patch showing what i mean...\n\nalso some of the endings should be reviewed, because tests didnt pass. \n\ni noticed -heten was configured for Nynorsk-only, but its expected to be removed according to the nb_light.txt test file. "
        },
        {
            "author": "Erlend Garåsen",
            "id": "comment-13694586",
            "date": "2013-06-27T09:49:39+0000",
            "content": "\nHere's a patch showing what i mean...\n+1\nI can create another patch including these changes.\n\n\nalso some of the endings should be reviewed, because tests didnt pass.\n\ni noticed -heten was configured for Nynorsk-only, but its expected to be removed according to the nb_light.txt test file.\n\nThe tests pass. -heten is handled correctly if you take a look in my first patch. -heten should only be configured for Bokmål, not Nynorsk:\n\n+         (endsWith(s, len, \"heten\") &&\n+          useBokmaal(variant)) ||  // general ending (hemmelig-heten -> hemmelig)\n\n\n\nThe equivalent for this ending using Nynorsk is \"-heita\".\n\nMy summer vacation starts tomorrow, so it might take a couple of weeks till I have another patch ready - unless I get some time to fulfill this task tomorrow. "
        },
        {
            "author": "Erlend Garåsen",
            "id": "comment-13694705",
            "date": "2013-06-27T13:29:06+0000",
            "content": "Here's another patch including flags and with some corrections regarding -heten endings. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13694793",
            "date": "2013-06-27T15:25:35+0000",
            "content": "Thanks for updating the patch before vacation Erlend. I reviewed it and especially compared Bokmål endings to the previous version, and its completely backwards compatible. I'm gonna commit soon. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13694808",
            "date": "2013-06-27T15:41:26+0000",
            "content": "Thanks Erlend and Jan! "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13695709",
            "date": "2013-06-28T19:29:29+0000",
            "content": "Thanks Robert! "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13697804",
            "date": "2013-07-02T14:01:38+0000",
            "content": "With this change, I propose also to update the comments in schema.txt to make the new \"variant\" param visible and understandable. See SOLR-4565-schema-comments.patch\n\nWhat do you think? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13697809",
            "date": "2013-07-02T14:06:57+0000",
            "content": "+1\n\nI think it would also be ok to make fieldtypes for the languages. e.g. I noticed the nynorsk-specific stopwords for example are clearly marked in the file from snowball. (Currently we just have a file for \"no\" that contains both). We could always do that later, too. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13697827",
            "date": "2013-07-02T14:23:24+0000",
            "content": "Committed this simple change to trunk (r1498948) and branch_4x (r1498951) to get it in 4.4. Later we could add specific text_nn and text_nb fields. Especially if language detection is also extended to detect the variants...\n\nPS: I messed up the commit message with wrong JIRA number SOLR-4412, so had to remove the comments made by the very nice commit tag bot from there... "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716867",
            "date": "2013-07-23T18:38:49+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}