{
    "id": "SOLR-71",
    "title": "New support for \"Date Math\" when adding/quering date fields",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "search",
            "update"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "New utility class and changes to DateField to support syntax like the following...\n\n          startDate:[* TO NOW]\n          startDate:[* TO NOW/DAY+1DAY]\n          expirationDate:[NOW/DAY TO *]\n          reviewDate:[NOW/DAY-1YEAR TO NOW/DAY]\n          validDate:[NOW/MONTH TO NOW/MONTH+1MONTH-1MILLISECOND]\n\n...where + and - mean what you think, and \"/UNIT\" rounds down to the nearest UNIT.  The motivation for this being that date range queries like these are usefull for filters, but being date sensitve can't currently be \"baked in\" to a config as default params.\n\na nice side effect of the implimentation, is that \"timestamp\" fields can be done with a document is added by using...\n\n   <field name=\"myTimestampField\">NOW</field>\n\n...and Solr will compute the value when adding the document ... if we add default values to the schema.xml even that won't be neccessary.\n\n\nComments?  \n\n(I'd be particularly gratefull if smarter people then I would sanity check my use of ThreadLocal for managing the DateFormat in DateField ... i've never used ThreadLocal before.  Any general comments on the syntax would also be appreciated: This left-to-right syntax seemed more intuative to write (and easier to parse) then some of the other syntaxes I'd considered)",
    "attachments": {
        "DateMath.patch": "https://issues.apache.org/jira/secure/attachment/12345265/DateMath.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12450947",
            "date": "2006-11-18T01:36:23+0000",
            "content": "\nCode, and tests ... if you readd the exampledocs the \"incubationdate_dt\" field is populated for the Solr product so you can play with it...\n\nincubationdate_dt:[* TO NOW-1DAY+3HOURS/MINUTE] ... matches.\nincubationdate_dt:[* TO NOW-2YEARS]  ... does not match. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12450956",
            "date": "2006-11-18T02:30:50+0000",
            "content": "Sweet!\n\nA couple of very minor notes regarding ThreadLocal:\n\n\tinitialValue doesn't need to be synchronized... it's just that way in the javadoc example because they were incrementing a global counter\n\tthe trick you are trying in the ThreadLocalDateFormat aren't necessary.  no method will be called until the constructor has completed.  the java memory model also ensures that you see a completely constructed object from another thread, even if you haven't synchronized.  The extra variable won't hurt either... the JVM will completely optimize it away (so this is just an FYI).\n\n "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12450981",
            "date": "2006-11-18T08:14:19+0000",
            "content": "This looks like a very useful feature! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12451503",
            "date": "2006-11-21T01:57:46+0000",
            "content": "commited with some small modifications:\n\n1) got rid of the unneeded synchronized Yonik pointed out\n2) improved the javadocs a bit\n3) added mention of DateMath in example schema.xml\n4) added an example of a \"baked in\" Date Math query to the example solrconfig.xml "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589364",
            "date": "2008-04-15T23:56:45+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}