{
    "id": "SOLR-3964",
    "title": "Solr does not return error, even though create collection unsuccessfully",
    "details": {
        "affect_versions": "4.0",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Solr does not return error,\n even though create/delete collection unsuccessfully; \n even though the request URL is incorrect;\n（example： http://127.0.0.1:8983/solr/admin/collections?action=CREATE&name=tenancy_milesnumShards=3&numReplicas=2&collection.configName=myconf）\n\n even though pass the collection name  already exists;",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13482575",
            "date": "2012-10-23T19:01:53+0000",
            "content": "can you please elaborate on what problem you are seeing.\n\nspecifically: \n1) how are you running solr and what do your configs look like (ie: it appears you are running in cloud mode, but that's not certain)\n2) what commands/requests do you execute that don't behave the way you expect\n3) whta response do you expect from those commands/requests\n4) what response do you actually get from those commands/requests\n\n\noff the cuff i suspect that unless you made a cut/paste mistake when creating this issue, the problem you are having is that you are missing a \"&\" in your URL, and what solr is doing is creating a collection with the name \"tenancy_milesnumShards=3\" when what you really want is a collection named \"tenancy_miles\" (which you imply already exists, but haven't provided any concrete details for us to be certain) "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13482689",
            "date": "2012-10-23T21:05:37+0000",
            "content": "Solr does not return error,\n\nThis is a limitation of the current collections API - you don't currently get a response - it just drops the create command on the queue where the overseer will pull it.\n\nOptionally waiting around for completion or adding some way to check the status of the cmd is something we need to add. "
        },
        {
            "author": "Raintung Li",
            "id": "comment-13493048",
            "date": "2012-11-08T08:56:45+0000",
            "content": "Fix it in the https://issues.apache.org/jira/browse/SOLR-4043, anyone will check it? "
        }
    ]
}