{
    "id": "SOLR-8382",
    "title": "Allow configuration of the bind IP(host) in solr 5",
    "details": {
        "components": [
            "Server"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "With the new standalone configuration, I haven't been able to configure solr to bind to a specific IP. Is there an option to do so?\n\nSo far I've had to configure the firewall to block access to to port instead of simply making solr bind to only the interface I want it to.\n\nAdding a clear option to manage the bind host (like we have for the bind port) would be very useful.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-07T17:36:17+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "I blogged about this a while back: http://shal.in/post/127561227271/how-to-make-apache-solr-listen-on-a-specific-ip ",
            "id": "comment-15045312"
        },
        {
            "date": "2015-12-07T17:48:39+0000",
            "author": "Xavier",
            "content": "I had tried the SOLR_HOST option, but as you discovered, it only changes the ip used for solrcloud calls; it leaves the bind ip unchanged.\n\nAs for directly setting jetty.host, while it may work for now, the fact that solr internally uses jetty is an implementation detail (as specified by the docs), and should not be relied on. At the very least, the bin/solr script should translate some sort of option, maybe SOLR_BIND_IP or something, into the required jetty parameter. ",
            "id": "comment-15045331"
        },
        {
            "date": "2015-12-07T17:59:24+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "You are right. I initially though that we should use the same SOLR_HOST for both jetty and solrcloud but there is some pushback on that. There is an issue open for that SOLR-7977 so please add your opinion on that issue.\n\nhttps://issues.apache.org/jira/browse/SOLR-7977 ",
            "id": "comment-15045355"
        },
        {
            "date": "2015-12-07T18:03:39+0000",
            "author": "Xavier",
            "content": "Thanks, will do. ",
            "id": "comment-15045364"
        }
    ]
}