{
    "id": "SOLR-3606",
    "title": "Set the default timeout of HttpClient to a nonzero value",
    "details": {
        "affect_versions": "6.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The default timeout of HttpClient in HttpShardHandlerFactory and SolrCmdDistributor is set to zero.\nZero timeout means infinite timeout, which may cause infinite waiting.\n\nConsidering the following case which is observed in our solr cluster:\nThere are two servers A and B in solr cluster with two shards.\nServer A receive a search request from client and send a sub request to server B.\nServer B also receive a search request from client and send a sub request to server A.\nthe two requests cannot be completed forever, if the threads of jetty server in server A and server B exhausted.",
    "attachments": {
        "SOLR-3606.patch": "https://issues.apache.org/jira/secure/attachment/12535639/SOLR-3606.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "jiangwen wei",
            "id": "comment-13409284",
            "date": "2012-07-09T09:18:32+0000",
            "content": "set the default timeout of HttpClient to 10000 milliseconds "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13409368",
            "date": "2012-07-09T11:58:24+0000",
            "content": "A 10 second timeout is too short for some of the types of requests that may be run.  The problem with setting any timeout is that we don't know the upper bound.\nLarge commits or optimizes esp could take a very long time.\n\nThe example server is configured for up to 10K threads to avoid running out. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16312085",
            "date": "2018-01-04T21:49:05+0000",
            "content": "I think based on Yonik's old comment and the lack of alternate ideas in the past 5+ years, this won't be changed. "
        }
    ]
}