{
    "id": "SOLR-9883",
    "title": "example solr config files can lead to invalid tlog replays when using add-unknown-fields-to-schema updat chain",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.4",
            "7.0"
        ],
        "affect_versions": "6.3",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "The current basic_configs and data_driven_schema_configs try to create unknown fields. The problem is that the date processing \"ParseDateFieldUpdateProcessorFactory\" is not invoked if the doc is replayed from the tlog. Whether there are other places this is a problem I don't know, this is a concrete example that fails in the field.\n\nSo say I have a pattern for dates that omits the trialing 'Z', as:\nyyyy-MM-dd'T'HH:mm:ss.SSS\n\nThis work fine when the doc is initially indexed. Now say the doc must be replayed from the tlog. The doc errors out with \"unknown date format\" since (apparently) this doesn't go through the same update chain, perhaps due to the sample configs defining ParseDateFieldUpdateProcessorFactory after  DistributedUpdateProcessorFactory?",
    "attachments": {
        "SOLR-9883.patch": "https://issues.apache.org/jira/secure/attachment/12845578/SOLR-9883.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-12-20T22:55:40+0000",
            "author": "Erick Erickson",
            "content": "There's quite a bit of discussion at SOLR-8030 that's relevant.\n\nI don't quite know whether the simple expedient of putting the URPs before the DistribUpdateProcessorFactory is sufficient (or safe). ",
            "id": "comment-15765491"
        },
        {
            "date": "2017-01-04T17:11:51+0000",
            "author": "Steve Rowe",
            "content": "Attaching a patch that switches example configs's add-unknown-fields-to-schema update chains so that the DUP is after the AddSchemaFields URPF.  In my manual testing (see below), this prevents the data corruption: the buffered tlog entry includes the date normalization. I also made AddSchemaFields URPF implement UpdateRequestProcessorFactory.RunAlways, so that schema modifications will continue to be applied on all replicas (the original rationale for moving the DUP position on SOLR-6137). \n\nFollowing an offline reproduction suggestion from Hoss Man, I was able to manually reproduce the data corruption as follows:\n\n\n\tAdded an artificial 1-minute delay in PeerSync\n\tbin/solr start -e cloud  # nodes=2, coll=gettingstarted, shards=1, rf=2, configset=data_driven_schema_configs\n\tcurl -X POST -H 'Content-type: application/xml' http://localhost:8983/solr/gettingstarted/update -d '<add><doc><field name=\"f_dt\">2015-06-09</field></doc></add>'\n\tkill -9 $(cat bin/solr-7574.pid)\n\tcurl -X POST -H 'Content-type: application/xml' http://localhost:8983/solr/gettingstarted/update -d '<add><doc><field name=\"f_dt\">2015-06-10</field></doc></add>'\n\tbin/solr start -cloud -p 7574 -s \"example/cloud/node2/solr\" -z localhost:9983\n\tcurl -X POST -H 'Content-type: application/xml' http://localhost:8983/solr/gettingstarted/update -d '<add><doc><field name=\"f_dt\">2015-06-11</field></doc></add>'\n\n\n\nI had to add step #3 to create a transaction log entry on the 7574 replica prior to shutdown; otherwise on restart it would refuse to perform peer sync, because it didn't know where to start (due to no recent versions in the tlog) and instead initiated full recovery.\n\nI'm working on an automated data corruption test.\n\nI want to get this change into the 6.4 release. ",
            "id": "comment-15798765"
        },
        {
            "date": "2017-01-04T18:04:09+0000",
            "author": "Steve Rowe",
            "content": "Forgot to mention: with the attached patch, I was no longer able to reproduce the data corruption with the above method. ",
            "id": "comment-15798902"
        },
        {
            "date": "2017-01-07T21:02:09+0000",
            "author": "Steve Rowe",
            "content": "Patch with a new automated data corruption test.  I tried to make a cloud test, but I couldn't get it to work.  Instead, the test in the patch simulates this situation by directly turning on tlog buffering mode in a single core, and sending in an update (with param update.distrib=fromleader) after manually running the \"add-unknown-fields-to-schema\" update chain on it up through the DUP.  The test succeeds with the solr config modifications in the patch, and fails without it.\n\nThe patch also fixes a typos in the replay failure log message (REYPLAY->REPLAY).\n\nI'm running all Solr tests and precommit now.  When they succeed, I'll commit. ",
            "id": "comment-15808141"
        },
        {
            "date": "2017-01-07T21:31:44+0000",
            "author": "Steve Rowe",
            "content": "Updated patch, moves config files to temp dir to avoid permission failures when auto-upgrading the schema file to managed-schema.  (Didn't see this failure when running from IntelliJ.)\n\nAll Solr tests pass, and precommit passes.  Committing shortly. ",
            "id": "comment-15808187"
        },
        {
            "date": "2017-01-07T21:41:31+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 9a6ff177b6f7c776cc6bf4625ed2d5dd7cce81d2 in lucene-solr's branch refs/heads/branch_6x from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9a6ff17 ]\n\nSOLR-9883: In example schemaless configs' default update chain, move the DUP to after the AddSchemaFields URP (which is now tagged as RunAlways), to avoid invalid buffered tlog entry replays. ",
            "id": "comment-15808200"
        },
        {
            "date": "2017-01-07T21:41:34+0000",
            "author": "ASF subversion and git services",
            "content": "Commit d817fd43eccd67a5d73c3bbc49561de65d3fc9cb in lucene-solr's branch refs/heads/master from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d817fd4 ]\n\nSOLR-9883: In example schemaless configs' default update chain, move the DUP to after the AddSchemaFields URP (which is now tagged as RunAlways), to avoid invalid buffered tlog entry replays. ",
            "id": "comment-15808201"
        }
    ]
}