{
    "id": "SOLR-5341",
    "title": "Output version number in logs",
    "details": {
        "affect_versions": "4.5",
        "status": "Closed",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "It would be exceptionally useful from a tech support perspective if the version number were placed in the log during startup.  I'm inclined to make this a WARN log, but if the consensus is to have it at INFO, then I can go that direction.\n\nIt might also be useful to have any shutdown hooks in Solr log the version as well.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13793715",
            "date": "2013-10-13T17:13:13+0000",
            "content": "There might also be other locations where catastrophic or unusual things happen which could benefit from having the version printed, for instances where a partial log is submitted for review.  I wouldn't want to have the version printed extremely often during normal operation, though.  If anyone can think of places that meet this criteria, please let me know. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13793852",
            "date": "2013-10-14T00:03:03+0000",
            "content": "I think it should be logged once at startup and as info. I don't like the idea of marking informational logging under warn. And while I can see it being useful to periodically litter the version in the logs, I really think it should just be logged once on startup. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971091",
            "date": "2014-04-16T12:57:08+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15528842",
            "date": "2016-09-28T08:15:41+0000",
            "content": "Closing as duplicate now that we print version on startup. Although we print this as INFO for now.\n\nPerhaps later we could have a separate class for printing such info which could be set to always log at INFO in log4j.properties "
        }
    ]
}