{
    "id": "SOLR-8911",
    "title": "Admin UI: solr-impl and lucene-impl versions are cut off in SNAPSHOT versions",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.2",
            "7.0"
        ],
        "affect_versions": "5.5",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "I just tried to see Solr's \"compiled on\" date on my dev Solr server, which is running a 5.5.1-SNAPSHOT version, compiled from the branch_5_5 source.\n\nThe \"impl\" strings are so long that the only thing I could tell is that it was compiled this year.  I will attach a screenshot.\n\nIt wasn't possible to see or highlight the full string.  I did manage to see it all when I maximized my browser window (on a 1680x1050 screen), but I really dislike running with windows maximized.  It's not like I keep the windows small either – the screenshot will reflect this.",
    "attachments": {
        "solr-version-cutoff.png": "https://issues.apache.org/jira/secure/attachment/12795646/solr-version-cutoff.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-28T16:26:54+0000",
            "author": "Shawn Heisey",
            "content": "Screenshot showing the -impl version numbers cut off. ",
            "id": "comment-15214412"
        },
        {
            "date": "2016-03-28T16:34:57+0000",
            "author": "Shawn Heisey",
            "content": "For solutions, i see two.  One is to remove the git hash from the version string so it's small enough to be visible in a browser on one of those ultra-light notebook screens.  The other is to use a different HTML element to display informational elements – perhaps a textbox where the text can be selected and scrolled horizontally by the selection (without a scrollbar).  I've seen something like that, but have absolutely no idea what it's called in the HTML/CSS world. ",
            "id": "comment-15214427"
        },
        {
            "date": "2016-03-28T16:37:46+0000",
            "author": "Kevin Risden",
            "content": "How about using the git short hash instead of the full hash? ",
            "id": "comment-15214431"
        },
        {
            "date": "2016-03-28T17:53:46+0000",
            "author": "Shawn Heisey",
            "content": "That would help, and probably would be enough for my purposes.\n\nEven if we do change to the short hash, I want to be sure somebody on a small computer (think about an ultrabook, or a desktop with a tiny screen) has full access to all the info in the admin UI.  If we can support android/IOS mobile devices, that's even better.  Tablets would be more important than phones, but if we do it right, a phone could work.  I know that the old UI is extremely painful on my android phone, but I have not tried the Angular UI yet.\n\nNow that I've thought about the Angular UI, I did just double-check the impl strings there on my desktop, and it has the same problem. ",
            "id": "comment-15214567"
        },
        {
            "date": "2016-03-28T20:27:10+0000",
            "author": "Shawn Heisey",
            "content": "Loading the Angular UI on my Android phone in Chrome shows that it has the same problem with the impl strings that a desktop browser does.  Although you can make a desktop browser show the full string by maximizing it on a monitor with enough pixels available, rotating the phone horizontal and zooming in/out make no difference.\n\nI am pleased to report that the Angular UI actually works on my phone browser.  I can open a separate issue to discuss the few nits that I've noticed. ",
            "id": "comment-15214827"
        },
        {
            "date": "2016-07-26T14:40:46+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user arafalov opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/54\n\n    SOLR-8911: Angular Admin UI: Fix cut-off overflow strings on dashboard page\n\n    Fix too long value strings in the dashboard page (primarily versions and args sections) by adding overflow scrolling. The scrollbar appears when hovered or touched on the individual value area.\n\n    Tested on several browsers on Mac, Windows and Android. On Windows, the scrollbar makes the page jump a little bit for the args section, but is quite usable. On Mac and Android, the scrollbar is inside the area and does not cause a jump.\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/arafalov/lucene-solr-contributions master\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/54.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #54\n\n\ncommit 3c4b5db04935499972c281cc28cce8fb3e529a4a\nAuthor: Alexandre Rafalovitch <arafalov@gmail.com>\nDate:   2016-07-26T14:33:09Z\n\n    Angular Admin UI: Fix cut-off overflow strings on dashboard page (FIX\n    SOLR-8911)\n\n ",
            "id": "comment-15393879"
        },
        {
            "date": "2016-08-13T14:31:20+0000",
            "author": "ASF subversion and git services",
            "content": "Commit c9faa102f99d7e19df5bcd63e16e699f52f2b1db in lucene-solr's branch refs/heads/master from Alexandre Rafalovitch\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=c9faa10 ]\n\nSOLR-8911: Enable scrolling in Admin UI overflows\nIn the dashboard screen, scroll horizontally the Versions and JVM\nproperty values strings. ",
            "id": "comment-15419938"
        },
        {
            "date": "2016-08-13T14:31:30+0000",
            "author": "ASF GitHub Bot",
            "content": "Github user arafalov closed the pull request at:\n\n    https://github.com/apache/lucene-solr/pull/54 ",
            "id": "comment-15419939"
        },
        {
            "date": "2016-08-13T14:43:37+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 7a2b26826142a21a213990c787b2ec42a26a6eec in lucene-solr's branch refs/heads/branch_6x from Alexandre Rafalovitch\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7a2b268 ]\n\nSOLR-8911: Enable scrolling in Admin UI overflows ",
            "id": "comment-15419948"
        },
        {
            "date": "2016-08-13T14:44:52+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Fixed with css changes that allow overflow scrolling. ",
            "id": "comment-15419950"
        },
        {
            "date": "2016-08-13T19:05:09+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Why can't we add a tooltip instead of overflow scrolling? ",
            "id": "comment-15420036"
        },
        {
            "date": "2016-08-13T21:45:32+0000",
            "author": "Alexandre Rafalovitch",
            "content": "There is a couple of reasons in my mind:\n\n\n\tThis also affects much longer JVM properties section, not just version section\n\tIf one wanted to copy the initially obscured portion of the text (e.g. for email or whatever), tooltip does not help\n\tThe information is already there, tooltip would duplicate it, while overflow scroll just makes it visible and copyable\n\tOverflow scroll works on mobile as well\n\tThe CSS was already there dealing with overflow, it just dealt with it by doing the \"...\" indicator that some content was invisible\n\n\n\nAre you experiencing any problems with the current implementation? ",
            "id": "comment-15420092"
        },
        {
            "date": "2016-08-14T01:43:57+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Not at all. It was merely a suggestion but what you wrote makes a lot of sense. Thanks for fixing! ",
            "id": "comment-15420160"
        },
        {
            "date": "2016-08-26T13:59:33+0000",
            "author": "Michael McCandless",
            "content": "Bulk close resolved issues after 6.2.0 release. ",
            "id": "comment-15438997"
        }
    ]
}