{
    "id": "SOLR-959",
    "title": "Remove hardcoded port numbers from TestReplicationHandler",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Test",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "TestReplicationHandler has a hardcoded port of 9999 in it for the \"master\".  hardcoding port numbers in unit tests is very brittle and error prone and can cause problems.  Ideally tests that aren't explicitly testing network related functionality should avoid dealing with the network at all, but when neccessary it's much better to let the OS pick any available port (as most other solr tests do) then to hardcoded it.\n\nin TestReplicationHandler things are a little more complicated because the master port number needs to be refered to in the slave config files.",
    "attachments": {
        "SOLR-959.patch": "https://issues.apache.org/jira/secure/attachment/12399662/SOLR-959.patch",
        "replicationtest-port-refactor.patch": "https://issues.apache.org/jira/secure/attachment/12397851/replicationtest-port-refactor.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12663606",
            "date": "2009-01-14T02:41:13+0000",
            "content": "first pass at a refactoring to clean up the hardcoded ports – takes advantage of the copyFile function that was already in the test to replace a marker token in the config with the real port number.\n\nat first glance this refactoring should work, but testIndexAndConfigAliasReplication errors with this patch --i believe the problem is because it expects the slave to pull files from a master after the master server has been stoped and then restarted – which fails because the new master won't have the same port number.  we could try explicitly creating the new master with the same port as the old master, but there's no guarantee the os won't have already allocated that port to a new process at that point.  A better solution is to eliminate the need to stop/start the master by using core reload or something similar instead.\n\nThe most alarming thing at this point is that several other test methods do similar stop/start of the master, and yet they work fine (even though the slave has no knowledge of the new master port) which suggests to me that the tests may be false positives making flawed assumptions.\n\nunfortunately i don't have any more time to look into this at the moment ... attaching patch as a checkpoint in case someone else wants to look into it (or i get hit by a bus) "
        },
        {
            "author": "Akshay K. Ukey",
            "id": "comment-12671214",
            "date": "2009-02-06T17:38:15+0000",
            "content": "Patch with re-factoring from previous patch and few more changes. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12671257",
            "date": "2009-02-06T19:19:19+0000",
            "content": "Thanks Hoss and Akshay.\n\nThe most alarming thing at this point is that several other test methods do similar stop/start of the master, and yet they work fine (even though the slave has no knowledge of the new master port) which suggests to me that the tests may be false positives making flawed assumptions.\n\nHoss, perhaps the master's port did not change for these tests? It would be best to stop the slaves and re-create their solrconfig using the new master instance's port which is what Akshay has done in the latest patch.\n\nThe latest patch looks good, works well. I'll commit this shortly. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12671259",
            "date": "2009-02-06T19:22:19+0000",
            "content": "Committed revision 741684.\n\nThanks Hoss and Akshay! "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775626",
            "date": "2009-11-10T15:51:55+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}