{
    "id": "SOLR-396",
    "title": "tool to auto generate stub analysis factories",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "a pet project i've bene working on in some spare time has been looking at source code and byte code analysis toolkits with the goal of being able to write a tool that could be pointed at a jar, and it would generate stub Factories for any TokenFilter or Tokenizer classes it found not already in Solr.\n\nin the end, it looks like a combination of reflection and some simple pattern matching is actually the best way to go (byte code loses info about param names, and reflection saves a lot of the hassle involved in pure source code analysis)\n\ni've got a proof of concept ready that i'll attach shortly.  I hope to have some time next week to resubmit this as a patch that integrates it with the solr build.xml in such a way that anytime we add/update a lucene jar, we can run \"ant stub-factories\" and have 99% of the work done for us.",
    "attachments": {
        "factory-stub.tgz": "https://issues.apache.org/jira/secure/attachment/12368443/factory-stub.tgz",
        "SOLR-396.patch": "https://issues.apache.org/jira/secure/attachment/12368853/SOLR-396.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12537802",
            "date": "2007-10-26T01:47:13+0000",
            "content": "proof of concept, you'll need to tweak the build.xml to know where you have Solr and lucene-java checked out to try it. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12539496",
            "date": "2007-11-02T01:00:50+0000",
            "content": "patch that takes the previous proof of concept and integrates it into the solr build.xml as a new \"stub-factories\" target.\n\npatch also includes many new factories produced by this target, included some Russian and Greek factories that were stubs i filled in with some \"char[] charset\" selection args (not that i really understand how/why these filters use these char[]s ... it's all unicode in the jvm right? but they key is that the factories support all the options the filters support).\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12541186",
            "date": "2007-11-08T23:53:51+0000",
            "content": "Committed revision 593359.\n\ndocumented for future use on wiki...\nhttp://wiki.apache.org/solr/CommitterInfo "
        }
    ]
}