{
    "id": "SOLR-513",
    "title": "Links to core admin pages are broken in default admin page",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The index.jsp page builds the link to the admin pages for cores in a multicore configuration by appending the name of the core to ../../. This works on the admin pages for individual cores, but not on the default admin page – http://localhost:8080/solr/admin/. The links point to http://localhost:8080/core0/admin etc.",
    "attachments": {
        "SOLR-513.patch": "https://issues.apache.org/jira/secure/attachment/12387609/SOLR-513.patch",
        "solr-admin-links.patch": "https://issues.apache.org/jira/secure/attachment/12378681/solr-admin-links.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lars Kotthoff",
            "id": "comment-12582511",
            "date": "2008-03-27T04:15:19+0000",
            "content": "Patch to build the link by appending to the root of the servlet context instead of a relative path. Verified to work in Tomcat 5.5. Patch as produced by \"svn diff\". "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12582534",
            "date": "2008-03-27T07:22:57+0000",
            "content": "minor note: i don't think building off of the context path will work if pathPrefix has been configured for the DispatchFilter (in cases where people are embedding all of Solr's stuff into a larger webapp)\n\nassuming i understand the problem: it should probably just check to see if it's generating the \"main\" admin screen and if so leave out a set of \"../\" "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12582538",
            "date": "2008-03-27T08:10:36+0000",
            "content": "Yes, that's exactly the problem. I didn't see any obvious/nice way to check whether the \"main\" screen is generated though. Maybe appending pathPrefix to the context path would be a general solution? "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12620120",
            "date": "2008-08-06T02:47:32+0000",
            "content": "I've had a look at this again. As far as I can see, there's no way to get the pathPrefix in the jsp without jumping through some major hoops. Therefore I've decided to try a different approach.\n\nInstead of changing the links in index.jsp I've changed the included _info.jsp to redirect requests to /solr/admin/ to /solr/coreName/admin/. This also makes it explicit which core is used.\n\nI personally think that the default behaviour of randomly picking a core when none is specified in a multicore configuration should be changed to showing an error message or specifying a default core in the multicore configuration. I don't think that the current behaviour should be supported in the future as you can't be sure which core will be selected and it's therefore a potential source of errors. Also it's using a deprecated method to get a core.\n\nAttaching patch which makes the necessary changes to _info.jsp. Tested with multicore configuration on Tomcat and single core configuration on Jetty. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12621336",
            "date": "2008-08-11T01:51:43+0000",
            "content": "This issue is resolved with the latest changes in SOLR-545 since it's not possible to call an admin page without explicitely specifying a core anymore. "
        }
    ]
}