{
    "id": "SOLR-3633",
    "title": "web UI reports an error if CoreAdminHandler says there are no SolrCores",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Spun off from SOLR-3591...\n\n\n\thaving no SolrCores is a valid situation\n\tindependent of what may happen in SOLR-3591, the web UI should cleanly deal with there being no SolrCores, and just hide/grey out any tabs that can't be supported w/o at least one core\n\teven if there are no SolrCores the core admin features (ie: creating a new core) should be accessible in the UI",
    "attachments": {
        "SOLR-3633.patch": "https://issues.apache.org/jira/secure/attachment/12537918/SOLR-3633.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13416739",
            "date": "2012-07-18T00:01:11+0000",
            "content": "My full comment about this in SOLR-3591...\n\n\n\n1) the web ui isn't cleaning dealing with the situation where there are \"no cores\" returned by the CoreAdminHandler.\n\nthis is a legitimate situation, that doesn't neccessarily indicate an error.  \n\nif there are no cores, then the ui shouldn't blindly try to load \"/solr/null/admin/system?wt=json\" and then complain that the admin handler can't be found – the logic should be something like:\n\n\n\tcan we talk to CoreAdminHandler at all? if not give a specific error\n\tif CoreAdminHandler says there are no cores, give a message to that effect\n\t\n\t\toffer the info/commands that are stil available (ie: \"Core Admin\" functionality)\n\t\tperhaps suggesting that if they expected to cores to already exist, they should check logs 9allthough this may not be needed depending on how far we get with \"#2\" below)\n\t\n\t\n\tif cores are available, then try to use /corename/admin to get the other info to populate the UI, and if we can't find it then mention that they need to add config\n\t\n\t\ti would also suggest using the \"defaultcore\" if non-null instead of just whatever core happens to be listed first (but that's a good fallback if there is no default core)\n\t\n\t\n\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13422706",
            "date": "2012-07-25T22:52:46+0000",
            "content": "I have just enough javascript knowledge to be dangerous....\n\nHere's my meger attempt at trying to deal with this.\n\nThis patch now:\n\n\tprefers the default core for loading /admin/system\n\tincludes the URL that failed to load in the error msg if /admin/system couldn't load\n\tdistinguishes between there not being any cores, and not being able to load /admin/system.\n\n\n\nUn fortunatley, the result is still that the admin UI is virtually useless – my hope was to at least have the \"Add Core\" button working, but the way/place the core admin buttons are generated is down deep in code for binding to loading the page for a specific core – which in this patch never gets called since there are no cores.\n\nI've reached the limit of how much i understand this stuff ... maybe someone will find this patch useful and be able to keep going along these lines so that the CoreAdmin stuff at least works, and then the other tabs will start to work once a core is added (allthough i'm not sure how to force all that other data to reload if/when a core is added)\n\n— \n\nIf we can't make progress on this soon, then it would be best to commit a simpler error check for no cores that hides all the navigation (much like hte current \"you need the /admin/ handler\") with a clear message that there are no cores "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13422964",
            "date": "2012-07-26T08:48:46+0000",
            "content": "Hoss, i'm sorry for the long delay \n\nI guess i get the idea you're following, but i'm not sure if we are ready for this yet. because almost all \"global\" actions are using core-specific urls to fetch their information. not because i like to do it like that, just because that's the only way to get this information. \n\nAfaik the Cloud-Stuff is the only part which gets his data from /solr/zookeeper – Logging loads from /solr/collection1/admin/logging, Java Properties from /solr/collection1/admin/properties and Threads from /solr/collection1/admin/threads\n\nso, w/o having a least one core initialized .. already the dashboard will have problems, because it actually uses /solr/collection1/admin/system :/\n\nIf we can't make progress on this soon, then it would be best to commit a simpler error check for no cores that hides all the navigation (much like hte current \"you need the /admin/ handler\") with a clear message that there are no cores\n\nI would prefer this one (for now), even if i don't like to have it like this (in general). Better to clearly state what's possible and what not .. as in comparison have some \"may or may not work - depending on ..\" state?\n\nI'll attach an small and simple patch which also shows an warning screen but with a specific message, for no cores being loaded "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13423255",
            "date": "2012-07-26T17:21:21+0000",
            "content": "I'll attach an small and simple patch which also shows an warning screen but with a specific message, for no cores being loaded\n\nsteffkes: I haven't had a chance to look at your patch yet, but it sounds like what i was going for in the SOLR-3677 subtask (i'm assuming your patch is probably better then mine since you actually understand the UI internals and i'm just beating on it with a stick until it kind of looks like what i was hoping for).\n\nEven if there's no good way to make the bulk of the UI work w/o a Core, i think we should...\n\n\n\tcommit something in SOLR-3677 ASAP to deal with the better \"error\" message so we're sure it's addressed in 4.0.0\n\twrap up SOLR-3591 in some way that core init errors are visibile in the UI even if there are no cores\n\tleave SOLR-3633 open to think about ways to try and make the UI work better with no cores – at a minimum it would be nice to still offer an \"Add Core\" button, even if it ment having a special \"you have no cores, so the ui looks totally diff and all you have is an Add core form\" screen.\n\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13423268",
            "date": "2012-07-26T17:37:09+0000",
            "content": "Doh, you're right - i missed SOLR-3677 :/ ignore my one, it does more or less exactly the same then yours.\n\nWhat i don't know .. is difference between having something \"global\" (i.e. /solr/zookeeper) instead of relying on some specific core (i.e. /solr/collection1/logs) a difficult change? or is it only kind of \"mapping\" / changing a listener or whatever?\n\nBecause, if we have all the global ui-options really global (available if we have no cores available) it should be a small(er) chance to type of initial state for the ui – in that case we \"only\" have to avoid the step where the ui generates the list containing all loaded cores? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13423286",
            "date": "2012-07-26T17:51:45+0000",
            "content": "is difference between having something \"global\" (i.e. /solr/zookeeper) instead of relying on some specific core (i.e. /solr/collection1/logs) a difficult change?\n\nfor some things (like /system and /logs) it's probably doable ... but it will definitely take some time and refactoring ... i don't think we should rush it or make plans assuming it can be done quickly, because you never know where that code might have a small, crucial, assumption about hte availability of a core.\n\nand honestly: the \"zero core\" situation probably isn't a place where it really makes a lot of sense to focus a lot of effort on having a robust UI.  THe important thing is to recognize when the situation arises and give a clear feedback about the with access to the stuff that really matters in that situation (ie: why don't you have any cores? was there an error? how to i add a core?) ... even if that UI is incredibly simplified.\n\nIn my patch, i was trying to maintain the nav links in the left, so new users would at least have a taste for what features the UI offers once cores are added (and so we could have a place to incorporate SOLR-3635) ... but that's certainly not necessary.\n\nI think the way to go for now is a new, simple, screen w/o any assumptions about anything else that says \"You don't have any cores, here's the form to add a core, and BTW here are some known init failures from other cores that might explain why you don't have any cores.\"\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13423361",
            "date": "2012-07-26T19:09:53+0000",
            "content": "[..] i don't think we should rush it or make plans assuming it can be done quickly, because you never know where that code might have a small, crucial, assumption about hte availability of a core. [..]\n\noh yeah, don't get me wrong - that wasn't my intention for now .. just a steffkes-don't-know-much-about-internals question to get a feeling if that would be a way we can go .. or not \n\nin the meantime i've created an patch for SOLR-3635 – the patch (or more precise, the idea of the patch) works for every screen we have .. a normal/complete admin ui as well as the 'error-screens' we have in some cases. the code check's for an existing initFailures object in CoreAdmin-Response and loops over it to collect all given error messages and shows them in an simple list .. either on top of the provided error message or on top of the normal ui-screen (dashboard, logging, ..)\n\nso, for now, we have:\n\n\n\tSOLR-3677: No Cores at all\n\tSOLR-3634 + SOLR-3635: Init Failures (either w/ or w/o cores)\n\n\n\nStill missing an good idea how we can handle the no-cores case providing a complete ui-frame .. will think about that. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13424766",
            "date": "2012-07-30T09:07:39+0000",
            "content": "Hoss, i'm sorry, didn't had the time to commit the changes, feel free to take the pending issues (SOLR-3633, SOLR-3635 + SOLR-3677) and commit them .. they should be fine - otherwise i'll check them after my vacation "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429763",
            "date": "2012-08-07T03:42:47+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452215",
            "date": "2012-09-10T17:41:58+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13510831",
            "date": "2012-12-05T22:12:22+0000",
            "content": "Here is an updated patch that applies to trunk (just had to fix up app.js)\n\nWould be great to get more working without an existing core - but it won't be so easy unfortunately... "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13582729",
            "date": "2013-02-21T00:40:20+0000",
            "content": "Hi Mark, thanks for the patch.\n\nI see this:\n+\t    // :TODO: \"Add Core\" Button\n\nAny thoughts on that?  To me this seems like the most important part of the issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13582757",
            "date": "2013-02-21T01:10:43+0000",
            "content": "I just see it as one of a few pieces, but I only updated the existing patch which is essentially just what hossman describes above - I can tweak the UI around, but I don't have any immediate plans to develop any features. Hopefully the guys that have been pushing the UI forward will lend a hand for further work in this area. "
        },
        {
            "author": "Aaron Greenspan",
            "id": "comment-13672673",
            "date": "2013-06-02T20:54:09+0000",
            "content": "As a new Solr user (4.3.0) I thought I'd remove the example core and create my own. Both of those things turned out to be bad ideas. First, removing the core caused the entire Web UI to irreversibly crash as described in this issue, which I solved just by re-expanding the tarball. (Not a very elegant solution but I had no idea which XML file to manually edit.)\n\nThen, trying to create a new core one I had the example one back led to this issue... https://issues.apache.org/jira/browse/SOLR-4461\n\nThe web UI looks nice, but to a novice it's basically unusable I'm sad to say. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13672742",
            "date": "2013-06-03T00:39:55+0000",
            "content": "It doesn't crash - it works as soon as a core is added. We will address this JIRA eventually though.  "
        },
        {
            "author": "Aaron Greenspan",
            "id": "comment-13675265",
            "date": "2013-06-04T21:21:32+0000",
            "content": "Mark,\n\nPerhaps it doesn't crash in that it doesn't throw a segmentation fault, but it does throw a Java exception and then stops working, which for a novice user like me means that there is no way to go back and add a core (since the only way I'd know how to do it is through the web UI)--the only way to fix it. And even if there was such a way to add a core, I'd run into issue 4461, and not be able to anyway.\n\nAaron "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13677486",
            "date": "2013-06-06T20:44:20+0000",
            "content": "Yeah, most people use the rest api for that type of thing - the UI has started adding some stuff, but it's never been the polished path. That's been preconfiguration and rest api.\n\nIt also shouldn't stop working - I see this use case work all the time. I add a core, and the UI starts working. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13689292",
            "date": "2013-06-20T14:43:44+0000",
            "content": " Afaik the Cloud-Stuff is the only part which gets his data from /solr/zookeeper – Logging loads from /solr/collection1/admin/logging, Java Properties from /solr/collection1/admin/properties and Threads from /solr/collection1/admin/threads\nso, w/o having a least one core initialized .. already the dashboard will have problems, because it actually uses /solr/collection1/admin/system :/ \n\nI'm going to look at adding these to where they belong - off the core admin urls. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13689351",
            "date": "2013-06-20T15:50:37+0000",
            "content": "I've spun this part off to SOLR-4943. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13691464",
            "date": "2013-06-23T14:08:43+0000",
            "content": "Chris Hostetter (Unused) - I'm motivated to get something working here, so I spun off into that other issue to create a fast track path to getting this done. Thanks to some help from Stefan Matheis (steffkes), it looks like that fast track is going to bear fruit. How do you feel about that path? Do you think it covers this JIRA issue well enough?\n\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13706267",
            "date": "2013-07-11T21:33:14+0000",
            "content": "After SOLR-4943 is committed .. first version of the UI-related part of the patch.\n\nTodo:\n\n\tCore-Selector in left Column\n\tCore-Admin Page\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13706900",
            "date": "2013-07-12T12:42:21+0000",
            "content": "Updated Patch handles Core-Admin Page w/o any cores .. will add correct handling for Dropdown in the next Patch, hopefully coming shortly "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13706934",
            "date": "2013-07-12T13:35:17+0000",
            "content": "Core-Selector is functional now, still needs a bit tweaking on the layout side "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13710147",
            "date": "2013-07-16T19:54:53+0000",
            "content": "Commit 1503853 from Stefan Matheis (steffkes) in branch 'dev/trunk'\n[ https://svn.apache.org/r1503853 ]\n\nSOLR-3633 - web UI reports an error if CoreAdminHandler says there are no SolrCores "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13710151",
            "date": "2013-07-16T19:57:48+0000",
            "content": "Commit 1503855 from Stefan Matheis (steffkes) in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1503855 ]\n\nSOLR-3633 - web UI reports an error if CoreAdminHandler says there are no SolrCores (merge r1503853) "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13710370",
            "date": "2013-07-16T22:17:42+0000",
            "content": "Stefan Matheis (steffkes)\n\nDoesn't work for me, what did I miss?\n\nI took a stock trunk (and 4x, results identical). Renamed example/solr/collection1/core.properties to \"eoe.properties\". Now going to http://localhost:8983/solr/ still displays the big red box..... Or is that intended and I just don't understand? I did do an 'ant clean' from the top level and rebuilt... "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13710785",
            "date": "2013-07-17T06:36:47+0000",
            "content": "Uhm, well .. works for me™?  should work exactly as you've described it (however you manage it to disable the core) - reading from the code, the only way to still get the red box .. is, the request to /solr/admin/info/system?wt=json is failing .. does it for you? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13710977",
            "date": "2013-07-17T11:22:22+0000",
            "content": "OK, I did nothing except shut my computer down for the night and start it back up. And.. tadaaaaa! it \"just works\" now. I'll blame it on browser caching, although of course I stopped and started Jetty, rebuilt everything and even tried a different browser... Siiigggghhhh.\n\nReally nice, BTW. "
        },
        {
            "author": "Aaron Greenspan",
            "id": "comment-13773926",
            "date": "2013-09-21T23:31:41+0000",
            "content": "I'm still having this problem with 4.4.0. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13773972",
            "date": "2013-09-22T04:53:25+0000",
            "content": "Aaron:\n\nPlease define \"trouble\", and I suggest you ask the question on the user's list, this has been working for others. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13773973",
            "date": "2013-09-22T04:53:25+0000",
            "content": "Aaron:\n\nPlease define \"trouble\", and I suggest you ask the question on the user's list, this has been working for others. "
        },
        {
            "author": "Aaron Greenspan",
            "id": "comment-13773986",
            "date": "2013-09-22T07:02:49+0000",
            "content": "Erick,\n\nI suppose the problem has improved in 4.4.0 from 4.3.0 in that I no longer see a Java exception, but the red box error message in the web UI that no cores are active and that Solr can't work in such a state is completely unhelpful, as I pointed out in comments above. Either new users such as myself need some way to add a core back through the web UI, and/or the web UI should continue working even when there are zero active cores. Right now the only way out is to re-install since I have no idea which XML files to change or how.\n\nHope this helps,\n\nAaron "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787072",
            "date": "2013-10-05T10:19:04+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}