{
    "id": "SOLR-12161",
    "title": "CloudSolrClient with basic auth enabled will update even if no credentials supplied",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Authentication"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "7.3",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This is an offshoot of SOLR-9399. When I was writing a test, if I create a cluster with basic authentication set up, I can still add documents to a collection even without credentials being set in the request.\n\nHowever, simple queries, commits etc. all fail without credentials set in the request.\n\nI'll attach a test class that illustrates the problem.\n\nIf I use a new HttpSolrClient instead of a CloudSolrClient, then the update request fails as expected.\n\nNoble Paul do you have any insight here? Possibly something with splitting up the update request to go to each individual shard?",
    "attachments": {
        "SOLR-12161.patch": "https://issues.apache.org/jira/secure/attachment/12918531/SOLR-12161.patch",
        "AuthUpdateTest.java": "https://issues.apache.org/jira/secure/attachment/12916741/AuthUpdateTest.java",
        "tests.patch": "https://issues.apache.org/jira/secure/attachment/12916917/tests.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-03-29T05:10:48+0000",
            "content": "Jan Høydahl Does this square with what you were describing on 9399 (or related)? ",
            "author": "Erick Erickson",
            "id": "comment-16418440"
        },
        {
            "date": "2018-03-29T09:44:42+0000",
            "content": "Could be - I had problems with delete requests not being blocked.\n\nPerhaps SOLR-10453 is part of the solution? Don’t know if you used the client setter methods here? ",
            "author": "Jan Høydahl",
            "id": "comment-16418668"
        },
        {
            "date": "2018-03-29T15:00:16+0000",
            "content": "Jan Høydahl re: SOLR-10453. Certainly possible, but I doubt it. I don't know how that would explain the fact that the same update request first succeeds sending the docs then fails the commit with \"auth required\".\n\nI'll leave it in Noble's capable hands from here on out... ",
            "author": "Erick Erickson",
            "id": "comment-16419139"
        },
        {
            "date": "2018-03-29T23:56:47+0000",
            "content": "I uploaded a patch I was working on for this, it may be useful Noble Paul\n\nAnd of course I'll be happy to help out however I can.... ",
            "author": "Erick Erickson",
            "id": "comment-16419968"
        },
        {
            "date": "2018-03-30T02:38:10+0000",
            "content": "Is this the same problem as the one described on SOLR-9804? ",
            "author": "Steve Rowe",
            "id": "comment-16420086"
        },
        {
            "date": "2018-03-30T04:16:39+0000",
            "content": "Steve Rowe Sure looks like exactly the same problem. I'll link it here for the time being, but I think it's highly likely that these are one and the same. ",
            "author": "Erick Erickson",
            "id": "comment-16420131"
        },
        {
            "date": "2018-03-30T04:17:12+0000",
            "content": "Pretty sure these are the exact same issue. ",
            "author": "Erick Erickson",
            "id": "comment-16420132"
        },
        {
            "date": "2018-04-11T02:14:35+0000",
            "content": "diagnosis: \n\nupdate requests done using CloudSolrClient are executed in a threadpool so that each shard is requested in a separate thread. Solrj mistakes this to be an inter server request and sets the PKI authentication header. So this request is considered goes through using PKI authentication. commit() request is performed in the same thread (not the thread pool) so it uses basic auth and works as expected.\n\n \n\nSo far so good.\n\n \n\nIs it a security vulnerability?\n\nNO\n\nThis is executed in the test JVM which already has a valid Solr which in turn has a valid PKIAuthenticationPlugin instance. Normally, when SolrJ is used outside in a JVM which does not have a Solr running inside, the PKIAuthenticationPlugin instance does not exist and the headers cannot be set and the request would fail , as expected.\n\n \n\nis it a bug?\n\n \n\nYES. But limited to the test environment\n\n \n\nIs it a regression?\n\n \n\nI'm not sure. We need further investigation to know that. ",
            "author": "Noble Paul",
            "id": "comment-16433300"
        },
        {
            "date": "2018-04-11T08:32:52+0000",
            "content": "the fix is as follows\n\nThe threadpool has an extra flag to signal if it is used inside solr or outside. if it is outside Solr (in SolrJ) then don't set the PKI header. ",
            "author": "Noble Paul",
            "id": "comment-16433565"
        },
        {
            "date": "2018-04-11T17:22:41+0000",
            "content": "Thanks! I thought I'd see this with a stand-alone program, but just checked and that turned out to be wrong so it looks like a test-only issue. Whew!\n ",
            "author": "Erick Erickson",
            "id": "comment-16434257"
        },
        {
            "date": "2018-06-21T11:48:10+0000",
            "content": "Quite involved flow here, good catch Noble Paul!\n\nAre you working on a fix for this for 7.5 Noble? ",
            "author": "Jan Høydahl",
            "id": "comment-16519257"
        },
        {
            "date": "2018-06-26T10:32:44+0000",
            "content": "I shall do this before 7.5 ",
            "author": "Noble Paul",
            "id": "comment-16523537"
        }
    ]
}