{
    "id": "SOLR-1295",
    "title": "Move javascript client from contrib to clients dir in source",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It seems odd that the javascript client is in the contrib, unless you think of it more of a library that you then hack up.  At any rate, here is the patch assuming you have done svn mv http://svn.apache.org/repos/asf/lucene/solr/trunk/contrib/javascript http://svn.apache.org/repos/asf/lucene/solr/trunk/client/",
    "attachments": {
        "move_js_from_contrib_to_client.patch": "https://issues.apache.org/jira/secure/attachment/12413874/move_js_from_contrib_to_client.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12732866",
            "date": "2009-07-18T08:32:20+0000",
            "content": "What do we achieve with this move?  "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12732882",
            "date": "2009-07-18T12:22:29+0000",
            "content": "What do we achieve with this move? \n\nA more sensible location for SolrJS - it fits best with Ruby and Python, not with data import handler and clustering.  Question is, any reason NOT to move it? "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-12733017",
            "date": "2009-07-19T15:37:00+0000",
            "content": "SolrJS is a really neat way of interacting with Solr, but doesn't really get the love it needs.  Like the current \"it doesn't work with IE8\" bug!   I think that having it packaged properly, and getting the docs more up to snuff will make folks use it more and hopefully lead to more development. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12733052",
            "date": "2009-07-19T19:39:09+0000",
            "content": "Committed.  All seems well, but I'll leave open until Eric and others give the thumbs up that all is well with Solr's build, etc.  With it moved, it no longer is in the contrib-crawl.  That's no problem for me at this point, but what about for a release build of Solr - what do we want included in the main Solr distro?    Is it as desired right now? "
        }
    ]
}