{
    "id": "SOLR-12348",
    "title": "Solr 6.6.4 fails to start - Unrecognized VM option 'UseParNewGC'",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Installed and started Solr 7.3. But, realized for Drupal site, need to use older 6.x version.\n\nInstalled Solr 6.6.3, but will not start. message: \n\n*Still not seeing Solr listening on 8983 after 180 seconds!\ntail: /Applications/solr-6.6.3/server/logs/solr.log: No such file or directory*\n\nSame result when using bin/solr start, or using sudo.\n\nSolr-8983-console.log shows message: ** \n\n*Java HotSpot(TM) 64-Bit Server VM warning: Option UseConcMarkSweepGC was deprecated in version 9.0 and will likely be removed in a future release.\nUnrecognized VM option 'UseParNewGC'\nError: Could not create the Java Virtual Machine.\nError: A fatal exception has occurred. Program will exit.*\n\nJava -version displays: \n*java version \"10.0.1\" 2018-04-17\nJava(TM) SE Runtime Environment 18.3 (build 10.0.1+10)\nJava HotSpot(TM) 64-Bit Server VM 18.3 (build 10.0.1+10, mixed mode)*\n\n \n\nAlso tried with Solr 6.6.3, 6.6.0 and 5.0.0 with same failure and log message.\n\n **",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-12T21:32:29+0000",
            "content": "This is not an appropriate use of Solr's JIRA, the issue tracker is not a support portal. We try to reserve the JIRA system for code issues rather than usage questions.\n\nPlease ask the question here: solr-user@lucene.apache.org, see: http://lucene.apache.org/solr/community.html#mailing-lists-irc\n\nWhen you raise question on the user's list, include pertinent details, including sample data, queries and responses if possible, along with what you expect to see but don't.\n\nIf the consensus there is that there are code issues, we can reopen this JIRA or create a new one.\n\nThe start scripts are using options not supported in Java 10, see SOLR-12141: Fix \"bin/solr\" shell scripts (Windows/Linux/Mac) to correctly detect major Java version\n  and use numerical version comparison to enforce minimum requirements. Also remove obsolete \"UseParNewGC\" option.  This allows to start Solr with Java 10 or later. (Uwe Schindler) ",
            "author": "Erick Erickson",
            "id": "comment-16473276"
        }
    ]
}