{
    "id": "SOLR-10102",
    "title": "SynonymFilterFactory in example file is on query not index",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "examples"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "4.10.2,                                            6.4.1",
        "resolution": "Cannot Reproduce",
        "status": "Closed"
    },
    "description": "The example files for both 4.10.2 and 6.4.1 have entries like these:\n\n\n  <fieldType name=\"text_general\" class=\"solr.TextField\" positionIncrementGap=\"100\" multiValued=\"true\">\n    <analyzer type=\"index\">\n      <tokenizer class=\"solr.StandardTokenizerFactory\"/>\n      <filter class=\"solr.StopFilterFactory\" words=\"stopwords.txt\" ignoreCase=\"true\"/>\n      <filter class=\"solr.LowerCaseFilterFactory\"/>\n    </analyzer>\n    <analyzer type=\"query\">\n      <tokenizer class=\"solr.StandardTokenizerFactory\"/>\n      <filter class=\"solr.StopFilterFactory\" words=\"stopwords.txt\" ignoreCase=\"true\"/>\n      <!-- THIS IS WRONG, RIGHT? -->\n      <filter class=\"solr.SynonymFilterFactory\" expand=\"true\" ignoreCase=\"true\" synonyms=\"synonyms.txt\"/>\n      <filter class=\"solr.LowerCaseFilterFactory\"/>\n    </analyzer>\n  </fieldType>\n\n\n\nYou'll note that the synonym filter is applied at query time, which will totally fail. Even the docs say:\n\nThe recommended approach for dealing with synonyms like this, is to expand the synonym when indexing.\n\nCan we fix this? Or is there a reason why this is like this? As I understand it, having synonyms on the query means that things just won't be returned that should be. \n\nFor example, we have the token \"5\" set up with a synonym to the word \"five\". So, if somebody searches for 5, the query filter will expand it to \"5 AND five\", which, sure enough, the index doesn't match....no results. So...instead of expanding the result set, like synonyms are supposed to do, this actively contracts it.\n\nI hope my frustration in this is misplaced, but if I'm right about this bug, can I say that this is the kind of thing that makes Solr super frustrating to use?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-02-07T21:16:44+0000",
            "content": "If the synonyms are expanded at index time, then you must completely reindex if you change your list of synonyms.  Also, your index might get significantly larger.\n\nApplying them at query time results in a smaller index, and the ability to change the list without reindexing.\n\nAssuming the standard lucne query parser, the default operator defaults to \"OR\" ... which means that the query you're talking about would be \"5 OR five\" unless the defaults in Solr are changed.  Changing the default operator to \"AND\" tends to have effects that people don't think about.\n\nIf you've changed the default operator, it sounds like you should indeed want to do synonyms at index time, but for somebody who is going with defaults, query time can make things better.\n\nSounds like the docs need a little bit of a tweak. ",
            "author": "Shawn Heisey",
            "id": "comment-15856811"
        },
        {
            "date": "2017-02-07T22:42:09+0000",
            "content": "That makes sense. Does it make sense to update the example file where we set the default operator so that it has a note saying something like:\n\nIf you change the default operator to AND, be sure to update the synonym filters. See: http://some-url-with-docs.com\n\nOr maybe we update the default operator docs to say this? I don't know. I only know that as a user this is a pretty easy way to get bitten and you'd never expect to have to change synonyms when you change the default operator.  ",
            "author": "Mike Lissner",
            "id": "comment-15856945"
        },
        {
            "date": "2017-02-07T23:51:18+0000",
            "content": "I read the sentence somewhat differently, as applying to the concept of multi-word synonyms, and not synonyms in general. Here is the full context:\n\nKeep in mind that while the SynonymFilter will happily work with synonyms containing multiple words (ie: \"sea biscuit, sea biscit, seabiscuit\") The recommended approach for dealing with synonyms like this, is to expand the synonym when indexing.\n\nWhile \"The\" is capitalized there, the first sentence is incomplete unless you assume the section after the parentheses is the remainder of the sentence. In that context, I think the sentence does not in general recommend using index-time synonyms, but only when trying to work with multi-word synonyms. \n\nThe section begins with a link to the documentation for general use (https://cwiki.apache.org/confluence/display/solr/Filter+Descriptions#FilterDescriptions-SynonymFilter), but whoever added that did not make it clear that the REAL documentation for Synonym Filters is in the Ref Guide and no longer in the wiki. ",
            "author": "Cassandra Targett",
            "id": "comment-15857051"
        },
        {
            "date": "2017-02-08T00:39:44+0000",
            "content": "Docs on the default operator probably need to basically say that changing the operator to \"AND\" can have far-reaching effects on Solr's operation, often much greater than might be immediately apparent.  The effect on query-time synonyms could be one example. ",
            "author": "Shawn Heisey",
            "id": "comment-15857118"
        },
        {
            "date": "2017-02-08T07:52:07+0000",
            "content": "Mike Lissner please provide more details on how to reproduce on one of the examples. I have not seen the behavior you describe.\nIn particular, provide a copy of you config, and turn on debugQuery=true and show your parsedQuery. When I try to reproduce everything is fine, the parsedquery shows Synonym(address:w address:western) which behaves like an OR, even if my q.op is AND. ",
            "author": "Jan Høydahl",
            "id": "comment-15857590"
        },
        {
            "date": "2017-06-15T08:50:31+0000",
            "content": "Closing as cannot reproduce ",
            "author": "Jan Høydahl",
            "id": "comment-16050182"
        }
    ]
}