{
    "id": "SOLR-5345",
    "title": "OpenCloseCoreStressTest opens too many files (causing it to fail often)",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Typically the symptom with jenkins is strange socket failures (because sockets are files too).\n\nOn my machine though i got the nice too many open files from lucene because it just happened to fail that way.\n\nIn addition to holding thousands of open files, this test creates 90 megabytes of logging output!\n\nCan we tone down the test? I havent looked at all: but it doesn't seem necessary to have huge numbers of cores/indexes to test the functionality, we should be able to do this with relatively small numbers. \n\nAdditionally i dont think its good to use random merge/IW buffering parameters here, we should set ones that won't make tons of files, force the use of compound file format, etc.\n\nThe massive amounts of logging should be addressed too.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Uwe Schindler",
            "id": "comment-13793776",
            "date": "2013-10-13T20:41:26+0000",
            "content": "Yeah, thanks. On Jenkins it fails less often than on my machine, because the number of open files for the Jenkins process was raised to something like 16,000 or more file handles. Which is horrible alltogether. We should really tone down all those tests to use less than 1024 file handles, so anybody without tuned system settings can run tests! "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13793824",
            "date": "2013-10-13T22:45:26+0000",
            "content": "Commit 1531766 from Mark Miller in branch 'dev/trunk'\n[ https://svn.apache.org/r1531766 ]\n\nSOLR-5345: A first pass toning down OpenCloseCoreStressTest "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13793830",
            "date": "2013-10-13T22:53:39+0000",
            "content": "Commit 1531767 from Mark Miller in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1531767 ]\n\nSOLR-5345: A first pass toning down OpenCloseCoreStressTest "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13793831",
            "date": "2013-10-13T22:55:47+0000",
            "content": "all those tests to use less than 1024 file handles\n\nI think 1024 is a good goal for the std test run, but I think nightly tests should not be limited to a number that is so low with modern computers.  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13793835",
            "date": "2013-10-13T23:07:53+0000",
            "content": "my computer is only 2 years old:\n\n% ulimit -n\n256 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13793841",
            "date": "2013-10-13T23:32:19+0000",
            "content": "OSX will sometimes still do that - kind of absurd and around for ages. These defaults have not changed much over the years.\n\nIs it reasonable to have a Lucene index that uses over 1024 file handles? Absolutely. Should our unit tests do the same in some run? Absolutely. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13793845",
            "date": "2013-10-13T23:45:41+0000",
            "content": "I don't understand what exactly what unit that would be testing. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13793846",
            "date": "2013-10-13T23:48:04+0000",
            "content": "I'm loose with the word unit test - probably because we use Junit to write them. It's pretty obvious that we have tons of integration tests in addition to our unit tests though. Which makes sense, because we need both. We should test as much as we can. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13794133",
            "date": "2013-10-14T14:11:33+0000",
            "content": "Nightly runs can still be an issue. We probably need to clamp down on the merge factor, etc for that one. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13881184",
            "date": "2014-01-24T17:33:22+0000",
            "content": "I haven not seen this in a long time, including in nightly runs that I do. "
        }
    ]
}