{
    "id": "SOLR-3782",
    "title": "A leader going down while updates are coming in can cause shard inconsistency.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Harpoon into the head of the great whale I have been chasing for a couple weeks now.\n\nChaosMonkey test was exposing this.\n\nTurns out the problem was the solr cmd distrib executor - when closing the leader CoreContainer, we would close the zkController while updates can still flow through the distrib executor. The result was that we would send updates from the leader briefly even though there was a new leader.\n\nI had suspected something similar to this at one point in the hunt and started adding some defensive state checks that we wanted to add anyway. I don't think they caught all of this issue due to the limited tightness one of the state checks can get to (checking the cloudstate leader from a replica against the leader indicated by the request).\n\nSo the answer is to finally work out how to stop the solr cmd distrib executor - because we need to stop it before closing zkController and giving up our role as leader.\n\nI've worked that all out and the issue no longer seems to be a problem.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Markus Jelsma",
            "id": "comment-13447644",
            "date": "2012-09-04T12:00:26+0000",
            "content": "hi - this is in CHANGES but is it resolved? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13447721",
            "date": "2012-09-04T14:30:30+0000",
            "content": "I committed a first iteration - I have more refinement/improvement coming.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13448123",
            "date": "2012-09-04T22:29:35+0000",
            "content": "I only solved the issue when stopping the leader - there was also a similar issue on session expiration (the leaders update queue could to be emptying as we elect a new leader and beyond). I fixed this as well by shutting down the executor on session expiration and creating a new one for further use. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13448124",
            "date": "2012-09-04T22:29:48+0000",
            "content": "Have not committed yet though. Coming soon... "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13448449",
            "date": "2012-09-05T04:11:21+0000",
            "content": "I've committed the rest of my work. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653775",
            "date": "2013-05-10T10:32:57+0000",
            "content": "Closed after release. "
        }
    ]
}