{
    "id": "SOLR-5021",
    "title": "LoggingInfoStream should log TP messages using TRACE level",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "SOLR-4977 added an awesome new LoggingInfoStream class, and wisely it does not output \"TP\" category messages because it logs everything at the INFO level – but we could improve this to log TP messages at the TRACE level (and check if TRACE is enabled when ased if isEnabled(\"TP\").\n\nThat way people who do/don't want to see all the TP messages could control that based on whether the LoggingInfoStream logger level was set to allow/filter TRACE level log messages.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13702299",
            "date": "2013-07-08T19:09:20+0000",
            "content": "A few things:\n\nTP messages are only called from assert! They are a hack for indexwriter tests (not for users). See LUCENE-5039 for what i mean.\n\nSo i discarded them (also for lucene tests!), because otherwise, infostream is useless when working with unit tests.\n\nBottom line, i dont think anyone (humans or machines) want to see TP messages, only lucene's TestIndexWriterExceptions "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13702485",
            "date": "2013-07-08T21:45:48+0000",
            "content": "So i discarded them (also for lucene tests!), because otherwise, infostream is useless when working with unit tests.\n\n... i dont think anyone (humans or machines) want to see TP messages\n\nHrmmm... i'm not following you here ... why would infostream be \"useless when working with unit tests\" if these messages were logged?  It seems like it could be handy, when trying to track down problems in Solr tests, to be able to see the testPoint asserts in the logs – interleaved with other debug log messages from Solr.\n\nI realize this would be very verbose, hence i'm not suggesting we do it at INFO or even DEBUG, but i'm not understanding why it would be bad to allow them to be logged at TRACE? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13702497",
            "date": "2013-07-08T21:54:22+0000",
            "content": "They wouldnt be useful for debugging solr tests... They arent log messages. If you doubt me, take a look at what they output \n "
        }
    ]
}