{
    "id": "SOLR-9892",
    "title": "Core is locked",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "Hi Team,\n\nWe have setup of one master and two slaves. One master and one slave in one server (same JVM) and another slave in different server. This setup is working fine from past 6 months including production environment.\n\nSlave replication poll interval is 20 seconds on both slaves.\n\nNow, we are facing below issue in master solr.\n\norg.apache.solr.common.SolrException:org.apache.solr.common.SolrException: Index dir 'D:\\inetpub\\wwwroot\\CMS-Solr\\Solr\\solr-5.4.1\\server\\solr\\sitecore_marketing_asset_index_master\\data\\index/' of core 'sitecore_marketing_asset_index_master' is already locked. The most likely cause is another Solr server (or another solr core in this server) also configured to use this directory; other possible causes may be specific to lockType: native                                sitecore_web_index: org.apache.solr.common.SolrException:org.apache.solr.common.SolrException: Index dir 'D:\\inetpub\\wwwroot\\CMS-Solr\\Solr\\  \n\nWe have stopped both slaves and restarted master. Still same issue is coming. We have deleted write.lock file from all cores under data/index.\nThen \"site cant be reached\" message is showing when access solr url.\n\nCan some one please provide information on how to fix this as we are struck with this issue during UAT?\n\n\nThanks,\nG. Naresh Kumar",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-12-26T15:54:05+0000",
            "author": "Erick Erickson",
            "content": "Please raise issues like this on the user's list, many more people will see it and you'll likely get help much more quickly.\n\nIf it's determined that this is a problem with Solr code, then you should raise a JIRA.  ",
            "id": "comment-15778550"
        }
    ]
}