{
    "id": "SOLR-6543",
    "title": "Give HttpSolrServer the ability to send PUT requests",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "components": [
            "SolrJ"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Given that the schema API has a PUT request (https://cwiki.apache.org/confluence/display/solr/Schema+API#SchemaAPI-Createonenewschemafield) it would be nice if HttpSolrServer supported sending PUTs, so it could be used for sending that type of request.  Note if we really wanted to fully support that request we'd probably want a Request/Response type in solrj as well, but that can be handled in a separate issue.\n\nAlso, administrators may add arbitrary filters that require PUT requests.  In my own setup, I have a version of Hadoop's DelegationTokenAuthenticationFilter sitting in front of the dispatch filter.  Here also it would be nice if I could send all requests via HttpSolrServer.",
    "attachments": {
        "SOLR-6543.patch": "https://issues.apache.org/jira/secure/attachment/12670072/SOLR-6543.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Gregory Chanan",
            "id": "comment-14141132",
            "date": "2014-09-19T19:25:00+0000",
            "content": "Here's a patch with a unit test.  Note I only changed the client side.  On the server side, we may eventually want to support better parsing in SolrRequestParsers (right now, only the queryString of puts are parsed) and to handle the caching in HttpCacheHeaderUtil.  But since puts are only used in the schema API, and that is handled by the REST API that doesn't use those classes, this is sufficient. "
        },
        {
            "author": "Gregory Chanan",
            "id": "comment-14141580",
            "date": "2014-09-19T23:55:03+0000",
            "content": "One thing I noticed reading over the previous patch again: there's a useMultiPartPost setting, but I use it for put requests.  A multipart PUT seems pretty rare, so I'll just leave the setting name as is and make sure it's only used with POST requests.  Attached patch does this. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14141900",
            "date": "2014-09-20T09:54:29+0000",
            "content": "We are going to move the schema API to the new syntax SOLR-6476. Even for config we are going implement the new bulk API syntax SOLR-6533 .I don't know how relevant this will be after it is committed "
        },
        {
            "author": "Gregory Chanan",
            "id": "comment-14145141",
            "date": "2014-09-23T18:03:33+0000",
            "content": "Noble Paul thanks for pointing that out.  Do you think it's still reasonable to commit this?  My \"arbitrary filters\" argument still applies, i.e. I may have added my own filters that require PUT requests and for convenience and standard error handling, I want to define my own Request/Response classes to handle those requests via solrj the same as any other requests.  Though I guess that argues for supporting all HTTP methods, though PUT is probably the most common. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14145604",
            "date": "2014-09-23T23:24:38+0000",
            "content": "I'm +1 on this patch. It's a fairly simple extension that has current value and is well tested. Who knows what will happen when in any given future release - this patch does not create a long term burden in my opinion and has current value though. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14145916",
            "date": "2014-09-24T05:20:49+0000",
            "content": "+1 ,for the feature "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14147450",
            "date": "2014-09-25T06:04:06+0000",
            "content": "Commit 1627460 from gchanan@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1627460 ]\n\nSOLR-6543: Give HttpSolrServer the ability to send PUT requests "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14147458",
            "date": "2014-09-25T06:19:16+0000",
            "content": "Commit 1627464 from gchanan@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1627464 ]\n\nSOLR-6543: Give HttpSolrServer the ability to send PUT requests "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14332858",
            "date": "2015-02-23T05:02:17+0000",
            "content": "Bulk close after 5.0 release. "
        }
    ]
}