{
    "id": "SOLR-8955",
    "title": "ReplicationHandler should throttle across all requests instead of for each client",
    "details": {
        "components": [
            "replication (java)",
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.2",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "SOLR-6485 added the ability to throttle the speed of replication but the implementation rate limits each request. So e.g. the maxWriteMBPerSec is 1 and 5 slaves request full replication then the effective transfer rate from the master is 5 MB/second which is not what is often desired.\n\nI propose to make the rate limit global (across all replication requests) instead.",
    "attachments": {
        "SOLR-8955.patch": "https://issues.apache.org/jira/secure/attachment/12807511/SOLR-8955.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-08T15:02:13+0000",
            "author": "Mark Miller",
            "content": "+1 ",
            "id": "comment-15232298"
        },
        {
            "date": "2016-04-08T22:56:59+0000",
            "author": "Greg Pendlebury",
            "content": "I like the idea, but maybe it should be configurable? If the master has multiple NICs than hard coding an arbitrary limit because two unrelated slaves from different network interfaces are both online would actually be more of a hindrance than an improvement. ",
            "id": "comment-15233113"
        },
        {
            "date": "2016-06-01T20:28:12+0000",
            "author": "Trey Cahill",
            "content": "I uploaded a patch that will enable throttling for all requests, which is configurable (as per Greg Pendlebury request), instead of throttling for each client by setting the parameter \"globalthrottling=true\". \n\nThere's a few thing's that I'm not sure about in creating the patch:\n1) Is having the parameter \"globalthrottling\" the best way to set/configure throttling?\n2) Is this the best way to throttle for all requests to a node?\n3) The best way to test this; currently, the patch uses test cases that started out as copies of the testRateLimitedReplication().\n ",
            "id": "comment-15311049"
        }
    ]
}