{
    "id": "SOLR-10911",
    "title": "Fix inspection warnings reported by IntelliJ",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I'd like to fix some warnings reported by IntelliJ Idea that seem pertinent.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-19T16:03:04+0000",
            "content": "There are a ton of inspections IntelliJ offers that vary a great deal between code taste and a likely bug.  Do you have a wholistic approach to this in mind (e.g. develop a share an inspection profile that we all use) or is this about some random observations in particular source files? ",
            "author": "David Smiley",
            "id": "comment-16054254"
        },
        {
            "date": "2017-06-19T17:14:45+0000",
            "content": "Would love to have a shared profile (even better tie into ant idea).\n\nLike the \"fix javac warnings\" jira, I think it makes sense to split this off into subtasks so people can tackle them as they have time. Unless you're volunteering to fix them all, Shalin. (smile) ",
            "author": "Mike Drob",
            "id": "comment-16054377"
        },
        {
            "date": "2017-06-20T11:47:21+0000",
            "content": "I was only going to fix a few performance warnings reported by IntelliJ but I'll see what I can do about creating a shared profile over the weekend. I will also create sub-tasks for individual inspections. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16055623"
        },
        {
            "date": "2017-06-20T15:34:13+0000",
            "content": "Hey Shalin:\n\nIf you happen across a good way to ignore some lint warnings, please pass it on (yes, I'm lazy).\n\nBackground. When looking through some of the JavaBinCodec precommit WARNINGs, I saw some other warnings that should be ignored. Especially the reference counted objects (IndexWriter comes to mind). So if we ever want to make precommit fail on warnings, we need a way to not generate warnings in some specific cases.\n\nStrictly if you happen to see something.... ",
            "author": "Erick Erickson",
            "id": "comment-16055956"
        }
    ]
}