{
    "id": "SOLR-11099",
    "title": "Provide a mechanism to add non-core level handlers",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "As of now, only collection specific handlers can be added to Solr. There is no way to add handlers that need to manage the cluster, instead of the collection/shard. Adding a hook that allows users to write custom handlers at admin/cluster level, which are initialized at core container level would be good.\n\nThe configuration for the same could be a part of either the properties file, or a separate file.\n\nAddition/modification or the same could be done using the config APIs.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-17T22:32:22+0000",
            "content": "i'm leary of new APIs and new lifecycles for new plugins – we've seen how much of a headache that can be in the past, and it would be particularly more so for something that operates outside of the existing collection framework.\n\nConsidering that:\n\n\tthe existing internal APIs available to request handlers already give custom code the power to go find lists of collections, pull data from zk, executing collection API level commands, etc....\n\tthe existing request dispatcher logic is already capable of ensuring requests for a collection are routed to a node hosting a replica of that collection\n\n\n\n... it seems \"good enough\" to tell people in these very special cases that they can create an \"empty\" collection and put their custom non-core/non-collection specific logic there.\n\nIf nothing else: perhaps we just give people syntactic sugar for registering/querying requestHandlers on the .system collection? ",
            "author": "Hoss Man",
            "id": "comment-16090708"
        },
        {
            "date": "2017-07-17T22:40:55+0000",
            "content": "I did think about adding syntactic sugar on the .system handler but I'm not sure if it would be a clean solution. \n\nWe already have Admin APIs, and my thought was to enable users to say - have complex health checks (based on system), without having to externally watch zk, or have multiple http calls to get core/shard/collection/cluster information. ",
            "author": "Anshum Gupta",
            "id": "comment-16090722"
        }
    ]
}