{
    "id": "SOLR-614",
    "title": "Allow components to read any kind of XML from solrconfig",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "All the components initialized by Solr have an init(NamedList args) initializer. This leads us to writing the configuration needed for the component in the NamedList xml format. People familiar with Solr may know the format but most of what is written is noise than information. For users who are not familiar w/ the format find it too difficult to understand why they have to write it this way. Moreover , it is not a very efficient way to configure .",
    "attachments": {
        "SOLR-614.patch": "https://issues.apache.org/jira/secure/attachment/12385277/SOLR-614.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12610468",
            "date": "2008-07-04T07:10:23+0000",
            "content": "If the configuration of a handler is as follows\n\n<requestHandler name=\"/foo\" class=\"solr.FooHandler\">\n  <defaults>\n    <name>some-name</name>\n    <classname>solr.MyClass</classname>\n  </defaults>\n</requestHandler>\n\n\n\nThe values can be read from the iniArgs as follows\n\nNamedList defaults = (NamedList )initArgs.get(\"default\");\nString name = (String)defaults.get(\"name\");\nString classname = (String)defaults.get(\"classname\");\n\n\n\nEven attributes can be read as in the following config\n\n\n<requestHandler name=\"/foo\" class=\"solr.FooHandler\">\n  <defaults name=\"default\" name=\"somename\" classname=\"solr.MyClass\"/>\n</requestHandler>\n\n\n\nThe values can be read from the iniArgs as follows\n\nNamedList defaults = (NamedList )initArgs.get(\"default\");\nString name = (String)defaults.get(\"@name\");\nString classname = (String)defaults.get(\"@classname\");\n\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12615075",
            "date": "2008-07-20T10:20:59+0000",
            "content": "The new patch for the changes proposed "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12615122",
            "date": "2008-07-20T20:51:12+0000",
            "content": "If I understood the discussion on the dev list properly, we would put off any syntax changes until 2.0, and then hopefully use some configuration standards that we don't maintain (spring)\n\nhttp://www.nabble.com/lesser-noise-in-solrconfig.xml-td18253180.html#a18253180\n\nYes, the new format is cleaner and more clear, but I fear compatibility/clarity issues with existing 1.x setups and multiple syntaxs for the same thing seems problematic.\n\nI think we should mark this as \"won't fix\", and save the configuration cleanup till we can do it well – ie, spring. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12615146",
            "date": "2008-07-21T03:58:26+0000",
            "content": "The scope of this bug is not same as \n\nhttp://www.nabble.com/lesser-noise-in-solrconfig.xml-td18253180.html#a18253180\n\nI descoped it. \nIt WILL NOT make any changes to the solrconfig.xml. The intend is to enable new components to take advantage of a flexible format. When I say new components the components written by users after 1.3 (intended to run on top of 1.3)\n\nWe use our own custom components in our organization. I am sure there are a lot of other users who do that.  There is no harm in enabling them to choose their format (if they wish to do so) \n\nIf we plan to change the configuration in any which way in the future , how can this affect any of our plans?\n\nThe implementation does not have to be the same (or even the scope) . But we should allow more flexibility in the API for component writers "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12616458",
            "date": "2008-07-24T12:17:55+0000",
            "content": "I think the current scope is reasonable. This limited scope makes a cleaner config possible but makes no changes to the public configuration as it stands now. Future (Solr 1.4+) and custom user components can use the cleaner configuration syntax if they choose to do so. We can document in the wiki that a cleaner syntax is available for component writers if they so desire. Future versions of the existing components which use the XPath based parsing currently, can switch to using this code for a cleaner and consistent implementation, if we so desire.\n\nThoughts? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12616776",
            "date": "2008-07-25T06:46:34+0000",
            "content": "refactored "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12617203",
            "date": "2008-07-26T18:46:15+0000",
            "content": "I'd like to commit this in a day or two if there are no objections. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12617214",
            "date": "2008-07-26T21:01:30+0000",
            "content": "-1\n\nAs discussed elsewhere, I'm against changing the NamedList config code.  I agree it is ugly, but at least it is consistent.  In 2.0, this should all be revisited, so I see no reason to introduce a new possible format into the mix...  even if it is only used for new things...\n\nJudging from the discussion on the related thread, I think Erik and Hoss are also -1 (but let them speak for themselves) "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12617229",
            "date": "2008-07-27T01:46:18+0000",
            "content": "Ryan – I re-read the thread several times before posting this. My understanding was that the -1 was on changing the solrconfig.xml format now for 1.3, please correct me if I'm wrong.\n\nIMHO, this patch does not introduce a new format. The format as the user sees it, is the same one used in many places in solrconfig.xml right now and becomes just a bit more intuitive. The code that developers write to initialize their component also uses the same NamedListInitializedPlugin which we are all familiar with instead of the clunky XPath stuff. Backwards compatibility is retained for both users as well as developers where users can write the old way and developers can still use XPath instead of NamedList for initialization and it all just works. If life is made easy for both users and developers and at the same time the changes remain backwards-compatible, I don't see why we should be against it.\n\n2.0 remains distant and getting to a Spring integration will take time. IMHO, that will be a real support problem when users may complain on discovering that they have to write their whole configuration again from scratch, or we provide converters which may fail with custom plugins, or even worse where we may need to support both the old and new formats. I really like the NamedList structure and this issue provides us with the flexibility of having a gradual migration path to a more consistent configuration syntax both for the user as well as for the plugin developer. Any changes to existing configuration will be made post 1.3, no changes right now.\n\nWith all due respect, I ask you to reconsider. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12617236",
            "date": "2008-07-27T03:48:29+0000",
            "content": "This one change has the potential to cleanup a lot of ugly XPath reading in our code. The intend here is to cleanup our internal code if needed. In many places (eg:updateHandler , SOLR-660 etc) we have a simple format but the parsing code is still ugly. \n\nAnother interesting point I observe in that many of our components are not NamedListInitializedPlugin Just because of this one reason. They will have to stick to this ugly format. So what happens is, components take in an XML Node to parse their custom XML\n\nOne point that all of us accept is that the current format is ugly. Moreover , the NameList format is no XML standard . It is just another response format for SOLR output  . My request is let us please not impose a weird format on component writers . Let us give choice to component writers who use Solr1.3 release as their base. The longer we delay this harder it gets to change this.\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12617318",
            "date": "2008-07-27T17:32:38+0000",
            "content": "perhaps I'm missing something...  where/how does this get rid of any XPath?  Within a NamedListInitalizedPlugin, the plugin writer does not have access to the Node and can't use it anyway?  The plugin writer just has access to a NamedList.\n\nWhat I see is that this modifies/augments how we parse NamedLists, adding two key features:\n1. <a>value</a> == <str name=\"a\">value</str>\n2. <node a=\"value\" /> – adds '@a'=value to the NamedList 'node'\n\nPerhaps I'm just reluctant to muck with a format that despite its awkwardness works, and is consistent across (most) plugins.  To me it seems wrong that I would need to initialize most things with: \n\n<lst name=\"defaults\"><str name=\"echoParams\">explicit</str></lst>\n\n but perhaps other plugins would need: \n\n<defaults echoParams=\"explicit\" />\n\n  Yes, the latter is better looking, but considering that folks are already forced to use the former, it seems wrong (and asking for trouble) mix and match.  \n\nNamedList isn't an XML standard, but in 1.x we can't get rid of it, so I think we should just deal with it consistently and in 2.x make sure we fix it. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12617319",
            "date": "2008-07-27T17:36:21+0000",
            "content": "Perhaps I'm not thinking of configurations substantially complex to warrant this change.  Is there something concrete I'm not thinking about?  Is there anything that could not be represented with the existing format? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12617321",
            "date": "2008-07-27T17:58:01+0000",
            "content": "perhaps I'm missing something... where/how does this get rid of any XPath? Within a NamedListInitalizedPlugin, the plugin writer does not have access to the Node and can't use it anyway? The plugin writer just has access to a NamedList. \n\nThe NamedList instance contains everything you can add in an xml. so no more XPath needed .\nFor instance ,the UpdateprocessorChain coud have easily been a NamedListInitializedPlugin . All we need to do is add a method to SolrConfig#getNodeAsNamedList(String xpath). All components can start from there. (of cource the first xpath cannot be avoided)\n\nYes, the latter is better looking, but considering that folks are already forced to use the former, it seems wrong (and asking for trouble) mix and match.\n\nWe are not changing anything here. \n\n\n<lst name=\"defaults\"><str name=\"echoParams\">explicit</str></lst>\n\n\nis not same as \n\n<defaults echoParams=\"explicit\" />\n\n\n\nUnless the component writer explicitly changes his code (which I am not recommending now)\n\n\nThe use case is as follows:\nFor instance in SOLR-561 I do not wish to keep this configuration\n\n<requestHandler name=\"/replication\" class=\"solr.ReplicationHandler\" >\n    <lst name=\"master\">\n        <!--Replicate on 'optimize' it can also be  'commit' -->\n        <str name=\"replicateAfter\">commit</str>\n        <!--Config files to be to be replicated-->\n         <str name=\"confFiles\">schema.xml,stopwords.txt,elevate.xml</str>          \n         <str name=\"snapShootAfter\">optimize</str>          \n         <str name=\"snapDir\">/user/datadir</str>          \n    </lst>\n</requestHandler>\n\n\n\nI wish to have a configuration\n\n<requestHandler name=\"/replication\" class=\"solr.ReplicationHandler\" >\n    <master replicateAfter=\"commit\" \n                    confFiles=\"schema.xml,stopwords.txt,elevate.xml\" \n                   snapShootAfter=\"optimize\" snapDir=\"/user/datadir\"/>\n</requestHandler>\n\n\n\nBut ,it is not possible w/o resorting to xpath . \n\n\nwith this code change. I can do something like \n\nNamedList master = (NamedList )initArgs.get(\"master\");\nString replicateAfter = (String)master.get(\"@replicateAfter\");\nString confFiles= (String)master.get(\"@confFiles\");\nString snapDir= (String)master.get(\"@snapDir\");\n\n\n\n\nThis feature is not going to be a part of Solr1.3. But it may be deployed in our organization as an addon feature. \n\n\nThe second usecase is components like UpdateHandler , UpdateRequestProcessor etc. which already has a syntax that is clean. They can cleanup their java code with no xpath "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12617368",
            "date": "2008-07-28T06:40:37+0000",
            "content": "Just to elaborate on the UpdateRequestProcessor use-case, right now we have modified SolrCore to add a method loadUpdateProcessorChains which has quite a bit of XPath parsing to create a NamedList which is passed to the UpdateRequestProcessorFactory. With this patch, the chain can just implement NamedListInitializedPlugin and the whole bit of parsing will be done automatically.\n\nSo the whole code in SolrCore#loadUpdateProcessorChains will look like this:\n\nList<NamedList> initConfigs = solrConfig.getAllNodesAsNamedList(\"updateRequestProcessorChain\");\n    for (NamedList list : initConfigs)  {\n      UpdateRequestProcessorChain chain = new UpdateRequestProcessorChain();\n      chain.init(list);\n      map.put((String)list.get(\"@name\"), chain);\n    }\n\n\n\nThe chain will have an init method like this:\n\npublic void init(NamedList args) {\n    List<NamedList> processors = args.getAll(\"processor\");\n    for (NamedList processor : processors)  {\n      UpdateRequestProcessorFactory p = (UpdateRequestProcessorFactory)core.getResourceLoader().newInstance((String)processor.get(\"@class\"));\n      p.init(processor);\n    }\n  }\n\n\n\nSo the chain can create all processors inside it rather than SolrCore creating processors and passing them into a chain constructor. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12617370",
            "date": "2008-07-28T06:44:28+0000",
            "content": "Adds SolrConfig#getAllNodesAsNamedList and SolrConfig#getNodeAsNamedList helper methods to further simplify parsing code. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12617423",
            "date": "2008-07-28T13:41:51+0000",
            "content": "I still think this is an unnecessary addition that has the potential to be confusing.  Even though the current config stuff is ugly to navigate, it is only one way that will be easier to support.\n\nI don't want to thwart your efforts though.  -0\n\nI'd really prefer this be taken to a post-1.3 commit at the very least though, so we can flesh out config syntax and infrastructure a bit more. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12617430",
            "date": "2008-07-28T14:03:33+0000",
            "content": "I still think this is an unnecessary addition that has the potential to be confusing. Even though the current config stuff is ugly to navigate, it is only one way that will be easier to support. \nAll the changes are under the skin. There will be no changes to the configuration or public API. All the components must  stick to the old configuration.So, I hope there is no need to have any confusion "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12617433",
            "date": "2008-07-28T14:11:57+0000",
            "content": "Eric – One reason that I'm so +1 on it is that if it does not go into 1.3, all custom (internal) plugins we write for 1.3 will be stuck with the ugly config format or clunky xpath code for at least the next six to eight months until we have another release. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12617563",
            "date": "2008-07-28T21:36:32+0000",
            "content": "All the changes are under the skin. There will be no changes to the configuration or public API. All the components must stick to the old configuration.So, I hope there is no need to have any confusion\n\nI'm only half certain I understand exactly what's being discussed, so take this comment with a grain of salt...\n\nEven if the code changes dictate that existing components must still use the existing config syntax (I assume because it asks for things like params.get(\"foo\") instead of params.get(\"@foo\") the fact remains that if a single type of plugin (ie: RequestHandler) can support multiple config syntaxes the potential exists for people to get very confused ... if we make this change, then someone who is already familiar with the way handlers are configured won't understand the \"/replication\" example Noble posted – likewise someone new to Solr who sees that \"/replication\" example config will have a harder time understanding the 'old' config style for other request handlers.\n\nThere is a lot of value in maintaining consistency – even if it's ugly.\n\nLooking ahead two or three moves: adding support for something like this now would also probably make it that much harder to write a \"converter\" for existing solr config files if/when we switch to Spring or some other Java object wiring/configuration system.  It's a minor problem, but it has occurred to me.\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12617674",
            "date": "2008-07-29T03:09:45+0000",
            "content": "As i have said, I think consistency is a good thing and we will hopefully get out of the custom config format business in 2.0.  But I also see that having ugly configs makes it difficult to be clear about what it does.  (I remember struggling to figure out that lst != 1st)  Ugly configs are a big deal, so I hate to throw sticks at the endeavor...  I imagine any translation to a new format would involve reading it and then outputting the relevant configs rather then trying some sort of text manipulation.  With that in mind, it probably makes little difference on that front.\n\nSo I'll change my vote to -0, and I'll let you all sort out what should happen...\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12617688",
            "date": "2008-07-29T04:19:26+0000",
            "content": ".. if we make this change, then someone who is already familiar with the way handlers are configured won't understand the \"/replication\" example Noble posted\nthe feature that is already under development may have its syntax not yet finalized . So when we eventually commit it, it may have a different syntax. \n\nThere is a lot of value in maintaining consistency - even if it's ugly.\n\nWe do not have consistency in the way multiple components are configured. eg: UpdateHandler, UpdateProcessorChain, mainIndex etc.  \n\nthe fact remains that if a single type of plugin (ie: RequestHandler) can support multiple config syntaxes the potential exists for people to get very confused \n\nWe must not support multiple formats . We must stick to one an we will support only one .\n\nLooking ahead two or three moves: adding support for something like this now would also probably make it that much harder to write a \"converter\" for existing solr config files if/when we switch to Spring or some other Java object wiring/configuration system. \n\nWe are trivializing a config format switch . It is not going to be as simple as writing a simple converter. We may need total rewiring of components which may involve code modification for all the components.  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12620275",
            "date": "2008-08-06T15:06:38+0000",
            "content": "Committed revision 683288 after removing the attribute reading for plain NamedList so that existing usage is not changed in any way.\n\nThanks Noble! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12620320",
            "date": "2008-08-06T17:04:03+0000",
            "content": "FWIW...\n\nWe do not have consistency in the way multiple components are configured. eg: UpdateHandler, UpdateProcessorChain, mainIndex etc.\n\nThere is a huge difference between having different types of plugins (ie: UpdateHandlers and RequestHandlers) configured with different syntaxes and allowing completely different config syntaxes for different implementations of the same type of plugin (ie: RequestHandler) – people are not surprised when dissimilar things have dissimilar configuration, they are suprised when two tings of the same \"type\" can be configured with radically different syntaxes.\n\nWe must not support multiple formats . We must stick to one an we will support only one .\n\nThis comment doesn't make sense to me ... we have one syntax right now, this issue adds an arbitrary number of new syntaxes for any type of plugin whose init() method takes a NamedList – and different implementations of those types can use it different ways.  \n\nHow is that not multiple formats?\n\nI don't see any future for this change that doesn't involve people getting confused because they see RequestHandler X configured with one syntax in our example configs, but then in some third party plugin project they see RequestHandler Y configured with a completely different syntax and they have no idea what the right way to configure RequestHandler Z is.\n\nBut I also see that having ugly configs makes it difficult to be clear about what it does. \n\nhaving divergent configs makes it even more difficult.  at least with one ugly syntax once you understand it for one instance, you understand it for all instances. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12620824",
            "date": "2008-08-08T03:31:03+0000",
            "content": "This comment doesn't make sense to me ... we have one syntax right now, this issue adds an arbitrary number of new syntaxes for any type of plugin whose init() method takes a NamedList - and different implementations of those types can use it different ways.\n\nusers do not f\\differentiate between namedlist format and simple xml format. according to them it is xml. It is only we who see it differently. So every component has its own different configuration. As long as one component consistently uses one configuration ,I guess we are fine. I have never seen users complaining about the inconsistency between updatehandler/requesthandler config. The fact is they don't care. According to them, an updatehandler and a requesthandler1 and requesthandler2 are 3 different components needing three different configurations. \n\nfor instance compare between spellchecker and dismax. Though they have similar formats uses may never notice it because they have totally different configuration. I am sure there is no cause of a confusion because users never compare these two.\n\nThere are certain well known conventions which are important. such as defaults , invariants etc in a requesthandler. It makes sense to  have consistency in those things. \n\nAs we start building more and more complex handlers this format can become a real millstone around our neck. We must not sacrifice simplicity of future components because of a few components we already have.\n\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12645689",
            "date": "2008-11-07T05:27:34+0000",
            "content": "Un-assigning myself since I don't see this going anywhere. "
        }
    ]
}