{
    "id": "SOLR-3156",
    "title": "Check for locks on startup",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When using simple or native lockType and the application server is not shutdown properly (kill -9), you don't notice problems until someone tries to add or delete a document. In fact, you get errors every time Solr opens a new IndexWriter on the \"locked\" index. I'm aware of the unlockOnStartup option, but I'd prefer to know and act properly when there's a lock, and I think it would be better to know on startup, since Solr is not going to work properly.",
    "attachments": {
        "SOLR-3156.patch": "https://issues.apache.org/jira/secure/attachment/12515925/SOLR-3156.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Luca Cavanna",
            "id": "comment-13214959",
            "date": "2012-02-23T19:27:36+0000",
            "content": "I'd have a patch almost ready, but I'd like to hear your thoughts first of all.\n\nI'd add a new check in the SolrCore#initIndex method. Would it be ok to try opening a SolrIndexWriter and close it immediately? That way if there's a lock and simple or native lockType, you'll immediately see an exception and Solr won't start, instead of notice the problem only when the first document is submitted. Should we add an option to the config for this check and make it disabled by default? \n\nCould you let me know what you think guys? "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13215538",
            "date": "2012-02-24T10:04:26+0000",
            "content": "I also prefer to know that the index is locked at startup than when the first document is added!\nOpening and then closing a SolrIndexWriter seems like the most easy way to check this in the SolrCore#initIndex method. "
        },
        {
            "author": "Luca Cavanna",
            "id": "comment-13215657",
            "date": "2012-02-24T15:06:04+0000",
            "content": "Attached the first draft patch with a new test class. I've changed my mind a little bit and put the check together with the unlockOnStartup code. There we already know if the index is locked (IndexWriter#isLocked). If unlockOnStartup is enabled we remove the lock, otherwise we throw a LockObtainFailedException, the same exception we would have seen at the first document submission. What do you think guys? is this the right direction? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13217934",
            "date": "2012-02-28T06:02:50+0000",
            "content": "Luca: the change to SolrCore looks good to me ... the one thing i might suggest is adding an ERROR log just before you throw the exception (i'm in the \"log early\" team)\n\nThe test looks awesome, but PLEASE trim those solrconfig files down so that they only contain the 5-6 minimum lines they need inorder for the test to be meaningful ... we have far too many big bloated test configs already, the goal is to stop adding new ones and make sure each test config has a specific and easy to see purpose. "
        },
        {
            "author": "Luca Cavanna",
            "id": "comment-13218030",
            "date": "2012-02-28T09:47:45+0000",
            "content": "Hi Hoss, \nthanks for your feedback.\n\n\nthe one thing i might suggest is adding an ERROR log just before you throw the exception (i'm in the \"log early\" team)\nI've added the log before throwing exception.\n\n\ntrim those solrconfig files down so that they only contain the 5-6 minimum lines they need inorder for the test to be meaningful\nI completely agree, I already did a little, but I just did it (a lot) more. You'll like it now.  "
        },
        {
            "author": "Luca Cavanna",
            "id": "comment-13223262",
            "date": "2012-03-06T14:00:52+0000",
            "content": "Anything else I can do to have this committed? Does everybody agree on this change? "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13236551",
            "date": "2012-03-23T12:54:10+0000",
            "content": "Looks good. I will commit this soon. "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13236613",
            "date": "2012-03-23T14:13:04+0000",
            "content": "Committed to trunk and branch 3x. "
        },
        {
            "author": "Luca Cavanna",
            "id": "comment-13236628",
            "date": "2012-03-23T14:29:44+0000",
            "content": "Thanks Martijn! "
        }
    ]
}