{
    "id": "SOLR-4420",
    "title": "Please add support for atomic swapping for Collections in SolrCloud",
    "details": {
        "affect_versions": "4.1",
        "status": "Resolved",
        "fix_versions": [
            "4.6"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Similar to the concept of swapping regular Solr cores online, I'd like to request support for atomic swapping of entire Collections in SolrCloud.\n\nThis would aid in online schema changes, online sharding changes, etc. Ideally the new collection would be in sync with the current when swapped. \n\nAt a high level, I believe this could be achieved if replicas of CollectionA could be brought up in CollectionB, then swapped atomically when in sync. I imagine a momentary pause to updates would need to occur, which would be acceptable for at least my use cases.\n\nCurrently I can create a new collection under a new collection name and swap paths in the application or rename the core, but this is not elegant/ideal.\n\nThanks for everyone's hard work on Solr! Great software.\n\nTim Vaillancourt",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13574786",
            "date": "2013-02-08T20:21:17+0000",
            "content": "A full review of all actions available in the CoreAdmin for possible inclusion for Collections seems advisable.  SWAP and RENAME are candidates for the near term. "
        },
        {
            "author": "Tim Vaillancourt",
            "id": "comment-13574806",
            "date": "2013-02-08T20:44:42+0000",
            "content": "Thanks Shawn.\n\nTim "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13587862",
            "date": "2013-02-27T01:46:24+0000",
            "content": "I think SOLR-4497: Collection Aliases is the way to deal with this. "
        },
        {
            "author": "Tim Vaillancourt",
            "id": "comment-13587943",
            "date": "2013-02-27T03:01:42+0000",
            "content": "I'll try out the patch to understand the implementation aspect more, but I believe this would work for me granted it is atomic across the collection, as I'm guessing it would be. This would solve what I am looking for and a bit more as I am proposing something like SWAP/RENAME, which would provide only a 1-to-1 mapping. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717454",
            "date": "2013-07-23T18:48:17+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        }
    ]
}