{
    "id": "SOLR-12581",
    "title": "add a \"min_popularity\" option to relatedness() aggregation that forces scores to -Inf if fg/bg pops don't meet a threshold",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Facet Module"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.5",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "as discussed in SOLR-9480 and noted in TODO comments, the original SKG code base had a \"min_pop\" option that would completely ignore \"terms\" if the fg/bg popularities weren't above a user specified threshold.  with the implementation of SKG as a relatedness() aggregation function, we need to leave any actual filtering of buckets by an aggregation result to a future generalized JSON facet enhancement, but what we can do today is implement an optional min_popularity option on relatedness() that forces the relatedness score to -Infinity so buckets that don't meat the threshold at least score \"as low as possible\"",
    "attachments": {
        "SOLR-12581.patch": "https://issues.apache.org/jira/secure/attachment/12932733/SOLR-12581.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-07-23T16:27:51+0000",
            "content": "Here's a patch that depends on the \"extended syntax\" work being done in SOLR-12567.  I think the only thing missing is ref-guide updates about the new option. ",
            "author": "Hoss Man",
            "id": "comment-16553074"
        },
        {
            "date": "2018-07-23T18:35:14+0000",
            "content": "Sort of a side-question, but this work seems to overlap/compliment the significantTerms work done for streaming/QueryParser: http://lucene.apache.org/solr/guide/7_4/stream-source-reference.html#significantterms\n\nAre we saying SignificantTerms is for simpler use cases (as fore/back queries are corpus-wide) and then go into relatedness() for more complex analysis? \n\nShould the options be roughly compatible where it makes sense and/or similarly named?\n\nJust wondering because I could see this confusing newbies trying to see when to use which option. ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-16553241"
        },
        {
            "date": "2018-07-23T22:55:03+0000",
            "content": "Sort of a side-question, but this work seems to overlap/compliment the significantTerms ..\n\nThat does seem very tangential, but important to consider – so i spun it off into SOLR-12582. One key aspect of my comments there that is directly signifincat to this issue is the question of the name \"min_popularity\" and wether it makes sense to re-think that...\n\nas far as trying to maintain the same option names – i don't know that that is feasible or really makes sense – at least in so much as adding new options to relatedness() using hte same names as the existing options on significantTerms.  notably the existing minDocFreq option on significantTerms is similar in concept to the min_popularity option proposed in SOLR-12581 for relatedness(), but it would not really make sense to use minDocFreq as the option name in SOLR-12581 since the relatedness() function isn't tied to \"terms\" the way significantTerms is – so \"docFreq\" has no real meaning, and the more general \"popularity\" makes more sense (i suppose we could change the option name in signifncatTerms – but even then significantTerms doesn't produce the same concept of \"popularity\" that relatedness() does, andeven if it did because that that expression focuses exclusively on \"terms\" the concept of \"DocFreq\" is very appropriate.\n \n\n \n\n  ",
            "author": "Hoss Man",
            "id": "comment-16553510"
        },
        {
            "date": "2018-07-24T22:16:45+0000",
            "content": "patch updated for master with ref-guide docs. ",
            "author": "Hoss Man",
            "id": "comment-16554857"
        },
        {
            "date": "2018-07-25T17:34:27+0000",
            "content": "Commit cf9c3c11a28deff188f4edb5ee5cdd0637cdb958 in lucene-solr's branch refs/heads/branch_7x from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cf9c3c1 ]\n\nSOLR-12581: the JSON Facet 'relatedness()' aggregate function now supports a 'min_popularity' option using the extended type:func syntax\n\n(cherry picked from commit 71c0bddd149b7c0364fbba8d31494dcd9f57f1ef) ",
            "author": "ASF subversion and git services",
            "id": "comment-16556035"
        },
        {
            "date": "2018-07-25T17:34:28+0000",
            "content": "Commit 71c0bddd149b7c0364fbba8d31494dcd9f57f1ef in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=71c0bdd ]\n\nSOLR-12581: the JSON Facet 'relatedness()' aggregate function now supports a 'min_popularity' option using the extended type:func syntax ",
            "author": "ASF subversion and git services",
            "id": "comment-16556036"
        }
    ]
}