{
    "id": "SOLR-8918",
    "title": "Add Streaming Expressions to the admin page",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "6.1",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Add to the admin page an ability to work with and view Streaming Expressions.\n\nThis tab will appear under the Collection selection section and will work similarly to the Query tab. On this page the user will be able to enter a streaming expression for execution. The user can then execute the expression against the collection and view all the results as they are returned from the Stream handler. Along with this the user will be able to view the structure of the expression in a graph-like layout. \n\nIf the user wishes to only view the expression structure without executing the expression the user will be able to click an \"Explain\" button which will show the structure. Included in the structure will be information about each node (the expression for that node).",
    "attachments": {
        "sample-display.png": "https://issues.apache.org/jira/secure/attachment/12795973/sample-display.png",
        "SOLR-8918.patch": "https://issues.apache.org/jira/secure/attachment/12795969/SOLR-8918.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-29T23:48:44+0000",
            "author": "Dennis Gove",
            "content": "This patch adds a new section to work with Streaming Expressions. It is far from complete but I wanted to put it up to get people's feedback or ideas about the display. \n\nExecuting an expression should show all the results. Explaining an expression is still under development but if you click that button it will show you the layout of a sample expression. Still requires work on the layout, canvas size, node display (I'm thinking different types of rectangles w/images for different types of Stream classes), and getting the expression explanation from the stream handler. ",
            "id": "comment-15217084"
        },
        {
            "date": "2016-03-30T00:04:31+0000",
            "author": "Dennis Gove",
            "content": "Attaching a sample display (without search results) ",
            "id": "comment-15217098"
        },
        {
            "date": "2016-04-11T11:45:21+0000",
            "author": "Dennis Gove",
            "content": "Includes changes in the solrj.io package to support returning a stream explanation as well as some changes on the UI to display what is returned. Still requires a bit of work for UI and some additional testing (both manual and unit) for the stream explanations. ",
            "id": "comment-15234925"
        },
        {
            "date": "2016-04-11T12:28:50+0000",
            "author": "Upayavira",
            "content": "This is great! Will really help folks learn the streaming API.\n\nSome questions:\n\nWould it make sense to add two tabs at the top, one for streaming expressions, and the other for SQL?\n\nThe second suggestion is a lot more substantial. Given that the streaming API is essentially a programming language, would it be possible to add support for autocomplete or code suggestions to the editor?\n\nThere's a list of Javascript editors here, some of which support \"code suggestions\":\nhttps://en.wikipedia.org/wiki/Comparison_of_JavaScript-based_source_code_editors\n\nThoughts? ",
            "id": "comment-15234990"
        },
        {
            "date": "2016-04-15T02:56:18+0000",
            "author": "Dennis Gove",
            "content": "UI changes to display the explanation nodes properly as a graph. Support for additional streams. \n\nStill requires addition of tests. ",
            "id": "comment-15242329"
        },
        {
            "date": "2016-04-15T02:58:46+0000",
            "author": "Dennis Gove",
            "content": "Right now you can get additional details on each node (expression, stream type, implementing class) if you hover-over. I'd like to add the ability to click the node and have the details appear somewhere on the page. Also would like to change the node color based on the type of stream (source, decorator, graph, etc...) and add a legend for that. ",
            "id": "comment-15242331"
        },
        {
            "date": "2016-04-19T01:05:14+0000",
            "author": "Dennis Gove",
            "content": "Have finally got this in a finalized state. The admin page allows you to select whether you want an explanation with your results or just the results. The explanation has four types of nodes: Stream Decorator, Stream Source, Graph Source, and Datastore. Each type shows in a different color. For those with color-blindness the type of stream is also available in the node hover. I've also added a legend. I did not make the nodes clickable - am leaving that for future work.\n\nI'll be splitting this up into two tickets. This ticket will cover the admin page changes and a new ticket will be added covering the changes on streaming classes to return the explanation. ",
            "id": "comment-15246888"
        },
        {
            "date": "2016-04-19T01:13:59+0000",
            "author": "Dennis Gove",
            "content": "Patch for admin page changes only. ",
            "id": "comment-15246899"
        },
        {
            "date": "2016-04-19T03:45:55+0000",
            "author": "Dennis Gove",
            "content": "Changes the format of the output resultset data to better show json. ",
            "id": "comment-15247123"
        },
        {
            "date": "2016-04-19T15:42:26+0000",
            "author": "ASF subversion and git services",
            "content": "Commit af7dad6825d47e76c39842e97be8b37ab4c2cffd in lucene-solr's branch refs/heads/master from Dennis Gove\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=af7dad6 ]\n\nSOLR-8918: Adds Streaming to the admin page under the collections section\n\nIncludes ability to see graphically the expression explanation ",
            "id": "comment-15248005"
        },
        {
            "date": "2016-04-19T16:39:59+0000",
            "author": "Joel Bernstein",
            "content": "Playing with this now. This is an amazing piece of work... ",
            "id": "comment-15248127"
        },
        {
            "date": "2016-04-19T17:03:16+0000",
            "author": "Joel Bernstein",
            "content": "One thing I noticed is the \"Graph\" under the Cloud tab has disappeared. Probably related to this ticket. ",
            "id": "comment-15248185"
        },
        {
            "date": "2016-04-19T17:55:19+0000",
            "author": "Dennis Gove",
            "content": "I've confirmed that it's definitely this patch that caused the graph on the cloud tab to disappear but I've yet to figure out why it's disappeared. I suspect angular is doing something I didn't expect, particularly with the directive at https://github.com/apache/lucene-solr/blob/master/solr/webapp/web/js/angular/controllers/stream.js#L146\n\nAm continuing to investigate. ",
            "id": "comment-15248288"
        },
        {
            "date": "2016-04-20T00:07:39+0000",
            "author": "Dennis Gove",
            "content": "I've found the problem and in doing so developed a slight dislike for angular (but really it was my own fault because I know all about javascript global states and what not).\n\nstream.js was created from a copy of cloud.js. cloud.js created a global variable called graphSubController. When I was mucking around with stream.js I kept the graphSubController global variable but re-implemented it. Now, when angular runs it will process all the .js files and in doing so the stream.js::graphSubController replaced cloud.js::graphSubController so the correct sub controller was not being called from the cloud.js code page.\n\nI'll have a patch to fix this in a little bit - after I go and cleanup all the alerts I added to figure out what in the world was going on.\n\n(in reality though, it was pretty fun to learn-ish angular for this) ",
            "id": "comment-15248988"
        },
        {
            "date": "2016-04-20T00:34:26+0000",
            "author": "ASF subversion and git services",
            "content": "Commit e6e495c79588c60db1ac45bcba1a1dcaa970bcea in lucene-solr's branch refs/heads/master from Dennis Gove\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e6e495c ]\n\nSOLR-8918: Corrects usage of a global variable in admin page's stream.js which was overriding the same variable in cloud.js ",
            "id": "comment-15249037"
        },
        {
            "date": "2016-04-20T08:19:43+0000",
            "author": "Upayavira",
            "content": "You are right, globals suck. That's js not angular. You could add the subcontroller to the scope, that'd make it local. ",
            "id": "comment-15249473"
        },
        {
            "date": "2016-05-02T13:29:38+0000",
            "author": "ASF subversion and git services",
            "content": "Commit fc2200e4f9927e5595197831b9b6265085b65ab3 in lucene-solr's branch refs/heads/branch_6x from Dennis Gove\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=fc2200e ]\n\nSOLR-8918: Adds Streaming to the admin page under the collections section\n\nIncludes ability to see graphically the expression explanation ",
            "id": "comment-15266606"
        },
        {
            "date": "2016-05-02T13:29:40+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 499ae951ec4a5e35a9d067f2d3abf69e6734a08b in lucene-solr's branch refs/heads/branch_6x from Dennis Gove\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=499ae95 ]\n\nSOLR-8918: Corrects usage of a global variable in admin page's stream.js which was overriding the same variable in cloud.js ",
            "id": "comment-15266607"
        },
        {
            "date": "2016-05-09T21:57:34+0000",
            "author": "Hoss Man",
            "content": "\nManually correcting fixVersion per Step #S5 of LUCENE-7271 ",
            "id": "comment-15277132"
        }
    ]
}