{
    "id": "SOLR-3044",
    "title": "Incrementally deprecate NamedList & replace with typesafe API",
    "details": {
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Critical",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The first thing I can think of when I see how and where NamedList is used in solr is \"if you have a hammer in your hands, every problem looks like a nail\". IMO and I know others think the same way the use of NamedList is way over the top for a long time. However the biggest issues here is the massive use of this class all over the place which has several problem, here is a list just to name a some:\n\n\n\tno type safety\n\tproduces lots of garbage\n\tmakes things hard to refactor\n\tbinds everything strongly to Solr and is contra modularization\n\tcode is hardly readable - one example is all the distributed request / response processing\n\trequires autoboxing of primitives all over the place\n\tsome processing is N^2 where N is possible\n\trequires tons of instanceof conditions\n\t...\n\n\n\nYet this task is not simple nor is it possible to do this in a single patch. I think the target of this issue and all its subtasks will be 5.0 but we need to start doing it to eventually clean up the API enough to get rid of all the issues I named above.\n\nOne way of starting would be to create a couple of subtasks like:\n\n\n\tRefactor ResponseWriters to pass in a StreamWriter similar to what XML or JSON apis (Jackson / STAX) and let the ResponseObject write itself based on the StreamWriter impl.\n\tRefactor configuration and resourceloading to use some libraries that are specialized to do that.\n\tDeprecate SearchComponent methods that accept named list in favor of a typesafe API\n\n\n\nI think we should start doing this its time to move on here!",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jason Rutherglen",
            "id": "comment-13188549",
            "date": "2012-01-18T16:58:45+0000",
            "content": "+1 NamedList is an oldie, not not a goodie. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13292201",
            "date": "2012-06-09T06:07:39+0000",
            "content": "LISP is indeed very very old. NamedList is LISP with keys for the nodes. "
        }
    ]
}