{
    "id": "SOLR-10361",
    "title": "Add a solr-docs.tar.gz file",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "On SOLR-9450 we decided to add a separate documentation package to the Solr downloads. I did something similar for forbiddenapis, too. This docs.tar.gz file should contain Lucene and Solr Javadocs.\n\nThis would solve the following problems:\n\n\tPeople can still download Javadocs, if they like to browse them offline, but it won't blow the release\n\tThe release manager has an easier job to push them to the website. The current process broke by SOLR-9450.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-24T18:54:01+0000",
            "content": "Since the idea is to include both Lucene and Solr docs in the docs package: a) this issue's title says \"solr-docs.tar.gz\" but I think it should be \"docs.tar.gz\"?  And b) maybe this should be a LUCENE issue instead of a SOLR one? ",
            "author": "Steve Rowe",
            "id": "comment-15940936"
        },
        {
            "date": "2017-03-24T19:05:52+0000",
            "content": "It is open for discussion! \n\nPreviously we only had Solr Documentation and a link to the Lucene online version, which was far from ideal. The idea is to have both in one file for Solr users. Lucene already has its own docs in its own tar.gz file (there is no change). This is why I opened it in Solr's project. It is for publishing the \"full Solr documentation\" (which must include Lucene for navigation purposes). ",
            "author": "Uwe Schindler",
            "id": "comment-15940959"
        },
        {
            "date": "2017-03-24T20:07:23+0000",
            "content": "Okay, what you say makes sense, Uwe. ",
            "author": "Steve Rowe",
            "id": "comment-15941056"
        },
        {
            "date": "2017-03-29T09:21:33+0000",
            "content": "Is this a real user request?\nI thought that we discussed earlier that people who want to develop with Solr and want local javadoc easily can download the src release and call ant javadoc. This can be documented.\nOr if we need it packaged, instead of a new tgz release artifact, could we instead build javadoc jar files and upload to maven-central e.g. solr-solrj-6.5.0-javadoc.jar? Some IDEs can pull javadoc automatically, or developers could also download and unzip. ",
            "author": "Jan Høydahl",
            "id": "comment-15946793"
        },
        {
            "date": "2017-03-29T12:09:48+0000",
            "content": "Hi the issue here is:\nThe RM of Lucene and Solr hast to upload the Javadocs/Documentation to the web page. Currently he has to build the release and then copy away the javadocs files from the build folders. When the vote has succeeded he would commit the javadocs to web page.\n\nPreviously this was done by using the already voted on tar.gz binary releases, where the docs folder was extracted and uploaded to Website SVN. Now, the javadocs have to be preserved manually and we cannot vote on them (layout, design issues). So the idea was to just pack them during the release process so we can vote on them and its easier for the RM to publish them on the web site.\n\nWe already publish javadocs maven artifacts, but only per module: http://search.maven.org/#search%7Cgav%7C1%7Cg%3A%22org.apache.solr%22%20AND%20a%3A%22solr-core%22 Those are only for IDEs to show it in Maven/Gradle projects automatically. The Maven-Javadocs are not useful for browsing, as many information is missing/broken (like inter-module cross-links). ",
            "author": "Uwe Schindler",
            "id": "comment-15946993"
        },
        {
            "date": "2017-03-29T12:13:29+0000",
            "content": "Ok, that makes sense. Didn't realize we already had javadoc jars. ",
            "author": "Jan Høydahl",
            "id": "comment-15946998"
        }
    ]
}