{
    "id": "SOLR-12173",
    "title": "Create or improve certain startup log messages",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "logging"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.3",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Some log events that I think Solr should have when it starts up.  All of these should have unique logger names or text strings so that a verbose log can be searched to find them.\n\n\n\tAn event indicating when startup is complete.  The time to log this is when all cores are loaded/started (or inventoried for lotsOfCores functionality), cloud information is examined and cached as required, background threads started, etc.\n\t\n\t\tThe log message should included JVM uptime and elapsed time since Solr (the webapp) started.\n\t\tIf somebody were to hot-deploy Solr into a running container, the JVM uptime would not be useful information.  That should not be common, though.\n\t\n\t\n\tOne of the things that SolrCloud will do when it starts is determine whether any indexes need recovery operations, and proceed to do those operations.  Separate logs indicating when that process starts and when it finishes could be useful.  For the finish event, an elapsed time for all recovery operations would be essential.  And I think it should log the JVM uptime, like the earlier \"startup complete\" message.\n\t\n\t\tEach individual recovery operation should probably log similar events.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-03-31T17:12:57+0000",
            "content": "There might already be a logging event for this, but I haven't checked yet.  If it's there, then it should be modified to include the elapsed time figures.\n\nTopic for discussion:  Should the event be logged at WARN so that users who lower their default logging level can also see this log entry?  It's not actually a warning. ",
            "author": "Shawn Heisey",
            "id": "comment-16421403"
        },
        {
            "date": "2018-03-31T17:14:59+0000",
            "content": "JVM uptime is easy to get.\n\n\nlong jvmUpTime = ManagementFactory.getRuntimeMXBean().getUptime();\n\n ",
            "author": "Shawn Heisey",
            "id": "comment-16421404"
        },
        {
            "date": "2018-03-31T19:26:22+0000",
            "content": "A side effect of logging at WARN would be that there would usually be something in the logging tab of the admin UI.  We did recently fix a bug so it explicitly says there's nothing to display, but a real log entry would be a good thing.\n\nRandom thought: A log event indicating when all required SolrCloud recovery operations are finished would be useful.  I think it should be logged separately, with elapsed time for all recovery and including the JVM uptime again. ",
            "author": "Shawn Heisey",
            "id": "comment-16421436"
        }
    ]
}