{
    "id": "SOLR-1073",
    "title": "StrField should allow locale sensitive sorting",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Currently, StrField does not take a parameter which it can pass to ctor of SortField making the StrField's sorting rely on the locale of the JVM.  Ideally, StrField should allow setting the locale in the schema.xml and use it to create a new instance of the SortField in getSortField() method, something like:\nsnip:\n  public SortField getSortField(SchemaField field,boolean reverse)\n  {\n...\n\t\tLocale locale = new Locale(lang,country);\n\t\treturn new SortField(field.getName(), locale, reverse);\n }\n\nMore details about this issue here:\nhttp://www.nabble.com/CJKAnalyzer-and-Chinese-Text-sort-td22374195.html",
    "attachments": {
        "LocaleStrField.java": "https://issues.apache.org/jira/secure/attachment/12402368/LocaleStrField.java"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Sachin",
            "id": "comment-12682604",
            "date": "2009-03-17T09:04:24+0000",
            "content": "A new data type which extends StrField and provides locale specific sorting. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12703884",
            "date": "2009-04-28T23:50:19+0000",
            "content": "The patch seems ok to me, ideally it should validate the Locale during init and fail if it doesn't exist, but that doesn't seem like a show stopper.  I'm personally not comfortable committing it without a basic test (Locale stuff is tricky, it would be good to know we aren't tickling some weird Lucene-Java bug in an odd way).  \n\nThe only other big catch in my mind is that this new class doesn't respect the sortMissingLast  & sortMissingTrue options that StrField does.  We should at least document this in the javadocs, but ideally we should make them work as well.  I think it would be possible if we changed MissingStringLastComparatorSource so that it could wrap another SortComparatorSource (do the null checks first, then delegate).  if we managed to get that working, then there wouldn't be any reason for a new LocaleStrField, it could just be a new option on StrField. "
        },
        {
            "author": "Walter Underwood",
            "id": "comment-12703893",
            "date": "2009-04-29T00:05:05+0000",
            "content": "Using the locale of the JVM is very, very bad for a multilingual server. Solr should always use the same, simple locale. It is OK to set a Locale in configuration for single-language installations, but using the JVM locale is a recipe for disaster. You move Solr to a different server and everything breaks. Very, very bad.  \n\nIn a multi-lingual config, locales must be set per-request.\n\nIdeally, requests should send an ISO language code as context for the query.\n\n "
        },
        {
            "author": "Sachin",
            "id": "comment-12706949",
            "date": "2009-05-07T15:50:50+0000",
            "content": "Hoss: \n\n1) I didn't add the validation as currently it falls back on the default implementation of String sort in case the locale is not specified.\n2) About the basic test, we've using this on http://cn.allrecipes.com for last month or so and haven't had users complaining about it (yet). \n3) sortMissingLast & sortMissingTrue wasn't implemented as I only need sorting for a field which doesn't allow null  but I'll be quite happy to get that in.\n\nWalter:\n\nSorry for being a little slow but I didn't understand much (my lack of understanding of java), can you please elaborate a little?\n\nThanks! "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12785185",
            "date": "2009-12-03T05:07:07+0000",
            "content": "fyi, SOLR-1571 is an alternative implementation for this feature, but instead works as a TokenFilter, indexing collation keys.  (You then just sort on that field).\n\nIt doesn't have the performance problems of Lucene's Locale-based sort, but on the other hand it requires some additional space in the index (the work is done at index time). "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872625",
            "date": "2010-05-27T22:09:27+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043786",
            "date": "2011-06-03T16:47:03+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106378",
            "date": "2011-09-16T14:50:49+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234637",
            "date": "2012-03-21T18:08:41+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717205",
            "date": "2013-07-23T18:47:28+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971271",
            "date": "2014-04-16T12:57:37+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}