{
    "id": "SOLR-5071",
    "title": "Solrcloud change core to another shard issue",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "I have a solrcloud cluster with one collection and two shards.\nOne core is a replica for shard1, I stop it and change its solr.xml like this:\n<core name=\"collection1\" instanceDir=\"collection1\" shard=\"shard2\"/>\nSo this core should be a shard2 replica, Then I restart it, open cloud graph page(see attachment), you can see this core as a down replica still in shard1 and also as a active replica in shard2.\n\nThere is doubt about one core status in two shards.\nIn this one core has two status scenario I suggest that if we could remove the down replica information of other shard in clusterStatus.json.\nI remember when core is changing to active status, it will send overseer an active status message, so add this logic to overseer change core to active status part.",
    "attachments": {
        "2013-7-24 11-55-45.png": "https://issues.apache.org/jira/secure/attachment/12593846/2013-7-24%2011-55-45.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Daniel Collins",
            "id": "comment-13718187",
            "date": "2013-07-24T09:56:10+0000",
            "content": "I suspect the response to this will be you are doing something unsupported.  To do this properly, you should UNLOAD the old core, and (re-)CREATE it as a new core, that would keep ZK in sync. ZK has no knowledge of what you've done in the solr.xml file, so it can't possibly know what's going on.\n\nIn addition, this syntax of solr.xml is deprecated as of Solr 4.4 so the whole issue would only affect versions up to Solr 4.3.1.  From Solr 4.4 onwards, solr.xml won't have any of this information, it will be in the core.properties file for each core.  I'm not sure what happens if you change that file by hand, but I suspect that may to be an \"unsupported\" action. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13718276",
            "date": "2013-07-24T11:59:24+0000",
            "content": "Daniel pretty well nailed it. Changing a local solr.xml and having ZooKeeper pick it up somehow is unsupported.\n\nA minor correction though. The current form of solr.xml will be supported in Solr 4.4 and all of Solr 4.x, even though it's deprecated. As of Solr 5.0 (current trunk) that support will be removed. "
        }
    ]
}