{
    "id": "SOLR-1405",
    "title": "Show the index files in the web UI",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "3.2"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It would be great to view the actual index files from the web console.",
    "attachments": {
        "Index file list.png": "https://issues.apache.org/jira/secure/attachment/12445995/Index%20file%20list.png",
        "data menu.png": "https://issues.apache.org/jira/secure/attachment/12445994/data%20menu.png",
        "SOLR-1405.patch": "https://issues.apache.org/jira/secure/attachment/12445993/SOLR-1405.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12750842",
            "date": "2009-09-03T06:19:08+0000",
            "content": "DO you mean just the information of an ls -l to be shown on the screen ? "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-12755824",
            "date": "2009-09-16T00:58:20+0000",
            "content": "Noble, Somewhat like the information \"ls -l\" shows.  Name, size, date would be good for starters. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872544",
            "date": "2010-05-27T22:07:32+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Juan Pedro Danculovic",
            "id": "comment-12873869",
            "date": "2010-06-01T03:58:36+0000",
            "content": "This patch solves this issue.\n\nI've attached two screenshots to show the data menu and the index file info details\n\nJuan "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874168",
            "date": "2010-06-01T19:15:21+0000",
            "content": "There's a general concensus that we should stop adding new JSPs to the admin interface (or enhancing existing JSPs) and we should instead use RequestHandlers to return this type of information – that way it can be more easily consumed by client libraries or AJAX based requests, and styled using XSLT.\n\nin particular: the SystemInfoHandler is replacing the registry.jsp and stats.jsp.\n\nWhile we could certainly add this to the SystemInfoRequestHandler it seems like it might make sense as part of hte LukeRequestHandler (using a new \"files\" value for the \"show\" param)\n\nUnrelated note: We should also try to make sure we respect the Directory abstraction (don't assume all files are related to the index) and we have to be aware of hte whole IndexReaderFactory thing (so the directory may not even be used) ... i don't know that we have to do anything special in that case, but we should at least sanity check that the combination of the two doesn't break anything "
        },
        {
            "author": "Andrzej Bialecki",
            "id": "comment-12874173",
            "date": "2010-06-01T19:23:40+0000",
            "content": ".. in particular ParallelReader.directory() throws UnsupportedOperationException, so such cases should be handled too. "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-12874715",
            "date": "2010-06-02T18:14:12+0000",
            "content": "general concensus that we should stop adding new JSPs to the admin interface\n\nMakes sense... I'll update my ZK related patch accordingly.  \n\nAlso, ReplicationHandler shows the index files as well. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12874741",
            "date": "2010-06-02T18:54:14+0000",
            "content": "There's a general concensus that we should stop adding new JSPs to the admin interface (or enhancing existing JSPs) and we should instead use RequestHandlers to return this type of information\n\nHmmm, really?\n\nI've not opposed to people converting JSPs to something else (when the functionality is not diminished), but I'm certainly against a JSP moratorium without very good reason.  Sometimes it's just a much easier way to expose simple information that's primarily meant for human consumption (and when there is a patch in hand).\n\nProgress, not perfection  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874746",
            "date": "2010-06-02T19:09:38+0000",
            "content": "Hmmm, really?\n\nit's a recurring theme that keeps coming up over and over - i actually thought you were the person who originally started pushing for it.\n\nSometimes it's just a much easier way to expose simple information that's primarily meant for human consumption (and when there is a patch in hand).\n\nFair enough ... but at this point we already have the SystemInfoRequestHandler which eliminates the need for stats.jsp or registry.jsp (which is what this patch updates) ... so i'd rather not add more functionality to either of those JSP. "
        },
        {
            "author": "Juan Pedro Danculovic",
            "id": "comment-12874762",
            "date": "2010-06-02T19:50:51+0000",
            "content": "I didn't know about the idea of stop adding code into jsp pages\nI can change the patch and add the index files information into the SystemInfoRequestHandler. Is this ok?\nSorry about my mistake. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874776",
            "date": "2010-06-02T20:19:42+0000",
            "content": "Juan: no apologies neccessary, you made no mistake – i was just sharing my opinions on the subject.\n\nI was just looking at SOLR-1750 with the intent of finishing it up and merging your patch into that handler, when i realized it may not the best place either (there is already another SystemInfoHandler so i think SystemInfoRequestHandler should narrow it's focus to just be about returning the lists of SolrInfoMBean's w/stats)\n\nIf you want to tweak the patch to updated either the LukeRequestHandler or the SystemInfoHandler feel free – i'm not honestly sure where it makes the most sense at this point. "
        },
        {
            "author": "Juan Pedro Danculovic",
            "id": "comment-12875743",
            "date": "2010-06-04T20:44:03+0000",
            "content": "I think that LukeRequestHandler is better than SystemInfoHandler because index files are closer to lucene but it is true that is a thin line to determine where the issue suites best.\n\nI can try to add it to LukeRH. Are you agree? "
        },
        {
            "author": "Juan Pedro Danculovic",
            "id": "comment-12877811",
            "date": "2010-06-11T12:47:22+0000",
            "content": "The last patch adds index files information into LukeRequestHandler and also includes the test. "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-12986000",
            "date": "2011-01-24T21:12:19+0000",
            "content": "Sorry if this spam's things, however it's unlikely that I'll work on these. "
        }
    ]
}