{
    "id": "SOLR-8124",
    "title": "Adjust relevance based on user click/feedback",
    "details": {
        "components": [
            "search"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Duplicate",
        "priority": "Major"
    },
    "description": "It may be interesting to be able to bias the score of documents based on user feedback. For instance, if query q=solr+rocks returns 2 documents A and B, and if most people click on document B, then document B could be given a higher score given that it seems to satisfy most people.\n\nA solution would be to have a field 'popularity' containing the number of times people clicked on that document. Search queries would then boost documents with a high 'popularity' (as described in this presentation).\n\nThe problem with the above is that the document's popularity would be global. Ideally, the document's popularity would depend on the search query (possibly parameters q and fq). For instance a document titled 'solr cookbook' might be popular for a query q=solr+rocks but not for q=cook+cake.\n\nHence a possible solution would be to maintain some kind of map between \"document ID + query\" and \"popularity\". The popularity could be exposed in a field so search queries could use it in boost clauses. I am guessing we would need to create a new SearchComponent.\n\nOther search engines seem to support this kind of feature, for instance the Google Search Appliance provides a /click protocol and LucidWorks provides a Click Scoring Relevance Framework.\n\nDoes this sound worthy ? I could not find any other ticket dealing with this so opening this one to check people's opinion.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-08T21:25:46+0000",
            "author": "Fengtan",
            "content": "The User Interactions Logging module sounds similar - SOLR-10359. ",
            "id": "comment-16001569"
        }
    ]
}