{
    "id": "SOLR-8797",
    "title": "Backup command on a recovering index should fail",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.0",
        "status": "Closed",
        "resolution": "Not A Problem",
        "priority": "Minor"
    },
    "description": "We are using the backup command \"http:// ...\n/replication?command=backup&location=/tmp\" against one server of the\ncluster.\n    Most of the time there is no issue with this command.\n\n    But in some particular case, the server can be in recovery mode. In\nthis case, the command is doing a backup on an index that is not\ncomplete and return a http code 200. We end up with a partial index\nbackup ! As a workaround we will do this backup against the leader of\nthe cloud: the leader is never in recovery mode.\n\n    In our opinion, the backup command on a recovering index should\nreturn a http code 503 Service Unavailable (and not http code 200 OK).\n\n  Mail in the mail list",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-07T13:18:30+0000",
            "author": "Varun Thacker",
            "content": "Hi Gerald,\n\nYes this will happen now. Currently Solr supports backup and restore of cores . When SOLR-5750 is complete this problem will be solved since Solr will support backup/restore of a cloud collection. There backups will only be taken against the leaders.\n\nCurrently as a workaround you can use the CLUSTERSTATUS Collection API to fetch the leaders of replicas and issue a backup against those specific nodes ",
            "id": "comment-15182987"
        },
        {
            "date": "2016-03-07T13:24:58+0000",
            "author": "Gérald Reinhart",
            "content": "Hi Varun,\n\n   Thanks for the quick answer.\n   We will implement this workaround.\n\n   Our point is that it shouldn't be possible to do a backup from a recovering index.\n\nThanks,\n\nGérald\n\n ",
            "id": "comment-15182992"
        },
        {
            "date": "2016-03-07T13:26:35+0000",
            "author": "Varun Thacker",
            "content": "Our point is that it shouldn't be possible to do a backup from a recovering index.\n\nRight. But the current backup functionality is not cloud aware so there is no logic to prevent it. Its backup/restore of solr cores  ",
            "id": "comment-15182993"
        }
    ]
}