{
    "id": "SOLR-7227",
    "title": "Solr distribution archive should have the WAR file extracted already",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.3",
            "6.0"
        ],
        "affect_versions": "5.0",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Currently, there is still the solr.war file in the server/webapps directory, which gets extracted upon first startup of Solr. It would be better to ship Solr with the WAR already extracted, thus taking us one step closer to truly not shipping a WAR file. Moreover, some users have reported not being able to make /opt/solr truly read-only because of the need to extract the WAR on-the-fly upon first startup.",
    "attachments": {
        "SOLR-7227-part2.patch": "https://issues.apache.org/jira/secure/attachment/12747508/SOLR-7227-part2.patch",
        "SOLR-7227.patch": "https://issues.apache.org/jira/secure/attachment/12746860/SOLR-7227.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-10T16:45:26+0000",
            "author": "Shawn Heisey",
            "content": "Would the plan here be to eliminate the war itself in the binary release and just include the extracted archive?  I would hate to add another 30MB to the download size. ",
            "id": "comment-14355178"
        },
        {
            "date": "2015-03-10T16:51:59+0000",
            "author": "Shawn Heisey",
            "content": "Very good upgrade instructions will be very important, as the old extracted archive (and any war files) must be completely deleted before copying the new version into place.  This is good advice even when a war file is being used. ",
            "id": "comment-14355188"
        },
        {
            "date": "2015-03-10T17:26:22+0000",
            "author": "Timothy Potter",
            "content": "Would the plan here be to eliminate the war itself in the binary release and just include the extracted archive?\n\nCorrect. No more WAR period! \n\nVery good upgrade instructions will be very important\n\nDoing this actually helps with upgrades since you can just install a new version into /opt, e.g. /opt/solr-5.1.0, and then update the symlink /opt/solr -> /opt/solr-5.1.0 ... assuming you're using the suggested production deployment model describe here: https://cwiki.apache.org/confluence/display/solr/Taking+Solr+to+Production ",
            "id": "comment-14355264"
        },
        {
            "date": "2015-03-10T17:37:59+0000",
            "author": "Shawn Heisey",
            "content": "and then update the symlink /opt/solr -> /opt/solr-5.1.0\n\nThere are a lot of reasons (other than a strong dislike of Microsoft's general approach to software licensing) that I prefer Linux to Windows.  This is one of them.  NTFS does have similar functionality to links, but it is very much an expert option which is not at all well-known even among seasoned administrators. ",
            "id": "comment-14355286"
        },
        {
            "date": "2015-07-22T18:45:47+0000",
            "author": "Timothy Potter",
            "content": "I'm porting a ton of code from bin/solr and bin/solr.cmd over to Java as part of the SOLR-7043 effort and have hit a problem on Windows where we can't launch the SolrCLI application until solr.war is extracted ... so it's time to get this one done for 5.3 ",
            "id": "comment-14637416"
        },
        {
            "date": "2015-07-23T20:10:28+0000",
            "author": "Timothy Potter",
            "content": "Here's a patch that explodes the server/webapps/solr.war into server/solr-webapp/webapp and then removes solr.war.\n\nThis gives us a couple of nice things:\n1) Jetty no longer has to extract the solr.war, so production installs can make the distribution folder read-only, i.e. /opt/solr can be read-only with all writing happening in /var/solr\n\n2) No more need to extract the WAR to run tools like zkCli.sh and SolrCLI (esp. problematic on Windows where you don't have JAR if you're running with a JRE instead of JDK)\n\n3) One step closer to truly no war\n\n4) Reduces the size of the tgz file by about 12MB\n\nnightly-smoke passes with this patch but I'd still appreciate a review of the smoke test python code I had to change\n\nLastly, I'm wondering if we shouldn't delete the server/webapps directory too? I left it in there now, but I think it should go away. And while we're at it, maybe we should rename the server/solr-webapp directory to something non-webapp specific, server/solr-??? (i'm terrible at naming things but seems like a reasonable time to remove any mention of webapp) ",
            "id": "comment-14639433"
        },
        {
            "date": "2015-07-24T20:53:00+0000",
            "author": "Timothy Potter",
            "content": "Updated patch that removes the server/webapps directory as well; there's no sense in shipping Solr with an empty webapps directory esp. since we're trying to dispel the idea that Solr is a Web application.\n\nThis is ready for commit from where I sit. ",
            "id": "comment-14641054"
        },
        {
            "date": "2015-07-27T18:12:47+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1692925 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1692925 ]\n\nSOLR-7227: Solr distribution archive should have the WAR file extracted already ",
            "id": "comment-14643142"
        },
        {
            "date": "2015-07-27T20:51:39+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1692947 from Timothy Potter in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1692947 ]\n\nSOLR-7227: Solr distribution archive should have the WAR file extracted already ",
            "id": "comment-14643364"
        },
        {
            "date": "2015-07-28T06:45:00+0000",
            "author": "Uwe Schindler",
            "content": "Hi,\njust one question: Why do we create the WAR file at all in the build.xml of webapps module? Currently we create it and delete it in the the same ANT target after extracting! I would simply replace the <war/> by a <copy/> task. Some attributes like the path to the web.xml need to be changed (as the copy task does not have them, but otherwise the ANT War task does nothing special. The manifest is useless. ",
            "id": "comment-14643938"
        },
        {
            "date": "2015-07-28T07:11:57+0000",
            "author": "Uwe Schindler",
            "content": "Patch removing webapp WAR build completely. I also renamed some targets. ",
            "id": "comment-14643965"
        },
        {
            "date": "2015-07-28T07:25:48+0000",
            "author": "Uwe Schindler",
            "content": "Removal of more useless stuff ",
            "id": "comment-14643981"
        },
        {
            "date": "2015-07-28T07:49:53+0000",
            "author": "Uwe Schindler",
            "content": "I accidently removed additional webapp folder, reverted. ",
            "id": "comment-14644024"
        },
        {
            "date": "2015-07-28T08:17:22+0000",
            "author": "Uwe Schindler",
            "content": "One more obsolete property. I also added \"extractWAR\"=\"false\" to the context descriptor: this prevents Jetty from creating the temporary folder, that leaves checkout dirty. This helps with read-only filesystems, too.\n\nSeems ready to commit now.\n\nI noticed one thing: the inner folder solr-webapp/webapp is somehow obsolete, we could move the whole stuff one up (remove inner webapp folder). This should maybe a separate issue/commit, because this affects script files, too. ",
            "id": "comment-14644048"
        },
        {
            "date": "2015-07-28T08:18:50+0000",
            "author": "Uwe Schindler",
            "content": "By the way: I compared the pre-patch and after-patch extracted webapp folders. They are identical, only the META-INF folder is missing (which is fine, because its just a packaging relict).  ",
            "id": "comment-14644049"
        },
        {
            "date": "2015-07-28T13:39:59+0000",
            "author": "Timothy Potter",
            "content": "I'm pretty sure the smoke tester checks things in the manifest. Uwe Schindler Did you run smoke tester with your patch? ",
            "id": "comment-14644377"
        },
        {
            "date": "2015-07-28T13:44:00+0000",
            "author": "Uwe Schindler",
            "content": "Yes passes. Manifests are only required inside JAR or WAR files (they have metadata about the WAR file itsself) - and the WAR file is gone. The JAR files of our application all have valid META-INF. ",
            "id": "comment-14644381"
        },
        {
            "date": "2015-07-28T13:46:34+0000",
            "author": "Uwe Schindler",
            "content": "But in any case we can remove the special cases for WAR files from the smoke tester, but this is why you left the issue open. ",
            "id": "comment-14644383"
        },
        {
            "date": "2015-07-28T13:52:38+0000",
            "author": "Uwe Schindler",
            "content": "New patch without WAR special case in smoke tester (no longer needed) – currently untested, have to boot Linux again. ",
            "id": "comment-14644389"
        },
        {
            "date": "2015-07-28T14:19:50+0000",
            "author": "Timothy Potter",
            "content": "thanks - I'm running it now too on my Mac ",
            "id": "comment-14644418"
        },
        {
            "date": "2015-07-28T14:22:22+0000",
            "author": "Uwe Schindler",
            "content": "Do you use the latest patch? The old one may not yet have that WAR file parts removed. The old smoker worked on cygwin, but you never know  ",
            "id": "comment-14644422"
        },
        {
            "date": "2015-07-28T14:23:42+0000",
            "author": "Uwe Schindler",
            "content": "Otherwise do you have an opinion about the extra inner folder solr-webapp/webapp? We should remove the inner webapp folder, I just did not do this, because I have no idea which scripts are affected by this. I wanted to look into that later or in a separate commit. I just wanted to get rid of the WAR completely. ",
            "id": "comment-14644423"
        },
        {
            "date": "2015-07-28T14:35:53+0000",
            "author": "Timothy Potter",
            "content": "yes, using latest patch you posted at 14:52 ...\n\nWe might as well address the extra folder now too ... the scripts affected are minimal (smoketester, bin/solr, bin/solr.cmd, zkcli.sh/cmd, and a few in the cloud-dev). ",
            "id": "comment-14644452"
        },
        {
            "date": "2015-07-28T15:01:28+0000",
            "author": "Shawn Heisey",
            "content": "Otherwise do you have an opinion about the extra inner folder solr-webapp/webapp?\n\nI'm not sure we should move the artifacts out of the inner webapp directory, at least not until the next major version.\n\nMy concern is not our own scripts.  We can change those easily enough.  The potential problem is homegrown scripts written by users.  If we move the extracted artifacts, even just one directory level, we risk problems with highly customized user setups.\n\nIs it enough to assume someone who builds their own scripts will be able to use a note in the \"upgrading from\" section of CHANGES.txt to figure out how to fix their setup when they upgrade?  It might be.  User confusion is always a worry for me, because Solr already has plenty to offer in that department.\n\nI can't imagine based on anything you've said that I would want to vote -1.  I offer my thoughts only for consideration.\n\nSemi-related: I need to find out what we've got for documentation on upgrading a Solr 5.x install to the next release.  I have some ideas about how I would do it, but I'd like to know what (if anything) we are saying officially. ",
            "id": "comment-14644493"
        },
        {
            "date": "2015-07-28T15:13:42+0000",
            "author": "Uwe Schindler",
            "content": "Smoke tester passes for me on Linux. There is an unrelated bug in smoker when it tries to execute post.jar (it does not setup PATH correctly as its does for the scripts), so it fails if you have no \"java\" in your path, or it executes the wrong Java (maybe older version). I will open separate issue, its really unrelated. It just costed me half an hour \n\nShawn: I have no strong opinion, we can leave it as it is. But custom scripts may already break because there is no WAR anymore. In previous versions, Jetty extracted the WAR to a temporary folder, so the scripts will for sure no longer work. ",
            "id": "comment-14644506"
        },
        {
            "date": "2015-07-28T15:19:11+0000",
            "author": "Shawn Heisey",
            "content": "But custom scripts may already break because there is no WAR anymore.\n\nVery true, and that is something that I had not considered.  I also have no strong opinion, and it sounds like this entire change is destined to lead to user confusion, so let's jump in all the way! ",
            "id": "comment-14644514"
        },
        {
            "date": "2015-07-28T16:02:19+0000",
            "author": "Uwe Schindler",
            "content": "I reverted the Smoker changes from the previous commit and removed the WAR stuff completely. This is now much cleaner, ",
            "id": "comment-14644575"
        },
        {
            "date": "2015-07-28T16:34:45+0000",
            "author": "Uwe Schindler",
            "content": "I would like to commit the current patch and then later fix the extra folder. Timothy could also handle that separately. This patch is just to fix the useless WAR file create and reverts the META-INF checks.\n\nIs it OK to commit? ",
            "id": "comment-14644614"
        },
        {
            "date": "2015-07-28T16:49:07+0000",
            "author": "Timothy Potter",
            "content": "+1 to commit as is ",
            "id": "comment-14644633"
        },
        {
            "date": "2015-07-28T19:04:23+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1693143 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1693143 ]\n\nSOLR-7227: Don't create the WAR file at all ",
            "id": "comment-14644865"
        },
        {
            "date": "2015-07-28T19:15:38+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1693144 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1693144 ]\n\nSOLR-7227: Be sure to not put servlet.jar into webapp ",
            "id": "comment-14644874"
        },
        {
            "date": "2015-07-28T19:23:47+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1693145 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1693145 ]\n\nMerged revision(s) 1693143,1693144 from lucene/dev/trunk:\nSOLR-7227: Don't create the WAR file at all ",
            "id": "comment-14644887"
        },
        {
            "date": "2015-07-28T19:24:34+0000",
            "author": "Uwe Schindler",
            "content": "OK, committed. The remaining stuff is now the extra folder. Smoke tester should be fine. ",
            "id": "comment-14644891"
        },
        {
            "date": "2015-10-01T14:03:39+0000",
            "author": "Timothy Potter",
            "content": "This was fixed in 5.3, just didn't get closed out. Thanks for the help on this Uwe ",
            "id": "comment-14939864"
        }
    ]
}