{
    "id": "SOLR-8629",
    "title": "When a prospective leader attempts to sync with it's shard, we should only fail the sync due to peer sync, not necessarily other exceptions.",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Otherwise, one screwed up replica can prevent a leader even if there are 100 other good replicas.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-01T21:11:53+0000",
            "author": "Mark Miller",
            "content": "This may be tricky, but I'm not entirely happy with the current situation. ",
            "id": "comment-15127044"
        },
        {
            "date": "2016-02-27T17:23:51+0000",
            "author": "Mark Miller",
            "content": "I think SOLR-8753 will allow us to be a little bit more conservative in some of these issues. Right now, even though elections were originally intended to retry forever, currently each replica generally only gets one shot at trying to be the leader. ",
            "id": "comment-15170664"
        },
        {
            "date": "2016-02-27T18:42:33+0000",
            "author": "Mark Miller",
            "content": "This may be as simple as adding code 500 as a success on peersync like we currently do on connect exceptions. My worry is the same as those exceptions though - it may be a very temporary situation, and the affected node may be the best leader candidate.\n\nThat is why I've been thinking about SOLR-8753. It would be nice to allow a couple of retries of the possible leaders over time in these situations. I think that may be tricky to do nicely with the current code though. ",
            "id": "comment-15170697"
        },
        {
            "date": "2016-09-07T09:17:55+0000",
            "author": "Stephan Lagraulet",
            "content": "Hi Mark Miller did you have the chance to work on this issue? ",
            "id": "comment-15470109"
        }
    ]
}