{
    "id": "SOLR-12940",
    "title": "Optimize and expunge deletes should execute only on the leader instead of all replicas of the collection",
    "details": {
        "type": "Improvement",
        "status": "Open",
        "labels": "",
        "fix_versions": [
            "7.6",
            "master (8.0)"
        ],
        "components": [
            "SolrCloud"
        ],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None"
    },
    "description": "Optimize and expunge deletes are broadcasted to all replicas of the collection (even to replicas of inactive shards!) but they don't need to be. We can optimize by only executing such commands on the leader and have the replicas pull the index over the network when ready.\n\nSynchronizing replication recovery to happen after optimize completes was trickier in the past when all we had was HTTP requests but now we have the terms mechanism which goes via ZK and can be relied on.\n\nThis gives us a nice way to index/update fully and then call optimize/expunge deletes only on the leader while replicas continue to serve query traffic without disruption. This use-case will also need the ability to route queries only to replicas and not to the leader.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16669027",
            "content": "I want to raise one concern here. This will essentially do a \"full sync\" of the index on the leader on all replicas in a collection at once, correct? That can move massive amounts of data around the network, and I've seen cascading failures result from that, endless recovery loops and the like.\n\nIs there a way to throttle this?\n\nI happen to be working on SOLR-12259 currently, which will add another operation to the mix so I'll link that in. The thrust of that JIRA is to rewrite all the segments to \"do something\", one case is to add docValues without re-indexing. Seems to me that the mechanism in this JIRA is applicable to SOLR-12259 too. ",
            "author": "Erick Erickson",
            "date": "2018-10-30T16:45:48+0000"
        },
        {
            "id": "comment-16669028",
            "content": "We should add the operation at 12259 to the operations that should be performed on the leader only then replicated. ",
            "author": "Erick Erickson",
            "date": "2018-10-30T16:46:27+0000"
        }
    ]
}