{
    "id": "SOLR-9192",
    "title": "why not set batchSize = -1 in JdbcDataSource for DIH",
    "details": {
        "components": [],
        "type": "Wish",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "the default value of  batchSize is 500(FETCH_SIZE) ; actually,set batchSize = -1  could avoid OOM ?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-07T15:38:04+0000",
            "author": "Erick Erickson",
            "content": "Please add more details here. IIRC, setting batch size for some jdbc drivers is the right thing to do, but for others it isn't. I suspect you're using MySQL?\n\nAnd please in future raise this kind of question on the user's list before raising a JIRA. We try to raise JIRAs to track code changes once it's agreed that something needs to change in Solr. ",
            "id": "comment-15318699"
        },
        {
            "date": "2016-06-07T21:05:47+0000",
            "author": "Shawn Heisey",
            "content": "Please add more details here. IIRC, setting batch size for some jdbc drivers is the right thing to do, but for others it isn't. I suspect you're using MySQL?\n\nIn my experience with DIH, Erick is completely right.  I have personal experience with DIH and MySQL, and I've poked a few times at setups using other database software.\n\nA negative value for batchSize causes DIH to use setFetchSize(Integer.MIN_VALUE) in the JDBC code.  For the MySQL driver, this means that results will be streamed instead of loading them into memory ... but there are other JDBC drivers that do NOT function this way.  A small-ish positive value for batchSize (which will be used directly in setFetchSize) is correct for most drivers.  Setting the default to -1 would be completely the wrong thing to do for most common drivers other than MySQL. ",
            "id": "comment-15319430"
        },
        {
            "date": "2016-06-08T01:22:00+0000",
            "author": "Erick Erickson",
            "content": "This would cause problems with some JDBC drivers, best not to change behavior to no general benefit. ",
            "id": "comment-15319827"
        }
    ]
}