{
    "id": "SOLR-4953",
    "title": "Config XML parsing should fail hard if an xpath is expect to match at most one node/string/int/boolean and multiple values are found",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "while reviewing some code i think i noticed that if there are multiple <indexConfig/> blocks in solrconfig.xml, one just \"wins\" and hte rest are ignored.\n\nthis should be a hard failure situation, and we should have a \"TestBadConfig\" method to verify it.\n\n—\n\nbroadened goal of issue to fail if configuration contains multiple nodes/values for any option where only one value is expected.",
    "attachments": {
        "SOLR-4953.patch": "https://issues.apache.org/jira/secure/attachment/12594633/SOLR-4953.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13723021",
            "date": "2013-07-29T21:48:13+0000",
            "content": "it ocured to me last night that instead of just dealing explicitly with indexConfig here, we could probably help improve the validation of a lot of config parsing with a relatively simple change to Config.getNode: throw an error in any case where Solr is looking for a single Node/String/Int/Boolean and multiple values are found instead.\n\nI wasn't sure how badly this might break things, but i've been testing it out today and except for a few cases where the text() xpath expression was getting abused (instead of a simple node check), it seems fairly straight forward.\n\nSo here's a patch that broadens the scope of the issue to fail hard if any \"single valued\" config option is found more then once in the config. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13726695",
            "date": "2013-08-01T18:18:11+0000",
            "content": "Commit 1509359 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1509359 ]\n\nSOLR-4953: Make XML Configuration parsing fail if an xpath matches multiple nodes when only a single value is expected. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13726782",
            "date": "2013-08-01T19:38:23+0000",
            "content": "Commit 1509390 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1509390 ]\n\nSOLR-4953: Make XML Configuration parsing fail if an xpath matches multiple nodes when only a single value is expected. (merge r1509359) "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787083",
            "date": "2013-10-05T10:19:07+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}