{
    "id": "SOLR-11645",
    "title": "When there are duplicate java commandline arguments, the Solr UI dashboard doesn't show Args at all",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.2",
            "master (8.0)"
        ],
        "affect_versions": "7.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "A user couldn't get the \"Args\" to display in the admin UI.\n\nUltimately it was determined that they had duplicate arguments on their commandline, and this was resulting in an error in the browser:\n\n\nError: [ngRepeat:dupes] Duplicates in a repeater are not allowed. Use\n'track by' expression to specify unique keys. Repeater: arg in\ncommandLineArgs, Duplicate key: string:-XX:+UseGCLogFileRotation, Duplicate\nvalue: -XX:+UseGCLogFileRotation",
    "attachments": {
        "SOLR-11645.patch": "https://issues.apache.org/jira/secure/attachment/12897803/SOLR-11645.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-11-15T16:07:16+0000",
            "content": "Problem duplicated on Windows by adding this line to solr.in.cmd:\n\n\nset SOLR_OPTS=%SOLR_OPTS% -Xss256k\n\n ",
            "author": "Shawn Heisey",
            "id": "comment-16253701"
        },
        {
            "date": "2017-11-15T16:23:09+0000",
            "content": "I have tried to add \"track by $index\" to the angular code in the partials/index.html file, but I must be missing something, because it looks like that change is not actually being picked up by the admin UI after a Solr restart.  Is the static content cached somewhere? ",
            "author": "Shawn Heisey",
            "id": "comment-16253730"
        },
        {
            "date": "2017-11-15T16:25:59+0000",
            "content": "Eureka!  Holding down shift while clicking the reload button got that change to work.  It was the browser that was caching the old version. ",
            "author": "Shawn Heisey",
            "id": "comment-16253734"
        },
        {
            "date": "2017-11-15T16:27:57+0000",
            "content": "Tangent:  I noticed in the javascript code that the commandline arguments are sorted before they are displayed.  Is that something we really want to do?  Shouldn't they appear in actual order?  I did check /admin/info/system, and it looks like that order is correct. ",
            "author": "Shawn Heisey",
            "id": "comment-16253740"
        },
        {
            "date": "2017-11-15T17:17:11+0000",
            "content": "Patch (without CHANGES.txt) that appears to fix the issue, after dealing with browser caching.\n\nWould appreciate a review from those who really know the UI code, and would also like to know if we can avoid sorting the commandline arguments, so we can show them in the order they actually appear on the commandline. ",
            "author": "Shawn Heisey",
            "id": "comment-16253821"
        },
        {
            "date": "2017-11-15T17:37:21+0000",
            "content": "For a binary download/install, the change in the patch can be applied to the server/solr-webapp/webapp/partials/index.html file.  You will need to deal with the browser cache to actually see a change.  The easiest way to do that is shift-reload.  I suspect that a Solr restart is not required with the change, but you might want to restart Solr anyway. ",
            "author": "Shawn Heisey",
            "id": "comment-16253851"
        },
        {
            "date": "2017-11-15T19:19:42+0000",
            "content": "Updated patch that removes the sort from the argument list.  It looks like it does come through in the correct order. ",
            "author": "Shawn Heisey",
            "id": "comment-16253991"
        },
        {
            "date": "2017-11-15T20:00:23+0000",
            "content": "Shawn, i don't have a current checkout / environment - skimming over your patch as well as https://docs.angularjs.org/error/ngRepeat/dupes makes it look just fine!\n\nI noticed in the javascript code that the command line arguments are sorted before they are displayed. Is that something we really want to do? Shouldn't they appear in actual order?\n\nI can't say for sure when this landed - i can see both sides of it: having it sorted makes it easier to recognize a duplicate (which as far as i know is only a technically, java doesn't care about does it?) while having it in the actual order probably helps when people are trying to group them in a sorting way (relevant things together, or global/local/tenant-based properties).\n\ninclude this change in this ticket and we'll see where it goes - i'd probably bet that most people won't even notice it. ",
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-16254072"
        },
        {
            "date": "2017-11-15T20:10:22+0000",
            "content": "Personally I always prefer alphabetical ordering. Otherwise it's far too easy to miss what I'm looking for. Even if I search I often stop at the first hit and never notice something further down.\n\nFWIW, but I don't have a strong preference here.\n ",
            "author": "Erick Erickson",
            "id": "comment-16254089"
        },
        {
            "date": "2017-11-15T20:40:09+0000",
            "content": "Personally I always prefer alphabetical ordering.\n\nFor many things, I tend to agree, but I think in this case, we probably want them unsorted.\n\nIf a Java commandline has competing arguments, for instance both \"-Xmx512M\" and \"-Xmx4G\" ... is Java going to behave differently when one of them is listed first versus how it behaves when the other is listed first?  I suspect that the behavior IS different, but if I'm wrong about that, then I will agree that sorting is the best option.  If Java does behave differently when the order is changed, then I think we want them shown in actual order.\n\nI wonder if it might be possible to have a sort button in the UI, so people can do a one-time sort of the list, which would aid in learning whether or not an option is present without reading the entire list.  If an option like that is implemented, I think that a page refresh should go back to an unsorted list. ",
            "author": "Shawn Heisey",
            "id": "comment-16254141"
        },
        {
            "date": "2017-11-15T20:54:59+0000",
            "content": "That's a valid point, I can argue both ways I guess.\n\n1> sorting them makes it more likely that I'll even notice I have them in twice\n\n2> presenting them in the order they're defined will tell me what's actually going on.\n\neither way is wrong \n\nLike I said, I don't have a strong preference here, just sayin'.... ",
            "author": "Erick Erickson",
            "id": "comment-16254162"
        },
        {
            "date": "2017-11-15T20:58:16+0000",
            "content": "I can also see both sides, and I agree that either way is wrong to someone.\n\nSo how about we ignore the question of sorting in this issue, and open another one?  In that issue, we can default to unsorted and implement a button that will temporarily sort the list. ",
            "author": "Shawn Heisey",
            "id": "comment-16254172"
        },
        {
            "date": "2017-11-15T21:05:21+0000",
            "content": "And while I'm thinking about this:  The \"Args\" section of the admin UI doesn't actually list all of the commandline arguments.  Everything starting with \"-jar start.jar\" is omitted ... and everything after that (which is \"--module=http\" on the server I'm looking at) is passed to Jetty, not handled by Java.  It occurs to me that having those bits of information on the dashboard could be useful. ",
            "author": "Shawn Heisey",
            "id": "comment-16254180"
        },
        {
            "date": "2017-11-16T09:42:33+0000",
            "content": "I have created SOLR-11649 for further improvements, and will not attempt to address sorting in this issue, just duplicate arguments. ",
            "author": "Shawn Heisey",
            "id": "comment-16255020"
        },
        {
            "date": "2017-11-18T15:31:49+0000",
            "content": "Updated patch.  Only addresses the problem with duplicate args.  Includes CHANGES.txt addition. ",
            "author": "Shawn Heisey",
            "id": "comment-16258111"
        },
        {
            "date": "2017-11-18T15:42:56+0000",
            "content": "Commit 0dadf2c2a83abfe23740d5b5560e9852415877ef in lucene-solr's branch refs/heads/master from elyograg\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0dadf2c ]\n\nSOLR-11645: Fix problem with no Args display in admin UI. ",
            "author": "ASF subversion and git services",
            "id": "comment-16258115"
        },
        {
            "date": "2017-11-18T15:48:56+0000",
            "content": "Commit 8257ff53ef81f7441032b6183e4f80a3cc6fc0ca in lucene-solr's branch refs/heads/branch_7x from elyograg\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=8257ff5 ]\n\nSOLR-11645: Fix problem with no Args display in admin UI. ",
            "author": "ASF subversion and git services",
            "id": "comment-16258116"
        }
    ]
}