{
    "id": "SOLR-11412",
    "title": "Documentation changes for SOLR-11003: Bi-directional CDCR support",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "CDCR",
            "documentation"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.2",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Since SOLR-11003: Bi-directional CDCR scenario support, is reaching its conclusion. The relevant changes in documentation needs to be done.",
    "attachments": {
        "SOLR-11412.patch": "https://issues.apache.org/jira/secure/attachment/12889410/SOLR-11412.patch",
        "SOLR-11412-split.patch": "https://issues.apache.org/jira/secure/attachment/12898876/SOLR-11412-split.patch",
        "CDCR_bidir.png": "https://issues.apache.org/jira/secure/attachment/12898296/CDCR_bidir.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-28T02:56:51+0000",
            "content": "First draft uploaded.\n\nThree important bits left are:\n\n1. CDCR architecture needs to be updated or a new one needs to be added.\n2. The description below the architecture needs or needs not to be updated ??\n3. The Initial Startup part: it is specifically written for uni-directional scenario, not sure whether a section for bi-directional scenario is required or not.\n\nThe buffer element portion is somewhat confusing too.\n\nIn the changes, I made sure user doesn't confuse much. Though a thorough review is must. ",
            "author": "Amrit Sarkar",
            "id": "comment-16183595"
        },
        {
            "date": "2017-09-28T03:00:53+0000",
            "content": "The most important: forget to mention:\n\nWhere to specify or which places repeatedly that one must and must not index in both cluster simultaneously. ",
            "author": "Amrit Sarkar",
            "id": "comment-16183596"
        },
        {
            "date": "2017-09-29T02:00:46+0000",
            "content": "Patch updated:\n\n1. Cdcr bidirectional architecture png and description: DONE\n2. one must and must not index in both cluster simultaneously.\nIncluded in initial introduction and whenever deem necessary.  ",
            "author": "Amrit Sarkar",
            "id": "comment-16185252"
        },
        {
            "date": "2017-09-29T02:03:11+0000",
            "content": "The CDCR page is getting larger and larger. If we can break the CDCR components in different pages, I guess that will be really helpful. Too much information in one page. ",
            "author": "Amrit Sarkar",
            "id": "comment-16185254"
        },
        {
            "date": "2017-11-17T22:43:34+0000",
            "content": "Fixed the patch and added Erick's SOLR-11635 to bi-dir CDCR configurations. Also updated Cdcr-bidir.png.\n\nVarun Thacker this is ready to go, and awaiting your review and feedback. ",
            "author": "Amrit Sarkar",
            "id": "comment-16257702"
        },
        {
            "date": "2017-11-21T21:59:02+0000",
            "content": "I'm taking a review of the new docs, and looking at splitting the page up at the same time. Splitting CDCR API into its own page is obvious, but thinking about how to split the rest, I came up with this possible structure:\n\n\n\tcross-data-center-replication.adoc: parent page with \"What is CDCR?\" and \"CDCR Glossary\" sections, and links to other pages (would live in same place under SolrCloud top-level section)\n\t\n\t\tcdcr-architecture.adoc: new page with the current \"CDCR Architecture\" and \"Major Components of CDCR\" sections\n\t\tcdcr-config.adoc: new page with current \"CDCR Configuration\", \"Initial Startup\", and \"ZooKeeper Settings\" sections\n\t\tcdcr-operations.adoc: new page with current \"Monitoring\" and \"Upgrading and Patching Production\" sections\n\t\tcdcr-api.adoc: new page with current \"CDCR API\" section\n\t\n\t\n\n\n\nVarun Thacker, Amrit Sarkar, or Erick Erickson - any thoughts? ",
            "author": "Cassandra Targett",
            "id": "comment-16261563"
        },
        {
            "date": "2017-11-22T13:01:21+0000",
            "content": "+1. It is lot of scrolling up and down right now. Happy with the 4 seb-sections too. ",
            "author": "Amrit Sarkar",
            "id": "comment-16262486"
        },
        {
            "date": "2017-11-22T15:18:16+0000",
            "content": "Here's a patch that has Amrit's edits + splitting the CDCR page into multiple child pages.\n\nThere's a bit more to do (mostly links between pages), so it's not ready to commit - just thought I'd share in case anyone wanted to take a look at it. ",
            "author": "Cassandra Targett",
            "id": "comment-16262778"
        },
        {
            "date": "2017-11-28T20:28:12+0000",
            "content": "I've attached an updated patch (SOLR-11412.patch) that has the CDCR page split into 4 new pages (for a total of 5 CDCR-related pages) along the lines I outlined the other day.\n\nI took the liberty of updating the terminology a bit - there were frequent instances of \"uni-directional scenario\" and \"bi-directional scenario\", which made the word \"scenario\" seem over- and improperly used. I changed many of these to \"updates\" (with other sentence context changes to make it work). If this is also misleading, please let me know so we can fix before I commit.\n\nI suspect the \"CDCR Glossary\" is, at this point, a bit redundant and out of place. I'd like to remove it, but for now left a comment that we should consider doing so in the future.\n\nOtherwise, I think this is good to commit if others agree with the patch as it is. ",
            "author": "Cassandra Targett",
            "id": "comment-16269411"
        },
        {
            "date": "2017-12-01T22:19:22+0000",
            "content": "Amrit Sarkar, Varun Thacker - Do either of you have any comments about the latest patch? ",
            "author": "Cassandra Targett",
            "id": "comment-16275082"
        },
        {
            "date": "2017-12-01T22:33:10+0000",
            "content": "Hi Cassandra,\n\nI am going through the patch right now ",
            "author": "Varun Thacker",
            "id": "comment-16275103"
        },
        {
            "date": "2017-12-01T23:40:09+0000",
            "content": "cdcr-api.adoc\n\nI think we can remove \"Enable Buffer Response\", \"Disable Buffer Response\", \"CDCR Start Response\", \"CDCR Stop Response\"\nThe one line explaination doesn't add any value in my opinion. \nFor \"OPS Response\" maybe all we should say is : \"Provides the average number of operations as a sum and broken down by adds/deletes\"\nFor \"ERRORS Response\" we should say \"Provides the number of consecutive errors encountered by the replicator thread, the number of bad requests or internal errors since the start of the replication process, and a list of the last errors encountered ordered by timestamp.\"  The first part of the description seems unecessary to me.\n\nAlso both OPS and ERROR's should really be exposed via the metrics API. I'll file a separate Jira for this.\n\nCDCR Architecture Page:\n\n\"The data changes can be replicated in near real-time (with a small delay) or could be scheduled to be sent at longer intervals to the Target data center\" : \"The data changes can be replicated at a configurable amount of time\"\n\nShould Source and Target should start with a capital letter?\n\n\"Since this is a full copy of the entire index, network bandwidth should be considered.\" : What value does this line add to the user? \n\n\"CDCR can \"bootstrap\" the collection to the Target data center. Since this is a full copy of the entire index, network bandwidth should be considered. Of course both Source and Target collections may be empty to start.\" - Remove this part?  \nThe fifth paragraph ( \"Replication supports both...\" ) basically explains this in a better fashion\n\n\"The directional nature of the implementation implies a \"push\" model from the Source collection to the Target collection. Therefore, the Source configuration must be able to \"see\" the ZooKeeper ensemble in the Target cluster. The ZooKeeper ensemble is provided configured in the Source’s solrconfig.xml file.\"\n\nI feel we can remove this entire para and just add a line to the 3rd para where we mention it's pushed based. Here's a stab at an updated 3rd para\n\n\"Each shard leader in the Source data center is responsible for replicating its updates to the corresponding leader in the Target data center. This is a push model and the source data center must be able to connect to the target ZooKeeper. Shard leaders in the Target data center will replicate the changes to their own replicas as normal SolrCloud updates.\"\n\n\"CDCR can be configured to replicate from one collection to a second collection within the same cluster. That is a specialized scenario not covered in this Guide.\" : Does this point have any value? I'm +0 in removing it \n\nFrom \"Figure 1. Uni-Directional Data Flow\" :  \"Since leaders may ... Firewalls, ACL rules, etc., must be configured to allow this.\" I feel like we have the ACL part could be mentioned in the architecture overview and removed from here.\n\n\"With bi-directional updates, indexing and querying \" : I guess the only hard requirement is indexing. Querying doesn't have any impact in this design i.e it's the same as uni directional\n\n\"Updates sent from Source data center to Target is not propagated back to Source when bi-directional updates are configured\" : This is what point 7 talks about so maybe remove this\n\n\nCDCR Configuration : \n\n \"<!-- optional -->\" : We recommend everyone to disable buffering. Let's remove this comment\n\n\n From the \"Initial Startup\" section \n\n \"Sync the index directories from the Source collection to Target collection across to the corresponding shard nodes. rsync works well for this\" till the end of the section : Seems like a lot of info or notes which are already known?\n\n \"ZooKeeper Settings\"\n\n800 is a typo? We say we want to set 200 but use \n\n\"Cross Data Center Replication Operations\" : Should talk about how to update a schema. I'll add some docs after this commit ",
            "author": "Varun Thacker",
            "id": "comment-16275194"
        },
        {
            "date": "2017-12-01T23:41:41+0000",
            "content": "In general I think we could do with some more cleaning of the docs. No user is going to read so much of info before setting up CDCR. \n\n+1 to commit this with or without the changes I suggested. If it's committed without my changes then I can create a patch with everything that I felt can be folded it to make reviewing easier ? ",
            "author": "Varun Thacker",
            "id": "comment-16275196"
        },
        {
            "date": "2017-12-04T19:40:09+0000",
            "content": "\n\tcdcr-api.adoc\n\t\n\t\tI made all the recommended changes you suggested here.\n\t\n\t\n\n\n\n\n\tCDCR Architecture Page:\n\"The data changes can be replicated in near real-time (with a small delay) or could be scheduled to be sent at longer intervals to the Target data center\" : \"The data changes can be replicated at a configurable amount of time\" Should Source and Target should start with a capital letter?\nIt was like that before so isn't really related to the new content. I would normally remove the capitalization, but Erick wrote/contributed the page, and it's not so egregious that I thought it had to be changed. I think an argument can be made that in this case, the capitalization works as shorthand for the two clusters.\n\n\n\n\"Since this is a full copy of the entire index, network bandwidth should be considered.\" : What value does this line add to the user?\nThat he/she should be aware that an entire index is going over the wire and they shouldn't expect it to be done in nanoseconds.\n\nThe rest of your comments for this page are judgement calls, again mostly not-related to the patch. If you want to make the changes at a later time, go ahead, I can't figure out what does & doesn't add value at the same level that you can.\n\n\n\tCDCR Configuration :\n\"<!-- optional -->\" : We recommend everyone to disable buffering. Let's remove this comment\nI did this.\n\n\n\n\"Sync the index directories from the Source collection to Target collection across to the corresponding shard nodes. rsync works well for this\" till the end of the section : Seems like a lot of info or notes which are already known?\n\nKnown by who? \n\n\"ZooKeeper Settings\" 800 is a typo? We say we want to set 200 but use\n\nIt was already there, I'll assume you know it should be set to 800 in the comment. ",
            "author": "Cassandra Targett",
            "id": "comment-16277355"
        },
        {
            "date": "2017-12-04T20:29:49+0000",
            "content": "Commit 52cefbe742095daf8a31b8bc34ade5c809226c7d in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=52cefbe ]\n\nSOLR-11412: Add docs for bi-directional CDCR; split CDCR pages into multiple child pages ",
            "author": "ASF subversion and git services",
            "id": "comment-16277443"
        },
        {
            "date": "2017-12-04T20:30:17+0000",
            "content": "Commit 89b02c430a6a42d4687afce647b030580fc46af6 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=89b02c4 ]\n\nSOLR-11412: Add docs for bi-directional CDCR; split CDCR pages into multiple child pages ",
            "author": "ASF subversion and git services",
            "id": "comment-16277444"
        },
        {
            "date": "2017-12-05T13:24:28+0000",
            "content": "Thank you Cassandra Targett for curating and commiting. ",
            "author": "Amrit Sarkar",
            "id": "comment-16278528"
        }
    ]
}