{
    "id": "SOLR-12367",
    "title": "When adding a model referencing a non-existent feature the error message is very ambiguous",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "contrib - LTR"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.3.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "When adding a model that references a non-existent feature a very ambiguous error message is thrown, something like \"Model type does not exist org.apache.solr.ltr.model.LinearModel\".\n\n \n\nTo reproduce, do not add any features and just add a model, for example by doing this:\n\n \n\ncurl -XPUT 'http://localhost:8983/solr/gettingstarted/schema/model-store' --data-binary '\n\n{\n\n  \"class\": \"org.apache.solr.ltr.model.LinearModel\",\n\n  \"name\": \"myModel\",\n\n  \"features\": [ {\"name\": \"whatever\" }],\n\n  \"params\": {\"weights\": {\"whatever\": 1.0}}\n\n}' -H 'Content-type:application/json'\n\n \n\nThe resulting error message \"Model type does not exist org.apache.solr.ltr.model.LinearModel\" is extremely misleading and cost me a while to figure out the actual cause.\n\n \n\nA more suitable error message should probably indicate the name of the missing feature that the model is trying to reference.",
    "attachments": {
        "SOLR-12367.patch": "https://issues.apache.org/jira/secure/attachment/12941669/SOLR-12367.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-17T07:09:06+0000",
            "content": "I just noticed the same also happens when setting the weight of an (existing) feature to an integer instead of a float, ie.\n\n \n\ncurl -XPUT 'http://localhost:8983/solr/gettingstarted/schema/model-store' --data-binary '\n\n{\n\n  \"class\": \"org.apache.solr.ltr.model.LinearModel\",\n\n  \"name\": \"myModel\",\n\n  \"features\": [ {\"name\": \"whatever\" }],\n\n  \"params\": {\"weights\": {\"whatever\": 1}}\n\n}' -H 'Content-type:application/json'\n\n \n\nwill also throw \"Model type does not exist org.apache.solr.ltr.model.LinearModel\". If you change the weight to 1.0 it will work fine (if the feature \"whatever\" exists). ",
            "author": "Georg Sorst",
            "id": "comment-16478639"
        },
        {
            "date": "2018-09-28T09:52:35+0000",
            "content": "I have attached a patch to address the issue in the description. The message will now say \"org.apache.solr.ltr.model.ModelException: Features cannot be null; perhaps check for missing features\". To reproduce, follow the same procedure as described in the description.\n\nFor now, I have not dealt with the ClassCastException that shows up in the comment (i.e. upload features, then execute above) for casting a Long to a Double, however should this be deemed necessary, I can add that to the patch, or create another issue for it.\n\nThis should also close 12676, and (maybe?) 12676.\n\nAny comments would be appreciated. ",
            "author": "Kamuela Lau",
            "id": "comment-16631637"
        },
        {
            "date": "2018-10-09T05:13:43+0000",
            "content": "I have attached a new patch, which includes some minor refractoring from the old patch, as well as a \"fix\" for the issue noted in the comments; there is now a different error message for the case when an int/long is entered in weights instead of a float/double. ",
            "author": "Kamuela Lau",
            "id": "comment-16642809"
        },
        {
            "date": "2018-10-09T05:47:34+0000",
            "content": "The new patch moved the \"weights\" params check to LinearModel, instead of LTRScoringModel, as the weights param only exists for LinearModel, and is modified so tests will pass ",
            "author": "Kamuela Lau",
            "id": "comment-16642833"
        },
        {
            "date": "2018-10-11T16:24:22+0000",
            "content": "A similar ClassCastException may show up for other LTRScoringModels such as NeuralNetworkModel (in particular, thinking of matrix/bias values for layers). The ambiguous message for CCE will only change for LinearModel as of right now. ",
            "author": "Kamuela Lau",
            "id": "comment-16646719"
        }
    ]
}