{
    "id": "SOLR-6980",
    "title": "Collection deletion, creation and shared configsets",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "If a configset is not being shared and a collection is deleted, I think we should also delete the configset, or at least the copy of it for that collection. \n\nYou can see the ill effects of this by doing:\n\n\n\tcreate a data-driven schema collection\n\tindex some content to it, thus materializing an actual schema\n\tdelete the collection\n\tcreate a new collection w/ the same name\n\tobserve that the new collection has the old materialized schema",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-10T04:27:37+0000",
            "author": "Erick Erickson",
            "content": "I think these two are a bit related at least.\n\nI'm not sure I agree with this totally, I think there are two cases:\n\n1> we upload a configset as part of collection creation, but creation fails. Then it seems like we should surely remove the configset.\n\n2> we just delete a collection and no other collection references it. In this case I think it would be bad to delete the configset, even if it's not associated with any other collection. Think of a user who deletes a collection as part of their experimentation. Or to delete all the docs and start over. Or is just testing the collection create/delete commands. \n\nSo barring a collection creation error, I think it's an invalid assumption that just because a collection is deleted and no other collection references it, it's not wanted. ",
            "id": "comment-15050013"
        },
        {
            "date": "2018-08-24T15:56:40+0000",
            "author": "Erick Erickson",
            "content": "Should we close this \"won't fix\"? We have better tools now. ",
            "id": "comment-16591844"
        }
    ]
}