{
    "id": "SOLR-3921",
    "title": "CoreAdminHandler fails when dataDir doesn't exist on local filesystem",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "CoreAdminHandler.getIndexSize calls FileUtils.sizeOfDirectory which throws unhandled IllegalArgumentException when dataDir doesn't exist on the local filesystem. As a result the webapp gui \"hangs\" (never displays any result).",
    "attachments": {
        "SOLR-3921.patch": "https://issues.apache.org/jira/secure/attachment/12548277/SOLR-3921.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Patrick Hunt",
            "id": "comment-13471759",
            "date": "2012-10-08T18:51:28+0000",
            "content": "This patch works around the problem by returning 0 when the directory doesn't exist. Note that ReplicationHandler has the same issue.\n\nSeems that the proper way to handle this would be to move the size calculation into SolrCore class and use Directory instead of local filesystem. I'm not sure what that entails, this patch is a workaround where proper fix would require a more involved solution. Should I enter a jira for that? (ie move the calculation into solrcore and use Directory instead of local filesystem).\n\nI looked at adding unit tests for this however it wasn't clear how I might do that. I don't see that this is currently tested, and there didn't seem to be a way to use EasyMock for this. If there are any suggestions on how to add unit tests for this please comment. (if you feel such is necessary)\n\nI manually verified by using a RAMDirectoryFactory and then deleting the data directory after the server was started (the directory would be re-created on solr server startup). The UI functions properly with this patch - although the reported size is incorrect (zero). The Directory based approach I mentioned earlier would be necessary to address this. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13471827",
            "date": "2012-10-08T20:12:35+0000",
            "content": "dup of SOLR-3665?\n\nNote that miller is working in SOLR-3911 to make solr more agnostic to the directory impl – which would mean getting this size info from the DirectoryFactory.  It's probably better to focus on getting the correct info from there then adding special cases for returning 0/null here. "
        },
        {
            "author": "Patrick Hunt",
            "id": "comment-13472514",
            "date": "2012-10-09T16:24:04+0000",
            "content": "Hi Hoss Man, sorry about that, I missed SOLR-3665. Per my comment I wasn't really super happy with this fix, but at the same time didn't want to arrive empty handed. Agree with the getting correct info comment, if Mark wants to roll this into SOLR-3911 I'm good with that. I'd be happy to try providing a DirectoryFactory based fix if he doesn't. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13551457",
            "date": "2013-01-11T19:48:54+0000",
            "content": "fixed by SOLR-3911 "
        }
    ]
}