{
    "id": "SOLR-11547",
    "title": "CSVParser can not correctly read data",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "5.3.1",
        "resolution": "Not A Bug",
        "status": "Closed"
    },
    "description": "1、when  update index by csv :\nC825700400271B9BC8256CBB00263BA2,\"text\"testcsvformat,1232,sdfd .\n\n2、CSVParser can not correctly read data because the data include ' ,\" '.\n\ni think solr shoud deal  with this situation.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-25T13:16:20+0000",
            "content": "You should take this question to the solr-user mailing list, there isn't enough information in this report to determine it is a bug. https://lucene.apache.org/solr/community.html#mailing-lists-irc\n\nWhen you send your report to the mailing list, please be sure to include the command you are using to send the data to Solr - the CSV update handler has several parameters for this situation, so the first question people will have is if you are using them. If it is determined this is a bug, we can re-open this issue with the additional information you have gathered by that time. ",
            "author": "Cassandra Targett",
            "id": "comment-16218599"
        },
        {
            "date": "2017-10-27T01:32:12+0000",
            "content": "thanks, it is not  a bug. i should set the parameter \"encapsulator\" to anthor value  instead of using the default value “\"” ",
            "author": "chenmin",
            "id": "comment-16221562"
        },
        {
            "date": "2017-10-27T01:54:12+0000",
            "content": "Changing the encapsulator is one option.  I think you could also escape the quotes with a backslash so CSV will not treat them as special. ",
            "author": "Shawn Heisey",
            "id": "comment-16221578"
        },
        {
            "date": "2017-10-27T02:09:50+0000",
            "content": "You just need to tell Solr what format the CSV is in.\nhttps://lucene.apache.org/solr/guide/6_6/uploading-data-with-index-handlers.html#UploadingDatawithIndexHandlers-CSVFormattedIndexUpdates\n\nSee the description for \"escape\":\n\"The character used for escaping CSV separators or other reserved characters. If an escape is specified, the encapsulator is not used unless also explicitly specified since most formats use either encapsulation or escaping, not both\"\n\nSo just set escape to backslash and you should be good (that will disable encapsulation processing) ",
            "author": "Yonik Seeley",
            "id": "comment-16221588"
        },
        {
            "date": "2017-10-27T06:17:00+0000",
            "content": " thank you  all! \n In fact，  the amount of data is too large，but just one item need use escaping.\n i think it is expensive. ",
            "author": "chenmin",
            "id": "comment-16221777"
        },
        {
            "date": "2017-10-27T11:30:48+0000",
            "content": "the amount of data is too large，but just one item need use escaping. i think it is expensive.\n\nRight, you should not have to change your CSV data!  \nAs long as it's encoded in correctly in some consistent scheme, Solr should be able to read it. ",
            "author": "Yonik Seeley",
            "id": "comment-16222194"
        }
    ]
}