{
    "id": "SOLR-3",
    "title": "create test harness and port TestApp to junit",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "To both encourage good internal development, and to make it easy for plugin developers to write unit tests of their own code I think we need a harness that makes it easy to unit test updates and queries against Solr (without needing a servlet container)\n\nOnce we have this, i think we can/should also retire \"TestApp\" in favor of some JUnit tests (which would probably make more sense for other developers)\n\n\nIv'e already started on this, i thought i'd have something to commit tonight, but i got distracted ... filing this bug as a tracker for now.",
    "attachments": {
        "TestHarness.java": "https://issues.apache.org/jira/secure/attachment/12324084/TestHarness.java",
        "SOLR-3.zip": "https://issues.apache.org/jira/secure/attachment/12325103/SOLR-3.zip",
        "TestBasicFunctionality.java": "https://issues.apache.org/jira/secure/attachment/12324085/TestBasicFunctionality.java"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12370124",
            "date": "2006-03-13T15:37:52+0000",
            "content": "Here's what i've got so far, still a work in progress – but you can see the basic idea.\n\nI was trying to avoid putting anything junit specific in the TestHarness, but it definitely looks like having an abstract subclass of TestCase that provides some assert methods that can take in adds or requests/xpaths and validate directly would make hte tests easier to read.\n\nAny comments would be appreacited. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12370211",
            "date": "2006-03-14T01:22:11+0000",
            "content": "Looking good Hoss!\n\nThere are probably some opportunities to use Java5 stuff like varargs...\n  doc(\"id\",42,\"subject\",\"easy\")\n\nAlso what we really need is a way to dynamically add/create a schema, so one could add a new analysis filter,\nthen define a fieldtype & field that uses it and test it out, without modifying some global testing schema.  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12370218",
            "date": "2006-03-14T02:34:27+0000",
            "content": ">There are probably some opportunities to use Java5 stuff like varargs...\n>  doc(\"id\",42,\"subject\",\"easy\")\n\n...i'm doing that in validateAddDoc (which calls makeSimpleDoc) ... are there other methods you think it also makes sense for?\n\n> Also what we really need is a way to dynamically add/create a schema, so one could add\n> a new analysis filter,\n> then define a fieldtype & field that uses it and test it out, without modifying some global\n> testing schema.\n\ni was operating under the assumption that for stuff like that, the best thing to do would be to have multiple sets of solrconfig/schema files ... for Solr itself there would probably be one big generic file that most tests could use, but any test that wanted to try something exotic would check in a new one (in a directory with the same name as the test class) and speciy it when constructing hte harness.\n\nthe only flaw in that plan right now is that SolrCore only lets you specify a schema file path when you construct it, not a solrconfig, but i was going to tackle refactoring that once i had the basics up and running. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12373760",
            "date": "2006-04-09T14:47:00+0000",
            "content": "zip file contains a bunch of code and a patch file that modifies the build.xml and XML.java\n\nthe new code consists of:\n\n\tthe TestHarness from before (with a few additions) which should be usefull for interacting with a SolrCore independent of any specific testing framework\n\ta new AbstractSolrTestCase that is designed to make it easy to write JUnit tests in particular.\n\ta Sample test, and a short test of the basic Solr functions that demonstrate \"best practices\" of the AbstractSolrTestCase\n\ta ConvertedLegacyTest which is a progromatic translation of src/apps/SolrTest/newtest.txt (the converstion perl script is included in the zip for refrence, but i wasn't planning on commiting it.)\n\n\n\nthis represents 95% of what i think we need as far as a good testing framework moving forward: the last 5% being modifications to SolrConfig so that individual tests can use different solrconfig.xml files. Even without that, this code can be commited as is – tests will just have to share a solrconfig.xml for the time being, but they can use unique schema files.\n\n\n\nThe only hitch with all of this, is that i seem to have a filehandle leak somewhere.  Or at least i think i do ... running \"ant legacyTest\" works fine with an openfiles limit of 1024, but \"ant junit\" runs out of filehandles using the same limit (at 2048 the test runs fine).  The index itself only contains about 100 files when this happens so i'm not sure what's going on.\n\nIf anyone can help me spot the problem, i'd appreciate it.\n\nI'm going to take a look at it with some fresh eyes (and lsof) in the morning. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12373961",
            "date": "2006-04-11T12:58:14+0000",
            "content": "filehandle leak was resolved by closing requests, code was commited.\n\nleaving issue open for now, pending sub-task to deal with solrconfig.xml loading, and a decission about wether we want to completely remove SolrTest or not.  (either way, we should copy/move the config/schema used by the tests somewhere under the test directory, and change the working directory of the JUnit tests) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12375053",
            "date": "2006-04-19T13:16:37+0000",
            "content": "Everything I set out to do is done. Should this issue be resolved, or should SolrTest be removed from the repository?\n\nDoes it serve any useful purpose now that we have the JUnit tests? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12375416",
            "date": "2006-04-21T01:51:48+0000",
            "content": "Yes, I suppose SolrTest can be removed <nostalgic sniff...> "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12375493",
            "date": "2006-04-21T13:38:16+0000",
            "content": "Well, the one thing SolrTest could do that we don't have a replacement for that SolrTest was usefull for is load testing SolrCore – it might make sense to leave that part in, but rip out the guts and replace it with using the SolrTestHarness. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12454254",
            "date": "2006-11-29T08:33:11+0000",
            "content": "In the interest of reducing possible confusion (and since i haven't been motivated to refactor SolrTest to use SolrTestHarness in the last 6 months) i think maybe I should just svn remove solr/src/apps and the build.xml references to it before we have an official release.\n\nwe can always restore it in the future if there is a desire.\n\nobjections? "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12454257",
            "date": "2006-11-29T08:55:08+0000",
            "content": "No objection here, keeping the code clean is a Good Thing "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12454331",
            "date": "2006-11-29T14:48:52+0000",
            "content": "> maybe I should just svn remove solr/src/apps\n\n+1 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12454409",
            "date": "2006-11-29T19:00:28+0000",
            "content": "TestApp removed ... thus ends the longest \"In Progress\" Solr issue to date  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589361",
            "date": "2008-04-15T23:56:45+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}