{
    "id": "SOLR-5220",
    "title": "Marking server as zombie due to 4xx response is odd",
    "details": {
        "affect_versions": "4.4",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "In LBHttpSolrServer.request, a request is retried and server marked as zombie if the return code is 404, 403, 503, or 500, and the comment says \"we retry on 404 or 403 or 503 - you can see this on solr shutdown\". I think returning a 503 on a shutdown is reasonable, but not 4xx, which is supposed to be a client error. But even if this is can't be fixed systematically on the server-side, seems like on the client side we can retry on another server, but not mark the current server as dead, because most likely when the server returns a 403 (Forbidden) or 404 (Not Found), it's not because it's dead.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13934119",
            "date": "2014-03-13T21:32:44+0000",
            "content": "Yes, I agree that we should not retry on 403 or 404. This also causes problems for some tests which rely on getting the HTTP error code, see comments in SOLR-4470.\n\nI propose we turn off retry for 403 and 404. Speak out if there is good reason not to do this change. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13934186",
            "date": "2014-03-13T22:04:22+0000",
            "content": "It's a problem for updates, but I don't see why we don't retry for queries.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13934197",
            "date": "2014-03-13T22:10:24+0000",
            "content": "FYI  - the issue with shutdown returning 404 is nothing by design. Afaik, it has to do the container and core container shutdown.  Trying to address it is not a bad idea. \n\nSimply not retrying instead means stopping a server can make queries fail which is undesirable.  "
        },
        {
            "author": "Jessica Cheng Mallet",
            "id": "comment-13934218",
            "date": "2014-03-13T22:26:44+0000",
            "content": "+1 on addressing the status code returned during shutdown. It really should be 5xx (503). "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13934334",
            "date": "2014-03-14T00:11:20+0000",
            "content": "Can understand how a 404 could happen during a certain state of shutdown. But have we ever seen 403's during shutdown? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13934382",
            "date": "2014-03-14T00:59:02+0000",
            "content": "I don't really know myself on that one.  "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13934849",
            "date": "2014-03-14T10:36:09+0000",
            "content": "For 403/404, perhaps instead of zombiing and retrying right away it could be possible to issue some ping-style request to validate whether the server is up or shutting down? Under the assumption that a simple pingRequest would return 200 if the server is not shutting down and return a failure if it indeed is shutting down. Then based on the ping we decide whether to throw Exception or retrying. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971202",
            "date": "2014-04-16T12:57:26+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}