{
    "id": "SOLR-8138",
    "title": "Simple UI for issuing SQL queries",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Reopened",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "It would be great for Solr 6 if we could have admin screen where we could issue SQL queries using the new SQL interface.",
    "attachments": {
        "SOLR-8138.patch": "https://issues.apache.org/jira/secure/attachment/12769143/SOLR-8138.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-10-07T13:47:57+0000",
            "author": "Joel Bernstein",
            "content": "Upayavira, Jan Høydahl, let me know if you have any interest in collaborating. I'm happy to put time into this. I don't think we would want much more then a simple text area for entering SQL and a table to view the results. We would probably also want a couple of simple widgets to switch between MapReduce and Facets for the SQL aggregations and select the number of workers.\n\nI've already opened a ticket on the Banana site for SQL also.\n\nIn the long term as the JDBC driver fills out we'll have lot's of client options but the admin screen will always be nice thing to have.\n\nErik Hatcher, this also might be a cool thing for /browse to integrate or to implement through the velocity capabilities.  ",
            "id": "comment-14946869"
        },
        {
            "date": "2015-10-07T14:25:03+0000",
            "author": "Upayavira",
            "content": "Joel Bernstein I'm game, although I'm not yet very familiar with the SQL code. Does it run within SolrJ or directly inside a Solr instance? ",
            "id": "comment-14946932"
        },
        {
            "date": "2015-10-07T14:50:21+0000",
            "author": "Joel Bernstein",
            "content": "There is an http interface through the /sql handler. The result set is always JSON. ",
            "id": "comment-14946965"
        },
        {
            "date": "2015-10-07T14:58:15+0000",
            "author": "Joel Bernstein",
            "content": "Here are the test cases for the /sql handler (https://svn.apache.org/repos/asf/lucene/dev/trunk/solr/core/src/test/org/apache/solr/handler/TestSQLHandler.java). \n\nThey use a SolrStream to send the request. Under the covers this is just an http request that returns json.\n\nBecause the SQL interface supports unlimited requests, we'll have to add a LIMIT clause to the SQL query as part of the UI. ",
            "id": "comment-14946979"
        },
        {
            "date": "2015-10-27T22:49:52+0000",
            "author": "Kevin Risden",
            "content": "Here is a quick patch that enables a SQL tab and test interface for Solr Admin UI. It hardcodes the following:\n\n\trequest handler = /sql\n\twt=json\n\n\n\nThe following limitations:\n\n\thaving a query with a ; yields an error\n\tno example query (select * from collection isn't supported yet)\n\tno additional parsing of SQL statement before passing to /sql\n\tdoesn't check if there is a /sql handler on the collection\n\n ",
            "id": "comment-14977320"
        },
        {
            "date": "2015-11-02T11:09:21+0000",
            "author": "Upayavira",
            "content": "I haven't tried this yet, but from the source it looks like a clone of the query tab.\n\nAt present, the admin UI assumes knowledge of Solr, which is, in my view, unhelpful. I'd much rather move it towards something that people can use without Solr knowledge, but that can, if they want to, push it deeper. \n\nIf you are game, I'd much rather review where SQL fits into an updated querying UI, and then work on that. SQL should, I'd imagine, just be one syntax used to query, the key user activity being 'querying'.\n\nDoes that sound reasonable? ",
            "id": "comment-14985066"
        },
        {
            "date": "2015-11-02T13:26:40+0000",
            "author": "Kevin Risden",
            "content": "It is a clone of the query tab. I agree the patch I posted isn't a long term solution. It was my quick patch to be able to share some of the Solr SQL querying with my team. I don't have time currently to look into integrating a better UI. I agree with you that it would be better to have a single query tab and not multiple places to go to query Solr. ",
            "id": "comment-14985208"
        },
        {
            "date": "2015-11-02T15:23:18+0000",
            "author": "Erick Erickson",
            "content": "Do note that the SQL bits are Solr 6.0 only, can we disable/warn for 5x? ",
            "id": "comment-14985383"
        },
        {
            "date": "2015-11-02T15:43:00+0000",
            "author": "Upayavira",
            "content": "Yes, whilst this is a decidedly cool feature, I'm not planning on adding it straight-away, and won't be adding it to 5x. ",
            "id": "comment-14985406"
        },
        {
            "date": "2016-01-31T04:09:31+0000",
            "author": "Joel Bernstein",
            "content": "I think based on the progress of the JDBC driver it makes sense to close this ticket. Rather then spending time adding SQL query capabilities to the Solr UI, users can connect to Solr using DBVisualizer or another JDBC client. So, I'll close this ticket out.  ",
            "id": "comment-15125219"
        },
        {
            "date": "2017-03-29T13:53:50+0000",
            "author": "Michael Suzuki",
            "content": "I have almost completed my patch which includes a UI to perform simple queries.\nThere is a slight issue with the response at the moment. Currently the json returns\n\n docs: [ \n{isbn: [ 3166313 ]},\n{isbn: [ 2166313 ]},\n{ EOF: true,RESPONSE_TIME: 4}\n]\n\n\nIm hoping to display the results as a grid but having the field return an array is in issue, ideally it would be good if we could return it as:\n\n{isbn: 3166313 }\n\n\n ",
            "id": "comment-15947161"
        },
        {
            "date": "2017-03-29T18:46:00+0000",
            "author": "Michael Suzuki",
            "content": "I have made the changes on the javascript side to format the data so that we do not return field values as an array.\nSo far its looking good but it would be better if received the data as above comment. ",
            "id": "comment-15947675"
        },
        {
            "date": "2017-03-29T19:38:30+0000",
            "author": "Upayavira",
            "content": "Is the isbn field multivalued? I think it becomes an array when it is. It is important to be able to handle that situation, even if you have to tidy up the data in JS afterwards ",
            "id": "comment-15947774"
        },
        {
            "date": "2017-03-30T18:48:13+0000",
            "author": "Michael Suzuki",
            "content": "Good point Upayavira , I have reverted it back to its original response. ",
            "id": "comment-15949587"
        },
        {
            "date": "2017-03-30T18:49:34+0000",
            "author": "Michael Suzuki",
            "content": "The new sql query ui with angular ui-grid. ",
            "id": "comment-15949591"
        },
        {
            "date": "2017-04-03T23:18:30+0000",
            "author": "Joel Bernstein",
            "content": "I applied the patch to master. It applied cleanly and the queries are showing in the logs, but the grid isn't appearing with the results.\n\nMichael Suzuki, I think you'll need to apply the patch to master to see if it's working for you. ",
            "id": "comment-15954310"
        },
        {
            "date": "2017-04-04T14:46:16+0000",
            "author": "Michael Suzuki",
            "content": "Attaching the fixed patch of new sql query ui. ",
            "id": "comment-15955213"
        },
        {
            "date": "2017-04-04T15:51:26+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user michaelsuzukisagi opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/180\n\n    SOLR-8138, added new SQL Qury UI.\n\n\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/michaelsuzukisagi/lucene-solr master\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/180.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #180\n\n\ncommit 11514b16b292f2bc374134492a00425ee54181c7\nAuthor: Michael Suzuki <michael.suzuki@alfresco.com>\nDate:   2017-04-04T15:46:22Z\n\n    SOLR-8138, added new sql qury ui.\n\n ",
            "id": "comment-15955286"
        },
        {
            "date": "2017-04-06T16:37:34+0000",
            "author": "Kevin Risden",
            "content": "So one thing I noticed while trying this out, is that if you just hit execute without filling in the box this error message is printed:\n\n\nFailed to execute sqlQuery 'undefined' against JDBC connection 'jdbc:calcitesolr:'. Error while executing SQL \"undefined\": parse failed: Non-query expression encountered in illegal context\n\nMichael Suzuki - I'm not sure the UI is doing the right thing here? I think the \"undefined\" is coming from the UI to the backend? ",
            "id": "comment-15959245"
        },
        {
            "date": "2017-04-06T20:40:32+0000",
            "author": "Michael Suzuki",
            "content": "Good catch, i havent tried sending and empty string. I will amend it to pass it as an empty string. ",
            "id": "comment-15959710"
        },
        {
            "date": "2017-04-07T20:23:09+0000",
            "author": "Michael Suzuki",
            "content": "Kevin Risden, I have updated the ui to handle empty stmt. This is now part of the pull request, thanks for the feedback. ",
            "id": "comment-15961384"
        }
    ]
}