{
    "id": "SOLR-6833",
    "title": "bin/solr -e foo should not use server/solr as the SOLR_HOME",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "i think it's weird right now that running bin/solr with the \"-e\" (example) option causes it to create example solr instances inside the server directory.\n\ni think that's fine for running solr \"normally\" (ie: \"start\") but if you use \"-e\" that seems like the solr.solr.home for those example should instead be created under $SOLR_TIP/example.\n\nI would even go so far as to suggest that the log files created should live in that directory as well.",
    "attachments": {
        "SOLR-6833.patch": "https://issues.apache.org/jira/secure/attachment/12686366/SOLR-6833.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-10T18:16:04+0000",
            "author": "Timothy Potter",
            "content": "Alexandre Rafalovitch suggested this too ... \n\nCouple of things:\n\n\n\tShould the distribution bundle include example/solr/solr.xml? Or should we just copy server/solr/solr.xml to example/solr in the script if it's not there already? I guess I prefer copying it over vs. maintaining another file in version control.\n\n\n\n\n\tI like the idea of putting the example logs under example/ too. Currently, the server/resources/log4j.properties file just uses the cwd of the Jetty server to determine the location of the log file, specifically, it does:\n\n\n\n\nsolr.log=logs/\n...\nlog4j.appender.file.File=${solr.log}/solr.log\n\n\n\nThis translates to server/logs at runtime. What I'd like to do is change server/resources/log4j.properties to:\n\n\nsolr.log=${solr.solr.home}/logs/\n...\nlog4j.appender.file.File=${solr.log}/solr.log\n\n\n\nHowever, this will put logs under server/solr/logs instead of server/logs, which I actually like better since it allows you to reuse the server directory for multiple Solr nodes running on the same server with different solr.solr.homes, i.e. the following commands will result in two Solr nodes running on the same server, sharing the server directory but having different solr.solr.home directories:\n\n\nbin/solr -p 8983 -s node1\nbin/solr -p 8984 -s node2\n\n\n\nIf you do this now, then the log files will conflict with each other, so putting the logs directory under solr.solr.home will work better. If we don't think reusing the server directory is a big deal and want to keep server/logs, then I can also do: solr.log=${solr.solr.home}/../logs/ which will keep logs in server/logs or example/logs. Sorry if this is a bit pedantic but I want to make sure we're all in agreement with these changes since we're getting close to the 5x release. ",
            "id": "comment-14241477"
        },
        {
            "date": "2014-12-10T18:42:19+0000",
            "author": "Anshum Gupta",
            "content": "+1 on creating the instance directory in $SOLR_TIP/example.\n\nAlso, it makes sense to have the log directory in solr.solr.home. I personally would like it to be directly under solr.solr.home/logs instead of an added level. Makes things easier to cleanup too. ",
            "id": "comment-14241515"
        },
        {
            "date": "2014-12-10T18:58:06+0000",
            "author": "Hoss Man",
            "content": "Should the distribution bundle include example/solr/solr.xml? Or should we just copy server/solr/solr.xml to example/solr in the script if it's not there already?\n\ni think copying is the right way to go ... as far as the specific path...\n\ni think a big question is if you intend/expect the different examples to co-mingle.  If i run \"bin/solr -e techproducts\" and then later i run \"bin/solr -e schemaless\" is the expectation that i now have a single instance of solr with both the techproducts and schemaless cores up and running in it?  what about example-DIH, which isn't a configset and already has it's own dir in examples?\n\nwhat about the cloud examples?\n\ni think each \"-e foo\" option should create it's own \"example/foo\" directory (if it doesn't already exist - DIH always will) and create a stub solr.xml there.  in the case of \"-e cloud\" it has to go one more level for each server: \"example/cloud/nodeN\"\n\nbut the bottom line mantra should be: if it's created as part of an example, it lives in example/ ",
            "id": "comment-14241533"
        },
        {
            "date": "2014-12-10T19:41:11+0000",
            "author": "Alexandre Rafalovitch",
            "content": "what about the cloud examples?\n\nThe cloud examples at the moment copy the whole server directory into node1 and node2 in Solr root and then run from those. And re-running them requires figuring out whatever command line the script used to start them and doing it manually. There is no bin/start \"previous cloud example\"\n\nI am quite unhappy about that, especially with the rest of the stuff discussed above showing up in the server directory. I was told the latest code will carefully avoid extra directories, but I am not totally sold.\n\nAlso, the node1/node2 is nearly invisible in the directory and will cause confusion. I think they should be at least prefixed with the example name or something. ",
            "id": "comment-14241596"
        },
        {
            "date": "2014-12-10T19:45:13+0000",
            "author": "Timothy Potter",
            "content": "well if we go with my suggestion about changing the log4j.properties, then we don't need to clone the server directory anymore and can just have:\n\n\nexample/cloud/node1\nexample/cloud/node2\n\n\n\nam not totally sold\n\nWhat? ",
            "id": "comment-14241598"
        },
        {
            "date": "2014-12-10T19:50:12+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I am not totally sold that whatever script does to avoid directories inder the server will hold. It feels like a fragile solution to me. But this JIRA will make it less fragile and moving logs out will do so as well. ",
            "id": "comment-14241604"
        },
        {
            "date": "2014-12-10T19:59:58+0000",
            "author": "Timothy Potter",
            "content": "well then please submit a patch that does something better vs. just calling things fragile. ",
            "id": "comment-14241626"
        },
        {
            "date": "2014-12-10T20:15:59+0000",
            "author": "Anshum Gupta",
            "content": "I think we're in a much better shape with the scripts then we were in before this change happened.\nIt's iterative and it's evolving. There wasn't any support to automatically restart a previous setup before the scripts happened so I think we're fine as we haven't lost anything and gained a lot of convenience.\n\nWe certainly need updates to the documentation and explain things that need to be manually done until someone automates/scripts.\n\nAlso, I might be missing something here but what makes you think it's fragile? ",
            "id": "comment-14241651"
        },
        {
            "date": "2014-12-10T20:19:08+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Well, my proposal would be to have server directory locked down and everything else being outside. Which I mentioned before in other JIRAs. I, unfortunately, do not have that level of Solr contributor knowledge yet. Hopefully one day soon, but for now most of my large contributions are outside of Solr codebase.\n\nOn the other hand, I am trying to understand what kind of things will be hard to explain to the new users and - given their tendency to mess up - may cause recovery or consistency issues. A QA-level contribution, you could say. And that intuition comes from spending 3 years supporting multiple versions of multi-million line Java code (BEA Weblogic back in the day) and seeing day after day how even nearly-foolproof configurations do not survive new user's eager attempts at making it work.\n\nNo offense is intended to anybody. I do realize it is a major layout restructuring with the best intent. And it is great overall. ",
            "id": "comment-14241658"
        },
        {
            "date": "2014-12-10T20:19:47+0000",
            "author": "Timothy Potter",
            "content": "Actually, I think I want to go with using:\n\n\nsolr.log=${solr.solr.home}/../logs/\n\n\n\nfor the path to the logs directory (in log4j.properties) just in case someone wants to have a core named logs, there won't be any confusion. This results in the following directory structure:\n\nbin/solr -e techproducts\n\nexample/techproducts/logs/solr.log\nexample/techproducts/solr/solr.xml\nexample/techproducts/solr/techproducts/data\nexample/techproducts/solr/techproducts/conf\nexample/techproducts/solr/techproducts/core.properties\n\n\n\nbin/solr -e schemaless\n\nexample/schemaless/logs/solr.log\nexample/schemaless/solr/solr.xml\nexample/schemaless/solr/schemaless/data\nexample/schemaless/solr/schemaless/conf\nexample/schemaless/solr/schemaless/core.properties\n\n\n\nbin/solr -e cloud\n\nexample/cloud/node1/logs/solr.log\nexample/cloud/node1/solr/solr.xml\nexample/cloud/node1/solr/...\nexample/cloud/node2/logs/solr.log\nexample/cloud/node2/solr/solr.xml\nexample/cloud/node2/solr/...\n\n\n\nWith that change, if the user just starts Solr without running any examples, then logs will be in server/logs. ",
            "id": "comment-14241659"
        },
        {
            "date": "2014-12-10T20:40:40+0000",
            "author": "Timothy Potter",
            "content": "Patch implementing what we discussed for *nix; I'll wait until we're in agreement on the experience before porting to solr.cmd for Windows. ",
            "id": "comment-14241691"
        },
        {
            "date": "2014-12-10T21:55:54+0000",
            "author": "Timothy Potter",
            "content": "ugh! looking like we may need to use a different resources/log4j.properties for examples since setting:\n\n\nsolr.log=${solr.solr.home}/../logs/\n\n\n\nresults in the following error if you start Solr the old-fashioned way:\n\n\n$ java -jar start.jar\nlog4j:ERROR setFile(null,true) call failed.\njava.io.FileNotFoundException: /../logs/solr.log (No such file or directory)\n\tat java.io.FileOutputStream.open(Native Method)\n\tat java.io.FileOutputStream.<init>(FileOutputStream.java:213)\n\tat java.io.FileOutputStream.<init>(FileOutputStream.java:133)\n\tat org.apache.log4j.FileAppender.setFile(FileAppender.java:294)\n\tat org.apache.log4j.RollingFileAppender.setFile(RollingFileAppender.java:207)\n\tat org.apache.log4j.FileAppender.activateOptions(FileAppender.java:165)\n\n\n\nso that's not good ...  ",
            "id": "comment-14241821"
        },
        {
            "date": "2014-12-10T22:08:12+0000",
            "author": "Hoss Man",
            "content": "ugh! looking like we may need to use a different resources/log4j.properties for examples ...\n\nmight be for the best anyway: maybe leave the \"production\" log4j.properties lean with only WARN/ERROR enabled for most packages, while the example logging file could be set to INFO?\n\n(I'm not suggesting we make them substantively different right now as part of this issue - just pointing out there may be value in having them be distinct files) ",
            "id": "comment-14241837"
        },
        {
            "date": "2014-12-11T16:55:31+0000",
            "author": "Timothy Potter",
            "content": "Thanks Hoss Man - I'll go with that solution (example/resources/log4j.properties). Should have something to commit shortly. ",
            "id": "comment-14242780"
        },
        {
            "date": "2014-12-12T00:21:28+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1644799 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1644799 ]\n\nSOLR-6833: Examples started with bin/solr -e should use a solr.solr.home directory under the example directory instead of server/solr. ",
            "id": "comment-14243441"
        },
        {
            "date": "2014-12-12T00:47:51+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1644801 from Timothy Potter in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1644801 ]\n\nSOLR-6833: Examples started with bin/solr -e should use a solr.solr.home directory under the example directory instead of server/solr. ",
            "id": "comment-14243500"
        },
        {
            "date": "2014-12-12T00:49:02+0000",
            "author": "Timothy Potter",
            "content": "I think this one is good on trunk and 5x now, but would be good if some others could kick the tires a bit in case I overlooked something. ",
            "id": "comment-14243501"
        },
        {
            "date": "2014-12-14T01:26:20+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I found a cool command I did not see while reading the documentation before solr -i/-info. It's mentioned in passing in solr stop -help but could be nice to be mentioned in top-level help as well. It's very useful to check what's running. ",
            "id": "comment-14245764"
        },
        {
            "date": "2014-12-14T17:34:33+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Looks good. I hit a script bombing out on mis-spelt name, so opened a SOLR-6848 for that.\n\nThe rest here are just random thoughts from using the scripts, feel free to ignore if this has already been discussed.\n\n\n\tThe example run will generate console.log, even though log4j for example does not send anything to it. So the file is always empty.\n\tThere is also solr_gc.log for the examples, I am not sure if that's a big deal. It grows kind of fast, but so does the main log.\n\tIn the script, if the port is busy, is says:\n\nPort 8983 is already being used by another process (pid: 13221)\nCould be even more - first user - nicer to add after: Use -p flag to start with a different port.\n\n ",
            "id": "comment-14246007"
        },
        {
            "date": "2014-12-15T20:08:03+0000",
            "author": "Anshum Gupta",
            "content": "I think this change started bundling 'gettingstarted' collection out of the box. ",
            "id": "comment-14247154"
        },
        {
            "date": "2014-12-15T20:17:54+0000",
            "author": "Anshum Gupta",
            "content": "It's just the build and my fault. I ran the example from here once... and then did an \"ant clean package\"... that seems to have bundled /cloud with the gettingstarted data with it. ",
            "id": "comment-14247165"
        },
        {
            "date": "2014-12-15T20:24:04+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1645737 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1645737 ]\n\nSOLR-6833: clean should remove example directories created by running bin/solr -e foo ",
            "id": "comment-14247172"
        },
        {
            "date": "2014-12-15T20:35:36+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1645741 from Timothy Potter in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1645741 ]\n\nSOLR-6833: clean should remove example directories created by running bin/solr -e foo ",
            "id": "comment-14247187"
        },
        {
            "date": "2015-02-23T05:00:31+0000",
            "author": "Anshum Gupta",
            "content": "Bulk close after 5.0 release. ",
            "id": "comment-14332531"
        }
    ]
}