{
    "id": "SOLR-4193",
    "title": "A ZooKeeper RequestHandler that allows you to post config files to a collections linked config set or a specific config set.",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Could have an admin zk handler and one per core?\n\nAn admin zk handler would allow you to access it without specifying an existing core if done right.\n\nOne per core lets you do things like:\n\npost solrconfig.xml to localhost:8983:/solr/collection1/zkhandler\n\nThen we look up what config set we linked to and overwrite the solrconfig.xml.\n\nYou can already GET config files through another handler, so at the moment I'd avoid duplicating that.\n\nCould imagine adding commands over time though.",
    "attachments": {
        "SOLR-4193.patch": "https://issues.apache.org/jira/secure/attachment/12561052/SOLR-4193.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13532761",
            "date": "2012-12-14T22:51:51+0000",
            "content": "Here is an early patch and test for a per core handler that lets you post config files.\n\nIt probably makes sense to have more generic zookeeper cmds as well, but I think that should go in an admin zk handler. I think we should also optimize the user experience for the config update case though. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13532902",
            "date": "2012-12-15T02:18:05+0000",
            "content": "Adds tests and a small fix or two. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13532903",
            "date": "2012-12-15T02:19:14+0000",
            "content": "So I think we should break out the more general admin zookeeper handler into another issue.\n\nFor this I'd just like to make a very targeted, easy way to post config files to a collection's config set. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13532905",
            "date": "2012-12-15T02:20:03+0000",
            "content": "It would also be good to add first class Solrj support for this - I'll break that into a new issue though. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13532909",
            "date": "2012-12-15T02:25:49+0000",
            "content": "usage would be something like:\n\n java -Durl=http://localhost:8983/solr/collection1/zkconfig?fileName=solrconfig.xml -jar post.jar solrconfig.xml\n\n java -Durl=http://localhost:8983/solr/collection1/zkconfig?fileName=solrconfig.xml&configName=conf1 -jar post.jar solrconfig.xml\n\n\n\nIf the ContentStream coming in has a name, that can be used as well, but in my testing, posting a file to Solr does not result in a content stream that has the name of that file. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13533048",
            "date": "2012-12-15T15:07:14+0000",
            "content": "To get filenames, try multi-part posts:\n\ncurl http://localhost:8983/solr -F file1=@books.csv -Ffile2=@books.json\n\nI like using \"nc -l 8983\" as the server first in these cases to see exactly what's coming across the wire.\n\nAnd it seems like we should support multiple config files at once - say you add a field that references stopwords2.txt to schema.xml and want to upload the stopwords2.txt at the same time?\n\nideas:\n\n\toptionally take a different confName in case you're prepping a config for a new collection that doesn't exist yet.\n\tupload a whole config-set/directory?\n\tany way to share some stuff w/ ZkCLI?\n\twhat stuff belongs here vs collections API?\n\n\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13533054",
            "date": "2012-12-15T15:22:14+0000",
            "content": "To get filenames, try multi-part posts:\n\nThanks, I'll test it out and look at if we can improve the post tool in this area.\n\noptionally take a different confName in case you're prepping a config for a new collection that doesn't exist yet.\n\nYou can currently override the confName, but it won't yet create a new config set if it doesn't already exist. Meant to get that in though.\n\nupload a whole config-set/directory?\n\nYeah, I wasn't sure how easy it was to post multiple files in one shot on the cmd line, but looks pretty easy - would be nicer if you could glob all the filenames somehow though. I'll make sure this works on the back end.\n\nany way to share some stuff w/ ZkCLI?\n\nYup, ZkCLI lives on ZkController, so this can all share code.\n\nwhat stuff belongs here vs collections API?\n\nGood question. I'll have to think more - don't see an obvious answer. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13533068",
            "date": "2012-12-15T16:02:27+0000",
            "content": "Maybe off the wall here, but how about exposing the configuration tree via WebDAV, maybe something along the lines of Tomcat's WebDAV servlet: http://tomcat.apache.org/tomcat-7.0-doc/api/org/apache/catalina/servlets/WebdavServlet.html\n\nWith WebDAV you'd have a file system manageable/mountable read/write view of the tree as files. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13533081",
            "date": "2012-12-15T16:55:36+0000",
            "content": "I think that's a great idea!\n\nI'd also like a post api for simple integration with solrj I think and perhaps easier to integrate with scripts?\n\nI have not done much with webdav though, so I'm only familiar with it from a high level. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13533146",
            "date": "2012-12-15T20:32:02+0000",
            "content": "An old ZK issue mentions WebDAV <https://issues.apache.org/jira/browse/ZOOKEEPER-37>; the original Sourceforge issue <http://sourceforge.net/tracker/index.php?func=detail&aid=1961764&group_id=209147&atid=1008547> includes a (now-broken) link to Pier Fumagalli's Apache-licensed minimal WebDAV servlet implementation. \n\nLooks like he's hosting it at GitHub now: <https://github.com/pfumagalli/webdav>.   "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-13533153",
            "date": "2012-12-15T20:53:55+0000",
            "content": "Not sure if this is valuable, but SOLR-4052 is what I started on, and ran into difficulties, so lost steam.  I am excited about this, as we've been using ZK to manage configs for our remote Solr, wihtout requiring filesystem access, even without solrcloud! "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13564702",
            "date": "2013-01-28T21:30:09+0000",
            "content": "And it seems like we should support multiple config files at once - say you add a field that references stopwords2.txt to schema.xml and want to upload the stopwords2.txt at the same time?\n\nI added a test for this - turns out it already works no problem. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13569820",
            "date": "2013-02-03T17:28:19+0000",
            "content": "I'd like the ability to tell a collection to use a different config set.  I brought this up on the mailing list, where Mark Miller directed me to this issue.  Consider this situation, which is essentially where I am right now:\n\nI have a config set named 'mbbasecfg' which for the immediate future will be used by all collections that I add to my SolrCloud (4.1).  Each collection will get used by a SolrJ servlet, which serves content from one specific customer.  The 'mb' prefix is something specific to our software.\n\nLet's say customer X decides they want things to work very differently for their application, and they are willing to pay us development costs to make it happen.  Their requested changes will require a different Solr config and maybe a different schema.  Customer X already has a collection in SolrCloud.\n\nWhat I'd like to be able to do is upload a new config set called mbcustxcfg, then ask SolrCloud to change the customerx collection to use that new config set.  If the changes don't require a reindex, we'd be done after reloading the collection.  If they do require a reindex, then we'll do that.\n\nCurrently we would have to delete their collection and build it again with a new config set.  If renaming a collection is possible (not sure whether it is), we could do that before making a new collection with the original name.  This is not the end of the world, of course. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13569830",
            "date": "2013-02-03T17:51:40+0000",
            "content": "Hey Shawn, you can do this with the zkcli tool by the way - just change the config set link for the collection and reload.\n\nWill make sure it's supported through an http api as well though. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717391",
            "date": "2013-07-23T18:48:05+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971355",
            "date": "2014-04-16T12:57:52+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}