{
    "id": "SOLR-10914",
    "title": "RecoveryStrategy's sendPrepRecoveryCmd can get stuck for 5 minutes if leader is unloaded",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [
            "6.7",
            "7.0"
        ],
        "affect_versions": "6.4,                                            6.5,                                            6.6",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "tl;dr; a recovering replica is stuck for 5 minutes in the prep recovery request if the leader core is unloaded before the prep recovery request is made.\n\nSOLR-9716 changed the sendPrepRecoveryCmd to retry on read timeouts (earlier it had no connection/read timeout at all) but the fix has caused another problem. Say \n\n\tA replica starts up (or is newly created) and goes into recovery,\n\tReplica finds that leader=X\n\tThe core X is unloaded but the node that used to host X is still running and taking requests\n\tReplica calls sendPrepRecoveryCmd to X\n\n\n\nAt this point, the node X receives the prep recovery command, finds that the core X does not exist and keeps checking again in a sleep-loop until a timeout happens. I am not sure why prep recovery core admin command needs to continue waiting if a local core does not exist. The default timeout here is usually longer than 10 seconds.\n\nOn the recovering replica's side, the prep recovery has a connection/read timeout of only 10s, so the request always times out and is retried upto 5 minutes. Only then does the recovery attempt fails and may be restarted again with the right leader URL.",
    "attachments": {
        "SOLR-10914.patch": "https://issues.apache.org/jira/secure/attachment/12873602/SOLR-10914.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-19T15:46:29+0000",
            "content": "Thanks to Andrzej Bialecki  for catching this with the tests he wrote for SOLR-10878. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16054243"
        },
        {
            "date": "2017-06-20T05:36:02+0000",
            "content": "This patch changes the sendPrepRecoveryCmd method to use a small connection timeout (10s) as before and a read timeout which is 5 seconds longer than the max timeout of prep recovery on the server side. It makes no retries anymore. So once the prep recovery returns a 404 after 30s, the recovery fails and can be retries again with the new/correct leader URL.\n\nI'll commit this but I'll open another issue to explore removing the wait time on core not found from prep recovery. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16055173"
        },
        {
            "date": "2017-07-03T13:36:05+0000",
            "content": "I added a TestPrepRecovery to this patch. It has two tests:\n\n\tTest that prep recovery eventually succeeds when the leader doesn't respond at all. This is an explicit test to protect against regressions of SOLR-9716\n\tTest that prep recovery succeeds within 90s (default timeout of waitForState) when the leader is unloaded. The test doesn't actually wait for 90s unless there is a regression but it can wait upto 23 seconds for the second recovery attempt which will succeed because the fault injection is done only once. Also the fault injection is only done 30% of the time.\n\n\n\nThis is ready. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16072448"
        },
        {
            "date": "2017-07-03T13:37:04+0000",
            "content": "Fixed wrong code comment in the test in previous patch. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16072450"
        },
        {
            "date": "2017-07-03T14:20:42+0000",
            "content": "Commit 157ff9a4e159158f4ecc474d1874da97577e6190 in lucene-solr's branch refs/heads/master from Shalin Shekhar Mangar\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=157ff9a ]\n\nSOLR-10914: RecoveryStrategy's sendPrepRecoveryCmd can get stuck for 5 minutes if leader is unloaded ",
            "author": "ASF subversion and git services",
            "id": "comment-16072513"
        },
        {
            "date": "2017-07-03T14:23:14+0000",
            "content": "Commit df727d313f6f63f73b8efe0a0448b263581670bd in lucene-solr's branch refs/heads/branch_6x from Shalin Shekhar Mangar\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=df727d3 ]\n\nSOLR-10914: RecoveryStrategy's sendPrepRecoveryCmd can get stuck for 5 minutes if leader is unloaded\n\n(cherry picked from commit 157ff9a) ",
            "author": "ASF subversion and git services",
            "id": "comment-16072516"
        }
    ]
}