{
    "id": "SOLR-1742",
    "title": "uniqueKey must be string type otherwise \"missing core name in path\" error is rendered",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.5"
        ],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "How to replicate:\n\n\n\tcreate index with schema where you uniqueKet is integer\n\tset your unique key type to integer\n\tdeploy your index\n\n\n\nunder http://host:8080/solr/admin/ -  you will get \"missing core name in path\"\n\nWorkaround:\n\n\tchange type of your uniqueKet to srting\n\tundeploy and deploy index\n\n\n\nIts quite confusing as 1.5 is not properly reporting errors and you need to be lucky to find that reason on your own.\n\n\ncheers,\n/Marcin",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Lance Norskog",
            "id": "comment-12829451",
            "date": "2010-02-04T05:05:11+0000",
            "content": "I just tried this and the old 'pint' type works as a unique key. The QueryElevationComponent complains and you have to turn it off, but that's all that happened.\n\nThe type has to be set to 'pint' before you add the document. "
        },
        {
            "author": "Marcin",
            "id": "comment-12829586",
            "date": "2010-02-04T11:45:16+0000",
            "content": "Cool, but what If I would like to be able to sort on it since sint is not working its not really solving my issue.\n\n/cheers "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12829607",
            "date": "2010-02-04T14:15:01+0000",
            "content": "Hey Marcin,\n\nYou should be able to use int (or sint) no problem. When you see the error \"missing core name in path\", thats often an indication you need to check your logs (especially if you are running single core) - look for the first error, timewise, that you can find. In this case you will see: the QueryElevationComponent requires a String id field. If you remove the QueryElevationComponent/Handler, you should no longer see \"missing core name in path\" and Solr will start up.\n\n\n\tMark\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12829739",
            "date": "2010-02-04T19:51:46+0000",
            "content": "the string dependency for QueryElevationComponent does seem to be the root of the problem – i think we should try to get the the bottom of why such a confusing error message is reported, but we've already got SOLR-1743 to track that. "
        },
        {
            "author": "Marcin",
            "id": "comment-12830048",
            "date": "2010-02-05T10:31:27+0000",
            "content": "OK guys, thanks for that. I am closing this issue then and looking forward to solve SOLR-1743 now.\n\ncheers,\n/Marcin "
        }
    ]
}