{
    "id": "SOLR-684",
    "title": "Hudson builds do not have the SVN revision because svnversion is not available",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "Task",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The build file tries to run svnversion when generating the jar manifest to include the revision number. This fails in Hudson however as the svnversion executable is not available.\n\nThis could be addressed by installing svnversion on the build machine or using alternative means of determining the revision number.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12627059",
            "date": "2008-08-29T18:21:14+0000",
            "content": "r690357 should help us solve this problem ... i've made the corrisponding changes to the Hudson Solr-trunk config and manually kicked off a build.\n\nif it works, i'll merge to the 1.3 branch. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12627067",
            "date": "2008-08-29T18:46:47+0000",
            "content": "Hmmm, doesn't look like it \n\n[exec] Execute failed: java.io.IOException: /opt/subversion-1.4.5/bin/svnversion: not found "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12627077",
            "date": "2008-08-29T19:19:44+0000",
            "content": "yeah ... i forgot the solr hudson builds are actually run on the Lucene zone machine (which has a slightly different setup then the hudson zone) ... let's see how build#551 goes "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12627080",
            "date": "2008-08-29T19:30:05+0000",
            "content": "Looks good  "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12627090",
            "date": "2008-08-29T20:07:34+0000",
            "content": "In case this ever needs to be done with pure \"svn\":\n\n$ svn info | grep 'Revision' | awk '\n{print $2}\n'\n15171\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12627093",
            "date": "2008-08-29T20:19:51+0000",
            "content": "I've merged to 1.3 in r690384 and made the appropriate Hudson config changes for Grant's shiny new Hudson \"Solr Release Candidate\" setup, so 1.3-RC2 and on should be golden. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12627097",
            "date": "2008-08-29T20:25:35+0000",
            "content": "In case this ever needs to be done with pure \"svn\":\n\nI strongly recommend people don't do that ... or at least, don't assume it's equivalent.\n\nsvnversion is automatically recursive, and aware of both mixed version trees and local modifications, so you can get output like this...\n\n\nhossman@coaster:~/lucene/solr$ svnversion\n690356:690357M\n\n\n...when the revs of your files vary between 690356 and 690357 and some files deep in your tree are locally modified.\n\nattempting to get the same information out of \"pure svn\" would require shell scripting the likes of which would likely drive you insane.\n "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12627099",
            "date": "2008-08-29T20:31:34+0000",
            "content": "...but then again it's probably no big deal if the svn version number is incorrect as it's only used in the jar/war manifests. When you get something like 690356:690357M it's highly unlikely that this will help you to uniquely identify the \"revision\" as a whole or recreate it, which I think is the point of including it in the manifest. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12627106",
            "date": "2008-08-29T20:53:11+0000",
            "content": "Good point, Hoss.   "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12627108",
            "date": "2008-08-29T20:57:18+0000",
            "content": "When you get something like 690356:690357M it's highly unlikely that this will help you to uniquely identify the \"revision\" as a whole or recreate it, which I think is the point of including it in the manifest.\n\nTrue: but it will tell you that you can't recreate it purely from the repository.  having the svnversion info is just an added bit of security blanket for people who later want a starting point to understand where the release came from – when it's a single number, you have a good starting point.  when it's mixed you have an ambiguous starting point, and when it's got an \"M\" all bets are off. "
        }
    ]
}