{
    "id": "SOLR-8663",
    "title": "Multiple searchers open for a single core causing memory issues",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.6",
        "status": "Resolved",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "For a single core, we are having multiple searchers open. Although the current searcher points to the latest searcher opened, some old searchers are not getting cleaned up , they are holding their cache and ultimately causing memory issues. \n\nPossibly for cores which are taking a lot of time to warmup their cache the replication interval is overlapping with warmup time taken for the last searcher open during last replication.\n\nHowever any idea why sometimes old searchers are not getting freed ?\nEx. Searchers from couple of days back are still seen in Solr console.\nip:port/solr/admin.html#/<core-name>/plugins/core\nIs there any known bug around this for Solr 4.6 ?\n\np.s.: we have custom code extending some Solr components at many places. What I am trying to understand also is what is the best place to start debugging this ?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-09T14:52:46+0000",
            "author": "Erick Erickson",
            "content": "First, please discuss this kind of thing on the user's list and/or the dev list before raising a JIRA, we try to keep JIRAs for code changes. You'll get more responses faster there.\n\nThis is almost certainly a problem in your custom code where you're not properly closing searchers. Indeed, when you keep a searcher open it chews up memory.\n\nAs for the warmup, warming a bunch of searchers at once usually means you're opening them too rapidly and is an anti-pattern.\n\nClosing this until we have an indication that this is a Solr issue rather than a custom code issue. ",
            "id": "comment-15139017"
        }
    ]
}