{
    "id": "SOLR-1750",
    "title": "SolrInfoMBeanHandler - replacement for stats.jsp and registry.jsp",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.5",
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "stats.jsp is cool and all, but suffers from escaping issues, and also is not accessible from SolrJ or other standard Solr APIs.\n\nHere's a request handler that emits everything stats.jsp does.\n\nFor now, it needs to be registered in solrconfig.xml like this:\n\n\n    <requestHandler name=\"/admin/stats\" class=\"solr.SystemStatsRequestHandler\" />\n\n\n\nBut will register this in AdminHandlers automatically before committing.",
    "attachments": {
        "SystemStatsRequestHandler.java": "https://issues.apache.org/jira/secure/attachment/12434671/SystemStatsRequestHandler.java",
        "SOLR-1750-followup.patch": "https://issues.apache.org/jira/secure/attachment/12446909/SOLR-1750-followup.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-12829050",
            "date": "2010-02-03T12:29:52+0000",
            "content": "I'll commit this in the near future. \n\nAny thoughts on the naming of this beast?  \"stats\" is a bit overloaded (StatsComponent).  as is \"system\" (SystemInfoHandler). "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12829052",
            "date": "2010-02-03T12:31:19+0000",
            "content": "Also, food for thought, when (hopefully not if) the VelocityResponseWriter is moved into core, we can deprecate stats.jsp and skin the output of this request handler for a similar pleasant view like stats.jsp+client-side xsl does now. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-12829144",
            "date": "2010-02-03T17:08:03+0000",
            "content": "Any thoughts on the naming of this beast?\n\nHow about SysInfoRequestHandler - bonus: SIRH evokes RFK's assassin "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-12829199",
            "date": "2010-02-03T19:07:53+0000",
            "content": "\"stats\" is a bit overloaded (StatsComponent). as is \"system\" (SystemInfoHandler).\n\nI swear when I read this, before I suggested SIRH, you had written \"SystemStatsHandler\" instead of \"SystemInfoHandler\".  Not sure how you changed it without a red \"edited\" annotation in the header for your comment....  Et tu, Atlassian?\n\nAnyway, pathological paranoia aside, SIRH is too close to SystemInfoHandler - I hereby begin the process of formally withdrawing it from consideration.  Ok, done.\n\nstats.xsl creates a title prefix \"Solr Statistics\" - how about SolrStatsRequestHandler? "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-12829354",
            "date": "2010-02-04T00:57:58+0000",
            "content": "\n+1 on SolrStatsRequestHandler\n\nYou might want to consider either omitting or making optional the Lucene Fieldcache stats; they can often be very slow to be generated  ( see  http://www.lucidimagination.com/search/document/5ba908577d2e4c25/stats_page_slow_in_latest_nightly#2f40166c25f9bfa0 ). One use case for this request handler that I can see is high frequency (every few seconds) monitoring as part of performance testing,  for which a fast response is pretty mandatory.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12829773",
            "date": "2010-02-04T20:52:06+0000",
            "content": "Any thoughts on the naming of this beast?\n\nSystemInfoHandler sounds good.\n\nThis would probably also be a good time to retire \"registry.jsp\" ... all we need to do is add a few more pieces of \"system info\" to this handler (and add some param options to disable the \"stats\" part of the output)\n\nAlso, food for thought, when (hopefully not if) the VelocityResponseWriter is moved into core, we can deprecate stats.jsp and skin the output of this request handler for a similar pleasant view like stats.jsp+client-side xsl does now.\n\nEven if/when VelocityResponseWRiter is in the core, i'd still rather just rely on client side XSLT for this to reduce the number of things that could potentially get missconfigured and then confuse people why the page doesn't look right ... the XmlResponseWRriter has always supported a \"stylesheet\" param that (while not generally useful to most people) let's you easily reference any style sheet that can be served out of the admin directory ... all we really need is an updatd .xsl file to translate the standard XML format into the old style stats view. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12829883",
            "date": "2010-02-05T00:37:34+0000",
            "content": "Some updates to Erik's previous version...\n\n\n\tadds everything from registry.jsp\n\t\n\t\tlucene/solr version info\n\t\tsource/docs info for each object\n\t\n\t\n\tforcibly disable HTTP Caching\n\tadds params to control which objects are listed\n\t\n\t\t(multivalued) \"cat\" param restricts category names (default is all)\n\t\t(multivalued) \"key\" param restricts object keys (default is all)\n\t\n\t\n\tadds (boolean) \"stats\" param to control if stats are outputed for each object\n\t\n\t\tper-field style override can be used to override per object key\n\t\n\t\n\trefactored the old nested looping that stast.jsp did over every object and every category into a single pass\n\tswitch all HashMaps to NamedLists or SimpleOrderedMaps to preserve predictable ordering\n\n\n\nExamples...\n\n\t?cat=CACHE\n\t\n\t\treturn info about caches, but nothing else (stats disabled by default)\n\t\n\t\n\t?stats=true&cat=CACHE\n\t\n\t\treturn info and stats about caches, but nothing else\n\t\n\t\n\t?stats=true&f.fieldCache.stats=false\n\t\n\t\tInfo about everything, stats for everything except fieldCache\n\t\n\t\n\t?key=fieldCache&stats=true\n\t\n\t\tReturn info and stats for fieldCache, but nothing else\n\t\n\t\n\n\n\nI left the class name alone, but i vote for \"SystemInfoRequestHandler\" with a default registration of \"/admin/info\"\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12829904",
            "date": "2010-02-05T01:29:49+0000",
            "content": "Whoops .. i botched the HTTP Caching prevention in the last version "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12839928",
            "date": "2010-03-02T00:05:43+0000",
            "content": "\nCommitted revision 917812.\n\nI went ahead and commited the most recent attachment under the name \"SystemInfoRequestHandler\" with slightly generalized javadocs.\n\nLeaving the issue open so we make sure to settle the remaining issues before we release...\n\n\n\tdecide if we want to change the name\n\tadd default registration as part of the AdminRequestHandler (ie: /admin/info ?)\n\tadd some docs (didn't wnat to make a wiki page until we're certain of hte name)\n\tdecide if we want to modify the response structure (should all of the top level info be encapsulated in a container?)\n\n "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12840208",
            "date": "2010-03-02T15:40:47+0000",
            "content": "Thanks Hoss for committing!\n\nnaming: I'm fine with how it is, but fine if the name changes too and +1 to adding default registration\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872446",
            "date": "2010-05-27T22:05:29+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872800",
            "date": "2010-05-28T03:07:59+0000",
            "content": "\nCorrecting Fix Version based on CHANGES.txt, see this thread for more details...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874768",
            "date": "2010-06-02T20:05:02+0000",
            "content": "1) i screwed up, and should have put this in o.a.s.handler.admin instead of o.a.s.handler\n\n2) Somehow i completely overlooked the fact that there is already a o.a.s.handler.admin.SystemInfoHandler (Erik even mentioned it above) which is registered to the path /admin/system and returns basic info on the current machine, current JVM, the versions of Lucene/Solr, and some basic info about the SolrCore.\n\nWith that in mind i propose we rename this new one to \"SolrInfoMBeanHandler\" since that's the crux of what it provides (data about all of the SolrInfoMBeans) and have AdminHandler register it with the path /admin/mbeans.  We could/should probably also remove some of the code that overlaps between this handler and SystemInfoHandler.\n\ncomments?\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12874904",
            "date": "2010-06-03T01:20:10+0000",
            "content": "Please add an option that just lists the catalog of MBeans. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874910",
            "date": "2010-06-03T01:32:27+0000",
            "content": "Please add an option that just lists the catalog of MBeans. \n\nIt's already there – if stats=false it just returns the list of SolrInfoMBeans from the registry (like registry.jsp)\n\nwhat do you think of the proposed name change & path: SolrInfoMBeanHandler & /admin/mbeans ? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12877986",
            "date": "2010-06-11T21:46:21+0000",
            "content": "SOLR-1750 cleanup...\n\n\n\trename to o.a.s.handler.admin.SolrInfoMBeanHandler\n\tadd default registration as part of the AdminRequestHandler /admin/mbeans\n\teliminate duplication of functionality w/SystemInfoHandler\n\t\"docs\" are left in explicit order returned by plugin\n\tif \"cats\" param is used, categories are returned in that order\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12877988",
            "date": "2010-06-11T21:54:22+0000",
            "content": "Committed revision 953886. ... trunk\nCommitted revision 953887. ... branch 3x "
        },
        {
            "author": "Jonathan Rochkind",
            "id": "comment-12894277",
            "date": "2010-07-31T13:45:10+0000",
            "content": "re: naming. If you're someone like me who is becoming fairly familiar with using solr, but not with the solr code – then \"SolrInfoMBeanHandler\" or \"admin/mbean\"  doesn't mean anything to me, and is kind of confusing. I want to get info on my indexes and caches-- it would be very non-obvious to me (if i hadn't read this ticket) that \"MBean\" has anything to do with this, since I don't know what an MBean is – and probably shouldn't have to to use solr through it's APIs.\n\nSo seems to me that a name based on the functions provided (not the underlying internal implementation) is preferable. But i recognize the namespace conflict problems, so much stuff in Solr already (some of it deprecated or soon to be deprecated or removed, some of it not) that it's hard to find a non-conflicting name. \n\nEven if the underlying class is SolrInfoMBeanHandler, would it be less (or more) confusing for the path to be /admin/info still?  That might be less confusing, as someone like me would still see /admin/info in the config and think, aha, that might be what I want. Or the lack of consistency might just be more confusing in the end. \n\nI don't know what the current SystemInfoHandler does, what's the difference between that and this new one? There might be hints to naming in that. If the new one does everything the old one does, perhaps call it NewSystemInfoHandler, but still register it at /admin/info, with the other one being deprecated? Just brainstorming. Or rename the other one to OldSystemInfoHandler.  "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013079",
            "date": "2011-03-30T15:45:29+0000",
            "content": "Bulk close for 3.1.0 release "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13052606",
            "date": "2011-06-21T15:04:51+0000",
            "content": "The /admin/stats handler is not registered by default, nor is it included in example config. I had to add <requestHandler name=\"/admin/stats\" class=\"org.apache.solr.handler.admin.SolrInfoMBeanHandler\" /> to my solrconfig to get it working. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13052656",
            "date": "2011-06-21T16:48:31+0000",
            "content": "Jan: as stated above the registration i picked was /admin/mbeans - stats is too specific since the component can be used for other purposes then getting stats.\n\nit's also not a \"default\" handler – it's registered if you register the AdminHandler\n\nJonathan: i overlooked your comment until now.  the existing SystemInfoHandler isn't deprecated – it's still very useful and provides information about the entire \"system\" solr is running in (the jvm, the os, etc...) "
        }
    ]
}