{
    "id": "SOLR-8499",
    "title": "Add segmentCount and hasDeletions to SolrIndexSearcher stats",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.4",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "I'd like to add a statistic to the /admin/mbeans (SolrInfoMBeanHandler) results – the number of segments in the Lucene index.  I think it would be best to add it to the stats returned by SolrIndexSearcher.  Currently that info is available from /admin/luke (LukeRequestHandler), but I'm finding it very painful to add another client request to the code where I want to use this additional info.\n\nAs long as I'm fiddling, hasDeletions would be another addition that some people might find useful.",
    "attachments": {
        "SOLR-8499.patch": "https://issues.apache.org/jira/secure/attachment/12780869/SOLR-8499.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-07T01:10:02+0000",
            "author": "Shawn Heisey",
            "content": "The patch I'm attaching to do this is extremely simple.\n\nWould this be a bad idea for any reason? ",
            "id": "comment-15086609"
        },
        {
            "date": "2016-01-07T10:04:14+0000",
            "author": "Christine Poerschke",
            "content": "Attaching potential alternative patch. Perhaps hasDeletions could be omitted since deletedDocs already exists, plus 2 small tweaks to the existing implementation. ",
            "id": "comment-15087150"
        },
        {
            "date": "2016-01-07T14:25:31+0000",
            "author": "Shawn Heisey",
            "content": "small tweaks to the existing implementation\n\nGood idea.  If I had known that there was a \"numDeletedDocs()\" I would have used it.  The same deleted calculation is used in LukeRequestHandler, I can update that too.  Creating the map with the proper initial size might make it more efficient.\n\nI put hasDeletions in because it's there in LukeRequestHandler and seemed like a good idea.  I suppose a check for \"deletedDocs > 0\" is just as effective as a check for hasDeletions.  Allocating less heap memory can be a good thing.\n\nNow that I'm taking a second look, I am considering adding curly braces and newlines to the \"if\" statement that is near the end of the additions to lst, purely for readability.  The code is perfectly valid as-is, but I find one-line if clauses to be easier to visually parse if they are fully formatted. ",
            "id": "comment-15087479"
        }
    ]
}