{
    "id": "SOLR-4108",
    "title": "SolrCloud: Unexpected behavior when doing atomic updates or document reindexations.",
    "details": {
        "affect_versions": "4.0",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "The situation is this the following:\n\n1. SolrCloud with one shard and two Solr instances.\n2. Indexation via SolrJ with CloudServer and a custom BinaryLBHttpSolrServer that uses BinaryRequestWriter to execute correctly atomic updates. Check JIRA-4080.\n3. An asynchronous proccess updates partially some document fields. After that operation I automatically execute a commit, so the index must be reloaded.\n\nWhat I have checked is that both using atomic updates or complete document reindexations random documents are not updated even if I saw debugging how the add() and commit() operations were executed correctly and without errors. In other words, something strange happens when you both index and update documents asynchronously at the same time.\n\nAlso, if I debug line  by line (blocking other indexation/update proccesses) and I check with my own eyes when an index operation is done, I confirm that the document itself updates correctly.\n\nWhat I think is that there is some critical problem with both SolrCloud and CloudSolrServer interface that has something to do with index blocking while writing and forwarding document updates to replicas.\n\nIf I´m right, and considering also JIRA-4080, I would not recommend SolrCloud in production at the moment.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Luis Cappa Banda",
            "id": "comment-13503119",
            "date": "2012-11-23T09:10:39+0000",
            "content": "New scenario I: \n\n\n\tI changed my custom BinaryLBHttpSolrServer to common LBHttpSolrServer.\n\tI don´t make atomic updates. Instead I reindex again the whole document with the new changes.\n\n\n\nRESULT: again random documents were updated but the most of them didn´t.\n\nNew scenario II: \n\n\n\tI changed my custom BinaryLBHttpSolrServer to common LBHttpSolrServer.\n\tI don´t make atomic updates. Instead I reindex again the whole document with the new changes but first I DELETE IT.\n\n\n\nRESULT: again random documents were updated but the most of them didn´t. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13503225",
            "date": "2012-11-23T15:30:43+0000",
            "content": "Could you try a recent nightly build and see if you still see issues?  I'm wondering if the commit-race bug could be involved here: SOLR-3933 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717191",
            "date": "2013-07-23T18:47:25+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971133",
            "date": "2014-04-16T12:57:15+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14117960",
            "date": "2014-09-02T07:01:37+0000",
            "content": "I haven't seen these problems happen in a long time. This was reported on Solr 4.0 and we've had tons of fixes since. The related issue SOLR-4080 has also been fixed.\n\nPlease re-open this issue if you encounter this issue on a more recent version of Solr. "
        }
    ]
}