{
    "id": "SOLR-5350",
    "title": "Solr 4.5 upgrade instructions don't mention that solrconfig.xml dataDir variable must now be in another format.",
    "details": {
        "affect_versions": "4.5",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "The configuration of dataDir in solrconfig.xml used to support ${dataDir} format at least in all the previous 4.* releases, but in 4.5 that is no longer true. Using the old format produces exception: \n\nSolrException: No system property or default value specified for dataDir value:${dataDir}\n\nThe new format for the variable is ${solr.corename.data.dir:} where corename is defined in solr.xml. This deprecation is not mentioned in the upgrade instructions.",
    "attachments": {
        "solr-home-tmp-test.zip": "https://issues.apache.org/jira/secure/attachment/12609941/solr-home-tmp-test.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13796262",
            "date": "2013-10-16T00:45:44+0000",
            "content": "I'm not sure that i understand the problem here.\n\nSolr has not, to my knowledge, ever supported ${dataDir} as an implicit variable in solrconfig.xml. – but maybe it was and i'm just not aware of it?  in which case this may be a bug that should be fixed, not just a documentation problem.\n\nCan you please attach an example of what configs you were using prior to 4.5 that was working for you (showing how you were using ${dataDir} as a variable and let us know exactly which version of solr you were using?\n\nCan you please also let us know where in the docs (or wiki, or whatever) you found any mention of using ${dataDir} as a variable in your configs? (if you can't find any that's fine – i'd just like to understand what's going on here) "
        },
        {
            "author": "Juha Haaga",
            "id": "comment-13796492",
            "date": "2013-10-16T07:21:47+0000",
            "content": "I went and searched through the example configs in all 4.* solr releases and they correctly say ${solr.core.data.dir:}. Digging through the changelog of our repository, it turns out that I had also used that in the initial commit, but one of our sysadmins while configuring a production install had changed it to ${dataDir} about a year ago. I'm not sure what was his reasoning to change it into that, or what was the original source of that syntax then, but apparently it worked. \n\nSo basically the ${dataDir} style seems to have worked in all versions from 4.0.0-alpha until 4.4 to 4.5 migration, at which point Solr started enforcing the ${solr.core.data.dir:} variant. \n\n---- Snip from the solrconfig.xml that worked pre-4.5 ----\n<config>\n  <luceneMatchVersion>LUCENE_40</luceneMatchVersion>\n\n  <jmx />\n\n  <!-- <indexConfig> section could go here, but we want the defaults -->\n\n  <!--  The DirectoryFactory to use for indexes -->\n  <directoryFactory name=\"DirectoryFactory\" class=\"${solr.directoryFactory:solr.StandardDirectoryFactory}\"/>\n\n  <dataDir>${dataDir}</dataDir>\n\n  <!-- the default high-performance update handler -->\n  <updateHandler class=\"solr.DirectUpdateHandler2\">\n    <updateLog>\n      <str name=\"dir\">${dataDir}</str>\n    </updateLog>\n    <maxPendingDeletes>100000</maxPendingDeletes>\n    <autoCommit> \n      <maxDocs>10000</maxDocs>\n      <maxTime>30000</maxTime> \n    </autoCommit>\n  </updateHandler>\n---- end snip ----\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13803462",
            "date": "2013-10-23T22:26:12+0000",
            "content": "one of our sysadmins while configuring a production install had changed it to ${dataDir} about a year ago. I'm not sure what was his reasoning to change it into that, or what was the original source of that syntax then, but apparently it worked. \n\nThe example snipped you posted really doesn't make any sense in terms of what you are suggesting though: that Solr was implicitly defining a \"${dataDir}\" variable you could use in the config to refer to whatever <dataDir/> was in use – because in your snippet, you use the \"${dataDir}\" variable to configure the  <dataDir/> – so there would be some circular logic going on there.\n\nI am almost 100% certain that if this \"${dataDir}\" variable was working for you in the past, it was because your java process was configured to set a \"dataDir\" system property explicitly when starting up the JVM, and for some reason when you upgraded to Solr 4.5 you changed something else so that this system proeprty is no longer defined.\n\n—\n\nTo verify that no pre 4.5 versions of Solr 4.x were defining an implicit \"${dataDir}\" variable, I created a minimal test solr-home (see attached zip) based on the solrconfig.xml that you provided and tested it with Solr 4.1, 4.2.1, and 4.4. In all cases i got the same error...\n\n\nSolrException: Could not load config for solrconfig.xml\n...\nCaused by: org.apache.solr.common.SolrException: No system property or default value specified for dataDir value:${dataDir}\n\n\n\nI strongly suggest you go double check how you had Solr configured before you upgraded to 4.5. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13803465",
            "date": "2013-10-23T22:28:21+0000",
            "content": "Resolving as a non-issue since the root cause seems to be user misunderstanding of how a feature previously worked.\n\nJuha: if you can provide a zip file with a set of reproducible configs that works correctly in a previous version of solr (please be explicit about which version of solr you test with) but does not work with Solr 4.5, then please re-open. "
        }
    ]
}