{
    "id": "SOLR-5810",
    "title": "State of external collections not displayed in cloud graph panel",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "components": [
            "Admin UI",
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "External collections (SOLR-5473) are not displayed in the Cloud -> graph panel, which makes it very hard to see which external collections have problems, such as after a downed node comes back online.",
    "attachments": {
        "SOLR-5810.prelim2.patch": "https://issues.apache.org/jira/secure/attachment/12650073/SOLR-5810.prelim2.patch",
        "SOLR-5810-prelim.patch": "https://issues.apache.org/jira/secure/attachment/12632746/SOLR-5810-prelim.patch",
        "SOLR-5810.patch": "https://issues.apache.org/jira/secure/attachment/12659820/SOLR-5810.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jessica Cheng Mallet",
            "id": "comment-13919691",
            "date": "2014-03-04T17:49:30+0000",
            "content": "Please make sure that when this is implemented, it is done in a scalable way with many collections (e.g. pagination, etc.). "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13919711",
            "date": "2014-03-04T18:01:59+0000",
            "content": "we should change the UI to just expand one collection at a time (irrespective of it is external or internal) "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-13920211",
            "date": "2014-03-04T23:33:41+0000",
            "content": "I thinking we need paging with adjustable page sizes (default 20). With paging, there's an explicit or implicit sort order; might be nice to sort collections by creation date, num docs, activity level <-\n{might be too slow to get this for many collections}\n besides name (default ordering)\n\nIt would also be nice to be able to filter by:\n+ name prefix matching (tj*)\n+ config name (to show me all the collections that use config xyz)\n+ activity level (to show my busiest collections in the past X time range)\n+ replica status (to show me all the collections that have replicas that are down | recovering | etc)\n+ by node (to show me all the collections that have replicas on a specific node in my cluster)\n+ creation date (to show me all the collections created since some date or before some other date) "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-13920403",
            "date": "2014-03-05T02:24:07+0000",
            "content": "This is preliminary patch to allow me to visualize external collections for testing SOLR-5473. It doesn't implement any paging or filtering as we really need for handling a large number of external collections. I'm simply posting it here for others helping out get support for external collections hardened. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13920565",
            "date": "2014-03-05T06:13:39+0000",
            "content": "The most important features as I see are \n\n\tpattern matching search e.g: *coll*1 which is case insensitive. The names are not in millions so we can do an O search. An auto complete type textbox should be fine. IntelliJ class lookup is a good example\n\tfilter to show recovering/healthy/down collections\n\n\n\nI don't really mind having a scrolling frame with all the names sorted alphabetically , as long as I can reach to  the collection easily with a search. A typical CRUD application is likely an overkill\n "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14029331",
            "date": "2014-06-12T16:29:43+0000",
            "content": "Still a work in progress, but basic paging support is in place with the option to apply a simple filter on the collection name (see screen shot for UI concept). The code in this patch depends on the code for SOLR-5473, so is not ready for general consumption yet. Posting now to get some feedback on the approach and UI code; server-side code should be close (except it needs a unit test).  "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14029346",
            "date": "2014-06-12T16:39:01+0000",
            "content": "can't get screen shot tool to work  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14084179",
            "date": "2014-08-04T00:25:29+0000",
            "content": "How is this going Timothy Potter? This seems like a critical part of SOLR-5473 , so I'd like to get them in together. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14084384",
            "date": "2014-08-04T07:12:28+0000",
            "content": "There are multiple parts to this ticket.\n\n\tGet all collections in the cloud panel\n\tDisplay collections in pages rather than one large single page\n\tAnd a way to 'search' for a particular collection\n\n\n\n\n#1 is a must for 5473 . I have tested the other two and they are working . Just not sure if the latest patch is attached with this jira "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14084746",
            "date": "2014-08-04T15:01:37+0000",
            "content": "I need to create an updated patch out of our internal repo where we originally developed this solution. I can get to this later today. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14084844",
            "date": "2014-08-04T16:22:54+0000",
            "content": "I'm coming late to the party, but wanted to point out this umbrella JIRA: https://issues.apache.org/jira/browse/SOLR-6082.\n\nThe current admin UI carries a bunch of historical design from a very long time ago. It seems to me that SolrCloud admin could be made much more user-friendly if we moved all the SolrCloud stuff to it's own page or something. Having a \"select core\" dropdown as a menu choice on a page that displays the state of your SolrCloud is...wrong.\n\nIdeally, I'd like to see all the nodes in my cluster (whether they hosted collections or not). I'd like to ctrl-click on some number of them and be able to create a collection on the selected nodes. I'd like to be able to ctrl-click on a node and add a replica on that node to a collection. I'd like to.... you get the idea. All without having to drop into the shell prompt and use command-line scripts. Or type in a collections API call. We have the infrastructure in place, much of this would be a UI for the Collections API.\n\nNote, I am not advocating we delay these issues waiting for some grand new design. Mostly I'm wondering if there's enough interest in this kind of thing to start designing a \"SolrCloud admin interface\". We can use SOLR-6082 as a basis for the discussion if so. "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14084879",
            "date": "2014-08-04T16:57:03+0000",
            "content": "Thanks for the pointer to SOLR-6082. Definitely interested in starting to design a SolrCloud admin interface. The work being done in this ticket is mainly for supporting 100's to 1000's of collections from the existing Cloud panel as without some basic nav controls, that panel is unusable when you have many collections. In other words, this will serve as an interim solution for users that have many collections as we work on the design and develop an overhauled SolrCloud Admin UI. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14085035",
            "date": "2014-08-04T18:21:18+0000",
            "content": "So is this only an issue if you have 100+ collections? If so, we should probably update the title / description to be more specific. "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14085045",
            "date": "2014-08-04T18:29:07+0000",
            "content": "No, the status and nav controls work no matter how many collections you have. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14085080",
            "date": "2014-08-04T18:46:27+0000",
            "content": "#1 is a must for 5473 .\n\nRight, I'm also only concerned about #1 for SOLR-5473, though I've got nothing against taking it all in if it's ready. "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14085800",
            "date": "2014-08-05T04:59:30+0000",
            "content": "Here's an updated patch that works with the latest patch for SOLR-5473 applied to trunk. \n\nOne thing that's easy to change is that I didn't activate the nav controls if you have less than 10 collections total. If we want the nav controls active all times, that's fine too, I just didn't want to introduce more complexity to the existing UI if it's not needed and I don't think you need paging or filtering if you only have 10 collections (one liner at ZookeeperInfoServlet line 257). "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14085801",
            "date": "2014-08-05T05:00:52+0000",
            "content": "Also, I had to clear cache to get the changes to the UI files to update (cloud.js / .css / .html) "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14086409",
            "date": "2014-08-05T15:51:39+0000",
            "content": "Hmmm, if I apply the patches for SOLR-5473 and this one to trunk, the second patch fails in ZookeeperInfoServlet.java. It doesn't matter whether I apply this patch first or the 5473 first. I used the patch for SOLR-5473 from 3-Aug.\n\nFWIW.. "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14091076",
            "date": "2014-08-08T18:16:46+0000",
            "content": "Updated patch that works with the patch I just updated for SOLR-5473.  "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14091087",
            "date": "2014-08-08T18:19:17+0000",
            "content": "Also, here is a link to a screen shot to the nav controls: http://www.dropmocks.com/mGlEAA\n\n(I still can't get the Jira screenshots feature to work for me)\n\nAdmittedly, the nav panel can be improved from an aesthetic perspective but the functionality should be good to go.  "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14131585",
            "date": "2014-09-12T14:11:19+0000",
            "content": "Commit 1624556 from Noble Paul in branch 'dev/trunk'\n[ https://svn.apache.org/r1624556 ]\n\nsplit clusterstate.json SOLR-5473, SOLR-5474, SOLR-5810 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14132117",
            "date": "2014-09-12T21:12:22+0000",
            "content": "Commit 1624650 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1624650 ]\n\nSOLR-5473, SOLR-5474, SOLR-5810 ... NO SVN KEYWORDS! ! ! "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14190377",
            "date": "2014-10-30T17:03:11+0000",
            "content": "What was committed is not correct, need to apply the latest patch I posted. Will get it fixed up by tomorrow. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14261580",
            "date": "2014-12-30T22:38:52+0000",
            "content": "Commit 1648621 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1648621 ]\n\nSOLR-5810: basic paged nav support for cloud graph panel for many collections. "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14261582",
            "date": "2014-12-30T22:40:31+0000",
            "content": "here's the updated patch (committed to trunk) which provides basic paged navigation controls for the cloud graph panel to support many collections. update includes re-establishing the watcher after a Zk session expiration using the OnReconnect interface "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14261626",
            "date": "2014-12-30T23:16:13+0000",
            "content": "Commit 1648630 from Timothy Potter in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1648630 ]\n\nSOLR-5810: backport to branch 5x "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14292201",
            "date": "2015-01-26T18:40:15+0000",
            "content": "I just started Solr using:\n\nbin/solr start -e cloud\n\nand the admin UI doesn't reflect any collection. I can see the core in the dropdown but not in the admin UI.\n\nNew collections are now external by default, so the new collection doesn't show up but then creating a new collection (with explicit stateFormat=2) brings up both the collections on the admin UI. "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14292216",
            "date": "2015-01-26T18:52:49+0000",
            "content": "I don't think this is UI code related ... the /clusterstate.json after running the solr -e cloud command doesn't look correct to me:\n\n\n{\"gettingstarted\":{\n    \"replicationFactor\":\"2\",\n    \"router\":{\"name\":\"compositeId\"},\n    \"maxShardsPerNode\":\"2\",\n    \"autoAddReplicas\":\"false\",\n    \"shards\":{\n      \"shard1\":{\n        \"range\":\"80000000-ffffffff\",\n        \"state\":\"active\",\n        \"replicas\":{}},\n      \"shard2\":{\n        \"range\":\"0-7fffffff\",\n        \"state\":\"active\",\n        \"replicas\":{}}}}}\n\n\n\nhere's the crazy thing ... if you run bin/solr create -c foo after starting up the example, then /clusterstate.json gets emptied {{ {} }} and the UI renders both collections correctly. So seems like some weird initial state related to stateFormat=2 "
        },
        {
            "author": "Timothy Potter",
            "id": "comment-14292491",
            "date": "2015-01-26T22:04:24+0000",
            "content": "This is not a UI issue, but a problem with stateFormat=2 in general, so I opened SOLR-7039 and this one can remain closed / fixed. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14332536",
            "date": "2015-02-23T05:00:33+0000",
            "content": "Bulk close after 5.0 release. "
        }
    ]
}