{
    "id": "SOLR-8328",
    "title": "This script requires extracting a WAR file with either the jar or unzip utility, please install these utilities or contact your administrator for assistance.",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3.1",
        "status": "Closed",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "Seeing the WAR error using solr 5.3.1 on CentOS 7 after fresh install.\n\nwget http://www.eu.apache.org/dist/lucene/solr/5.3.1/solr-5.3.1.tgz\ntar xzf solr-5.3.1.tgz solr-5.3.1/bin/install_solr_service.sh --strip-components=2\nudo chmod +x install_solr_service.sh\nsudo ./install_solr_service.sh solr-5.3.1.tgz",
    "attachments": {
        "SOLR-8328.patch": "https://issues.apache.org/jira/secure/attachment/12773596/SOLR-8328.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-20T21:13:33+0000",
            "author": "Shawn Heisey",
            "content": "Patch to fix this problem.  The jar/unzip check is no longer required, because the WAR file was removed entirely in 5.3. ",
            "id": "comment-15018803"
        },
        {
            "date": "2015-11-20T21:18:51+0000",
            "author": "James Sterling",
            "content": "Works after applying the patch to /opt/solr/bin/solr ",
            "id": "comment-15018822"
        },
        {
            "date": "2015-11-20T21:26:34+0000",
            "author": "Shawn Heisey",
            "content": "James Sterling, in case you don't know how to fix this before a new version is available with the change, there are three ways.  One is to install the \"unzip\" package.  Another is to install the \"devel\" package for your Java version (so the JDK is installed).  The last way is to edit the bin/solr script as shown in the patch that I have uploaded.\n\nOf the three ways to get an immediate fix, I would probably opt for installing the unzip package, because this is a very useful program to have. ",
            "id": "comment-15018837"
        },
        {
            "date": "2015-11-20T21:32:11+0000",
            "author": "Shawn Heisey",
            "content": "There's a patch, but the fix is not yet applied.  Resolving is premature. ",
            "id": "comment-15018851"
        },
        {
            "date": "2015-11-20T21:45:55+0000",
            "author": "Shawn Heisey",
            "content": "My patch was created on branch_5x.  When I tried to apply it to trunk, the CHANGES.txt update would not apply.  Comparing the trunk CHANGES with the 5x CHANGES, I can see a significant number of differences in the 5.4 section (and some sections further down), in addition to the obvious difference of having a 6.0 section that is not present in the latter.  It looks like most of the differences are issue numbers in different places and whitespace differences.\n\nThe way I am inclined to fix this is to make sure that the 5x CHANGES is correct, then simply replace everything after the 6.0 section with the contents of the 5x file. ",
            "id": "comment-15018867"
        },
        {
            "date": "2016-09-13T20:38:59+0000",
            "author": "Jan Høydahl",
            "content": "Not a problem anymore, seems to have been fixed in some other issue ",
            "id": "comment-15488350"
        }
    ]
}