{
    "id": "SOLR-5102",
    "title": "Simplify Solr Home",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I think for 5.0, we should re-think some of the variations we support around things like Solr Home, etc.  We have a fair bit of code, I suspect that could just go away if make it easier by assuming there is a single solr home where everything lives.  The notion of making that stuff configurable has outlived its usefulness",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-13729136",
            "date": "2013-08-05T06:25:50+0000",
            "content": "Some more info please..\n\nwhat is the objective?\n\nget rid of a configurable solr.home ?\n\n "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13729368",
            "date": "2013-08-05T10:37:05+0000",
            "content": "Yes.\n\nI don't see a need for it anymore.  Just download the tarball, cd into it and that's your home. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13729399",
            "date": "2013-08-05T11:19:02+0000",
            "content": "I don't see a need for it anymore. \n\nSo , the home will always be in the location where Solr is installed? Usually people insall Solr in one disk and the data may live in another disk. What is the recipe for that usecase? \n\n\n\nIn an unrelated point\n\nWhy don't we completely get rid of all the lib dir references and just hardcode solr.home/userlib to be the place to keep all external jars? Do we really need a per core lib dir at all? "
        },
        {
            "author": "Daniel Collins",
            "id": "comment-13729424",
            "date": "2013-08-05T11:50:08+0000",
            "content": "Maybe the more important question is \"what does solr.home mean and what should it contain?\"  If using Solr Cloud, then solr.home is just solr.xml, zoo.cfg, and directories containing core.properties files.  That is purely \"data\" and \"configuration\", so I'd agree with Noble Paul, I wouldn't want that to live alongside JARs or \"code\".  I know the distinctions as a web-app are not as clear, but treating Solr like an application (which we do), we like to keep a nice distinction between code and data and I think I would object to something that forced it all to live in one area.\n\nFor upgrades (assuming we migrate away from web-apps at some point), again it would be nice to keep the \"custom\" stuff, i.e. solr.xml, zoo.cfg and all my core configuration/data away from solr \"code\", so I could migrate between Solr versions for an upgrade path more cleanly. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13729434",
            "date": "2013-08-05T11:56:50+0000",
            "content": "Agree with you Daniel Collins .\n\nWe have 2 types of data (like most other systems) . config and the real data (index) .\n\n\nIn case of the data dir , how do I tell Solr to store it in a disk/location that is different? In case of SolrCloud , we don't have a lot of control over core creation "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13729452",
            "date": "2013-08-05T12:18:36+0000",
            "content": "Good points.  I think it is fine to keep data somewhere else (we have solr.data.dir for that).  My view is that SolrCloud will go away and it will just be Solr.  That is, there will be no need for the distinction.  If you want \"master/worker\", that's just 1 shard w/ multiple replicas.  Thus, all config. will live in some storage like ZK.\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13729457",
            "date": "2013-08-05T12:22:25+0000",
            "content": "My view is that SolrCloud will go away and it will just be Solr\n\nYes, it will . Are we planning to deprecate the legacy mode in 5.0? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13729564",
            "date": "2013-08-05T15:15:24+0000",
            "content": "I agree with the idea of separating code and data.  I have /opt/solr4, which has a subset of what you find in example from the binary download, and /index/solr4, which is my solr.solr.home.  /index is a separate filesystem.\n\nEveryone is talking about cloud mode being the only mode in a future major release, most likely 5.0.  If that happens, there's probably no reason to have instanceDir and dataDir be configurable separately.  There are possible terminology confusions with dataDir if we go from solr.solr.home to solr.data.dir.  I was going to suggest that we might want to drop the data subdirectory as well, but due to things like ExternalFileField, we might want to hold off on that decision until later.\n\nThinking further along in a \"break with legacy\" path, \"instanceDir\" may be a dead-end term too.  When multicore first became a reality, it was \"multiple Solr instances in one webapp.\"  I think it's grown beyond those roots. "
        }
    ]
}