{
    "id": "SOLR-6074",
    "title": "Field names with colons doesn't work on the query screen on the web UI",
    "details": {
        "affect_versions": "4.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "I was looking into a search not working from the frontend and I wanted to check on how the data was inserted. I was unable to run any proper query that provides useful results other than :.\n\nEven more, when I followed the links from the schema browser from the Top Results for the field I was interested in querying, I was redirected to the query and again no results although there's obviously some because they appear as top results on the search page.\n\nBy speaking with steffkes in #irc, he pointed out that the field name in question had a colon in its name, like:\n\n\"fieldname:name\"\n\nSo the search ended up being\n\nq=fieldname:name:DATA\n\nHe suggested to escape the colon as fieldname\\:name, but that made no difference.\n\nIn the end, there was a setting in the drupal plugin I am using (https://drupal.org/project/search_api_solr) that mentioned about cleaning the field ids to remove that colon in the field name, which I tried, and then I coiuld properly use the web ui to query results. New field name is fieldname$name.\n\nI quote a bit of the README from that module related to this:\n\n\"This will change the Solr field names used for all\n  fields whose Search API identifiers contain a colon (i.e., all nested fields)\n  to support some advanced functionality, like sorting by distance, for which\n  Solr is buggy when using field names with colons.\n\"",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13999809",
            "date": "2014-05-16T14:01:21+0000",
            "content": "There are still no well defined list of characters formally supported in field names. Normally you're advised to stick to a-z0-9 as well as underscore or dash, but it will most often work with a lot of strange chars, but you may see some components fail while other works.\n\nSome known limitation is e.g. spaces not allowed in function queries, and fields cannot start with \"-\" since that will be parsed as NOT in a query etc etc. I'm pretty sure that \":\" will cause trouble in far more places than the UI, so simply stay away from it.\n\nPerhaps this JIRA should result in an updated documentation on supported field name recommendation? "
        },
        {
            "author": "Ahmet Arslan",
            "id": "comment-14000537",
            "date": "2014-05-17T00:04:30+0000",
            "content": "Perhaps this JIRA should result in an updated documentation on supported field name recommendation?\n+1 This is really needed. Please see this : https://issues.apache.org/jira/browse/SOLR-6051 "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15413648",
            "date": "2016-08-09T14:48:29+0000",
            "content": "Documentation was updated to clarify fully supported field names as part of the SOLR-6051 "
        }
    ]
}