{
    "id": "SOLR-1406",
    "title": "Refactor FileDataSource and FileListEntityProcessor to be more extensible",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "FileDataSource should make openStream method protected so we can extend FileDataSource for other File types such as GZip, by controlling the underlying InputStreamReader implementation being returned.\n\nFileListEntityProcessor needs to aggregate a list of files that were processed and expose that list in an accessible way so that further processing on that file list can be done in the close method.  For example, deletion or archiving.\n\nAnother improvement would be that in the event of an indexing rollback event, processing of the close method either does not occur, or the close method is allowed access to that event, to prevent processing within the close method if necessary.",
    "attachments": {
        "ASF.LICENSE.NOT.GRANTED--image.gif": "https://issues.apache.org/jira/secure/attachment/12418808/ASF.LICENSE.NOT.GRANTED--image.gif",
        "SOLR-1406.patch": "https://issues.apache.org/jira/secure/attachment/12418445/SOLR-1406.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Luke Forehand",
            "id": "comment-12750707",
            "date": "2009-09-02T22:37:11+0000",
            "content": "Patch that adds getDataConfig to Context interface, and ContextImpl implementation.\n\ni.e.\n\npublic DataConfig getDataConfig() {\n    return this.dataImporter.getConfig();\n}\n\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12750826",
            "date": "2009-09-03T05:26:54+0000",
            "content": "It is easy to expose DataConfig object. But the problem is I will have less flexibility in changing that once it is exposed. So, which information do you require exactly? "
        },
        {
            "author": "Luke Forehand",
            "id": "comment-12751023",
            "date": "2009-09-03T13:44:45+0000",
            "content": "I am implementing EventListeners for both onImportStart and onImportEnd that will work with a custom GZipFileDataSource for indexing.  Upon import start I will calculate a file list using the baseDir attribute of the FileListEntityProcessor, putting that list in a session attribute with Global scope.  Upon import end I will iterate over this file list and archive/remove these specific files.  The purpose is that if other files are added to the baseDir during indexing, they won't be archived/removed by my onImportEnd event implementation and will be available for the next full indexing operation (which happens on a schedule).\n\n\n<dataConfig>\n  <dataSource name=\"myfilereader\" type=\"FileDataSource\"/>\n    <document>\n      <entity name=\"jc\" rootEntity=\"false\" dataSource=\"null\"\n        processor=\"FileListEntityProcessor\"\n        fileName=\"^.*\\.xml$\" recursive=\"true\"\n        baseDir=\"/usr/local/apache2/htdocs/imagery\">\n        ....\n    </entity>\n  </document>\n</dataConfig>\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12751122",
            "date": "2009-09-03T18:30:11+0000",
            "content": "Instead of exposing DataConfig, perhaps you can extend the FileListEntityProcessor and override close() and do these tasks there? Note that EntityProcessor#close() is introduced in Solr 1.4 "
        },
        {
            "author": "Luke Forehand",
            "id": "comment-12751587",
            "date": "2009-09-04T19:36:05+0000",
            "content": "I could extend FileListEntityProcessor if it was written in a more extensible way, for example, exposing it's baseUrl and fileName private members with accessor methods, and refactoring some of the private methods that do fileName filtering so that they are reusable and protected. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12751638",
            "date": "2009-09-04T22:06:28+0000",
            "content": "I could extend FileListEntityProcessor if it was written in a more extensible way, for example, exposing it's baseUrl and fileName private members with accessor methods, and refactoring some of the private methods that do fileName filtering so that they are reusable and protected.\n\nAh, I see. Well, that is easier than exposing DataConfig. DataConfig was never really meant to be exposed. We need to have another look at DataConfig before exposing making it a public API. How about you create an issue (or rename this one) to make FileListEntityProcessor more extensible rather than exposing DataConfig? We can get that in for 1.4. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12751837",
            "date": "2009-09-06T07:24:35+0000",
            "content": "\n\tMade FileDataSource and FileListEntityProcessor more extensible.\n\tI also found that biggerThan and smallerThan were two parameters in FileListEntityProcessor which were never being set. I've fixed that.\n\n\n\nI have not exposed FileListEntityProcessor's getFolderFiles method because I'd prefer to keep the implementation private for now so that we can change it in future without worrying about back-compat (see SOLR-1313). However, if one wants to know the file names being processed, one can override EntityProcessorBase#getNext.\n\nLuke, does this help in your use-case? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12752078",
            "date": "2009-09-07T10:22:05+0000",
            "content": "\n\tFixed logic of resolving variables in newerThan, olderThan, biggerThan and smallerThan\n\tAdded tests for biggerThan and smallerThan\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12752129",
            "date": "2009-09-07T13:13:41+0000",
            "content": "Committed revision 812122.\n\nThanks Luke! "
        },
        {
            "author": "Luke Forehand",
            "id": "comment-12752148",
            "date": "2009-09-07T14:16:00+0000",
            "content": "I believe this does help me a lot, thanks for your time!\n\nLuke Forehand\nCore Development\nNetworked Insights, Inc. <http://www.networkedinsights.com/> "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775488",
            "date": "2009-11-10T15:50:37+0000",
            "content": "Bulk close Solr 1.4 issues "
        }
    ]
}