{
    "id": "SOLR-1272",
    "title": "Java Replication does not log actions",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Java Replication actions are not logged. There is no trail of full and partial replications.\n\nAll full and partial replications, failed replications, and communication failures should be logged in solr/logs/ the way that the script replication system logs activity.\n\nThis is a basic requirement for production use. If such a log does exist, please document it on the wiki.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12730267",
            "date": "2009-07-13T09:18:03+0000",
            "content": "Java replication currently logs it's actions quite extensively. It goes into the main log  now. But, the logging properties can be configured to make this log go into a separate file "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12732340",
            "date": "2009-07-17T04:49:51+0000",
            "content": "is this a bug? should we close it? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12732506",
            "date": "2009-07-17T12:46:05+0000",
            "content": "Lance, have you checked that this is actually not adequately logging? Sounds like Noble says it is?\n\nIf it is, do we need to call it out on the wiki? I think its just expected that everything should log appropriately... "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12732712",
            "date": "2009-07-17T20:02:29+0000",
            "content": "I conflated source code logging and production monitoring logging, which are different use cases. The Java Replication code has logging appropriate for a code base. Some things are 'info', some are 'warn', and some are 'error'.  \n\nIn auto-polling mode, the client does not create a monitoring log. In production I would drive the polling from external scripting and maintain my own log & error notification (emails/pages to the operator) so that is not really a big problem.\n\nMy original use case, more clarified, was: if I configure logging to send all ReplicationHandler logger calls to a separate file, can I monitor that file as a production site operator? Can I use it to debug all problems? Now that I look at the logging code & messages I would have to say no. But I have not done this experiment.\n\nI predict that \"how to monitor & troubleshoot production replication\" will appear every three days on the solr-user list. I would say close this issue and wait.\n\nLance "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12732845",
            "date": "2009-07-18T05:39:01+0000",
            "content": "look at the HTTP API with the command=details. This carries a lot of information. BTW this can be enhanced to add more details.  "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12735931",
            "date": "2009-07-28T05:12:00+0000",
            "content": "we can re-open if this indeed turns out to be a requirement from users "
        }
    ]
}