{
    "id": "SOLR-6933",
    "title": "bin/solr script should just have a single create action that creates a core or collection depending on the mode solr is running in",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "instead of create_core and create_collection, just have create that creates a core or a collection based on which mode Solr is running in.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-01-08T18:07:42+0000",
            "author": "Hoss Man",
            "content": "instead of create_core and create_collection...\n\ni would strongly suggest leving both of those commands alone, and instead adding a new \"create\" that delegates to them as needed. ",
            "id": "comment-14269777"
        },
        {
            "date": "2015-01-08T18:37:39+0000",
            "author": "Timothy Potter",
            "content": "leving both of those commands alone\n+1\n\nSo a couple of basic questions shake out of this. First, what does the usage (bin/solr create -help) say? Options like -shards, -maxShardsPerNode, -replicationFactor don't apply when creating a core. I think the help should be explicit about cores vs. collections. Second, if the user tries to pass one of the collection specific options (say -shards 10) when Solr is running on cloud mode, I think the script should error out and tell the user that option is only when running in cloud mode. So if you're with me so far, then take a step back, now the 2-modes of Solr are still very much in the forefront of the experience around bin/solr create, which isn't all that different from what we have now with create_core and create_collection, except for the most basic usage of that action, ie.\n\nbin/solr create -n foo\n\n\n\nSo if we think there's real benefit to having a \"create\" alias that's smart about the mode Solr is in, then I'll add it. But I still think the cores vs. collections problem doesn't go away with this create action.\n ",
            "id": "comment-14269832"
        },
        {
            "date": "2015-01-09T03:09:04+0000",
            "author": "Grant Ingersoll",
            "content": "and instead adding a new \"create\" that delegates to them as needed.\n\n+1\n\nFirst, what does the usage (bin/solr create -help) say? Options like -shards, -maxShardsPerNode, -replicationFactor don't apply when creating a core. \n\nIf we are just delegating, than can we delegate to the underlying help too?\n\nI think the script should error out and tell the user that option is only when running in cloud mode.\n\n +1\n\nSo if we think there's real benefit to having a \"create\" alias \n\n+1 ",
            "id": "comment-14270479"
        },
        {
            "date": "2015-01-12T23:33:38+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1651231 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1651231 ]\n\nSOLR-6952: bin/solr create action should copy configset directory instead of reusing an existing configset in ZooKeeper by default; commit also includes fix for SOLR-6933 - create alias ",
            "id": "comment-14274398"
        },
        {
            "date": "2015-01-12T23:40:50+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1651233 from Timothy Potter in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1651233 ]\n\nSOLR-6952: bin/solr create action should copy configset directory instead of reusing an existing configset in ZooKeeper by default; commit also includes fix for SOLR-6933 - create alias ",
            "id": "comment-14274415"
        },
        {
            "date": "2015-01-13T18:17:33+0000",
            "author": "Timothy Potter",
            "content": "Resolved by fix committed for SOLR-6952 ",
            "id": "comment-14275645"
        }
    ]
}