{
    "id": "SOLR-4654",
    "title": "Integrate Lucene's sorting and early query termination capabilities into Solr",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "I think there would be some interesting work to do to integrate Lucene's sorting and early query termination capabilities into Solr, in particular (just ideas, maybe they're not all interesting/useful):\n\n\tconfiguring a SortingMergePolicy,\n\tfiguring out when the sort order of queries matches the sort order of the index segments,\n\tgiving the ability to get approximated results when the query is not sorted but only boosted by the sort order of the index,\n\tintegration with TimeLimitingCollector: maybe it's better to collect only half of all segments than to fully collect half of the segments,\n\tapproximation of the number of matches based on the ratio of collected documents,\n\t...",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Christine Poerschke",
            "id": "comment-13901518",
            "date": "2014-02-14T14:58:50+0000",
            "content": "Hi. Just raised https://issues.apache.org/jira/i#browse/SOLR-5730 which overlaps with the first 2 ideas here. "
        },
        {
            "author": "Furkan KAMACI",
            "id": "comment-13924081",
            "date": "2014-03-07T17:25:42+0000",
            "content": "I am volunteer to work on this issue as a part of GSOC 14. "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-15117764",
            "date": "2016-01-26T19:06:07+0000",
            "content": "ticket cross-reference: SOLR-5730 overlaps with the first 2 ideas of this ticket and it is taking shape. Comments, reviews, etc. from anyone subscribed to this (SOLR-4654) ticket here but not subscribed to SOLR-5730 (yet) welcome as usual. Thank you. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-16187509",
            "date": "2017-10-01T19:43:23+0000",
            "content": "Christine Poerschke Can we close this or are there still parts undone? "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-16197349",
            "date": "2017-10-09T17:28:19+0000",
            "content": "Closing this out as partly (ideas 1 and 2) done in SOLR-5730 and if/when we wish to pursue the other ideas then separate new issues could be opened for those. "
        }
    ]
}