{
    "id": "SOLR-809",
    "title": "synonyms are matched case-insensitive but inserted as case-sensitive",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "I had a synonyms file with this line\n\n  2, to, two, too, II\n\n(that's a capital ii last in the list)\n\nand an index with\n\n      <filter class=\"solr.LowerCaseFilterFactory\"/>\n      <filter class=\"solr.SynonymFilterFactory\" synonyms=\"synonyms.txt\" ignoreCase=\"true\" expand=\"true\"/>\n\nin that order.  a query for 'This II That' failed to match the same text in the index because the synonym filter appears to have expanded the (now) lowercase\n\n  this ii that\n\nto\n\n  this 2 to two too II that\n\nand then the (also) lowercased query failed to match.\n\nso it seems that synonym expansion is matching  tokens in a case-insensitive manner when it probably shouldn't.  or it could dwim but re-add in the original token instead of the matched one, but that's a bit more roundabout.\n\nI just made sure my entire synonyms file was lowercase.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12641664",
            "date": "2008-10-21T23:43:55+0000",
            "content": "I'm resolving this as Cannot Reproduce because it doesn't seem like there is enough information to really have a sense of what's happening, and whether it's a bug or a misunderstanding on the users part about how SynonymFilterFactory works.\n\nIn particular, we don't know what the full analysis chain of either the index or query analyzers wre.\n\nGeoffrey: I would suggest starting a thread about this on the solr-user list, describing in more detail what your configs look like and see if someone can help make sense of the behavior you are seeing.  Then we can reopen if/when we identify that there really is a bug. "
        }
    ]
}