{
    "id": "SOLR-5742",
    "title": "XSS vulnerability in Solr /admin/debug.jsp",
    "details": {
        "affect_versions": "1.4.1,                                            3.6.2",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The debug.jsp file included in the example deployment package for versions 1.4.1 and 3.6.2 contains a reflected cross-site scripting vulnerability in the \"handler\" URL parameter.\n\nE.g. http://exampleserver:8983/solr/admin/debug.jsp?handler=<script>alert(1);</script>\n\nThis file appears to have either been removed or disabled with the 4.x releases.\n\nUnlike SOLR-4305, this is triggered immediately on page load and doesn't have to be triggered as a JavaScript event-handler.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13909709",
            "date": "2014-02-23T08:09:16+0000",
            "content": "Thank you for your bug report.\n\nIf Solr is used as recommended, known and unknown security bugs are very difficult to exploit.  Solr should not be exposed to anyone you cannot fully trust, especially the Internet.\n\nAs you may already know, the admin UI was entirely rewritten for 4.x.  In 1.x and 3.x, the UI used Java Server Pages, so each page in the UI has a .jsp extension.  The JSP code runs on the server side.\n\nIn 4.x, the UI is written in javascript and runs almost entirely in the browser, rather than the server.  All JSP code has been removed from Solr, and the example jetty does not even include the JSP module.\n\nSolr 1.4.1 is the last 1.x version, there will not be another release.  Solr 3.x is in maintenance mode.  This means that only fixes for severe bugs will be committed to that code branch.  Committers are focused on new development for 4.x and trunk, with very little time to work on code that's over a year old and has not given any sign of show-stopper bugs.\n\nSo far there are no major Linux distributions that have packages for Solr 4.x, so version 3.6.x is still used quite a bit.  Every now and then I even hear from someone who's still using 1.4.1.\n\nThere have already been a number of security fixes applied to the 3.6 code branch, but there has not been any strong motivation to release 3.6.3, especially since upgrading to 4.x is likely to eliminate the problem. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13909720",
            "date": "2014-02-23T09:14:40+0000",
            "content": "Hi this old vulnerability in early Solr versions is already known. There are no plans to release a new 3.6 version.\n\nNevertheless, please report such issues only to security@apache.org. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14341650",
            "date": "2015-02-28T17:01:56+0000",
            "content": "Close as WillNotFix? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14341818",
            "date": "2015-02-28T22:57:38+0000",
            "content": "Now that branch_5x is the stable branch, 4.x moves to maintenance mode ... and I think this means that earlier releases are completely dead.  For the active Linux distributions that are still packaging 3.6.2 ... this bug in an unsupported release is a good reason for them to move into the modern era.\n\nIf somebody with a real need to fix this bug wants to provide a fix, we can probably commit it to the 3.6 branch, though I doubt there will ever be a 3.6.3 release. "
        }
    ]
}