{
    "id": "SOLR-9665",
    "title": "Facet Values Sort Order: Add 3rd choice: Numeric Sort",
    "details": {
        "components": [
            "faceting"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "As a person, I need facet values to be in predictable, intuitive spots so that I can quickly and easily find the values that are appropriate to me.\n\nProblem Statement: Today Solr has two default facet sort orders, neither of which provides predictable, intuitive facet value orders for people when the values start with numbers.  \n\nGoal: Address the problem where index sorts facet values how a computer would rather than how a human would.  This is very problematic for E-commerce facets like 'size' and 'tire width'\n\nAcceptance Criteria:\n1. Sorts facet values numerically from lowest to highest\n2. Works with both numeric and string fields (thus working on values that include letters... 25 mm, 30 waist, 32 Waist, 4 Petite)\n3. If facet values don't start with a number, they are sorted alphabetically, after all values that do start with a number\n4. If facet values are equal numerically, sort the numerically equal values alphabetically. Example: 10,10 Petite,10 Tall,12, Petite, 12 Tall\n5. Integers and Floats are supported (even if string field)\n\nExamples:\nWomen's Pants Sizes:\n8\n8 Tall\n10\n10 Petite\n10 Tall\n12\n12 Tall\n14 Petite\n26 Waist\n28 Waist\n30 Waist\nOne Size\n\nBike Wheel Sizes:\n20 Inches\n24 Inches\n26 Inches\n27 Inches\n27.5 Inches\n27.5+ Inches\n29 Inches\n650c\n700c",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-19T21:36:47+0000",
            "author": "Shawn Heisey",
            "content": "How do you propose deciding between numeric and alpha sorting?  Although Solr does have explicitly numeric field types, I don't know whether the information about field type is available to the facet code.  Also, numbers might be stored in a string field rather than a numeric field, and if the field type makes the decision, those would sort incorrectly.  I think the only logical solution is separate sort options for numeric and alpha, so the admin can decide at query time.  I don't think it would work right if there was only one additional option.\n\nI'm sure that the current sort is just a simple Java sort function, unaware of different character sets, capitalization, etc. For best support along the lines you have mentioned, I think it might need to be fully aware of Unicode.\n\nI'm not trying to discourage the idea, just clarify what's actually needed to implement it. ",
            "id": "comment-15589941"
        },
        {
            "date": "2016-10-19T22:51:44+0000",
            "author": "Luke P Warwick",
            "content": "Thanks Shawn. I think I need to split this into two stories.  This one will just become adding a third facet sort option: Numeric. I'll move the Capitalization issue into a separate story (maybe a bug). I can't imagine that current is the desired behavior. ",
            "id": "comment-15590110"
        },
        {
            "date": "2016-10-20T13:30:13+0000",
            "author": "David Smiley",
            "content": "Can you use Solr's EnumField?  If so; that'd do it.  But it's a solution that requires declaring manually up front what the values are – it's not dynamic/automatic. ",
            "id": "comment-15591819"
        },
        {
            "date": "2016-10-20T15:23:45+0000",
            "author": "Luke P Warwick",
            "content": "The desire is to have dynamic ordering since the values are dynamic. The examples I gave were just small subsets of much larger lists of values.  Attributes like Size and Brand can actually have 100s or even 1000s of values and there are always new values being added (and old values dropping off) so manually maintaining a list would be very cumbersome.\n\nFor smaller,fixed lists the EnumField probably will work though. Thanks David. ",
            "id": "comment-15592120"
        },
        {
            "date": "2016-10-31T20:22:32+0000",
            "author": "Luke P Warwick",
            "content": "another example: We have a facet who's values go from the 70's to the 120s (width of skis).  The values end up looking like this:\n\nBrake Width (mm)\n100 (7)\n110 (9)\n115 (6)\n120 (3)\n74 (2)\n80 (1)\n85 (1)\n90 (9)\n93 (1)\n95 (1)\n\nFacets like this EnumField doesn't work well on since the values aren't always static and EnumField requires that.   ",
            "id": "comment-15623297"
        },
        {
            "date": "2016-10-31T21:22:47+0000",
            "author": "David Smiley",
            "content": "If the field is numeric (not a String that happens to contain a number), then the \"JSON Facet API\" will interpret the \"index\" sort order as the numeric sort of the field value.  I just verified it worked:\n\nhttp://localhost:8983/solr/techproducts/select?json.facet.price.terms.field=price&json.facet.price.terms.sort=index&indent=on&q=*:*&rows=1&wt=json\n\n(in that example, it's a coincidence of the example data that it's the same as count order)\n\nDocs: https://cwiki.apache.org/confluence/display/solr/Faceted+Search\n\np.s. yes it's a shame we have multiple faceting modules, which is confusing to users.  In time I hope JSON Facet API takes over. ",
            "id": "comment-15623462"
        }
    ]
}