{
    "id": "SOLR-11574",
    "title": "Extract more ref-guide Java snippets for building",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "master (8.0)",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "As a part of SOLR-11032, all of the Java snippets in the \"Using SolrJ\" ref-guide page were pulled out into separate unit-tests that are built and run as part of the normal Solr build.  These snippets appear unchanged in the ref-guide, but are now forcibly kept up-to-date by the build.\n\nIt would be nice to expand this enforcement to other ref-guide pages that contain Java snippets.\n\nThe command grep -rIl \"source,java\" solr/solr-ref-guide/src shows all of the ref-guide pages that contain Java snippets.  Currently, the list looks like:\n\n\n./parallel-sql-interface.adoc\n./pagination-of-results.adoc\n./the-terms-component.adoc\n./enabling-ssl.adoc\n./transforming-result-documents.adoc\n./uploading-data-with-solr-cell-using-apache-tika.adoc\n./language-analysis.adoc\n./kerberos-authentication-plugin.adoc\n./stream-decorator-reference.adoc\n./streaming-expressions.adoc\n./ping.adoc\n./basic-authentication-plugin.adoc \n\n\n\nThis JIRA involves going through the Java snippets in the files listed above and determining whether the snippet is a reasonable candidate for extraction.  Maybe very few of these snippets make sense for extraction, but it's a worthwhile investigation.",
    "attachments": {
        "SOLR-11574.patch": "https://issues.apache.org/jira/secure/attachment/12903843/SOLR-11574.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-12-28T00:01:15+0000",
            "content": "I'm going to be unavailable for a couple weeks for medical reasons, and wanted to upload my progress on this in case anyone else is interested in moving it forward (or giving feedback for when I return).\n\nTo summarize the patch, I've extracted Java snippets from parallel-sql-interface.adoc. pagination-of-results.adoc, the-terms-component.adoc, and uploading-data-with-solr-cell-using-apache-tika.adoc.  The other files remain to be done, though there are some that might not benefit from extraction.  (Will expand on this in a follow up comment when I have a few more minutes) ",
            "author": "Jason Gerlowski",
            "id": "comment-16304880"
        }
    ]
}