{
    "id": "SOLR-5342",
    "title": "In some places, when a caught exception is re-thrown, the original exception is not included",
    "details": {
        "affect_versions": "4.5",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "ShardHandlerFactory#newInstance catches exceptions and rethrows them.  It was including the message from the caught exception, but not including the actual exception.  This made it difficult to figure out the root cause for an SSL initialization error.\n\nWhile fixing this, I discovered other places that are missing this as well.  Some of them I elected not to fix, either because it's catching IOException (which normally provides good messages), or because it was in a location that might get called frequently, which would greatly increase logging output.",
    "attachments": {
        "SOLR-5342.patch": "https://issues.apache.org/jira/secure/attachment/12608193/SOLR-5342.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13793591",
            "date": "2013-10-13T08:12:34+0000",
            "content": "Patch fixing a few instances of the problem.  The CHANGES entry is in 4.5.1, but can be moved if this won't be backported. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13793592",
            "date": "2013-10-13T08:17:05+0000",
            "content": "I feel that the change to ShardHandlerFactory is necessary, but if anyone has good reason to not make the change in other classes, please let me know.\n\nA similar issue might need to be filed in LUCENE, because I did find some similar stuff there.  If nobody else does so, I will go ahead and do it when it's not 2 in the morning.  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13793665",
            "date": "2013-10-13T14:25:46+0000",
            "content": "\nWhile fixing this, I discovered other places that are missing this as well. Some of them I elected not to fix, either because it's catching IOException (which normally provides good messages), or because it was in a location that might get called frequently, which would greatly increase logging output.\n\nIf you won't fix these, I will find them all and fix them myself. It does not matter if the message is good and logging does not matter either: hiding stacktraces is seriously wrong. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13793684",
            "date": "2013-10-13T15:33:58+0000",
            "content": "I can do it, I just wasn't sure whether I should.  My search method was to use Eclipse to locate usages of Throwable.getMessage().\n\nI saw cases where getMessage() is used to construct logging messages, but the actual exception was not included in the logger call.  I also did not touch any test code.  I'll put together a patch that changes every instance I can find, and then we can discuss whether any need to be reverted. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13793711",
            "date": "2013-10-13T17:06:20+0000",
            "content": "New patch.  I went a little nuts and did lucene as well, so this issue (and the CHANGES mod) might need to move to lucene.\n\nQuestionable changes, due to verbosity of output:\n\norg.apache.lucene.benchmark.byTask.feedsTrecContentSource#openNextFile\norg.apache.lucene.demo.IndexFiles#main\nvarious places in org.apache.solr.util.SimplePostTool\n\nPlaces where I wasn't sure what change to make or whether any change was needed:\n\norg.apache.lucene.index.TestDirectoryReaderReopen, line 322\norg.apache.solr.cloud.OverSeerCollectionProcessor, line 1141\norg.apache.solr.handler.TestReplicationHandler, lines 1330, 1370\norg.apache.solr.servlet.ResponseUtils, line 47\n\nOther stuff noticed along the way:\n\nDead code: org.apache.lucene.index.TestTransactions, line 197 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13793855",
            "date": "2013-10-14T00:06:45+0000",
            "content": "Nice work Shawn! The one change I'd make personally is where you print the stack trace before the summarized printout - I'd prefer to see the summary logging first, than the detailed stack trace. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13796366",
            "date": "2013-10-16T03:09:49+0000",
            "content": "Patch updated with Mark's recommendations.  Should I move this to the LUCENE project?  I figure it needs mention in both CHANGES.txt files. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13970952",
            "date": "2014-04-16T12:56:43+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}