{
    "id": "SOLR-8791",
    "title": "ManagedIndexSchema has race of schemaZkVersion causing BadVersionException",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I started SolrCloud using a single node, 2 shard, 2 replica per shard setup with the data driven schema config.  I used bin/solr start -c -e cloud to do this, although I got the same ultimate problem when doing the setup more manually.  Then I used curl to POST a large CSV file of data.  At the end, I looked in my logs and I saw this:\n\n\n465889 INFO  (qtp680576081-45) [c:geonames s:shard1 r:core_node4 x:geonames_shard1_replica2] o.a.s.s.ManagedIndexSchema Persisted managed schema version 1 at /configs/data_driven_schema_configs/managed-schema\n465889 ERROR (qtp680576081-15) [c:geonames s:shard2 r:core_node3 x:geonames_shard2_replica2] o.a.s.s.ManagedIndexSchema Bad version when trying to persist schema using 0 due to: org.apache.zookeeper.KeeperException$BadVersionException: KeeperErrorCode = BadVersion for /configs/data_driven_schema_configs/managed-schema\n\n\n\nWhen viewing my logs in the admin UI, I actually saw the error message around ~5 times or so in a row, some from the very same replica.\n\ndisclaimer: I'm using the latest 7.0 snapshot master branch with some patches that appear innocently unrelated to this",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-05T04:58:53+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "This is expected. Two different shards try to update the schema based on the document they get from the client. Only one will succeed and the other's attempt to compare-and-set will fail with BadVersionException. In such case, it will fetch the schema again from ZK and try again. Now if you ever see a shard/replica stuck in a BadVersionException loop then it'd be a bug for sure. ",
            "id": "comment-15181519"
        },
        {
            "date": "2016-03-05T05:05:05+0000",
            "author": "David Smiley",
            "content": "Ok; I can see that.  Maybe we can have a better error?  And maybe it could be detected that the final schema is what the client was trying to update it to so no need for an error or warning?  Granted maybe that wouldn't be worth the trouble? ",
            "id": "comment-15181521"
        },
        {
            "date": "2016-03-05T05:39:19+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Yeah it's not something which should alarm a user. It can be changed to a warning at least. Detection may be tricky though. Go ahead and improve as you see fit. ",
            "id": "comment-15181539"
        },
        {
            "date": "2016-09-29T18:11:10+0000",
            "author": "Cassandra Targett",
            "content": "Changing issue type to Improvement since it's as designed, but could be improved. ",
            "id": "comment-15533560"
        }
    ]
}