{
    "id": "SOLR-5104",
    "title": "Remove Default Core",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "6.0"
        ],
        "components": [],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I see no reason to maintain the notion of a default Core/Collection.  We can either default to Collection1, or just simply create a core on the fly based on the client's request.  Thus, all APIs that are accessing a core would require the core to be in the address path.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13726483",
            "date": "2013-08-01T14:40:34+0000",
            "content": "Minor procedural nit... If you intend to \"remove\" a feature, deprecate it first (like, in 4.5.) Thanks! "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13726495",
            "date": "2013-08-01T14:57:21+0000",
            "content": "I see no reason to maintain the notion of a default Core/Collection.\n\nOkay, here is the reason...\n\nIt is a great convenience and shortens URLs to make them more readable and easier to type.\n\nIt greatly facilitates prototyping and experimentation and learning of the basics of Solr.\n\nAnd... compatibility with existing apps.\n\nSo, this notion that there isn't any \"reason\" is complete nonsense.\n\nOTOH, maybe you are trying to suggest that there is some reason or valuable benefit to be gained by requiring explicit collection/core name in the URL path. But, you have not done so. Not a hint of any reason or benefit. So, if you do have a reason or perceived benefit for eliminating a great convenience feature, please disclose it.\n\nOr... is this not so much an issue of \"reason\" as because some code or tool change you are contemplating does not support the kind of flexible URL syntax that Solr supports? Well, if the benefits of the change in technology outweigh the loss of a valuable feature, then that is worth considering, but as of this moment no positive tradeoff has been proposed or established.\n\nOTOH, if there were a determined effort to give Solr a full-blown true REST API and THAT was the motive for explicit collection name, I'd be 100% all for it.\n\nSide note: Maybe \"collection1\" should become \"example\" to make it clear that real apps should assign an app-meaningful name rather than leaving it as \"collection1\". "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13726503",
            "date": "2013-08-01T15:09:33+0000",
            "content": "My reason is b/c SolrDispatchFilter is filled with legacy cruft, this being one of them.  The simpler and more standard we can make all path handling, the better.  I don't really care much about shorter URLs and I don't buy the prototyping/learning factor.  In fact, I'd argue that it is harder b/c of it, since you have a \"magic\" core and than all of your other cores.  If you just make the name of the collection part of the path always, there is no more guessing.  \n\nThe less legacy code for \"plumbing\" we carry forward in 5, the better off Solr we will be. \n\nAnd yes, I am working on making the possibility of a full blown REST API.  See SOLR-5091.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13727053",
            "date": "2013-08-01T23:14:32+0000",
            "content": "We certainly want to do this, and I don't consider it removing a feature. It's purely an improvement IMO. The main reason I have not pushed for it yet was that the it killed the admin UI - but now that that is fixed, this is the next step.\n\nThis is a relic from the pre multi core days - when Solr was one index and that is it. Backcompat sludge is what has kept it around IMO - we want to act like most systems and start empty. It should be very simple for a user to create his first collection, but he should be the one to name it. As Grant mentions, this is certainly what you want for scriptibility, and it's more consistent with other systems for users as well.\n\nA new user should:\n\n1. Start Solr\n2. Name and create their first collection.\n\nWhen they want more collections, repeat step 2, a step they learned right away. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13727060",
            "date": "2013-08-01T23:19:29+0000",
            "content": "Took me a moment for me to realize that is not referring to removing the core that ships with Solr, but the default core feature. I want to remove the actual default core that is setup, so certainly +1 on dropping this. I think we already discussed it some for 5.0. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13727423",
            "date": "2013-08-02T06:55:52+0000",
            "content": "+1 to removing default core.   "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13752506",
            "date": "2013-08-28T15:29:13+0000",
            "content": "Just noticed this dupes SOLR-4804: remove support for \"defaultCore\" and \"DEFAULT_DEFAULT_CORE_NAME\" in solr 5.x "
        }
    ]
}