{
    "id": "SOLR-7812",
    "title": "Need a playground to quickly test analyzer stacks",
    "details": {
        "components": [
            "Schema and Analysis"
        ],
        "type": "Wish",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "(from email by Robert Oschler)\n\n(Would be useful to have)... a convenient \"playground\" for testing index and query filters?\n\nI'm  imagining a utility where you can select a set of index and query\nfilters, and then enter  a string as a test \"document\" and a query string\nand see what kind of scores come back during a matching attempt.  This\nwould be a big aid in crafting an indexing/query scheme to get the desired\nmatching profile working.  Otherwise the only technique I can think of is\nto iteratively modify the schema file and retest with the admin panel with\neach combination of filters.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-18T13:49:48+0000",
            "author": "Alexandre Rafalovitch",
            "content": "The purpose of this issue is to collect votes as an indication of the idea's importance. The end result may or may not be within Solr. ",
            "id": "comment-14632434"
        },
        {
            "date": "2015-07-20T21:14:50+0000",
            "author": "Hoss Man",
            "content": "this is already mostly possible with the ManagedSchema and Schema API – there's just no slick UI around it.\n\n\n\tcreate a collection for doing experiments in\n\titerate over...\n\t\n\t\tuse the Schema API to (re)define a field type with the index/query analyzers you want to experiment with\n\t\titerate over...\n\t\t\n\t\t\tuse the Analysis handlers to sanity check that various inputs behave the way you think they should\n\t\t\n\t\t\n\t\tindex some test documents\n\t\titerate over...\n\t\t\n\t\t\texecute various queries to see what results you get and if you are happy\n\t\t\n\t\t\n\t\tdelete all docs\n\t\n\t\n\tdelete the experiment collection\n\n ",
            "id": "comment-14634092"
        },
        {
            "date": "2015-07-20T22:55:06+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Well, that was possible with static schema too, really. Just rewrite the file, reload the core.\n\nThe issue is making user-friendly UI. Which means:\n*) Having a list of all possible analytizers\n*) Having all their various options described/self-described\n*) Running the same query through several stacks at once\n\nOtherwise, it is not a playground but a slog. Hence a question of whether it is worth the effort to do that. ",
            "id": "comment-14634224"
        }
    ]
}