{
    "id": "SOLR-1319",
    "title": "Upgrade custom Solr Highlighter classes to new Lucene Highlighter API",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "highlighter"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "",
    "attachments": {
        "SOLR-1319.patch": "https://issues.apache.org/jira/secure/attachment/12421231/SOLR-1319.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12738978",
            "date": "2009-08-04T13:59:24+0000",
            "content": "the regex fragementer has to be updated (got a patch for that) and some work has to be done now that SpanScorer is gone, and the semantics/syntax for it is a bit different.\n\nProb makes sense to do SOLR-1221 with this one. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12740177",
            "date": "2009-08-06T18:05:18+0000",
            "content": "Bah - I really gave myself a headache here. Lucene Highlighter broke back compat - which ripples here a bit. I think the impact can be mitigated if we switch to using the PhraseHighlighter by default (SOLR-1221) though. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12740204",
            "date": "2009-08-06T19:02:35+0000",
            "content": "We should probably be careful here in the future, and document anything thats based on code in Lucene without a backcompat policy to have similar looseness in Solr - or hide the Lucene implementation from the Solr public API's.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12749163",
            "date": "2009-08-29T16:37:39+0000",
            "content": "The break is that \n\nprotected QueryTermScorer getQueryScorer(Query query, String fieldName, SolrQueryRequest request) \n\n now has a different return type. Its too bad it wasnt done the same way as the SpanScorer - there you can just override the getSpanHighlighter call, but getting the Scorer is private.\n\nSo its a break, though no one was overriding it likely - we should almost make it private - you can anything you need to overriding the getHighlighter call. At least, I should have changed it to just Scorer rather than QueryTermScorer. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12753701",
            "date": "2009-09-10T16:52:09+0000",
            "content": "Given there is no patch,  should this be pushed to 1.5? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12759988",
            "date": "2009-09-27T04:56:04+0000",
            "content": "Given there is no patch, should this be pushed to 1.5?\n\nNope, the actual work was part of another issue - the only reason this is still open was because there was a back compat break (due to a back compat break in Lucene's Highlighter, which doesn't promise back compat). So this is open as a marker to somehow deal with the break in Solr - \n\nOur options are fairly limited - basically, I think it means adding a notice in Changes about the whole affair. I'll try and work something up. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12761946",
            "date": "2009-10-03T19:35:36+0000",
            "content": "if I'm reading this correctly, the back compat break is for those providing their own custom highlighter?  That's gotta be almost no one... doesn't seem like a big deal as it seems more like internal implementation than interface. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12761949",
            "date": "2009-10-03T20:00:16+0000",
            "content": "Right - I don't think its a big deal either. But the Highlighter framework has things like protected methods that are not overridden internally - seems to suggest that users could/might override them - whether we know they do or not, I think thats worth a mention in Changes on the break. Certainly easy enough to do anyway.\n\nThe break itself is even less likely to be an issue than a custom highlighter in general - I like the completeness myself though. Its an extendable public class and Solr allows for plugins. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12762030",
            "date": "2009-10-04T16:00:26+0000",
            "content": "Well, I've got a patch for this:\n\nChanges entry and some cleanup around the break\n\nBut currently JIRA is completely whacked - so I'll attach when its back. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775820",
            "date": "2009-11-10T15:52:11+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}