{
    "id": "SOLR-937",
    "title": "Highlighting problem related to stemming",
    "details": {
        "affect_versions": "1.3",
        "status": "Reopened",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Using the example data (as in \"ant run-example\") from the latest dev version, add the words \"electronics\" and \"connector\" to the features field of the first doc in ipod_other.xml.  Now the following query:\n\nhttp://localhost:8983/solr/select/?q=electronics&hl=true&hl.fl=features+cat\n\nwill show \"electronics\" highlighted in the features field but not in the cat field.  If you search instead for \"connector\", it is highlighted in both.\n\nThis seems like a bug to me.  A possible but not entirely satisfactory work-around would be to have the cat field copied into another field which is stemmed, and use that other field for highlighting (assuming the search is on the default search field, and not on cat).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Chris Harris",
            "id": "comment-12872898",
            "date": "2010-05-28T08:49:09+0000",
            "content": "I haven't taken the time to reproduce this particular issue, but I think the problem is not limited to stemming. Assuming you aren't specifying particular field names in your query, the problem can be summarized like this:\n\nSolr (at least as of 1.4) is in danger of producing weird highlights whenever the analyzer for your index's default search field differs from the analyzer for your highlight field(s). The HighlightComponent takes the Query object parsed by the QueryComponent (which was tokenized according to the default field's analyzer) and applies it unchanged to the highlighting field (which will be tokenized according to a different analyzer). The same word may be tokenized differently by the two tokenizers, with results like missing highlights.\n\nI'm not sure what the best solution is here. I've proposed an option that can help in some cases at SOLR-1910. Another possibility would be a new hl.useHighlightedFieldAsDefaultField highlighter option, which would create a new Query object (based on a separate analyzer) not just once at the start of highlighting, but separately for each particular field that's getting highlighted.\n\nA complication for either approach is whether you should do anything special to parts of the query that do specify a particular field (e.g. \"features:electronics\"). "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13835713",
            "date": "2013-11-30T13:24:15+0000",
            "content": "2013 Old JIRA cleanup "
        }
    ]
}