{
    "id": "SOLR-6630",
    "title": "Deprecate the \"implicit\" router and rename to \"manual\"",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Task",
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I had this exchange with an IRC user named \"kindkid\" this morning:\n\n\n08:30 < kindkid> I'm using sharding with the implicit router, but I'm seeing\n                 all my documents end up on just one of my 24 shards. What\n                 might be causing this? (4.10.0)\n08:35 <@elyograg> kindkid: you used the implicit router.  that means that\n                  documents will be indexed on the shard you sent them\nto, not\n                  routed elsewhere.\n08:37 < kindkid> oh. wow. not sure where I got the idea, but I was under the\n                 impression that implicit router would use a hash of the\n                 uniqueKey modulo number of shards to pick a shard.\n08:38 <@elyograg> I think you probably wanted the compositeId router.\n08:39 <@elyograg> implicit is not a very good name.  It's technically\ncorrect,\n                  but the meaning of the word is not well known.\n08:39 <@elyograg> \"manual\" would be a better name.\n\n\n\nThe word \"implicit\" has a very specific meaning, and I think it's\nabsolutely correct terminology for what it does, but I don't think that\nit's very clear to a typical person.  This is not the first time I've\nencountered the confusion.\n\nCould we deprecate the implicit name and use something much more\ndescriptive and easily understood, like \"manual\" instead?  Let's go\nahead and accept implicit in 5.x releases, but issue a warning in the\nlog.  Maybe we can have a startup system property or a config option\nthat will force the name to be updated in zookeeper and get rid of the\nwarning.  If we do this, my bias is to have an upgrade to 6.x force the\nname change in zookeeper.",
    "attachments": {
        "SOLR-6630.patch": "https://issues.apache.org/jira/secure/attachment/12677112/SOLR-6630.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-10-16T15:49:20+0000",
            "author": "Shawn Heisey",
            "content": "My free time has been somewhat limited lately, but I will try to cook up some initial ideas in a patch.  If someone else wants to jump on it, feel free! ",
            "id": "comment-14173882"
        },
        {
            "date": "2014-10-20T21:17:44+0000",
            "author": "Jan Høydahl",
            "content": "+1 to rename! ",
            "id": "comment-14177480"
        },
        {
            "date": "2014-10-21T09:14:01+0000",
            "author": "Upayavira",
            "content": "and rename compositeID to just 'id' or 'hashed-id' or something. composite ID routing also handles IDs that aren't composite, which is a major brain bender. ",
            "id": "comment-14178169"
        },
        {
            "date": "2014-10-21T13:32:56+0000",
            "author": "Shawn Heisey",
            "content": "Upayavira, I would guess that the majority of SolrCloud users are either using compositeId or have chosen to build a single-shard index – defaulting to implicit, but where the router choice doesn't really matter because there's one shard.  Renaming implicit will (hopefully) not directly impact a big chunk of the installed userbase.  A change to compositeId would have much greater user impact.\n\nThe rename of implicit will already be a far-reaching change that might come back to bite us in ways we never expected.  A rename of compositeId, if we do it at all, needs to be done later, after we figure out the pitfalls from THIS rename. ",
            "id": "comment-14178389"
        },
        {
            "date": "2014-10-25T15:57:06+0000",
            "author": "Shawn Heisey",
            "content": "Patch with my initial ideas.  It's definitely not complete ... I don't think this would work on an upgrade.  It also has nothing that can change the info in zookeeper from implicit to manual.\n\nThere is a problem with the patch that I don't know how to fix, I think it's a very old bug in subversion that nobody has figured out how to fix.  Actions like \"svn rename\" are not included in the diff, so this patch only shows the changes after these operations were done.  I used \"svn rename\" so that change history would be preserved.\n\nBefore you can apply and/or commit the patch, the rename must be complete and the original file must be present.  I think these steps will take care of that and make sure we don't lose history:\n\nMake a copy of ImplicitDocRouter.java, \"svn rename\" ImplicitDocRouter.java to ManualDocRouter,java, then use the OS to rename the copy back to ImplicitDocRouter.java.  Fixups like re-adding ImplicitDocRouter.java and redoing its svn:eol-style property are likely to be required. ",
            "id": "comment-14184142"
        },
        {
            "date": "2014-10-25T16:01:06+0000",
            "author": "Shawn Heisey",
            "content": "Is there a way to preserve history properly?  Using both svn copy and svn rename, TortoiseSVN seems to not have a revision log for ManualDocRouter.java.  Would I have to commit the changes to see that log?  I can try it on Linux, but I don't have any reason to expect anything different. ",
            "id": "comment-14184143"
        },
        {
            "date": "2014-10-25T16:19:58+0000",
            "author": "Shawn Heisey",
            "content": "Followup – the commandline tool \"svn log\" on Windows does show appropriate history when doing both svn copy and svn rename.  That means that the pre-patch operation is much simpler than I described earlier – just a single svn copy:\n\n\nsvn copy solr/solrj/src/java/org/apache/solr/common/cloud/ImplicitDocRouter.java solr/solrj/src/java/org/apache/solr/common/cloud/ManualDocRouter.java\n\n ",
            "id": "comment-14184149"
        },
        {
            "date": "2014-11-11T21:53:25+0000",
            "author": "Shawn Heisey",
            "content": "Additional thoughts for what the change should accomplish:\n\n\n\tAn attempt to create a collection with router.name=implicit should fail.  Ideally the error response would indicate that manual should be used instead, if that's not really difficult to implement.  I could be persuaded that this is going too far, but 5.0 is the first release where this might happen, and it's a new major version ... changes in external API should be expected.\n\tAn existing collection with the implicit router should continue to work through 5.x releases, with a warning in the log at startup.\n\tFor 5.x, I'd like to have a \"run once\" option (-DupdateDeprecatedZkConfig=true is one idea), admin UI button, and/or API call that would force an update to deprecated data like this in zookeeper.  Manually editing ZK (perhaps with something like the ZK plugin for Eclipse) would always be an option for an expert user.\n\tIf a 6.x version finds implicit, it should immediately change it to manual.\n\n ",
            "id": "comment-14207153"
        },
        {
            "date": "2014-11-11T22:37:52+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "An attempt to create a collection with router.name=implicit should fail. Ideally the error response would indicate that manual should be used instead, if that's not really difficult to implement. I could be persuaded that this is going too far, but 5.0 is the first release where this might happen, and it's a new major version ... changes in external API should be expected.\n\n+1\n\nAn existing collection with the implicit router should continue to work through 5.x releases, with a warning in the log at startup.\n\n+1 but a warning is not really required because the user didn't do anything wrong here.\n\nFor 5.x, I'd like to have a \"run once\" option (-DupdateDeprecatedZkConfig=true is one idea), admin UI button, and/or API call that would force an update to deprecated data like this in zookeeper. Manually editing ZK (perhaps with something like the ZK plugin for Eclipse) would always be an option for an expert user.\n\nInstead of that we can support both \"implicit\" and \"manual\" as the router.name in the clusterstate.json as you said and then in 5.1 the overseer can automatically rename \"implicit\" to \"manual\" and things will just continue to work. ",
            "id": "comment-14207227"
        },
        {
            "date": "2014-11-11T22:42:32+0000",
            "author": "Yonik Seeley",
            "content": "Instead of that we can support both \"implicit\" and \"manual\" as the router.name in the clusterstate.json as you said and then in 5.1 the overseer can automatically rename \"implicit\" to \"manual\" and things will just continue to work.\n\nYep.  Also, clusterstate is often re-written when something changes.  If we read \"implicit\" as \"manual\" on the read side, then conversion will quickly happen automatically? ",
            "id": "comment-14207241"
        },
        {
            "date": "2014-11-11T22:54:31+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "If we read \"implicit\" as \"manual\" on the read side, then conversion will quickly happen automatically?\n\nYes, I think we're talking about the same thing.\n\n\tRead side will map \"implicit\" and \"manual\" to the same router\n\tOverseer in 5.1 and beyond will rename implicit to manual automatically\n\tThe read side will continue to handle both \"implicit\" and \"manual\" throughout 5.x and will be removed in 6.0. This has to be there to provide back-compat because we can't guarantee that people will migrate to 5.0 -> 5.1 and then to further versions.\n\n ",
            "id": "comment-14207269"
        },
        {
            "date": "2015-10-07T06:12:40+0000",
            "author": "Shawn Heisey",
            "content": "A lot of the user confusion on this likely resulted from incorrect documentation in the reference guide for the Collections API ... the descriptions for \"implicit\" and \"compositeId\" were switched.  That documentation error has been corrected. ",
            "id": "comment-14946333"
        },
        {
            "date": "2017-04-19T04:24:10+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "I'd like to have this in by 7.0. Another alternative to \"manual\" that came to mind was \"custom\".\n\nEdit: Marking this a blocker so as to keep track of things to do before we release 7.0. If this was not appropriate, please let me know / unmark as blocker. ",
            "id": "comment-15974048"
        },
        {
            "date": "2017-04-19T13:40:57+0000",
            "author": "Steve Rowe",
            "content": "Another alternative to \"manual\" that came to mind was \"custom\".\n\nTo me \"custom\" implies configurable variability, which is not what's going on.\n\nSome more alternatives: \n\n\n\tEmphasizing the fact the implicit router does nothing: \"null\", \"void\", \"no-op\", \"passive\"\n\tEmphasizing the non-displacing aspect of the implicit router's function: \"in-place\", \"in-situ\", \"static\"\n\n ",
            "id": "comment-15974683"
        },
        {
            "date": "2017-04-19T14:11:06+0000",
            "author": "Trey Cahill",
            "content": "I'd suggest to rename the implicit router to \"userDefined\".  \n\nI think it would provide the least amount of ambiguity to a new user, as when using it, the user defines what shard documents are sent too. ",
            "id": "comment-15974743"
        },
        {
            "date": "2017-04-19T14:16:24+0000",
            "author": "Steve Rowe",
            "content": "I'd suggest to rename the implicit router to \"userDefined\".\n\nSo this belongs to a third emphasis category:\n\n\n\tEmphasizing that routing is the client's responsibility, not the server's: \"manual\", \"custom\", \"userDefined\"\n\n\n ",
            "id": "comment-15974752"
        },
        {
            "date": "2017-04-19T19:11:40+0000",
            "author": "Shawn Heisey",
            "content": "Thanks for the good discussion with names that I never thought of when I opened this issue.\n\nAlthough the length of \"userDefined\" worries me a little bit, and the mixed case might lead to users mis-typing the configuration, I can only think of one real concern:  This wording implies that there is a configuration they can examine/edit that configures the routing definition.  Since my whole point was to eliminate ambiguity, I think that using that particular term is no better than \"implicit\".  I think that \"custom\" carries the same implication.\n\nSome of the suggestions put forth by Steve Rowe are intriguing.  I really like \"null\" ... but that particular string is something you want to completely avoid in most programming environments, particularly Java. ",
            "id": "comment-15975331"
        },
        {
            "date": "2017-04-19T19:43:05+0000",
            "author": "Jan Høydahl",
            "content": "I like \"manual\", let's stick to the original plan  It says it all, there is nothing automatic about it, user/client has to manually take care of routing.\n\nIn my head, weirdly, even \"explicit\" would be better than \"implicit\", as the user/client needs to explicitly define routing, Solr won't do it for you  ",
            "id": "comment-15975377"
        },
        {
            "date": "2017-04-19T19:45:45+0000",
            "author": "David Smiley",
            "content": "Anything is better than \"implicit\".  Explicit, Manual, and Custom are all good to me! ",
            "id": "comment-15975379"
        },
        {
            "date": "2017-06-01T09:37:34+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "> Anything is better than \"implicit\".\nI like \"explicit\" better than \"manual\", since \"manual\" has the implication than it needs to be set \"by hand\", which is not exactly the case if done through user's SolrJ program (which then becomes \"programmatic\" rather than \"by hand\"). I think this difference is subtle, and I'm -0 on \"manual\". ",
            "id": "comment-16032707"
        },
        {
            "date": "2017-06-26T01:59:17+0000",
            "author": "Noble Paul",
            "content": "We can fix this even after 7.0 as long as it doesn't break backcompat. So, IMHO, it doesn't have to be a blocker for 7.0 release ",
            "id": "comment-16062482"
        },
        {
            "date": "2017-07-07T16:12:29+0000",
            "author": "Yonik Seeley",
            "content": "+1 for \"manual\".  \"explicit\" doesn't really right when the route isn't explicitly set in the document or on the update command, and \"custom\" or \"userDefined\" suggest you need to configure/set something up. ",
            "id": "comment-16078306"
        },
        {
            "date": "2017-07-10T23:13:05+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Here's a WIP patch for renaming \"implicit\" to \"manual\". TODO: add deprecation comments and warnings and handle backcompat for \"implicit\". ",
            "id": "comment-16081331"
        },
        {
            "date": "2017-07-24T19:17:24+0000",
            "author": "Anshum Gupta",
            "content": "Ishan Chattopadhyaya are you actively working on this? ",
            "id": "comment-16099009"
        },
        {
            "date": "2017-07-24T19:40:28+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Anshum, unfortunately, I'll be unable to get to this until 28th August 28th July. I'm unmarking this as a blocker as per Noble's comment [0].\n\n[0] - https://issues.apache.org/jira/browse/SOLR-6630?focusedCommentId=16062482&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-16062482\n\nEdit: I meant 28th July. ",
            "id": "comment-16099035"
        },
        {
            "date": "2018-01-22T21:01:46+0000",
            "author": "Jan Høydahl",
            "content": "ping ",
            "id": "comment-16334890"
        },
        {
            "date": "2018-01-22T22:53:29+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "ping\nHad dropped the ball on this; I'll pick it up after about 2-3 issues I'm currently working on. ",
            "id": "comment-16335093"
        }
    ]
}