{
    "id": "SOLR-8405",
    "title": "bin/solr (and its cmd sibling) should pass thru -X options as it does with -D",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.0,                                            5.1,                                            5.2,                                            5.2.1,                                            5.3,                                            5.4",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Currently the bin/solr scripts pass any options that being with -D on to the JVM directly. It should to the same for -X vs. having to put -X inside of -a",
    "attachments": {
        "SOLR-8405.patch": "https://issues.apache.org/jira/secure/attachment/12777393/SOLR-8405.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-14T05:27:29+0000",
            "author": "Jason Gerlowski",
            "content": "Here's a patch off of trunk which makes the change as recommended in the description.  All tests pass.\n\nRunning bin/solr start -e techproducts -Xoption will start the Solr process with the -Xoption flag, where before the script would've reported an error message from SolrCLI about an invalid argument.\n\nTwo caveats with respect to this patch.\n\n1.) The patch contains a small tweak to bin/solr/solr.in.cmd that I'm not sure how to test.  My guess is that file is used on Windows, which I'm not setup to test.  I could also be wrong about that, in which case I just don't know how to exercise it.  I'd appreciate a double-check on the changes to that file, even though they're likely trivial.\n\n2.) SolrCLI accepts/documents some options which could conflict with -X options.  I'm thinking particularly of the -m argument (specifies JVM memory for Solr).  Should we continue to support these arguments, now that users can directly specify their own -X args?  Or is it fine to let this collision occur if script users put themselves in this position? ",
            "id": "comment-15055426"
        }
    ]
}