{
    "id": "SOLR-12276",
    "title": "Admin UI - Convert from \"AngularJS\" to \"Angular\"",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "With SOLR-12196 it was noted the current Solr Admin UI runs AngularJS (1.x), which is to be End-of-Life later this year.  Various options were proposed for what to do next.  One option is to keep the existing functionality but migrate to a newer UI framework.  This ticket is to migrate the existing UI to Angular (2+).\n\nSee this readme file.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-04-25T20:23:17+0000",
            "content": "With the recent discussion about the Admin UI, I thought this might be a good time for me to learn one of the new UI frameworks.  With a little free time I got a little start on this.  So far we have menus, the dashboard tab and some of the collections tab.  Anyone interested can check out the pull request and run \"ant server\" to build it.  You will need to have node/npm/ng to do so.  Should there be interest in going this direction, I can continue with this as time allows, and perhaps others will want to help also.  My web development knowledge is mostly stuck in the servlet/jsp days and my design skills are nearly non-existent, but I think I can help with a rote conversion like this one.  (Of course, there were a lot of other proposals and others no doubt have better ideas, in which case this can just be a fun experiment.) ",
            "author": "James Dyer",
            "id": "comment-16453029"
        },
        {
            "date": "2018-05-01T14:04:07+0000",
            "content": "James Dyer I'm not following Solr much at the moment, but it is great to see this ticket! If there is anything you need explaining regarding the original Angular UI, feel free to ask. ",
            "author": "Upayavira",
            "id": "comment-16459700"
        }
    ]
}