{
    "id": "SOLR-952",
    "title": "duplicated code in (Default)SolrHighlighter and HighlightingUtils",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A large quantity of code is duplicated between the deprecated HighlightingUtils class and the newer SolrHighlighter and DefaultSolrHighlighter (which have been getting bug fixes and enhancements). The Utils class is no longer used anywhere in Solr, but people writing plugins may be taking advantage of it, so it should be cleaned up.",
    "attachments": {
        "SOLR-952.patch": "https://issues.apache.org/jira/secure/attachment/12400461/SOLR-952.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Chris Harris",
            "id": "comment-12662555",
            "date": "2009-01-09T23:28:06+0000",
            "content": "I did a brief look through the svn logs:\n\n\n\tIn r422248, the class was first added. It was added to org/apache/solr/util/SolrPluginUtils.java. The purpose of this commit was: \"order tokens by startOffset when highlighting\"\n\tIn r510338 it was moved moved to org/apache/solr/util/HighlightingUtils.java.\n\tIn r639490 org/apache/solr/highlight/DefaultSolrHighlighter.java was created and the econd copy was added there; this revision did not, however, touch org/apache/solr/util/HighlightingUtils.java\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12674824",
            "date": "2009-02-18T23:44:03+0000",
            "content": "updated summary and description to point out that TokenOrderingFilter is just a small part of the code duplication that seems to have been left behind from an incomplete refactoring of HighlightingUtils.   "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12674825",
            "date": "2009-02-18T23:47:32+0000",
            "content": "Patch for cleaning up HighlighterUtils.\n\nI'm not a subject matter expert here, but from what i can tell this hsould be back-compat for anyone still using the utils class.\n\nI don't plan on committing unless someone more familiar with the highlighting code looks it over and gives it a thumbs up.  (HighlightingUtils doesn't currently have any tests to verify against) "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12674830",
            "date": "2009-02-19T00:17:24+0000",
            "content": "HighlightingUtils has been deprecated for at least one release; can't we just rip it out? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12677555",
            "date": "2009-02-27T21:58:13+0000",
            "content": "HighlightingUtils has been deprecated for at least one release; can't we just rip it out? \n\nit depends on how strict we want to be about backwards compatibility – which has never been extremely well defined for Solr.  following hte Lucene-Java model, we should be back compatible with java class compatibility until 2.0 ... but since Solr tends to focus more on the HTTP API, i'm certainly fine with saying we aim for HTTP/REST back-compat between major versions, and have a more relaxed view on the class compatibility for plugin developers ... but if we really want to get into this is a much broader discussion.\n\nfor the purposes of this issue does anyone see any reason not to commit the patch? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12683801",
            "date": "2009-03-20T08:56:23+0000",
            "content": "for the purposes of this issue does anyone see any reason not to commit the patch?\n\n+1 for commit. I'm fine with removing the class too. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12689598",
            "date": "2009-03-26T18:42:44+0000",
            "content": "Committed revision 758795. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775625",
            "date": "2009-11-10T15:51:55+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}