{
    "id": "SOLR-3034",
    "title": "replicateAfter optimize not working",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I have:\n\n      <str name=\"replicateAfter\">optimize</str>\n      <str name=\"replicateAfter\">commit</str>\n      <str name=\"replicateAfter\">startup</str>\n\n\nBut the UI only shows:\n\nreplicateAfter:commit, startup\n\n\nAnd sure enough, optimizing does not cause a replication to happen. \n\nAlso, replicating an optimized index, does not seem to keep in \"optimized\" on the slave. Is that really the case, or is it a bug? I would expect if an index is optimized on master, when it is then replicated to slaves, the slaves would receive the optimized index.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13197119",
            "date": "2012-01-31T18:56:11+0000",
            "content": "FWIW: replicateAfter=commit is a super set of replicateAfter=optimize because every optimize command is also a commit commant ... if you are replicating after every commit then you are automatically replicating after every optimize.  that's the reason the UI only shows \"commit, startup\", it's \"deduping\" the list.\n\nHowever: that wouldn't explain why you aren't seeing replication happen after an optimize.  Are you seeing replication happen at all?\n\nI just tried a quick sanity check using trunk r1237878 with the example modified to act as a master with replicateAfter commit & optimize and i was definitely seeing http://localhost:8983/solr/replication?command=indexversion return a new indexversion after every commit or optimize.\n\nwhen i changed the config to only use replicateAfter=optimize, then indexversion would return a new version after every optimize command, but not after every commit \n\n...so things are working exactly as expected on the master side from what i can see.\n\n "
        },
        {
            "author": "Antony Stubbs",
            "id": "comment-13197940",
            "date": "2012-02-01T16:35:15+0000",
            "content": "Yes, replication is working great after new imports.\n\nShould optimising cause the index generation to increment? I don't see it increment. After clicking optimise, I only see log messages around the commit, nothing about optimise.\n\nAlso, in the UI, after I run optimise, the tick appears, but if I refresh the page, it does not appear to remain 'optimised', as the tick goes back to cross. (There are no imports happening).\n\nI'm running on a build from jenkins from apache-solr-4.0-2012-01-30_09-45-51.zip.\n\nPerhaps my index isn't actually being optimised..\n "
        }
    ]
}