{
    "id": "SOLR-5247",
    "title": "Support for custom per core properties missing with new-style solr.xml",
    "details": {
        "affect_versions": "4.4",
        "status": "Resolved",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "multicore"
        ],
        "type": "Bug",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "This part has been solved. See comments\n\nWhen using old-style solr.xml I can define custom properties per core like so:\n\n<cores adminPath=\"/admin/cores\" defaultCoreName=\"core1\">\n  <core name=\"core1\" instanceDir=\"core1\" config=\"solrconfig.xml\" schema=\"schema.xml\">\n    <property name=\"foo\" value=\"bar\" />\n  </core>\n</cores>\n\n\nI can then use the property \"foo\" in schema.xml or solrconfig.xml like this:\n\n<str name=\"foo\">${foo}</str>\n\n\n\nAfter switching to the new-style solr.xml with separate core.properties files per core this does not work anymore.\n\nI guess the corresponding core.properties file should look like this:\n\nconfig=solrconfig.xml\nname=core1\nschema=schema.xml\nfoo=bar\n\n\n(I also tried property.foo=bar)\n\nWith that, I get the following error when reloading the core:\n\norg.apache.solr.common.SolrException:org.apache.solr.common.SolrException: No system property or default value specified for foo value:${foo}\n\n\nI can successfully reload the core if I use ${foo:undefined} but the value of \"foo\" will always be \"undefined\" then.\n\nWhen trying to create a new core with an url like this:\n\nhttp://localhost:8080/solr/admin/cores?action=CREATE&name=core2&instanceDir=core2&config=solrconfig.xml&schema=schema.xml&property.foo=bar&persist=true\n\n\nthe property \"foo\" will not appear in core.properties. However, I can use it in schema.xml. But only until restarting the servlet container. After that, the property is lost.\n\nPossibly related to SOLR-5208?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13770771",
            "date": "2013-09-18T13:36:23+0000",
            "content": "Use the other technique, by placing your core substitution properties in <instance,dir>/conf/solrcore.properties. "
        },
        {
            "author": "Chris F",
            "id": "comment-13771005",
            "date": "2013-09-18T17:48:20+0000",
            "content": "Thanks for the hint, Jack. I tried the approach with the properties in a second file before but wasn't aware that I have to restart the servlet container to make it work. A core reload wasn't enough.\n\nSo, with the custom parameters in a file called \"solrcore.properties\", the line \"properties=solrcore.properties\" added to the core.properties file and after restarting tomcat, it now works. Omitting any of these steps did not work for me.\n\nWhat's left is the problem with core creation. When creating a new core per HTTP request like shown above, the property \"foo\" won't get persisted. It can be used as long as the servlet container isn't restarted. After that, the property is gone. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13773093",
            "date": "2013-09-20T15:36:15+0000",
            "content": "Alan Woodward Do you have any insights re: whether this is still an issue in 4.5? We've both been in this code recently.\n\nI'll assign it to myself to track it, but I don't have many cycles right now, feel free to grab it if you do.\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13820704",
            "date": "2013-11-13T00:11:46+0000",
            "content": "Chris F I just tried this and it seems to work fine for core creation on 4.5 and 4x. I know there has been quite a bit of work in this area right after the 4.4 Solr was cut so I'm going to say it's fixed.\n\nIf anyone finds out differently, we can re-open this JIRA or open a new one. "
        }
    ]
}