{
    "id": "SOLR-2349",
    "title": "Wrong matches count with groupped results",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "With query q=: i get \"numFound = 1752\"\n\nWhen i group by field (q=:&group=true&group.field=company_id) i also get \"matches = 1752\", but number of groupped results less than 1752 and application wouldn't be able to show valid pagination.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12990593",
            "date": "2011-02-04T16:10:08+0000",
            "content": "numFound refers to number of documents that match the query, regardless of how they are grouped or collapsed.  There are already other feature requests for returning the number of group. "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12995860",
            "date": "2011-02-17T15:52:44+0000",
            "content": "hi,\n\ni have same problem, too. Can we get the number of the group with different request?\nAnd i'm also using facet query and i want to apply same things (get the number of groups wrt facet results) to facet query.\nPS: I am using SOLR 4.0 nightly build.\n\nthanks... "
        },
        {
            "author": "Tanguy Moal",
            "id": "comment-12995882",
            "date": "2011-02-17T16:20:56+0000",
            "content": "As a temporary workaround, you can still ask for a few more rows than you actually display. If the response contains the requested number of rows then you'll have a next page. Otherwise, it's the last one. Quick and dirty, but that works. You simply loose the ability to display \"showing page #a of n\" "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12996259",
            "date": "2011-02-18T06:56:26+0000",
            "content": "Thanks for reply but in this case i have two problems:\n\n1. I need to group count for my category filter on my web page (for ex: Mathematis (45), Statistics (25), History (13)....) this 45, 25 , 13 .. must be the count of grouped items.\n2. I have to get the total number of the pages (i can not use just 'next' and 'prev' for paging) and show on the web page,\n\nthanks... "
        },
        {
            "author": "Anton",
            "id": "comment-12996263",
            "date": "2011-02-18T07:01:06+0000",
            "content": "Hasan Ince\n\ni use faceting search on same field as i use for grouping and calculate new count. Did this workaroung fit for your purposes? "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12996267",
            "date": "2011-02-18T07:13:58+0000",
            "content": "i send the request: facet=true&facet.field=cat&group=true&group.field=sortid\n\ni expect to get 3 results (because the number of the groups is 3) from that query but i get 5 results. And same things for facet \n\nmore details:\n\n  <lst name=\"grouped\">\n  <lst name=\"sortid\">\n  <int name=\"matches\">5</int> \n  <arr name=\"groups\">\n\n ......... \n <str name=\"groupValue\">1001_46</str> \n  <result name=\"doclist\" numFound=\"1\" start=\"0\">\n\n  <str name=\"groupValue\">1001_3</str> \n  <result name=\"doclist\" numFound=\"1\" start=\"0\">\n\n  <str name=\"groupValue\">1001_12</str> \n  <result name=\"doclist\" numFound=\"3\" start=\"0\">\n\n\n  <lst name=\"facet_counts\">\n  <lst name=\"facet_queries\" /> \n  <lst name=\"facet_fields\">\n  <lst name=\"cat\">\n  <int name=\"1\">5</int> \n  </lst>\n  </lst>\n  <lst name=\"facet_dates\" /> \n  <lst name=\"facet_ranges\" /> \n  </lst>\n "
        },
        {
            "author": "Anton",
            "id": "comment-12996271",
            "date": "2011-02-18T07:17:30+0000",
            "content": "but you group on \"sortid\" and facet on \"cat\".\nTry to facet on sortid and you will be able to calculate right count of your groups "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12996466",
            "date": "2011-02-18T15:47:58+0000",
            "content": "i tried to facet on sortid but i have same result as <int name=\"1\">5</int>. I want get the facet info above grouped data. So how can i ge <int name=\"1\">3</int> on facet. (Because in my case the grouped items will be more than 1.000.000 results and i can not count grouped items one by one)\n "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12998364",
            "date": "2011-02-23T13:26:16+0000",
            "content": "hi\n\nI live for the solution of the problem.\nI could not find any solution or any suggestion you have an easy way? "
        },
        {
            "author": "Anton",
            "id": "comment-12998597",
            "date": "2011-02-23T23:01:00+0000",
            "content": "Hi, Hasan! I already told you my solution by faceting on sortid field. If you have same result as <int name=\"1\">5</int> in facet results that mean, that you have different values in sortid field for each document in solr index, and that mean, that you have 5 groups. Try to analyse your data and check that sortid field is indexed. "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12998725",
            "date": "2011-02-24T07:31:34+0000",
            "content": "Hi Anton, first of all thank you very much for your interest. In this case i understandt what you mean and i agree with your, i am waiting from solr to give me the number of groups but it gives the total number of the result.  First i tried with 70 documents and i thought i might mis calculate the number of groups or i did another mistake. So i narrowed the documents as 5 documents. I searched a query word. 3 of them are in same group and other 2 are in different groups. So i must get 3 different group. And i get 3 groups. The problem occures from this point. Despite there are 3 groups, facet returns 5 results. I am expecting faceting the results over the groups count. I want facet to get results over group numbers. So am i false while trying to get <int name=\"1\">3</int> in this attribute? "
        },
        {
            "author": "Anton",
            "id": "comment-12998736",
            "date": "2011-02-24T08:00:44+0000",
            "content": "Hasan, what results returned by facet? I think if you group and facet on sortid field you should get something like this:\n\nitems_count: 5\n\ngroups:\n<arr name=\"groups\">\n    <lst>\n        <int name=\"groupValue\">1</int>\n            <result name=\"doclist\" numFound=\"3\" start=\"0\">\n            ...\n     </lst>\n     <lst>\n        <int name=\"groupValue\">2</int>\n            <result name=\"doclist\" numFound=\"1\" start=\"0\">\n            ...\n     </lst>\n     <lst>\n        <int name=\"groupValue\">3</int>\n            <result name=\"doclist\" numFound=\"1\" start=\"0\">\n            ...\n     </lst>\n</arr>\n\nfacet:\n<int name=\"1\">3</int>\n<int name=\"2\">1</int>\n<int name=\"3\">1</int>\n\nOr what do you get? Show us some information, please "
        },
        {
            "author": "Hasan Ince",
            "id": "comment-12998745",
            "date": "2011-02-24T08:20:54+0000",
            "content": "Anton thank you very very very much for your help i changed the query and it worked as you said \nBut in this case i have one more problem, too. When i facet and group documents (i have 4 filters for grouping documents) too much result returns (for parsing). Can i just get the number of results (for 4 different category; the number of faceted and grouped items) and omit the other attributes (such as pagecontent). "
        },
        {
            "author": "Anton",
            "id": "comment-12998748",
            "date": "2011-02-24T08:27:46+0000",
            "content": "Hasan, i found only one solution for decrease final results size:\nfacet.mincount=2&facet.limit=-1&\n\nThat mean, that we only need facet with count >= 2, because only items with this condition will be collapsed by this field. Let me know if there is another solution "
        },
        {
            "author": "bronco",
            "id": "comment-13120599",
            "date": "2011-10-05T00:09:42+0000",
            "content": "I run into the same problem with drupal. What ever here is suggested and more to get it work. I receive always the wrong numFound results. I just want that my group is used for counting the numFound result.\n\nThis is really weird. Somehow is there nobody else who get a problem with this. I google now for 2 days for finding an solution to this problem.\n\nIs this now a bug or a feature?   "
        }
    ]
}