{
    "id": "SOLR-7893",
    "title": "Document ZooKeeper SSL support",
    "details": {
        "components": [
            "security"
        ],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Reopened",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Once ZooKeeper supports SSL properly, Solr should start using it for all communication. See comments in https://cwiki.apache.org/confluence/display/solr/Enabling+SSL\n\n\nZooKeeper does not support encrypted communication with clients like Solr.  There are several related JIRA tickets where SSL support is being planned/worked on: ZOOKEEPER-235; ZOOKEEPER-236; ZOOKEEPER-733; and  ZOOKEEPER-1000.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-07T08:17:57+0000",
            "author": "Jan Høydahl",
            "content": "Seems no-one are working on ZOOKEEPER-235 etc at the moment  ",
            "id": "comment-14661486"
        },
        {
            "date": "2015-11-26T00:00:22+0000",
            "author": "Jan Høydahl",
            "content": "ZooKeeper now support SSL from clients if ZooKeeper is tarted with the Netty transport. See ZOOKEEPER-2125.\n\nAccording to documentation https://cwiki.apache.org/confluence/display/ZOOKEEPER/ZooKeeper+SSL+User+Guide Solr users should already be able to connect to ZK securely simply by setting some Java Properties. ",
            "id": "comment-15027838"
        },
        {
            "date": "2015-11-26T00:45:37+0000",
            "author": "Jan Høydahl",
            "content": "Added a link to the ZK SSL docs in the RefGuide: Setting Up an External ZooKeeper Ensemble\n\nI'm not certain how we could enable \"SSL by default\" as the title suggests, as there is no \"default\" external ZooKeeper shipped with Solr that we could pre-configure.\n\nI'll go ahead and rename this JIRA as a documentation jira and resolve it. Created two new spinoffs: SOLR-8342 for bin/solr and SOLR-8343 zkcli.sh. ",
            "id": "comment-15027909"
        },
        {
            "date": "2015-11-26T14:25:43+0000",
            "author": "Steve Rowe",
            "content": "Jan Høydahl, Solr still depends on ZK 3.4.6, but ZK SSL support was added in 3.5.1.\n\nPlease fix the ref guide changes you've made: either roll them back completely, or make sure you tell people to use 3.5.1+.\n\nHave you tested using Solr with ZK 3.5.1? And have you tested using ZK SSL? ",
            "id": "comment-15028869"
        },
        {
            "date": "2015-11-26T14:28:09+0000",
            "author": "Jan Høydahl",
            "content": "Reopened, awaiting Solr to upgrade to supported ZK version. Thanks Steve Rowe ",
            "id": "comment-15028879"
        }
    ]
}