{
    "id": "SOLR-8359",
    "title": "Restrict child classes from using parent logger's state",
    "details": {
        "components": [],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [
            "5.5",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "In SOLR-8330 we split up a lot of loggers. However, there are a few classes that still use their parent's logging state and configuration indirectly.\n\nHdfsUpdateLog and HdfsTransactionLog both use their parent class cached read of boolean debug = log.isDebugEnabled(), when they should check their own loggers instead.",
    "attachments": {
        "SOLR-8359.patch": "https://issues.apache.org/jira/secure/attachment/12775360/SOLR-8359.patch",
        "SOLR-8359-nonfinal-values.patch": "https://issues.apache.org/jira/secure/attachment/12775476/SOLR-8359-nonfinal-values.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-02T16:54:25+0000",
            "author": "Mike Drob",
            "content": "Jason Gerlowski - do you want to take a look at this? I didn't notice it missing when looking at the original patch, but it looks like a pretty straightforward fix. ",
            "id": "comment-15036117"
        },
        {
            "date": "2015-12-02T18:07:16+0000",
            "author": "Mike Drob",
            "content": "PeerSync also has this, but no other classes use the cached debug value there. ",
            "id": "comment-15036275"
        },
        {
            "date": "2015-12-02T18:34:23+0000",
            "author": "Jason Gerlowski",
            "content": "Sure, good catch Mike, I didn't even think of this.\n\nI did a quick grep around for other instances of this.  So add CdcrTransactionLog to the list.  Hopefully we're not missing any other classes here.\n\nShould anything go in CHANGES.txt for this JIRA?  I lean towards \"no\", since this is just fallout from another change that's already mentioned in CHANGES.txt.  But I'm not very familiar with when/how/why things get added to that file, so maybe I've got the wrong approach.\n\nI'm running tests on a patch now, will upload it shortly if all goes well. ",
            "id": "comment-15036334"
        },
        {
            "date": "2015-12-02T19:11:51+0000",
            "author": "Jason Gerlowski",
            "content": "Tests passed; here's the patch. ",
            "id": "comment-15036404"
        },
        {
            "date": "2015-12-02T19:54:16+0000",
            "author": "Mike Drob",
            "content": "Not sure it makes sense to always make these cached boolean private static final. UpdateLog.preSoftCommit would refresh the values, I think HdfsUpdateLog now misses out on that, haven't confirmed though. Logging levels can change dynamically via the Solr UI or through file watchdogs, depending on the impl used.\n\nAlso I don't see changes to CdcrTransactionLog like you mentioned - was that a false positive in your previous comment? ",
            "id": "comment-15036483"
        },
        {
            "date": "2015-12-03T02:14:20+0000",
            "author": "Jason Gerlowski",
            "content": "Ah, I forgot to save in Eclipse before making the patch.  Find the updated version attached.\n\nI see your point about the cached debug variables not getting refreshed ever.  UpdateLog.preSoftCommit() will update the cached value in the abstract parent, but won't affect the values in HdfsUpdateLog etc.\n\nOne way to fix this would be to implement a preSoftCommit() method in each of this children which resets the cached value in the child before calling super.preSoftCommit().  Not sure if there's a better solution though.  It seems like there should be a better way to do this... ",
            "id": "comment-15037088"
        },
        {
            "date": "2015-12-03T03:22:37+0000",
            "author": "Jason Gerlowski",
            "content": "I've attached a version of the patch (SOLR-8359-nonfinal-values.patch) which allows the cached debug value in HdfsUpdateLog to be updated on each call to preSoftCommit.\n\nNot sure that we want to take the approach I mentioned for this, but I couldn't think of any other way to do it, so I figured I'd upload it so people can at least offer feedback/suggest alternatives. ",
            "id": "comment-15037174"
        },
        {
            "date": "2015-12-05T04:45:43+0000",
            "author": "Mike Drob",
            "content": "+1 LGTM ",
            "id": "comment-15042647"
        },
        {
            "date": "2015-12-05T05:43:16+0000",
            "author": "Anshum Gupta",
            "content": "Thanks Jason and Mike. I'll take a look at this. ",
            "id": "comment-15042671"
        },
        {
            "date": "2015-12-07T06:59:20+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1718257 from Anshum Gupta in branch 'dev/trunk'\n[ https://svn.apache.org/r1718257 ]\n\nSOLR-8359: Restrict child classes from using parent logger's state ",
            "id": "comment-15044457"
        },
        {
            "date": "2015-12-07T07:54:22+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1718259 from Anshum Gupta in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1718259 ]\n\nSOLR-8359: Restrict child classes from using parent logger's state (merge from trunk) ",
            "id": "comment-15044525"
        },
        {
            "date": "2016-01-20T22:40:45+0000",
            "author": "Yonik Seeley",
            "content": "Why were the non-statics changed to statics?\nI just ran across an issue w/ peersync where I couldn't change the debug level dynamically. ",
            "id": "comment-15109633"
        },
        {
            "date": "2016-01-20T22:54:51+0000",
            "author": "Yonik Seeley",
            "content": "Here's a patch that removes the \"static\" from these variables. ",
            "id": "comment-15109664"
        },
        {
            "date": "2016-01-21T18:09:12+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1726045 from Yonik Seeley in branch 'dev/trunk'\n[ https://svn.apache.org/r1726045 ]\n\nSOLR-8359: revert change of cached debug levels to statics ",
            "id": "comment-15111023"
        }
    ]
}