{
    "id": "SOLR-2174",
    "title": "commit durring backup of more then 10 seconds causes snapshoot to fail ?",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Comment from Peter Sturge in email...\n\nhttp://lucene.472066.n3.nabble.com/commitReserveDuration-backups-and-saveCommitPoint-td1407399.html\n\n\nIn Solr 1.4 and 1.4.1, the SOLR-1475 patch is certainly there, but I don't believe it truly addresses the problem.\n\nHere's why:\n\nWhen a 'backup' command is received by the RemplicationHandler, it creates a SnapShooter instance and asynchronously does a full file snapshot of the current commit point.\nThe current commit version to which this refers, however, is set to be cleared on the next commit by the value of 'commitReserveDuration', which, by default, is set to 10secs. (see cleanReserves() in IndexDeletionPolicyWrapper.java).\n\nIf you perform a backup and no commits occur during this time, it's fine, because clearReserves() is not called. If you do get a commit during the backup process, and the backup takes longer than 10secs,\nthe whole snapshot operation fails (because delete() doesn't see the commit point in savedCommits - see below).\n\nPeter's email mentions two patches that he believes will fix this problem",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12922247",
            "date": "2010-10-18T20:44:09+0000",
            "content": "Note: i personally don't fully understand the issue, but i noticed the message was unreplied and had a patch so i wanted to make sure if got tracked in Jira "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12922380",
            "date": "2010-10-19T00:29:02+0000",
            "content": "looks like a dupe of SOLR-2100 - already resolved. "
        }
    ]
}