{
    "id": "SOLR-5254",
    "title": "ref guide needs page/section on update processor chains",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.2"
        ],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "update processor chans have never really been explained in the ref guide, just mentioned little bits here and there in the context of functionality that uses/depend on a spcitic update processor.\n\nwe should probably have a cohesive page (under https://cwiki.apache.org/confluence/display/solr/Indexing+and+Basic+Data+Operations i would think) introducing hte concept and mentioning some of the \"general\" update processors (ie: the field mutators, the UUIDUpdateProcessor, etc...), and then back link to it for an explanation from some of hte other pages where processors are mentioned...\n\n\n\thttps://cwiki.apache.org/confluence/display/solr/UIMA+Integration\n\thttps://cwiki.apache.org/confluence/display/solr/Detecting+Languages+During+Indexing\n\thttps://cwiki.apache.org/confluence/display/solr/De-Duplication\netc...",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-14118306",
            "date": "2014-09-02T16:20:40+0000",
            "content": "aparently we've had a dup of this issue for quite a while: SOLR-5896\n\nErickE just resolved SOLR-5896 after adding a basic page listing all of hte UpdateProcessors – but i think there's still a fair bit of work to do: for starters there's stll not real explanation of what the heck and update processor is, let alone what an update processor chain is – how to configure, how to select a chain at runtime, etc.... "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14118408",
            "date": "2014-09-02T17:37:39+0000",
            "content": "bq: ...but i think there's still a fair bit of work to do...\n\nNo doubt about it at all, I consider what I did for SOLR-5896 as the bare minimum of a start on update processors but got daunted by doing everything that should be done. It was a holiday weekend after all ...\n\nIMO in addition to a good explanation of where update processors fit in the architecture, it would be good to have a limited use-case (or perhaps example transformation) for each of the update processors. Some kind of explanation of just how simple a document is at that point (i.e. it's just a set of key/value pairs), and some bits explaining how to deal with multiValued fields at this level. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14118435",
            "date": "2014-09-02T18:00:08+0000",
            "content": "yeah, what we've talked about in the past on IRC / confrences, etc... (but aparently i never typed up here) was an introductory page on the basics of the processor chains, with how to configure, and how to  select at runtime.  Then a few really in depth pages on some of the big concepts in chains: like how the distributed logic works, and the general class of field mutatating processors, then an \"other processors\" page (similar to the \"other query parsers\") page with a quick summary of all the processors not yet covered in depth, linking to the javadocs and to other sections in the ref guide that leverage these processors (ie: UUID -> unique key,  sig -> dedupication,  the managed schema processors/pages, etc... "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14553146",
            "date": "2015-05-20T21:19:43+0000",
            "content": "I took a stab at filling this gap at https://cwiki.apache.org/confluence/display/solr/Update+Request+Processors\n\nComments welcome. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14568190",
            "date": "2015-06-01T22:57:42+0000",
            "content": "I think we're pretty much good to go here - i've made some tweaks and moved the page under the solrconfig.xml section for the 5.2 guide.\n\n(there's still a lot of cross linking that can be done between this page and various sections of the doc where some of the specific update processors are useful, but that's true for a lot of things in the doc.) "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14586937",
            "date": "2015-06-15T21:44:50+0000",
            "content": "Bulk close for 5.2.0. "
        }
    ]
}