{
    "id": "SOLR-4066",
    "title": "SolrZKClient changed interface",
    "details": {
        "affect_versions": "4.0,                                            4.0.1,                                            4.1",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "The constructor of SolrZKClient has changed, I expect to ensure clean up of resources. The strategy is as follows:\n\nconnManager = new ConnectionManager(...)\ntry {\n   ...\n} catch (Throwable e) {\n      connManager.close();\n      throw new RuntimeException();\n}\ntry {\n  connManager.waitForConnected(clientConnectTimeout);\n} catch (Throwable e) {\n  connManager.close();\n  throw new RuntimeException();\n}\n\n\n\nThis results in a different exception (RuntimeException) returned from the constructor as earlier (nice exceptions as UnknownHostException, TimeoutException).\n\nCan this be changed so we keep the old nice exceptions e.g. as follows (requiring the constructor to declare these) or at least include them as cause in the RuntimeException?\n\n\nboolean closeBecauseOfException = true;\ntry {\n    ...\n   connManager.waitForConnected(clientConnectTimeout);\n   closeBecauseOfException = false\n} finally {\n    if (closeBecauseOfException) {\n        connManager.close();\n    }\n}",
    "attachments": {
        "SOLR-4066.patch": "https://issues.apache.org/jira/secure/attachment/12553094/SOLR-4066.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Per Steffensen",
            "id": "comment-13495178",
            "date": "2012-11-12T09:44:18+0000",
            "content": "Hi Trym\n\nI believe one of the reasons that they started throwing RuntimeExceptions insted of UnknownHostException, TimeoutException etc is that the method signature has changed to not have a \"throws\"-part. They probably do not want do deal with those checked exceptions. If they want to keep the method signature this way, there is no way to get checked excpetions (like UnknownHostException and TimeoutException) out of this method - therefore the simplest solution is at least to include the actual exceptions as cause on the RuntimeExceptions - see patch SOLR-4066.patch. You could tak this patch in as a first solution, and if it just is an accident that the checked excpetions was removed from the method signature, then of course you can add them again and make sure the actual exceptions are thrown correctly. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13495183",
            "date": "2012-11-12T09:52:59+0000",
            "content": "In general it should not throw a plain message-less RuntimException, at least a message should be attached, too. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13496307",
            "date": "2012-11-13T16:35:21+0000",
            "content": "Looks like this is a dupe of SOLR-3989? And yonik just committed a fix that simply adds the exception to the runtimeexception.\n\nAny particular reason we should be more granular here Trym? "
        },
        {
            "author": "Trym Møller",
            "id": "comment-13496912",
            "date": "2012-11-14T07:10:01+0000",
            "content": "The provided solution of 3989 is fine with me, my proposal was just to keep the \"orginal\" behaviour.\nSo it can be closed for my sake.\n\nBest regards Trym "
        }
    ]
}