{
    "id": "SOLR-415",
    "title": "LoggingFilter for debug",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "logging version of analysis.jsp",
    "attachments": {
        "SOLR-415.patch": "https://issues.apache.org/jira/secure/attachment/12369881/SOLR-415.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Koji Sekiguchi",
            "id": "comment-12545853",
            "date": "2007-11-27T14:28:20+0000",
            "content": "updated for current trunk (implements ResourceLoaderAware) "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-12549277",
            "date": "2007-12-07T01:46:28+0000",
            "content": "Now the factory uses init(Map<String,String> args) instead of inform( ResourceLoader ) for its initialization (I was bit confused). Sorry for the noise. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12549660",
            "date": "2007-12-08T06:06:31+0000",
            "content": "Koji: this is an interesting idea ... i'm really curious what your use case for this is?\n\na few misc comments...\n\n1) it seems like it would be handy if the logging level could be configured via the factory as well.\n2) you might want to use token.toString() instead of building your own message ... that way it can express everything about the token (i notice you don't have the positionIncrement) and be future proofed against additional things being added later. "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-12549879",
            "date": "2007-12-10T02:06:49+0000",
            "content": "This is for debug. One of use cases in my case for example...\n\nWe use morphological tokenizer to tokenize Japanese text. To let the tokenizer analyze text, we have to have \"character level normalization\" prior to tokenization.\n\nI'll try to explain it by using English words...\n\nIf you have a text to be analyzed that includes \"colour\". And your morphological tokenizer uses American dictionary to tokenize the text, you have to normalize \"colour\" to \"color\" so that the tokenizer can look up it in the dictionary.\n\nTo implement this, I've developed MappingReader that reads mapping.txt and normalize (Japanese) characters prior to tokenizer:\n\nMappingReader -> Japanese Tokenizer -> Filters...\n\nIn this case, if MappingReader normalizes \"ou\" to \"o\", this makes a trouble in highlighter. (I used LoggingFilter to find this problem.)\n\nTo solve this problem, MappingReader has correctPosition(int pos) method to tell original position to tokenizer.\n(If this is useful for European languages (for umlaut or something...) I'm glad to open another JIRA issue.)\n\nAlso in SOLR-319, I used LoggingFilter to see SynonymFilter outputs.\n\nI'll try to include your suggestion into my patch soon.\n\nThank you. "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-12550279",
            "date": "2007-12-11T02:48:28+0000",
            "content": "attached a revised patch as Hoss kindly suggested. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13580212",
            "date": "2013-02-17T16:57:14+0000",
            "content": "Cleaning up old JIRAs, re-open if necessary. "
        }
    ]
}