{
    "id": "SOLR-3632",
    "title": "You can end up with the wrong dataDir when reloading a SolrCore.",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Test",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "This is really just a test issue.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13416356",
            "date": "2012-07-17T16:52:09+0000",
            "content": "Not in all cases - I think it somehow depends on how you initially specify the dataDir - I'm seeing this exposed in a test after working on SOLR-1781 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13416359",
            "date": "2012-07-17T16:58:13+0000",
            "content": "Explicitly setting the data dir in the SolrCore constr in reload seems to solve the issue (rather than counting on passing just the CoreDescriptor to work).  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13416402",
            "date": "2012-07-17T17:54:57+0000",
            "content": "edits\n\nThink I finally see what happens - it's perhaps mainly a test issue. After we start solr for a test, we count on the things like the datadir being resolved via a system property - then we reset that system property after starting solr so we can use it for the next solr instance we start.\n\nThis can end up being a problem for reload. We end up resolving again and the system property was not consistent I think for this particular issue the best workaround is the one I mention above - explicitly pass the dataDir that was detected at core started rather than doing any re resolving?\n\nYou lose the ability to update the data dir with a core reload though...that could be considered an odd feature to support though?\n\nProbably not worth it for a test issue - not sure how to fix the tests though... "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13417254",
            "date": "2012-07-18T17:03:10+0000",
            "content": "This is really just a test issue. "
        }
    ]
}