{
    "id": "SOLR-371",
    "title": "trigger arbitrary events by name through http interface",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "There are operational needs to trigger execution of some programs or scripts on any Solr instance.  For example, triggering a commit at the index transaction boundary instead of relaying on post commit hook or cron jobs, triggering snap pulling on demand or disable snap pulling, etc...\n\nThis obviously can be done through remote script execution over ssh.  However, the client will need to have in-depth knowledge about the Solr instances it  interacts with.  The complexity incleases when there are multiple indexes and instances for the client to manage.\n\nIf the request can be submitted through Solr HTTP interface, there can be many benefits.  It encapsulated many detail of the Solr instances to the triggering client such as the physical location of the Solr instances, machine architecture, authencation, communication channel, etc...\n\nPer Chris Hostetter, – \n\nThe existing postCommit/postOptimizefirstSearcher/newSearcher event listener tracking are part of hte SolrCore because it needs to know about them when managing the index ... but if you just wanted a way to trigger arbitrary events by name, the utility functions used in SolrCore could be reused by a custom plugin ... then you could reuse things like the RunExecutableListener from your own RequestHandler with the same solrconfig.xml syntax.\n\nthat would be a pretty cool addition to Solr ... an \"EventRequestHandler\" that takes in a single \"event\" param and triggers all of the Listeners configured for that even in the solrconfig.xml",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13579826",
            "date": "2013-02-16T16:24:13+0000",
            "content": "Cleaning up old JIRAs, re-open if necessary. Exists binary type now. "
        }
    ]
}