{
    "id": "SOLR-1647",
    "title": "Remove the option of setting solrconfig from web.xml",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "with SOLR-1621 , it is not required to have an option to set solrconfig from web.xml. Moreover editing web.xml means hacking solr itself.",
    "attachments": {
        "SOLR-1647.patch": "https://issues.apache.org/jira/secure/attachment/12428162/SOLR-1647.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12790594",
            "date": "2009-12-15T06:46:01+0000",
            "content": "this can be taken up as a separate issue . SOLR-1621 can be committed w/o this "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12794327",
            "date": "2009-12-24T06:32:16+0000",
            "content": "I plan to commit this shortly. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12794401",
            "date": "2009-12-24T12:24:02+0000",
            "content": "-1 on this patch.\n\n1. There is no reason not to keep this for a release with a warning to users that its going to be removed. You put in a deprecation tag in an earlier patch, and now your just removing it before that was ever released - there is no downside to doing this more like a real deprecation and there is upside.\n\n2. You have put no warnings or information to users about this change - you could be breaking things for some people and your doing it out of the blue - we shouldn't pull the rug out from under users like that.\n\n3. Ive I have said more than once, the current patch breaks tests that rely on this feature.\n\nI see no reason to remove it now. It should be deprecated with a warning in changes about its impending removal. And you need to provide a workaround for tests. I don't see why we don't just keep it for now. Its not hurting anything.\n\nI'd also like to be more clear on what deprecation means in Solr - I know it doesn't mean deprecating and removing before a release even goes out (that makes no sense) - and I'm not sure if it means removing in the next dot release (as Ive see that occurring recently). Can someone pipe in on whether Solr has an (in)formal policy on when deprecations should/can be removed? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12794770",
            "date": "2009-12-28T06:30:59+0000",
            "content": "I wish to remove this feature because it is a bad one not because it is hard to keep it. I am sure there are very few users using it anyway. \n\nWe can deprecate it and remove it later.  But the question is do we have to be that strict about everything? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12794806",
            "date": "2009-12-28T12:34:01+0000",
            "content": "But the question is do we have to be that strict about everything?\n\nPersonally, I would say no, we don't (and many times we have not been). I'm not -1'ing the removal of this. I think we should keep it and say its going away first, but if we didn't, I wouldn't be too upset about it.\n\nThe weight of my opposition comes from: you said your about to commit it but there is no evidence of what your going to do about warning users - you are removing a feature some may currently be counting on - and there is no work around for the tests you are breaking that rely on this feature. One fails, and others that count on it that don't fail now, will confuse people when they try and change the config for the tests, but the specified config is not actually being used. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12794839",
            "date": "2009-12-28T17:41:06+0000",
            "content": "I'm definitely not going to commit the same patch which is attached. I will ensure that all tests pass before this goes in.\n\nI was trying to find what do others have to say on this.\n\nThe warning is going to go in CHANGES.TXT. Do we have to put it anywhere else? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12795001",
            "date": "2009-12-29T02:48:17+0000",
            "content": "I'd also like to be more clear on what deprecation means in Solr - I know it doesn't mean deprecating and removing before a release even goes out (that makes no sense) - and I'm not sure if it means removing in the next dot release (as Ive see that occurring recently). Can someone pipe in on whether Solr has an (in)formal policy on when deprecations should/can be removed?\n\nWe don't really have a policy, but it's been a low priority to remove deprecations if they don't get in the way.  I think it would depend a lot on what was deprecated (how expert-level or not).\n\nSpecific to this feature,  if it isn't causing problems with development of other features, there's no reason to not deprecate it first. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12795009",
            "date": "2009-12-29T03:11:07+0000",
            "content": "I'm definitely not going to commit the same patch which is attached. I will ensure that all tests pass before this goes in.\n\nI guess this is a communication error. I took I plan to commit this shortly. as \"you are going to commit the current patch\".\n\nI guessed that you might do a few things before committing, but I have no way of knowing. When someone says that they plan to commit something shortly,\nI take it to mean something along the lines of the patch posted. As you are missing two things that are pretty major pieces to this patch (the deprecation/non deprecation approach and a good workaround\nfor the tests), I voiced my opposition to the current approach shown. Its hard for me to guess what changes you will make to this patch before you commit soon - I have to assume when you say that you are committing shortly that perhaps you will address both things correctly and perhaps you won't - you could just commit the current patch, who knows - I can't really rely on you doing anything unless you post the patch first, but you mention nothing of another patch, just of committing. Thats why I brought up the issues that I did. I can see making some last minutes changes to a patch, but these two things are fairly important to this issue I feel, and not really last minute tweaks before a commit.\n\nI'd like the opportunity to take a look at how you are going to address these two issues and (fwiw) possibly provide feedback.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872514",
            "date": "2010-05-27T22:06:57+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043782",
            "date": "2011-06-03T16:47:02+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106459",
            "date": "2011-09-16T14:51:11+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412147",
            "date": "2012-07-11T22:26:09+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429831",
            "date": "2012-08-07T03:43:27+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445577",
            "date": "2012-08-31T02:20:40+0000",
            "content": "CoreContainer.setSolrConfigFilename seems to have been removed at some point in the past, resolving. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13654177",
            "date": "2013-05-10T10:34:18+0000",
            "content": "Closed after release. "
        }
    ]
}