{
    "id": "SOLR-4493",
    "title": "Search all fields (possibly with *:searchtext syntax)",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Wish",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Someone came into the #solr IRC channel wanting some help with duplicating their Lucene work in Solr.  One of the things they are doing in Lucene is finding all searchable fields and constructing a boolean query against all of those fields for their search text.  They said that they had asked in #elasticsearch about this and gotten an affirmative answer as to whether they could use *:searchtext to search all fields in that program.\n\nI have seen this exact question come up a few times in IRC and the mailing list.  I know that if this feature is implemented, it will likely be a performance killer, and thus it's not really a good idea to actually use in production, but we have a couple of reasons for doing it: 1) The competition does it. 2) Users keep asking how to do it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13585136",
            "date": "2013-02-23T15:01:03+0000",
            "content": "It may be beneficial to log a message at WARNING whenever the feature is used, saying that searching all fields causes performance problems.  A few thousand of those messages in a user's log might make them think twice about it. \n\nI did search Jira for a previous issue on this topic before filing this one. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636826",
            "date": "2013-04-19T20:13:37+0000",
            "content": "Pinging on this issue.  I don't know how to fix it myself.\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        }
    ]
}