{
    "id": "SOLR-5748",
    "title": "Introduce autoManageReplicas collection property",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I propose to introduce a collection property called autoManageReplicas. This will be used only with the ZK as truth mode.\n\nIf set to true, then whenever the number of replicas for a shard fall below the replicationFactor and the down nodes do not come back up for a configurable amount of time, additional replicas will be started up automatically. Similarly, if the actual number of replicas is equal to or greater than replicationFactor then if old (previously down) nodes come back up then they will not be allowed to join the shard and will be unloaded instead.\n\nI think we should not unload running shards if number of replicas are more for now. We can change that later if needed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13905616",
            "date": "2014-02-19T16:09:28+0000",
            "content": "Something that also decreases replicas makes more sense to me. If ZK is the truth, ZK knows how many replicas there should be. If there are too many because you put some old downed servers back in rotation, or if there are not enough, it seems like the cluster should react the same way - adjust to the user specified number of replicas if possible while meeting other parameters: maxShardsPerNode, available nodes, etc. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13906829",
            "date": "2014-02-20T10:11:54+0000",
            "content": "Something that also decreases replicas makes more sense to me\n\nThe idea was suggested by Yonik in an earlier discussion. See https://issues.apache.org/jira/browse/SOLR-4808?focusedCommentId=13692130&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13692130\n\nWe can have just one property, say 'autoManageReplicas' which can be used for both creating as well as destroying replicas as long as replicationFactor is configurable per-shard. Otherwise there are use-cases where separating the two properties would make sense.\n\nI'm going to rename this issue and the property to autoManageReplicas. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13907177",
            "date": "2014-02-20T16:58:59+0000",
            "content": "It is OK to prevent new replicas from coming up but it should not kill a replica if someone decreased the replicationFactor with modifyCollection API "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13907201",
            "date": "2014-02-20T17:20:41+0000",
            "content": "Explain your reasoning. If someone decreases the replicationFactor, that's obviously exactly what they want. "
        },
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-13917358",
            "date": "2014-03-02T11:04:03+0000",
            "content": "How do you plan to locate the replicas? It would be good to have some kind of control over where the additional replicas will be so that the installation could decide that based on the disk space, memory availability etc. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13939479",
            "date": "2014-03-18T17:06:25+0000",
            "content": "\n\nIt would be good to have some kind of control over where the additional replicas \n\nwhere means? which node or where on the file system? "
        },
        {
            "author": "Steve Davids",
            "id": "comment-14939199",
            "date": "2015-10-01T02:43:36+0000",
            "content": "Due to the continued comments about an impending \"ZK as truth\" switch for the 5.x branch, I went ahead and attempted to start using the Collection API and found it to be be a bit more burdensome than the classic mode. This particular ticket would go a long way to making the adding/removing replica process easy. I documented some of the annoyances in this thread: http://markmail.org/message/qungxgiab6njslpu\n\nAs for the previous comment: \nIt would be good to have some kind of control over where the additional replicas will be so that the installation could decide that based on the disk space, memory availability etc.\n\nThat is now taken care of via SOLR-6220 "
        }
    ]
}