{
    "id": "SOLR-11409",
    "title": "A ref guide page on setting up solr on aws",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "7.2",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "It will be nice if we have a dedicated page on installing solr on aws . \n\nAt the end we could even link to http://lucene.apache.org/solr/guide/6_6/taking-solr-to-production.html",
    "attachments": {
        "quick-start-aws-security-2.png": "https://issues.apache.org/jira/secure/attachment/12894126/quick-start-aws-security-2.png",
        "quick-start-aws-security-1.png": "https://issues.apache.org/jira/secure/attachment/12894127/quick-start-aws-security-1.png",
        "SOLR-11409_followup_minor.patch": "https://issues.apache.org/jira/secure/attachment/12896279/SOLR-11409_followup_minor.patch",
        "SOLR-11409.patch": "https://issues.apache.org/jira/secure/attachment/12894232/SOLR-11409.patch",
        "quick-start-aws-key.png": "https://issues.apache.org/jira/secure/attachment/12894128/quick-start-aws-key.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-29T15:23:13+0000",
            "content": "I will try to cook up a patch and request for review and feedback by next week. ",
            "author": "Amrit Sarkar",
            "id": "comment-16185975"
        },
        {
            "date": "2017-10-07T11:15:56+0000",
            "content": "Setting up single node solr on AWS is almost same as setting up on local machine. Initial AWS EC2 instance setup, wget solr-X.X.X.tar.gz and install java, that's it. Rest the same.\n\nVarun Thacker,\n\nWhat exactly the aim of this ref guide page should be? A multi-node solr cloud setup? If yes, 3 total nodes, 1 node for zookeeper, and 2 for solr nodes, and configuring security for the respective nodes?\n\nWe can have two sub-pages; single node and multi-node. Looking forward to your thoughts. ",
            "author": "Amrit Sarkar",
            "id": "comment-16195655"
        },
        {
            "date": "2017-10-24T02:38:15+0000",
            "content": "Uploaded first patch without images and clickable links to get the work going. Will upload the entire patch very soon. ",
            "author": "Amrit Sarkar",
            "id": "comment-16216207"
        },
        {
            "date": "2017-10-26T13:21:42+0000",
            "content": "Uploading patch with all the content in proper format. Would appreciate comments, feedback and modifications as necessary. ",
            "author": "Amrit Sarkar",
            "id": "comment-16220418"
        },
        {
            "date": "2017-10-26T21:58:03+0000",
            "content": "Fixed some silly typos and add env variables in .bashrc. All set from my end. Again, constructive modifications are appreciated. ",
            "author": "Amrit Sarkar",
            "id": "comment-16221302"
        },
        {
            "date": "2017-11-02T21:12:45+0000",
            "content": "Amrit Sarkar: I'm reviewing this new page, and noted one discrepancy I'm not clear about. At the top of the page, you write that the quick start is not meant for production systems, but in the Appendix you note that for production one should have a ZK ensemble of at least 3 nodes. \n\nIs it recommended to never deploy a production system to EC2? Or you could do it if you put an ensemble into place?\n\nIOW, are there reasons other than ZK why someone should avoid deploying a production Solr to EC2?  ",
            "author": "Cassandra Targett",
            "id": "comment-16236605"
        },
        {
            "date": "2017-11-03T13:42:47+0000",
            "content": "Thank you Cassandra,\n\nbq .At the top of the page, you write that the quick start is not meant for production systems, but in the Appendix you note that for production one should have a ZK ensemble of at least 3 nodes.\n\nWe can remove \"Note for production one should have a ZK ensemble of at least 3 nodes.\" as this qucik start is not meant for production and leave that bit of information to \"Setting Zookeeper ensemble .....\", I understand it contradict the intro statement. I can remove that \"bold\" NOTE and upload new patch, let me know.\n\nIs it recommended to never deploy a production system to EC2? Or you could do it if you put an ensemble into place?\n\nNo, we can safely deploy production system on EC2 instances. The quick start is the base to understand how to establish a dev environment but need further pointers for production and this page doesn't serve that. ",
            "author": "Amrit Sarkar",
            "id": "comment-16237607"
        },
        {
            "date": "2017-11-03T14:03:46+0000",
            "content": "I can remove that \"bold\" NOTE and upload new patch, let me know\n\nSince I'm working on it already I'll fix it up, thanks for offering.\n\nwe can safely deploy production system on EC2 instances. The quick start is the base to understand how to establish a dev environment but need further pointers for production\n\nI'll make this point a bit more clear also. ",
            "author": "Cassandra Targett",
            "id": "comment-16237633"
        },
        {
            "date": "2017-11-06T21:32:24+0000",
            "content": "Commit 118c6f5f7b1e751cb191fece3a30d80aa797221b in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=118c6f5 ]\n\nSOLR-11409: Add tutorial for deploying Solr on EC2 ",
            "author": "ASF subversion and git services",
            "id": "comment-16240942"
        },
        {
            "date": "2017-11-06T21:32:52+0000",
            "content": "Commit 0400fc86ca2fab5fea33fcdafb4a9f58af21ad84 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0400fc8 ]\n\nSOLR-11409: Add tutorial for deploying Solr on EC2 ",
            "author": "ASF subversion and git services",
            "id": "comment-16240943"
        },
        {
            "date": "2017-11-06T21:36:40+0000",
            "content": "Thanks Amrit Sarkar!  This is now committed to master & branch_7x.\n\nI ended up changing a few things from your last patch - the title of the page as the biggest one. I thought positioning it a bit more as a tutorial was better, and I clarified some of the things you need for production also. I also shortened the Appendix a little to make it a bit more clear that the setup was mostly the same except for a couple of parameters.\n\nIf you see anything that looks wrong, let me know and I'll fix it. ",
            "author": "Cassandra Targett",
            "id": "comment-16240948"
        },
        {
            "date": "2017-11-06T22:10:14+0000",
            "content": "The guide looks great!!\n\nI uploaded a patch with two minor edits. If it looks fine I can commit it\n\nOne question for which I don't have an answer to: While editing the zoo.cfg file should we be recommending any particular heap settings? \n\nMaybe we could add an example of how to enable log rotation ( if the default doesn't already ) and GC logging? ",
            "author": "Varun Thacker",
            "id": "comment-16240994"
        },
        {
            "date": "2017-11-07T16:28:10+0000",
            "content": "Varun Thacker,\n\nI see the change dataDir; we need absolute path for dataDir; since zookeeper_data is not yet been created, let's do the below\n\n\n# create data dir for ZooKeeper, edit zoo.cfg, uncomment autopurge parameters\n$ mkdir ~/zookeeper_data\n$ vim conf/zoo.cfg\n# -- uncomment --\nautopurge.snapRetainCount=3\nautopurge.purgeInterval=1\n# -- edit --\ndataDir=/home/ec2-user/zookeeper_data\n\n\n\nI can create a patch for it, but it would be minor for you to commit; so let me know. ",
            "author": "Amrit Sarkar",
            "id": "comment-16242310"
        }
    ]
}