{
    "id": "SOLR-5284",
    "title": "Solr Admin shows error message in Links GUI, even though no error",
    "details": {
        "affect_versions": "4.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Using the Links browser, when I browse to /solr/ the default admin interface shows the SolrCore error message \"SolrCore Initialization failure\", even though there was no error!  The CSS I think isn't properly hiding that standard div.",
    "attachments": {
        "Solr_Admin_Error.png": "https://issues.apache.org/jira/secure/attachment/12644139/Solr_Admin_Error.png",
        "solr-error.png": "https://issues.apache.org/jira/secure/attachment/12605556/solr-error.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Eric Pugh",
            "id": "comment-13780374",
            "date": "2013-09-27T20:55:47+0000",
            "content": "Screenshot of the CSS error.   Links is a critical browser  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13782993",
            "date": "2013-10-01T14:33:51+0000",
            "content": "That reminds me a bit of SOLR-5185?  Lynx doesn't support CSS nor Javascript .. so there isn't much we can do about it? "
        },
        {
            "author": "Jeff Lord",
            "id": "comment-13993751",
            "date": "2014-05-09T17:50:15+0000",
            "content": "Actually I think this might be any browser. Maybe there is some confusion \nSOLR-5870 was fixed to ensure that errors were shown on the admin UI.\nThe issue might be something like this.\n1. run solrctl with the missing/wrong parameter that causes a SolrCore Initialization failure.\nError message is displayed in webui (screenshot using Chrome attached).\n2. run solrctl again this time with the right command and the initialization is successful.\nThe error persists in the admin ui until the solr service is bounced.\n "
        },
        {
            "author": "Jeff Lord",
            "id": "comment-13993754",
            "date": "2014-05-09T17:52:42+0000",
            "content": "Perhaps the webui should provide a facility for one to acknowledge the error and clear? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13995425",
            "date": "2014-05-12T18:34:37+0000",
            "content": "Jeff, i don't know what exactly solrctl is, but since your screen shows a *.cloudera.com hostname, i guess that is something they've added for their release?\n\naside that .. you're raising a different issue within this one. the original one is about Lynx .. which just has no CSS-/Javascript-Handling at all - therefore is not able to hide/show anything dynamically. if it's in the HTML-Code .. it's visible, it's not.\n\nif you like to see that kind of functionality, please open another issue - i'm going to close that one. "
        }
    ]
}