{
    "id": "SOLR-2817",
    "title": "Search result with grouping activated delivers wrong numFound value and breaks pager.",
    "details": {
        "affect_versions": "3.4",
        "status": "Closed",
        "fix_versions": [
            "3.4"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I use the 3.4 brach of solr for grouping my results, but obviously there is something wrong in my eyes. If I activate the grouping functionality I get the expected results. In my case for example 4 rows, but the the numFound value says it has 26 results. \n\nThis result is used by the Apache Solr Library in Drupal to calculate the correct pager on my website. Now I get a search result page with 4 results and a confused pager with 3 more steps to not existing search pages.\n\nI try a lot of things including using a facet and all the other suggested things by google but I couldn't change the numFound value to the correct one in my case.\n\nIf I not use the group.main=true setting including a facet I get in the facet conclusion the correct values of found results but it also say matches 6 (numFound=6). The Apache Solr Library make it nesessary to use the group.main=true setting because without this value the library is not able to parse the resultset. So I get always an empty website without any results even solr answers correctly.\n\nIs it somehow possible to change the numFound value to the correct one of the group count result. I think nobody groups a field and shows maybe 10 entries which belong to the request and tell the user we have 200 other things which are not interesting you. But I have to tell you... \n\nAny help is apreciated to get some understanding why solr delivers me this numFound result and how to fix this issue.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "bronco",
            "id": "comment-13122520",
            "date": "2011-10-07T04:06:55+0000",
            "content": "A little edit:\nThis is the result without group.main=true. As you can see the numFound value is correct with 2 and matches say 6. \n<lst name=\"grouped\">\n<lst name=\"site\">\n<int name=\"matches\">6</int>\n<arr name=\"groups\">\n<lst>\n<str name=\"groupValue\">http://www.domain-1.com</str>\n<result name=\"doclist\" numFound=\"2\" start=\"0\" maxScore=\"0.64790744\"><doc>\n<float name=\"score\">0.64790744</float>\n<str name=\"body\">\n\n</str>\n\n\nwithout the group.main setting\n<result name=\"response\" numFound=\"6\" start=\"0\" maxScore=\"0.64790744\">\n<doc><float name=\"score\">0.64790744</float>\n<str name=\"body\">\n\n</str>\n\nI hope this makes it more clear. "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13122618",
            "date": "2011-10-07T08:33:59+0000",
            "content": "Hi Bronco, this is not a bug. It is just how grouping works. If you want a grouped total count you need to use:\ngroup.ngroups=true\n\nThis will add the number of groups to your result, together with the number of matches (numFound). The catch is that when you use group.main=true that this information is not returned to the client (although the group count is computed). The group.main=true returns the normal response to be compatible with clients that don't understand the grouped response, the price you pay is that you don't have access to grouped related information. The numFound has always returned the number of documents found, not the number of groups found. I believe for that reason the numFound represents the number of matches and not number of documents.\n\nI think the best way to fix this is let the Drupal plugin parse the grouped response (which the default when using grouping). It is very likely that in the future more grouped related information is added to the grouped response, which is not available in the normal response.  "
        },
        {
            "author": "bronco",
            "id": "comment-13123358",
            "date": "2011-10-08T03:12:35+0000",
            "content": "Ahhhhhaaaa! Thx for your clear explanation. I used the group.ngroups=true and it really shows the results as expected and I thought it would change also the numFound value, because these are real available documents in my case. \n\nConclusion: I have to talk to the Drupal developers because its a parsing problem of the resultset, but didn't break that the numFound functionality? I mean it makes the use of the numFound value in relation with the group.main=true function senseless. You will always get the wrong number of found results / documents, whatever you try.\n\nAlso you can see in the grouping resultset without group.main=true is the numFound entry correct (with group.ngroups=true also without that setting in my case). Wouldn't it be a good idea to get another option for example group.main.numFound=true to overwrite the numFound values if I use the group.main functionality? \n\nI understand the group.main=true setting just as a simple output transformer. http://wiki.apache.org/solr/FieldCollapsing\n\nI think it's easier for me  of course but also for all the projects which use the Apache Solr PHP Library like in my case the Drupal community. Nothing has to be changed and proofed and works as expected but gets another usefull feature out of the box and which is still easy to implement in the existing system! \n\nOf course it didn't solve all problems and still limits the usecase with the group.main=true setting. Specially if you extend the grouping functionality with more features as you say, but I think this is another thing and should be discussed if the new feature is available.\n\n "
        },
        {
            "author": "bronco",
            "id": "comment-13123398",
            "date": "2011-10-08T06:47:22+0000",
            "content": "Additional code was nessesary for the Apache Solr Php Library. I commit the changes to the team for review "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13123457",
            "date": "2011-10-08T12:13:44+0000",
            "content": "\nConclusion: I have to talk to the Drupal developers because its a parsing problem of the resultset, but didn't break that the numFound functionality? I mean it makes the use of the numFound value in relation with the group.main=true function senseless. You will always get the wrong number of found results / documents, whatever you try.\nWell, pagination well never work properly. So that is an issue. On the other hand numFound represents the number of documents. Maybe we need another http option that explicitly changes the meaning of numFound to represent the number of groups? Something like:\ngroup.main.numFound.grouped=true  "
        },
        {
            "author": "bronco",
            "id": "comment-13126425",
            "date": "2011-10-13T08:21:05+0000",
            "content": "Yes I had the same Idea and would subscribe this feature. I had some talks with the guys from Drupal and they want to extend their search with this feature and they asked me if  I could make a patch for this. Before I want to start I think it would be good to get in touch with the other developers, so I contacted the developers of the apache solr php library. As I understand he offers me a plugin system for additional code parsing. This would be great specially if yout extend the grouping function. So we have several chances to make the modules play nce together. Independent from the group.main.numFound.grouped=true this is still a good idea. "
        }
    ]
}