{
    "id": "SOLR-5077",
    "title": "Inconsistencies in solrconfig upload limits - examples and test-files",
    "details": {
        "affect_versions": "4.4",
        "status": "Closed",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Done"
    },
    "description": "In the various solrconfig.xml files, there is no consistency in how the request parser upload limits are configured.  In some of them, only multipartUploadLimitInKB is configured.  In others, formdataUploadLimitInKB is also defined.  Most of them have a multipart value of 2048, but a few (including the main example) have 2048000, which represents nearly 2GB instead of 2MB.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13720492",
            "date": "2013-07-26T07:32:19+0000",
            "content": "It seems to me that formdataUploadLimitInKB is typically more useful than its multipart cohort, so IMHO we need that in all the examples.  We probably do NOT need either setting in the test-files configs.  I'm not sure that the multipart version needs to be there, but I'm OK with it remaining.  I'd just like to get a feel for what everyone thinks is the best way to go.\n\nI think we probably want to change all the 2048000 entries to 2048.  I doubt that any of the tests actually need a multipart buffer that big, but if any do, please let me know.\n\nOff to bed, I'll make a patch tomorrow. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971073",
            "date": "2014-04-16T12:57:05+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16018588",
            "date": "2017-05-20T18:52:49+0000",
            "content": "Working with SOLR-9623, I think the solrconfig should reflect code-defaults, i.e. if we keep this section in examples, it should be 2048, not 2048000 "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16018889",
            "date": "2017-05-21T17:09:32+0000",
            "content": "Shawn Heisey are you planning to move on with this? If not I'll fold this in SOLR-9623. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16056306",
            "date": "2017-06-20T19:18:32+0000",
            "content": "Done in SOLR-9623 "
        }
    ]
}