{
    "id": "SOLR-6071",
    "title": "Make solr install like other databases",
    "details": {
        "affect_versions": "6.0",
        "status": "Closed",
        "fix_versions": [
            "4.10.1"
        ],
        "components": [
            "scripts and tools"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It's long past time that Solr should have proper startup and log scripts. \n\nThere are a number of reasons and much evidence why we should start including them:\n\n1. In Solr-4792 we removed the war file from the distribution making it easier than ever before to set solr up with these scripts.\n2. The StackOverflow question on this topic has been viewed more than 34k times and has several differing answers.\n3. For non-java developers, figuring out the right way to start and daemonize Solr isn't obvious. Right now, my installation has a number of java flags that I've accumulated over the years (-jar means what? -server is only needed on 32 bit machines? -xMX huh?) This leads to varied deployments and inconsistencies that common scripts could help alleviate.\n4. Anecdotally I've heard endless bashing of Solr because it's such a pain to get set up. \n5. Solr is unlike any other database I know in the grittiness of starting it up.\n6. Not having these scripts makes Solr look less polished than it would otherwise.\n\nWe discussed this on IRC a bit yesterday and there didn't seem to be any opposition to doing this. Consensus seemed to be simply that it hadn't been done...yet.\n\nI am not an expert on these things, but I think we should get something put together for Solr 5, if there's time. Hopefully this thread can get the ball rolling – I didn't see any previous discussion anywhere. Apologies if I missed it. \n\nThis would be a great improvement to Solr.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Timothy Potter",
            "id": "comment-14143472",
            "date": "2014-09-22T17:27:29+0000",
            "content": "I think I've addressed all these issues in the bin/solr script provided by SOLR-3617. Please close out if you agree. "
        },
        {
            "author": "Mike Lissner",
            "id": "comment-14143509",
            "date": "2014-09-22T17:44:01+0000",
            "content": "Looks like some serious progress. Thanks so much for picking this up. "
        }
    ]
}