{
    "id": "SOLR-11257",
    "title": "Only setting maxThreadCount for ConcurrentMergeScheduler (which is a user error) leads to a confusing validation error msg.",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I tried tuning the maxThreadCount for my Concurrent scheduler using:\n\n\n <mergeScheduler class=\"org.apache.lucene.index.ConcurrentMergeScheduler\">\n          <int name=\"maxThreadCount\">4</int>\n       </mergeScheduler>\n\n\nand got:\n\nValidation errors:\nError: java.lang.IllegalArgumentException:java.lang.IllegalArgumentException: both maxMergeCount and maxThreadCount must be AUTO_DETECT_MERGES_AND_THREADS\n\n\n\nHmmm ... don't know what that means? As I user I need a better error message than that ^ Of course looking at the code, it seems I must also set: maxMergeCount but that error doesn't tell me that. So this bug is about fixing up the error to be more helpful to the user. Of course this is advanced functionality, so maybe expecting me to read the code to understand, in which case, just close this as invalid.",
    "attachments": {
        "SOLR-11257.patch": "https://issues.apache.org/jira/secure/attachment/12885082/SOLR-11257.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-02T15:02:23+0000",
            "content": "Timothy Potter,\n\nI faced the similar confusion configuring either of the maxThreadCount and maxMergeCount. AUTO_DETECT_MERGES_AND_THREADS is resolved to -1, so better providing that information than the constant variable name.\n\nAlso, ConcurrentMergeScheduler is part of Lucene, shouldn't we discuss this issue in LUCENE project. Nevertheless, I attached a patch, just changed the error message as you mentioned:\n\nBoth maxMergeCount and maxThreadCount should be passed (unless default '-1') or None ",
            "author": "Amrit Sarkar",
            "id": "comment-16151521"
        },
        {
            "date": "2017-10-09T13:38:58+0000",
            "content": "Discussion on LUCENE-7980, leads to we should handle this at Solr end. Updated patch: SOLR-11257.patch. ",
            "author": "Amrit Sarkar",
            "id": "comment-16196963"
        }
    ]
}