{
    "id": "SOLR-3955",
    "title": "Return only matched multiValued field",
    "details": {
        "affect_versions": "4.0",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Assuming a multivalued, stored and indexed field named \"comment\". When performing a search, it would be very helpful if there were a way to return only the values of \"comment\" which contain the match. For example:\n\nWhen searching for \"gold\" instead of getting this result:\n\n<doc>\n    <arr name=\"comment\">\n        <str>Theres a lady whos sure</str>\n        <str>all that glitters is gold</str>\n        <str>and shes buying a stairway to heaven</str>\n    </arr>\n</doc>\n\nI would prefer to get this result:\n\n<doc>\n    <arr name=\"comment\">\n        <str>all that glitters is gold</str>\n    </arr>\n</doc>\n\n(psuedo-XML from memory, may not be accurate but illustrates the point)\n\nThanks.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Sandeep Tucknat",
            "id": "comment-13590645",
            "date": "2013-03-01T15:41:55+0000",
            "content": "This is especially important in a spatial search since there's an important business case of finding the branches/locations for an entity within a spatial filtering query. While the multi-valued spatial field implementation provides for filtering and scoring, it does not return this information to the client at the moment.\n\n\nPS : I am relatively new to Solr and SE in general but have years of Java coding and debugging experience. I'd love to help resolve this if someone can point me in the right direction and something more than 'hook it up to the debugger and start looking' would be appreciated. "
        },
        {
            "author": "Jeff Geerling",
            "id": "comment-14086279",
            "date": "2014-08-05T13:51:05+0000",
            "content": "To echo Sandeep's comment above; this would be a very useful feature for multivalued geospatial search; currently, with geo search, you can have dist returned in your search results (so you can give km/mi distance to a user), but not a latitude/longitude pair, or any other specific information.\n\nCurrently, the workaround is to take each returned result and calculate all address distances in our application code, then display the address that is nearest to the original lat lon value. "
        },
        {
            "author": "David Smiley",
            "id": "comment-14086301",
            "date": "2014-08-05T14:17:23+0000",
            "content": "I could imagine a new SearchComponent similar to the highlighter (specifically the default highlighter) what would create a MemoryIndex for each value and test the search to see if it matched.  Though it would be faster if there were specific optimizations for certain queries like spatial in which doing that is way more work than a simple shape intersection test.  I guess that would be best done as a separate specialized SearchComponent. "
        },
        {
            "author": "Jacob Xu",
            "id": "comment-14169192",
            "date": "2014-10-13T11:21:50+0000",
            "content": "This is a urgent issue that should be concerned. Specially, when the multiValued filed has large number of values (>1K), it will cost high memory and I/O to return all values. "
        },
        {
            "author": "Eric Schoen",
            "id": "comment-15198479",
            "date": "2016-03-17T00:29:54+0000",
            "content": "This would also be helpful for applications in which hierarchical faceting needs to be combined with a hierarchy search function. (For example, when using a Javascript component such as jstree to incrementally drill down in to a large collection of facet values, while offering the ability to search for facet values as well.) "
        }
    ]
}