{
    "id": "SOLR-5264",
    "title": "New method on NamedList to return one or many config arguments as collection",
    "details": {
        "affect_versions": "4.5",
        "status": "Resolved",
        "fix_versions": [
            "4.6",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In the FieldMutatingUpdateProcessorFactory is a method called \"oneOrMany\" that takes all of the entries in a NamedList and pulls them out into a Collection.  I'd like to use that in a custom update processor I'm building.\n\nIt seems as though this functionality would be right at home as part of NamedList itself.  Here's a patch that moves the method.",
    "attachments": {
        "SOLR-5264.patch": "https://issues.apache.org/jira/secure/attachment/12604680/SOLR-5264.patch",
        "SOLR-5264-boolean.patch": "https://issues.apache.org/jira/secure/attachment/12606519/SOLR-5264-boolean.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13775715",
            "date": "2013-09-23T22:18:13+0000",
            "content": "Attaching patch.  I'm sure there's a lot to not like about it, so I'd like comments in two areas.  1) Is the general idea sound?  2) What specifically could be done better?\n\nIt did occur to me that the more generic method I mentioned in the TODO would in fact be the best approach right up front.  That would name the method removeCollection instead of removeArgsCollection, returning Collection<Object>.  It would then be up to the caller to decide what object types constitute an error condition.  Thoughts? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13775798",
            "date": "2013-09-23T23:35:51+0000",
            "content": "Patch isn't complete. I will fix and re-upload later. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13777917",
            "date": "2013-09-25T18:57:45+0000",
            "content": "Updated patch.  No compilation errors.  Running tests.\n\nStill need to make a test for the new method. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13778011",
            "date": "2013-09-25T20:06:21+0000",
            "content": "I've thought of a new approach.  There is already a getAll method.  I can implement a removeAll method that's very similar to getAll.  I can then re-do the method I've created here, renaming it to removeArgs:  Start with getAll.  Go through that list and build a collection, throwing an exception if any found values are not Strings.  Finally, delete the matching values and return the collection. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13778081",
            "date": "2013-09-25T21:05:56+0000",
            "content": "New patch.  Adds methods to NamedList: public methods removeAll and removeArgs, private method killAll.  Removes the oneOrMany method from FieldMutatingUpdateProcessorFactory.  Adds tests for new methods, improves one existing test.  I am seeing a replication stress test failure, but I don't think it's related to these changes.  The patch has a conflict on branch_4x, so I haven't done any testing there yet.\n\nAll this so I can use removeArgs in my own custom update processors!\n\nPlease let me know if there is any objection to committing this after making sure branch_4x is good. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13780912",
            "date": "2013-09-28T18:04:30+0000",
            "content": "New patch.  This one deprecates oneOrMany rather than removing it.  Removal can be handled in a future version.  I was thinking 4.7 or 4.8. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13781190",
            "date": "2013-09-29T00:40:45+0000",
            "content": "The idea seems good to me.  All Solr tests pass for me on trunk with the patch applied.\n\nA few nits:\n\n\n\tremoveAll and removeArgs don't look very different, but they do different things.  I think their javadocs should mention each other and say how they're different from each other.\n\tI don't think removeArgs is a sufficiently descriptive name, but all attempts I've made to come up with a better one are way too long, like recursivelyRemoveAllStringArgs.  But I think we could do better somehow here.  oneOrMany is short but doesn't mention that the args are removed, so I don't think we should just use it.\n\tThe deprecation message on oneOrMany should say which version it will be removed in.  I think 5.0 is a better choice than 4.7 or 4.8, since there is already established precedent for deprecation in major version X, removal in major version X+1.  Then the trunk commit will remove it, and the branch_4x version will have the deprecation message, and there is nothing else to do (except a CHANGES.txt entry explaining this, which you should include when you commit), so this strategy is also easier to implement than removal in X.Y+1 or 2, since you have to remember to do that then.\n\n "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13781351",
            "date": "2013-09-29T12:16:24+0000",
            "content": "Thanks for the feedback.\n\n\n\tI like your idea of having removeAll and removeArgs mention each other in the javadoc.  I'll do that.\n\tI was really struggling trying to find a good name instead of removeArgs that wasn't horribly long, finally just decided to make it short.  I'm open to suggestions in that department.  The best alternative I've thought up so far is removeConfigArgs, which is more descriptive of its typical usage.  I'm inclined to make that change unless there's strong objection.\n\tPoint taken on removal in 5.0 instead of a later 4.x release.  That will be noted in the javadoc.  Am I right in thinking that it's better to make an additional trunk commit to remove the method, rather than start in 4x and merge to trunk?\n\n "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13782294",
            "date": "2013-09-30T21:42:17+0000",
            "content": "New patch.  Modifies javadoc as recommended.  Renames removeArgs to removeConfigArgs.  Does not seem to introduce any test failures. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13783160",
            "date": "2013-10-01T17:46:45+0000",
            "content": "+1 to commit.\n\nAm I right in thinking that it's better to make an additional trunk commit to remove the method, rather than start in 4x and merge to trunk?\n\nMostly people start in trunk and backport to 4x, rather than the reverse, but I think either approach can make sense, depending on context.  No hard and fast rule here. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13784636",
            "date": "2013-10-02T23:43:23+0000",
            "content": "Tests and precommit pass on trunk with patch. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13784638",
            "date": "2013-10-02T23:45:27+0000",
            "content": "Commit 1528680 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1528680 ]\n\nSOLR-5264 - move config argument retrieval/removal from Update Processor code to NamedList "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13784696",
            "date": "2013-10-03T00:42:20+0000",
            "content": "As I prepared to remove the deprecated method from trunk, I saw getBooleanArg.  I really should give that method the same treatment. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13784735",
            "date": "2013-10-03T01:38:41+0000",
            "content": "Commit 1528699 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1528699 ]\n\nSOLR-5264 removing deprecated \"oneOrMany\" method from trunk "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13784739",
            "date": "2013-10-03T01:47:29+0000",
            "content": "Commit 1528700 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1528700 ]\n\nSOLR-5264 - CHANGES.txt.  References boolean arg work that's not done yet. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13784741",
            "date": "2013-10-03T01:50:19+0000",
            "content": "Commit 1528701 from Shawn Heisey in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1528701 ]\n\nSOLR-5264: merge trunk r1528680 and r1528700. move config argument retrieval/removal from Update Processor code to NamedList "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13784802",
            "date": "2013-10-03T04:05:09+0000",
            "content": "Additional patch to move the method for removing/retrieving a boolean argument.  Already mentioned in the CHANGES.txt that has been committed. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13784806",
            "date": "2013-10-03T04:13:47+0000",
            "content": "Additional patch to move the method for removing/retrieving a boolean argument. Already mentioned in the CHANGES.txt that has been committed.\n\n+1 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13785451",
            "date": "2013-10-03T19:12:32+0000",
            "content": "Commit 1528976 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1528976 ]\n\nSOLR-5264: move getBooleanArg to NamedList#removeBooleanArg "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13785578",
            "date": "2013-10-03T21:54:43+0000",
            "content": "Commit 1529016 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1529016 ]\n\nSOLR-5264: Removing deprecated getBooleanArg from trunk. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13785586",
            "date": "2013-10-03T22:04:55+0000",
            "content": "Commit 1529020 from Shawn Heisey in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1529020 ]\n\nSOLR-5264: merge trunk r1528976, move getBooleanArg to NamedList#removeBooleanArg "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13785587",
            "date": "2013-10-03T22:05:48+0000",
            "content": "Before each individual commit, tests and precommit passed. "
        }
    ]
}