{
    "id": "SOLR-4173",
    "title": "SolrJ API base URL returns 404 - print helpful message instead",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "If you put the URL that's correct for an API like SolrJ into a browser, you get a 404 error.\n\nIt would be really helpful if it were to instead display a helpful message letting a user know that they have accessed the core's base URL, which is only useful in API calls.\n\nIt should offer a link with its own URL as a handy place to right-click & copy.  That self-link should either have or not have the trailing slash, according to what is the current recommended practice.  Side note: I do include the trailing slash in my SolrJ URLs.\n\nThe message should probably also offer a link back to the admin GUI page for that core, and any other links that people might find useful.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13561265",
            "date": "2013-01-24T00:20:25+0000",
            "content": "was chatting with steffkes about this a bit on IRC, my suggesting would be to modify SolrDispatchFilter such that:\n\n\n\tIf a valid core is found, AND\n\tIf there is no handler path specified (ie: \"\" or \"/\", not \"/bogus\" which the core says isn't registered to anything)\n\n\n\nThen redirect the request to \"/webappname/#/corename\" (ie: the main view of that core in the admin UI).   Alternatively, if we really want to give the user a \"you are miss-using the SolrJ URL\" yep screen, then redirect to \"/webappname/#/corename/access_url\" and implement that as a new HTML/jquery/whatever screen.\n\nThe place to put this redirect would be somewhere arround L229 of SolrDispatchFilter...\n\n\n          // Determine the handler from the url path if not set\n          // (we might already have selected the cores handler)\n          if( handler == null && path.length() > 1 ) { // don't match \"\" or \"/\" as valid path\n\n "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636760",
            "date": "2013-04-19T19:29:48+0000",
            "content": "This is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        }
    ]
}