{
    "id": "SOLR-8047",
    "title": "large longs is being saved incorrect",
    "details": {
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3",
        "status": "Resolved",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "I have a solr schema with a field in long type\n\n<field name=\"source_raw_hash\" type=\"long\" indexed=\"true\" stored=\"true\"/>\n\nthe long type in the schema is the default:\n\n<fieldType name=\"long\" class=\"solr.TrieLongField\" precisionStep=\"0\" positionIncrementGap=\"0\"/>\n\nI am saving to the index in solrJ, the value: 3954983690244748504 to this field, but it's being saved as 3954983690244748300\n\nI am having the same with different large values.\n\nI also tested it from admin UI, adding the same long and it's being saved incorrect",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-15T03:29:08+0000",
            "author": "Erick Erickson",
            "content": "Please bring this kind of thing up on the user's lit first, as it tends to get more eyeballs. In this case I vaguely recall something similar that indicated this was a browser issue rather than a problem with Solr. Since you're using SolrJ, you can test whether this is the case pretty easily by querying for the document and examining the results. I'd query two ways\n1> query the doc ID and examine the long field\n2> query for the value as you indexed it\n\nIn fact this latter could be done from a URL, just q=source_raw_hash:3954983690244748504 and see if the ID of the doc in question comes back. It'd be particularly indicative if the browser display displayed 3954983690244748300 ",
            "id": "comment-14744772"
        },
        {
            "date": "2017-05-19T18:49:12+0000",
            "author": "Erick Erickson",
            "content": "Now that I spent much of a day chasing down SOLR-10708 I realized that the numbers are being stored and retrieved just fine. What's not being done is the browser rendering the numbers correctly, Solr is just fine.\n\nTo prove this to yourself, issue the query via curl and you'll see that the long values are returned correctly. ",
            "id": "comment-16017828"
        }
    ]
}