{
    "id": "SOLR-3897",
    "title": "Preserve multi-value fields during hit highlighting",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1"
        ],
        "components": [
            "highlighter"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The behavior of the default Solr hit highlighter on multi-value fields is to only return the values that have a hit and sort them by score.\n\nThis ticket supplies a patch that adds a new highlight parameter called \"preserveMulti\" which can be used on a feild by field basis to return all of the values in their original order. If this parameter is used, the values that have a hit are highlighted and the ones that do not contain a hit are returned un-highlighted.\n\nThe \"preserveMulti\" parameter works with the default standard highlighter and follows the standard highlighting conventions.\n\nSample usage for a field called \"cat\":\n\nf.cat.hl.preserveMulti=true",
    "attachments": {
        "SOLR-3897.patch": "https://issues.apache.org/jira/secure/attachment/12546751/SOLR-3897.patch",
        "SOLR-3897_snippets.patch": "https://issues.apache.org/jira/secure/attachment/12548412/SOLR-3897_snippets.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Joel Bernstein",
            "id": "comment-13466921",
            "date": "2012-10-01T16:38:09+0000",
            "content": "Added test case. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13467683",
            "date": "2012-10-02T12:51:38+0000",
            "content": "This looks like a reasonable feature - I plan on committing as-is unless someone comes up with a better name than \"preserveMulti\" "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13468072",
            "date": "2012-10-02T21:02:45+0000",
            "content": "Committed to trunk:  http://svn.apache.org/viewvc?rev=1393171&view=rev\nand 4x:  http://svn.apache.org/viewvc?rev=1393173&view=rev "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13468540",
            "date": "2012-10-03T12:59:27+0000",
            "content": "Erik asked the question \"suppose a multiValued field has two values, both get highlighted with multiple snippets\"...\n\nI had assumed that one would not request multiple snippets when using preserveMulti (or that one would use hl.fragsize=0 to get complete field values).\nBut I just checked the test and it requires snippets=2 to get both field values.\n\nSeems like for preserveMulti=true, one should get all field values regardless of the setting of snippets.\n\nShould the number of snippets per field value be capped at 1 when preserveMulti==true, or should we consider snippets to be per value rather than per field? "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13468550",
            "date": "2012-10-03T13:14:05+0000",
            "content": "I can change this so things are more automatic, by setting fragsize=0 and and snippets equal to the number field values. "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13468552",
            "date": "2012-10-03T13:24:21+0000",
            "content": "Since this is already committed, shall I create a new patch based on a fresh 4x pull? This would be an incremental patch for this issue. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13468555",
            "date": "2012-10-03T13:30:03+0000",
            "content": "I can change this so things are more automatic, by setting fragsize=0 and and snippets equal to the number field values.\n\nThat would work for small fields... although there may be use-cases where one does want a fragment of each field value instead of the whole field value.\n\nSince this is already committed, shall I create a new patch based on a fresh 4x pull?\n\nA fresh pull of trunk, yes.  It will also be merged back to 4x when committed. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13468571",
            "date": "2012-10-03T13:59:26+0000",
            "content": "Seems like for preserveMulti=true, one should get all field values regardless of the setting of snippets.  Should the number of snippets per field value be capped at 1 when preserveMulti==true, or should we consider snippets to be per value rather than per field?\n\nI think each field value, when preserveMulti=true, should be considered separately and all highlighting parameters for that field should apply to each field value.  Number of fragments, for example, should be per field value instance.  And I suppose this necessitates another array level in the response?   \n\nSorry if this got a fair bit more complicated than it started.  After pondering this after the original patch was committed, I realized there'd be some confusion between field values and fragments. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13468580",
            "date": "2012-10-03T14:10:56+0000",
            "content": "And I suppose this necessitates another array level in the response?\n\nI guess it depends on how widely applicable this feature is.\nIf very few will have a need for it (which I think is the case?) we should try and keep it as unobtrusive as possible.\n "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13468587",
            "date": "2012-10-03T14:37:59+0000",
            "content": "fragsize works only with the FastVectorHighlighter so if we want to ensure one fragment per field value then we will have to work with the fragmenter. The default fragmenter works in chunks of 100 characters.\n\nAt this point I'm thinking it might be best to leave it as it is. The user will have to set the snippets count but this can be documented. Each field value will be a single fragment unless the it has more then 100 characters and if this an issue then a new fragmenter can be provided. "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13468808",
            "date": "2012-10-03T20:36:27+0000",
            "content": "I was incorrect, fragsize works with the default highlighter. I still vote for leaving the original patch as it is and documenting the use of snippets and fragsize with it. This will provide flexibility to work with different use cases.\n\nAnother test case can be added to test field values with the fragsize param. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13471974",
            "date": "2012-10-09T00:18:04+0000",
            "content": "preserveMulti implies getting values back for every field value, hence we always should regardless of what snippets is set to.\nIf we aren't changing the request format, it still seems like the most sane thing is to show all field values and have exactly one snippet per field value. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13472463",
            "date": "2012-10-09T15:29:00+0000",
            "content": "Here's a patch that always lists all field values, regardless of the value of snippets.\n\nGiven that the default value of snippets is 1, this should work fine - there will be exactly one snippet generated per field value.\n\nNote that we currently show a snippet for every field value even if nothing in the field matched.  I'm not sure if this is the desirable behavior or not.  For short fields, the client could just return the field values in the document and use that if the highlighter section was missing.  But perhaps snippet generation might still be useful for long fields. "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13472643",
            "date": "2012-10-09T19:11:29+0000",
            "content": "This patch looks good to me. I think for consistency, still returning a snippet for every field even if nothing matches is the desired behavior. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13472760",
            "date": "2012-10-09T21:20:13+0000",
            "content": "committed.\ntrunk: http://svn.apache.org/viewvc?rev=1396317&view=rev\n4x: http://svn.apache.org/viewvc?rev=1396320&view=rev "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610695",
            "date": "2013-03-22T16:27:35+0000",
            "content": "[branch_4x commit] Yonik Seeley\nhttp://svn.apache.org/viewvc?view=revision&revision=1396320\n\nSOLR-3897: return a snippet for every value when preserveMulti=true "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610713",
            "date": "2013-03-22T16:28:57+0000",
            "content": "[branch_4x commit] Yonik Seeley\nhttp://svn.apache.org/viewvc?view=revision&revision=1393173\n\nSOLR-3897: hl.preserveMulti to preserve all multiValued field values when highlighting "
        }
    ]
}