{
    "id": "SOLR-2703",
    "title": "Add support for the Lucene Surround Parser",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The Lucene/contrib surround parser provides support for span queries. This issue adds a Solr plugin for this parser",
    "attachments": {
        "SOLR-2703.patch": "https://issues.apache.org/jira/secure/attachment/12489907/SOLR-2703.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Simon Rosenthal",
            "id": "comment-13081971",
            "date": "2011-08-09T22:26:13+0000",
            "content": "The most recent LUCENE-2945 patch is needed so that surround queries can be properly cached "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13081972",
            "date": "2011-08-09T22:27:23+0000",
            "content": "initial patch. No tests yet. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13082522",
            "date": "2011-08-10T18:15:02+0000",
            "content": "Nice start, Simon!\n\nBesides tests, we should probably make the maxBasicQueries a parameter too.\n\nOne issue that rears its ugly head here, unfortunately, is that the Surround parser does not analyze any of the terms thus stemming at indexing time will cause confusion/problems in trying to use this parser by most folks, I'd presume.  I don't consider lack of analysis a blocker for committing this integration, but a further issue probably should be opened to add analysis capabilities for non-wildcard terms in the query expression somehow. "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13082569",
            "date": "2011-08-10T19:06:52+0000",
            "content": "\n+1 on eventually adding analysis support to the parser. \n\nThe default (1024) for maxBasicQueries seems more than adequate but it wouldn't hurt to have it as a parameter.\n\nI found that a field simply analyzed with lowercasing and the EnglishPluralStemmer gave decent results, and wildcard searches using the base form of the term will mostly compensate for lack of stemming support - all this can be documented in the javadocs and the Wiki. "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13083464",
            "date": "2011-08-11T20:13:55+0000",
            "content": "Updated patch - adds a test suite, support for configuring maxBasicQueries in the URL, and configureing as one of the default parsers "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13096208",
            "date": "2011-09-02T18:57:51+0000",
            "content": "I got beat up on this about the Velocity dependency in Core, so I'm now weary of adding this query parser as a built-in \"surround\" registered parser since it'll add a run-time dependency on an additional JAR file.\n\nSimon - cool to remove this auto-registration and we just wire it into Solr's example configuration?  (once we get the test dependency on the example configuration trimmed out) "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13098104",
            "date": "2011-09-06T15:46:40+0000",
            "content": "New patch. Query parser not registered by default, and a commented out entry in example solrconfig was added.\n\nHopefully ready to commit "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13098106",
            "date": "2011-09-06T15:48:02+0000",
            "content": "Wiki page to follow  at http://wiki.apache.org/solr/SurroundQueryParser "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13098133",
            "date": "2011-09-06T16:21:11+0000",
            "content": "Should hold up on the commit until https://issues.apache.org/jira/browse/LUCENE-2945 patch has been committed, otherwise query caching is very broken. I updated the patch for that issue to work with trunk a few weeks ago. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13098962",
            "date": "2011-09-07T13:58:20+0000",
            "content": "Simon - thanks for the work on this.  I went back and changed the query parser to be automatically registered... I was thinking that we'd need to ship another JAR to get this to work, but we already include Lucene's queryparser JAR so might as well pre-register this parser.  That eliminated the need for the solrconfigsurround.xml in the test as well, so I removed that. "
        },
        {
            "author": "Rahul Mehta",
            "id": "comment-13155816",
            "date": "2011-11-23T11:30:25+0000",
            "content": "Please tell how  to install this patch. on solr 3.1  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13155835",
            "date": "2011-11-23T12:40:05+0000",
            "content": "Rahul:\n\nSee: http://wiki.apache.org/solr/HowToContribute for how to apply patches. However, this patch is for the trunk code line and it may not apply to 3.1. In fact I'd be surprised if it did without some work, although I haven't looked at it...\n\nNote that these are source-code patches, you have to apply them, compile (ant dist example etc) and take responsibility for doing the right thing with the results. "
        },
        {
            "author": "Jason",
            "id": "comment-13169976",
            "date": "2011-12-15T05:31:31+0000",
            "content": "Doesn't support range query? "
        },
        {
            "author": "abhimanyu",
            "id": "comment-13189658",
            "date": "2012-01-20T07:02:04+0000",
            "content": "highlighter component does not work with surround parser , are there any plugin or patches available to highlight the result set returned by using surround parser or by using surround defType. "
        },
        {
            "author": "Shalu Singh",
            "id": "comment-13219958",
            "date": "2012-03-01T11:01:56+0000",
            "content": "Hi Ahmet, i am trying to include the SOLR-2703.patch into SOLR 3.5 downloaded from SVN branches to provide Surround parser. But it is not working after including the 2703 SOLR patch. Do u know how to apply the same?? "
        }
    ]
}