{
    "id": "SOLR-3562",
    "title": "Add options to remove instance dir or data dir on core reload.",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-BETA"
        ],
        "components": [
            "multicore",
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Same scanario as SOLR-3561 - deleting shards/cores using CoreAdmin/UNLOAD command.\n\nI have noticed that when doing CoreAdmin/UNLOAD, the data-folder on disk belonging to the shard/core that has been unloaded is not deleted. I might be ok since the operation is called UNLOAD, but I basically want to delete a shard/core and all data related to it (including its data-folder).\n\nDont we have a delete shard/core operation? Or what do I need to do? Do I have to manually delete the data-folder myself after having unloaded?\n\nA delete-shard/core or even a delete-collection operation would be very nice!",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13399508",
            "date": "2012-06-22T18:46:06+0000",
            "content": "I've add this to the work I did on the collections API - it's needed there for collection removal. Should be committing a first iteration of that soon. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13399545",
            "date": "2012-06-22T19:51:42+0000",
            "content": "ill add an option both for the instanceDir and dataDir "
        },
        {
            "author": "Per Steffensen",
            "id": "comment-13400831",
            "date": "2012-06-25T19:56:13+0000",
            "content": "Nice to hear that you are working on a Collection API for dealing with this kind of stuff. Today in our application we are creating collections by creating numerous individual shards across our cluster of Solr nodes. It would be nice with some API support doing that, especially when we want to delete. Unfortunately we see some problems when we just unload all shards in a collection, in order to \"delete\" that collection - see SOLR-3561. But I will be watching SOLR-3488. Thanks alot! "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13407645",
            "date": "2012-07-06T01:22:13+0000",
            "content": "This was completed as part of SOLR-3488 - I'll add a changes entry. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13408030",
            "date": "2012-07-06T14:25:35+0000",
            "content": "Thanks Per! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412235",
            "date": "2012-07-11T22:30:31+0000",
            "content": "hoss20120711-manual-post-40alpha-change "
        }
    ]
}