{
    "id": "SOLR-2580",
    "title": "Create Components to Support Using Business Rules in Solr",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "Rules"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The goal is to be able to adjust the relevance of documents based on user defined business rules.\n\nFor example, in a e-commerce site, when the user chooses the \"shoes\" category, we may be interested in boosting products from a certain brand. This can be expressed as a rule in the following way:\n\nrule \"Boost Adidas products when searching shoes\"\n    when\n        $qt : QueryTool()\n        TermQuery(term.field==\"category\", term.text==\"shoes\")\n    then\n        $qt.boost(\"\n{!lucene}brand:adidas\");\nend\n\nThe QueryTool object should be used to alter the main query in a easy way. Even more human-like rules can be written:\n\nrule \"Boost Adidas products when searching shoes\"\n when\n    Query has term \"shoes\" in field \"product\"\n then\n    Add boost query \"{!lucene}\nbrand:adidas\"\nend\n\nThese rules are written in a text file in the config directory and can be modified at runtime. Rules will be managed using JBoss Drools: http://www.jboss.org/drools/drools-expert.html\n\nOn a first stage, it will allow to add boost queries or change sorting fields based on the user query, but it could be extended to allow more options.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Simon Rosenthal",
            "id": "comment-13046222",
            "date": "2011-06-08T21:08:00+0000",
            "content": "Tomas:l\nI'm not sure why you would want to encapsulate these kind of rules within Solr - an e-commerce site would always have an application layer between the UI and Solr which seems like the logical place to  apply business rules leading to modifying the request by adding boosts, specifying sort order, etc. \n\nAlso, is Drools separate from JBoss (which is used relatively in frequently in the Solr community) ? "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13046514",
            "date": "2011-06-09T12:57:07+0000",
            "content": "Basically, it's just another component designed to modify the relevancy of documents, as the QueryElevationComponent is. Of course, this could be implemented by each site on the application layer but I think it would be very helpful to write one reusable component, then everybody can use the same, they don't reinvent the wheel and they can invest the effort in improving it.\nShould it be included in Solr? Personally I think this is something that can be useful to many people and it will add value to Solr. At the end, the community and the committers will decide if they think this is something worthily or not.\n\nJBoss AS is the application server, but JBoss is also an organization that runs many projects (like drools). You don't need to use any application server in particular to make Drools work. It's a library, not an application itself. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13163758",
            "date": "2011-12-06T19:19:34+0000",
            "content": "I'm going to start work on this, but would like to take it a bit beyond just Drools.  As I see it, there are a number of requirements necessary to have a successful rules component:\n\n\tBoosting/reranking:\n\t\n\t\tsearch results\n\t\tfacets\n\t\tSuggestions (spellchecking, related searches, etc. once these get added)\n\t\n\t\n\tRules for adding/removing filters\n\tModify fields (via the transformers in Solr) as they come out – for instance, alter the price field\n\t(Optional) Modify documents to be indexed by rules – lower priority\n\n\n\nI think Drools would make for a nice first implementation, but I also see that we the QueryElevationComponent (or a modified version of it) is a simple form of some of these things, so the idea would be to make a thin layer in between to make the engines pluggable. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13163761",
            "date": "2011-12-06T19:25:01+0000",
            "content": "I'm going to use this issue to be the \"master\" issue and then open/link other issues.  There are some things that also need to be fixed in QEC to make it viable as an option for this stuff. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13164393",
            "date": "2011-12-07T13:46:25+0000",
            "content": "Wiki page is up: http://wiki.apache.org/solr/Business%20Rules "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412149",
            "date": "2012-07-11T22:26:09+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13424342",
            "date": "2012-07-28T13:07:32+0000",
            "content": "Grant - I'm guessing we're not getting this in for 4.0.  Shall we kill the wiki page?  (or at least make it abundantly clear that it's just pie-in-the-sky for now) "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429891",
            "date": "2012-08-07T03:44:02+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452195",
            "date": "2012-09-10T17:41:57+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717266",
            "date": "2013-07-23T18:47:40+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787080",
            "date": "2013-10-05T10:19:06+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}