{
    "id": "SOLR-731",
    "title": "CoreDescriptor.getCoreContainer should not be public",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "For the very same reasons that CoreDescriptor.getCoreProperties did not need to be public (aka SOLR-724)\nIt also means the CoreDescriptor ctor should not need a CoreContainer\n\nThe CoreDescriptor is only meant to be describing a \"to-be created SolrCore\".\nHowever, we need access to the CoreContainer from the SolrCore now that we are guaranteed the CoreContainer always exists.\nThis is also a natural consequence of SOLR-647 now that the CoreContainer is not a map of CoreDescriptor but a map of SolrCore.",
    "attachments": {
        "solr-731.patch": "https://issues.apache.org/jira/secure/attachment/12389016/solr-731.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Henri Biestro",
            "id": "comment-12626193",
            "date": "2008-08-27T17:05:49+0000",
            "content": "A patch that fixes this issue.\n\nAs a strawman feature, this completely removes the necessity to keep a CoreDescriptor in the SolrCore.\nFor compatibility, CoreContainer.describe() can recreate the CoreDescriptor (test case through reload).\n\nRefactoring occuring outside of SolrCore/CoreContainer/CoreDescriptor are consequences of reducing public exposures of some methods "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12627007",
            "date": "2008-08-29T15:26:37+0000",
            "content": "I've just started looking at CoreDescriptor/CoreContainer.  The two (plus SolrCore) seem quite a bit intertwined, so I think removing the CD -> CC reference sounds like a simplification.\n\nI don't understand the benefit of removing the SC -> CD reference though, and on-the-fly reconstruction of core's CD in that describe method. "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12627035",
            "date": "2008-08-29T17:13:03+0000",
            "content": "The issue is about having public access from CD to the CC.\nI think that it would be misleading to other contributors to believe the CD is more than a parameter passing facility; it should not be used beyond core creation.\n\nRemoving the SC->CD reference altogether is a strawman feature (at least, I know why this code should not not make it to the trunk).\nBut it illustrates the point that this reference is not functionally needed since all information vehicled though the CD is exploited then stored elsewhere.\n\nAs you mentioned, CoreDescriptor/CoreContainer/SolrCore are intertwined so it is hard to cut those in pieces as I've been asked to do.\nFor all intent & purpose, SOLR-725 related issues are resolved in the SOLR-725 attached patch. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12674121",
            "date": "2009-02-17T07:29:27+0000",
            "content": "Marked for 1.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872574",
            "date": "2010-05-27T22:08:07+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043660",
            "date": "2011-06-03T16:46:23+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106261",
            "date": "2011-09-16T14:50:18+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237047",
            "date": "2012-03-23T20:31:33+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13295369",
            "date": "2012-06-14T23:11:41+0000",
            "content": "Removing fix version since this issue hasn't gotten much attention lately and doesn't appear to be a priority for anyone for 4.0.  \n\nAs always: if someone wants to take on this work they are welcome to do so at any time and the target release can be revisited\n\nIn particular: i note that SolreCore.getCoreDescriptor and CoreDescriptor.getCoreContainer both seems to be fairly widely used now throughout the code base, so it's not clear to be that the intent/belief stated in this issue is still valid. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13835721",
            "date": "2013-11-30T13:26:00+0000",
            "content": "2013 Old JIRA cleanup "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15538911",
            "date": "2016-10-01T17:51:27+0000",
            "content": "The ancient discussion that did not progress anywhere. If the concern is still valid, this can be reopened or - better - a new issue started against more recent codebase. "
        }
    ]
}