{
    "id": "SOLR-12420",
    "title": "Propose removing schema version; use luceneMatchVersion instead",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I propose that the schema version be removed in lieu of using luceneMatchVersion for this.  One less thing to manage (in code, need REST API – SOLR-7242, thing to document; etc.).  We don't need the fidelity to differentiate from luceneMatchVersion.  We're already using luceneMatchVersion for things instead of having a ton of additional version numbers.  I can understand the point of putting a version number in in a config file but I don't think we should continue this practice.\n\nTo make this happen, if the luceneMatchVersion is >= 7.4 (the release which we start doing this) then a non-existent schema version becomes equivalent to the latest schema version.  Specifying the schema version becomes deprecated but supported; we might log a warning. \n\nIn 8.0, strip schema version out altogether.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-29T20:00:12+0000",
            "content": "The one thing that comes to mind as a negative, and I'm not sure it's enough to matter, is that luceneMatchVersion is not specified in the schema, it's in solrconfig.xml. ",
            "author": "Shawn Heisey",
            "id": "comment-16494163"
        },
        {
            "date": "2018-05-29T20:04:48+0000",
            "content": "It's my understanding that luceneMatchVersion can actually be specified on each individual analysis component within the schema, with a different version on every one if that's desired.  But as far as I know, if you want it global, it has to go in solrconfig,xml.  In our examples, it is not in the schema. ",
            "author": "Shawn Heisey",
            "id": "comment-16494173"
        }
    ]
}