{
    "id": "SOLR-1401",
    "title": "solr should error on document add/update if uniqueKey field has multiple tokens.",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "over the years, have seem more then a few solr-user posts noticing odd behavior when using a uniqueKey field configured to use TextField with a non trivial analyzer ... we shouldn't error on TextField (KeyworkdTokenizer is perfectly legitimate) but we should error if that analyzer produces multiple tokens.  \n\nLikewise we should verify that good error messages if uniqueKey field is configured such that multivalued=true.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Igor Motov",
            "id": "comment-12751692",
            "date": "2009-09-05T02:45:35+0000",
            "content": "It might be helpful to expand this to other non-trivial analyzers as well. Even if an analyzer produces a single token, removal of duplicates and distributed search don't function properly for any ids that were modified by the analyzer. To see how it works, just change type of id field to tightText and add a record with id \"ID\" twice. The tightText analyzer produces a single token for this value, and yet the record appears twice in the result list. At the same time, in distributed search (even with a single shard), these records completely disappear from the result list.  \n\nThis problem combined with recommendation for using textTight for SKUs in the schema.xml causes problems for some novice users. Frequently, SKU is a natural id and changing type for id from \"string\" to \"textTight\" is one of the first schema modifications that some users do, and then it takes them days to figure out the problem:\n\nhttp://www.nabble.com/uniqueKey-gives-duplicate-values-td15341288.html\nhttp://www.nabble.com/Adding-new-docs%2C-but-duplicating-instead-of-updating-td25241444.html\nhttp://www.nabble.com/Solr-Shard---Strange-results-td23561201.html\nhttp://www.nabble.com/Shard-Query-Problem-td22110121.html "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13631175",
            "date": "2013-04-13T21:25:33+0000",
            "content": "SPRING_CLEANING_2013 JIRAS. I can freely define the ID field as text_en_splitting, index weird IDs, and get lots of documents. Seems like this is quite valid even today. Don't know how it plays with distributed indexing and doc routing though.... "
        }
    ]
}