{
    "id": "SOLR-4820",
    "title": "SolrJ - autodetect xml/javabin transport requirements",
    "details": {
        "affect_versions": "4.3",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The idea here is to support automatically detecting whether a target Solr server will work with the binary request writer and/or response parser, then use that information to pick the most efficient combination.  See discussion on SOLR-3038.\n\nThis issue concerns itself with 4.x clients, which as of 4.3.1, send XML requests and ask for a binary response.  SOLR-3038 aims to change the default for requests to binary.  That change would break default compatibility with 3.x servers, requiring an explicit change to the XML request writer.\n\nThis issue is designed to fill the gap if/when the default request writer is changed, to allow the server object to detect when it needs to change request writers and response parsers.\n\nI see four possible approaches:\n\n1) Run detection when the object is created.  IMHO, this is a bad idea.\n2) Require an explicit call to an autodetect method.\n3) Run the detection mechanism the first time a request is processed.  If adjustment is deemed necessary, adjust the transports and log a warning, and possibly even include that warning in the response object.\n4) Don't actually autodetect.  The FIRST time a request fails, try downgrading the transport.  If the request writer isn't already XML, change it, log a warning, and try the request again.  Repeat for the response parser.  If the change works, keep going with the new settings.  If not, undo the changes and throw the usual exception, including a note saying that downgrading to XML was attempted.",
    "attachments": {
        "SOLR-4820.patch": "https://issues.apache.org/jira/secure/attachment/12583205/SOLR-4820.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13656656",
            "date": "2013-05-14T02:41:11+0000",
            "content": "I haven't even attempted to discuss JSON.  Is that something that should concern me here? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13657466",
            "date": "2013-05-14T20:28:09+0000",
            "content": "First crack at a patch, just to get the idea started.  This version does not automatically do the detection, it would need to be manually called.  I have ideas about how to make it truly automatic, but I want to make sure this is OK first.  I'm sure there are reasons to object to my code, so object away!\n\nThis also adds a getWriter method so that the current choice is available to client code, similar to getParser. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717377",
            "date": "2013-07-23T18:48:02+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971142",
            "date": "2014-04-16T12:57:16+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}