{
    "id": "SOLR-3293",
    "title": "Request Handler inheritance",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It would be useful if one Solr request handler could inherit from another.  Or perhaps a mixin style so multiple could be merged in.  I've wanted to do this to reduce repeating myself in solrconfig.xml RH configurations.  Maybe all that's needed is one RH which provides the defaults to all the other search handlers.  This feature could also be useful for establishing some defaults like for \"df\" and \"q.op\" and \"f.myfieldname.facet.method\".",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13241101",
            "date": "2012-03-29T09:22:33+0000",
            "content": "Let's explore this. I use request handler configs extensively for defining various search use cases, and they frequently share a considerable number of settings. Perhaps a simple <requestHandler name=\"foo\" extends=\"bar\"...> syntax would do? Then we could get pretty one-liners if just one parameter changes from the parent. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13241248",
            "date": "2012-03-29T13:55:22+0000",
            "content": "I suspected you would be interested in this issue, Jan.\n\nYes, it could be as simple as an extends attribute there.  That was my initial idea.  Two other questions:\n\n\tIs there an implied default inherited request handler?  Here you could specify \"df\", \"q.op\", \"f.myfieldname.facet.method\", ...\n\tCould/should you be able to declare a handler that is only for extension and not for direct use?  If so then how would it be declared as such?\n\tmultiple extended request handlers resulting in mixin capability?  – e.g extends=\"base,foo,bar\"  Or is this overkill?\n\n\n\nThere is something to be said for simplicity of how it works.  So maybe simply one parent, no way to prevent a search of a RH aside from avoiding a leading '/' (assuming handleSelect is disabled) which is good enough... and maybe no default extends since all the RH definitions declared in solrconfig.xml out of the box could refer to a base one.\n\nThis should be easy to implement. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13241402",
            "date": "2012-03-29T17:21:51+0000",
            "content": "My thought was a super-simple approach. A RequestHandler with an extends would be initialized with a NamedList being the sum of the parent and the sub. For this to work, the parsing of <requestHandler> tags in solrconfig.xml would necessarily need to be done in correct order... Should we allow any number of levels or only one? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13253766",
            "date": "2012-04-13T21:38:30+0000",
            "content": "SOLR-112? \n\nSee also...\n\nhttp://www.lucidimagination.com/search/document/1590fe9ba73bc159#48acd4edb977be0d\n\n\n...as you note in the \nlatter comments, we ultimately we hit a wall in trying to determine a \n\"generic\" way to merge the init params for any arbitrary RequestHandler – \nthings like default/invariant/appends are conventions of the OOTB \nhandlers, but not all handlers are garunteed to support them. \n\n...this is however something that could probably be added explicitly to SearchHandler in a fairly straight forward manner. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-14204511",
            "date": "2014-11-10T08:42:33+0000",
            "content": "Covered by the initParams feature SOLR-6365 "
        }
    ]
}