{
    "id": "SOLR-2130",
    "title": "Empty index directory causes FileNotFoundException error when starting in-memory SOLR server (RAMDirectory)",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "When creating an in-memory Solr Server (using RAMDIrectory) if an empty index directory exists when the server is created the following error occurs:\n\njava.lang.RuntimeException: java.io.FileNotFoundException: no segments* file found in org.apache.lucene.store.RAMDirectory@177b093: files:\n\tat org.apache.solr.core.SolrCore.getSearcher(SolrCore.java:1068)\n\nThe code expects a segment file to be present - but as it is an in-memory server there isn't one to find and the error occurs.\n\nThe workaround is to ensure the directory is deleted before starting the server, but the creation process creates another empty index folder",
    "attachments": {
        "TechSpike.zip": "https://issues.apache.org/jira/secure/attachment/12455929/TechSpike.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12915997",
            "date": "2010-09-29T02:38:05+0000",
            "content": "Ian: I'm afraid you haven't given enough details for me to really make sense of this bug.\n\nYou've marked it as affecting Solr 1.4.1, but Solr 1.4.1 didn't have any support for using a RAMDirectory.\n\nOn trunk, using the RAMDirectoryFactory with the example configs (which have a system property setup to override the default DirectoryFactory) I can't trigger any sort of problem like you describe...\n\n\njava -Dsolr.directoryFactory=solr.RAMDirectoryFactory -jar start.jar\n\n\n\nCan you please clarify how exactly you got the above mentioned error? Are you really using 1.4.1? Did you write a custom DirectoryFactory? what does your code look like? can you provide a unit test or specific steps to reproduce this error? "
        },
        {
            "author": "Ian Rowland",
            "id": "comment-12916196",
            "date": "2010-09-29T16:51:00+0000",
            "content": "The attached file contains a self contained java project that will show the problem.\n\nRun the code in 'Main' (src/highlighting/techspike.solr.highlighting), \n\nThe first time it is run the 'index' folder does not exist and the application completes (see output in Console window) . \n\nThe second time it runs the 'Index' folder has been created but it empty: this causes the error to occur.\n\nIf you delete the index directory and run the app again, it works!\n\nThe application uses a RAMDirectory factory that is referenced in the SolrConfig.xml.\n\nThe project includes the Solr libraries and they claim to be version 1.4.1! "
        },
        {
            "author": "Andres Felipe Ospina",
            "id": "comment-12998888",
            "date": "2011-02-24T15:18:37+0000",
            "content": "Hi Ian,\n\nMy name is Felipe and i want to use the index of solr in RAM memory.\n\nHow it's possible? i have solr 1.4.1.\n\nThank you!\n\nAndres "
        },
        {
            "author": "Andres Felipe Ospina",
            "id": "comment-12999366",
            "date": "2011-02-25T14:24:22+0000",
            "content": "Response:\n\nattach in the solrconfig.xml\n\n<config> \n<directoryFactory name=\"DirectoryFactory\" class=\"org.apache.solr.core.RAMDirectoryFactory\"/> "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539564",
            "date": "2016-10-02T02:28:40+0000",
            "content": "This code has been changed multiple times. If the problem still exists in the latest code, a new issue can be created. "
        }
    ]
}