{
    "id": "SOLR-5851",
    "title": "Disabling lookups into disabled caches",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "When a cache is disabled, ideally lookups into that cache should be completely disabled, too.\nSee: http://search-lucene.com/m/QTPaTfMT52&subj=Disabling+lookups+into+disabled+caches",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13931447",
            "date": "2014-03-12T06:27:42+0000",
            "content": "I have learned that FastLRUCache will actually create a cache of max size 2 when you tell it that you want the size to be zero, because of these two lines in its init method:\n\n\n    if (minLimit==0) minLimit=1;\n    if (limit <= minLimit) limit=minLimit+1;\n\n\n\nI initially tried to just add code to the get() and put() methods of all the cache implementations that returns immediately if the cache size is zero, but that didn't work and broke most of the tests.  In hindsight, this makes sense - it was not the right solution.\n\nIf we're going to implement this idea, we need some other way to detect that the requested cache size was zero so we can short-circuit all the cache methods into returning immediately and not taking any action.  Ideally, we would also avoid creating the underlying data structure at all. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13931448",
            "date": "2014-03-12T06:28:48+0000",
            "content": "What I just wrote has given me an idea for how we can detect the disabled state where the user requested a size of zero – if the field for the underlying data structure is null, we know we can return immediately. After I've had a chance to get some sleep, I can double-check some things to make sure this will actually work. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13931694",
            "date": "2014-03-12T12:29:27+0000",
            "content": "Simply remove the whole cache  declaration if you don't want the cache. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13931798",
            "date": "2014-03-12T14:14:02+0000",
            "content": "Simply remove the whole cache declaration if you don't want the cache.\n\nAs in, remove it from the solrconfig.xml?  I think that was done in the case I showed, but I could be wrong.  I'll double-check and report. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13931933",
            "date": "2014-03-12T16:26:46+0000",
            "content": "False alarm, it seems.  I thought we had commented out the cache in this case, but we just set its values to 0.  Sure, still weird that something changes the size to 2, but the original problem I wanted to raise is not really a problem - to prevent lookups from happening at all one just needs to comment out the cache definition.  At least for Document Cache.  I didn't check the other caches, but I would imagine/hope Solr handles them the same.\n\nShould I Won't Fix this? "
        }
    ]
}