{
    "id": "SOLR-12692",
    "title": "Add hints/warnings for the ZK Status Admin UI",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Firstly I love the new UI pages ( ZK Status and Nodes ) . Thanks Jan Høydahl for all the great work!\n\nI setup a 3 node ZK ensemble to play around with the UI and attaching the screenshot for reference.\n\n \n\nHere are a few suggestions I had\n\n\tLet’s show Approximate Size in human readable form.  We can use RamUsageEstimator#humanReadableUnits to calculate it\n\tShow warning symbol when Ensemble is standalone\n\tIf maxSessionTimeout < Solr's ZK_CLIENT_TIMEOUT then ZK will only honor up-to the maxSessionTimeout value for the Solr->ZK connection. We could mark that as a warning.\n\tIf maxClientCnxns < live_nodes show this as a red? Each solr node connects to all zk nodes so if the number of nodes in the cluster is high one should also be increasing maxClientCnxns",
    "attachments": {
        "wrong_zk_warning.png": "https://issues.apache.org/jira/secure/attachment/12937103/wrong_zk_warning.png",
        "zk_ensemble.png": "https://issues.apache.org/jira/secure/attachment/12936735/zk_ensemble.png",
        "SOLR-12692.patch": "https://issues.apache.org/jira/secure/attachment/12937111/SOLR-12692.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-23T08:14:26+0000",
            "content": "All good suggestions. I don't know if you played around with the other warnings, but you can test e.g. by specifying only two of the zk's in -z when starting Solr - you will then see complaints about quorum size, mismatches etc. Guess you could extend those checks to also look at other values as you suggest. ",
            "author": "Jan Høydahl",
            "id": "comment-16589887"
        },
        {
            "date": "2018-08-25T01:33:08+0000",
            "content": "That's cool! I attached a screenshot of it for reference.  ",
            "author": "Varun Thacker",
            "id": "comment-16592371"
        },
        {
            "date": "2018-08-25T02:54:43+0000",
            "content": "Newly adding validations added in this patch\n\n\tShow a warning when 80% of file descriptor is being used\n\tShow a warning when 80% of connections is being used\n\tdata size is displayed in human readable form\n\tShow a warning when only 1 ZK host is provided\n\tShow a warning if max latency is more than 10 seconds \n\n ",
            "author": "Varun Thacker",
            "id": "comment-16592405"
        },
        {
            "date": "2018-08-25T22:07:29+0000",
            "content": "The patch looks good. A bit hard to test the various error conditions if we don't mock the response data. Few comments:\n\n\tIf you get into zk_max_latency issues, the same error may be added once for each ZK if all are busy. Perhaps it helps to include the host name in the message to distinguish?\n\tThe \"ok\" key for each zkhost is \"true\" if RUOK returns IMOK. Should we flip that to false if we detect issues with that host?\n\tNot high prio, but code-wise it would perhaps be cleaner to separate information fetch phase (monitorZookeeper) from the inspection and detection of errors. I.e. keep monitorZookeeper as-is and add a new method detectIssues(zkStatus, errors) where all analysis, both existing and the new per-host analysis is done? This is less important though.\n\n ",
            "author": "Jan Høydahl",
            "id": "comment-16592720"
        },
        {
            "date": "2018-08-28T16:56:50+0000",
            "content": "Additional feature request would be if you could say do a click for a 'cons' command which will show latencies and packets rcvd/sent on all connections. This can be useful when determining if that max latency is an outlier or a significant problem or packet communication on a connection. You could also do ones for 'crst' (Connection reset of stats), 'srst' (Server reset of stats). Possibly might add 'dump' for connection ids and attached ephemeral nodes, but perhaps getting farther out there. I think the most important one here might just be 'cons' ",
            "author": "Greg Harris",
            "id": "comment-16595291"
        },
        {
            "date": "2018-08-28T17:10:32+0000",
            "content": "I can see that ‘srst’ could be useful to trigger for all hosts before you start some test or reproduction of a problem. Greg, feel free to open an issue for it and another for ‘cons’, especially if you also want to attempt a patch   ",
            "author": "Jan Høydahl",
            "id": "comment-16595318"
        },
        {
            "date": "2018-08-28T22:49:04+0000",
            "content": "Here's another tip I remembered \n\nIf more than 5 ZooKeeper exists then it makes sense to mark a couple of them as leaderServes=false for performance reasons. ",
            "author": "Varun Thacker",
            "id": "comment-16595684"
        },
        {
            "date": "2018-08-28T22:50:09+0000",
            "content": "Also i've seen lots of times users forget to set max snapshot counts and they run out of disk space . ",
            "author": "Varun Thacker",
            "id": "comment-16595686"
        }
    ]
}