{
    "id": "SOLR-5459",
    "title": "Try loading a temporary core when saving a file in the admin UI config editing mode",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "SOLR-5287 adds the ability to shoot yourself in the foot by changing core config files such that the core can't load, leading to having to go out into the filesystem and manually edit the files until you can reload the core. This is clumsy at best.\n\nMark Miller suggested creating a temporary core and trying to reload it before saving the \"real\" changes, which gives us an approach to the problem that seems relatively easy to implement.",
    "attachments": {
        "SOLR-5459.patch": "https://issues.apache.org/jira/secure/attachment/12614434/SOLR-5459.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13825533",
            "date": "2013-11-18T17:58:24+0000",
            "content": "Here's a quick hack at a patch that does this. It makes me quite nervous. It looks remarkably like some of our test code, creating a temporary directory, copying the conf directory over, and then trying to load it. If you navigate away from the edit page, it loses any changes you've made.\n\nIt also takes a while longer, and will take even longer from ZooKeeper. Do we really want to bring the conf directory down from ZK, test it, and throw it away? Or is there a better way?\n\nIt has to clean up after itself by doing a FileUtils.deleteDirectory().\n\nI've walked through it by hand and modified one of the local filesystem tests to try it and it appears to work.\n\nStefan Matheis (steffkes) The response returned will now have an error in it, but that's not displayed. This is a marker, I'm not sure whether we want to go forward with this or not. And if an error is returned the progress indicator on the save button never stops.\n\nMark Miller is this anything like what you had in mind?\n\nNOTE: I need to clean it up, but another instance of throwing something up that's not ready to see what people think.\n\nStill to do is the ZooKeeper version. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13825540",
            "date": "2013-11-18T18:02:42+0000",
            "content": "That's a good hint Erick, need to catch the failure case - but should be done w/ or w/o this issue (: "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13826443",
            "date": "2013-11-19T12:39:22+0000",
            "content": "What do people think? Particularly Mark Miller and Stefan Matheis (steffkes)? Loading things from Zk for every file save will be slow. OTOH, having this will prevent people from shooting themselves in the foot. I see two ways to go about this\n\n1> every file save goes through the verification process. This is kind of expensive for, say, changing the synonyms file. Or all the language files. Or....\n2> we (well, Stefan) provides a \"test config\" button that does this. This would just be setting the \"op\" param to test, as \"op=test\". The user could save as many different files as they wanted and then test once.\n\nAll in all, I like <2> better. It should still allow someone to recover from messing things up provided they test before reloading the core. And it allows people to bypass the whole verification process if, for some reason, creating the temp core and trying to load it is broken due to my coding skill deficiencies... "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13826552",
            "date": "2013-11-19T14:46:46+0000",
            "content": "I think at least initially, 2 is preferable. We need a solid and fast option if we are going to force sanity checking I think. 2 is best for now and let's us brute force the issue for now. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13826916",
            "date": "2013-11-19T20:43:20+0000",
            "content": "Stefan Matheis (steffkes) Can I ask you to provide a \"test\" button on the UI? It would go to the ShowFileRequestHandler with the stream set to the current file and, say, op=\"test\"?\n\nThinking it over, one advantage of this is that if, for some reason, creating all the temp stuff doesn't work (permissions, whatever) they can still edit through the UI. It puts testing under explicit control.\n\nI should check in the relevant code tonight. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13826979",
            "date": "2013-11-19T21:47:36+0000",
            "content": "sure thing, i'll try to bring that in with SOLR-5457 which is still on the list  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13827159",
            "date": "2013-11-20T00:15:43+0000",
            "content": "Final patch with tests changed to accommodate a \"test\" option. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13827160",
            "date": "2013-11-20T00:15:44+0000",
            "content": "Commit 1543660 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1543660 ]\n\nSOLR-5459: Try loading a temporary core when saving a file in the admin UI config editing mode "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13827194",
            "date": "2013-11-20T01:02:08+0000",
            "content": "Commit 1543685 from Erick Erickson in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1543685 ]\n\nSOLR-5459: Try loading a temporary core when saving a file in the admin UI config editing mode "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13827198",
            "date": "2013-11-20T01:06:04+0000",
            "content": "Stefan Matheis (steffkes) Ready for the UI work with op=test.\n "
        }
    ]
}