{
    "id": "LUCENE-4631",
    "title": "Add utility class for getting information about suspicious system concerns at runtime",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "(Inspired by an idea Uwe mentioned in LUCENE-4630)\n\nOver the years, we've discovered various bugs in JVMs, specific JVM options, combinations of JVM options, combinations of JVMs and operating systems, etc...  We've done a fairly decent job of alerting users to these known issues in documentation, and we've attempted to make tests not give false failures if people use these setups – but there is probably more we could be doing to alert users who may not run tests, or read all the docs/blogs.\n\nI think we should add a new class to Lucene Core that provides a simple API for applications to get a list of \"warning\" Strings based on what lucene can dedect from the currently running JVM/OS.  This should be something trivial for people writing apps using lucene to integrate into their code and/or tests (even if they don't use the LuceneTestCase) to notify them if when there are known compatibility issues between their enviornment and the version of lucene this class ships with.\n\nThis code should be executed, and all of the resulting warning messages outputed by...\n\n\n\tthe CheckIndex command line mode on startup\n\tthe Lucene Demo app(s) on startup\n\tinfostream (if used) the first time it's configured on an IndexWriterConfig\n\tSolr startup logs\n\tSolr admin UI (as exposed by the Solr SystemInfoRequestHandler HTTP API)\n\tin the Lucene test framework after any test runs\n\n\n\n...in addition, specific logic/messages in this code could help implement the annotations Dawid is suggesting in LUCENE-4630.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13532569",
            "date": "2012-12-14T19:26:27+0000",
            "content": "It seems like SOLR-4132 might be at least marginally related to this ... or it might be something entirely separate.  Which way do you see it? "
        }
    ]
}