{
    "id": "SOLR-5969",
    "title": "Enable distributed tracing of requests",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Enable users to add diagnostic information to requests and trace them in the logs across servers.\n\nWe have some metadata – e.g. a request UUID – that we log to every log line using Log4J's MDC. The UUID logging allows us to connect any log lines we have for a given request across servers. Sort of like Twitter's Zipkin.\n\nCurrently we're using EmbeddedSolrServer without sharding, so adding the UUID is fairly simple, since everything is in one process and one thread. But, we're testing a sharded HTTP implementation and running into some difficulties getting this data passed around in a way that lets us trace all log lines generated by a request to its UUID.\n\nThe first thing I tried was to add the UUID by adding it to the SolrParams. This achieves the goal of getting those values logged on the shards if a request is successful, but we miss having those values in the MDC if there are other log lines before the final log line. E.g. an Exception in a custom component.\n\nMy current thought is that sending HTTP headers with diagnostic information would be very useful. Those could be placed in the MDC even before handing off to work to SolrDispatchFilter, so that any Solr problem will have the proper logging.\n\nI.e. every additional header added to a Solr request gets a \"Solr-\" prefix. On the server, we look for those headers and add them to the SLF4J MDC.",
    "attachments": {
        "SOLR-5969.diff": "https://issues.apache.org/jira/secure/attachment/12639047/SOLR-5969.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Gregg Donovan",
            "id": "comment-13962180",
            "date": "2014-04-07T19:48:55+0000",
            "content": "Patch implementing distributed tracing via HTTP headers.  "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13962273",
            "date": "2014-04-07T21:21:57+0000",
            "content": "Interesting. You may want to take a look at SOLR-5277 (identify cores, not threads). I don’t understand why you add the UUID information as request header instead of a request parameter. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13962997",
            "date": "2014-04-08T13:58:12+0000",
            "content": "Just saw SOLR-5971, possibly related? the URL that Eric comments show a url with this fragment:\nstring_months_month&facet=true&q=:,trace=java.lang.IllegalArgumentException\n\nNotice the ,trace= bits.\n\nI have no clue whether it's related in any way, shape or form; just keying off the word \"trace\" here....\n "
        },
        {
            "author": "Gregg Donovan",
            "id": "comment-13963242",
            "date": "2014-04-08T18:01:26+0000",
            "content": "Tomas – Thanks for the pointer to SOLR-5277. I don't see any current use in Solr/Lucene of the SLF4J MDC, so I'm definitely curious to see if that issue makes progress.\n\nTomas – the UUID is added as a header for a few reasons.\n1) It's difficult due to the custom nature of SolrRequestParser to intercept HTTP parameters and add them to the MDC before SolrDispatchFilter is invoked. E.g. if the request is a POST, calling getParameter() will trigger a parameter incompatibility exception.\n\n2) If we're going to add a UUID or other metadata to the SolrParams and log them via the MDC, we end up with duplicate data in the logs. We pay for our logging by the byte, so this is unfortunate. We could add a Filter that removed the parameter from the HttpServletRequest, but it would need to get re-added when sending a distributed query.\n\n3) Semantically, tracing information is a different thing than request parameters, so mixing them can be confusing. "
        },
        {
            "author": "Gregg Donovan",
            "id": "comment-13983290",
            "date": "2014-04-28T17:50:21+0000",
            "content": "Patch updated for Lucene/Solr 4.8. "
        }
    ]
}