{
    "id": "SOLR-1986",
    "title": "Allow users to define multiple subfield types in AbstractSubTypeFieldType",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "A few small changes to the AbstractSubTypeFieldType class to allow users to define distinct field types for each subfield.  This enables us to define complex data types in the schema.\n\nFor example, we have our own subclass of the CoordinateFieldType called TemporalCoverage where we store a start and end date for an event but now we can store a name for the event as well.\n\n<fieldType name=\"temporal\" class=\"uk.ac.edina.solr.schema.TemporalCoverage\" dimension=\"3\" subFieldSuffix=\"_ti,_ti,_s\"/>\n\nIn this example, the start and end dates get stored as trie-coded integer subfields and the description as a string subfield.",
    "attachments": {
        "AbstractMultiSubTypeFieldType.patch": "https://issues.apache.org/jira/secure/attachment/12453074/AbstractMultiSubTypeFieldType.patch",
        "multiSubType.patch": "https://issues.apache.org/jira/secure/attachment/12448684/multiSubType.patch",
        "SOLR-1986.patch": "https://issues.apache.org/jira/secure/attachment/12477261/SOLR-1986.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Allan",
            "id": "comment-12885183",
            "date": "2010-07-05T11:27:01+0000",
            "content": "Patch to provide initial functionality of multiple subfield types. "
        },
        {
            "author": "Mark Allan",
            "id": "comment-12885505",
            "date": "2010-07-06T11:41:19+0000",
            "content": "Allows for definition of multiple different subfield types. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12896766",
            "date": "2010-08-10T05:03:00+0000",
            "content": "+1\n\nI would like to add a Level-Of-Detail value to the spatial types. Without this it is impossible.\n\nIn fact, I would like to compose types with compound type as a subfield. Is this possible? "
        },
        {
            "author": "Thomas Joiner",
            "id": "comment-12902628",
            "date": "2010-08-25T20:54:09+0000",
            "content": "Since the reason people seemed to object to the patch in the mailing list was that the AbstractSubTypeFieldType was not originally intended to be used for multiple different types, I made it a separate class.  Also, the subFieldType parameter now works, and the created subFields are prepended with \"subtype_\" so as to allow dynamicFields to be used to simulate multiValued fields. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13008041",
            "date": "2011-03-17T18:00:31+0000",
            "content": "This looks useful.  Thomas or Mark, would you happen to have a unit test to go with this? "
        },
        {
            "author": "Thomas Joiner",
            "id": "comment-13008449",
            "date": "2011-03-18T14:27:11+0000",
            "content": "I don't currently have a test for it, however I will see about making one (it may take a while as work has me quite busy right now). "
        },
        {
            "author": "Thomas Joiner",
            "id": "comment-13024691",
            "date": "2011-04-24T22:58:07+0000",
            "content": "Finally had a chance to create some tests for it.  I think that the tests that I made cover the functionality of the class fairly well, however if you have any feedback/improvements that you would like me to make, please feel free.\n\nI also improved the documentation for the AbstractMultiSubTypeFieldType class...most of the commenting is probably completely unnecessary for anyone with any familiarity with the Solr core, however to anybody who is trying to create a custom type that isn't familiar with the core, it should help them understand what the class is doing a little bit.\n\nNote that this patch should be applied independently of the original patch "
        }
    ]
}