{
    "id": "SOLR-3225",
    "title": "highlighting of queries does not works in solr4.0",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "q= \n{!join from=manu_id_s to=id}\nipod\nby highlighting this query it does not highlights the required field ,hence highlighting not works in join queries.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13225971",
            "date": "2012-03-09T09:49:32+0000",
            "content": "I assume that the field to highlight resides in the \"to\" document? Please provide more detailed information on how to reproduce, including all parameters you pass on the URL, your schema and example \"from\" and \"to\" documents.\n\nI'm not sure whether highlighting on \"to\" docs is implemented or even supposed to work yet. "
        },
        {
            "author": "sumit pathak",
            "id": "comment-13226042",
            "date": "2012-03-09T12:36:50+0000",
            "content": "The main problem is that any of the join queries does not highlight its required field. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13291226",
            "date": "2012-06-07T19:10:03+0000",
            "content": "I believe this initial bug report is attempting to refer to this example from the wiki...\n\n\nFind all product docs matching \"ipod\", then join them against (manufacturer) docs and return the list of manufactures that make those products\n\n\thttp://localhost:8983/solr/select?q=%7B!join+from=manu_id_s+to=id%7Dipod\n\n\n\nthe JoinQParser fundamentally doesn't preserve any information about the \"from\" documents, so none of the fields of those documents can be highlighted.  In this case: none of the \"product\" fields are available to be highlighted when returning the \"manufacturer\" documents.\n\nYou can still use highlighting on any of the fields in the \"to\" document\n\n\n "
        }
    ]
}