{
    "id": "SOLR-2586",
    "title": "example work & logs directories needed?",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Build"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Firstly, what prompted this issue was me wanting to use a git solr mirror but finding that git's lack of empty-directory support made the \"example\" ant task fail. This task requires examples/work to be in place so that it can delete its contents. Fixing this was a simple matter of adding:\n\n<mkdir dir=\"${example}/work\" /><!-- in case not there -->\n\n\nRight before the delete task.\n\nBut then it occurred to me, why even have a \"work\" directory since Jetty will apparently use a temp directory instead. – try for yourself (stdout snippet):\n2011-06-11 00:51:26.177:INFO::Extract file:/SmileyDev/Search/lucene-solr/solr/example/webapps/solr.war to /var/folders/zo/zoQJvqc9E0076p0THiri+k+++TI/Tmp/Jetty_0_0_0_0_8983_solr.war_solr_k1kf17/webapp\n\nOn my Mac, this same directory was used for multiple runs, so somehow Jetty or the VM figures out how to reuse it.\n\nSince this \"example\" setup isn't a real installation – it's just for demonstration, arguably it should not contain what it doesn't need.  Likewise, perhaps the empty example/logs directory should be deleted. It's not used by default any way.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13047899",
            "date": "2011-06-11T13:41:41+0000",
            "content": "Since this \"example\" setup isn't a real installation\n\nPractically, I think this is actually how things turn out. You often take the example as it's given and tweak it.\n\nI also have very often found that it's very useful having the war right there where I know it is, rather than having to hunt in a deeply nested tmp dir.\n\nGoal is nice though - I work from Apache's Git mirror myself sometimes. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13047915",
            "date": "2011-06-11T14:43:39+0000",
            "content": "If people actually run it in place in a production setting, even if tweaked, I think we haven't done enough to tell people not to. The README.txt should re-inforce it; the \"example\" name isn't enough of a clue, apparently.  People should of course install a servlet engine with the OS startup & shutdown hooks and deploy Solr to it. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13047933",
            "date": "2011-06-11T16:08:47+0000",
            "content": "If people actually run it in place in a production setting, even if tweaked, I think we haven't done enough to tell people not to.\n\nI wouldn't go that far... if we don't provide something that can be easily tweaked to run in production, then we should.\nSolr is supposed to be a server, not just a war file.  Given all of the bugs we've hit with both tomcat and jetty, using the jetty we provide, including stuff like the connector configuration, thread pool configuration, etc, is probably the safest option one can choose.\n\nIMO, what's needed is a \"what you should consider changing to run this in production\" document. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13048220",
            "date": "2011-06-12T04:03:52+0000",
            "content": "Well I respectfully disagree with you Yonik. I think a WAR file is enough to provide for a production setting, and it should be enough for any Java webapp.  I'm not aware of any serious bugs in servlet engines that would truly warrant recommendation against using them instead of the version of Jetty provided in /example/.  By serious, I mean two things: One is a bug requiring a patch, not simply a configuration modification that we can easily tell users to make when they go to production. Second, this bug must actually be a serious bug, not just technically be a bug. If it's some arcane encoding issue that is only going to actually trigger a real problem in some small fraction of cases, then I don't think that's serious – I think instead we simply tell users about it and let them take whatever action they choose (e.g. choose another servlet engine if it matters to them, or do nothing if they are not impacted). For the ease of operational administration (especially for those with no Java expertise), going with a Linux RPM (or similar package system) or Windows Tomcat install with Service registry startup/shutdown hooks, is a lot better.\n\nIf I'm in the minority and those in power want to actually condone the \"/example/\" setup as a production ready installation, then I think this directory should be renamed to something like \"/server/\", and further instructions should be provided on starting it and stopping it with the operating system for at least Linux. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13048221",
            "date": "2011-06-12T04:06:56+0000",
            "content": "So that my build.xml recommended change is not forgotten (mkdir \"work\", \"log\" too?) can someone simply add the one-liner? I don't think a trivial thing like that deserves its own issue and CHANGES.txt. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13048223",
            "date": "2011-06-12T04:14:56+0000",
            "content": "\nIf it's some arcane encoding issue that is only going to actually trigger a real problem in some small fraction of cases, then I don't think that's serious\n\nBut I do. Unicode support is important to me, this is why we have a patched jetty now. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13048271",
            "date": "2011-06-12T08:31:00+0000",
            "content": "To come back to the orginal issue:\n\nWhat is your reason to say: The example folder cannot be used to create a production installation?\n\nI would always recommend my customers to use the shipped Jetty, because its much more performant than Tomcat with Solr and also is configured right and has less bugs, that are very important to text processing (whats the main task of Solr).\n\nAlso it should be noted, that Solr should always run in it's own Jetty/Tomcat installation for GC and other Java-Specific reasons, so installation of Solr together with other webapps in a system-wide default Ubuntu/Whatever-shipped Tomcat is a bad idea.\n\nWe generally run Solr in a separate user account, adding a @reboot cron job that starts the jetty shipped with the distrib. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13048559",
            "date": "2011-06-13T13:38:13+0000",
            "content": "Rob, I should have predicted you would respond to my example; I know you care very much about the Unicode bugs. It's not that I don't care at all (although admittedly it's low priority for me); the point is more that a unicode bug in one servlet engine (Jetty) shouldn't mean we can't recommend people use the WAR file and deploy it to a servlet engine – generally speaking. Is Tomcat configured correctly a problem?  Resin?  \n\nUwe, you are apparently a fan of Jetty and that's great.  I sincerely think it's a great servlet engine.  There will always be people who will overcome the lack of certain conveniences (e.g. out of the box OS startup/shutdown hooks) to use their preferred software, whatever it may be for whatever reason. \"configuring it right\" IMO is where READMEs come in. A dedicated README for configuring specific servlet engines, should come with Solr (Yes I do know the info is in our Wiki).  Uwe, I think you are far outnumbered by the people who would prefer operational familiarity & setup convenience.\n\nI agree users should avoid deploying multiple apps in the same JVM – and just because you might want to use an Ubuntu OS level package does not imply that you will do that.  Heck, I could deploy an app to /example/webapps/ if I wanted to.\n\nAny way, I'm 0 for 3 and I'll shut up now.  If /example/ is operationally ready and the recommended production install, isn't it misnamed?\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13048573",
            "date": "2011-06-13T14:15:48+0000",
            "content": "There's also stuff like SOLR-2158, caused by the NIO based connectors (which are normally the default in jetty!).\nBack at my time in CNET, we certainly hit a number of bugs with Resin too.  If we had been using tomcat all along, I bet we would have hit bugs there too.\n\nWhen someone is having a bug that could be due to the servlet container, one of the first things I ask is \"does this also happen with the example server?\"\n\nIf /example/ is operationally ready and the recommended production install, isn't it misnamed?\n\nI don't know if anyone said it was \"operationally ready\"... but I don't see anything wrong with using it as a starting point for something that will be put into production. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13048580",
            "date": "2011-06-13T14:43:46+0000",
            "content": "\nshouldn't mean we can't recommend people use the WAR file and deploy it to a servlet engine – generally speaking. Is Tomcat configured correctly a problem? Resin?\n\nWell, I would have a tough time recommending any of these servlet engines, not for any technical reason, but just because we test with jetty in hudson, etc and deal with the issues that come up. I'm sure in some special circumstances these alternative containers might have some value that actually justifies \"throwing away all the testing\" we do here with Jetty... but still thats a risk.\n\nYonik's link (SOLR-2158) is a good example, even if you were to change all the tests to work with alternative servlet container X and run 'ant test', this doesn't mean a whole lot. That particular bug was really difficult (impossible?) to reproduce and the reason we hit it is continual testing.\n\nBottom line I think, is if someone wants to ensure that Solr works well on Tomcat for example, then they should make a patch so that our tests test with this container too (e.g. in hudson, etc). Once its baked in hudson for a while, then I would say its easy for us to recommend it, too.\n\nBut in general, you won't hear me say \"its just a war file, therefore it works with all containers\". Just like you won't hear me say \"lucene is just a jar file, it works with all JREs\": I do run the lucene tests manually occasionally with BEA, IBM, etc but this is only sporatically, nothing like running with these every 30 minutes and knocking out bugs. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13048746",
            "date": "2011-06-13T20:35:01+0000",
            "content": "why even have a \"work\" directory since Jetty will apparently use a temp directory instead.\n\nSome things have reasons that we barely remember   In this case, I think the main motivating factor might have been SOLR-118\nI remember a number of people reporting failing JSPs over time, and it took quite a while to track it down. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13048752",
            "date": "2011-06-13T20:52:32+0000",
            "content": "right ... as soon as i saw this issue summary in my inbox i remembered that jira issue.\n\nthere is a very specific reason we choose to use a work dir.\n\ni also believe you'll find other jira issues where attempts at having the build file create the dir if it doens't exist caused other problems because it led people to thinking they could manually delete the directory (and not just it's contents) when they wanted to clean stuff up, which then led to svn update errors.\n\nif git mirrors don't like the empty dirs, then we should add .gitignore files (which i think yonik already did in a few places, if we are missing any lets follow up) "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13048755",
            "date": "2011-06-13T20:59:48+0000",
            "content": "Bottom line I think, is if someone wants to ensure that Solr works well on Tomcat for example, then they should make a patch so that our tests test with this container too (e.g. in hudson, etc). Once its baked in hudson for a while, then I would say its easy for us to recommend it, too.\n\nThat is the hardest task. Jetty is so cool, because it can be used and configured \"embedded\". To start up Tomcat, you have to provide final configuration files in the default folder layout and start a main() static method from a class. Something so easy like jettyServer.addServletFilter() & similar things are not possible with Tomcat out of the box. This makes Jetty (in my opinion) the best servlet container around. I sometimes also use it that way (embedded in my Java app). "
        },
        {
            "author": "David Smiley",
            "id": "comment-13053468",
            "date": "2011-06-22T20:56:15+0000",
            "content": "So if \"work\" is needed (to avoid rare error conditions if a temp directory is used), that still leaves the question of \"logs\".  The only thing approaching use of this directory is some commented-out configuration in jetty.xml. So as it stands, it really isn't used. I think if if someone uncomments that part of jetty.xml, then they can very well make the logs directory.  What I'm after here is a little bit of simplification for new users. I certainly don't get any heartburn over these directories, but if someone new sees \"logs\" and never sees anything go there, they might think something is wrong. And removing it is one less directory.  I say this after updating my Solr book, walking the users through the directory layout in the 1st chapter.  No big deal, but simplification/clarity is good. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13053500",
            "date": "2011-06-22T22:15:35+0000",
            "content": "is this issue really about the git problem or about making things simpler?\n\nIf you want to make things simpler, you would be mentioning things like:\n\n\tmove example-dih to contrib/dih\n\tremove mapping-ISOLatin1Accent.txt, we have the foldToAscii and its confusing to have both\n\t...\n\n\n\nBut i see you only targeting empty directories, which cause little confusion at all. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13053518",
            "date": "2011-06-22T22:53:17+0000",
            "content": "by the way, if you want to solve the git problem, upload a patch that adds a gitignore file or .keep_me hidden file or whatever, I'll even commit it, and I'm the biggest git-hater there is.\n\nthen, you could fix your git problem, and separately we could deal with simplifying the example. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13053632",
            "date": "2011-06-23T03:37:59+0000",
            "content": "But i see you only targeting empty directories, which cause little confusion at all.\n\nIt's what had my attention at the time due to combination of writing about them and working with git. The other possible improvements you mention sound good to me too.\n\nI'll create a separate issue for git for .gitignore.  But I wanted to first figure out here if those empty directories needed to be there in the first place.  \"work\" does, \"log\"... ? Arguably not.  I think a little tolerance in the ant \"example\" target to needing to create these directories is preferable to adding special hidden files, which always seem to be a bit of a kluge. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13053633",
            "date": "2011-06-23T03:45:31+0000",
            "content": "I'll pop in the .gitignore I use as a start. I mentioned I was going to do this long ago on IRC, but just never got around to it. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13053641",
            "date": "2011-06-23T04:14:39+0000",
            "content": "that still leaves the question of \"logs\". The only thing approaching use of this directory is some commented-out configuration in jetty.xml.\n\nWe could either remove \"logs\" or add a README in it that tells people how to set up logging to go to that directory instead of stdout.\nBut that could just as easily go in the README in \"example\" as well, along with other info on stuff you may want to change to go into production.  Or it could live on a wiki page too... lots of choices. "
        }
    ]
}