{
    "id": "SOLR-8306",
    "title": "Enhance ExpandComponent to allow expand.hits=0",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.5"
        ],
        "affect_versions": "5.3.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "This enhancement allows the ExpandComponent to allow expand.hits=0 for those who don't want an expanded document returned and only want the numFound from the expand section.\n\nThis is useful for \"See 54 more like this\" use cases, but without the performance hit of gathering an entire expanded document.",
    "attachments": {
        "SOLR-8306_branch_5x@1715230.patch": "https://issues.apache.org/jira/secure/attachment/12773312/SOLR-8306_branch_5x%401715230.patch",
        "SOLR-8306.patch": "https://issues.apache.org/jira/secure/attachment/12772825/SOLR-8306.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-17T20:36:03+0000",
            "author": "Marshall Sanders",
            "content": "This is my first attempt at a patch, so please comment and let me know what could be done better as I'm still relatively unfamiliar with the apis available to me.\n\nThe patch is against the lucene_solr_5_3_1 tag in svn. ",
            "id": "comment-15009448"
        },
        {
            "date": "2015-11-18T08:08:00+0000",
            "author": "Shawn Heisey",
            "content": "Thanks for helping out!  I don't know anything about ExpandComponent, so I'm not qualified to review your patch.  The idea sounds generally useful, though.\n\nPatches against trunk are preferred.  This is where primary development occurs.  Most of the changes that are applied to trunk are also backported to the stable branch, which is currently branch_5x.\n\nWe can frequently work with patches against the stable branch as well, because those patches will usually apply to trunk without a lot of manual work.\n\nThe tag for the latest release, which is what you used, can work very well, but sometimes it doesn't.  Tags are static, so trunk and the stable branch can sometimes diverge significantly from the last release tag.  When there is a lot of divergence, it can be very difficult to apply the patch to the working branches. ",
            "id": "comment-15010441"
        },
        {
            "date": "2015-11-19T17:56:21+0000",
            "author": "Marshall Sanders",
            "content": "Updated patch against solr trunk @ 1715009\n\nLet me know if you have any questions, or how to proceed from here.  Ad hoc testing reveals nice improvements in data transferred and QTime for our use cases.\n ",
            "id": "comment-15014026"
        },
        {
            "date": "2015-11-19T19:56:43+0000",
            "author": "Marshall Sanders",
            "content": "Here is a patch against branches/branch_5x @ revision 1715230\n\nIt would be great if this could make its way into 5x at some point.  (maybe before 5.4 wink wink)   ",
            "id": "comment-15014249"
        },
        {
            "date": "2015-11-20T21:00:31+0000",
            "author": "Joel Bernstein",
            "content": "I've reviewed the patch and I think it looks good. This is going to need tests though before it can be committed. It's going to need both single node (TestExpandComponent.java) and distributed test cases (DistributedExpandComponentTest).\n\nI won't have the time to add these in the near future but I can review tests and provide feedback. \n\nAfter the tests are added, I'll still need to spend more time with this before I commit it, so I don't think it's going to make it into 5.4. But the following release is doable. ",
            "id": "comment-15018774"
        }
    ]
}