{
    "id": "SOLR-6478",
    "title": "need docs / tests of the \"rules\" as far as collection names go",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "historically, the rules for \"core\" names have been vague but implicitly defined based on the rule that it had to be a valid directory path name - but i don't know that we've ever documented anywhere what the rules are for a \"collection\" name when dealing with the Collections API.\n\nI haven't had a chance to try this, but i suspect that using the Collections API you can create any collection name you want, and the zk/clusterstate.json data will all be fine, and you'll then be able to request anything you want from that collection as long as you properly URL escape it in your request URLs ... but we should have a test that tries to do this, and document any actual limitations that pop up and/or fix those limitations so we really can have arbitrary collection names.",
    "attachments": {
        "SOLR-6478.patch": "https://issues.apache.org/jira/secure/attachment/12678790/SOLR-6478.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-14121305",
            "date": "2014-09-04T12:44:05+0000",
            "content": "I suspect some of the URLs, etc. get a little wonky when you allow things like spaces, etc. in the names.  Not sure if we should allow them or not. "
        },
        {
            "author": "Anurag Sharma",
            "id": "comment-14175984",
            "date": "2014-10-18T13:24:52+0000",
            "content": "Proper URL escaping can take care the white spaces and special characters. Also, since collection name is a folder it is bounded by the rules on folder/directory name.\n\nAny suggestion on good place to put test cases? "
        },
        {
            "author": "Anurag Sharma",
            "id": "comment-14193817",
            "date": "2014-11-02T12:43:26+0000",
            "content": "Unit test covering the allowed and not allowed collection names is attached. \n\nW3 http://www.w3.org/Addressing/URL/uri-spec.html has a standard for valid character set in the URI. In the code currently there are no filters to disallow any character. W3 guideline can be used to filter some characters in the collection name.\n\nQuery params having special characters or whitespaces can be send after encoding while making API calls. Here is an example to create \"rand chars {£ & $ 1234567890-+=`~@}\" collection\n\n\n$ curl 'http://localhost:8983/solr/admin/collections?action=CREATE&name=rand%20chars%20%7B%C2%A3%20%26%20%24%201234567890-%2B%3D%60~%40%7D&numShards=1&collection.configName=myconf&indent=true&wt=json'\n\n{\n  \"responseHeader\":{\n    \"status\":0,\n    \"QTime\":28509},\n  \"success\":{\n    \"\":{\n      \"responseHeader\":{\n        \"status\":0,\n        \"QTime\":22011},\n      \"core\":\"rand chars {£ & $ 1234567890-+=`~@\\}_shard1_replica1\"}}}\n\n\n "
        }
    ]
}