{
    "id": "SOLR-1209",
    "title": "Site search powered by Lucene/Solr",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "For a number of years now, the Lucene community has been criticized for not eating our own \"dog food\" when it comes to search. My company has built and hosts a site search (http://www.lucidimagination.com/search) that is powered by Apache Solr and Lucene and we'd like to donate it's use to the Lucene community. Additionally, it allows one to search all of the Solr content from a single place, including web, wiki, JIRA and mail archives. See also http://www.lucidimagination.com/search/document/bf22a570bf9385c7/search_on_lucene_apache_org\n\nA preview of the site (for Mahout) is available at http://people.apache.org/~gsingers/mahout/site/publish/\n\nLucid has a fault tolerant setup with replication and fail over as well as monitoring services in place. We are committed to maintaining and expanding the search capabilities on the site.\n\nThe following patch adds a skin to the Forrest site that enables the Solr site to search Solr only content using Lucene/Solr. When a search is submitted, it automatically selects the Solr facet such that only Solr content is searched. From there, users can then narrow/broaden their search criteria.\n\nI'm submitting this patch to Solr first, as we'd like to roll out our capabilities to some of the smaller communities first and then broaden to the rest of the Lucene ecosystem.\n\nI plan on committing in a 3 or 4 days.",
    "attachments": {
        "SOLR-1209.patch": "https://issues.apache.org/jira/secure/attachment/12410145/SOLR-1209.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-12717315",
            "date": "2009-06-08T16:30:39+0000",
            "content": "Patch changing the skin to use Solr powered search "
        },
        {
            "author": "Aleksander M. Stensby",
            "id": "comment-12717316",
            "date": "2009-06-08T16:30:42+0000",
            "content": "Great! "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12717362",
            "date": "2009-06-08T18:52:32+0000",
            "content": "+1 "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12718506",
            "date": "2009-06-11T15:17:18+0000",
            "content": "+1\n\nJust a small doubt – I assume Google shares revenue generated from clicks on the site search page with ASF. Are we sure this is not affecting ASF money-wise? "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12718507",
            "date": "2009-06-11T15:21:34+0000",
            "content": "Just a small doubt - I assume Google shares revenue generated from clicks on the site search page with ASF. Are we sure this is not affecting ASF money-wise?\n\nThey don't share the revenue.  All the Google box is right now is a Forrest auto-generated, default, plugin. "
        }
    ]
}