{
    "id": "SOLR-4006",
    "title": "Many tests on Apache Jenkins are failing with lingering threads.",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Tests"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I think I've tracked this down to being related to the black hole.\n\nIt seems to be a recovery call to a server that is down or something - it's hanging in the connect method even though we are using a connect timeout.\n\n\nThread[RecoveryThread,5,TGRP-SyncSliceTest]\njava.net.PlainSocketImpl.socketConnect(Native Method)\njava.net.AbstractPlainSocketImpl.doConnect(AbstractPlainSocketImpl.java:327)\njava.net.AbstractPlainSocketImpl.connectToAddress(AbstractPlainSocketImpl.java:193)\njava.net.AbstractPlainSocketImpl.connect(AbstractPlainSocketImpl.java:180)\njava.net.SocksSocketImpl.connect(SocksSocketImpl.java:384)\njava.net.Socket.connect(Socket.java:546)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13485766",
            "date": "2012-10-29T01:04:19+0000",
            "content": "The good news is, I can duplicate this on my FreeBSD VM. The bad news is, I don't have a fix yet.\n\nI suspect the fails started happening because of the switch to using the nio jetty connector. I don't think it's acceptable that I have to avoid using that (plus it makes one test randomly take 3 minutes rather than 3 seconds if I don't use it), but I'm not sure how to get around this yet.\n\nIf the hurricane does not eat me up, I'll continue trying to overcome this. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13485880",
            "date": "2012-10-29T07:34:18+0000",
            "content": "About the hurricane – one more reason to switch to git \n\nThe socket issue is interesting, looks like NIO is not respecting the timeout value? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13494461",
            "date": "2012-11-10T00:16:48+0000",
            "content": "I'm back with power and back from ApacheCon finally.\n\nI've confirmed with my local freebsd vm that the nio selector change is indeed the culprit.\n\nIt does seem like perhaps the timeout is not being respected. I'll start by reverting I suppose and keep looking for a solution.\n\nAt worst we can pass a isFreebsd sys prop or something on our free bsd jenkings machine and then don't use NIO in that case. I'd rather it worked somehow though... "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13494586",
            "date": "2012-11-10T07:54:53+0000",
            "content": "Hi Mark. Can you send me the detailed spec of this freebsd vm you're using and an ant line that reproduces this hang? I'll take a look, I'm also curious what's happening, in particular with regard to those forever-hung jvms that don't timeout (I suppose it's some sort of native socket wait that's causing this). "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13494669",
            "date": "2012-11-10T13:05:05+0000",
            "content": "I don't think the spec matters much - I've got two versions in envs with different Comps and different host hardware and different VM hardware.\n\nI think the key is simply installing freebsd and turning on the hardcore black hole mode, eg\n\n\n# sysctl -w net.inet.tcp.blackhole=2\nnet.inet.tcp.blackhole: 0 -> 2\n# sysctl -w net.inet.udp.blackhole=1\nnet.inet.udp.blackhole: 0 -> 1\n\n# echo net.inet.tcp.blackhole=2 >> /etc/sysctl.conf\n# echo net.inet.udp.blackhole=1 >> /etc/sysctl.conf\n\n\n\nOne of mine is all port snapped up to date, another is further back. Both are FreeBSD 9.\n\nNext just run one of the problem tests.\n\nI use SolrCmdDistributorTest, because it's also what prompted the switch. This test makes a bunch of connections very quickly. With the non NIO connector, it sometimes takes 2 seconds, sometimes 2 minutes. With the NIO connector it's always 2 seconds in my experience. However, on FreeBSD, you have the hangs after the test is over... "
        }
    ]
}