{
    "id": "SOLR-5472",
    "title": "Solr deleting newly created indexes after some hour",
    "details": {
        "affect_versions": "4.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "clients - php",
            "MoreLikeThis"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "I am runnig cron job for indexing and commiting documents for solr search. Earlier everything was fine. But from some time it is deleting indexes from index folder. Whenever I update any document or create any new document, it gets indexed and commited and appear in search but after some hour later when i search for the same document it gets disappear from the search and when i cheked index folder size then noticed that it gets reduced to its original size that was before updating the document.\n\nDevlog shows a delete query gets fired automatically by _cli_scheduler.\nQuery is:\n<delete fromPending=\"true\" fromCommitted=\"true\"><query>(endtime:[* TO NOW] AND -endtime:\"1970-01-01T01:00:00Z\")</query></delete>\n\n\nCould anyone please let me know why it is deleting only newly created indexes not the old indexes. Old indexes appear in search.\n\nHow can i stop this deletion process.\n\nAlthough I checked for deletion policy also but in my solrsonfig.xml it is commented.\n\nMy solr was running fine on production but now it is creating above mentioned issue. So urgent help require.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13827524",
            "date": "2013-11-20T10:49:23+0000",
            "content": "Please raise issues on the user's list rather than the JIRA to be sure they're actually problems and not mis-configuration. In this case, this is very suspicious:\n<delete fromPending=\"true\" fromCommitted=\"true\"><query>(endtime:[* TO NOW] AND -endtime:\"1970-01-01T01:00:00Z\")</query></delete>\n\nIt's basically deleting everything in your index except \n1> docs with no endtime\nor\n2> an endtime exactly equal to 1970-01-01T01:00:00Z.\n\nMy suspicion is that what's changed is that new documents are now getting endtime values and weren't before. Or you've changed the delete. Or the cron job wasn't running before. "
        },
        {
            "author": "vishal",
            "id": "comment-13827534",
            "date": "2013-11-20T11:02:35+0000",
            "content": "Hi Erick\n\nThanks for your reply.\n\nBut my new documents not having endtime value neither they had before. Neither I had changed the delete. Cron job is also running from starting of the project.\n\nCould you please let me know how can I stop this because this was not happening earlier. It start after the restarting of Tomcat.\n\nThe index that were created before the tomcat restart remains present but the index that were created after that gets delete.\n\nCould you please suggest me what should I do to stop this.\n\nIf you require any further input from my side then kindly let me know.\n\nRegards\nVishal Gupta\nCUG: 830 4659\nEmail: vishal.gupta@steria.co.in\n "
        },
        {
            "author": "vishal",
            "id": "comment-13827548",
            "date": "2013-11-20T11:06:02+0000",
            "content": "Problem is still not resolved. How can I stop this index deletion "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13827561",
            "date": "2013-11-20T11:28:12+0000",
            "content": "Do not keep changing the status of this JIRA and continuing to ask the question here. Use the user's list for asking questions like this until you're sure it's really a problem. The user's list will reach a much wider audience.\n\nSee:\nhttp://lucene.apache.org/solr/discussion.html\nfor information on how to subscribe to the user's list. "
        },
        {
            "author": "vishal",
            "id": "comment-13827592",
            "date": "2013-11-20T12:07:23+0000",
            "content": "Ok Erick I apologise.\n\nNow I have raised that ques on users list. also.\n\n "
        }
    ]
}