{
    "id": "SOLR-10850",
    "title": "HttpSolrClient Javadoc examples reference nonexistent constructors",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrJ"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "7.0",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "A recent JIRA removed a number of deprecated constructors from the SolrClient implementations.\n\nIn the case of HttpSolrClient, the top-level Javadocs contain instantiation instructions that still reference the old constructors:\n\ne.g.\n\n\n/**\n * A SolrClient implementation that talks directly to a Solr server via HTTP\n *\n * There are two ways to use an HttpSolrClient:\n *\n * 1) Pass a URL to the constructor that points directly at a particular core\n * <pre>\n *   SolrClient client = new HttpSolrClient(\"http://my-solr-server:8983/solr/core1\");\n *   QueryResponse resp = client.query(new SolrQuery(\"*:*\"));\n * </pre>\n * In this case, you can query the given core directly, but you cannot query any other\n * cores or issue CoreAdmin requests with this client.\n *\n * 2) Pass the base URL of the node to the constructor\n * <pre>\n *   SolrClient client = new HttpSolrClient(\"http://my-solr-server:8983/solr\");\n *   QueryResponse resp = client.query(\"core1\", new SolrQuery(\"*:*\"));\n * </pre>\n * In this case, you must pass the name of the required core for all queries and updates,\n * but you may use the same client for all cores, and for CoreAdmin requests.\n */\n\n\n\nThese Javadocs should be updated with examples that use the client Builder types.",
    "attachments": {
        "SOLR-10850.patch": "https://issues.apache.org/jira/secure/attachment/12872399/SOLR-10850.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-10T02:34:16+0000",
            "content": "I've attached a patch updating the Javadoc.  Pretty trivial change\n ",
            "author": "Jason Gerlowski",
            "id": "comment-16045334"
        },
        {
            "date": "2017-06-12T23:13:26+0000",
            "content": "When I filed this JIRA issue and SOLR-10851, I filed them separately as they seemed like conceptually different problems.  This ticket was about some a specific Javadoc comment that used some outdated methods; SOLR-10851 was focused on improving SolrClient documentation overall.\n\nBoth issues involved changes to the same lines of code/documentation though, and the recent resolution of SOLR-10851 has resolved this issue by coincidence.\n\nI'm going to mark this issue as closed (if I have the permissions to).  If it turns out that I don't, I would request that someone please close it for me.\n ",
            "author": "Jason Gerlowski",
            "id": "comment-16047199"
        }
    ]
}