{
    "id": "SOLR-10842",
    "title": "Move quickstart.html to Ref Guide",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "The Solr Quick Start at https://lucene.apache.org/solr/quickstart.html has been problematic to keep up to date - until Ishan just updated it yesterday for 6.6, it said \"6.2.1\", so hadn't been updated for several releases.\n\nNow that the Ref Guide is in AsciiDoc format, we can easily use variables for package versions, and it could be released as part of the Ref Guide and kept up to date. It could also integrate links to more information on topics, and users would already be IN the docs, so they would not need to wonder where the docs are.\n\nThere are a few places on the site that will need to be updated to point to the new location, but I can also put a redirect rule into .htaccess so people are redirected to the new location if there are other links \"in the wild\" that we cannot control. This allows it to be versioned also, if that becomes necessary.\n\nAs part of this, I would like to also update the entire \"Getting Started\" section of the Ref Guide, which is effectively identical to what was in the first release of the Ref Guide back in 2009 for Solr 1.4 and is in serious need of reconsideration.\n\nMy thought is that moving the page + redoing the Getting Started section would be for 7.0, but if folks are excited about this idea I could move the page for 6.6 and hold off redoing the larger section until 7.0.",
    "attachments": {
        "SOLR-10842.patch": "https://issues.apache.org/jira/secure/attachment/12874303/SOLR-10842.patch",
        "SOLR-10842-part2.patch": "https://issues.apache.org/jira/secure/attachment/12890412/SOLR-10842-part2.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-21T20:18:05+0000",
            "content": "I'm working through how to reorganize Solr's entire \"Getting Started\" content. I think it's really fair to say it's \"poor\" today. Here's a breakdown of what we do today in that section:\n\nGetting Started\n\n\tSolr is awesome!\n\tSections in this section\n\n\n\nInstallation\n\n\tJava requirements\n\tUntar the package (doesn't use package name \"solr-x.y.z.tar.gz\")\n\n\n\nRunning Solr\n\n\tStart Solr (and stop)\n\tCreate a core\n\tBasic indexing\n\n\n\nA Quick Overview\n\n\tSchema concepts\n\tSolr is amazing!\n\n\n\nA Step Closer\n\n\tInstall directories\n\tMajor config files\n\n\n\nSolr Control Script Reference\n\n\tStart/Stop\n\tCreate/Remove Collection\n\tAuth\n\tZK\n\n\n\nA fair bit of duplicated concepts, low on actual facts, page titles don't reflect what is actually covered there, etc. I'm still working through how I might replace it, but one thing is I want the pages to be clear and give users a really solid orientation to the system. ",
            "author": "Cassandra Targett",
            "id": "comment-16058125"
        },
        {
            "date": "2017-06-21T21:43:04+0000",
            "content": "This is where I'm heading with this:\n\nSolr Quick Start (the Tutorial)\n\n\tStart Solr\n\tCreate Collection\n\tIndex basic data\n\tStop Solr/Restart\n\tDeeper Look (other sections)\n\tWhere to go next\n\n\n\nSolr Installation and Upgrades (rename \"Getting Started\" section; following are sub-sections)\n\n\tInstallation\n\t\n\t\tSystem requirements (including Java)\n\t\tUnix/Windows requirements for using bin/solr\n\t\tUntar/unzip package\n\t\n\t\n\n\n\n\n\tOrientation to your Solr Install\n\t\n\t\tWhere stuff is - what's in the various directories\n\t\tExampledocs & how to use them\n\t\tMajor config files\n\t\n\t\n\n\n\n\n\tTaking Solr to Production (move here)\n\n\n\n\n\tUpgrading Solr (move here)\n\n ",
            "author": "Cassandra Targett",
            "id": "comment-16058307"
        },
        {
            "date": "2017-06-23T19:12:01+0000",
            "content": "Here is a WIP patch for the changes I'm looking at so far if anyone is curious. It moves a lot of stuff around and there is still a lot TODO yet.\n\nThis patch:\n\n\n\tAdds the Solr Tutorial as solr-quick-start.adoc and as a top-level section, directly under \"About this Guide\" in the page hierarchy.\n\tReorganizes the sections under \"Getting Started\":\n\t\n\t\tRemoves a-step-closer.adoc from that hierarchy (but it is not entirely removed yet)\n\t\tMoves \"Taking Solr to Production\", \"Upgrading a Solr Cluster\", and \"Upgrading Solr\" to the Getting Started section (the first 2 were under \"Managing Solr\", the last was a top-level section)\n\t\tMoves pages in this section around a little bit\n\t\n\t\n\tAdds two new pages:\n\t\n\t\tsolr-system-requirements.adoc as an overview of Solr's installation requirements\n\t\tsolr-configuration-files.adoc as an overview of Solr Home and relevant Solr config files\n\t\n\t\n\tRemoves some redundant content that appeared on several pages\n\tMoves solr-control-script-reference.adoc to become a top-level section that comes after \"Getting Started\" in the page hierarchy.\n\n\n\nKnown TODOs (not including some minor notes in the files already):\n\n\tRemove a-step-closer.adoc entirely\n\tConsider renaming \"Getting Started\" to <something-I-haven't-decided yet>\n\t\n\t\tFinalize the page depending on its name\n\t\n\t\n\tFlesh out system requirements information\n\tRename \"Upgrading Solr\" to \"Solr Upgrade Notes\" or something similar to indicate it's not \"how to upgrade Solr\"\n\tFix the Solr Tutorial\n\t\n\t\tIt's broken already today because of javadoc changes in SOLR-10862\n\t\tPossibly break it up a bit into smaller bits depending on amount of time user has\n\t\n\t\n\n\n\nI may also add more to the TODO list as I continue to work through the pages. ",
            "author": "Cassandra Targett",
            "id": "comment-16061393"
        },
        {
            "date": "2017-06-23T20:42:56+0000",
            "content": "I applied the patch (which was reversed btw  and pushed to my Github account for easier review:\n\nhttps://github.com/cominvent/lucene-solr/tree/solr10842/solr/solr-ref-guide/src\n\nDiff: https://github.com/apache/lucene-solr/compare/master...cominvent:solr10842?expand=1\nNote, you can click the \"View\" button for each file in the diff to view the rendered file, or the little page icon for a \"Rich diff\" which is cool! ",
            "author": "Jan Høydahl",
            "id": "comment-16061477"
        },
        {
            "date": "2017-06-29T09:44:49+0000",
            "content": "I think all of these changes are very good. Some comments:\n\nsolr-system-requirements.adoc: The instructions in this section should work for any platform, with a few exceptions for Windows as noted.\nI cannot find any exceptions for windows in that file. Solr tests are also run on macOS (Uwe). I think this page should probably mention that Oracle JRE and OpenJDK are believed to have best test coverage and stability, and that some versions of Java shipping with some Linux distros do not work.\n\nsolr-configuration-files.adoc: When Solr runs in an application server...\nWe should not talk about app servers. Solr is a standalone app\n\nsolr-quick-start.adoc: wt=json&indent=true...\nNo need for wt=json&indent=true after it becomes the default in 7.0 ",
            "author": "Jan Høydahl",
            "id": "comment-16068083"
        },
        {
            "date": "2017-06-29T13:38:53+0000",
            "content": "Thanks Jan for the review so far. \n\nThese are pretty minor points, but wanted to reply directly.\n\nNo need for wt=json&indent=true after it becomes the default in 7.0\n\nSure, but it's not committed yet so there is a (maybe slim) chance it won't be. Also, the whole tutorial is broken right now; this is the least of the worries there since it needs to be redone anyway.\n\nWe should not talk about app servers. Solr is a standalone app\n\nI'm reasonably sure that was already there in whatever original file I pulled from - I wouldn't have added it (at least I hope I wouldn't!) - but I'll keep my eye out to fix it before it's final. ",
            "author": "Cassandra Targett",
            "id": "comment-16068346"
        },
        {
            "date": "2017-07-06T21:25:27+0000",
            "content": "Cassandra Targett: Please consider whether the just committed SOLR-9526 affects the Quickstart guide in any way. ",
            "author": "Jan Høydahl",
            "id": "comment-16077217"
        },
        {
            "date": "2017-07-18T14:26:48+0000",
            "content": "Please consider whether the just committed SOLR-9526 affects the Quickstart guide in any way.\n\nIt does, but in a mostly minor way. The much bigger problem is that the primary indexing example that most of the later query examples depend on is no longer possible (SOLR-10862). That has a much deeper impact throughout.\n\nI likely need some help figuring out how to replace that example. I tried to replace it with a simple web crawl using post.jar, but it's not working. I also think that's problematic - users may think post.jar is a crawler, which would be incorrect, and if they don't have internet access they're stuck. The other exampledocs are relatively light - it's a possibility, but would be nice to have something more robust.\n\nThere is a nice set of example docs in example/films, but the README there says the user should explicitly set up a few fields in the schema before indexing them, which is also not ideal for the very first step of a \"quick start\". The changes in SOLR-9526 may in fact help that - I'll try it and see if that can be used instead without any manual field manipulation by users. ",
            "author": "Cassandra Targett",
            "id": "comment-16091619"
        },
        {
            "date": "2017-07-18T15:02:47+0000",
            "content": "The changes in SOLR-9526 may in fact help that - I'll try it and see if that can be used instead without any manual field manipulation by users.\n\nStill won't work. One of the fields to fix from the README is the \"name\" field, which because the first film in the list is named \".45\", Solr assumes it's a DoublePointField. Later titles fail because of that. It now gets the \"initial_release_date\" right though. ",
            "author": "Cassandra Targett",
            "id": "comment-16091677"
        },
        {
            "date": "2017-07-18T15:11:51+0000",
            "content": "One of the fields to fix from the README is the \"name\" field, which because the first film in the list is named \".45\", Solr assumes it's a DoublePointField.\n\nIf I move one of the later titles to be first, Solr guesses properly. Perhaps I should commit that change so that example requires no manual intervention at all? ",
            "author": "Cassandra Targett",
            "id": "comment-16091688"
        },
        {
            "date": "2017-08-02T20:41:08+0000",
            "content": "I've made a lot of new changes, and to make review easier all around, I pushed the branch I've been working on to jira/solr-10842.\n\nI redesigned the tutorial (and renamed it from \"Quick Start\" to \"Tutorial\") so it now follows a 3-exercise plan that takes the user through some steps and educates him/her along the way about a few things:\n\n\n\tExercise 1 shows how to use bin/solr to launch Solr in cloud mode, index some data and do some queries. It takes the user through the full interactive session so the sample_techproducts_configs can be used, explaining each step along the way. The user then indexes the techproducts data with bin/post and runs a few types of searches (simple keyword, fielded search, phrase search).\n\tExercise 2 shows how to create another collection, index the films sample data, and work with facets. The collection in this exercise uses the _default configset. It explains the limitations of schemaless, and exposes them to using the Schema API to manually create a field and a copyField so the films data is properly indexed. Then the user works with facets - simple facets, date range facets, then pivot facets.\n\tExercise 3 isn't much of an exercise, really, but an encouragement for the user to index a local set of data, taking into consideration any schema needs, etc. It points to using bin/post for \"rich\" files like PDFs, Word, etc., or DIH, or SolrJ, or the Documents Screen in the UI. It asks the user to start thinking about their needs for implementation.\n\n\n\nThis is probably mostly there, but the Windows coverage is relatively spotty. Some actions have Windows corollary commands, but most don't. I forget how to use Windows entirely, so would appreciate some assistance there. There may also be typos, etc., that need to be fixed. Since it's on a branch, submissions are welcome.\n\nStill TODO are to rename the \"Upgrading Solr Page\" as I mentioned in earlier comments, and possibly rename \"Getting Started\". \n\nThis is holding me up from a couple other things needed for 7.0 Ref Guide (like upgrading info), so I hope to commit these changes as soon as I finish those items and do a couple more read-throughs (by the end of the week maybe?). ",
            "author": "Cassandra Targett",
            "id": "comment-16111680"
        },
        {
            "date": "2017-08-03T20:54:04+0000",
            "content": "I think I'm finally done with what I wanted to do here.\n\nI read through the tutorial again, and it could likely use more incremental improvement, but that could be done later or once it's on master.\n\nI decided the running-solr.adoc page was redundant - I moved its content about starting Solr after install/unpack to the installing-solr page. \n\nI also moved some of the pages under Getting Started to improved the flow - Upgrading a Solr Cluster now follows directly after Taking Solr to Production, which fits since they go together somewhat.\n\nUpgrading Solr has been renamed to Solr Upgrade Notes to reflect the fact it's not an Upgrade Guide. With all of the above changes, I'm OK with keeping Getting Started as a name for the entire section, so don't plan to change that as I previously thought I might.\n\nI'll give this a day or two and commit it to master if there isn't any feedback. ",
            "author": "Cassandra Targett",
            "id": "comment-16113464"
        },
        {
            "date": "2017-08-15T19:07:14+0000",
            "content": "Commit 0b353b6741a88cb85cb92d21cf825e7d412ece97 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0b353b6 ]\n\nSOLR-10842: Move Tutorial to Ref Guide\nSquashed commit of the following:\n\ncommit 1cc4de5c4506c757746eac1809f9a7f3d3a55d00\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Tue Aug 15 13:23:40 2017 -0500\n\n    SOLR-10842: add Field UI images; rename image paths; minor cleanups\n\ncommit 39c7c2f87c54eaaa3341dd119ecd4f0675244a38\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Thu Aug 3 15:49:21 2017 -0500\n\n    SOLR-10842: remove running-solr.adoc; move starting solr content to installing-solr; move pages to improve flow; final readthrough\n\ncommit 70bea0e73159557f991572ad680a251a0791faec\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Wed Aug 2 19:31:57 2017 -0500\n\n    SOLR-10842: rename upgrading-solr.adoc; fix links\n\ncommit 0d0cbe7980bf0868ea5d36093aad6101201de82b\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Tue Aug 1 09:46:42 2017 -0500\n\n    SOLR-10842: page re-org cleanup; copy edits on tutorial; rename \"quick-start\" to \"tutorial\"\n\ncommit 4a2635638b214b1480d3b7055afa219ae7bb6a36\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Fri Jul 28 13:45:39 2017 -0500\n\n    SOLR-10842: Overhaul of tutorial; update query image\n\ncommit 1e1646223b29a0788597d3695b5d0e7ebdd28187\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Thu Jul 20 14:13:43 2017 -0500\n\n    little typos\n\ncommit e2cb85649dabfd7fd7df6f3d3cce2ca58a4c76a9\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Wed Jul 19 09:32:25 2017 -0500\n\n    Change example to use Films\n\ncommit 49ad12ca58d5b3bbe60f3cb8f61469bfe321fcc3\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Tue Jul 18 09:31:03 2017 -0500\n\n    Further experiments with tabbed layout\n\ncommit 21e4dcb38f802f9d2aed795d5c6ba3701b0178ae\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Mon Jul 17 16:58:33 2017 -0500\n\n    Fix page links; add experiment with tabs for different data formats\n\ncommit c24a9385361d22d7cb51051152b9e1f834c25d45\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Thu Jun 29 14:36:01 2017 -0500\n\n    SOLR-10842: minor changes to a few files\n\ncommit 819f160423d17dbb647935c5bbfd8a16d4b7b57c\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Fri Jun 23 13:49:32 2017 -0500\n\n    SOLR-10842: major page reorg; new content for install and config files\n\ncommit 4be7b61ba46f440accdf96757566c3d854e09328\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Tue Jun 13 15:34:49 2017 -0500\n\n    SOLR-10842: installation docs\n\ncommit c83a9ba91d96d5b75df2191404a3482ca81f8505\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Tue Jun 13 13:56:47 2017 -0500\n\n    SOLR-10842: little fixes for quick start\n\ncommit 10c1a462338aa16c0435c01eba0506fe09277174\nAuthor: Cassandra Targett <ctargett@apache.org>\nDate:   Fri Jun 9 13:47:04 2017 -0500\n\n    SOLR-10842: add quickstart.html from CMS; convert to asciidoc style ",
            "author": "ASF subversion and git services",
            "id": "comment-16127724"
        },
        {
            "date": "2017-08-15T19:18:57+0000",
            "content": "I've merged the branch I was working on with master. I'm going to let it sit a day and backport to 7x & 7.0 tomorrow.\n\nWhen this is released, there are additional steps to redirect users from existing tutorial to the new one, etc. So it's not done yet. ",
            "author": "Cassandra Targett",
            "id": "comment-16127745"
        },
        {
            "date": "2017-08-16T21:13:01+0000",
            "content": "Commit 7eea63b45455a76e48c59c912853e6d4a0419ce4 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7eea63b ]\n\nSOLR-10842: Move Tutorial to Ref Guide ",
            "author": "ASF subversion and git services",
            "id": "comment-16129426"
        },
        {
            "date": "2017-08-16T21:14:36+0000",
            "content": "Commit 85678d84ec774d0c02ccab874a69305f710d1272 in lucene-solr's branch refs/heads/branch_7_0 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=85678d8 ]\n\nSOLR-10842: Move Tutorial to Ref Guide ",
            "author": "ASF subversion and git services",
            "id": "comment-16129431"
        },
        {
            "date": "2017-10-02T15:30:17+0000",
            "content": "I've updated all the places on the Solr website that link to the tutorial so they now go to the Ref Guide page (https://lucene.apache.org/solr/guide/solr-tutorial.html).\n\nI'm not sure about the redirect rule, though. For ease of updating, I'd like to make it non-versioned, but that is itself a redirect rule and I don't know enough about how this works to know the proper order for these two rules. Should I instead just replace the text of the current quickstart.html page with a link to the new location? Hoss Man or Steve Rowe, maybe one of you have an idea how I could make it work in .htaccess? ",
            "author": "Cassandra Targett",
            "id": "comment-16188322"
        },
        {
            "date": "2017-10-02T17:22:02+0000",
            "content": "if we setup a \"RedirectMatch Permanent\" from /solr/quickstart.html to /solr/guide/solr-tutorial.html  then the order of the rules shouldn't matter – the browser will execute the redirect, and on the second request, the (existing) rules to redirect to the \"current\" version will kick in.\n\nI think that's probably the best thing to do long term?\n\n(the other option would be to setup a rewrite rule so that on the first request quickstart.html is internally rewritten to /guide/solr-tutorial.html, and then the  redirect would happen (i think) ... it would mean the browser would only see a single redirect – but it would also mean search engine caches & book marks would never update – and they'd keep sending people to the \"old\" quickstart.html url) ",
            "author": "Hoss Man",
            "id": "comment-16188451"
        },
        {
            "date": "2017-10-02T22:07:14+0000",
            "content": "if we setup a \"RedirectMatch Permanent\" from /solr/quickstart.html to /solr/guide/solr-tutorial.html\n\nThat worked as advertised, thanks.\n\nAs a last thing, I'll update the quickstart.mdtext file in solr/site/quickstart.mdtxt and in the website CMS to say it's moved so anyone not paying close attention to all these details will be able to figure out what's going on later. ",
            "author": "Cassandra Targett",
            "id": "comment-16188929"
        },
        {
            "date": "2017-10-02T22:14:55+0000",
            "content": "Commit 5b3a5152bdf11758b5a02efb60568098fe825d45 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5b3a515 ]\n\nSOLR-10842: replace quickstart.mdtext content with link to Ref Guide tutorial ",
            "author": "ASF subversion and git services",
            "id": "comment-16188944"
        },
        {
            "date": "2017-10-02T22:15:47+0000",
            "content": "Commit b501676cb4b84f3d0acea82c2ebb1d25943ab915 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b501676 ]\n\nSOLR-10842: replace quickstart.mdtext content with link to Ref Guide tutorial ",
            "author": "ASF subversion and git services",
            "id": "comment-16188947"
        },
        {
            "date": "2017-10-04T14:37:28+0000",
            "content": "I just discovered that the commit I made to modify the solr/site/quickstart.mdtext file is causing precommit to fail, which is due to LUCENE-7911 (bad external link in \"javadocs\", even though it's a valid link to the Ref Guide).\n\nI don't know what to do about that issue, and don't have a ton of time to deal with it right now - anyone object to the idea that I just remove the solr/site/quickstart.mdtext entirely since it's replaced by solr/solr-ref-guide/solr-tutorial.adoc? ",
            "author": "Cassandra Targett",
            "id": "comment-16191341"
        },
        {
            "date": "2017-10-04T14:57:36+0000",
            "content": "anyone object to the idea that I just remove the solr/site/quickstart.mdtext entirely since it's replaced by solr/solr-ref-guide/solr-tutorial.adoc.\n\nThat's not going to work since precommit checks that all the links on a page like https://lucene.apache.org/solr/7_0_0/ are \"valid\" links, but it's rules of \"valid\" are no longer true as described in LUCENE-7911. I tried to change the reference in solr/site/index.xsl to point to where the tutorial will be in production, but that fails the link checker since according to it, that file doesn't exist (it's not wrong in its own context).\n\nSo, we can't have a hard-link using lucene.apache.org and we can't use a relative link that we know works. \n\nThe only solution I know of right now is to remove solr/site/quickstart.mdtext and remove any link to the tutorial from solr/site/index.xsl. If anyone has a better solution, I humbly request your assistance. ",
            "author": "Cassandra Targett",
            "id": "comment-16191390"
        },
        {
            "date": "2017-10-04T15:36:06+0000",
            "content": "The only solution I know of right now is to remove solr/site/quickstart.mdtext and remove any link to the tutorial from solr/site/index.xsl. If anyone has a better solution, I humbly request your assistance.\n\n+1 to remove solr/site/quickstart.mdtext and clean up references to it.  I think we can point to the new location in solr/site/index.xsl.  I'll work on it. ",
            "author": "Steve Rowe",
            "id": "comment-16191445"
        },
        {
            "date": "2017-10-04T18:45:36+0000",
            "content": "Patch. Converts all remaining quickstart.html links to guide/solr-tutorial.html; removes all references to quickstart from the build; and versions the link to the ref guide's tutorial in Solr's versioned top-level documentation page.  Committing shortly. ",
            "author": "Steve Rowe",
            "id": "comment-16191810"
        },
        {
            "date": "2017-10-04T19:15:13+0000",
            "content": "+1 Steve, thanks. ",
            "author": "Cassandra Targett",
            "id": "comment-16191859"
        },
        {
            "date": "2017-10-04T19:17:50+0000",
            "content": "Commit a29a08716766706bd913792cfd3a5dc1cd970de9 in lucene-solr's branch refs/heads/branch_7_0 from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a29a087 ]\n\nSOLR-10842: Convert all remaining quickstart.html links to guide/solr-tutorial.html; remove all references to quickstart from the build; and version the link to the ref guide's tutorial in Solr's versioned top-level documentation page. ",
            "author": "ASF subversion and git services",
            "id": "comment-16191865"
        },
        {
            "date": "2017-10-04T19:25:51+0000",
            "content": "Commit 91659938610036034d0bf1abc7786d781c4f661c in lucene-solr's branch refs/heads/branch_7x from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9165993 ]\n\nSOLR-10842: Convert all remaining quickstart.html links to guide/solr-tutorial.html; remove all references to quickstart from the build; and version the link to the ref guide's tutorial in Solr's versioned top-level documentation page. ",
            "author": "ASF subversion and git services",
            "id": "comment-16191883"
        },
        {
            "date": "2017-10-04T19:25:55+0000",
            "content": "Commit 93d8e428ea4643c6641d8a9b2c73827683b831a4 in lucene-solr's branch refs/heads/master from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=93d8e42 ]\n\nSOLR-10842: Convert all remaining quickstart.html links to guide/solr-tutorial.html; remove all references to quickstart from the build; and version the link to the ref guide's tutorial in Solr's versioned top-level documentation page. ",
            "author": "ASF subversion and git services",
            "id": "comment-16191884"
        }
    ]
}