{
    "id": "SOLR-8589",
    "title": "Add aliases to the LIST action results in the Collections API",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.4.1",
        "status": "Resolved",
        "resolution": "Duplicate",
        "priority": "Minor"
    },
    "description": "Although it is possible to get a list of SolrCloud aliases vi an HTTP API, it is not available as a typical query response, I believe it is only available via the http API for zookeeper.\n\nThe results from the LIST action in the Collections API is well-situated to handle this. The current results are contained in a \"collections\" node, we can simply add an \"aliases\" node if there are any aliases defined.",
    "attachments": {
        "solr-8589-new-list-details-aliases.png": "https://issues.apache.org/jira/secure/attachment/12784024/solr-8589-new-list-details-aliases.png",
        "SOLR-8589.patch": "https://issues.apache.org/jira/secure/attachment/12784016/SOLR-8589.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-23T15:07:24+0000",
            "author": "Shawn Heisey",
            "content": "This was requested by Yago Riveiro in the #solr IRC channel. ",
            "id": "comment-15113774"
        },
        {
            "date": "2016-01-23T15:24:57+0000",
            "author": "Shawn Heisey",
            "content": "Patch.\n\nWas the aliasMap implemented as a nested map with the idea that we might someday support some other kind of alias besides a collection alias?  Currently this code only gets the \"collection\" node from the outer map.  Is this OK? ",
            "id": "comment-15113785"
        },
        {
            "date": "2016-01-23T15:56:18+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Aliases are returned by the clusterstatus API ",
            "id": "comment-15113805"
        },
        {
            "date": "2016-01-23T16:26:55+0000",
            "author": "Yago Riveiro",
            "content": "Aliases are related with collections, if I need to do a HTTP call to get the aliases from clusterstatus API I will need to parse a huge structure (with thousand of collections) with a lot of noise only to know the aliases ...\n\nIMHO the collection API should return this info if requested on a command LIST. Something like aliases=true ",
            "id": "comment-15113817"
        },
        {
            "date": "2016-01-23T17:35:09+0000",
            "author": "Shawn Heisey",
            "content": "I built the branch_5x server with my patch.  Then I started the cloud example, added some collections and some aliases.  WIth the CLUSTERSTATUS action, the information about which aliases are present and what collections are used is scattered all over the output.\n\nI will attach a screenshot showing what you get with my patch on the LIST action.  The change will not affect most programs that consume the LIST output, unless they are coded poorly. ",
            "id": "comment-15113866"
        },
        {
            "date": "2016-01-23T23:53:50+0000",
            "author": "Shawn Heisey",
            "content": "I've discovered that the CREATEALIAS action does not validate whether the target collections actually exist.\n\nI can understand a need to create an alias before the collection exists ... what I propose is that the action should normally validate, but have an option to toggle the validation.  Because of the potential for a backward compatibility break with existing user code, changing the default behavior would need to happen in 6.0. ",
            "id": "comment-15114037"
        },
        {
            "date": "2016-01-26T14:36:29+0000",
            "author": "Steve Molloy",
            "content": "There's already a ticket about listing aliases. ",
            "id": "comment-15117295"
        },
        {
            "date": "2016-01-26T14:58:37+0000",
            "author": "Shawn Heisey",
            "content": "Steve Molloy, either approach is viable.  My approach does not increase the surface area of the API, which I think is preferable.  Users who desire a list of aliases are likely to also want a list of collections in the same part of their project.  Getting both pieces of information with a single request will be very appealing. ",
            "id": "comment-15117335"
        },
        {
            "date": "2016-01-26T15:00:57+0000",
            "author": "Steve Molloy",
            "content": "Sure, just wanted to make sure they're linked. I'm already using the other approach, so laziness is pushing me towards keeping it, but really, one or the other works.  ",
            "id": "comment-15117342"
        },
        {
            "date": "2016-01-26T15:12:24+0000",
            "author": "Yago Riveiro",
            "content": "How is exposed aliases list in SOLR-4968? ",
            "id": "comment-15117356"
        },
        {
            "date": "2016-01-26T15:28:08+0000",
            "author": "Shawn Heisey",
            "content": "How is exposed aliases list in SOLR-4968?\n\nYago Riveiro, the patch for that issue adds a new LISTALIAS action to the Collections API.  This is not a bad approach, I just don't think an entirely new API action is necessary.\n\nShalin Shekhar Mangar is right when he says that this information is available in the CLUSTERSTATUS resonse, but the way the information is presented in that response would require complicated client-side code to get anything useful. ",
            "id": "comment-15117379"
        },
        {
            "date": "2016-01-26T15:56:02+0000",
            "author": "Yago Riveiro",
            "content": "Shawn Heisey, as I said before, aliases are related with collections, a new command doesn't make sense. An alias of a collection is a virtual collection, therefore should be part of LIST command. We share the same opinion. ",
            "id": "comment-15117443"
        },
        {
            "date": "2016-07-20T15:17:24+0000",
            "author": "Mike Drob",
            "content": "Attaching new patch for master branch based on the existing one here and a little bit of Mark's patch on SOLR-4968.\n\nAdded flags to preserve existing behaviour and make printing aliases optional, added test. ",
            "id": "comment-15386016"
        },
        {
            "date": "2016-07-20T16:58:05+0000",
            "author": "Mike Drob",
            "content": "New patch that accounts for SOLR-8995 ",
            "id": "comment-15386204"
        },
        {
            "date": "2016-07-29T15:59:22+0000",
            "author": "Mike Drob",
            "content": "Shawn Heisey - what do you think of the attached patch? ",
            "id": "comment-15399561"
        },
        {
            "date": "2016-08-25T22:15:40+0000",
            "author": "Mike Drob",
            "content": "Bump, does anybody want to take a look at this? ",
            "id": "comment-15437824"
        },
        {
            "date": "2016-08-26T07:11:40+0000",
            "author": "Jan Høydahl",
            "content": "Looks pretty good. There are a few string constants that could be moved to CollectionAdminParams.\n\nAlso, I think we should return aliases by default. This is an extension only and not likely to break old clients - and if it should, old clients have the option of specifying aliases=false. That will be most friendly to both new and old users imo.\n\nThis patch should also update related LIST tests in CollectionsAPISolrJTest. Also it should update JavaDoc comments where they say that the LIST command lists collections to include that it also lists aliases... ",
            "id": "comment-15438581"
        },
        {
            "date": "2016-08-29T18:13:56+0000",
            "author": "Mike Drob",
            "content": "Jan Høydahl, thanks for the review. A couple questions based on your feedback -\n\nThere are a few string constants that could be moved to CollectionAdminParams\nIf we do this, do you think there is going to be confusion between when to use CollectionAdminParams.COLLECTION and CollectionAdminParams.COLLECTIONS? That's the only potential downside that I can see.\n\nAlso, I think we should return aliases by default.\nI don't know if there is anybody out there that has some kind of monitoring script set up to parse the result of LIST, and in general I try to be super conservative about changing APIs. Maybe we default to returning them in 7.0, and not returning them in 6.x? That sounds like a fair compromise to me.\n\nThis patch should also update related LIST tests in CollectionsAPISolrJTest.\nSure. I'm wary of scope creep, but it also makes sense to expand CollectionAdminRequest.List capabilities to allow toggling for collection and aliases as well.\n\nAlso it should update JavaDoc comments where they say that the LIST command lists collections to include that it also lists aliases...\nI think I got all of these, let me know if I missed some. ",
            "id": "comment-15446625"
        },
        {
            "date": "2016-08-30T08:56:19+0000",
            "author": "Jan Høydahl",
            "content": "If we do this, do you think there is going to be confusion between when to use CollectionAdminParams.COLLECTION and CollectionAdminParams.COLLECTIONS? That's the only potential downside that I can see.\n\nThinking about it, perhaps it is better to skip this detailed control of what to list. Keep things simple. We add a section to the LIST XML response. It is generally useful, it is not huge in size, and no real benefit to be able to turn it on or off imo.\n\n\nAlso, I think we should return aliases by default.\nI don't know if there is anybody out there that has some kind of monitoring script set up to parse the result of LIST, and in general I try to be super conservative about changing APIs. Maybe we default to returning them in 7.0, and not returning them in 6.x? That sounds like a fair compromise to me.\n\nThis is XML, and we add a new XML node, not changing anything of the existing. Any XML parser used to retrieve the <arr name=\"collections\"> would still work exactly as before. So even if someones script breaks, that will still not be a bug on our parts, this is not a back-compat break.\n\nI can take a stab at simplifying the patch  ",
            "id": "comment-15448491"
        },
        {
            "date": "2016-08-30T09:25:48+0000",
            "author": "Jan Høydahl",
            "content": "Before continuing on this, I'd like to check with Mark Miller and Steve Molloy who were working on a LISTALIAS command in SOLR-4968. Are you fine with closing that issue and pursuing this one? ",
            "id": "comment-15448555"
        },
        {
            "date": "2017-01-11T11:52:13+0000",
            "author": "Yago Riveiro",
            "content": "Any progress on this issue? ",
            "id": "comment-15818106"
        },
        {
            "date": "2017-02-17T16:41:54+0000",
            "author": "Mark Miller",
            "content": "I don't know if the patch in the other issue offers anything or not, but looks like the same issue. I'd just finish the issue, add a test, etc. ",
            "id": "comment-15872085"
        },
        {
            "date": "2017-04-17T10:27:45+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Fixed in SOLR-10447. ",
            "id": "comment-15970941"
        },
        {
            "date": "2017-04-17T21:43:53+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 201ebbc5049e5c389ed0a79f6621cd057ed624ea in lucene-solr's branch refs/heads/master from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=201ebbc ]\n\nSOLR-10447, SOLR-4968, SOLR-8589: Adding contributors to CHANGES.txt ",
            "id": "comment-15971681"
        },
        {
            "date": "2017-04-17T21:50:02+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 3e5f76251a31a629ebcb3a504be6202714d5ce52 in lucene-solr's branch refs/heads/branch_6x from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=3e5f762 ]\n\nSOLR-10447, SOLR-4968, SOLR-8589: Adding contributors to CHANGES.txt ",
            "id": "comment-15971698"
        },
        {
            "date": "2017-04-17T22:00:04+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 05ed7cf02440ede6f1f67786ea85a49c8af8ea76 in lucene-solr's branch refs/heads/branch_6x from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=05ed7cf ]\n\nSOLR-10447, SOLR-8589: Adding Yago Riveiro to changelog ",
            "id": "comment-15971715"
        },
        {
            "date": "2017-04-17T22:00:27+0000",
            "author": "ASF subversion and git services",
            "content": "Commit d286864d801bc3ba2c51714a41d58632e7da1200 in lucene-solr's branch refs/heads/master from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d286864 ]\n\nSOLR-10447, SOLR-8589: Adding Yago Riveiro to changelog ",
            "id": "comment-15971717"
        }
    ]
}