{
    "id": "SOLR-4902",
    "title": "Confusing names/identifiers in example schema",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The following came up in the IRC channel today:\n\n\n16:34 < sayuke> I can't work this out for the life of me. Is text in text:blah\n                some sort of special syntax for searching all text fields?\n                Google keywords other than text: appreciated\n\n\n\nA better name for this would be something that includes catchall.  There is a lot of documentation that mentions this field name that would all have to be updated.\n\nAnother new user was well-confused by the Admin UI with SolrCloud, expecting that they would see the collections that they have created, instead of the weird shardN_replicaN cores they found.  This problem is further compounded by the fact that the default core in the example is named 'collection1' although it is not in fact a collection.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13678481",
            "date": "2013-06-07T21:51:14+0000",
            "content": "Let's not forget that it's impossible to prevent all confusion.  I haven't seen anyone confused by \"text:\" before, so just because one person turned up doesn't mean switching to an alternative will improve things (and switching always has a cost, including the number of people that will be confused by the disappearance of the \"text\" field, as well as all the documentation changes... which would need to be version specific).\n\nAnother new user was well-confused by the Admin UI with SolrCloud, expecting that they would see the collections that they have created, instead of the weird shardN_replicaN cores they found.\n\nYeah, having collections front-and-center does seem like a reasonable expectation.\n\nThis problem is further compounded by the fact that the default core in the example is named 'collection1' although it is not in fact a collection.\n\nI think it is?  The concept of a collection need not be tied to cloud mode.\nIn fact I was just thinking that we should make certain APIs like \"collection creation\" always work (regardless of if you are in cloud mode or not).  There's a general desire to reduce the differences between cloud and non-cloud modes. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13678494",
            "date": "2013-06-07T22:01:20+0000",
            "content": "We might not end up implementing all my ideas, and that's OK.  If all this issue does is go through the config files and help us decide that what we have now is good enough with a few documentation tweaks, then I think it has done it's job. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13678498",
            "date": "2013-06-07T22:06:54+0000",
            "content": "the default core in the example is named 'collection1' although it is not in fact a collection.\n\nCould you clarify that comment? I mean, how is it not a collection? Just because a collection exists only for a single shard on a single node doesn't make it not a collection. Sure, it happens to be a single core as well, but that doesn't make it not a collection. The term \"collection\" refers primarily to the data - a \"logical index\", which may or may not reside on a single Solr core.\n\nThink of a core as a \"box\" and your data or logical index as a \"collection\". Sure you need a box to contain your collection, but the box and what it contains are distinct. In the real world we label boxes, usually by the name of what is going into the box rather than the nature of the box itself.\n "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15677372",
            "date": "2016-11-18T18:28:41+0000",
            "content": "Closing this older issue.\n\nThe new Admin UI puts a better focus on collections so they are more straightforward to work with. In addition, collection1 is gone, so that confusion is removed.\n\nThere is still a catchall field that's now called text (from the data_driven_schema, might be different in other examples), which is either more or less confusing depending on how you look at it. However, it's not hard to figure out from the Admin UI that the field is populated by data in all the other fields (\"Copied from *\") and that feels all right to me since I haven't heard this complaint widely.\n\nIf folks disagree and think this should be open still, please feel free to reopen. "
        }
    ]
}