{
    "id": "SOLR-1224",
    "title": "NamedList contained in SolrJ jar file",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "In Solr 1.3, NamedList (for example, that being returned by SolrInfoMBean.getStatistics()) was in org.apache.solr.util, but it has changed to be NamedList in org.apache.solr.common.util (looks like it changed packages). Unfortunately, the class file has also moved over to the SolrJ JAR file, probably because people using SolrJ need access to it.\n\nI would assert that the NamedList class file should not be in the SolrJ JAR file, because people writing code against Solr-core shouldn't be required to include the SolrJ JAR in their projects just so that they can access the NamedList object (for example, when reading stats from the SolrInfoMBean), and thus it should be moved back to the solr-core jar file.\n\n(Oddly, the original NamedList, now deprecated, is still present in org.apache.solr.util in the solr-core JAR, which is a related problem. But code has been rewritten to return the new NamedList in org.apache.solr.common.util.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12720314",
            "date": "2009-06-16T19:34:53+0000",
            "content": "SolrJ is now used by Solr itself though to make calls to other Solr servers (for distributed search). "
        },
        {
            "author": "Daryl Beattie",
            "id": "comment-12720315",
            "date": "2009-06-16T19:42:47+0000",
            "content": "Okay, interesting.\n\nIs \"distributed search\" a pluggable feature that can be enabled by including a separate jar file or is it built into solr-core? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12720317",
            "date": "2009-06-16T19:53:42+0000",
            "content": "It's somewhat built into solr currently (at the SearchHandler level).  It's certainly possible that it could be separated out... but not sure if that's high on anyone's priority list.  Most people are asking for more distributed search  "
        },
        {
            "author": "Daryl Beattie",
            "id": "comment-12720327",
            "date": "2009-06-16T20:19:48+0000",
            "content": "Ok.\n\nI guess we should resolve this issue as \"won't-fix\" then. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12720332",
            "date": "2009-06-16T20:27:59+0000",
            "content": "OK - closing. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12720445",
            "date": "2009-06-17T00:47:16+0000",
            "content": "For the record... 1.3 had three jars with a strange circular dependency graph.\n\n\tsolr-common (self sufficient)\n\tsolr-solrj (requires solr-common and parts of solr-core)\n\tsolr-core (requires solr-common and parts of solr-solrj)\n\n\n\nIn 1.4 there are only two jars:\n\n\tsolr-solrj (solr-common+solr-j)\n\tsolr-core (requires solr-solrj)\n\n\n\nperhaps the names should change, but it is more a legacy issue now. "
        }
    ]
}