{
    "id": "SOLR-258",
    "title": "Date based Facets",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "1) Allow clients to express concepts like...\n\n\t\"give me facet counts per day for every day this month.\"\n\t\"give me facet counts per hour for every hour of today.\"\n\t\"give me facet counts per hour for every hour of a specific day.\"\n\t\"give me facet counts per hour for every hour of a specific day and give me facet counts for the\n       number of matches before that day, or after that day.\" \n2) Return all data in a way that makes it easy to use to build filter queries on those date ranges.",
    "attachments": {
        "date_facets.patch": "https://issues.apache.org/jira/secure/attachment/12359228/date_facets.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12502588",
            "date": "2007-06-08T00:50:35+0000",
            "content": "First pass, no tests but the basics work ... i'm not all that happy about the cleanliness of the code yet (particularly the back and forth of format conversions).\n\nParams...\n\n\n\tfacet.date = FIELD_NAME ... multivalued\n\t(f. FIELD_NAME.)facet.date.start = DATE ... single value, per field overridable, date that supports \"NOW\" style date math strings\n\t(f. FIELD_NAME.)facet.date.end = DATE ... single value, per field overridable, date that supports \"NOW\" style date math strings\n\t(f. FIELD_NAME.)facet.date.gap = DATE_MATH_STR ... single value, per field overridable, date math string (ie: \"+1DAY\")\n\t(f. FIELD_NAME.)facet.date.other = pre | post | inner | all ... multivalue, per field overridable, string indicating what \"other\" info we want about the range:\n          o pre = the count of matches before the start date\n          o post = the count of matches after the end date\n          o inner = the count of all matches between start and end\n          o all = all of the above (default value)\n          o none = no additional info requested. \n\n\n\n\nStill Todo...\n\n1) add the support for facet.date.other (simple to do, just ran out of time to day)\n2)  Date parsing needs to be enhanced to support date math on full date strings, not just \"NOW\" that way if a client knows they are using facet.date.gap of +1DAY and they get back a facet count for 1995-12-31T00:00:00.000Z they can easily generate a filter query for field:[1995-12-31T00:00:00.000Z TO 1995-12-31T00:00:00.000Z+1DAY] to restrict their results \n3) rethink some of the \"ft.toExternal(ft.toInternal(...))\" type stuff going on to ensure any date math strings are parsed... some of this may make sense as lower level methods in the DateField class\n\nQuestions I'm not sure about...\n\n\n\thow much should we worry about gaps not dividing evenly between start/end ... right now every range is exactly \"gap\" wide ... even if it goes past the \"end\".  Should the last gap end at \"end\" no matter what? (how would we return that info in a way that's easy to parse and make a filter query out of)\n\tranges currently include both end poinst ... Ideally we'd include one end but not the other (so no overlap) but that makes filterqueries to restrict by those rnages hard (even though queryparser supports inclusive or exclusive ranges it doesn't support a mix/match of inclusive on one side and exclusive on the other).  maybe we can have an \"interval\" param which defaults to one millisecond so ranges can allways be inclusive and still not overlap?\n\twhat should happen if \"end < start\" or \"gap < 0\" ... maybe those should be okay as long as both are true.\n\tshould we support hardcoded default values for start, end, and gap? ... for start it's easy to get the lowest value in the field, but what about gap and end?\n\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12504925",
            "date": "2007-06-14T21:27:19+0000",
            "content": "no functionality changes, just reivsed to work with current trunk (547393) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12504996",
            "date": "2007-06-15T01:39:49+0000",
            "content": "revised patch with added functionality...\n\n1) facet.date.other now supported\n2) the value of \"gap\" always explicitly returned for each field so all of the dates used as keys can be made into filter queries because...\n3) DateField enhanced to support DateMath parsing of arbitrary dates (ie: 1995-12-31T23:59:59.999Z+5MINUTES)\n\nstill haven't answered any of hte open questions before, nor have i cleaned up the usage of things like ft.toExternal(ft.toInternal(...)) in SimpleFacets \n\n(it still bugs me, but i'd rather not refactor until i have some test cases) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12507041",
            "date": "2007-06-21T21:43:53+0000",
            "content": "no functional changes:\n\n\tupdated to work against trunk\n\tchanged name of toExternal method to toObejct to be more consistent with recent trunk additions.\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12512311",
            "date": "2007-07-12T23:55:52+0000",
            "content": "patch now includes unit tests, as well as a bug fix i discovered for the pre/inner/post logic after writing the test. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12512312",
            "date": "2007-07-12T23:57:28+0000",
            "content": "i'd like to commit this in the next few days baring any objections.\n\nin particular, feedback on the API (ie: query params) would be good ... the internals can always be cleaned up later if people don't like them, but the query args should be sanity checked before people start using them. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12512353",
            "date": "2007-07-13T03:38:21+0000",
            "content": "This looks great Hoss.  Thanks!\n\nThe facet param interface look reasonable.  Structurally, I would like to see 'component' based params split into their own file - FacetParams should be similar to HighlightParams.  It seems funny to munge the get/set field bit with the expanding list of things we may get or set.  If we implement FacetParams as an interface (like HighlightParams), the deprecated class o.a.s.request.SolrParams could implement FacetParams.\n\nOne thing to note on FacetDateOther.get( string ), if you put in an invalid string, you will get IllegalArgumentException or NullPointer - not a 400 response code.  Perhaps somethign like:\n\n  public enum FacetDateOther {\n    PRE, POST, INNER, ALL, NONE;\n    public String toString() \n{ return super.toString().toLowerCase(); }\n    public static FacetDateOther get(String label) {\n      try \n{\n        return valueOf(label.toUpperCase());\n      }\n      catch( Exception ex ) \n{\n        throw new SolrException\n          (SolrException.ErrorCode.BAD_REQUEST,\n           label +\" is not a valid type of 'other' date facet information\", ex );\n      }\n    }\n  } \n\nPersonally, I like the sound of  \"before\", \"after\" and \"between\" better then \"pre\" \"post\" \"inner\".  before/after seem to sit nicely with the other parameters 'start' 'end'. "
        },
        {
            "author": "Pieter Berkel",
            "id": "comment-12512372",
            "date": "2007-07-13T06:16:36+0000",
            "content": "I've just tried this patch and the results are impressive!\n\nI agree with Ryan regarding the naming of 'pre', 'post' and 'inner', using simple concrete words will make it easier for developers to understand the basic concepts.  At first I was a little confused how the 'gap' parameter was used, perhaps a name like 'interval' would be more indicative of it's purpose?\n\nWhile on the topic of gaps / intervals, I can imagine a case where one might want facet counts over non-linear intervals, for instance obtaining results from: \"Last 7 days\", \"Last 30 days\", \"Last 90 days\", \"Last 6 months\".  Obviously you can achieve this by setting facet.date.gap=+1DAY and then post-process the results, but a much more elegant solution would be to allow \"facet.date.gap\"  (or another suitably named param) to accept a (comma-delimited) set of explicit partition dates:\n\nfacet.date.start=NOW-6MONTHS/DAY\nfacet.date.end=NOW/DAY\nfacet.date.gap=NOW-90DAYS/DAY,NOW-30DAYS/DAY,NOW-7DAYS/DAY\n\nIt would then be trivial to calculate facet counts for the ranges specified above.\n\nIt would be useful to make the 'start' an 'end' parameters optional.  If not specified 'start' should default to the earliest stored date value, and 'end' should default to the latest stored date value (assuming that's possible).  Probably should return a 400 if 'gap' is not set.\n\nMy personal opinion is that 'end' should be a hard limit, the last gap should never go past 'end'.  Given that the facet label is always generated from the lower value in the range, I don't think truncating the last 'gap' will cause problems, however it may be helpful to return the actual date value for \"end\" if it was specified as a offset of NOW.\n\nWhat might be a problem is when both start and end dates are specified as offsets of NOW, the value of NOW may not be constant for both values.  In one of my tests, I set:\n\nfacet.date.start=NOW-12MONTHS\nfacet.date.end=NOW\nfacet.date.gap=+1MONTH\n\nWith some extra debugging output I can see that mostly the value of NOW is the same:\n\n<str name=\"start\">2006-07-13T06:06:07.397</str>\n<str name=\"end\">2007-07-13T06:06:07.397</str>\n\nHowever occasionally there is a difference:\n\n<str name=\"start\">2006-07-13T05:48:23.014</str>\n<str name=\"end\">2007-07-13T05:48:23.015</str>\n\nThis difference alters the number of gaps calculated (+1 when NOW values are diff for start & end).  Not sure how this could be fixed, but as you mentioned above, it will probably involve changing \"ft.toExternal(ft.toInternal(...))\".\n\nThanks again for creating this useful addition, I'll try to test it a bit more and see if I can find anything else. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12512559",
            "date": "2007-07-13T18:14:07+0000",
            "content": "\n1) i'm happy to break out the FacetParams into their own interface ... but i'd like to track that in a separate refactoring commit (since the existing facet params are already in SolrParams)\n\n2) i clearly anticipated the FacetDateOther.get( bogus ) problem .. but for some reason i thought it returned null ... i'll fix that.\n\n3) i actually considered before, between, and after originally but decided they were too long (i was trying to find a way to make \"start\" shorter as well ... but two people thinking there better convinces me.\n\n4) my hesitation about renaming \"gap\" to \"interval\" is that i wanted to leave the door open for a sperate \"interval\" option (to define a \"gap between the gaps\" so to speak) later should it be desired ... see the \"questions\" i listed when opening the bug.\n\n5) i don't think this code makes sense for non-linear intervals ... the problem i'm really trying to solve here is using 3 params to express equal date divisions across an arbitrarily long time scale.   for the example you listed simple facet.query options probably make more sense\n\n(allthough you do have me now thinking that a another good faceting option would be some new \"facet.range\" where many values can be specified, they all get sorted and then ranges are built between each successive value ... bt that should be a seperate issue)\n\n6) i want to make start and end optional, but for now i can't think of a clean/fast way to do end ... and we can always add defaults later.\n\n7) my prefrence is for every count to cover a range of exactly \"gap\" but i can definitely see where having a hard cutoff of \"end\" is usefull, so i'll make it an option ... name suggestions?\n\ni'll make sure to echo the value of \"end\" as well so it's easy to build filter queries for that last range ... probably should have it anyway to build filter queries on between and after.\n\nshould the ranges used to compute the between and after counts depend on where the last range ended or on the literal \"end\" param?\n\n8) the NOW variance really bugs me ... back when i built DateMathParser i anticipated this by making the parser have a fixed concept of NOW which could be used to parse multiple strings but i don't kow why i didn't consider it when working on this new patch.\nthe real problem is that right now DateField is relied on to do all hte parsing, and a single instance can't have a fixed notion of \"NOW\" ... it builds a new DateMathParser each time ... i think i'm going ot have to do some heavily refactoring to fix this, which is annoying – but i don't want to commit without fixing this, even if it takes a while any bug that can produce an \"off by 1 millisecond\" discrepancy should die a horrible horrible freaking death.\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12512571",
            "date": "2007-07-13T18:40:07+0000",
            "content": "> \n> but i'd like to track that in a separate refactoring commit (since the existing facet params are already in SolrParams)\n\nsounds good.\n\n> ... originally but decided they were too long ..\n\nIn general, I favor longer self explanatory param names over short ones.    It is kind of annoying to have to look up 'pf', 'bq' to decode what it means.  \n\n\n\t- -\n\n\n\nAgain, this is really great.  Now we can build the ubiquitous calendar widget from solr.\n\nThanks! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12512592",
            "date": "2007-07-13T19:40:28+0000",
            "content": "wrt \"NOW\", DateMathParser constructor could pass in \"now\", and take it from SolrQueryRequest.getStartTime()... the big problem being that I doubt the SolrQueryRequest is always available everywhere it's needed.\n\nOf course, if you had the request, you could just use it's context to stash a DateMathParser too.\n\na ThreadLocal would be another (much less desirable) approach. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12512626",
            "date": "2007-07-13T21:19:34+0000",
            "content": "> the big problem being that I doubt the SolrQueryRequest is always available everywhere it's needed. \n\n...exactly, at the moment all of the date parsing is done inside DateField.\n\ni think i'll try refactoring it so that DateMathParser does all the parsing, and make DateField delegate to it in the non-trivial case.\n\nthe problem that's still a pain to solve is getting all concepts of \"NOW\" to be the samefor a request ... things like an fq=f:[NOW * NOW+1DAY]  are handled by DateField via a query parser ... i can't think of easy way to make that consistent with the facet parsing definition of \"NOW\" (without resorting to a ThreadLocal) "
        },
        {
            "author": "Tristan Vittorio",
            "id": "comment-12512775",
            "date": "2007-07-15T06:32:13+0000",
            "content": "> 4) my hesitation about renaming \"gap\" to \"interval\" is that i wanted to leave the door open \n>      for a sperate \"interval\" option (to define a \"gap between the gaps\" so to speak) later \n>      should it be desired ... see the \"questions\" i listed when opening the bug.\n\nI do like the idea of having an \"interval\" between \"gaps\", however to me it would make more sense to reverse the meanings of these parameters to have \"gaps\" between \"intervals\".  Regardless, as long as it's clearly documented, it shouldn't make any difference what you name them.\n\n> 5) i don't think this code makes sense for non-linear intervals ...\n\nIt might be better to keep the logic simple and as-is for now so you can commit it.  Having a \"facet.range\" parameter or some way to specify multiple date facets on a single field would be useful in the future.\n\n> 7) my prefrence is for every count to cover a range of exactly \"gap\" but i can definitely see where \n>      having a hard cutoff of \"end\" is usefull, so i'll make it an option ... name suggestions?\n\nJust thinking through this further, rather than specifying both start and end times, it might be more precise to specify a single start time, a gap, and a gap \"count\" (how many \"gaps\" to include), this will avoid the problem of the last \"gap\" going past the \"end\" date.\n\nI find it much easier to criticize other people's naming conventions than to come up with good ones myself, however I'll offer \"hardend\" (true | false) as an interim name, hopefully someone can think of a better one.\n\n> i'll make sure to echo the value of \"end\" as well so it's easy to build filter queries for that last range ... \n> probably should have it anyway to build filter queries on between and after.\n\nIt might be helpful to output the value of \"start\" also, especially if it was specified as an offset of NOW.\n\n> should the ranges used to compute the between and after counts depend on where the last range ended or on the literal \"end\" param?\n\nI suppose this will depend on the value of \"hardend\", if true then use the \"end\" value, otherwise use the end of the last gap.\n\n> 8) the NOW variance really bugs me ...\n\nSounds like a pretty nasty problem affecting more than just this date facet.  I know Solr is not a RDBMS, but I always assumed that NOW would be constant throughout the life of a query.  Definitely something to think about as a seperate issue though. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12512776",
            "date": "2007-07-15T06:48:18+0000",
            "content": "> it might be more precise to specify a single start time, a gap, and a gap \"count\" \n> (how many \"gaps\" to include), this will avoid the problem of the last \"gap\" \n> going past the \"end\" date.\n\nthat would eliminate the DateMathParser value add for ... right now you can hardcode \"start=NOW/MONTH&end=NOW/MONTH+1MONTH&gap=+1DAY\" and get counts per day for the current month – no matter how many days are in the current month ... if we changed it so a param said how many counts to compute they couldn't be specified in the solrconfig and the client would have to be a lot smarter (and might as well use explicit date params since it has to know the  current month to know the number of days)\n\n> It might be helpful to output the value of \"start\" also, \n> especially if it was specified as an offset of NOW.\n\nthat's already in the output ... each count is labeled by the lower bound of it's range, so the label of the first count is the  start .. but i guess there's no harm in being explicit about it. "
        },
        {
            "author": "Pieter Berkel",
            "id": "comment-12512778",
            "date": "2007-07-15T06:58:22+0000",
            "content": "Sorry that last comment was from me (not Tristan), not posted from my regular computer.  I'll be more careful to post as myself and not as a colleague in future (I was wondering why JIRA didn't ask me to login, d'oh). "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12514019",
            "date": "2007-07-19T22:03:29+0000",
            "content": "checkpoint...\n\n\n\trenamed pre/post/inner to before/after/between\n\tadded a new facet.date.hardend param (with test additions)\n\n\n\n...still need to tackle the \"NOW\" inconsistency issue. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12514043",
            "date": "2007-07-19T23:12:44+0000",
            "content": "fixed the the NOW issue by refactoring the toExternal(toInternal()) logic into a new DateField.parseMath(Date,String) method ... a DateMathParser is still used internally to deal with teh math parsing aspects, but i wanted to leave the assumptions about the date format in the DateField class itself.\n\ncomments/critique about this approach welcome. "
        },
        {
            "author": "Pieter Berkel",
            "id": "comment-12515208",
            "date": "2007-07-25T05:46:22+0000",
            "content": "Looking good Hoss, the NOW issue seems to be resolved and the results look consistent after a quick test.\n\n> * what should happen if \"end < start\" or \"gap < 0\" ... maybe those should be okay as long as both are true. \n\nIt is probably wise to explicitly check for (\"end < start\" XOR \"gap < 0\") and return an error if so, otherwise the request gets caught in an infinite loop.\n\nJust on the subject of errors, I notice that exceptions thrown by the date facet code are caught in SimpleFacets.getFacetCounts() and written out in the response:\n\n    try \n{\n      res.add(\"facet_queries\", getFacetQueryCounts());\n      res.add(\"facet_fields\", getFacetFieldCounts());\n      res.add(\"facet_dates\", getFacetDateCounts());\n    }\n catch (Exception e) \n{\n      SolrException.logOnce(SolrCore.log, \"Exception during facet counts\", e);\n      res.add(\"exception\", SolrException.toStr(e));\n    }\n\nThis doesn't seem very consistent the way other handlers deal with exceptions (i.e. http response code > 400), is there any reason why it is done this way in SimpleFacets?\n\nI also think it would also be a good idea to merge \"facet_dates\" response field into \"facet_fields\" so that all the facet data in the response is stored in the one location, how feasible would it be to do this? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12515221",
            "date": "2007-07-25T06:42:54+0000",
            "content": "> It is probably wise to explicitly check for (\"end < start\" XOR \"gap < 0\") and return an error \n\nyeah ... good point.\n\n> Just on the subject of errors, I notice that exceptions thrown by the date facet code are\n> caught in SimpleFacets.getFacetCounts() and written out in the response:\n...\n> This doesn't seem very consistent the way other handlers deal with exceptions (i.e. http \n> response code > 400), is there any reason why it is done this way in SimpleFacets? \n\nSimpleFacets isn't a handler, it's just a utility class that other handlers can use. \n\n the original idea behind catching the errors and adding them to the response is that even if a problem happens while generating facet counts, that's just auxiliary data – and the main result set is (probably) still useful, so let the request finish successfully so the client can decide what to do.\n\n> I also think it would also be a good idea to merge \"facet_dates\" response field into\n> \"facet_fields\" so that all the facet data in the response is stored in the one location, how\n> feasible would it be to do this?\n\nfacet_dates and facet_fields are both children of single parent (facet_counts) just like facet_queries ... but they are in their own sub sections because the meaning and usecase are different ... if they were all lumped together you couldn't pragmatically know what each of the children were. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12525511",
            "date": "2007-09-06T20:08:29+0000",
            "content": "strange i could have sworn i resolved this issue ... commited over a month ago. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12579150",
            "date": "2008-03-16T03:23:52+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked \"Resolved\" and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.3 as of today 2008-03-15\n\n\n\nThe Fix Version for all 29 issues found was set to 1.3, email notification was suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this (hopefully) unique string: batch20070315hossman1\n "
        }
    ]
}