{
    "id": "SOLR-6083",
    "title": "Provide a way to list configurationsets in SolrCloud from the admin screen.",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "subtask of SOLR-6082. Set up a cluster with no collections (i.e. don't use the bootstrap convention of the \"getting started\" guide). Push a configuration set up to Solr via command-line. It would be nice to show a list of the available configuration sets.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13999955",
            "date": "2014-05-16T16:39:06+0000",
            "content": "I was just thinking about it the other day. Thanks Erick. Should we fold this into the clusterstatus API? I have already opened issues to add the roles and live nodes information to the clusterstatus API. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14000099",
            "date": "2014-05-16T18:30:35+0000",
            "content": "I just want the functionality, man... Mostly this is about getting the ideas out there before we jump in and do it.\n\nThat seems reasonable. Perhaps CLUSTERSTATUS should have a sub-command? I'm imagining that on a large cluster, there's lots of data this bit isn't interested in. Something like\nlist=collections\nor\nlist=configsets\n\nthat just returns what's interesting for these commands?? "
        },
        {
            "author": "Upayavira",
            "id": "comment-14604306",
            "date": "2015-06-27T18:56:20+0000",
            "content": "my question (received no replies on the dev list) is whether an API that says \"load these files from local disk and push to Zookeeper\" would be considered acceptable, security-wise. Then, the same (or related) API can be used to push config files when a user is logged in. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15043710",
            "date": "2015-12-06T05:44:55+0000",
            "content": "I think maybe this can be closed? Isn't this just the admin UI>>cloud>>tree>>configs?\n\nAssigning to myself to not lose track, I'll close this next week if there are no objections. "
        },
        {
            "author": "Upayavira",
            "id": "comment-15043766",
            "date": "2015-12-06T08:38:24+0000",
            "content": "The tree view should, really, go away (or be relegated) as an implementation detail. A view that shows us config sets as first level citizens would be a good thing.  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15043950",
            "date": "2015-12-06T17:08:09+0000",
            "content": "bq: The tree view should, really, go away (or be relegated) as an implementation detail. A view that shows us config sets as first level citizens would be a good thing.\n\nConfigsets being first-class citizens is fine. As far as the tree view going away, if that happened we'd need to provide first-class citizenship to everything. When troubleshooting a cluster, we need to see live_nodes, each collection's state.json, leader election queues etc. Not to mention that we need a way to see whatever custom properties people put into their state.json nodes etc. So my vote is to keep it where it is.... "
        },
        {
            "author": "Upayavira",
            "id": "comment-15043984",
            "date": "2015-12-06T18:02:46+0000",
            "content": "That's why i said \"or be relegated\". It should not be something that you use as a beginner, rather it should be an advanced tool for looking under the bonnet when the main UI features don't give enough detail. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15044084",
            "date": "2015-12-06T19:40:20+0000",
            "content": "BTW, I have a bunch of other things on my plate, if someone wants to grab this feel free. I assigned it to myself just to keep it from falling off the radar. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15055058",
            "date": "2015-12-13T17:44:02+0000",
            "content": "Hmmm, I think I'd like to close this. Upayavira if we (well, mostly you) rearrange the cloud UI to hide the tree view, we'll have to resolve what should/shouldn't be upgraded to first-class in the UI and how to access all the rest or the info. \n\nMeanwhile, we have a way to see the configsets so this JIRA is unnecessary. "
        },
        {
            "author": "Upayavira",
            "id": "comment-15055122",
            "date": "2015-12-13T20:13:16+0000",
            "content": "I reckon I could knock up a configset UI pretty quickly. There's not a huge about to it.\n\nThere's two possible feature-sets:\n\n1. Show a list of all configsets\n2. List the files that constitute a feature-set, as does the 'files' tab.\n\n#2 could just be a repurposing of the code in the 'files' tab. Question is, does this mean we are repeating the config files too many times? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15364520",
            "date": "2016-07-06T16:02:45+0000",
            "content": "I think between the \"ls\" command from bin/solr and the ability to see the configsets in the tree view this is no longer worth keeping open. Whatever we do longer-term for rearranging things in the UI can tackle how much of this to do. "
        }
    ]
}