{
    "id": "SOLR-1824",
    "title": "partial field types created on error",
    "details": {
        "affect_versions": "1.1.0",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When abortOnConfigurationError=false, and there is a typo in one of the filters in a chain, the field type is still created by omitting that particular filter.  This is particularly dangerous since it will result in incorrect indexing.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12845319",
            "date": "2010-03-15T14:12:23+0000",
            "content": "The partial field is created regardless of abortOnConfigurationError... it's just more serious when it's false and things may look OK. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12845419",
            "date": "2010-03-15T17:33:08+0000",
            "content": "It should be easy to fix. The init() method in the AbstractPluginLoader anonymous class checks for plugin!=null. In the null case it should throw exception to make the whole loadAnalyzer() call invalid, what makes the field type disappear. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12846235",
            "date": "2010-03-17T00:29:31+0000",
            "content": "Can someone point me to a method name and/or line number? ... i'm not following what exactly is the current bug. \n\n(particularly with regards to abortOnConfigurationError=false ... nothing in IndexSchema has ever looked at that config option, so if it has any problem initing a field/fieldtype it should be throwing an exception and completly failing to initialize – so i don't see how the problem could be any better/worse depending on the value of that option) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12847166",
            "date": "2010-03-18T23:56:27+0000",
            "content": "Scratch that – i get it now:\n\n\n\tIndexSchem uses anonymous subclasses of AbstractPluginLoader to instantiate a variety of differnet things\n\tAbstractPluginLoader processes things in a loop, recording errors in SolrConfig.severeErrors when a particular instance can't be inited, but creating the rest of the objects just fine.\n\twhen abortOnConfigurationError=false this results in solr using a schema with missing filters (or missing fields, etc...) .. the only thing that protects people when abortOnConfigurationError=true is that SolrDispatchFilter pays attention to both abortOnConfigurationError and SolrConfig.severeErrors (someone using embedded Solr might never notice the error at all, even if the config did say abortOnConfigurationError=true)\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12849857",
            "date": "2010-03-25T19:16:10+0000",
            "content": "I believe this issue will be fixed by the patch in SOLR-1846 (or a future version of it if i missed something) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12868832",
            "date": "2010-05-18T21:09:36+0000",
            "content": "fixed via SOLR-1846, IndexSchema now fails to initialize if any of the individual plugins fails to initialize (the exception is propogated up to hte caller)\n\n\nCommitted revision 945886. "
        }
    ]
}