{
    "id": "SOLR-2104",
    "title": "DIH special command $deleteDocById dosn't skip the document and doesn't increment the deleted statistics",
    "details": {
        "affect_versions": "1.4,                                            1.4.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "1. Not sure it's a bug, but looks like a bug to me - if the query returns any values other than $deleteDocById for the row you want deleted, it deletes the row but also re-adds it with the rest of the data, so in effect the row isn't deleted.  In order to work around this issue, you have to either make sure no data other than $deleteDocById=<id> exists in rows to be deleted or add $skipDoc='true'\n(which I think is a little counter-intuitive, but was the better choice in my case).  My query looks something like:\nSELECT u.id,\n       u.name,\n       ...\n       IF(u.delete_flag > 0, u.id, NULL) AS $deleteDocById,\n       IF(u.delete_flag > 0, 'true', NULL) AS $skipDoc FROM users_tb u\n\n2. $deleteDocById doesn't update the statistics of deleted documents.\nThis has 2 downsides, the obvious one is that you don't know if/how many documents were deleted, the not-so-obvious one is that if your import contains only deleted items, it won't be committed automatically by DIH and you'll have to commit it manually.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Juan Pablo Mora",
            "id": "comment-13026939",
            "date": "2011-04-29T11:42:47+0000",
            "content": "In Solr 3.1 doesn't update the statistics also. I think is a bug. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13039298",
            "date": "2011-05-25T19:38:59+0000",
            "content": "I added a \"is duplicated by\" SOLR-2492 link here.  SOLR-2492 has a patch that partially fixes the problem. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13064456",
            "date": "2011-07-13T09:38:56+0000",
            "content": "For #1: The $deleteDocById is meant for deleting docs which are already in the index. The current row/doc is not committed to the index yet and therefore it is not affected by this flag. Hence the need to return both the flags for your use-case.\n\nBug #2: This fix will be available in v3.4 and v4.0. Unfortunately, we cannot give the right statistics but at least a commit will be called. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13065519",
            "date": "2011-07-14T20:40:43+0000",
            "content": "I've added a note to this effect in the wiki page. This is all we can do. Hence marking this issue as Won't fix. "
        }
    ]
}