{
    "id": "SOLR-3097",
    "title": "Introduce default Japanese stoptags and stopwords to Solr's example configuration",
    "details": {
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SOLR-3056 discusses introducing a default field type text_ja for Japanese in schema.xml.  This configuration will be improved by also introducing default stopwords and stoptags configuration for the field type.  \n\nI believe this configuration should be easily available and tunable to Solr users and I'm proposing that we introduce the same stopwords and stoptags provided in LUCENE-3745 to Solr example configuration.  I'm proposing that files can live in solr/example/solr/conf as stopwords_ja.txt and stoptags_ja.txt alongside stopwords_en.txt for English.  (Longer term, I think should reconsider our overall approach to this across all languages, but that's perhaps a separate discussion.)",
    "attachments": {
        "SOLR-3097.patch": "https://issues.apache.org/jira/secure/attachment/12513293/SOLR-3097.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Christian Moen",
            "id": "comment-13200686",
            "date": "2012-02-05T07:54:38+0000",
            "content": "Patch for trunk and branch_3x attached. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13200749",
            "date": "2012-02-05T12:50:56+0000",
            "content": "\n(Longer term, I think should reconsider our overall approach to this across all languages, but that's perhaps a separate discussion.)\n\nIt is a larger issue... in general we should make it easier to keep the two synchronized, but off the top of my head an idea for a plan was:\n\n\tadd 'snowball format' support to solr stopfilter so it can read all the lucene stopwords directly\n\tadd an ant task to synchronize the solr example from lucene's resources.\n\t(of course) add fieldtypes that actually use all these files.\n\n\n\nOn the other hand, realistically these resources are pretty static (don't change once added). So for now I don't think its a huge\nrisk that we don't have an auto-sync process... but we need to tackle these problems to easily integrate european languages anyway.\n\nSo I dont think this should block this issue, lets get japanese up and going for now. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13200752",
            "date": "2012-02-05T12:58:20+0000",
            "content": "Thanks a lot, Robert. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13200763",
            "date": "2012-02-05T13:25:52+0000",
            "content": "ok this ant task was easy enough to write...\n\nhere's my first stab at it. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13201039",
            "date": "2012-02-06T05:17:18+0000",
            "content": "Thanks, Robert.\n\nIs your thinking to use the sync-analyzers target to automatically copy resources to the right place as part of package, example, etc. – or is this as convenience to easier make sure the files are in sync when we check them in separately?\n\nThe sync-analyzers works fine for the latter purpose, but needs hookups elsewhere in build.xml if we want to do this automatically.  Happy to follow up on the latter if this is what you'd like to see in the patch. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13201220",
            "date": "2012-02-06T11:06:03+0000",
            "content": "I think it should be a convenience? Because the files do rarely change...\n\nAnd I fear any automated method would end out just overwriting peoples work\nif they try to tweak these files. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13202438",
            "date": "2012-02-07T14:48:50+0000",
            "content": "Robert, I agree.\n\nWould a patch that contains your build.xml changes and the synched stopwords_ja.txt and stoptags_ja.txt files be a suitable next step?  Please advise.  Many thanks. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13202448",
            "date": "2012-02-07T14:59:35+0000",
            "content": "I think we are ready to move forward here actually.\n\nThe only modification I want to do is to put this stuff in the conf/lang/ directory,\ninstead of conf/ directly.\n\nI created SOLR-3105 which uses the same scheme across other languages and it seems\nmuch more organized this way. "
        }
    ]
}