{
    "id": "SOLR-2350",
    "title": "improve post.jar to handle non UTF-8 files",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "thanks to all the awesomeness Uwe did in SOLR-96, some hard coded limitations/assumptions in the simple post.jar provided for the example files can be cleaned up.\n\nnotably: it use to deal with Readers/Writers, and warned people there data had to be UTF-8 (because that's all Solr supported) and now it can deal with raw streams",
    "attachments": {
        "SOLR-2350.patch": "https://issues.apache.org/jira/secure/attachment/12470310/SOLR-2350.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12990829",
            "date": "2011-02-04T23:34:15+0000",
            "content": "Attached file makes a bunch of changes to SimplePostTool.java, notably:\n\n\n\tstop using Reader/Writer - stream bytes directly\n\tuse application/xml as default mime-type, but let user override\n\tlook at HTTP status to determine if there is an error (instead of string comparisons on the response)\n\tignore the response body from the POST by default, but let the user choose to see it\n\n\n\n...the last two making it more feasible to use this when dealing with things like that Document Analysis tool (since you can now see the response if you want)\n\nThe patch also includes a gb2312-example.xml similar to the utf8-example.xml showing off non-ascii characters.  the big hitch here is that i'm only guessing that this really a properly encoded gb2312 – i did the best i could to make my editor create one, but i have no idea if it worked properly.  it seems to index correctly, but for all i know it's really still just UTF-8 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12990845",
            "date": "2011-02-05T00:16:07+0000",
            "content": "Some updates...\n\n\n\timprovements to the example file based on rmuir's suggestions in IRC\n\tsimplified some error handling so it's consistent\n\tincorporated Li Li's suggestion from a recent mailing list post about using the file length when posting files.\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12991629",
            "date": "2011-02-07T21:45:17+0000",
            "content": "Committed revision 1068149. - trunk\nCommitted revision 1068152. - 3x "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013112",
            "date": "2011-03-30T15:45:34+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}