{
    "id": "SOLR-9732",
    "title": "Field dropdown in Schema Browser screen can overlap field name in smaller browser windows",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.3",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "If I make my browser window smaller than say 1200px wide, the field selection dropdown on the Schema Browser stays the same width while the content moves, making it so the dropdown will overlap the field name.\n\nProbably easiest to see in the attached screenshot.\n\nThis happens in both Chrome and Safari (I didn't check FF), but is seen at a larger screen width in Chrome.",
    "attachments": {
        "FieldDropdown.png": "https://issues.apache.org/jira/secure/attachment/12837283/FieldDropdown.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-11-21T11:52:11+0000",
            "author": "Alexandre Rafalovitch",
            "content": "If you reload the page after you resize the browser window, does the problem still exists. In my experiment, it seems to resize to be maximum of the available space at the time the page loads. I think the issue is the magic dropdown which calculates the inner element as absolute size on load. ",
            "id": "comment-15683387"
        },
        {
            "date": "2016-11-21T16:39:25+0000",
            "author": "Cassandra Targett",
            "content": "Yes, if I reload the page it refreshes the size of the dropdown, so any browsers starting at a smaller size would be properly sized, I believe. That makes this even lower priority IMO. ",
            "id": "comment-15684045"
        },
        {
            "date": "2016-11-22T12:30:38+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Upayavira I cannot figure out when/how/why angular converts CSS width into absolute pixel width for the select element. Perhaps you have a hint for that, as this might be affecting other elements/situations. ",
            "id": "comment-15686625"
        },
        {
            "date": "2016-11-22T12:44:54+0000",
            "author": "Upayavira",
            "content": "A 'select' element uses the 'chosen' library. This library replaces the HTML select element with some HTML that constructs a prettier, and more functional, drop down. Thus, if you apply your sizing to the HTML select element, you are effectively sizing an invisible (hidden) element, which ain't gonna help. You will want to look for other uses of select with a 'chosen' attribute and see where the width has been applied. I can't remember where I have done it, but I know I have succeeded at setting widths on Chosen select elements before. ",
            "id": "comment-15686656"
        }
    ]
}