{
    "id": "SOLR-7748",
    "title": "Fix bin/solr to work on IBM J9",
    "details": {
        "components": [
            "Server"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.3",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "bin/solr doesn't work on IBM J9 because it sets -Xloggc flag, while J9 supports -Xverbosegclog. This prevents using bin/solr to start it on J9.",
    "attachments": {
        "SOLR-7748.patch": "https://issues.apache.org/jira/secure/attachment/12743711/SOLR-7748.patch",
        "solr-7748.patch": "https://issues.apache.org/jira/secure/attachment/12743312/solr-7748.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-02T13:06:22+0000",
            "author": "Shai Erera",
            "content": "Patch fixes bin/solr.cmd since I tested it on Windows. If there are no objections to the change, I will change bin/solr too. ",
            "id": "comment-14611925"
        },
        {
            "date": "2015-07-02T14:54:18+0000",
            "author": "Shawn Heisey",
            "content": "There are severe bugs that happen in Lucene when using IBM's Java.  I seem to recall seeing something indicating that IBM is starting to take them seriously, but that might have been wishful thinking.\n\nIt will be quite a while after IBM fixes the problem (if they ever do) before there is widespread penetration of fixed Java versions, so until that happens, the fact that bin/solr doesn't work right might actually be a good thing.\n\nAs I understand it, the J9 problems occur because IBM is extremely aggressive at turning on optimizations in the JVM.  The performance of IBM's Java is legendary as a result of this, but it also causes a lot of problems.\n\nI know that in at least one case of a bug with J9, there is an optimization that can be turned off to fix the problem ... there may be other bugs fixed by turning off certain optimizations.\n\nAs an initial step, I was thinking about having the startup script detect J9 versions and abort with a message indicating serious JVM bugs (perhaps linking to the JavaBugs page on the Lucene wiki).  We already have detection for Java 7u40 through 7u51, which enables the -XX:-UseSuperWord option for Java and prints a warning to the user about upgrading Java.\n\nAs we learn more, we could start with commandline options to work around the problems, and then if IBM ever actually fixes the problems, run normally with those detected versions.\n\nThe java version detection currently happens in the script, which I think may be a little fragile.  Perhaps a tiny little Java program could be written to detect a whole range of information about the JVM and return one or more known strings back to the script to tell the script what to do .  Those actions might include aborting because the java version is not new enough, issuing a warning because it's not 64-bit, turning on X and/or Y commandline options, etc.  We might even be able to set the max heap according to the available memory, but do so less aggressively than Java itself does.\n\nThis comment turned into quite a lot of text!  I started off just writing a quick note about J9 bugs. ",
            "id": "comment-14612038"
        },
        {
            "date": "2015-07-02T18:29:23+0000",
            "author": "Shai Erera",
            "content": "Thanks Shawn. I actually started to work with th j9 team over the past few weeks, on different aspects such as establishing a process for us to report bugs and have them rub Lucene/Solr tests on j9 builds in order to detect JVM issues. The team is also in contact with Uwe and Robert, and it seems like things get in the right direction.\n\nThe issues that are known to cause corruption are suspected to have been fixed, but since they were not reproducible with the latest j9 builds, we can't say it for sure. Therfore the warnings are still found in the JavaBugs page, but I assume that after we have Jenkins passing builds for a while, we will at least document that these issues were not reproduced with version X and onwards. \n\nAs for this particular issue I think that we should have bin/solr successfully start on j9. The problem that I've fixed is just passing the right gc log flag, which is different in j9.\n\nWith this patch, we have a way to also detect particular build versions and block them if we know they are bad. I don't think the blocking j9 entirely is a good solution though, and definitely the script currently doesn't explicitly block j9, it just fails with a wrong flag passed error.\n\nFrom a community perspective, I feel that blocking a JVM vendor entirely is wrong, but maybe I'm biased. At least I can confirm that the team gives a high priority to resolving any outstanding Lucene/Solr issues, so blocking j9 in our scripts (and code) feels wrong.  ",
            "id": "comment-14612332"
        },
        {
            "date": "2015-07-02T18:38:40+0000",
            "author": "Hoss Man",
            "content": "With this patch, we have a way to also detect particular build versions and block them if we know they are bad. I don't think the blocking j9 entirely is a good solution though, and definitely the script currently doesn't explicitly block j9, it just fails with a wrong flag passed error.\n\n+1\n\nwether the script should explicitly fail/warn \"IBM J9 is known to have problems running Solr\" on startup is a question that should be discussed/answered in it's own issue – it certainly makes sense to me to go ahead and fix the script to not fail in a weird and confusing way just because your're (edit) by the coincidence of  trying to use J9.\n\n(by corollary: we IndexWriter tests that give up if you try running on J9 because we know those tests are unreliably on J9, but that doesn't mean the IndexWriter class itself throws a RuntimeException if you try to instantiate it on a J9 JVM)\n ",
            "id": "comment-14612343"
        },
        {
            "date": "2015-07-02T20:05:50+0000",
            "author": "Shawn Heisey",
            "content": "wether the script should explicitly fail/warn \"IBM J9 is known to have problems running Solr\" on startup is a question that should be discussed/answered in it's own issue – it certainly makes sense to me to go ahead and fix the script to not fail in a weird and confusing way just by the coincidence of trying to use J9.\n\nThe issues that are known to cause corruption are suspected to have been fixed, but since they were not reproducible with the latest j9 builds, we can't say it for sure\n\nWith this patch, we have a way to also detect particular build versions and block them if we know they are bad.\n\nSince we think IBM has fixed the problems, allowing J9 makes sense, and we can handle further version detection and resulting actions on another issue. ",
            "id": "comment-14612439"
        },
        {
            "date": "2015-07-06T11:32:18+0000",
            "author": "Shai Erera",
            "content": "Patch fixes bin/solr too. ",
            "id": "comment-14614906"
        },
        {
            "date": "2015-07-06T13:26:36+0000",
            "author": "Shai Erera",
            "content": "Added CHANGES entry.\n\nI think it's ready, but will appreciate a second look at the fix of the scripts, since I'm no bash/batch expert . ",
            "id": "comment-14615017"
        },
        {
            "date": "2015-07-06T23:13:43+0000",
            "author": "Shawn Heisey",
            "content": "I'm going to assume that the way the vendor and version are detected are correct, since I don't have an IBM JVM to try.\n\nI did notice in the bash script that the non-IBM option construction included an echo command to include the existing GC_LOG_OPTS variable, but for J9, it sets the variable and doesn't include what's there previously.  Should that be modified to match?  The removed line (replaced with the if/else construct) uses parentheses to combine the old with the new, perhaps that method should be used in the two new statements.  I'm not an expert either. ",
            "id": "comment-14615851"
        },
        {
            "date": "2015-07-07T08:00:01+0000",
            "author": "Shai Erera",
            "content": "but for J9, it sets the variable and doesn't include what's there previousl\n\nIndeed, and as I put in the comment above that line, on the -Xverbosegclog is required/supported by J9, as far as I could tell from the J9 team. Also this page which they pointed me at does not indicate any additional parameters are needed: http://www-01.ibm.com/support/knowledgecenter/SSYKE2_8.0.0/com.ibm.java.win.80.doc/diag/appendixes/cmdline/xverbosegclog.html.\n\nThe removed line (replaced with the if/else construct) uses parentheses to combine the old with the new,\n\nYou're right. At first I thought that the parentheses don't work because when I echoed them using echo $GC_LOG_OPTS it only printed the -verbose:gc. I now tried echo \"${GC_LOG_OPTS[@]}\" and it works. I'll restore that. ",
            "id": "comment-14616349"
        },
        {
            "date": "2015-07-07T10:45:19+0000",
            "author": "Shai Erera",
            "content": "Patch addresses Shawn's comments. Shawn Heisey, I also verified that the other -XX flags are accepted by J9 (however might be ignored), so I now set all of them, and only modified the GC log filename flag. ",
            "id": "comment-14616502"
        },
        {
            "date": "2015-07-08T11:43:23+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1689847 from Shai Erera in branch 'dev/trunk'\n[ https://svn.apache.org/r1689847 ]\n\nSOLR-7748: Fix bin/solr to work on IBM J9 ",
            "id": "comment-14618462"
        },
        {
            "date": "2015-07-08T11:50:10+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1689849 from Shai Erera in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1689849 ]\n\nSOLR-7748: Fix bin/solr to work on IBM J9 ",
            "id": "comment-14618472"
        },
        {
            "date": "2015-07-08T11:51:28+0000",
            "author": "Shai Erera",
            "content": "Committed to trunk and 5x. Thanks Shawn Heisey for the review! ",
            "id": "comment-14618474"
        },
        {
            "date": "2015-07-22T17:36:54+0000",
            "author": "Timothy Potter",
            "content": "This code is causing the script to fail for me:\n\n\n:resolve_java_vendor\nset \"JAVA_VENDOR=Oracle\"\n%JAVA% -version 2>&1 | findstr /i \"IBM J9\" > javares\nset /p JAVA_VENDOR_OUT=<javares\ndel javares\nif NOT \"%JAVA_VENDOR_OUT%\" == \"\" (\n  set \"JAVA_VENDOR=IBM J9\"\n)\n\n\n\n%JAVA% needs to be wrapped in double-quotes:\n\n\n:resolve_java_vendor\nset \"JAVA_VENDOR=Oracle\"\n\"%JAVA%\" -version 2>&1 | findstr /i \"IBM J9\" > javares\nset /p JAVA_VENDOR_OUT=<javares\ndel javares\nif NOT \"%JAVA_VENDOR_OUT%\" == \"\" (\n  set \"JAVA_VENDOR=IBM J9\"\n)\n\n ",
            "id": "comment-14637252"
        },
        {
            "date": "2015-07-22T18:09:10+0000",
            "author": "Shai Erera",
            "content": "Thanks Timothy Potter, that seems correct. I will try to upload a patch today or tomorrow, but feel free to upload one if you get to it before me. ",
            "id": "comment-14637326"
        },
        {
            "date": "2015-07-22T18:17:09+0000",
            "author": "Shai Erera",
            "content": "I messed up the comments so I decided to take care of the fix now . I plan to commit shortly. ",
            "id": "comment-14637345"
        },
        {
            "date": "2015-07-22T18:45:23+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1692317 from Shai Erera in branch 'dev/trunk'\n[ https://svn.apache.org/r1692317 ]\n\nSOLR-7748: Fix script to work when %JAVA% has spaces ",
            "id": "comment-14637415"
        },
        {
            "date": "2015-07-22T18:48:23+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1692318 from Shai Erera in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1692318 ]\n\nSOLR-7748: Fix script to work when %JAVA% has spaces ",
            "id": "comment-14637420"
        },
        {
            "date": "2015-07-22T18:50:31+0000",
            "author": "Shai Erera",
            "content": "Thanks Timothy Potter! ",
            "id": "comment-14637425"
        },
        {
            "date": "2015-08-26T13:06:12+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Bulk close for 5.3.0 release ",
            "id": "comment-14713243"
        }
    ]
}