{
    "id": "SOLR-9789",
    "title": "ZkCLI throws NullPointerException if zkClient doesn't return data",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.5.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "We ran into a situation where using ZkCLI to get the Solr clusterstate in Zookeeper always returned a NPE. We eventually found that it was due to a clusterstate being too large (over 1M Zookeeper node limit) so the zkClient.getData call returned null, but it was confusing to instead throw an NPE because ZkCLI assumes non-null byte data. Could a check be added to not throw NPE, but report a warning instead?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-11-22T01:44:32+0000",
            "author": "Eric B",
            "content": "For reference, here's the stack trace we saw when running running -cmd get /clusterstate.json with ZkCLI\n\n\nException in thread \"main\" java.lang.NullPointerException\n        at java.lang.String.<init>(String.java:515)\n        at org.apache.solr.cloud.ZkCLI.main(ZkCLI.java:297)\n\n ",
            "id": "comment-15685369"
        },
        {
            "date": "2016-11-22T10:41:17+0000",
            "author": "Shawn Heisey",
            "content": "If the collections in SolrCloud on version 5.5.1 are created with that version, clusterstate.json will have a size of zero.  The only way clusterstate.json can get this large is on a cloud that was upgraded from 4.x.  If you set up a brand new collection, you will find that it is not in clusterstate.json – instead, there is a file named state.json in the collection's path within zookeeper.  This is the \"v2\" clusterstate that was new in Solr 5.0.\n\nA correct fix for your situation would be to create brand new collections so each collection has a separate clusterstate, and have your code retrieve the individual state files.\n\nFixing the NPE in Solr so it returns an understandable error is likely to require more than a simple null check.  As written, the code will have no idea why the byte array is null.  The code should check for the existence of the file being requested, and if the ZK client can retrieve the size of the znode, then the error message could be even more specific.  If I can find some free time, I can look into making this change.  Fair warning – the change is not likely to appear in version 5, but only in a new 6.x version.\n\nThis entire problem is caused by zookeeper allowing the creation of znodes larger than their \"jute.maxbuffer\" size limit, which zookeeper then refuses to read.  There is a bug on zookeeper for this, but so far it has not been addressed.  I am having trouble locating the issue. ",
            "id": "comment-15686350"
        }
    ]
}