{
    "id": "SOLR-8423",
    "title": "DELETESHARD should cleanup the instance and data directory, like DELETEREPLICA",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.0",
            "6.1",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "DELETESHARD only cleans up the index directory and not the instance/data directory. DELETEREPLICA on the other hand cleans up the data and instance directory.\n\nDELETESHARD should clean up the instance and data directory, so that we don't leak disk space on executing the command.\n\nIf we think this would break back-compat, though I don't see why this should not clean up the instance dir, we should at least provide an option to clean up everything and make it default in 6.0.",
    "attachments": {
        "SOLR-8423.patch": "https://issues.apache.org/jira/secure/attachment/12778210/SOLR-8423.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-16T17:02:22+0000",
            "author": "Erick Erickson",
            "content": "I don't think this breaks back-compat 'cause I don't see any promises in the docs  But I vaguely recall that this was to clean up stale cluster states without having to directly edit the ZK node, so maybe nobody thought about it?\n\nI might advocate an option to keep at least the data directory just on general principles here though. I'm thinking of the case where the user is explicitly controlling routing, say time-series data. Does it make sense to delete/create shards to hide/show some time-interval? I have to admit this is a theoretical use-case, haven't seen anyone actually ask for it so feel free to ignore... ",
            "id": "comment-15060299"
        },
        {
            "date": "2015-12-17T08:42:32+0000",
            "author": "Anshum Gupta",
            "content": "Patch without a test. I'll add a test for this and also need to find a better param for supporting deletion without cleaning up of the instance directory (like right now). In this patch, it's called safedelete. ",
            "id": "comment-15061728"
        },
        {
            "date": "2015-12-17T09:23:40+0000",
            "author": "Shai Erera",
            "content": "So with this patch, the default is that we delete the index + instance + data directory, but if the user wants, he can request a safedelete and the behavior goes back to what it is today? I'm fine with that. ",
            "id": "comment-15061776"
        },
        {
            "date": "2015-12-17T09:39:03+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Why not just use the existing deleteInstanceDir and deleteDataDir core admin params (and default them to true)? It is not obvious to me what 'safedelete' means. ",
            "id": "comment-15061798"
        },
        {
            "date": "2015-12-17T09:47:22+0000",
            "author": "Anshum Gupta",
            "content": "I just wanted to keep it easy for users and I think adding a single flag is an easier option.\nAlso, we want to set both those to true and I personally feel that deleteInstanceDir/deleteDataDir being set to true is a little less intuitive. ",
            "id": "comment-15061804"
        },
        {
            "date": "2015-12-17T09:54:44+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "This is easy for the users. No need to remember what a new vague sounding parameter does. deleteInstanceDir/deleteDataDir is as explicit as it gets. \n\nWhat the hell is a safedelete anyway?\n\n\tWe don't accidentally delete other's data?\n\tWe don't delete our data?\n\tWe ensure that data is actually deleted and cannot be recovered?\n\n\n\nIf you really want to keep things simple for users, do what deletereplica already does i.e. deletes instance dir, data dir, index automatically as we did in SOLR-6072. No switch necessary to control that. If you want to implement a way to control what gets deleted, implement it for both deleteshard and deletereplica and even better, just have deleteshard internally call deletereplica and avoid the code duplication. ",
            "id": "comment-15061813"
        },
        {
            "date": "2015-12-17T10:47:33+0000",
            "author": "Anshum Gupta",
            "content": "As I said, the name of the param was just something I put in there.\n\nneed to find a better param for supporting deletion without cleaning up of the instance directory (like right now). In this patch, it's called safedelete.\n\nAs far as reusing the current params is concerned, I'll go with your suggestion and put up another patch. I used CoreAdmin calls directly because I didn't want to stack up more tasks for the Overseer. It however makes sense to just refactor the coreadmin call code and reuse that.\n\nP.S: The meaning of 'safedelete' would have been clear through the ref guide/documentation. The difference between instance/data/index directory can get a little complicated for users though, specially as we're trying to move away from Core admin calls being exposed to end users (via http api). ",
            "id": "comment-15061880"
        },
        {
            "date": "2015-12-17T12:55:26+0000",
            "author": "Mark Miller",
            "content": "deleteInstanceDir and deleteDataDir \n\nProbably best to be consistent in naming these params - especially given the behavior is the same. At least on 5x. On 6x, would still be nice to be consistent, but we could change how it works if we had ideas to improve it. ",
            "id": "comment-15062003"
        },
        {
            "date": "2015-12-22T09:37:42+0000",
            "author": "Anshum Gupta",
            "content": "Patch that uses deleteDataDir, deleteInstanceDir and defaults them to true.\nIt now also supports setting those to false for DELETESHARD and DELETEREPLICA. ",
            "id": "comment-15067858"
        },
        {
            "date": "2015-12-22T12:10:24+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Thanks Anshum. Looks good to me. We need a test though. ",
            "id": "comment-15068033"
        },
        {
            "date": "2015-12-22T12:13:41+0000",
            "author": "Anshum Gupta",
            "content": "Right, working on that. Got stuck up with something else. ",
            "id": "comment-15068039"
        },
        {
            "date": "2016-03-02T18:59:36+0000",
            "author": "Anshum Gupta",
            "content": "Patch with tests. I'll commit this once the 6.0 work is in place. ",
            "id": "comment-15176259"
        },
        {
            "date": "2016-03-03T19:55:25+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 9c777ab5adfd07e49310a5fb091d8bac611ef0ba in lucene-solr's branch refs/heads/master from anshum\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9c777ab ]\n\nSOLR-8423: DeleteShard and DeleteReplica should cleanup instance and data directory by default and add support for optionally retaining the directories ",
            "id": "comment-15178507"
        },
        {
            "date": "2016-03-03T21:51:59+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 638b145376baea5281273bb90cedd8f69fecfa9f in lucene-solr's branch refs/heads/branch_6x from anshum\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=638b145 ]\n\nSOLR-8423: DeleteShard and DeleteReplica should cleanup instance and data directory by default and add support for optionally retaining the directories ",
            "id": "comment-15178679"
        },
        {
            "date": "2016-03-03T21:58:46+0000",
            "author": "ASF subversion and git services",
            "content": "Commit ca03639e6d5fbae924060fdb0b087189bb65a75d in lucene-solr's branch refs/heads/branch_6_0 from anshum\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ca03639 ]\n\nSOLR-8423: DeleteShard and DeleteReplica should cleanup instance and data directory by default and add support for optionally retaining the directories ",
            "id": "comment-15178687"
        },
        {
            "date": "2016-04-06T02:28:08+0000",
            "author": "Hoss Man",
            "content": "Anshum Gupta, Shalin Shekhar Mangar, Mark Miller - can one of you please review the ref guide edits i made for this issue...\n\n\n\thttps://cwiki.apache.org/confluence/pages/diffpagesbyversion.action?pageId=32604284&selectedPageVersions=156&selectedPageVersions=157\n\thttps://cwiki.apache.org/confluence/pages/diffpagesbyversion.action?pageId=61339928&selectedPageVersions=5&selectedPageVersions=6\n\n\n\n(It was a little confusing to me how to document this clearly since, AFAICT, all the params default to \"true\", regardless of what other params the user might set to \"false\", so setting deleteInstanceDir=false by itself doesn't seem to do anything very useful – the dataDir (and index) is still deleted because deleteDatadDir defaults to true.) ",
            "id": "comment-15227580"
        },
        {
            "date": "2016-04-06T02:29:55+0000",
            "author": "Anshum Gupta",
            "content": "I'll take a look. ",
            "id": "comment-15227586"
        },
        {
            "date": "2016-04-06T02:45:09+0000",
            "author": "Anshum Gupta",
            "content": "You are right about deleteInstanceDir not doing anything by itself as the data directory would still be deleted by default and deleteDataDir has a similar issue. This calls for a JIRA but in terms of documenting this, we might have to ask users to set both of them to false for 6.0. ",
            "id": "comment-15227602"
        },
        {
            "date": "2016-05-10T23:39:37+0000",
            "author": "Hoss Man",
            "content": "\nManually correcting fixVersion per Step #S6 of LUCENE-7271 ",
            "id": "comment-15279238"
        }
    ]
}