{
    "id": "SOLR-9629",
    "title": "Fix SolrJ warnings and use of deprecated methods in org.apache.solr.client.solrj.impl package",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "7.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Trivial"
    },
    "description": "There are some warnings (generic types and deprecation) that appear in the org.apache.solr.client.solrj.impl package which can be easily fixed. Other than some simple fixes, includes a fix to use a MultiPartEntityBuilder to create rather than using a deprecated constructor on MultiPartEntity.",
    "attachments": {
        "SOLR-9629.patch": "https://issues.apache.org/jira/secure/attachment/12832819/SOLR-9629.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-12T05:03:07+0000",
            "author": "Shawn Heisey",
            "content": "What's the rationale of changing the Long creation in BinaryRequestWriter to a cast to the primitive type?  Java will need to autobox the long to Long in order to return the value.\n\nI'm not saying the change is wrong, because I honestly do not know which way has better performance or fits better with Java norms ... I just would like to know why that change is there.  I don't see any warning on the code in eclipse, which typically has many more warnings than javac. ",
            "id": "comment-15567600"
        },
        {
            "date": "2016-10-12T05:52:35+0000",
            "author": "Michael Braun",
            "content": "Shawn Heisey the only difference comes if the value is potentially in the Long object cache - if the value is between -128 and 127. Using new Long() skips this check.  ",
            "id": "comment-15567707"
        },
        {
            "date": "2016-10-12T06:45:19+0000",
            "author": "Shawn Heisey",
            "content": "Tests pass with this patch applied, at least on my Windows machine.  I can't run precommit on Windows, so I will need to do it again on Linux and then check precommit there.  That's going to be tomorrow – right now it's after bedtime.  I see that you popped into the IRC channel earlier.  I idle there almost all the time, and check in on most days. ",
            "id": "comment-15567811"
        },
        {
            "date": "2016-10-12T07:02:27+0000",
            "author": "Shawn Heisey",
            "content": "Updated patch.  Added CHANGES.txt entry.\n\nI noticed a wildcard import in BinaryRequestWriter, so I opted to re-organize the imports and change the wildcard to specific imports. ",
            "id": "comment-15567851"
        },
        {
            "date": "2016-10-24T16:16:45+0000",
            "author": "Michael Braun",
            "content": "Thanks Shawn Heisey, sorry about the wildcard there. ",
            "id": "comment-15602457"
        },
        {
            "date": "2017-01-17T20:14:13+0000",
            "author": "Michael Braun",
            "content": "Shawn Heisey does more need to be done for this one?  ",
            "id": "comment-15826731"
        },
        {
            "date": "2017-09-17T20:41:48+0000",
            "author": "Michael Braun",
            "content": "Shawn Heisey This is an updated patch (minus the changes.txt) for current master. ",
            "id": "comment-16169408"
        },
        {
            "date": "2017-09-17T21:38:59+0000",
            "author": "Michael Braun",
            "content": "Whoops, forgot to remove unused imports, precommit now passes from the patch. ",
            "id": "comment-16169425"
        }
    ]
}