{
    "id": "SOLR-2553",
    "title": "Nested Field Collapsing",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SearchComponents - other"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Currently specifying grouping on multiple fields returns multiple datasets. \n\nIt would be nice if Solr supported cascading / nested grouping by applying the first group over the entire result set, the next over each group and so forth and so forth. \n\nEven if limited to supporting nesting grouping 2 levels deep would cover alot of use cases. \n\ngroup.field=location&group.field=type\n\n-Location X\n---Type 1\n-----documents\n---Type 2\n----documents\n-Location Y\n---Type 1\n----documents\n---Type 2\n----documents\n\ninstead of \n-Location X\n– documents\n-Location Y\n--documents\n\n-Type 1\n--documents\n-Type2\n--documents",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Martijn van Groningen",
            "id": "comment-13040478",
            "date": "2011-05-27T22:24:34+0000",
            "content": "This looks like an interesting feature. I only think the query string parameter need be different. Otherwise folks might confuse it with just grouping on two different fields.\n\nI propose something like this to achieve your first example:\ngroup.field=location&group.field.location=type\n\nThis syntax would support grouping in N groups deep. \nI also think that this feature would be costly for performance. Basically for each group level you need to execute search. The current grouping is in most cases already executing two searches. The single pass collectors do grouping in one search. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13040837",
            "date": "2011-05-29T17:45:50+0000",
            "content": "I think to represent this returned result we need to have GroupDocs extend TopDocs?  This way a GroupDocs, which currently uses TopDocs to hold each group's results, is free to recursively contain another GroupDocs. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13040838",
            "date": "2011-05-29T17:48:10+0000",
            "content": "The CachingCollector should reduce the search cost, since it can replay a 2nd time for the nested group collection.\n\nWe have to somehow open up the SecondPassGroupingCollector – today it forcefully creates collectors specific to sort by score or field. "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13041319",
            "date": "2011-05-30T22:47:46+0000",
            "content": "I think to represent this returned result we need to have GroupDocs extend TopDocs\nThat makes sense. TopGroups already contains an array of GroupDocs. If this is empty then that is the deepest field.\n\nSeems like to me that there is quite some work to be done in grouping module to support this. So I think a Lucene issue would be needed.\nThis issue should then be concerned with wiring it up into Solr. \n\nThe CachingCollector should reduce the search cost,\nOr for any other subsequent search "
        },
        {
            "author": "Martijn Laarman",
            "id": "comment-13057285",
            "date": "2011-06-29T14:55:35+0000",
            "content": "I created Lucene issue: https://issues.apache.org/jira/browse/LUCENE-3257 to go along this solr issue as suggested. "
        },
        {
            "author": "dungnguyen",
            "id": "comment-13088328",
            "date": "2011-08-21T08:04:38+0000",
            "content": "Anyone have solution for this issue? thnks "
        },
        {
            "author": "jefferyyuan",
            "id": "comment-13694058",
            "date": "2013-06-26T16:29:42+0000",
            "content": "We find this jira and https://issues.apache.org/jira/browse/SOLR-2526 - Grouping on multiple fields is very useful for us.\nAny plan to implement this?\nThanks... "
        },
        {
            "author": "Kranti Parisa",
            "id": "comment-13865012",
            "date": "2014-01-08T03:05:34+0000",
            "content": "I think we will also need to support other grouping params especially group.limit. so that user can restrict the results even with Nested Groups "
        }
    ]
}