{
    "id": "SOLR-1533",
    "title": "Partition data directories into multiple \"bucket\" directories",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "components": [
            "multicore"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Provide a way to partition data directories into multiple \"bucket\" directories. For example, instead of creating 10,000 data directories inside one base data directory, Solr can assign a core to one of 4 base directories, thereby distributing them.\n\nThe underlying problem is that with large number of indexes, we see slower and slower system performance as one goes on increasing the number of cores, thereby increasing the number of directories in the single data directory.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12771480",
            "date": "2009-10-29T17:05:44+0000",
            "content": "Trying to understand the need for this (I might have missed the discussion on the ML?).\nIsn't the creator of the core in control of the data dir ( http://wiki.apache.org/solr/CoreAdmin#CREATE ) and thus their distribution?\nOr is the goal of this to remove the logic and knowledge from the client and let Solr control where core's data is going to be placed, depending on the \"core data distribution policy\"? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12771552",
            "date": "2009-10-29T18:46:50+0000",
            "content": "Trying to understand the need for this (I might have missed the discussion on the ML?).\n\nNo, there was no discussion on the ML though this has been an item on the wiki for some time now.\n\n\nIsn't the creator of the core in control of the data dir ( http://wiki.apache.org/solr/CoreAdmin#CREATE ) and thus their distribution?\nOr is the goal of this to remove the logic and knowledge from the client and let Solr control where core's data is going to be placed, depending on the \"core data distribution policy\"?\n\nYes, the creator can specify the dataDir during core creation. The problem is that maintaining exact filesystem path information in addition to the actual host/port/core name mapping in an external system is a huge pain. Also, Solr has more information about the system e.g. how many directories in a given bucket. It is far easier to have Solr manage it. The strategy for distribution can be made pluggable if you want. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12771746",
            "date": "2009-10-30T02:55:55+0000",
            "content": "I guess , we can make that a pluggable CoreAdminHandler . So , users who need this feature can use that  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872644",
            "date": "2010-05-27T22:09:49+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043642",
            "date": "2011-06-03T16:46:16+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106284",
            "date": "2011-09-16T14:50:23+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234657",
            "date": "2012-03-21T18:08:45+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13485656",
            "date": "2012-10-28T15:53:31+0000",
            "content": "I'm thinking of killing this JIRA, SOLR-1306 (which is up real soon now on my list) seems like it would handle this case. Having a pluggable CoreDescriptorProvider should allow the resident code to provide whatever instanceDir one wants. Since it's resident on the server, it can do whatever is needed to insure that the actual core directories are distributed as desired.\n\nSo I'll kill this (or, more accurately, say it's a duplicate of 1306) unless I there's a reason 1306 won't handle this. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13554290",
            "date": "2013-01-15T20:29:57+0000",
            "content": "Erick, do you plan on following through on your threat to kill this issue? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13554302",
            "date": "2013-01-15T20:42:41+0000",
            "content": "This is very much in the works. It's related to SOLR-1028 & etc. I'm waiting on 4.1 to be cut so it can all bake in 4.2 for a while before being released into the wild. There are a bunch of other related JIRAS as well, SOLR-4196 and SOLR-4083 in particular.\n\nSo I'll be tracking this and probably kill it when I'm sure the directory-discovery bits work... "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13654200",
            "date": "2013-05-10T10:34:22+0000",
            "content": "Closed after release. "
        }
    ]
}