{
    "id": "SOLR-5307",
    "title": "Solr 4.5 collection api ignores collection.configName when used in cloud",
    "details": {
        "affect_versions": "4.5",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "This worked properly in 4.4, but on 4.5, specifying collection.configName when creating a collection doesn't work - it gets the default regardless of what has been uploaded into zk. Explicitly linking config name to collection ahead of time with zkcli.sh is a workaround I'm using for the moment, but that did not appear to be necessary with 4.4 unless I was doing something wrong and not realizing it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13788091",
            "date": "2013-10-07T11:46:54+0000",
            "content": "Hmmm, is this the same thing as SOLR-5306? This is the second report of something with collections.configName. I'll link the two together, it seems like they should both be investigated together.... "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13788102",
            "date": "2013-10-07T12:17:08+0000",
            "content": "Sure sounds similar, though in my case, the collection was created without error - it just got the default configuration (so didn't have our custom schema/config).  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13788107",
            "date": "2013-10-07T12:36:06+0000",
            "content": "Right, might you have had the default collection already on your system so you were able to find the configuration set for collection1 even though you didn't want to? Under any circumstances it smells like these two issues are related...\n\nThanks for the clarification... "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13788109",
            "date": "2013-10-07T12:37:35+0000",
            "content": "Isn't that the point of starting up the first node with the bootstrap zk config as it says in the documentation? "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13788110",
            "date": "2013-10-07T12:39:01+0000",
            "content": "In my case, I have a dynamic set of collections, so I started everything up with collection1 that is essentially unused, and only exists for the sake of bringing the cluster up and online. Based on that, if other issue didn't do that bootstrap, I can certainly see the issues being the same.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13790579",
            "date": "2013-10-09T16:26:01+0000",
            "content": "Ouch - this sounds like a pretty bad bug. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13790612",
            "date": "2013-10-09T16:58:22+0000",
            "content": "Ouch - this sounds like a pretty bad bug.\n\nYeah, SOLR-5317 too. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13791149",
            "date": "2013-10-10T03:30:47+0000",
            "content": "Thanks for the report Nathan - I've resolved this as a duplicate of SOLR-5306, since it's one number higher  "
        }
    ]
}