{
    "id": "SOLR-58",
    "title": "Change Admin components to return XML like the rest of the system",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I need to expose the admin functionality to an external application.  I think returning admin data as XML may be a good and simple first step towards that.\n\nTo do that I think I'll mostly need to modify JSPs (but I haven't had a good look at Admin GUI yet).  From what I saw a few weeks ago when I briefly looked at this, no Java code will need to be modified.  If you have concrete ideas about how this should be done, please comment before I start next week (week of October 23rd 2006).",
    "attachments": {
        "SOLR-58.patch": "https://issues.apache.org/jira/secure/attachment/12346966/SOLR-58.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Sami Siren",
            "id": "comment-12443996",
            "date": "2006-10-21T03:25:09+0000",
            "content": "Havent checked how admin GUI is constructed but if there is a cleanAPIi it might be easier to use something like hessian http://www.caucho.com/hessian/ instead of hacking the jsps to emit xml and writing a custom client. "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12444015",
            "date": "2006-10-21T06:20:50+0000",
            "content": "Once the admin components emit XML, The XSLT transformation code written for SOLR-49 could be used to recreate an HTML user interface easily. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12445734",
            "date": "2006-10-30T23:44:34+0000",
            "content": "I went to the original thread where I started discussion about exposing some admin functionality as XML,  http://www.mail-archive.com/solr-user@lucene.apache.org/msg01012.html and realized Yonik had pointed out that the 'stats'(.jsp) page already spits out XML and has the XSL that transforms it to HTML: http://www.mail-archive.com/solr-user@lucene.apache.org/msg01074.html\n\nThe same with 'registry.jsp' - it's really XML + XSL.\n\nIs there anything else that I could expose as XML?\n\n$ ls -1 src/webapp/resources/admin/*jsp\nsrc/webapp/resources/admin/action.jsp\nsrc/webapp/resources/admin/analysis.jsp\nsrc/webapp/resources/admin/distributiondump.jsp\nsrc/webapp/resources/admin/form.jsp\nsrc/webapp/resources/admin/get-file.jsp\nsrc/webapp/resources/admin/get-properties.jsp\nsrc/webapp/resources/admin/header.jsp\nsrc/webapp/resources/admin/index.jsp\nsrc/webapp/resources/admin/_info.jsp\nsrc/webapp/resources/admin/logging.jsp\nsrc/webapp/resources/admin/ping.jsp\nsrc/webapp/resources/admin/raw-schema.jsp\nsrc/webapp/resources/admin/registry.jsp\nsrc/webapp/resources/admin/stats.jsp\nsrc/webapp/resources/admin/threaddump.jsp\n\nHere is what I think could still be XMLized:\n\n\taction.jsp - action + success/failure status, but that seems to be used only from logging.jsp, so converting action.jsp to XML seems a bit useless.\n\tthreaddump.jsp - JVM version, deadlock printout, and then just one big XML element with the dump of all threads\n\tping.jsp - ?  I don't have any slaves running here, so I'm not even sure what that's supposed to look like\n\n\n\n\nEverything else in src/webapp/resources/admin/ is either an image or a helper JSP.\n\nThoughts? "
        },
        {
            "author": "Bill Au",
            "id": "comment-12445919",
            "date": "2006-10-31T15:23:58+0000",
            "content": "ping.jsp does not retrun any content.  It checks the solr server by sending the query  defined in SolrConfig.xml (pingQuery) and returns 200 if the query works without any exception.  Otherwise it returns 500.\n\naction.jsp is a secondary JSP that performs action from the main page (enable/disable) and the logging page (set log level).  So I agree that there is probably no need to XMLized it. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12448021",
            "date": "2006-11-08T04:08:00+0000",
            "content": "I took a stab at analysis page, and it turned out it lends itself to XMLization.  I'm attaching two files:\n1) analysis XML output\n2) analysis-xml.jsp - the JSP that replaces the output portion of analysis.jsp\n    (if this looks good, then I'll just change the FORM action in analysis.jsp to point to analysis-xml.jsp and somebody familiar with XSL could provide that piece)\n\nPlease comment.\n\nThese are my targets for XMLization, and I'm going to work on them next.\n\nANALYSIS (this attachment)\nSTATISTICS (already XMLized)\nINFO\nDISTRIBUTION\nPING\nLOGGING\nTHREAD DUMP "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12448026",
            "date": "2006-11-08T04:30:51+0000",
            "content": "Ping was simple, I just made it return <solr><status=\"200\"/></solr> if ping was OK (attached), and if there was an error, then:\n\n <solr>\n  <status=\"500\">exception trace here</status>\n</solr> \n\nThoughts?\n\nN.B.\nI'm not attaching diffs for JSPs, as I'm letting both the original and the XML versions live side by side locally for now, but if you'd prefer diffs, let me know.  "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12448032",
            "date": "2006-11-08T05:11:22+0000",
            "content": "Here is threaddump-xml.jsp and the example of its output. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12448034",
            "date": "2006-11-08T05:25:25+0000",
            "content": "Here is the XML version of logging.jsp, named logging-xml.jsp.\nIts output is trivial:\n\n<solr>\n      <logLevel>INFO</logLevel>\n</solr>\n\nI imagine the XSL would take this XML, convert it to HTML, and append the HTML with links to action.jsp with different logging levels. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12448568",
            "date": "2006-11-09T19:47:08+0000",
            "content": "A few comments/questions in no particular order...\n\n0) in general, i've found it's difficult to know how hard some XML will be to style, untill you've tried styling it \n\n1) the assumption is that these will include xsl-stylesheet headers list stats/registry do right now and let teh browser apply them right?\n\n2) Within the outermost <solr> tag, it would probably be good to have another wrapper tag specific to each of the pages .. it might make reusing a single (or a small number of) XSL file(s) for multiple pages easier.\n\n3) I think for analysis.jsp you're going to want a <form> block containing info about the options used and a <results> block containing what you've got right now ... otherwise it's going to be hard for an XSLT to recreate the form with the current state filled in (as i recall: there are ways of getting the URI of the current document in XSLT, and parsing out it's query params, but they have issues ... and they don't work if someone attempts to save the file locally to review later)\n\n4) it would probably make more sense to group the <token>s as children of the <factorry>s when verbose is turned on ... acctaully it would probably make sense to group them under the <factory> even if verbose isn't on....\n\n5) as long as we are outputing structured XML, we should render the factory.getArgs() as individual key/val pairs instead of just a string, maybe something like...\n\n<factory class=\"org.apache.solr.analysis.WordDelimiterFilterFactory\">\n   <args>\n      <arg name=\"catenateWords\">1</arg>\n      <arg name=\"catenateNumbers\">1</arg>\n   </args>\n  <tokens>\n     <token type=\"word\" pos=\"1\" start=\"0\" end=\"6\">Search</token>\n     <token type=\"word\" pos=\"2\" start=\"7\" end=\"12\">Stuff</token>\n     <token type=\"word\" pos=\"2\" start=\"0\" end=\"12\">SearchStuff</token\n  </tokens>\n</factory>\n\n...or if verbose is off...\n\n<factory>\n  <tokens>\n     <token type=\"word\" pos=\"1\" start=\"0\" end=\"6\">Search</token>\n     <token type=\"word\" pos=\"2\" start=\"7\" end=\"12\">Stuff</token>\n     <token type=\"word\" pos=\"2\" start=\"0\" end=\"12\">SearchStuff</token\n  </tokens>\n</factory>\n\n6) converting action.jsp to XML might actually make sense if you want to programatically hit it to change the logging level and test that the operation succeeded (right now you'd have to parse the HTML)\n\n7) ping's utilitiy for monitoring systems like nagios and load balancers is that it's trivial to check if the port is functioning just by checking the HTTP status code (where the definition of functioning is defined by a query in the solrconfig) ... it must have a genuine HTTP status code != 200 if there is a failure, returning an HTTP status code of 200 with a response body that says <status=\"500\">...</status> just makes everything more complicated.\n\n...either it shouldn't be converted, or it should manually set the reponse status to 500 before outputing the XML representation of the exception  (incidently: it will need to be XML escaped too)\n "
        },
        {
            "author": "Greg Ludington",
            "id": "comment-12448653",
            "date": "2006-11-10T04:17:40+0000",
            "content": "This may be slightly OT for this issue, but since the ticket discusses XSLT in the browser, and the Self Service wiki page, I though to put up for comments a quick and dirty XSLT-based schema browser I made.  It transforms schema.xml into a single page tree view, so you can inspect fields and types, with some cross referencing between fieldtypes and fields, and field copyField source/dests.  I have only tried it against Firefox 2 and IE7, but it should work in all browsers with an XSLT engine, or, failing that, it could be done server-side, and the resulting HTML sent to the browser.\n\nUnzipping and opening schema.xml in a browser is enough to see it, but it will be missing some styles and images referenced in the admin webapp.  To use it in a solr webapp against your own schema, you have to:\n\na) place schema.xml and the gifs in the /admin/ directory\nb) add the xsl directive to your schema.xml\n<?xml-stylesheet type=\"text/xsl\" href=\"schema.xsl\"?>\n\nc) modify get-file.jsp to set a content type of text/xml, and not to emit any whitespace\n\nI have only tried it with my prototype small-scale schemas, but, if it works for people with larger schemas, and fits in with the \"Self Service\" aims, I could take suggestions, clean up the xsl, and submit the a-b-c changes above as a patch. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12448692",
            "date": "2006-11-10T09:45:18+0000",
            "content": "The XML is being written (in the few attachments I sampled) as out.println() style.  This has several drawbacks:  1) what about XML escaping/encoding issues?  2) What about clients that want JSON, Ruby, or some other format from a response writer?   I strongly feel that the admin capability should work just like the front-end search capability, using a response writer for its output, not out.println's, making this much more flexible in the future.  Refactoring so there is no difference between the front and \"admin\" sides would really make Solr shine!   "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12451247",
            "date": "2006-11-20T08:01:26+0000",
            "content": "Hoss, thanks for the comments.\n\n0) I have yet to find out - I haven't started writing that yet.\n1) Right, XSL in header and let the browser apply them.\n2) Not sure how that will help, but I'll add a new element in modified pages.\n3) Will do: <form> + <result>\n4) & 5) I agree\n6) & 7) Ok, I'll think about that tomorrow.\n\nErik:\nWill using o.a.s.util.XML.escapeCharData do?\nI'll stick to XML output for now, because that's the current itch, plus any client can easily deal with it, but I agree that down the road it might be nice to support different formats. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12453693",
            "date": "2006-11-27T20:24:54+0000",
            "content": "Hoss, regarding your point 7) about ping - makes sense.  I think this is what Walter Underwood was talking about in a recent thread, too.  So what should the ping response look like in case of success and in case of error?\n\nIs this ok?\n\n<solr>\n  <ping>\n    <status>200|500</status>\n    <error> .... include this element only in case of error... </error>\n  </ping>\n</solr> "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12453694",
            "date": "2006-11-27T20:26:37+0000",
            "content": "Sorry, forgot to add that, in addition to the above 200/500/error stuff, I'd change the HTTP response to 500 in case of error, and stick to 200 in case of success. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12453723",
            "date": "2006-11-27T22:19:12+0000",
            "content": "Here are the new outputs for:\nAnalysis\nThread dump\nPing\n\nAll other outputs remain the same as before.\n\nDoes this look ok? "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12453724",
            "date": "2006-11-27T22:21:42+0000",
            "content": "And here are the 3 JSPs that created those outputs.\nThey now do XML character escaping.\n\nIf this (and other attachments from a few weeks back) looks good, I'll move onto XSLT. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12453730",
            "date": "2006-11-27T22:37:44+0000",
            "content": "Greg: schemaxsl stuff looks fancy, but it doesn't really belong to this issue.  I suggest you take it out and put it into a new JIRA issue, where it will get more visibility and attention than it's getting here. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12454176",
            "date": "2006-11-28T23:32:28+0000",
            "content": "Updated ping-xml.jsp + ping.xsl\nI took the simplest XML output to transform to XSL, as I've never touched XSL before.  Please comment if anything there doesn't look right or could be done better.\n\nI removed that <status> element from ping XML output, and tested this in the JSP:\n\n      out.println(\"<error>\");\n      XML.escapeCharData(SolrException.toStr(resp.getException()), out);\n      out.println(\"</error>\");\n      response.sendError(500);\n\nUnfortunately, this results ina generic 500 Error from Jetty, without this XML in the output.  Does anyone know how to get around this? "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12455791",
            "date": "2006-12-05T22:55:46+0000",
            "content": "logging.xsl + slightly modified ping.xsl "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12455903",
            "date": "2006-12-06T07:43:01+0000",
            "content": "analysis-xml.jsp - the converted analysis.jsp that output XML\nanalysis-xml-out.txt - the XML output by the new version\nanalysis.xsl - XSLT to transform the XML back to HTML "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12455904",
            "date": "2006-12-06T07:44:59+0000",
            "content": "threaddump-xml.jsp - the converted threaddump.jsp that outputs XML\nthreaddump-xml-out.txt - sample XML output of the new version\nthreaddump.xsl - XSLT to transform the XML back to HTML "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12456627",
            "date": "2006-12-07T23:01:16+0000",
            "content": "Here is the patch with modified JSPs + XSLs.\n\nI know there are a few small things missing:\n\n\tI lost the solr/schema part that goes in the parentheses in page headings.\n\tI lost the cwd, hostname, and the little stuff that I think _info.jsp gathers.\n\tmaybe something else...\n\n\n\nThe above omissions can easily be re-added, but let's see the review of the existing changes first. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12456633",
            "date": "2006-12-07T23:08:33+0000",
            "content": "Yeah, some of those little things are really helpful when debugging.\nFor instance, hostname can be important when going through a load-balancer to know exactly what host you are hitting. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12456638",
            "date": "2006-12-07T23:37:58+0000",
            "content": "Yeah, I'll make sure to put those back, but that's the easy part, whereas this XSL was new for me, so I want to make sure everything else looks okay first. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12457591",
            "date": "2006-12-12T06:05:11+0000",
            "content": "The new version with hostname:port, cwd, solrHome, and the collection name restored.\nI'll commit tomorrow, when I'm less zombied out. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12457915",
            "date": "2006-12-12T22:25:54+0000",
            "content": "Committed.  Please reopen if there are issues or additional fixes are needed. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12458315",
            "date": "2006-12-14T00:20:57+0000",
            "content": "\nanalysis.jsp currently isn't working properly ... it doesn't display the form by default, and if you manually create a URl that should work, you get a malformed XML response back. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12458631",
            "date": "2006-12-14T22:40:06+0000",
            "content": "If this isn't an easy/quick fix, perhaps we could roll back just analysis.jsp so we can continue with release 1.1? "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12482634",
            "date": "2007-03-21T02:30:13+0000",
            "content": "I'll resolve this as Fixed, even though it should be resolved as \"No longer relevant\", since I believe Ryan has changed or will change all admin stuff to work with handlers/writers....or at least that's what I recall reading. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589345",
            "date": "2008-04-15T23:56:43+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}