{
    "id": "SOLR-260",
    "title": "reusable PluginLoader -- helper class to load plugins",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As we talk about adding more configuration (Handlers, Highlighting, Components, etc) we should standardize the format and share the loading and initialization code.\n\nThis patch extracts the common stuff from SOLR-225 and makes it work with the RequestHandler framework.\n\nThis is an abstract base class – each implementation needs to take care of actually creating and initializing the instances:\n\nabstract class PluginLoader<T>\n{\n  abstract public T create( String className, NamedList args, Map<String,String> params );\n\n  abstract public void init( T plugin, NamedList args, Map<String,String> params );\n\n  public Map<String,T> load( NodeList nodes )\n  {\n    ...\n  }\n}",
    "attachments": {
        "SOLR-260-PluginLoader.patch": "https://issues.apache.org/jira/secure/attachment/12359457/SOLR-260-PluginLoader.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12503673",
            "date": "2007-06-11T23:22:19+0000",
            "content": "Ryan: FYI but there is currently no patch attached to this issue.\n\n\nlooking ta the way PluginLoader is used in the latest SOLR-225 patch, i wonder if some of this stuff could be simplified more by adding two new super interfaces to many of the things that can currently be specified as plugins (you alluded to this in an old comment in SOLR-225 that i remember seeing when skimming my email a while back, but never really got a chance to comment on).\n\nAssuming we have two interfaces like this...\n\n  public interface MapInitializedPlugin \n{\n    init( Map<String,String> args);\n  }\n  public interface NamedListInitializedPlugin \n{\n    init( NamedList args );\n  }\n\n...then the PluginLoader concept can be much simpler can't it?  something like...\n\n  public abstract class AbstractPluginLoader<T> {\n    protected T createInstance(String pluginClassName) \n{\n      Class clazz = Config.findClass( pluginClassName, DEFAULT_PACAKGES);\n      return (T) clazz.newInstance(); // :TODO: do some error check that clazz extends T\n  }\n  public class MapPluginLoader<T extends MapInitializedPlugin> extends AbstractPluginLoader<T> {\n    protected T createInstance(String pluginClassName, Map<String,String> args) \n{ createInstance( pluginClassName); }\n    public T getInstance(String pluginClassName, Map<String,String> args) {\n      T plugin = createInstance(pluginClassName);\n      plugin.init(args);\n      return plugin;\n    }\n  }\n  public class NamedListPluginLoader<T extends NamedListInitializedPlugin> extends AbstractPluginLoader<T> {\n    protected T createInstance(String pluginClassName, NamedList args) { createInstance( pluginClassName); }\n    public T getInstance(String pluginClassName, NamedList args) \n{\n      T plugin = createInstance(pluginClassName);\n      plugin.init(args);\n      return plugin;\n    }\n  }\n\n...similar batch processing methods to the ones you already have (for dealing with DOM Nodes) can also be added, but the key is that you can say things like...\n\n   SolrRequestHandler r = (new NamedLIstPluginLoader<SolrRequestHandler>()).getInstance(concreteImplName);\n\n...instead of each usage needing to provide an impl for the PluginLoader.init method (and the methods don't all have the double usage of NamedList and Map<String,String> args that might confuse people since one of them is always ignored).\n\nNOTE: I'm not sure why you have your PluginLoader.create method abstract ... it seems like the common case is common enough that we can provide a default impl.\n\n\n\n\n\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12503678",
            "date": "2007-06-11T23:31:56+0000",
            "content": "a few more thoughts...\n1) instead of DEFAULT_PACAKGES that should really be \"String[] getDefaultPackages()\" method that could be overridden in subclasses (anonymous or otherwise)\n2) there's really no reason for the createInstance methods i put in NamedListPluginLoader and MapPluginLoader ... if a special case comes along where a special type of plugin requires a special type of instantiation, people can take care of it by overriding getInstance. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12503679",
            "date": "2007-06-11T23:35:37+0000",
            "content": "> \n> Ryan: FYI but there is currently no patch attached to this issue.\n> \n\ni'm trying to mush RequestHandlers and FieldTypes into it now   I'll post something soon – integrating a few of your thoughts. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12503704",
            "date": "2007-06-12T01:59:07+0000",
            "content": "This patch uses a single plugin loader for:\n\n\tRequestHandlers\n\tFieldTypes\n\tQueryResponseWriter\n\t(SOLR-225 highlighting)\n\n\n\nIt could be used for field and dynamicField, but I'll hold off on that...\n\nRequestHandlers and FieldTypes have enough custom stuff going on (lazy loading, Analyzers) that they can't use the general class NamedListPluginLoader<T>\n\nQueryResponseWriters are initalized with:\n\n  NamedListPluginLoader<QueryResponseWriter> loader = \n      new NamedListPluginLoader<QueryResponseWriter>( \"[solrconfig.xml] \"+xpath, responseWriters );\n  defaultResponseWriter = loader.load( nodes );\n\n\n\t- -\n\n\n\nThis configuration adds the ability to specify the default RequestHandlers/QueryResponseWriter using default=\"true\" on exactly one entry.  This was required for SOLR-225 highlighting config, but I think it is generally useful.\n\n\n\t- -\n\n\n\nI added package o.a.solr.util.plugin with 5 classes.  Any better suggestions where this ought to live? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12505022",
            "date": "2007-06-15T03:47:38+0000",
            "content": "No real changes... applies with trunk "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12505297",
            "date": "2007-06-15T16:29:27+0000",
            "content": "The most recent patch in SOLR-225 includes this change.  If you want to evaluate the plugin architecture, check there – the patch on this issue will be slightly out date... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12509766",
            "date": "2007-07-03T07:19:30+0000",
            "content": "Ryan ... sorry i slacked off on reviewing the last few patches in this issue.  i just took a look at commit #552680 and it looks sweet.  I'm still not crazy about the \"init(T plugin, Map<String, String> params, Node node)\" method sig, but since we have to get the class/name params anyway, i guess it doesn't do any harm to pass the Map in along with the Node ... we just need to beef up the javadocs so it's clear where the Map comes from\n\nJust to clarify, if i'm understanding the default=\"true\" code, it means that RequestHandler resolution will go as follows...\n 1) look for a RequestHandler with a name matching the request\n 2) look for a RequestHandler configured with default=\"true\"\n 3) look for a RequestHandler configured with name=\"standard\"\n 4) use an anonymous instance of StandardRequestHandler\n\n...that looks good to me, but we should definitely document it.\n\nMinor Question: isn't the init method in the AbstractPluginLoader<SolrRequestHandler> redundant? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12509793",
            "date": "2007-07-03T08:40:35+0000",
            "content": "\n> I'm still not crazy about the \"init(T plugin, Map<String, String> params, Node node)\"\n\nI don't like it either.  In 552709 I changed it to:\n init(T plugin, Node node)\nThe few places that actually use the map can generate it using DOMUtils.\n\n\n> Just to clarify, if i'm understanding the default=\"true\" code, it means that RequestHandler resolution will go as follows...\n>  1) look for a RequestHandler with a name matching the request\n>  2) look for a RequestHandler configured with default=\"true\"\n>  3) look for a RequestHandler configured with name=\"standard\"\n>  4) use an anonymous instance of StandardRequestHandler\n> \n\nexactly.  likewise, the QueryResponseWriter follows the same pattern.\n\n> ...that looks good to me, but we should definitely document it.\n> \n\nWhere do you think is the best place?  the example solrconfig.xml?\n\n\n> Minor Question: isn't the init method in the AbstractPluginLoader<SolrRequestHandler> redundant?\n> \n\nI don't think so (but I am often wrong).  If the RequestHandler plugin loader extended NamedListPluginLoader, then it would be.  The RequestHandler funny business with lazy loading makes it better to directly subclass AbstractPluginLoader "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12509916",
            "date": "2007-07-03T15:50:28+0000",
            "content": "> Where do you think is the best place? the example solrconfig.xml?\n\nwell, at a minimum we should change it to use default=\"true\" and document what that means, removing the comment about \"standard\" from there would probably make sense since new users aren't going to care about the magic of hte name \"standard\" with the default=true syntax .. but we should still document on the wiki somewhere what the full handler/writer resolution chain is.\n\n> The RequestHandler funny business with lazy loading makes it better to directly subclass AbstractPluginLoader \n\n...ah, yeah i missed that ... but i don't see any reason why it can't still subclass NamedListPluginLoader just for the init method (even if it is does need custom create/register methods. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12537825",
            "date": "2007-10-26T04:14:08+0000",
            "content": "Ryan: do you consider this issue fixed, or did you want to leave it open to track converting more plugins to using PluginLoader?  (if so we should probably list the classes in the issue description, if not we should open seperate bugs to track the individual types of plugins) "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12537836",
            "date": "2007-10-26T05:29:06+0000",
            "content": "should have been resolved a while ago. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12579141",
            "date": "2008-03-16T03:23:52+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked \"Resolved\" and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.3 as of today 2008-03-15\n\n\n\nThe Fix Version for all 29 issues found was set to 1.3, email notification was suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this (hopefully) unique string: batch20070315hossman1\n "
        }
    ]
}