{
    "id": "SOLR-3516",
    "title": "Should provide mechanism for clients to see if currentSearcher is \"newest\" available",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "With the introduction of the \"openSearcher=(true|false)\" option on commit & autocommit, there doesn't seem to be any way for external clients to know if the current searcher is the newest possible searcher available - ie: will \"commit=true&openSearcher=true\" (w/o any other changes) affect the results of queries?\n\nWe should probably add some way of determining this programmaticly (and via the Admin UI) as a stat to either the SolrCore or the individual \"searchers\".  Alternatively it might be enough to just report some piece of metadata about the commit point in the searcher and in the updateHandler that could be compared.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13290720",
            "date": "2012-06-07T02:21:11+0000",
            "content": "This is something i noticed while auditing the tutorial for 4.0.\n\nIn past tutorials, we've explained how doing a delete with commit=false affects the index,but not hte search results until an epxlicit commit happens, and we've directed the user to look at the updateHandler stats to see how \"deletesbyId\" changes before and after the commit.\n\nnow that we have autoCommit=true w/ openSearcher=false in the example solrconfig.xml, this doesn't make any sense anymore – the updateHandler's deletesbyId stat goes back to zero as soon as the autocommit happens.\n\nI've updated the tutorial (see SOLR-3288) but realized there is nothing a user can look at in the Admin UI to know whether there are committed changes to the index not yet visible by the current searcher.  "
        }
    ]
}