{
    "id": "SOLR-3430",
    "title": "DIH: More-realistic testing & subsequent bug fix",
    "details": {
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.6.1",
            "4.0-ALPHA"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A couple of people have mentioned on the users' list that 3.6 changes break CachedSqlEntityProcessor.  Part of the problem is the current DIH tests are not realistic:  they mostly test 1 class at a time and not the full end-to-end interactions between components.\n\nThis is a test of (Cached) SqlEntityProcessor using an in-memory Derby database.  This hopefully is a first step in creating a series of new, more-rigorous DIH tests, which is needed in order to make changes without worry.\n\nThis also revealed a bug in SortedMapBackedCache, which is fixed also.  I'm not sure this is the same bug causing problems for the 2 users but once committed I will post a reply on the users' list to see if they can try it.",
    "attachments": {
        "derby-10.8.2.2.jar": "https://issues.apache.org/jira/secure/attachment/12525324/derby-10.8.2.2.jar",
        "derby-LICENSE-ASL.txt": "https://issues.apache.org/jira/secure/attachment/12525326/derby-LICENSE-ASL.txt",
        "SOLR-3430_build.patch": "https://issues.apache.org/jira/secure/attachment/12525901/SOLR-3430_build.patch",
        "SOLR-3430.patch": "https://issues.apache.org/jira/secure/attachment/12525322/SOLR-3430.patch",
        "derby-10.8.2.2.jar.sha1": "https://issues.apache.org/jira/secure/attachment/12525325/derby-10.8.2.2.jar.sha1",
        "derby-NOTICE.txt": "https://issues.apache.org/jira/secure/attachment/12525323/derby-NOTICE.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "James Dyer",
            "id": "comment-13267748",
            "date": "2012-05-03T19:56:20+0000",
            "content": "Here's a version that uses hsqldb instead of derby and modify's \"solr/common-build.xml\" to include this in the testing classpath.\n\nI would like to commit this one in a few days, and backport to the 3.6.1 as it includes a bugfix for dih caching. "
        },
        {
            "author": "Mikhail Khludnev",
            "id": "comment-13268162",
            "date": "2012-05-04T06:13:07+0000",
            "content": "James,\n\nI agree that DB is better than Mock. I'd like to confirm that this approach covers query repetitions issues too. In SOLR-3360 we had a bug when the same query runs many times. Blind automated tests with in-memory DB won't cover such bugs - it will just run same sql 10 times w/o any problems. Will we have a kind of utility wrapper prevents same query run again and again?\n\nRegards      "
        },
        {
            "author": "James Dyer",
            "id": "comment-13268434",
            "date": "2012-05-04T15:16:15+0000",
            "content": "Mikhail,\n\nSo far this is a new test and I'm not removing any old tests (yet).  Eventually I'd like to replace all of the (cached)SqlEntityProcessor tests with one like this.  The point here is to make the tests more realistic, make the tests easier to read and understand and to eliminate the need to pollute the class api for the sake of the tests (just scan the code for comments like \"this constructor is for tests only\" and for null-checks that are only needed to make tests run, etc).\n\nI think the bug found in SOLR-3360 had to do with the multi-threaded feature that only exists in 3.x and was removed from Trunk.  Whenever we get to a point where we can reintroduce multi-threading to DIH we'll need to be sure all the various scenarios get tested.\n\nIn the end if our tests mimic closely what an actual user is doing, that is, run DIH against realistic datasources using actual DIH configurations, etc, I think we'll have more realistic testing and we can catch the real bugs that are actually affecting the usability of the product.  You had a good point in the past about some unrealistic features in MockDataSource.  Personally I never liked using that class to write tests because I found it cumbersome.  I think its going to be more \"enjoyable\" to write tests using a real database. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13268620",
            "date": "2012-05-04T18:52:53+0000",
            "content": "this update also contains a fix in \"testJdbcDataSource\", which was not cleaning up a registered datasource causing the new test to fail. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13269788",
            "date": "2012-05-07T17:21:39+0000",
            "content": "I added a check to the # of queries being issued to the datasource and found an additional bug.  This is likely the bug users are reporting on the mailing list.\n\nI will commit now to Trunk & 3.6.1 . "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13269869",
            "date": "2012-05-07T18:44:36+0000",
            "content": "James thanks for adding these tests!\n\nAttached (SOLR-3430_build.patch) is a tiny tweak to the build: currently DIH tests can fail if 'ant example' has not previously been run (because the hsqldb.jar might not be resolved).\n\nSo this patch ensures the hsqldb.jar is always resolved. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13269908",
            "date": "2012-05-07T19:15:16+0000",
            "content": "Committed.\n\nTrunk:  r1335140 & r1335196 (rmuir's build changes)\nBranch_36:  r1335176 & r1335205 (rmuir's build changes)\n\nRobert, thanks for the help with ant. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13420215",
            "date": "2012-07-22T16:05:40+0000",
            "content": "Bulk close for 3.6.1 "
        }
    ]
}