{
    "id": "SOLR-2863",
    "title": "Solr 3.4 group.truncate does not work with facet queries",
    "details": {
        "affect_versions": "3.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Later"
    },
    "description": "When using Grouping with group.truncate=true, The following simple facet query:\nfacet.query=Monitor_id:[380000 TO 400000]\n\nDoesn't give the same number as the nGroups result for the equivalent filter query:\nfq=Monitor_id:[380000 TO 400000]\n\nFrom the Wiki page: 'group.truncate: If true, facet counts are based on the most relevant document of each group matching the query.'\n\nIf I turn off group.truncate then the counts are the same, as I'd expect - but unfortunately I'm only interested in the grouped results.\n\nAsked this question on the Solr-user mailing list and was told it is likely a bug by: Martijn Groningen.\n\nI'd be very interested in any workaround for this bug!",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Martijn van Groningen",
            "id": "comment-13138264",
            "date": "2011-10-28T12:45:21+0000",
            "content": "I initially thought it was a bug, but I'm doubting if it is. I can't reproduce it now. Can you specify the complete requests that you are sending to Solr? "
        },
        {
            "author": "Ian Grainger",
            "id": "comment-13138324",
            "date": "2011-10-28T13:21:50+0000",
            "content": "I can reproduce it with a very basic filter/facet query:\n\n/solr/select?q=:&group.field=Unique_Name&group.truncate=true&group.ngroups=true&group=true&facet=true&facet.query=Monitor_id:[380000%20TO%20400000] = facet-count: 103\n\nvs.\n\n/solr/select?q=:&group.field=Unique_Name&group.truncate=true&group.ngroups=true&group=true&facet=true&fq=Monitor_id:[380000%20TO%20400000] = ngroups: 4372\n\nIt only happens if the values are different for each document in the group (hence using an ID - which isn't the one being grouped on) - if they are all the same, truncate works as expected. "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13138332",
            "date": "2011-10-28T13:36:39+0000",
            "content": "It only happens if the values are different for each document in the group (hence using an ID - which isn't the one being grouped on)\nWhat values do you mean? The values of the group field (Unique_Name in your case) or Monitor_id field? "
        },
        {
            "author": "Ian Grainger",
            "id": "comment-13138337",
            "date": "2011-10-28T13:41:43+0000",
            "content": "It doesn't work if the values of the query field (Monitor_id) are different on each document in the group (as you'd normally expect in an arbitrary group of documents).\n\nI have done this with fields that vary with unique_name (ie. if unique_name is the same, their values will match), and truncate works correctly for those fields. "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13138394",
            "date": "2011-10-28T14:25:56+0000",
            "content": "Ok I get what you mean. I think this is not bug, but rather a missing feature. The type of post grouped faceting you want isn't yet implemented in Solr / Lucene. In LUCENE-3097 I described three different post grouping facet types. The one that fits your need (which I call matrix counts) is not yet implemented. \n\nThe group.truncate only selects for all the groups matching the query the most relevant document and uses that as base for a facet. Any subsequent documents inside a group are not visible during faceting.\n\nWhat is unfortunate is that the combination of group.ngroups and fq does work the way you want it and thus this explains the difference in facet count and ngroup count. "
        },
        {
            "author": "Ian Grainger",
            "id": "comment-13138402",
            "date": "2011-10-28T14:34:19+0000",
            "content": "So faceting with group.truncate will only look at the content of the first document in the group after the query/sort has been performed?\n\nTo enable what I would expect Solr would need to re-sort the documents in the group for each facet.query? There's no way I can specify the sort inside the facet query to get this to happen?\n\nDoes that mean this doesn't work for field facets either (until 'matrix counts' are done)? "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13138408",
            "date": "2011-10-28T14:42:46+0000",
            "content": "So faceting with group.truncate will only look at the content of the first document in the group after the query/sort has been performed?\nYes. It will only have the most relevant document. What the most relavant document is depends on your sort.\n\nTo enable what I would expect Solr would need to re-sort the documents in the group for each facet.query? There's no way I can specify the sort inside the facet query to get this to happen?\nThere is no work around for this as far as I know. You can't sort inside a facet.query, b/c it only counts.\n\nDoes that mean this doesn't work for field facets either (until 'matrix counts' are done)?\nUntil matrix facets have been implemented any facet type will have the same problem. "
        },
        {
            "author": "Ian Grainger",
            "id": "comment-13138425",
            "date": "2011-10-28T15:08:10+0000",
            "content": "So LUCENE-3097 is fixed and in (unreleased) trunk of Lucene? How can I get a build of Solr with this fix? (Sorry if that's a dumb question, newbie here.) "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13138467",
            "date": "2011-10-28T15:52:00+0000",
            "content": "No, it isn't fixed the only thing to do is implement matrix grouped facet counts. "
        },
        {
            "author": "Ian Grainger",
            "id": "comment-13138474",
            "date": "2011-10-28T15:58:18+0000",
            "content": "OK so the patch for Lucene doesn't help Solr? "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13138541",
            "date": "2011-10-28T17:11:02+0000",
            "content": "No unfortunately it doesn't help Solr and it also doesn't help lucene. It is on the roadmap for post grouping faceting. "
        },
        {
            "author": "Martijn van Groningen",
            "id": "comment-13139178",
            "date": "2011-10-29T10:27:22+0000",
            "content": "In order to fix this LUCENE-3097 needs be resolved first. "
        }
    ]
}