{
    "id": "SOLR-1912",
    "title": "Replication handler should offer more useful status messages, especially during fsync/commit/etc.",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "replication (java)"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "If you go to the replication admin page (http://server:port/solr/core/admin/replication/index.jsp) while replication is in progress, then you'll see a \"Current Replication Status\" section, which indicates how far along the replication download is, both overall and for the current file. It's great to see this status info. However, the replication admin page becomes misleading once the last file has been downloaded. In particular, after all downloads are complete Solr 1.4 continues to display things like this:\n\n\nDownloading File: _wv_1.del, Downloaded: 44 bytes / 44 bytes [100.0%] \n\nuntil all the index copying, fsync-ing, committing, and so on are complete. It gives the disconcerting impression that data transfer between master and slaves has mysteriously stalled right at the end of a 44 byte download. In case this is weird, let me mention that after a full replication I did just now, Solr spent quite a while in SnapPuller.terminateAndWaitFsyncService(), somewhere between many seconds and maybe 5 minutes.\n\nI propose that the admin page should offer more useful status messages while fsync/etc. are going on. I offer an initial patch that does this. SnapPuller is modified to always offer a human readable indication of the \"current operation\", and this is displayed on the replication page. We also stop showing progress indication for the \"current file\", except when there actually is a file currently being downloaded.",
    "attachments": {
        "SOLR-1912.patch": "https://issues.apache.org/jira/secure/attachment/12444460/SOLR-1912.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13835733",
            "date": "2013-11-30T13:28:16+0000",
            "content": "2013 Old JIRA cleanup "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16067400",
            "date": "2017-06-28T22:50:18+0000",
            "content": "Closing ancient issue related to old JSP admin pages. "
        }
    ]
}