{
    "id": "SOLR-2091",
    "title": "wt=json is served as text/plain",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Response Writers"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "JSON data should be served as application/json.  SOLR-1123 is equivalent, except that I think that most people would regard serving JSON as text/plain as a bug.  If SOLR does serve content with a client-friendly type, then RESTful client frameworks can just do the right thing with responses.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12903011",
            "date": "2010-08-26T19:55:08+0000",
            "content": "closing as duplicate of SOLR-1123 "
        },
        {
            "author": "Paul R. Brown",
            "id": "comment-12903100",
            "date": "2010-08-26T22:03:42+0000",
            "content": "Can we bump the other issue from improvement to bug, then?  The point is that this is something that will confuse folks who would like to write client code against Solr with standards-friendly tooling. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12903161",
            "date": "2010-08-27T00:19:49+0000",
            "content": "oops - first of all, apologies for reading your issue too fast - I didn't see that you had already referenced SOLR-1123.\n\nAnyway, IMO it's not a bug - it was a very conscious decision to not use \"application/json\" (I actually had started out that way) since it makes it's use in browsers useless w/o extra plugins.  Until common browsers support JSON natively (or at least display the text w/o prompting), I think text/plain is the best default.\n\nIf we did have a parameter like wt.content-type (or a more general mechanism to set any return HTTP headers), we could also register another general request handler like /select/json that defaulted to using application/json. "
        },
        {
            "author": "Paul R. Brown",
            "id": "comment-12903249",
            "date": "2010-08-27T06:17:10+0000",
            "content": "I will look at how difficult it would be to have Solr use content negotiation to determine what to send down and how to format it.  (I've implemented some update handlers and other extensions before, so I hope this won't be that much more difficult...) "
        }
    ]
}