{
    "id": "SOLR-6019",
    "title": "Managed schema file does not show up in the \"Files\" UI",
    "details": {
        "affect_versions": "4.7.2,                                            4.8",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI",
            "Schema and Analysis"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "When running with the schema-less example, I noticed that the managed-schema file does not show in the \"Files\" section of the Admin UI. This can be confusing for a user. To make sure it was not a caching issue on the browser, I closed and opened the UI again in a new tab. I also restarted Solr and still the managed-schema is not visible in the Files section. Interestingly, the schema.xml.bak does show up. A screenshot of the UI is attached.\n\nIt is possible that this bug affects other managed resources as well such as synonyms but I haven't tested that yet.\n\nThe schema browser works fine though.",
    "attachments": {
        "6019-missing-managed-schema.png": "https://issues.apache.org/jira/secure/attachment/12641989/6019-missing-managed-schema.png",
        "SOLR-6019.patch": "https://issues.apache.org/jira/secure/attachment/12685621/SOLR-6019.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13981767",
            "date": "2014-04-25T23:30:40+0000",
            "content": "I vaguely remember another issue, which discussed that. not sure about the reasons that were mentioned - i recall it had something to do with confusing the user (or rather, try to avoid that) so in case of using managed schema, it does not have a schema.xml. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13981770",
            "date": "2014-04-25T23:35:54+0000",
            "content": "found one comment in ShowFileRequestHandler.java on line 279ff, leading towards SOLR-5455 "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13981874",
            "date": "2014-04-26T04:23:15+0000",
            "content": "Thanks Stefan. I'd still consider this a bug. We should be able to read the file even if it cannot be edited. Also the editing feature itself is limited to trunk. "
        },
        {
            "author": "Vitaliy Zhovtyuk",
            "id": "comment-14237217",
            "date": "2014-12-07T18:00:51+0000",
            "content": "File should be available for viewing in admin UI, but should be restricted for edit.  Currently, both handlers on view and edit managed schema are restricted.\nChanges:\n1. Removed restriction on managed schema file ShowFileRequestHandler\n2. Added restriction in file edit in EditFileRequestHandler\n3. Fixed javascript issue to view file without extension: default content type passed. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14295537",
            "date": "2015-01-28T18:11:48+0000",
            "content": "It would have been good to get this in for 5.0 but now we should get this in for 5.1. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14295594",
            "date": "2015-01-28T18:43:15+0000",
            "content": "Duplicate of SOLR-6992 (or the other way around)? "
        }
    ]
}