{
    "id": "SOLR-5518",
    "title": "Move editing config files into a new handler",
    "details": {
        "affect_versions": "4.7,                                            6.0",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "See SOLR-5287. Uwe Schindler pointed out that writing files the way 5287 is a security vulnerability and that disabling it should be the norm. Subsequent discussion came up with this idea.\n\nWriting arbitrary config files should NOT be on by default.\n\nWe'll also incorporate Mark's idea of testing XML files before writing anywhere.",
    "attachments": {
        "SOLR-5518.patch": "https://issues.apache.org/jira/secure/attachment/12616453/SOLR-5518.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13835903",
            "date": "2013-11-30T23:45:37+0000",
            "content": "Stefan Matheis (steffkes) Note that all the places in the UI that use the ShowFileRequestHandler will have to be changed to point to this new handler. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13835928",
            "date": "2013-12-01T02:26:38+0000",
            "content": "First cut at a patch moving file updating to a separate request handler. Tests pass, but I need to look it over again. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13836080",
            "date": "2013-12-01T17:57:28+0000",
            "content": "Maybe just leave ShowFileHandler alone on this issue?! I don't think it should be mixed in with this editing stuff...\n\nI dont see a need for a base class shared between the two anyway. This seems like it can just be 2 static methods. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13836184",
            "date": "2013-12-02T02:40:55+0000",
            "content": "OK, no base class but static methods. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13836517",
            "date": "2013-12-02T13:51:04+0000",
            "content": "I need a plan Real Soon Now. Like in the next 8 hours.\n\nI see several options:\n1> go ahead and check this in to both trunk and 4x. \n2> just check it in to trunk and remove the whole thing from 4x entirely. Perhaps this will be a 5x only feature?\n3> take it out of both.\n4> other suggestions?\n\nNOTE: if a subsequent decision is to pull things out, this will be quite simple on the server side, just remove the (new) EditFileRequestHandler class and then get tests to run. There'll be a test class that just gets removed, and there'll be a bit of code to remove in an existing test (ZK, TestModifyConfFiles). I think I put all the static methods in ShowFileRequestHandler, so that should be coherent. Finally, there'll be several solrconfig files to pull the comments out of. But a grep for EditFileRequestHandler should suffice to find them all.\n\nStefan Matheis (steffkes) If we remove this either from 4x or trunk or both, how much work will it be to remove the \"files\" stuff in the UI? Would it be sufficient to just comment out the code at the top level that shows the files option?\n\nI think it'll be far easier to just jerk the code out than roll back the commits, any objections to doing <2> or <3> that way?\n\nIn the absence of any consensus, I'll do <2> this evening. I'll probably actually merge this code into 4x, then remove it on a subsequent ticket, so don't be surprised if you see this get checked in to the 4x branch temporarily. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13836521",
            "date": "2013-12-02T13:56:25+0000",
            "content": "Please do (2) as suggested in the other issue. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13836552",
            "date": "2013-12-02T14:41:44+0000",
            "content": "I'm not sure if there's a need to remove the \"Files\" Page completely, since browsing the available files would be possible w/o the write-stuff anyway? maybe just removing the \"modify\" functionality but leave the rest \"as is\"? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13836706",
            "date": "2013-12-02T17:28:03+0000",
            "content": "I'm not sure if there's a need to remove the \"Files\" Page completely, since browsing the available files would be possible w/o the write-stuff anyway? maybe just removing the \"modify\" functionality but leave the rest \"as is\"?\n\nI am fine with that! So we should revert SOLR-5287 in branch_4x, remove the \"Modify /new File\" button from admin UI, and all should be fine.\n\nThe current code should be committed to trunk only, and we open other issues to add \"security\" to the admin request handlers before providing them to users in a stable branch. This is all to half-baked, I don't want to risk Solr's good standing by merging this to a stable branch. A \"file manager\" in Solr is way too much for a stable branch, especially if it has no security at all. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13837168",
            "date": "2013-12-03T00:55:26+0000",
            "content": "Commit 1547251 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1547251 ]\n\nSOLR-5518: Move editing files to a separte request handler "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13837235",
            "date": "2013-12-03T01:59:53+0000",
            "content": "Commit 1547261 from Erick Erickson in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1547261 ]\n\nSOLR-5518: Move editing files to a separte request handler "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13837240",
            "date": "2013-12-03T02:07:20+0000",
            "content": "Will remove from 4.7 Real Soon Now. "
        }
    ]
}