{
    "id": "SOLR-12002",
    "title": "Allow DocValue type changes without reindex",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "6.6.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I've made a change to our Solr schema where an existing field was changed and docValues=\"true\" was added. Only doing a core reload, during reindexing (with the clean flag, in dataimporter) the message \"Cannot change DocValues type from SORTED_SET to SORTED for field companyType\" showed up in the logs, but not for all documents.\n\nIssuing a Solr restart and then reindexing fixed the issue. Under the assumption that core reload should handle any schema changes without issue, I think that this behaviour can be considered a bug.\n\nNote that I'm using the classical schema configuration (disabled managed schema), maybe managed schema exhibits the same behaviour but that's untested on my end.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-02-15T15:10:16+0000",
            "content": "It's not a bug - it's entirely expected behavior. Nearly all schema changes require reindexing data because simply changing the schema does nothing to change the underlying data in the index. The schema is a guide to interpreting the data, and when you change the schema without changing the data there is a mismatch between what Solr is told to expect and what actually exists. This limitation exists whether you use the classic schema or the managed schema: the essential behavior of the schema in relation to the data in the index does not change depending on the type of schema used.\n\nI mention this is a limitation of Solr, and it's one that could possibly be removed in some cases. Since I can't find another JIRA issue that covers this enhancement, I'll modify this issue to be an Improvement and modify the issue title accordingly. ",
            "author": "Cassandra Targett",
            "id": "comment-16365700"
        },
        {
            "date": "2018-02-15T15:24:31+0000",
            "content": "That's not exactly what I've reported. Maybe I phrased myself poorly. The schema was changed and during indexing Solr showed many warnings of the message I've quoted, and those messages still showed up during indexing no matter how many times I reloaded the core; and only once I've restarted Solr they stopped showing up during indexing. ",
            "author": "Marius Ghita",
            "id": "comment-16365730"
        },
        {
            "date": "2018-02-15T16:00:46+0000",
            "content": "Hmmm, were you then able to use that field as you intend for things like faceting and grouping? That message usually means you have also switched multiValued as well.\n\n\"Under the assumption that core reload should handle any schema changes without issue,\" This is what Cassandra was responding to it simply isn't (and never has been) in the design...\n\nBut it does seem that in this particular case there's room for improvement in this entire area. Generally deleting : (which is what DIH clean does) and reloading the core should start you all over again with a clean slate. ",
            "author": "Erick Erickson",
            "id": "comment-16365793"
        },
        {
            "date": "2018-02-15T16:43:10+0000",
            "content": "The field is just defined as (no multiValued attribute):\n\n<field name=\"companyType\" type=\"string\" indexed=\"true\" stored=\"true\" docValues=\"true\"/>\n\nThe field is used only for queries, no faceting/grouping is done currently on that field.\n\nAnd the only reason I've added docValues=\"true\" was because that was the answer to my Google search on how to remove those warnings from the Solr log (this, while developing the schema changes locally).\n\nDuring the deployment of the new schema all I did was:\n\n\toverwrite schema.xml with the new version\n\treload core in admin interface\n\trun dataimporter with default parameters (clean, commit, command=full-import, across all entities defined in data-config.xml)\n\tsaw the warnings that showed up\n\trepeat a couple of times step 2-3 to make sure that I'm seeing the same warnings every time dataimport is running\n\n\n\nGiven that I saw no difference between my local Solr configuration and the one on the server, I restarted the Solr server, and dataimporter happily ran without further warnings.\n\nEdit: in my original schema definition, that field was at first a multiValued field; the original definition before the changes I've made\n <field name=\"companyType\" type=\"string\" multiValued=\"true\" indexed=\"true\" stored=\"true\"/> ",
            "author": "Marius Ghita",
            "id": "comment-16365884"
        }
    ]
}