{
    "id": "SOLR-2168",
    "title": "Velocity facet output for facet missing",
    "details": {
        "affect_versions": "3.1",
        "status": "Resolved",
        "fix_versions": [
            "4.10",
            "6.0"
        ],
        "components": [
            "Response Writers"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "If I add fact.missing to the facet params for a field, the Veolcity output has in the facet list:\n\n$facet.name (9220)",
    "attachments": {
        "SOLR-2168.patch": "https://issues.apache.org/jira/secure/attachment/12457349/SOLR-2168.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Peter Wolanin",
            "id": "comment-12921737",
            "date": "2010-10-16T19:11:29+0000",
            "content": "Attaching a functional (if not elegant) fix - I find the velocity template syntax a little ... annoying "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12921831",
            "date": "2010-10-17T12:01:07+0000",
            "content": "I've taken the patch idea and gave it a slight modification.  In my effort to learn git, I've committed it to my \"facet_missing\" branch here: http://github.com/erikhatcher/lucene-solr/commit/70197cca24129141081d83ea422515dc69287e73  (I've still got to figure out how to push this change to Solr's trunk through git)\n\nI changed the code to so that the #set wasn't needed and also changed the label shown for missing facets to <No $field.name> to have angle brackets to avoid it looking like a regular value.  These changes ok with you?   (I also cleaned up the formatting of that file slightly)\n\nOut of curiosity, what's annoying about Velocity syntax?  (for example, show me how it'd look in your template language of choice) "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12921833",
            "date": "2010-10-17T12:09:47+0000",
            "content": "Also, in the patch I linked to in my previous comment I made it so that the missing facet isn't shown if the count is zero. "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12921852",
            "date": "2010-10-17T14:24:56+0000",
            "content": "Those all sound like good changes.\n\nIn terms of templating -I'd find something like erb, or PHP, or jsp much easier, and I imagine many more people are failiar with those.  So far, I feel like it's hard to understand in velocity how variables and control structures are distinguished from the output, and it's not clear that it's a real template in terms of the way e.g. white space is handled or not.  This is especially true in the case of macro output, where is seems like e.g. the carriage returns and spaces I'd naturally include in control structures to make them readable become part of the output.\n\nThe variable handling is also weird, that I need to use #set() for actual assignment?\n\nIn terms of readablilty, loo for example, at this bit:\n\n<li><a href=\"#url_for_home#lens&fq=$esc.url(\n\n\n\nthe &fq= is output in the middle of a series of macro and function calls but nothing visually distinguishes them.  Can I define new functions instead of macros?  If a macro call could be written as #\n{url_for_home}\n it would provide more visual separation. \n\nI notice in the patch you have:\n\n\"-${field.name}:[* TO *]\"\n\n\n\nLooks like the function call can be written like this?\n\n${esc.url(\"-${field.name}:[* TO *]\")}\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12921854",
            "date": "2010-10-17T14:34:18+0000",
            "content": "In my effort to learn git, I've committed it to my \"facet_missing\" branch here\n\nHmmm, I'm liking this already...\nNice and easy review of patches (including commenting), and you can get just the patch, or the compete file, or the complete tree. "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12921855",
            "date": "2010-10-17T14:47:50+0000",
            "content": "\nIf you want to start using git more widely for devlopement (assuming people still post the final patches as attachments here) you might want to set up a canonical mirror some place on github so that everyone uses the same initial tree.  We have this for Drupal: http://github.com/drupal/drupal and mirroring out of svn is probably even easier if someone has a server and can just run a script on cron every ~15 min. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12921856",
            "date": "2010-10-17T14:56:05+0000",
            "content": "http://git.apache.org/\nhttp://github.com/apache/lucene-solr "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-13034994",
            "date": "2011-05-17T19:28:17+0000",
            "content": "Did this change to the templates get committed to the actual Solr repo? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13035015",
            "date": "2011-05-17T20:05:31+0000",
            "content": "Alas not yet, Peter.  Sorry. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14086044",
            "date": "2014-08-05T09:43:44+0000",
            "content": "Commit 1615902 from Erik Hatcher in branch 'dev/trunk'\n[ https://svn.apache.org/r1615902 ]\n\nSOLR-2168: Added support for facet.missing in /browse field and pivot faceting. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14086047",
            "date": "2014-08-05T09:46:27+0000",
            "content": "Commit 1615903 from Erik Hatcher in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1615903 ]\n\nSOLR-2168: Added support for facet.missing in /browse field and pivot faceting. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14086050",
            "date": "2014-08-05T09:49:35+0000",
            "content": "Apologies, Peter, for not knocking this out much sooner.  I also noticed the same treatment was needed for pivot facets so I added that in there as well as defaulting /browse to facet.missing=true.\n\nAnd yes, in this case the templating did get a bit ugly because checking for only null in Velocity isn't as clean, and there's some code duplication in here (I took care of some of that in a common macro). "
        }
    ]
}