{
    "id": "SOLR-6841",
    "title": "Visualize lucene segment info in admin",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.1",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "We find it useful to tune merge policy not blindly but looking on segment size and fill ratio.\n\nWe're working on a patch that adds a tab to admin page with McCandless-style of segment visualization.\n\nDraft UI is attached (currenly as part of admin.extra).\n\nPlease share your ideas if it's ok to put the code in core admin.\n\n\nMore details here\nhttp://search-lucene.com/m/QTPa44cNJ1 \n\nhttps://plus.google.com/+MichaelMcCandless/posts/MJVueTznYnD\nhttp://blog.mikemccandless.com/2011/02/visualizing-lucenes-segment-merges.html",
    "attachments": {
        "SOLR-6841.patch": "https://issues.apache.org/jira/secure/attachment/12695888/SOLR-6841.patch",
        "(old)Overview page.png": "https://issues.apache.org/jira/secure/attachment/12688927/%28old%29Overview%20page.png",
        "segments_info.png": "https://issues.apache.org/jira/secure/attachment/12688861/segments_info.png",
        "segments_info_merge_candidates.png": "https://issues.apache.org/jira/secure/attachment/12694995/segments_info_merge_candidates.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-12T10:05:05+0000",
            "author": "Alexey Kozhemiakin",
            "content": "Work-in-progress UI screenshot attached to demonstrate the idea ",
            "id": "comment-14243932"
        },
        {
            "date": "2014-12-12T10:21:21+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Looks great! Thanks Alexey.\n\nPlease share your ideas if it's ok to put the code in core admin.\n\nIt depends on the code. Let's see the patch first and then discuss. ",
            "id": "comment-14243947"
        },
        {
            "date": "2014-12-19T18:11:52+0000",
            "author": "Hoss Man",
            "content": "very cool - would definitely welcome that as a patch to integrate directly into the solr admin.\n\nI suspect that auto generating the \"size\" scale in such a way that the numbers don't look silly is a hard problem –  particularly since it looks like you are trying to use a log scale as well.  maybe just label the \"max\" (ie: size of biggest segment) on the horizontal axis, along with the vertical log lines, and then label each segment with it's size (or use tool tips) ? ",
            "id": "comment-14253723"
        },
        {
            "date": "2014-12-20T03:25:10+0000",
            "author": "Shawn Heisey",
            "content": "That looks really nice.  Thank you for working on this!\n\nHoss' idea for tooltips sounds good to me.  If all the segment detail is on a tooltip, the UI will be very clean.\n\nHere's a series of additional ideas: It would be really nice to be able to change the sort on the bars.  The two primary choices that spring to mind are segment size and the numeric segment number.  Some might even want to sort by maxdoc and/or deleted documents.  If it's not super-difficult, a sort option that groups the bars by \"these segments are the current candidates for the next merge\" would satisfy the original requirements nicely. ",
            "id": "comment-14254489"
        },
        {
            "date": "2014-12-23T13:50:20+0000",
            "author": "Michal Bienkowski",
            "content": "Lucene segment info implementation as a separate menu entry in Solr Admin and separate handler registered as Luke handler in PluginRegister. See attachment. ",
            "id": "comment-14256977"
        },
        {
            "date": "2014-12-23T13:54:48+0000",
            "author": "Michal Bienkowski",
            "content": "Segments info with tooltip - screenshot. See attachment. ",
            "id": "comment-14256978"
        },
        {
            "date": "2014-12-23T21:06:24+0000",
            "author": "Alexey Kozhemiakin",
            "content": "Michal, thanks for uploading the patch.\n\nCommunity, please share your feedback, most comments were implemented (tooltips, cleaned-up scale and numbers formatting). \n\nIf current solution is ok from architecture point of view (separate sub handler to luke handler) then we will proceed with sorting options (by age, size) and highlighting (these segments are candidates for next merge - MergePolicy.findMerges(...)) ",
            "id": "comment-14257534"
        },
        {
            "date": "2014-12-23T21:12:42+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Thanks Michal and Alexey.\n\nThe solution looks fine. The separate request handler is going to be an internal detail and we can always change that part. What was the reason behind moving this to a separate page by itself instead of keeping it in the \"Overview\" admin-extras area? ",
            "id": "comment-14257541"
        },
        {
            "date": "2014-12-23T22:15:14+0000",
            "author": "Alexey Kozhemiakin",
            "content": "Here's what we considered:\n1) admin-extra is usually a placeholder for custom code\\markup and comes empty in default packages, definitely not a good place to land our code\n2) if you meant just the placement of bars to where admin-extra is now rendered - usually # of segments is 30-50 and it will make Overview page annoyingly long and noisy even if we place it (attached a screenshot  once again)\n3) that's why we came with separate page keeping in mind that at some point it would host more low level index details.\n ",
            "id": "comment-14257600"
        },
        {
            "date": "2014-12-23T22:19:47+0000",
            "author": "Alexey Kozhemiakin",
            "content": "As for \"candidates for merge\" - afaik findMerges will return segments that are ready to be merged according to current configuration and we will return nothing until that moment. So essentially it will start returning non-empty \"candidates\" when a merge will be already going in background - I will double check if this is true tomorrow. And if yes - then it will be \"ongoing merge\" section rather than \"candidates\". ",
            "id": "comment-14257603"
        },
        {
            "date": "2015-01-28T14:30:59+0000",
            "author": "Michal Bienkowski",
            "content": "Patch with merge candidates highlighting feature. Retrieves merge candidates from MergePolicy.findMerges and apply this information to matched segments. ",
            "id": "comment-14295205"
        },
        {
            "date": "2015-02-02T11:18:19+0000",
            "author": "Varun Thacker",
            "content": "This is cool!\n\nWhile playing around I observed that when there are no segments in the index, the Segments Info page says:\nSize 0\nDeletions: NaN%\n\nIn the future it would be awesome if we could click on a segment we could get more granular information about it like the number of fields in the segment, number of terms in that field, memory consumed by the segment etc.  ",
            "id": "comment-14301165"
        },
        {
            "date": "2015-03-09T00:47:20+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Patch to bring this in sync with trunk. Changes:\n\n\tImplicit handlers are now registered in ImplicitPlugins in trunk\n\tLUCENE-6307 renamed SegmentInfo.getDocCount -> .maxDoc\n\tAdded check for document count == 0 before calculating deletion %\n\tIntelliJ was complaining about unterminated javascript statements so I added semi-colon characters\n\n\n\nI'll commit this shortly. ",
            "id": "comment-14352379"
        },
        {
            "date": "2015-03-09T00:57:21+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1665105 from shalin@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1665105 ]\n\nSOLR-6841: Visualize lucene segment information in Admin UI ",
            "id": "comment-14352387"
        },
        {
            "date": "2015-03-09T01:03:09+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Thanks Alexey and Michal for the work and everyone else for the reviews!\n\nThis will be released with 5.1. Let's open new issues for any further enhancements (sorting etc.) that may be required. ",
            "id": "comment-14352391"
        },
        {
            "date": "2015-03-09T01:03:44+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1665106 from shalin@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1665106 ]\n\nSOLR-6841: Visualize lucene segment information in Admin UI ",
            "id": "comment-14352393"
        },
        {
            "date": "2015-04-15T00:30:05+0000",
            "author": "Timothy Potter",
            "content": "Bulk close after 5.1 release ",
            "id": "comment-14495210"
        }
    ]
}