{
    "id": "SOLR-8238",
    "title": "Make Solr respect preferredLeader at startup",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Minor"
    },
    "description": "After setting preferredLeader property, noticed that upon restarting leaders revert to wherever they were previously running before REBALANCE was called.   I would expect the preferredLeader to influence the startup election, but it appears it is not observed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-04T19:23:51+0000",
            "author": "Erick Erickson",
            "content": "The intention here is that the preferredLeader role has two functions:\n\n1> Cause the cluster to tend toward the preferredLeader role coinciding with the actual leader.\n\n2> allow pathological out-of-balance situations to be rectified.\n\nIt accomplishes <1> by the following: As a node comes up, if it has the preferredLeader role set and another node is the leader, it inserts itself as the next-in-line for leadership election for its shard. So any time the current leader abdicates its leadership role, this node will become the leader. That's why we called it \"preferredLeader rather than something like \"requiredLeader\".\n\n2> is the REBALANCELEADERS command. But this noticeably impacted performance in a situation where literally hundreds of replicas on a single Solr instance were leaders, very special circumstances.\n\nUnless we come up with a use case where the current functionality is demonstrably affecting performance, I think the added complexity (especially in the case where the entire cluster is being restarted) is not worth the risk. I can be talked out of that opinion but it'd have to be for more then aesthetic reasons.\n\nIn the general case, the leader role imposes a small amount of additional work on a node that it can usually be ignored. ",
            "id": "comment-14990224"
        },
        {
            "date": "2016-06-23T04:39:59+0000",
            "author": "Erick Erickson",
            "content": "Resolving as \"won' fix\" since there's no \"working as designed\". We can re-open if it's urgent.\n\nOne can always issue the REBALANCELEADERS API command after the cluster is up if necessary. ",
            "id": "comment-15345720"
        }
    ]
}