{
    "id": "SOLR-2032",
    "title": "Map-viewer demo of SolrSpatial test data",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Simple demo that shows off the location data in the Solr example electronics store. Uses the OpenLayers graphic/mapping javascript library. Search for anything in the store and click on the red diamond.\n\nThis code is flaky on IE, sometimes works, sometimes does not.\n\nThere is no spot in the code base for UI demos.\n\nThe OpenLayers license is not known to be compatible with Apache at this point, and contributing one project's code into another is rather dubious.",
    "attachments": {
        "SOLR-2032.patch": "https://issues.apache.org/jira/secure/attachment/12451491/SOLR-2032.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lance Norskog",
            "id": "comment-12896220",
            "date": "2010-08-07T05:44:30+0000",
            "content": "I'm not sure if the OpenLayers license is compatible with Apache, so it is currently marked 'Attachment not intended for inclusion'. "
        },
        {
            "author": "Karl Wright",
            "id": "comment-12896230",
            "date": "2010-08-07T06:22:58+0000",
            "content": "I know the genesis of OpenLayers - it too was spun out of MetaCarta, about a year prior to LCF.  I'll ask Chris what the license was derived from, but I'd be very surprised if Apache didn't accept it.  You will, of course, need to get an official Apache ruling on that. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12896233",
            "date": "2010-08-07T07:25:25+0000",
            "content": "We will also need an official Solr ruling about having example pages for Solr features. See SOLR-1848. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12896251",
            "date": "2010-08-07T13:02:10+0000",
            "content": "Why not simply provide the demo using Google Maps, so the user would simply enter a GMap key before running the demo (for localhost, none is needed)? Like our maps at www.pangaea.de powered by Lucene. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12896283",
            "date": "2010-08-07T21:26:08+0000",
            "content": "From the Google Maps FAQ:\nIf you are developing on a local drive (file://), the key check is skipped in the Google Maps Javascript API and it is less restrictive in the Google Maps API for Flash. Note also that developing on the local drive with the Google Maps API for Flash will result in tiles with \"DEBUG\" painted on them. If you are developing on localhost, you will need to register a key for http://localhost. \n\nIf you load this demo page from a file, then it calls localhost, which is a cross-scripting attempt. So the page has to be served by a localhost servlet, and thus the user has to get a key. I wanted the lowest possible \"user energy barrier\" to trying the demo. Thus... OpenLayers. I suppose I could register http://localhost and then include the key in the demo, but as Richard Nixon once said into a bookcase, \"it would be wrong\". "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15389011",
            "date": "2016-07-22T06:37:29+0000",
            "content": "Can we close this? We have Google maps in /browse example. If we want something bigger it would use new field types and API and will have no real connection to this case. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15402189",
            "date": "2016-08-01T14:57:59+0000",
            "content": "I agree, let's close this. "
        }
    ]
}