{
    "id": "SOLR-1010",
    "title": "Relative instanceDir is evaluated relative to current working directory",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "If a relative instanceDir is provided in solr.xml, it should be evaluated relative to solr.home instead of the current working directory.\n\nI guess people work around this bug right now by using absolute paths for instanceDir.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Alexey Serba",
            "id": "comment-12674221",
            "date": "2009-02-17T14:21:05+0000",
            "content": "\nIf a relative instanceDir is provided in solr.xml, it should be evaluated relative to solr.home instead of the current working directory.\nThis is the behavior I expected from solr multicore.\nAdded my vote. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12675671",
            "date": "2009-02-22T16:48:28+0000",
            "content": "Hymmm – the semantics of this could be argued either way.\n\nI can see arguments for both.\n\nFor sure we can not change the behavior within a 1.x release without a fair bit of consideration.  A naive approach will break any existing configs.\n\nI think I would add this to the bucket of things that get fixed in 2.0 with a full re-vamp of how configuration/initialization happens. "
        },
        {
            "author": "Michael Della Bitta",
            "id": "comment-12675714",
            "date": "2009-02-22T21:43:14+0000",
            "content": "I'm a little unclear on why it would ever make sense to base any sort of configuration path on where the container was invoked, because usage of a container implies there might be other colocated apps and resulting conflicts if other apps (which are likely Solr instances) worked in this way. \n\nBut even more so when I've made an obvious effort to override this behavior by using something like JNDI. It seems to me that the type of user that's willing to do the configuration work to set JNDI properties is the type of user that wouldn't need to worry about the simplicity of having all paths work off the invocation directory, and the configured solr.home should be considered the new user.dir.\n\nMaybe I'm missing the other argument because it doesn't apply to me somehow, though. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12675775",
            "date": "2009-02-23T06:16:46+0000",
            "content": "I must have been really confused when I opened this issue. Relative instanceDir is already handled relative to solr.home directory.\n\nI'm really sorry for the confusion. We can close this issue. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775653",
            "date": "2009-11-10T15:51:56+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}