{
    "id": "SOLR-7727",
    "title": "bin/solr script incorrectly requires solr.xml in $SOLR_HOME",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.3",
            "6.0"
        ],
        "affect_versions": "5.2.1",
        "status": "Closed",
        "resolution": "Implemented",
        "priority": "Major"
    },
    "description": "The bin/solr script currently requires solr.xml to exist in $SOLR_HOME, going against SOLR-4718 which allows it to be hosted in Zookeeper.\n\nLine 1219:\nif [ ! -e \"$SOLR_HOME/solr.xml\" ]; then\n  echo -e \"\\nSolr home directory $SOLR_HOME must contain a solr.xml file!\\n\"\n  exit 1\nfi\n\nCommenting this out, and specifying the following in one's solr.in.sh, allows solr.xml to once again be hosted in ZK:\nSOLR_OPTS=\"$SOLR_OPTS -Dsolr.solrxml.location=zookeeper\"",
    "attachments": {
        "SOLR-7727.patch": "https://issues.apache.org/jira/secure/attachment/12742262/SOLR-7727.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-06-26T23:33:39+0000",
            "author": "Jan Høydahl",
            "content": "Thanks. Here is a first patch. Tested on Mac only, needs to test on Linux and Windows too... ",
            "id": "comment-14603784"
        },
        {
            "date": "2015-06-28T21:11:51+0000",
            "author": "Jan Høydahl",
            "content": "Thinking more about this, an alternative solution is to change SolrDispatchFilter to look for solr.xml in ZK by default in cloud mode, and fallback to SOLR_HOME for back compat, getting rid of -Dsolr.solrxml.location. Do you see any problems with such a solution? Erick Erickson why was an explicit system-prop chosen in SOLR-4718? I'm probably not considering the full complexity of the logic here..\n\nAside: Currently, if you start Solr in non-cloud mode with solrxml.location specified, e.g. bin/solr start -Dsolr.solrxml.location=zookeeper, Jetty starts up but in a bad state, instead of failing fast, but no error is given in the start script. Trying to access Solr gives 500 error with nullpointer. This would also be fixed with the code-change above, since loading solr.xml from ZK would only be attempted when in ZK mode.  ",
            "id": "comment-14604918"
        },
        {
            "date": "2015-06-29T22:14:04+0000",
            "author": "Erick Erickson",
            "content": "You're asking me to remember from over 2 years ago? .\n\nAs I remember, that was a relatively awkward time where we had to support both old and new style solr.xml files. You could have solr.xml locally (for some reason) but still want to read solr.xml from ZK. Now that old-style solr.xml is no longer supported perhaps we can move forward.\n\nYour proposal also has the advantage of moving us a little closer to ZK being \"the one source of truth\". At first glance, the idea seems fine since if it wasn't up there, we'd find it on disk.\n ",
            "id": "comment-14606529"
        },
        {
            "date": "2015-06-30T07:22:43+0000",
            "author": "Jan Høydahl",
            "content": "Created spinoff issue SOLR-7735 for this ",
            "id": "comment-14607798"
        },
        {
            "date": "2015-07-23T21:32:43+0000",
            "author": "Jan Høydahl",
            "content": "Covered by a better solution in SOLR-7735 ",
            "id": "comment-14639546"
        }
    ]
}