{
    "id": "SOLR-5775",
    "title": "Disable constantly failing solr tests",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Done"
    },
    "description": "Currently, solr tests are failing 90%+ of the time. We've been through this before many times, the argument is always that someone is looking at the failures and knows which ones are bad.\n\nThis argument is a lie. Nobody is watching these failures, or DistributedQueryComponentOptimizationTest would not have failed repeatedly for two straight days when the fix was trivial (I fixed this last night: http://svn.apache.org/r1571930)\n\nIts frustrating to me as a committer, solr tests NEVER pass on my machine, no matter how many times I try. How can i possibly commit something without knowing i am making the situation even worse?\n\nThis is all a big problem for developers, release managers, even users of the project. The test suite should pass.\n\nThe old argument that \"solr tests are allowed to fail\" is no longer valid. I will disable all constantly failing tests.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13912820",
            "date": "2014-02-26T12:36:46+0000",
            "content": "Also a bad thing is that nobody is preventing the addition of such bad tests.\n\nI will be monitoring the situation closely from here on out. I will officially -1 any commits that add unreliable tests! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13912823",
            "date": "2014-02-26T12:40:05+0000",
            "content": "We should add the @BadApples annotation. Then everybody can run them and fix them, if he wants. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13912825",
            "date": "2014-02-26T12:41:35+0000",
            "content": "+1, intermittently failing tests are no better than no tests.\n\nI also really don't like that Solr test failures mask other failures, e.g. the simple missing javadocs recently in the facets package was undiscovered because Solr test failures prevented the build from getting to javadocs linting. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13912835",
            "date": "2014-02-26T12:50:08+0000",
            "content": "Eh... I can feel the heated debate coming in again... My opinion has not changed – I think a test failure should be a red flag exception, not a norm. And I believe tests that repeatedly fail should be disabled/ put into bad apples (with a JIRA issue marking the problem). "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912838",
            "date": "2014-02-26T12:55:23+0000",
            "content": "Commit 1572036 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1572036 ]\n\nSOLR-5775: disable constantly failing solr tests "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912840",
            "date": "2014-02-26T12:55:57+0000",
            "content": "Commit 1572037 from Robert Muir in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1572037 ]\n\nSOLR-5775: disable constantly failing solr tests "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912856",
            "date": "2014-02-26T13:07:41+0000",
            "content": "Commit 1572040 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1572040 ]\n\nSOLR-5775: add badapple (fails locally constantly) "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13912857",
            "date": "2014-02-26T13:08:56+0000",
            "content": "Nobody is watching these failures, or DistributedQueryComponentOptimizationTest would not have failed repeatedly for two straight days when the fix was trivial (I fixed this last night: http://svn.apache.org/r1571930)\n\nI am responsible for this. I saw this on policeman jenkins and replied on the list that I'm looking at it. The fix may be trivial for you but it wasn't for me because I don't know enough about the codecs. Thank you for fixing it. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13912863",
            "date": "2014-02-26T13:13:09+0000",
            "content": "Shalin: I didn't mean to fingerpoint, i'm sorry. I guess the combination of this, and lost coverage in lucene (e.g. javadocs checks not running), and the fact that 'ant test' has not worked for me locally in months was enough for me to raise the issue.\n\nHonestly, its like 6 or 7 bad apples here. the situation seems fixable, but our 'steady state' needs to be BUILD SUCCESSFUL. "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13912884",
            "date": "2014-02-26T13:32:49+0000",
            "content": "I wrote a mail about this during building the RC for 4.7 and I share roberts concerns. I know that is hard to get distributed tests to pass but it should be our main objective to get things stable. I think it's mandatory for getting new contributors in as well as for existing contributors to develop code. For me as a RM it was a nightmare really to realize that a release build skips all the solr tests because if we would run them it would mean the RC would never happen at least on my machine that was the case when I enabled them. It's super important to have a build that passes otherwise you never know if you broke something. If we have a test that sometimes fails then try to fix it or try to catch the condition under that it is failing and let it pass so that we can see if there is a difference in the failure. \n\n..but our 'steady state' needs to be BUILD SUCCESSFUL.\nI could not agree more "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13912902",
            "date": "2014-02-26T13:48:14+0000",
            "content": "It's alright Robert. I agree that our steady state builds need to pass and we shouldn't release another version this way again. Things have got worse lately due to the SSL related timeout problems but there are other issues as well. I'll also try to figure out some of these failures. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13912917",
            "date": "2014-02-26T13:58:36+0000",
            "content": "FYI: If you want to fix those tests, you can use -Dtests.badapples=true to run them. This is why Robert used this annotation instead of @Ignore. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13912930",
            "date": "2014-02-26T14:02:03+0000",
            "content": "I would actually like to enable solr tests for the smoketester as well. I think its really bad this is disabled, as there could be a bad problem in a release candidate and only manual verification really finds it. Lots of people smoketest on different machines and platforms and I think this has value.\n\nI know this all sounds like a high bar, but I think if we stay on top of this, it will make it much easier on everyone. In this case it really is just a few bad apples to fix! "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912934",
            "date": "2014-02-26T14:03:52+0000",
            "content": "Commit 1572054 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1572054 ]\n\nSOLR-5775: enable solr tests in the smoketester "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912936",
            "date": "2014-02-26T14:04:31+0000",
            "content": "Commit 1572055 from Robert Muir in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1572055 ]\n\nSOLR-5775: enable solr tests in the smoketester "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912937",
            "date": "2014-02-26T14:05:16+0000",
            "content": "Commit 1572056 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1572056 ]\n\nSOLR-5775: fix outdated comment "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13912940",
            "date": "2014-02-26T14:06:27+0000",
            "content": "Commit 1572058 from Robert Muir in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1572058 ]\n\nSOLR-5775: remove outdated comment, also enable java6 tests "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913033",
            "date": "2014-02-26T15:42:23+0000",
            "content": "\nCurrently, solr tests are failing 90%+ of the time. We've been through this before many times, the argument is always that someone is looking at the failures and knows which ones are bad.\nThis argument is a lie. Nobody is watching these failures, or DistributedQueryComponentOptimizationTest would not have failed repeatedly for two straight days when the fix was trivial (I fixed this last night: http://svn.apache.org/r1571930)\n\n\n\nI made an argument like that for release - because it's true. I read every email that comes in. The argument was that I had a handle on where things were for a release, not that I could personally jump on any failure right away. Everybody that works on Solr should help jump in if they are concerned.\n\nAnyway, I have not looked yet, but depending on what test coverage is lost, I would -1 the change.\n\nIf the fix was trivial, why didn't you just fix it? Who was supposed to fix it instead of you? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913037",
            "date": "2014-02-26T15:43:30+0000",
            "content": "If the fix was trivial, why didn't you just fix it? Who was supposed to fix it instead of you?\n\nThat's not a real question by the way - I know you did fix it.  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13913112",
            "date": "2014-02-26T16:35:23+0000",
            "content": "I dont think any test coverage is lost. In an open source project, if nobody can reliably tell if a test failure is \"ok\" or not (except maybe a few people), then the test coverage is 0%. Furthermore, lucene's coverage is suffering because of these bad apples: the recent javadocs failures are not really recent at all, its just that jenkins was failing so much in solr tests that it never got that far.\n\nWhen a test fails consistently: I think it needs to be disabled. I can't safely commit anything to the solr codebase because the tests fail every time on my machine: and I know its not unique to me, jenkins is completely red. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913117",
            "date": "2014-02-26T16:39:01+0000",
            "content": "Almost none of these even had a JIRA issue. -1 on a wholesale JIRA to ignore whatever tests one person want's to canvas. A failing test should get a JIRA issue that describes the fail and each addressed individually.\n\n\nthe fact that 'ant test' has not worked for me locally in months was enough for me to raise the issue.\n\n\n\nYou should have simply raised that months ago by filing a JIRA issue for each of the tests that were preventing you from getting a clean run, or emailing the list and saying I can't get a clean run, or whatever. I don't think it's okay if a dev cannot get a clean run, but devs have to communicate that - it's different for everyone. I've gotten clean runs 90% of the time for months. Then we could have worked on the issue. Considering most of the current fails are around slow tests under SSL, if you had brought it up months ago, sounds like it only would have been a test or two to look at. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913120",
            "date": "2014-02-26T16:40:50+0000",
            "content": "I can't safely commit anything to the solr codebase because the tests fail every time on my machine:\n\nIgnoring the test with your head or code is the same - just as not safe in both cases. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13913121",
            "date": "2014-02-26T16:41:26+0000",
            "content": "I read every email that comes in. \n\nI really appreciate all the hard work you put into the tests, Mark, but this is not a scalable way to run an open source project.\n\nPrecious few people can look at a Solr test failure and \"know\" that this failure is OK and that other one is not, nor that it's OK to release / it isn't, etc.\n\nNew contributors trying out a change and running tests will see these failures and not know whether their changed caused them or not.\n\nMaybe you derive some value / progress out of seeing all these bad apple test failures, but net/net I think it's doing far more damage to the project than helping it. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13913122",
            "date": "2014-02-26T16:41:29+0000",
            "content": "I don't think the onus is on me here: Its on the committer not to break the build.\n\nAs I said, jenkins is completely red. Its not my machine. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913126",
            "date": "2014-02-26T16:44:28+0000",
            "content": "\nPrecious few people can look at a Solr test failure and \"know\" that this failure is OK and that other one is not, nor that it's OK to release / it isn't, etc.\n\n\n\nDisabling tests does nothing to address that. It's like closing your eyes and saying \"everythings okay\". If those tests didn't run, it would be silly to release. We could have no confidence in the system.\n\nIf someone is concerned, they should help with the tests. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13913134",
            "date": "2014-02-26T16:49:42+0000",
            "content": "Disabling the 6 or 7 bad apples so that we have a reliable test suite that passes is a definite improvement. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913147",
            "date": "2014-02-26T16:56:02+0000",
            "content": "Not really - it's mostly just hiding a problem that you fixed when made suppress SSL work properly. That was the correct solution.\n\nI would have gotten around to it sooner, but I've been sick and catching up on work. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13913149",
            "date": "2014-02-26T16:57:08+0000",
            "content": "\nPrecious few people can look at a Solr test failure and \"know\" that this failure is OK and that other one is not, nor that it's OK to release / it isn't, etc.\n\nDisabling tests does nothing to address that. It's like closing your eyes and saying \"everythings okay\". If those tests didn't run, it would be silly to release. We could have no confidence in the system.\n\nWell, at release time, the RM could run all the bad apple tests, have you look at those failures, and then you decide if they are the \"OK bad apple failures\" or not?\n\nAgain, this is a poor way to run an open source project (that only Mark can say that failure is OK and that other one is not), but it would at least still be progress over what we now have.\n\nIf someone is concerned, they should help with the tests.\n\nIf someone is concerned, they should help out in whatever way they are able, including what Rob did here: it is progress if we all can trust Solr's test suite.  Then, if a failure does occur, we know it's a \"real\" failure and not a \"bad apple failure that only Mark can look at to decide if it's real or not\". "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913163",
            "date": "2014-02-26T17:04:15+0000",
            "content": "I'm certainly not the only one that knows. Not many others that look at Solr tests and know Solr well are vocal is all. People that only focus on Lucene or sub sections of Solr of course will have a harder time. Or people that don't follow JIRA and the commit mail list.\n\nRunning some tests only at release is a terrible idea. It will be almost impossible to track down what caused a problem without faster feedback.\n\nIt's not that I am the only one that can say if a failure is real or not - I simply appear to be the only one interested in looking closely. It's not rocket science.\n\nReal help is important, not lazy help. These are not hard problems, they just take time and I have very little assistance. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13913176",
            "date": "2014-02-26T17:11:13+0000",
            "content": "I propose that we use @BadApples for the tests that fail \"too frequently\" right now, that we have a JIRA issue for each bad-apple separately, and furthermore that after \"ant test\" returns SUCCESSFUL, that it give a line by line listing of @BadApples that were not executed, along with a one-liner instruction on how to run just those tests. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13913183",
            "date": "2014-02-26T17:16:05+0000",
            "content": "Mark Miller: What is the problem with leaving the tests marked as @BadApples like Robert did? You can still run them, by giving the extra sysprop -Dtests.badapples=true. I agree with Robert and Mike and many others here, that running the tests and failing all builds is not a good idea. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913199",
            "date": "2014-02-26T17:29:01+0000",
            "content": "Uwe Schindler - can you do me a favor and run the tests locally and tell me which fail? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13913207",
            "date": "2014-02-26T17:36:41+0000",
            "content": "In Windows? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913214",
            "date": "2014-02-26T17:44:27+0000",
            "content": "On any machine you have...just tell me which tests won't currently pass for you. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13913232",
            "date": "2014-02-26T17:54:02+0000",
            "content": "First run:\n\n\torg.apache.solr.cloud.ShardSplitTest.testDistribSearch\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913237",
            "date": "2014-02-26T17:59:36+0000",
            "content": "Thanks - yeah, that's a somewhat infrequent fail for everyone. Robert did not bad apple it.\n\nI can't recall if there is a JIRA issue for it. Probably not something I can easily help with because I don't know the shard split code at all yet.\n\nLet me know if you see any others. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13913272",
            "date": "2014-02-26T18:26:53+0000",
            "content": "My first run passed!\n\nBut second run:\n\n   [junit4]   2> NOTE: reproduce with: ant test  -Dtestcase=OverseerRolesTest -Dtests.method=testDistribSearch -Dtests.seed=4C3C1DD55A3EC277 -Dtests.slow=true -Dtests.locale=el_CY -Dtests.timezone=PRT -Dtests.file.encoding=UTF-8\n   [junit4] ERROR    197s J1 | OverseerRolesTest.testDistribSearch <<<\n   [junit4]    > Throwable #1: com.carrotsearch.randomizedtesting.UncaughtExceptionError: Captured an uncaught exception in thread: Thread[id=1018, name=Overseer-91320293463687174-127.0.0.1:39402_-n_0000000007, state=RUNNABLE, group=Overseer collection creation process.]\n   [junit4]    > \tat __randomizedtesting.SeedInfo.seed([4C3C1DD55A3EC277:CDDA93CD2D61A24B]:0)\n   [junit4]    > Caused by: org.apache.solr.common.cloud.ZooKeeperException: \n   [junit4]    > \tat __randomizedtesting.SeedInfo.seed([4C3C1DD55A3EC277]:0)\n   [junit4]    > \tat org.apache.solr.cloud.OverseerCollectionProcessor.run(OverseerCollectionProcessor.java:213)\n   [junit4]    > \tat java.lang.Thread.run(Thread.java:724)\n   [junit4]    > Caused by: org.apache.zookeeper.KeeperException$NoNodeException: KeeperErrorCode = NoNode for /overseer/collection-queue-work/qn-0000000004\n   [junit4]    > \tat org.apache.zookeeper.KeeperException.create(KeeperException.java:111)\n   [junit4]    > \tat org.apache.zookeeper.KeeperException.create(KeeperException.java:51)\n   [junit4]    > \tat org.apache.zookeeper.ZooKeeper.getData(ZooKeeper.java:1151)\n   [junit4]    > \tat org.apache.solr.common.cloud.SolrZkClient$7.execute(SolrZkClient.java:274)\n   [junit4]    > \tat org.apache.solr.common.cloud.SolrZkClient$7.execute(SolrZkClient.java:271)\n   [junit4]    > \tat org.apache.solr.common.cloud.ZkCmdExecutor.retryOperation(ZkCmdExecutor.java:73)\n   [junit4]    > \tat org.apache.solr.common.cloud.SolrZkClient.getData(SolrZkClient.java:271)\n   [junit4]    > \tat org.apache.solr.cloud.DistributedQueue.remove(DistributedQueue.java:192)\n   [junit4]    > \tat org.apache.solr.cloud.OverseerCollectionProcessor.run(OverseerCollectionProcessor.java:204)\n   [junit4]    > \t... 1 more\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13913286",
            "date": "2014-02-26T18:37:46+0000",
            "content": "org.apache.solr.cloud.ShardSplitTest.testDistribSearch\n\nThere is SOLR-5309 which has been on my plate for quite some time. It is really hard to reproduce but I have an idea about why it happens but I haven't been able to get to the root cause yet. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913288",
            "date": "2014-02-26T18:38:54+0000",
            "content": "\nMy first run passed!\nBut second run:\n\n\n\nHmm, I though Robert had bad appled that one. Must have been the other Overseer test.\n\nWhat you are seeing is two Overseers running at the same time. I'm not happy at all with that implementation.\n\nWhat you are seeing is not a flakey test but a flakey implementation. SOLR-5476. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13913324",
            "date": "2014-02-26T19:00:31+0000",
            "content": "For me the other Overseer test failed in a recent run:\n\n\torg.apache.solr.cloud.OverseerTest.testOverseerFailure\n\n\n\nUp to now, I had only one successful run! "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913350",
            "date": "2014-02-26T19:12:15+0000",
            "content": "That might be SOLR-5596? Depends on the fail. To note: this is also not one that Robert badappled. It does fail occasionally - I've recently been trying to raise some polls in it, but it's hard to tell if its that, or the mock implementations, or the real deal. It's been on my list to dig into, but has not gotten any priority yet.\n\nSami did all the original work on the Overseer and these tests and I guess I've kind of inherited them but I'm still not fully up to speed on them. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913696",
            "date": "2014-02-26T23:11:49+0000",
            "content": "Anyone following - reporting your failing tests would be useful.\n\nI'm certainly open to @BadApple depending on the test.\n\nSome of them need to be fixed instead - the loss of coverage is easily worse than infrequent failing tests that can probably be addressed.\n\nSome of them, like the ShardSplitTest that is usually infrequent these days, should probably print out the JIRA issue in the fail.\n\nI'm happy to discuss each of them and take some course of action individually. If people want to contribute towards that great, and thanks to everyone that has so far, but I can't allow wholesale disabling of tests.\n\nThe ones Robert was looking at were not these infrequent fails though - they were more common fails due to both the performance of SSL and a bug in disabling it for tests. They are not really in the same category and those issues have working workarounds now.\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13913714",
            "date": "2014-02-26T23:19:41+0000",
            "content": "They are not really in the same category and those issues\n\nThe exception being: SOLR-5735. That could be a nasty issue and needs investigation asap. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-16420068",
            "date": "2018-03-30T02:09:56+0000",
            "content": "Resolving in favor of modern efforts at SOLR-12037 (née SOLR-12016) and SOLR-12028. "
        }
    ]
}