{
    "id": "SOLR-6865",
    "title": "Upgrade HttpClient to 4.4.1",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [
            "5.2",
            "6.0"
        ],
        "affect_versions": "5.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "HttpClient 4.4 has been released.  5.0 seems like a good time to upgrade.",
    "attachments": {
        "SOLR-6865.patch": "https://issues.apache.org/jira/secure/attachment/12696861/SOLR-6865.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-18T14:30:44+0000",
            "author": "Shawn Heisey",
            "content": "It will take me a couple of days to do the required testing to see if any code changes are required.  If anyone else wants to swipe this issue, feel free. ",
            "id": "comment-14251694"
        },
        {
            "date": "2014-12-19T03:08:42+0000",
            "author": "Shawn Heisey",
            "content": "I was wondering whether we should mention HttpClient in the \"Versions of Major Components\" section for each release.  It is a critical component of SolrCloud and SolrJ. ",
            "id": "comment-14252842"
        },
        {
            "date": "2014-12-19T03:55:59+0000",
            "author": "Shawn Heisey",
            "content": "The new HC version is not yet pushed to the maven repo that ivy is querying.  Based on the response I got when I asked about it on the mailing list, I suspect that they are not checking for mirror penetration before releases are announced. ",
            "id": "comment-14252881"
        },
        {
            "date": "2014-12-19T05:06:59+0000",
            "author": "Shawn Heisey",
            "content": "I can see the 4.4 version on the central maven repository ... is it normal for ivy to only try the uk mirror and not try any other mirrors?  I'm in the US, so I was surprised to see it going to uk.maven.org at all.\n\nI seem to recall with other jars that ivy would try multiple mirrors before failing, but that doesn't seem to be happening for httpclient. ",
            "id": "comment-14252949"
        },
        {
            "date": "2014-12-19T05:51:37+0000",
            "author": "Shawn Heisey",
            "content": "Looks like I was wrong about it being on maven central.  Only httpcore-4.4.jar is there, and that's on the uk mirror as well.  The other two jars we need for 4.4 are not present on either central or uk. ",
            "id": "comment-14253002"
        },
        {
            "date": "2014-12-19T05:53:02+0000",
            "author": "Shawn Heisey",
            "content": "It is trying other mirrors.  No idea how I missed that when I reviewed the output before. ",
            "id": "comment-14253003"
        },
        {
            "date": "2014-12-19T15:32:59+0000",
            "author": "Shawn Heisey",
            "content": "I misread the HC release announcement.  It's a new release of httpcore, not the entire httpcomponents suite.  I'll just leave this open and try the upgrade once the full release is made. ",
            "id": "comment-14253539"
        },
        {
            "date": "2015-02-05T17:34:59+0000",
            "author": "Shawn Heisey",
            "content": "The full release is official now, early indications are that all tests will pass on 5x. ",
            "id": "comment-14307618"
        },
        {
            "date": "2015-02-05T21:01:26+0000",
            "author": "Shawn Heisey",
            "content": "This patch passes all tests in branch_5x.  It almost passes precommit, but the failure is unrelated to this issue, and can be fixed by adding javadoc to one method. ",
            "id": "comment-14307989"
        },
        {
            "date": "2015-02-05T22:18:01+0000",
            "author": "Shawn Heisey",
            "content": "The javadoc problem was noticed and corrected by its author, so my patch is ready. ",
            "id": "comment-14308106"
        },
        {
            "date": "2015-02-12T23:10:16+0000",
            "author": "Shawn Heisey",
            "content": "After thinking about this, I think it might be a good idea to wait for 4.4.1 to be released, and monitor the httpclient mailing list for a week or so, before upgrading.  I think that's the best way to assure stability for this important component.\n\nIf a serious problem in the current 4.3 release crops up that's fixed in 4.4, I can do the upgrade immediately. ",
            "id": "comment-14319197"
        },
        {
            "date": "2015-03-20T18:35:14+0000",
            "author": "Shawn Heisey",
            "content": "The httpcore module has advanced to 4.4.1, asking on the HC list to find out if any of the other modules will see a 4.4.1 release. ",
            "id": "comment-14371814"
        },
        {
            "date": "2015-03-21T10:25:28+0000",
            "author": "Oleg Kalnichevski",
            "content": "Yes, they will. I am going to put HttpClient 4.4.1 on vote next week.\n\nOleg ",
            "id": "comment-14372642"
        },
        {
            "date": "2015-03-21T11:15:11+0000",
            "author": "Karl Wright",
            "content": "Have the deprecation warnings been cleaned up in Solr 5.0?  When I looked at it last, there were significant structural issues with making those warnings go away because of the builder-style httpclient 4.3 paradigm.  I believe 4.4 makes the deprecated code go away entirely. ",
            "id": "comment-14372683"
        },
        {
            "date": "2015-03-21T17:10:58+0000",
            "author": "Shawn Heisey",
            "content": "SOLR-5604 is the issue where I talk about deprecations in HC.\n\nI have already tried the HttpClient 4.4 upgrade in Solr without any new test failures, and I'm using HC 4.4 in my own SolrJ code, so I know they have not removed the deprecated methods.  I am confident that HC uses the same deprecation policy that we do, which indicates that the deprecated code will not be removed until HC 5.0.\n\nAs I indicated on SOLR-5604, It looks like HC is slowly gearing up for a 5.0-alpha release, though I cannot tell how quickly those plans are proceeding.  Perhaps Oleg Kalnichevski can fill in the blanks. ",
            "id": "comment-14372903"
        },
        {
            "date": "2015-03-22T15:45:56+0000",
            "author": "Oleg Kalnichevski",
            "content": "Shawn et al\nHC 5.0 was initially going to be 4.x sans all deprecated stuff plus changes required for compliance with RFC 7230 and related specs. With such scope HC 5.0 was likely to stabilize in a fairly short period of time. Now that the scope has been expanded to include partial support for HTTP/2 HC 5.0 development will take significantly longer. It will be at least a year before HC 5.0 is anywhere near a GA release.    ",
            "id": "comment-14375027"
        },
        {
            "date": "2015-04-03T03:02:29+0000",
            "author": "Shawn Heisey",
            "content": "I plan on committing to 5x and trunk tonight.  I will leave the 5.1 branch alone. ",
            "id": "comment-14393996"
        },
        {
            "date": "2015-04-03T12:52:45+0000",
            "author": "Shawn Heisey",
            "content": "New patch.  Committing after verifying tests and precommit. ",
            "id": "comment-14394375"
        },
        {
            "date": "2015-04-03T12:57:25+0000",
            "author": "Shawn Heisey",
            "content": "I needed to add 'svn:eol-style native' on the new hash files.  Not in patch, but it will be in the commit.  Shouldn't jar-checksums do that for us automatically? ",
            "id": "comment-14394382"
        },
        {
            "date": "2015-04-03T13:01:43+0000",
            "author": "Shawn Heisey",
            "content": "Now that I think about it, jar-checksums didn't touch svn at all, I had to do that.  I think the local SVN install can be configured to automatically use certain properties for configured extensions, but can an SVN checkout be configured with such settings so the user doesn't have to do it locally? ",
            "id": "comment-14394385"
        },
        {
            "date": "2015-04-03T15:10:03+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1671085 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1671085 ]\n\nSOLR-6865: Upgrade HttpClient/Core/Mime to 4.4.1. ",
            "id": "comment-14394541"
        },
        {
            "date": "2015-04-03T15:37:46+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1671092 from Shawn Heisey in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1671092 ]\n\nSOLR-6865: Upgrade HttpClient/Core/Mime to 4.4.1. (merge trunk r1671085) ",
            "id": "comment-14394578"
        },
        {
            "date": "2015-04-03T16:41:54+0000",
            "author": "Shawn Heisey",
            "content": "Tests and precommit passed on trunk before that change was committed.\n\nPrecommit passed on 5x before that change was committed.  Tests passed successfully shortly after the commit. ",
            "id": "comment-14394664"
        },
        {
            "date": "2015-06-15T21:44:19+0000",
            "author": "Anshum Gupta",
            "content": "Bulk close for 5.2.0. ",
            "id": "comment-14586905"
        }
    ]
}