{
    "id": "SOLR-3259",
    "title": "Solr 4 aesthetics",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Solr 4 will be a huge new release... we should take this opportunity to improve the out-of-the-box experience.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13233402",
            "date": "2012-03-20T13:38:03+0000",
            "content": "Some ideas:\n\n\tour fieldType list has grown huge... we should probably move the field list to the top of the file where it's easier to find\n\tthe preference for JSON over XML seems to be continuing - we should make things more JSON oriented by adding a /query handler that defaults to wt=json and perhaps indent=true\n\tthe concept of an \"example\" server that you must configure yourself has become less than ideal... perhaps we should just create a \"server\" directory (but leave things like exampledocs under example)\n\tsome new JSON based example docs that aren't based on electronics from '05  (or as an alternative for certain \"quickstart\" guides, start off with a curl command to add some data rather than trying to shove it all in exampledocs)\n\n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13233414",
            "date": "2012-03-20T14:05:47+0000",
            "content": "+1 to the general idea of lifting the first-time experience of Solr. I like all your proposals except...\n\nI'm not sure if we gain much by moving the example to a \"server\" folder. I think it's a Good Thing™ that we make it clear that what's provided is just an example, not for production. Another name for the example folder could be \"jetty\", because that's what it really is - which many are confused by today, they think that the \"lib\" and \"etc\" folders below \"example\" belong to Solr...\n\nIf anything I'd vote for making the distro closer to what people would want in production. You could then have a pure \"solr/jetty\" folder with ONLY jetty, a \"solr/example-home\" folder which holds todays \"example/solr\" making it more obvious what folder is actually the SOLR_HOME, and finally a start script on top level, start-solr.[cmd|sh], which copies the war from dist to jetty/webapps, sets -Dsolr.solr.home and starts Jetty. By default start-solr.sh would log to stdout, but a param could have it log to file. "
        },
        {
            "author": "Upayavira",
            "id": "comment-13233542",
            "date": "2012-03-20T16:38:24+0000",
            "content": "If you're going to have a jetty directory, it'd be pretty easy to have a 'tomcat' one also. The use would have to download and unpack Tomcat, point CATALINA_HOME at the Tomcat distribution, and CATALINA_BASE to this new 'tomcat' directory, and then they'd have a running Solr in Tomcat.\n\nJust a thought. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13233611",
            "date": "2012-03-20T17:48:29+0000",
            "content": "+1 to changing the \"example\" directory name to something like \"server\".  I realize I lost my argument in SOLR-2586. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13233629",
            "date": "2012-03-20T17:59:08+0000",
            "content": "Would also be nice to remove the \"multicore\" directory in there (since the normal server is already multi-core enabled).  Of course if we moved just the essential parts to \"server\", then \"multicore\", \"example-DIH\" and \"exampledocs\" would all be left behind in \"example\", as they should be. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13233686",
            "date": "2012-03-20T19:41:39+0000",
            "content": "Would also be nice to remove the \"multicore\" directory in there\n\nI have an issue somewhere that does this - I'm sure its out of date, but just as a note to dig it up when this is done. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13233698",
            "date": "2012-03-20T19:47:47+0000",
            "content": "be a 'tomcat' one also. \nNot a fan of supporting another web container out of hte box.\n\nthat we make it clear that what's provided is just an example,\n\nYou can make this clear in other ways - the folder name is a blunt for this. Most people end up using the example as there base anyhow - I doubt it has much benefit in pointing people to trim down their configs. This whole idea of providing a webapp and then an example setup is just old and ugly. We should care about one containter, the one we ship with, and our default shipping configs should be a good enough starting point that we don't have to call the folder \"please_you_must_edit_configs_and_not_start_me_out_of_the_box\"\n\njetty\n\nNot a fan - I think non Java guys should be able to open the package and quickly see the folder they need to move to. jetty is not great here - server is better. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234012",
            "date": "2012-03-21T01:24:20+0000",
            "content": "the concept of an \"example\" server that you must configure yourself has become less than ideal... perhaps we should just create a \"server\" directory (but leave things like exampledocs under example)\nWould also be nice to remove the \"multicore\" directory in there (since the normal server is already multi-core enabled). Of course if we moved just the essential parts to \"server\", then \"multicore\", \"example-DIH\" and \"exampledocs\" would all be left behind in \"example\", as they should be.\n\nonce upon a time, i argued heavily that we should renamed \"example\" to \"examples\" and have many more of them (\"minimal\", \"tech-products-from-the-90s\", \"books\", \"kitchen-sink\", \"multicore\", \"dih\", etc...) .. and the only reason i never pushed harder for this was because that kind of directory structure would have made running the \"main\" example (whatever we might have called it) much harder then \"java -jar start.jar\" because it would have required specifying solr.solr.home.\n\nThinking about it some more now that you've brought this issue up, it occurs to me that in that intervening time, multicore solr setups have been come the norm, not the exception ... so i'm now much more on board the idea of having a single example setup – even calling it \"server\" if people think that's a good idea – provided we move all of the various examples we have into that example setup as multiple cores.\n\nthey don't have to all be enabled, they don't even have to be commented out in solr.xml, it would just be nice if they lived in the same directory and could easily be added as new cores with a simple CREATE commands a relative paths.\n\nSo by default if you did \"cd server && java -jar start.jar\" you might only get one collection (or maybe two if we also want to show off a \"minimal\" collection) but the docs for features like DIH might say \"to see an example of this, hit the following URL to create a new collection using the DIH configs: http://localhost...CREATE\"\n\nIf anything I'd vote for making the distro closer to what people would want in production. You could then have a pure \"solr/jetty\" folder with ONLY jetty, a \"solr/example-home\" folder which holds todays \"example/solr\" ... start-solr.[cmd|sh], which copies the war from dist to jetty/webapps, sets -Dsolr.solr.home and starts Jetty\n\nwhile i like the idea of creating clearer/cleaner separation between what files are \"jetty\" and what files are \"solr\" and what files are \"config\" i'm not a fan of your specific suggestions here because it moves away from the really clean simplicity of \"cd something && java -jar start.jar\" – which make it really trivial for anyone anywhere to try solr out regardless of their os, or what weird eccentricities are in their shell, or whether the file perms on some scripts are correct, etc...\n\nif we want to start shipping init.d scripts and what not for \"production usage\" (something we typically avoided in the past because there are so many different ways people like to do these things, not to mention that many people like to use tomcat or some other servlet container) then that seems like it could/should really be distinct from how people run the example for the tutorial ... it shouldn't be completely orthogonal, we should be able to say something like: \"if you copy this ./server/ directory to some place on your production server, this directory of ./service-tools/ can be used to automatically start/stop when your machine comes up or down, just configure the path where you copied ./server/\" ... but people shouldn't have to use some start.sh just to try out the tutorial not compared to how easy \"java -jar start.jar\" is today. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13234283",
            "date": "2012-03-21T11:19:03+0000",
            "content": "bq:   that kind of directory structure would have made running the \"main\" example (whatever we might have called it) much harder then \"java -jar start.jar\" because it would have required specifying solr.solr.home.\n\nAnd I totally agree that the less frustrating we make startup for a new person the better. Could we solve it by providing some number of startup scripts? Each is stupid-simple \"java -Dsolr.solr.home=blahblah -jar start.jar\". Or even a shell script that took a parameter that defaulted to a simple, single core.... "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13234290",
            "date": "2012-03-21T11:38:54+0000",
            "content": "And I totally agree that the less frustrating we make startup for a new person the better. Could we solve it by providing some number of startup scripts? Each is stupid-simple \"java -Dsolr.solr.home=blahblah -jar start.jar\". Or even a shell script that took a parameter that defaulted to a simple, single core....\n\nWe kinda already have this, powered by \"ant run-example\", you can -D control/override any of these, even turning on debug with -Dexample.debug=true\n\n\n    <property name=\"example.solr.home\" location=\"example/solr\"/>\n    <property name=\"example.data.dir\" location=\"example/solr/data\"/>\n    <property name=\"example.debug.suspend\" value=\"n\"/>\n    <property name=\"example.jetty.port\" value=\"8983\"/>\n    <condition property=\"example.jvm.line\" value=\"-Xdebug -Xrunjdwp:transport=dt_socket,server=y,suspend=${example.debug.suspend},address=5005\">\n      <isset property=\"example.debug\"/>\n    </condition>\n    <property name=\"example.jvm.line\" value=\"\"/>\n    <property name=\"example.heap.size\" value=\"512M\"/>\n\n\n\nGranted this is Ant and carries with it a dependency to be installed, so not the not quite what Erick is asking for in end user ease of experience.  But the Ant run-example capability is the basic idea of what should be controllable at a minimum.   "
        },
        {
            "author": "David Smiley",
            "id": "comment-13296111",
            "date": "2012-06-16T05:26:16+0000",
            "content": "I noticed Yonik's commit to schema.xml to move the fields ahead of the type definitions.  I like it!  But while you're at it, isn't this a good time to finally fix the indentation?  The first indentation level in the types section is only one space yet the rest on these lines are two – it should be two throughout for all configuration files.  I recommend a complete re-indentation of the file by an IDE to clean it up, and hand-tweak as necessary. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13413714",
            "date": "2012-07-13T13:22:59+0000",
            "content": "Could we solve it by providing some number of startup scripts? \n\nErick, see SOLR-3617  I want to do just that. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13413717",
            "date": "2012-07-13T13:25:21+0000",
            "content": "I've created SOLR-3619 for the 'example' rename. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717380",
            "date": "2013-07-23T18:48:03+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971006",
            "date": "2014-04-16T12:56:52+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14091979",
            "date": "2014-08-10T02:49:51+0000",
            "content": "Tangentially, but related. "
        },
        {
            "author": "Upayavira",
            "id": "comment-14650542",
            "date": "2015-08-01T21:27:39+0000",
            "content": "I'd argue that this ticket has been entirely handled or made redundant. Can we close? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14650569",
            "date": "2015-08-02T01:08:05+0000",
            "content": "Yeah, let's move all the rest of the discussion to new UI-related JIRAs "
        }
    ]
}