{
    "id": "SOLR-11558",
    "title": "It would be nice if the Graph section of the Cloud tab in the Admin UI could give some more information about the replicas of a collection",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Right now it lists the nodes where they are hosted, the state and if they are or not leader. I usually find the need to see more, like the replica and core names and the replica type, and I find myself moving between this view and the “tree” view. \nI thought about two options:\n\n\tA mouse over action that lists the additional information (after some time of holding the mouse pointer on top of the replica)\n\tModify the click action to display this information (right now the click sends you to the admin UI of that particular replica)\n\n\n\nThe same could be done to display some extra information of the shard (like active/inactive, routing range) and the collection (autoAddReplicas, maxShardsPerNode, configset, etc)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-15T16:48:35+0000",
            "content": "Erick Erickson   I will be happy to work on this in the near future.  ",
            "author": "Kevin Cowan",
            "id": "comment-16514079"
        },
        {
            "date": "2018-06-15T16:56:01+0000",
            "content": "Sounds good, let me know when you have something since I'm js/UI-challenged \n\nLooking at this a little, note Varun's comments on SOLR-11578, mainly that we don't really need to repeat redundant stuff. I.e. when you mouse over a replica you know already whether it's a leader or active etc. I don't have strong feelings about whether we should display more or not though so whatever you think appropriate and we can debate \n\nI think it makes sense to put things like shard ranges in a shard tooltip and collection-level stuff over the collection, but again whatever you think is easiest to use.\n ",
            "author": "Erick Erickson",
            "id": "comment-16514092"
        }
    ]
}