{
    "id": "SOLR-6110",
    "title": "DIH increase tcp connections so full-import failed",
    "details": {
        "affect_versions": "4.7.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Before i used solr 4.3.1 and i had no problem. Since i use solr 4.7.2 i have a problem with the DIH.\nWhen i do a full import with DIH the number of TCP connection increase.\nFor example i have 240000 documents to index and the full-import stop randomly between 6000 and 9000 docs indexed with the error :\ncom.mysql.jdbc.exceptions.jdbc4.CommunicationsException: Communications link failure\n\nWith the command (while full-import is running) :\nnetstat | grep localdo\n\nI saw that there are many connections in status \"TIME_WAIT\"\nThe problem is that the OS don't free those connections quickly. So the tcp connections queue increase to its limit and crash ---> full-import failed.\n\nTo solve this problem i found a solution :\nIf i change OS settings \"/proc/sys/net/ipv4/tcp_tw_reuse\" to 1 and \"/proc/sys/net/ipv4/tcp_tw_recycle\" to 1 my full-import works to the end.\n\nSo why connections are not closed in this new version ?\nAnd why the java socket option SO_REUSEADDR is not used ?\n\nI'm not a Java developer so maybe i miss something but the only way for me to do a success full-import was to use the solution above.\n\nThank you by advance for your answers to help me solve this problem with a better solution than mine.\n\nThomas",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mikhail Khludnev",
            "id": "comment-14006340",
            "date": "2014-05-22T19:07:11+0000",
            "content": "\n\tI can't imagine if anything is changed in DIH recently, it seems really strange to me\n\tfor me it seems like it open and closes jdbc connections, it's also strange and can happen only if you use something like ... WHERE P_ID=\n{p.ID}\n\tgiving all of this I propose to configure jdbc datasource in your container (luckily solr is j2ee...), and refer to it via jndi as it described an DIH wiki\n\tit doesn't seem like a jira, please close it and post the question to the mailing list\n\n\n\noh'my.. you never know.. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14006348",
            "date": "2014-05-22T19:12:31+0000",
            "content": "This is a duplicate of SOLR-5954 which was fixed with Solr 4.8.0 "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14006952",
            "date": "2014-05-23T07:42:37+0000",
            "content": "Resolving as a duplicate.\n\nIf we ever release 4.7.3 then we'll back-port this fix. But for now it is best to upgrade to 4.8. "
        }
    ]
}