{
    "id": "SOLR-3404",
    "title": "solr in websphere",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Wish",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Hi, \n      I am trying to integrate solr in websphere , which I am able to do with SOLR_HOME in an external filesystem directory but my requirement is to make solr_home as part of the EAR file which I need to deploy. Though I have kept the solr/conf ... folder in my classpath I am not able to set solr home as a system property which will point to the files in ear..Has anyone tried this? Any direction to configure solr home as part of ear will be helpful. \n\nSainik",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-13421431",
            "date": "2012-07-24T14:04:07+0000",
            "content": "Removing this as a \"blocker\".  This is really a documentation issue, so once someone has some advice on this it'd be good to create a SolrWebsphere wiki page with the tips and tricks. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13421920",
            "date": "2012-07-25T01:21:51+0000",
            "content": "Well, I guess you only want to have the configuration loaded from EAR, since it would be funny to try to put the index there (SOLR_HOME/core/data/index). Also, note that solr.xml is updated live on the file system, so it could likely not either be there.\n\nPerhaps you could work around this requirement by storing your config in ZooKeeper instead? When starting Solr in SolrCloud/ZK mode it reads all config from ZK instead of local file system, so you won't need to keep your config locally on each node. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14576497",
            "date": "2015-06-07T23:21:47+0000",
            "content": "Solr is no longer supporting being deployed into arbitrary web containers. "
        }
    ]
}