{
    "id": "SOLR-1829",
    "title": "Cleaned up analysis.jsp - removed all token API scriptlets",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "4.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "The analysis.jsp was polluted with the old token stream api in scriptlets all over the place. Since the introduction of the FieldAnalysisRequestHandler, there's no need to keep this mess. Instead, the page can just call the analysis request handler and with parameter generated by the form and display the xml response the same way as it is displayed at the moment. Moreover, it will save some work when updating the code base to the new token stream API.",
    "attachments": {
        "SOLR-1829.patch": "https://issues.apache.org/jira/secure/attachment/12439075/SOLR-1829.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Uri Boness",
            "id": "comment-12846584",
            "date": "2010-03-17T21:02:58+0000",
            "content": "this patch uses jquery to generate the proper requests to the field analysis request handler, then applies xsl transformation on the response to render it appropriately. It also updates the jquery version to 1.4.2. \n\nThe UI is slightly different for simplicity, but also a bit enhanced. Now when choosing to analyze by field type/name, a drop down with all possible types/names will be populated.\n\nIn order to support all functionality of the analysis.jsp, the FieldAnalysisRequestHandler & co. had to be enhanced. They now accept analysis.verbose parameter which dumps more information over the tokenizer/filter. The verbose format differs a bit from the non-verbose, but that will not break BWC as when not using this parameter, the old format is returned. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872511",
            "date": "2010-05-27T22:06:54+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043625",
            "date": "2011-06-03T16:46:10+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106280",
            "date": "2011-09-16T14:50:22+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234762",
            "date": "2012-03-21T18:09:13+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13540753",
            "date": "2012-12-29T04:04:17+0000",
            "content": "Because JSP was removed entirely from solr 4.0, analysis.jsp no longer exists.  The patch as it is now would be useless.\n\nI will admit that I don't completely understand the issue description or Uri's first comment, but I did understand the bit about a dropdown with all valid field/type values.  I suspect that the current 4.0 UI is as good as or better than what has been proposed here, in which case this issue needs closing. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13541487",
            "date": "2012-12-31T20:12:21+0000",
            "content": "marking not a problem as of 4.0 since hte JSPs were removed at that point "
        }
    ]
}