{
    "id": "SOLR-7099",
    "title": "bin/solr -cloud mode should launch a local ZK in its own process using zkcli's runzk option (instead of embedded in the first Solr process)",
    "details": {
        "components": [
            "scripts and tools",
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Embedded ZK is great for unit testing and quick examples, but as soon as someone wants to restart their cluster, embedded mode causes a lot of issues, esp. if you restart the node that embeds ZK. Of course we don't want users to have to install ZooKeeper just to get started with Solr either. \n\nThankfully, ZkCLI already includes a way to launch ZooKeeper in its own process but still within the Solr directory structure. We can hide the details and complexity of working with ZK in the bin/solr script. The solution to this should still make it very clear that this is for getting started / examples and not to be used in production.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-11T15:16:03+0000",
            "author": "Steve Rowe",
            "content": "+1\n\nMaybe also a bin/solr zk command?  It would be nice to have a Solr-based facility to be able to setup a ZK ensemble. ",
            "id": "comment-14316341"
        },
        {
            "date": "2015-02-11T16:42:56+0000",
            "author": "Hoss Man",
            "content": "i've mentioned this in the past: ideally the example mode of bin/solr will launch a single node zk server for you as needed, but will do so using a script and echo out what script command it ran.  (similar to how it echos out collection creation / health check commands)\n\nwhen you run solr in (non-example) cloud mode, it should expect zk to already be running and by this point you should either already know what you need to setup a zk quorom, or you will remember that bin/solr has a command line option to launch solr that you saw when you were running the examples ",
            "id": "comment-14316499"
        },
        {
            "date": "2015-02-11T20:10:53+0000",
            "author": "Anshum Gupta",
            "content": "About the bin/solr zk call, I think it might make sense to have a more generic name. That 1. hides the implementation detail of running zk for anyone who doesn't want/need to know. 2. Gives us the freedom to replace the configuration manager (zk) with something else, if it ever comes to that.\n\nand yes, totally +1 for this change. ",
            "id": "comment-14316895"
        },
        {
            "date": "2015-02-11T22:42:54+0000",
            "author": "Hoss Man",
            "content": "I think it might make sense to have a more generic name. That 1. hides the implementation detail of running zk for anyone who doesn't want/need to know. 2. Gives us the freedom to replace the configuration manager (zk) with something else\n\nI disagree – right now, for a high quality production installation of Solr it's very important to understand that ZooKeeper is involved, and to understand the importance of having multiple ZK nodes.  If/when we replace (or add an option to substitute something new for) ZooKeeper, then it will almost certaily still be important to understand how that new thing works and how to have it working reliably.\n\nit's one thing to add a convince option that says \"here's a simple command line to setup a single node ZK instance\" but we shouldn't hide the fact that it's zk, or that it's a single node – it should not be magic.  and if we name this command line option/script something agnostic of the fact that it's launching a zk node, then the user will only ever think of it as magic, and never understnad why they have to run it (or what the importance of having multiple \"magic\" (aka: zk) nodes configured to talk to eachother is). ",
            "id": "comment-14317133"
        },
        {
            "date": "2015-02-11T22:53:21+0000",
            "author": "Anshum Gupta",
            "content": "Sure, it was more of an idea than anything. ",
            "id": "comment-14317151"
        }
    ]
}