{
    "id": "SOLR-1000",
    "title": "DIH FileListEntityProcessor fileName filters directory names and stops recursion",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I have been trying to find out why DIH in FileListEntityProcessor mode did not appear to be recursing into subdirectories. Going through FileListEntityProcessor.java I eventually tumbled to the fact that my filename filter setting from data-config.xml also applied to directory names.\n\nNow, I feel that the fieldName filter should be applied to files fed into the parser, it should not be applied to the directory names we are recursing through. I bodged the code to adjust the behavior so that the \"FileName\" and \"excludes\" attributes of \"entity\" only apply to filenames and not directory names. It now recurses though my directory tree only indexing the appropriate files! I think the new behavior is more standard.\n\nI will submit the a patch once I have constructed one!",
    "attachments": {
        "SOLR-1000.patch": "https://issues.apache.org/jira/secure/attachment/12399279/SOLR-1000.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Fergus McMenemie",
            "id": "comment-12669650",
            "date": "2009-02-02T16:32:47+0000",
            "content": "Here is my first attempt at a patch, it seems to work OK however the testcase I added TestFileListEntityProcessor.java fails. I need somebody who knows what they are doing to point out what I am doing wrong! "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12669662",
            "date": "2009-02-02T17:30:17+0000",
            "content": "First the ClassCastException was because AbstractDataImportHandlerTest tries to read a string from the attributes map. But in this case, testRecursive put in a boolean true rather than a string to the 'recursive' attribute. That was fixed by adding string \"true\" instead of a boolean. I'll fix AbstractDataImportHandlerTest to read String.valueOf to handle these cases in the future.\n\nAfter this fix, the assert at the end of the testRecursive failed. This is because it expects to find 3 files but \"a.xml\", \"b.xml\" and \"c.props\" are in the same directory and due to the 'fileName' regex, c.props won't be picked up. I guess you meant to add c.props to another child directory inside the one you are creating? "
        },
        {
            "author": "Fergus McMenemie",
            "id": "comment-12669913",
            "date": "2009-02-03T10:07:43+0000",
            "content": "Sorted bugs in the Junit test and added a few other improvements to the test. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12670102",
            "date": "2009-02-03T20:28:43+0000",
            "content": "Thanks Fergus.\n\nOne minor thing:\n\nwhile (true) {\n      Map<String, Object> r = getNext();\n      if (r != null) r = applyTransformer(r);\n        return r;\n    }\n\n\n\nIn the new code the loop is not used at all. The difference is important because Transformers have the ability to skip documents by doing map.put(\"$skipDoc\", true) on this map. If a document is skipped, applyTransformer will return null and we'd like to request a new row from the data source (entity processor in this case). With this change, null will be returned which signals that the DataSource/EntityProcessor has run out of data even though it has not.\n\nExcept for this, the patch looks great! I'll commit this shortly. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12670104",
            "date": "2009-02-03T20:34:51+0000",
            "content": "Committed revision 740423.\n\nI reverted the change I mentioned above and I moved the issue to the DIH CHANGES.txt\n\nThanks Fergus! "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775467",
            "date": "2009-11-10T15:50:35+0000",
            "content": "Bulk close Solr 1.4 issues "
        }
    ]
}