{
    "id": "SOLR-6278",
    "title": "add admin/collections?action=DELETEREPLICA&core=... support, make collection=... and shard=... parameters optional",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "To add core=... as an alternative to replica=... way of identifying what is to be deleted, collection=... and shard=... to be optional provided the other parameters uniquely identify exactly one deletion target.",
    "attachments": {
        "SOLR-6278.patch": "https://issues.apache.org/jira/secure/attachment/12671327/SOLR-6278.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "ASF GitHub Bot",
            "id": "comment-14074301",
            "date": "2014-07-25T11:28:55+0000",
            "content": "GitHub user cpoerschke opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/71\n\n    SOLR-6278: add admin/collections?action=DELETEREPLICA&core=... support\n\n    SOLR-6278: add admin/collections?action=DELETEREPLICA&core=... support, make collection=... and shard=... parameters optional\n\n    https://issues.apache.org/jira/i#browse/SOLR-6278\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/bloomberg/lucene-solr trunk-DELETEREPICA-by-core-name\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/71.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #71\n\n\ncommit 93bb1104bff3c0d7a30d8f8e0bf2d2989f7ce79c\nAuthor: Christine Poerschke <cpoerschke@bloomberg.net>\nDate:   2014-07-09T10:39:35Z\n\n    solr: add admin/collections?action=DELETEREPLICA&core=... support, make collection=... and shard=... parameters optional\n\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14148413",
            "date": "2014-09-25T22:38:23+0000",
            "content": "I reworked this a bit, I think this is ready, going to check in the next day or two if there no objections.\n\nSee review board at: https://reviews.apache.org/r/26061/\n\nThanks Christine! "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14148447",
            "date": "2014-09-25T22:56:10+0000",
            "content": "Ideally, we should move away from anything 'core' level exposed at the public API level.\nAll calls should involve Collection/Shard/Replica instead. With this support we'd just be making it tougher to move away from how things are done right now.\n\nFrom my knowledge, the exposure of Core level details was because this is how it was made to have something up and running e.g. create a core with name collection1 to create a collection1. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14148717",
            "date": "2014-09-26T04:17:30+0000",
            "content": "Anshum Gupta So are you saying that we'll eventually just remove this altogether from the node? If we're not I don't see the harm in allowing this pattern, but if the eventual (maybe near-term?) goal is to just not have it as part of the node at all then adding this in seems like it'd make more work down the road.\n\nMark Miller and Noble Paul thoughts?\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14148868",
            "date": "2014-09-26T07:21:33+0000",
            "content": "I completely agree with Anshum Gupta . We don't want users to be exposed to a core at all. When a user is in SolrCloud mode , he should never be exposed to the concept of a core. The core is just an internal implementation detail. The smallest entity you can interact with , in a SolrCloud environment, should be a replica  "
        },
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-14148903",
            "date": "2014-09-26T08:14:23+0000",
            "content": "What's the recommended interface then for selecting all cores in a given solr home? Say I have to reclaim the space under a particular home and so want to delete all replicas. The most straightforward way I can think of is using all directories under it as core names. I could obviously look at clusterstate, buy I would still be doing the same lookup outside Solr as what this patch does.. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14148952",
            "date": "2014-09-26T09:13:21+0000",
            "content": "What's the recommended interface then for selecting all cores in a given solr home? ...\n\nThis is a collection admin command. solr.home has no relevance here. Your requirement should preferably be addressed by a core admin command "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14149585",
            "date": "2014-09-26T16:02:58+0000",
            "content": "Cleaning up things at the node level, may be a new type of Admin commands? I don't know, but I certainly don't think Collections API should expose any more of the Core level stuff. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14149698",
            "date": "2014-09-26T17:43:19+0000",
            "content": "bq: The most straightforward way I can think of is using all directories under it as core names.\n\nHmmm, this is actually do-able right now with the core admin API or the admin web interface on the particular node.\nNOTE: I'm running 4.8.1\n\na command like:\nhttp://192.168.1.201:7500/solr/admin/cores?action=UNLOAD&deleteInstanceDir=true&core=eoe1_shard8_replica1\ndeletes the core, reclaims all the disk space and de-registers the node with ZK.\n\nFrom the solr/admin screen, you can select the core and hit the \"UNLOAD\" button and the core is gone and de-registered from the cluster state. Currently it does NOT come back when you reboot as all the core.properties files are renamed core.properties.unloaded. The directory is left intact though on the disk and needs to be manually removed.\n\nIf the node is down for some reason one can delete everything in that specific SOLR_HOME of course.The cluster state can be cleaned up with the onlyIfDown parameter to the DELETEREPLICA collections API command (new).\n\nSo it seems like this scenario is covered, and introducing this would add some complexity so I think I'll mark this as \"won't fix\" if we agree. "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-14151857",
            "date": "2014-09-29T16:14:58+0000",
            "content": "Yes, the use of \n\nadmin/cores?action=UNLOAD&deleteInstanceDir=true&core=eoe1_shard8_replica1\n\nwould work for us as equivalent of\n\nadmin/collections?action=DELETEREPLICA&core=eoe1_shard8_replica1\n\nThe latter would merely hide the action=UNLOAD&deleteInstanceDir=true implementation detail but not exposing core names at collections API level also makes sense.\n\nOur typical use case is to decommission all replicas under a given solr home or another way to describe it would be everything living in a particular host/port solr instance. Collection name, shard name, replica name, core name, they are strictly speaking unnecessary detail and just a\n\nhost:port/solr/admin/something?action=DELETE_ALL_REPLICAS\n\ncould do the job or if one wanted to send admin commands not directly to the solr instance being wiped out then a\n\nhost:port/solr/admin/something?action=DELETE_ALL_REPLICAS&host=...&port=...\n\nSo, in short, yes, a \"won't fix\" JIRA resolution would be fine for our use case. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14152688",
            "date": "2014-09-30T01:34:12+0000",
            "content": "See discussion. There's still room for being able to do node-type operations, think of a physical machine going down and you want to remove all traces of it from the cluster state, but that's for another ticket. "
        },
        {
            "author": "ASF GitHub Bot",
            "id": "comment-15094534",
            "date": "2016-01-12T19:05:24+0000",
            "content": "Github user cpoerschke closed the pull request at:\n\n    https://github.com/apache/lucene-solr/pull/71 "
        }
    ]
}