{
    "id": "SOLR-1111",
    "title": "fix FieldCache usage in Solr",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Recent changes in Lucene have altered how the FieldCache is used and as-is could lead to previously working Solr installations blowing up when they upgrade to 1.4.  We need to fix, or document the affects of these changes.",
    "attachments": {
        "SOLR-1111_sort.patch": "https://issues.apache.org/jira/secure/attachment/12408956/SOLR-1111_sort.patch",
        "SOLR-1111-distrib.patch": "https://issues.apache.org/jira/secure/attachment/12408073/SOLR-1111-distrib.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12698399",
            "date": "2009-04-13T14:30:23+0000",
            "content": "The major issue is that Lucene now creates scorers per-segment, and if you use Lucene's searcher.search(...,sort) then the FieldCache populations will also be per-segment.\n\nThe biggest issue:  If FieldCache get's populated at both the top-level reader and per-segment, memory usage doubles (as does un-inversion time).\n\n\tFaceting on single-valued fields uses the FieldCache at the top-level (and would be\n\tThis is non-trivial to change...  if we started counting per-segment, counts would somehow have to be merged across segments.\n\tSorting in Solr currently uses the FieldCache at the top level\n\tThis can't easily be changed to use Lucene's searcher.search(...,sort) since we are using a hit collector (which can be wrapped in a time limited collector).\n\tDistributed search uses the top-level FieldCache to retrieve sort field values.\n\tFunctionQuery now derives values at the segment level\n\tThis also applies to the function range query\n\n\n\nAnother issue for function query is the use of ord()... it won't be valid in multi-segment indexes if evaluated at the segment level.\n\nEvaluate custom sorters (like query elevation, etc) to ensure that they still work at the segment level.  Solr doesn't currently do segment-level sorting like Lucene now does, but perhaps we should switch for more near-real-time support. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12705414",
            "date": "2009-05-03T12:19:08+0000",
            "content": "Is this Lucene version in the current 1.4 trunk, or is it a version not-yet integrated into Solr libs?\n\nAnd also, the description makes it sound like an upgrade issue, but really any 1.4 version could blow up due to this problem.\n\nLastly, define \"blow up\"...  Uses double memory, or some other side effect? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12705418",
            "date": "2009-05-03T13:29:16+0000",
            "content": "Is this Lucene version in the current 1.4 trunk\n\nYes.\n\ndefine \"blow up\"... Uses double memory, or some other side effect?\n\nYep - which can cause previously working systems OOM errors. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12709223",
            "date": "2009-05-14T00:07:22+0000",
            "content": "Here's a patch for distributed search to retrieve sort field values from the lowest level index readers.\nI plan on committing shortly. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12709518",
            "date": "2009-05-14T18:38:27+0000",
            "content": "I just committed the distributed search part of this patch. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12712752",
            "date": "2009-05-25T17:05:05+0000",
            "content": "Attaching SOLR-1111_sort.patch to use new Lucene Collector classes, including sorting collectors that will use FieldCache entries at the segment level instead of the top level reader.\n\nUnfortunately, tests don't currently pass - NPE caused by sort=a_i asc.\nLooks like we'll need to port any custom comparators over to the new FieldComparatorSource (I hadn't thought about this before, but of course it makes sense that the old custom comparators wouldn't work since there isn't a method to compare docs from different segments). "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12712823",
            "date": "2009-05-26T00:36:04+0000",
            "content": "Attaching updated patch - multiple test cases still failing.\n\n\tfixed the sort-last comparator sources\n\tfixed SolrIndexReader.sortDocSet()\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12713028",
            "date": "2009-05-26T14:34:22+0000",
            "content": "Latest patch - some tests still fail.\n\n\tfixed/implemented sort-missing-last as a new FieldComparatorSource\n\tfixed distributed search for sorting missing last\n\tfixed function query when scores are NaN or -infinity... had to map to -max_val\n\n\n\nThis won't apply to trunk because it clashes with the reversion of SolrIndexSearcher to use delegation rather than inheritance.  I fixed it by changing \"super(r)\" to \"super(wrap(r))\" "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12713053",
            "date": "2009-05-26T15:23:24+0000",
            "content": "TODO reminder: FieldCache.DEFAULT and ExtendedFieldCache.EXT_DEFAULT are different instances... make sure that we are using the same instance everywhere to avoid more memory being used than necessary. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12713247",
            "date": "2009-05-26T20:51:27+0000",
            "content": "Attaching updated patch.  All tests new pass. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12713271",
            "date": "2009-05-26T21:36:48+0000",
            "content": "committed.  Leaving this issue open for now - need to look at RandomSortField, FieldCache.DEFAULT, and perhaps some tests (something to show that FieldCache entries are being shared). "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12713285",
            "date": "2009-05-26T22:10:03+0000",
            "content": "For FieldCache issues, I've opened LUCENE-1662 "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12740974",
            "date": "2009-08-08T21:24:10+0000",
            "content": "Moving the rest of this to 1.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872606",
            "date": "2010-05-27T22:08:42+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043812",
            "date": "2011-06-03T16:47:12+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106445",
            "date": "2011-09-16T14:51:08+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13235917",
            "date": "2012-03-22T19:19:54+0000",
            "content": "Is this relevant any more? I found this by accident while investigating a client question... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237091",
            "date": "2012-03-23T20:38:10+0000",
            "content": "Issue is marked 3.6 and actively being discussed but has no assignee - assigning to most active committer contributing patches/discussion so far to triage wether this can/should be pushed to 4.0 or not. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412203",
            "date": "2012-07-11T22:26:19+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429893",
            "date": "2012-08-07T03:44:04+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452194",
            "date": "2012-09-10T17:41:57+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        }
    ]
}