{
    "id": "SOLR-4355",
    "title": "SolrException & SolrServerException message should retun root cause",
    "details": {
        "affect_versions": "4.0,                                            4.1",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "A mall/illformed SolrQuery will raise a SolrException when executed on SolrServer.query(...). \n\nThe only message retreivable from this exception is that \"org.apache.solr.common.SolrException: Server at http://servername/solr/core0 returned non ok status:500, message:Internal Server Error\" \n\nUsing the same query and posting in a web browser directly against Solr I'm presented with the proper root cause. \n\nIt would be very much appreciated if the Search client itself would be able to return the same message.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Nikolai Luthman",
            "id": "comment-13563817",
            "date": "2013-01-27T14:57:26+0000",
            "content": "I think the best way to do this would be to first create a custom error page for solr, with an option to return the error in plain text, and then just append the response body to the exception. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13564794",
            "date": "2013-01-28T22:46:14+0000",
            "content": "I think the best way to do this would be to first create a custom error page for solr, with an option to return the error in plain text, \n\nSolr already uses the specified response writer to format any error responses, so clients asking for results in XML get an XML formated error response, clients asking for results in JSON get a JSON formatted error response, etc...\n\nThe issue here is simply that the code in SolrJ for dealing with non 200 HTTP responses needs to be updated to (try to) use the appropriate response parsing codec to see if the response can be parsed, and if so pull out hte error information to populate the SolrServerException  (when most of this code was writen, solr still relied on the serlvet container to format the response, so the body was largely useles, hence no one ever worried about it).\n\npatches towards this goal would certainly be welcome. "
        }
    ]
}