{
    "id": "SOLR-2617",
    "title": "Support git.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "Build"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Apache has git mirrors of Lucene/Solr, as well as many other projects. Presently, if git is used to checkout Lucene/Solr, there are only a couple small problems to address, but it otherwise works fine.\n\n\ta .gitignore is needed.\n\tempty directories need to be dealt-with. (git doesn't support them)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13053665",
            "date": "2011-06-23T05:50:35+0000",
            "content": "For .gitignore, I prefer to generate it automatically assuming the git repo is git-svn based, however that didn't work:\n\nlucene-solr$ git svn create-ignore\nconfig --get svn-remote.svn.fetch :refs/remotes/git-svn$: command returned error: 1\n\n\n\n\nsolr/example/work: Needs to be created. I recommend altering the \"example\" ant build target to create it if need be. Add the following at like 760 (before the <delete> task):\n\n<mkdir dir=\"${example}/work\" /><!-- in case not there -->\n\n\n\nsolr/example/logs: I think we can purposefully overlook this as its not used unless explicit configuration action is taken to log something there, at which point if an error is reported about its absence, it will be obvious it needs to be created.\n\nAnything else? "
        },
        {
            "author": "Stefan Trcek",
            "id": "comment-13054302",
            "date": "2011-06-24T08:27:08+0000",
            "content": "> For .gitignore, I prefer to generate it automatically assuming the git repo is git-svn based, however that didn't work\n\nAs a git mirror is sufficient to make patches I suggest to add .gitignore to the repo, as this enables the use of a git mirror without git-svn. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13225869",
            "date": "2012-03-09T05:56:33+0000",
            "content": "I'm going to close this issue since the situation has been rectified since when I created this issue:\n\n\n\tThere is an invisible blank file in the example/work directory that Yonik put there at r1133136 (trunk) and 3x branch as well. It's named .gitignore which may be confusing.\n\tThe /.gitignore file is present on trunk and 3x via LUCENE-3775.  Dawid created a custom script to generate it from the svn props.\n\n\n\nI don't know of any more problems, and they can be dealt with as they come up – now that I have the power to do so \n "
        }
    ]
}