{
    "id": "SOLR-7510",
    "title": "UpdateProcessor to compute a murmur3 hash of a field at index time",
    "details": {
        "components": [],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "SOLR-6968 is adding HyperLogLog support to stats component.  HLL accuracy depends on having good (long) hash values – these can be computed at query time, but we should give users a simple option to compute them at index time for efficiency (especially with things like String hashing)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-05-07T18:25:38+0000",
            "author": "Hoss Man",
            "content": "Basic thinking i have...\n\n\n\tFieldMuttaingUpdateProcessor\n\tby default mutates no fields\n\ttypical usage would be after CloneFieldUpdateProcessor\n\tlooks at each field value given, and uses instanceof to pick the best method to call on the HashFunction\n\t\n\t\tif not a simple primitive, defaults to toString() then hash\n\t\tso for optimal hashing of numerics, users should put this after the appropriate Parse(Numer)UpdateProcessor\n\t\t\n\t\t\tslightly cumbersome, but mainly targeted more for string fields anyway, since that's where pre-computing hte hash values is the most important\n\t\t\n\t\t\n\t\n\t\n\n ",
            "id": "comment-14533141"
        },
        {
            "date": "2015-05-08T07:08:59+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "This will help shard splitting as well. If we can index the hash value for a routing key, shard splitting can automatically compute hash ranges such that the documents are evenly distributed. But apart from what you've mentioned, it'd need to extract the routing key from a composite id. ",
            "id": "comment-14533997"
        },
        {
            "date": "2015-05-08T08:40:38+0000",
            "author": "Noble Paul",
            "content": "does it mean that if the hash value is not indexed , splitting can't work? ",
            "id": "comment-14534117"
        },
        {
            "date": "2015-05-08T08:56:04+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Not at all. If the hash is not indexed, we can fall back to splitting at the middle of the hash range (as we do in the present implementation). ",
            "id": "comment-14534142"
        }
    ]
}