{
    "id": "SOLR-7413",
    "title": "Website: downloading past releases is harder than it should be",
    "details": {
        "components": [
            "website"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Clicking on the \"Download\" button at the top of every Solr website page takes you to http://lucene.apache.org/solr/mirrors-solr-latest-redir.html (let's call it the download-redirect page), which pauses for 3 seconds and then auto-redirects to the Apache download mirror page for the latest Solr release.  The download-redirect page has info about downloading past releases, but there are problems with the current setup:\n\n\n\tThe 3 second auto-redirect doesn't allow enough time to read the page before it's gone.\n\tFirefox (latest version, on OS X and Windows) doesn't include the page in its browser history, so you can't go back - clicking the back button will take you to the page you were on when you clicked the \"Download\" button, not back to the download-redirect page.\n\tInternet Explorer and Chrome include the download-redirect page in their history, so clicking the back button will go there, but then after three seconds you get redirected to the Apache download mirrors page, whack-a-mole style.\n\n\n\nWhen I was putting the download-redirect page together, I guess I only tested on Safari on OS X 10.10.  This browser keeps the download-redirect page in its history, so clicking the back button after the auto-redirect takes you to the mirror pages will take you back to the download-redirect page, and the auto-redirect never recurs.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-04-17T00:32:01+0000",
            "author": "Steve Rowe",
            "content": "Firefox has a bug in its tracker describing the no-redirect-history issue, but it's been resolved as Fixed, though the last comment on the issue, from 2014, complains that it's still a problem: https://bugzilla.mozilla.org/show_bug.cgi?id=606286 ",
            "id": "comment-14499047"
        },
        {
            "date": "2015-04-17T00:37:12+0000",
            "author": "Steve Rowe",
            "content": "I want to leave the auto-redirect in place, to serve what I think is the main audience: people who are looking for the latest release.\n\nThere is a link at the bottom of every page \"Download Older Releases\" that goes to a non-redirecting page with the same info on it as the download-redirect page: http://lucene.apache.org/solr/downloads.html.\n\nI'm thinking of increasing the auto-redirect timeout to 10 seconds, and then under the pause notice at the top of the page, adding a link to the non-redirecting version of the page.\n\nI'm interested in hearing others' opinions on this. ",
            "id": "comment-14499056"
        },
        {
            "date": "2015-04-17T04:39:51+0000",
            "author": "Shawn Heisey",
            "content": "I like your ideas.  I think the current setup is problematic, as you said, because the redirect page isn't visible long enough for a newcomer to find the link for older releases.\n\nIt took me a minute to find the \"Download Older Releases\" link at the bottom of the page, because it is in a different place than the \"Download\" link.  I'm not sure if it's a bad idea or a good idea to move it so it's right below Download. ",
            "id": "comment-14499233"
        },
        {
            "date": "2018-03-10T23:13:26+0000",
            "author": "Jan Høydahl",
            "content": "I'd really like to refresh the Download page to look something like the Apache Cloudstack page: https://cloudstack.apache.org/downloads.html \n\nI like how they introduce the software, spell out what version is the last and which is the LTS one, and also the buttons to fetch the SHA, ASC and KEYS files directly from Apache servers. The page also talks about the importance of validating the download and provides a link to the archive too.\n\nWe should also merge in the info from http://lucene.apache.org/solr/community.html#about-versions into the downloads page.\n\nTo avoid having to commit changes to the downloads page for every release, it should be possible to generate the version specific text and links dynamically with JS. I imagine the JS code pulling in https://projects.apache.org/json/projects/lucene-solr.json and from there parse what is the latest version as well as the latest bugfix version for previous major version, and generate all the links. With this in place we (still) don't need to commit updates to this page.\n\nAs a bonus we can also show the release date and generate links to release notes.  ",
            "id": "comment-16394359"
        }
    ]
}