{
    "id": "SOLR-1258",
    "title": "health check file: relative path evaluated against CWD (directory were app was started)",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The following element gives admin the ability to enable/disable a solr instance without taking it down\n\n\n  <admin>\n    <defaultQuery>solr</defaultQuery>\n\n    <!-- configure a healthcheck file for servers behind a loadbalancer\n    -->\n    <healthcheck type=\"file\">server-enabled</healthcheck>\n  </admin>\n\n\n\nThere is a problem with where the file 'server-enabled' is placed. Currently it appears that file is relative to the place where the server is stared. This causes trouble to deployment since theoretically the server could be started anywhere. My suggestion is to have the file relative to solr home so that it does not dependent on where the server is started.",
    "attachments": {
        "SOLR-1258.patch": "https://issues.apache.org/jira/secure/attachment/12524950/SOLR-1258.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jay",
            "id": "comment-12727057",
            "date": "2009-07-03T17:29:03+0000",
            "content": "This is actually not a big issue as you can always use system property to specify the directory where you put the file. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12729395",
            "date": "2009-07-09T19:43:52+0000",
            "content": "I agree that this should be considered a bug, but changing the behavior is non trivial, particularly without confusing existing users on upgrade.\n\n(it would be easier if we were just testing for the existence of the file, SolrResourceLoader has code to do this in a cascading manner checking the conf dir, instanceDir, and finally CWD) but since Solr creates this file, we need a concrete location.  Long term it would make sense to move this healthcheck config out of the legacy <admin> section in solrconfig, and make it an init option on the PingRequestHandler (and move the enable/disable options processing to that handler)  if/when we do that we can change the semantics of a relative directory.\n\n\nSince Solr has functioned this way for so long, and it has a simple workaround i don't think we should hold back 1.4 waiting on this (but if someone comes up with a nice clean patch, by all means we can move forward) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13264062",
            "date": "2012-04-27T22:52:01+0000",
            "content": "This issue popped up on the #solr IRC channel today, and looking over the issue and the code i think that for Solr 4.0 we should bite the bullet and...\n\n\n\tmove the configuration of the filename to an init param on the PingRequestHandler itself\n\t\n\t\tie: <str name=\"healthcheckFile\">server-enabled</str>\n\t\tdefault would be no file (as today) which would mean healthchecking doesn't apply (just the query)\n\t\n\t\n\tchange the way the path is resolve to be relative to the dataDir\n\t\n\t\tmuch less kludgy and confusing\n\t\tsomething solr should deinitely be able to write to\n\t\tway more freindly to multi-core setups\n\t\n\t\n\tadd a new example where \"/admin/ping\" is configured in solrconfig.xml\n\t\n\t\tcompletely remove the example healthcheck from the <admin> block\n\t\n\t\n\tdon't bother trying to be backcompatible with the old configuration\n\t\n\t\tanyone using that syntax successfully is likely already using an absolute path, and will notice very quickly that it isn't working, and will be able to quickly see from CHANGES.txt that if they move that absolute path to the PingREquestHandler config everything works fine\n\t\n\t\n\n\n\n\nAny objections? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13264128",
            "date": "2012-04-27T23:58:33+0000",
            "content": "quick stab at what i had in mind.\n\na few nocommits relating to docs and better error messages when dirs aren't readable/writable.\n\nTestPingRequestHandler also still needs fixed (and needs some better tests around how this now works)\n\nany objections to the general idea? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13267157",
            "date": "2012-05-03T04:02:45+0000",
            "content": "Fixed & improved the test, improved the error checking involving directory permisions, and added docs.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13267752",
            "date": "2012-05-03T19:57:16+0000",
            "content": "patch just commited, includes cleanup of all the legacy syntax in examples & test configs, as well as the CHANGES.txt note for people upgrading.\n\nCommitted revision 1333598. "
        }
    ]
}