{
    "id": "SOLR-5324",
    "title": "Make sub shard replica recovery and shard state switch asynchronous",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.6",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Currently the shard split command waits for all replicas of all sub shards to recover and then switches the state of parent to inactive and sub-shards to active.\n\nThe problem is that shard split (ab)uses the CoreAdmin WaitForState action to ask the sub shard leader to wait until the replica states are active. This action is prone to timeout.\n\nWe should make the shard state switching asynchronous. Once all replicas of all sub-shards are 'active', the shard states should be switched automatically.",
    "attachments": {
        "SOLR-5324.patch": "https://issues.apache.org/jira/secure/attachment/12607572/SOLR-5324.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13790430",
            "date": "2013-10-09T15:02:37+0000",
            "content": "Changes:\n\n\tA new shard state: 'recovery' is added\n\tAfter all sub-shard replicas have been created, the sub-shard state is set to 'recovery'. If replication factor is 1 then the sub-shards are set to 'active'. The splitshard API returns at this point.\n\tThe state change events in the overseer are used to track when all replicas of all sub-shards become 'active'. Once that happens, the parent shard is set to inactive and the sub-shards are set to 'active'.\n\tTo facilitate the above, a slice property called 'parent' is introduced which is removed once the slice becomes 'active'.\n\tIf the split is retried then we use the 'deleteshard' api to completely remove the sub-shards before starting the splitting process.\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13790575",
            "date": "2013-10-09T16:23:09+0000",
            "content": "\n\tOn unsuccessful replica recovery, the sub-shard state was incorrectly being set active\n\tThe split by route field test should wait for the right collection to recover\n\n "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13791463",
            "date": "2013-10-10T13:11:38+0000",
            "content": "This is good. Just had a quick look and it looks fine to me. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13791499",
            "date": "2013-10-10T13:49:15+0000",
            "content": "Changes:\n\n\tExtracted shard splitting related logic in overseer to its own method\n\tThe Overseer.updateShardState is re-used for switching shard state. It also takes care of removing parent shard information when a shard is switched from 'recovery' to 'active' states.\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13791503",
            "date": "2013-10-10T13:54:23+0000",
            "content": "Thanks Anshum! I think this is ready to go into trunk. I'll let it bake for a while and then merge into branch_4x. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13791514",
            "date": "2013-10-10T14:10:17+0000",
            "content": "\n\tRemoved unused imports introduced in Overseer\n\tImproved logging message in DistribUpdateProcessor when sub-shard is active an update request from parent is received.\n\n "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13791538",
            "date": "2013-10-10T14:26:31+0000",
            "content": "Commit 1530994 from shalin@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1530994 ]\n\nSOLR-5324: Make sub shard replica recovery and shard state switch asynchronous "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13793453",
            "date": "2013-10-12T19:16:47+0000",
            "content": "Commit 1531580 from shalin@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1531580 ]\n\nSOLR-5324: Make sub shard replica recovery and shard state switch asynchronous "
        }
    ]
}