{
    "id": "SOLR-8881",
    "title": "test & document (and improve as possible) behavior of TolerantUpdateProcessor while shard splitting is in progress",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "TolerantUpdateProcessor is being added in SOLR-445 but it's not entirely obvious what the behavior should be when using something like this is used in conjunction with Shard Splitting.\n\nIn particular what should / shouldn't happen if an update error occurs on a subShardLeader (while the shard is actively being split) after the update already succeded on the original shard leader.  when TUP is not used, this error is propogated back to the client – but if TUP is being used, then should the subShardLeader' error be propogated back as a tolerated error, or a hard failure?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-21T23:26:29+0000",
            "author": "Hoss Man",
            "content": "\nSince this seems like an outlier situation (1. using shard splitting; 2.  actively sending updates during shard splitting; 3. using TolerantUpdateProcessor) I'm splitting it out into it's own issue so as to not block SOLR-445. ",
            "id": "comment-15205352"
        },
        {
            "date": "2016-03-21T23:28:44+0000",
            "author": "Hoss Man",
            "content": "I spoke briefly with Shalin Shekhar Mangar about this issue offline and he said he would try to find some time to think about what the ideal behavior should look like, and how to write a test for it.  Pinging him here in the hopes he'll add some comments with his thoughts. ",
            "id": "comment-15205357"
        },
        {
            "date": "2016-03-22T16:40:52+0000",
            "author": "ASF subversion and git services",
            "content": "Commit c740e69622f3c0295498f02e76e42af6341ba333 in lucene-solr's branch refs/heads/jira/SOLR-445 from Chris Hostetter (Unused)\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=c740e69 ]\n\nSOLR-8881: replace nocommits with doc note and link to jira ",
            "id": "comment-15206744"
        }
    ]
}