{
    "id": "SOLR-3503",
    "title": "Make SnowballPorterFilterFactory (and other stemmers?) MultiTermAware",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It seems to me that all the stemmers could be MultiTermAware, anyone know of a reason not?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13288155",
            "date": "2012-06-03T12:48:36+0000",
            "content": "most stemmers use length of the string / syllable count. In general this won't work... I don't think we should do it. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13288167",
            "date": "2012-06-03T14:28:21+0000",
            "content": "It could be tricky, but it could work, but users would have to be made aware of how wildcards could interfere or interact with stemming. And testing is essential, as well as good user documentation of how to navigate the stemming vs. wildcards minefield.\n\nUnless the user actually knows what the stemmed term will be, even simple trailing wildcards can be tricky since the stem could be much shorter than the user expects. For example \"investment*\" where the actual stemmed and indexed term might be \"invest\" for a particular stemmer.\n\nLeading wildcards can sometimes be okay, but completely dependent on the particular stemmer. For example, \"*ment\".\n\nAnd simple embedded wildcards can be a real wildcard, once again depending on the specific stemmer. For example, \"inve*ment\".\n\nBut, I don't think any or all of those concerns are any worse than the situation we have today.\n\nBut, some robust tests would be needed to persuade me that this improvement is actually okay.\n\nRight now, I say go for it, including the test examples for various stemmers and documentation for issues that users must be aware of (call it \"safe wildcards in the presence of stemming.\") I think the only restriction is that query results should not be worse than without this improvement.\n\nUnfortunately, the doc may be stemmer-dependent. And separate tests needed for each stemmer.\n\nThe bottom line is to reduce the surprise factor for the user.\n\nAs a side note, it would be nice if Solr had a mechanism to return \"informative notes and warnings\" with a query response. For example, \"Wildcard term inves*ment matches no indexed terms\". "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13288169",
            "date": "2012-06-03T14:42:23+0000",
            "content": "Gaaah! That'll teach me to put up a JIRA when I haven't had enough coffee. I was just thinking about it in terms of the stemmer producing a single token, which would be fine.\n\nThe notion that what the stem wound up being and the impossibility of \"doing the right thing\" given that transformation completely escaped my not-yet-awake brain. Or what remains of it.\n\nEspecially when you consider embedded wildcards (e.g. bil*et) as you pointed out.\n\nSo I'm closing this as \"invalid\". I don't think it's worth the effort. If someone really wants to do this, they can try it with the \"multiterm\" analysis chain definition and suffer the consequences... "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13288174",
            "date": "2012-06-03T15:06:27+0000",
            "content": "Or are you just trying to trick me into doing it?! (I may.)\n\nI'm at least half-convinced that it would not be harmful, at least for some stemmers and the changes would be stemmer-specific anyway, so it would give incremental improvement even if not 100% solving all issues for all stemmbers.\n\nHow about changing the status to \"Won't Fix\" rather than \"Invalid\"? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13288185",
            "date": "2012-06-03T16:00:41+0000",
            "content": "Changing to \"won't fix\" "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13288186",
            "date": "2012-06-03T16:04:32+0000",
            "content": "Jack:\n\nGo ahead and have a whack at it if you want, but given that if one really wants to, one can just define a \"multiterm\" section of in the schema and put whatever one wants in there, I'm not inclined to spend time on this. The intent of the whole MultiTermAware bit was to do the safe, easily-explainable stuff. I suspect that this would just be a lot of effort for, arguably, no net benefit (by the time we had to explain all the caveats, whether it worked for language/stemmer X, Y or Z, etc). But I'll be happy for you to prove me wrong.... "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13288202",
            "date": "2012-06-03T16:54:31+0000",
            "content": "Ultimately it may simply come down to doing better documentation for the interactions between stemming and wildcards. After all, the stemmer does do its thing at index time, so even if the stemmer is not called at all at query time, the user who wants to use wildcards needs to know what rules the stemmer used at index time.\n\nIn any case, I'll think about this a little more before proceeding. And as I said, the restriction is that the results can't be worse than they are today. "
        }
    ]
}