{
    "id": "SOLR-10039",
    "title": "LatLonPointSpatialField",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "spatial"
        ],
        "type": "New Feature",
        "fix_versions": [
            "6.5"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The fastest and most efficient spatial field for point data in Lucene/Solr is LatLonPoint in Lucene's sandbox module.  I'll include LatLonDocValuesField with this even though it's a separate class.  LatLonPoint is based on the Points API, using a BKD index.  It's multi-valued capable.  LatLonDocValuesField is based on sorted numeric DocValues, and thus is also multi-valued capable (a big deal as the existing Solr ones either aren't or do poorly at it).  Note that this feature is limited to a latitude/longitude spherical world model.  And furthermore the precision is at about a centimeter – less precise than the other spatial fields but nonetheless plenty good for most applications.  Last but not least, this capability natively supports polygons, albeit those that don't wrap the dateline or a pole.\n\nI propose a LatLonPointSpatialField which uses this.  Patch & details forthcoming...\n\nThis development was funded by the Harvard Center for Geographic Analysis as part of the HHypermap project",
    "attachments": {
        "SOLR_10039_LatLonPointSpatialField.patch": "https://issues.apache.org/jira/secure/attachment/12849367/SOLR_10039_LatLonPointSpatialField.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-01-25T21:46:47+0000",
            "content": "The attached patch has most everything but it's not quite committable.  I'm internally using a 6.4 based branch so the diff includes stuff that won't be needed for trunk or 6.5+.\n\nThe field extends AbstractSpatialFieldType and thus inherits the functionality and integration with the rest of Solr spatial.  The main TODOs are:\n\n\tmake indexed & docValues attributes configurable\n\tintegrate Polygon support.\n\n\n\nI would have liked to have introduced this embedded SpatialStrategy implementation to Lucene spatial-extras but I didn't think depending on sandbox was a good idea, at least not now, so I opted not to. ",
            "author": "David Smiley",
            "id": "comment-15838645"
        },
        {
            "date": "2017-01-25T21:55:32+0000",
            "content": "The patch includes some references to a HeatmapSpatialField that is erroneous for this patch as it's actually for another issue I'm working on. ",
            "author": "David Smiley",
            "id": "comment-15838659"
        },
        {
            "date": "2017-01-26T16:00:48+0000",
            "content": "Glad to see progress on this front!\n\nRegarding this:\n\n+      public SortField getSortField(boolean reverse) {\n+        //nocommit reverse?  throw exception if unsupported?\n+        return LatLonDocValuesField.newDistanceSort(fieldName, queryPoint.getY(), queryPoint.getX());\n+      }\n\n\n\nWe should definitely throw an exception if it's not supported, but given that we should be able to have a value source representing the distance, we should be able to use that to easily construct a reverse sort? ",
            "author": "Yonik Seeley",
            "id": "comment-15839912"
        },
        {
            "date": "2017-01-26T17:38:52+0000",
            "content": "Great point; if reverse is true then I can merely call the superclass version \n\nI want to delay polygon support for another issue; there's actually a lot to make that work, and the functionality here is plenty good as-is. ",
            "author": "David Smiley",
            "id": "comment-15840105"
        },
        {
            "date": "2017-03-05T06:05:43+0000",
            "content": "New patch:\n\n\tindexed & docValues are now properly configurable\n\ttested geodist() with this field, and ascending/descending.\n\n\n\nI think it's ready, but I want to expand the patch to add this field type to our example configs in at least every file that already includes a spatial field, ordered just ahead of them so users are more likely to use this one.\n\nQuery by polygon is left as a future TODO. ",
            "author": "David Smiley",
            "id": "comment-15896077"
        },
        {
            "date": "2017-03-05T06:11:46+0000",
            "content": "I might get a bit of time to share some performance numbers; although it's a bit of a forlorn conclusion that of course it's faster given the Lucene nightly benchmarks: https://home.apache.org/~mikemccand/geobench.html ",
            "author": "David Smiley",
            "id": "comment-15896080"
        },
        {
            "date": "2017-03-07T02:15:43+0000",
            "content": "Last patch; I think it's ready now.  This replaces solr.LatLonType with solr.LatLonPointSpatialField in the solr/server/solr/configsets/ schemas.  \n\nHowever it doesn't modify solr/example/ schemas... I wish those schemas were stripped down so that they were easier to maintain (separate issue).  Thoughts Alexandre Rafalovitch? ",
            "author": "David Smiley",
            "id": "comment-15898610"
        },
        {
            "date": "2017-03-07T03:09:06+0000",
            "content": "I think we can just remove that field and related definitions from all the legacy examples. I don't see anything rely on them by definition. \n\nAnd yes, I think at least DIH examples should be stripped to absolute minimum. I was going to do that for Tika example in SOLR-9601. Is that the kind of things you were thinking about? ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15898655"
        },
        {
            "date": "2017-03-07T05:34:45+0000",
            "content": "Yes; thanks Alexandre.\n\nI'll commit this patch within a couple days or sooner if I get a +1. ",
            "author": "David Smiley",
            "id": "comment-15898782"
        },
        {
            "date": "2017-03-07T20:38:43+0000",
            "content": "I've got another patch revision here.  Essentially I noticed/forgot about Lucene's IndexOrDocValuesQuery which in turn made me also realize this field could support queries even if it has only docValues.  So I added both.  I also expanded the testing to include some variations. ",
            "author": "David Smiley",
            "id": "comment-15900114"
        },
        {
            "date": "2017-03-12T01:48:09+0000",
            "content": "Commit 182c20c4e55c39362f6d46d388eb2b8e0a9052e6 in lucene-solr's branch refs/heads/master from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=182c20c ]\n\nSOLR-10039: New LatLonPointSpatialField ",
            "author": "ASF subversion and git services",
            "id": "comment-15906393"
        },
        {
            "date": "2017-03-12T04:11:45+0000",
            "content": "Commit f171d181cb7a01c318b0a37e93897bf9f1fcf50f in lucene-solr's branch refs/heads/branch_6x from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=f171d18 ]\n\nSOLR-10039: New LatLonPointSpatialField\n\n(cherry picked from commit 182c20c) ",
            "author": "ASF subversion and git services",
            "id": "comment-15906419"
        },
        {
            "date": "2017-03-30T17:17:06+0000",
            "content": "David Smiley: can you please update the ref guide with some guidance on this new field type?\n\nReplacing LatLonType with LatLonPointSpatialField in the list of field types is easy, but the way the \"Spatial\" page is written updating it to make meaningful comments about LatLonPointSpatialField (as compared to RPT) is a lot harder w/o some first hand knowledge about the merits...\n\n\n\thttps://cwiki.apache.org/confluence/display/solr/Spatial+Search\n\thttps://cwiki.apache.org/confluence/display/solr/Field+Types+Included+with+Solr\n\n ",
            "author": "Hoss Man",
            "id": "comment-15949437"
        },
        {
            "date": "2017-03-30T18:30:54+0000",
            "content": "David Smiley: can you please update the ref guide with some guidance on this new field type?\n\nAbsolutely; I planned to do so tonight.  I know I have to beat the clock before the ref guide RC sometime tomorrow. ",
            "author": "David Smiley",
            "id": "comment-15949561"
        }
    ]
}