{
    "id": "SOLR-8078",
    "title": "Data driven solrconfig spellchecker refers to a non-existent field",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.5",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "In the data driven solrconfig.xml file, the \"default\" spellchecker refers to a field called \"text\" which doesn't exist in the schema.\n\nEven the \"wordbreak\" spellchecker refers to a field called \"name\" which does not exist. \n\nSo when you run this query http://localhost:8983/solr/gettingstarted/spell?q=* Solr will throw an error. \n\nI guess the field name should be _text_ ?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-22T10:18:44+0000",
            "author": "Varun Thacker",
            "content": "Thinking aloud can merge the techproducts and data driven config sets?\n\n\n\tTo use the techproducts example , the startup script can post the necessary fields using the schema APIs . So the example config has ManagedSchemaFactory\n\tTo use the schemaless example, the startup script can make sure that the add-unknown-fields-to-the-schema update chain is used.\n\tWe don't need a minimal config set , since all the extra fields in tech products is been added by the startup script and is not present otherwise.\n\n\n\nSteve Rowe what do you think? ",
            "id": "comment-14902351"
        },
        {
            "date": "2015-09-22T12:43:02+0000",
            "author": "Steve Rowe",
            "content": "One of the nice things about having separate configsets is that they are full examples, and I wouldn't want to lose that.\n\nIf we merge them, we should make it easy to find the schema/config API JSON used to compose each configset.  Having examples of this, which is a very likely usage pattern, would be good even if we don't do the merge.  And it's the direction we want to encourage users to go in: think of schema/config as addressable via API as opposed to static files.\n\nWe don't need a minimal config set , since all the extra fields in tech products is been added by the startup script and is not present otherwise.\n\nDo you mean that the data_driven_schema_configs is already minimal?  If so, I don't agree, there is quite a bit of stuff in there.\n\nWe could have only the minimal config set and then deltas (in the form of API JSONs) for both data driven and tech products. ",
            "id": "comment-14902519"
        },
        {
            "date": "2015-09-22T12:46:38+0000",
            "author": "Erik Hatcher",
            "content": "I look forward to the day that we have the APIs complete enough to be able to have a minimal Solr starting \"config\" (it'd really be without config) and be able to script up to the data driven, tech products, example/files, example/films, etc.  I think that's the ideal goal here.\n\nBut pragmatically, I think switching to _text_ for data driven spell checking is a reasonable fix to allow data driven to work out of the box with spell checking. ",
            "id": "comment-14902523"
        },
        {
            "date": "2015-09-22T12:59:56+0000",
            "author": "Steve Rowe",
            "content": "But pragmatically, I think switching to _text_ for data driven spell checking is a reasonable fix to allow data driven to work out of the box with spell checking.\n\n+1 ",
            "id": "comment-14902548"
        },
        {
            "date": "2015-09-22T13:05:27+0000",
            "author": "Varun Thacker",
            "content": "If we merge them, we should make it easy to find the schema/config API JSON used to compose each configset. Having examples of this, which is a very likely usage pattern, would be good even if we don't do the merge.\n\nWe can print messages in the startup script similarly to what we do currently to alter soft commits:\n\n\nPOSTing request to Config API: http://localhost:8983/solr/gettingstarted/config\n{\"set-property\":{\"updateHandler.autoSoftCommit.maxTime\":\"3000\"}}\n\n\n\n\nwould be good even if we don't do the merge. And it's the direction we want to encourage users to go in: think of schema/config as addressable via API as opposed to static files.\n\n+1 \n\n\nSo to summarize the motivation for merging would be :\n1. Easier for us to maintain one config\n2. Nudging users to start using APIs instead of hand editing the config files ",
            "id": "comment-14902558"
        },
        {
            "date": "2015-09-22T13:45:17+0000",
            "author": "Varun Thacker",
            "content": "But pragmatically, I think switching to text for data driven spell checking is a reasonable fix to allow data driven to work out of the box with spell checking.\n\nWould this work or were you hinting at something else?\n\n\ncurl http://localhost:8983/solr/gettingstarted/config -H 'Content-type:application/json'  -d '\n{\n    \"add-searchcomponent\": {\n        \"name\": \"myspellcheck\",\n        \"class\": \"solr.SpellCheckComponent\",\n        \"queryAnalyzerFieldType\": \"text_general\",\n        \"spellchecker\": {\n            \"name\": \"default\",\n            \"field\": \"_text_\",\n            \"classname\": \"solr.DirectSolrSpellChecker\"\n        }\n    }\n}'\n\n ",
            "id": "comment-14902643"
        }
    ]
}