{
    "id": "SOLR-4978",
    "title": "Time is stripped from datetime column when imported into Solr date field",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I discovered that all dates I imported into a Solr date field from a MySQL datetime column have the time stripped (ie time portion is always 00:00:00).\n\nAfter double checking my DIH config and trying different things, I decided to take a look at the DIH code.\n\nWhen I looked at the source code of DIH JdbcDataSource class, I discovered that it is using java.sql.ResultSet and its getDate() method to handle date field. The getDate() method returns java.sql.Date. The java api doc for java.sql.Date\n\nhttp://docs.oracle.com/javase/6/docs/api/java/sql/Date.html\n\nstates that:\n\n\"To conform with the definition of SQL DATE, the millisecond values wrapped by a java.sql.Date instance must be 'normalized' by setting the hours, minutes, seconds, and milliseconds to zero in the particular time zone with which the instance is associated.\"\n\nI am so surprise at my finding that I think I may not be right.  What am I doing wrong here?  This is such a big hole in DIH, how could it be possible that no one has noticed this until now?\n\nHas anyone successfully imported a datetime column into a Solr date field using DIH?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Bill Au",
            "id": "comment-13696143",
            "date": "2013-06-29T16:11:05+0000",
            "content": "we have convertType=true in our dih config. "
        },
        {
            "author": "Bill Au",
            "id": "comment-13696201",
            "date": "2013-06-29T21:13:12+0000",
            "content": "setting convertType=false is a workaround for my problem.  But the bug still exists when convertType is set to true.  DIH should not call ResultSet.getDate() for solr date field because ResultSet.getDate() returns a java.sql.Date which has not time portion.  Since sold date field does have a time portion, DIH should call ResultSet.getTimestamp(). "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13697615",
            "date": "2013-07-02T08:51:16+0000",
            "content": "Do you see any backcompat issues if we change from ResultSet.getDate() to ResultSet.getTimestamp() "
        },
        {
            "author": "Bill Au",
            "id": "comment-13701129",
            "date": "2013-07-05T21:19:23+0000",
            "content": "This will only have an effect if convertType is enabled and will only affect date field type.  convertType is disabled by default.  I guess most people use the default setting, which is probably why no one has noticed this bug before.  The current behavior for date field type is incorrect when converType is enabled.  Making the change will fix the bug.  So date fields indexed by DIH when convertType is enabled will actually have a time portion. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13701949",
            "date": "2013-07-08T11:30:41+0000",
            "content": "Commit 1500666 from shalin@apache.org\n[ https://svn.apache.org/r1500666 ]\n\nSOLR-4978: Time is stripped from datetime column when imported into Solr date field if convertType=true "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13701950",
            "date": "2013-07-08T11:31:46+0000",
            "content": "Commit 1500668 from shalin@apache.org\n[ https://svn.apache.org/r1500668 ]\n\nSOLR-4978: Time is stripped from datetime column when imported into Solr date field if convertType=true "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716850",
            "date": "2013-07-23T18:38:46+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}