{
    "id": "SOLR-2833",
    "title": "GeoNames webservice Update Processor",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "spatial"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "A simple update processor for querying the GeoNames.org webservice. This should probably go in its own contrib module, where other geonames stuff by Mattmann & co could also go.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13127452",
            "date": "2011-10-14T11:30:35+0000",
            "content": "The first version will implement the Postal Code search servive, taking as input a country code together with postalCode and/or postalPlace and returns city name, lat, long and any other place names assocciated with the postal code.\n\nI suggest to start with this part and then incrementally add support for other geonames services. "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-13127536",
            "date": "2011-10-14T13:30:12+0000",
            "content": "Hi Jan: thanks for looking into this. Here's a full set of the issues that I worked on with my student, William:\n\nSOLR-2073 Geonames.org UpdateProcessor for Spatial\nSOLR-2074 GeoRSS ResponseWriter\nSOLR-2075 SpatialQParserPlugin and HostIP adaptor\nSOLR-2076 Spatial example schema updates\nSOLR-2077 Spatial example solconfig updates\nSOLR-2079 Expose HttpServletRequest object from SolrQueryRequest object\nSOLR-2081 BaseResponseWriter isStreamingDocs causes SingleResponseWriter.end\nto be called 2x\nSOLR-2082 Geopost.jar for loading geonames data\n\nThey are already attached to JIRA and in patch form. I'd be very happy to work with you to contribute these. Thank you!\n\n(p.s. you might want to make some of these sub-tasks to this top-level task) "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13127567",
            "date": "2011-10-14T14:19:57+0000",
            "content": "I have not tried out your patches, but I understand that you index the geonames dumps locally. I did not see any UpdateProcessor which queries this local index to actually do geocoding of addresses??\n\nMy current processor talks directly to Geonames.org, with caching of requests. This mode is good for development and testing, but for production I imagine that the backend could be configurable to either geonames.org webservice or local solr core. Comments? "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-13127578",
            "date": "2011-10-14T14:32:35+0000",
            "content": "Hi Jan:\n\nCheck out: SOLR-2082 (we use it to post geonames dump files, that's the first step). The second step is the update request processor (SOLR-2073) that stores geonames dumps as documents in the index. Then, we can query based on the spatial q parser (SOLR-2075). This lets you do queries like:\n\n\n   {!spatial ct=[city] s=[state] c=[country] d=[search radius]}search text\n   e.g. {!spatial ct=Orlando s=FL c=US d=400}NASA\n\n\n\n(which in our example looked up articles about NASA and JPL stories within\n400 km (or miles) of Orlando, FL in the US).\n\nYou can find the full documentation here:\n\nhttps://github.com/chrismattmann/solrcene\n "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-13127579",
            "date": "2011-10-14T14:33:55+0000",
            "content": "That README file BTW on the github account is just a cut/paste from a message I posted long ago to the mailing list:\n\nhttp://search-lucene.com/m/9Uikk28pgc82/Geonames+Spatial+&subj=+Spatial+Geonames+and+extension+to+Spatial+Solution+for+Solr "
        },
        {
            "author": "Chris A. Mattmann",
            "id": "comment-13127582",
            "date": "2011-10-14T14:36:05+0000",
            "content": "Just to comment back on this too:\n\n\nMy current processor talks directly to Geonames.org, with caching of requests. This mode is good for development and testing, but for production I imagine that the backend could be configurable to either geonames.org webservice or local solr core. Comments?\n\nCool yah, that's a good idea. The thing is, the easiest way for us was just to take geonames dumps (text files which we have on a bunch of our projects) and then as a first step index them in Solr creating our \"geonames-aware\" index. Then, this can be used during qparsing to allow those types of queries. I didn't want to go live to geonames.org b/c the site bandwidth might be an issue, and sometimes also we're working behind firewalls and stuff. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16017408",
            "date": "2017-05-19T13:43:35+0000",
            "content": "Closing this. Relying on a web-service for lookups is not the right design anyway, for production use. So instead encourage this as a future 3rd party plugin for demo purposes "
        }
    ]
}