{
    "id": "SOLR-392",
    "title": "Way to control search time, hits, and memory usage",
    "details": {
        "affect_versions": "1.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It would be good for end-user applications if Solr allowed searches to time out. It is possible now for the servlet container to throw a timeout exception. It would be very useful if the Solr search request timeout offered these features:\n\n1) timeout: stop searching after N milliseconds and return results using only those hits already found\n2) hit limit: stop searching after N milliseconds and return results using only those hits already found\n3) ram limit: estimate the amount of ram used so far and stop searching at a given amount\n\nIn all cases it would be very useful to estimate the remaining results to any degree of accuracy.\n\nArgument for estimation:\nFor an extreme example, Google clearly does not finish any search that is more than the requested return value. Instead it returns very quickly on any search and overestimates all searches. If the first page says there are five pages, the second will often say that there are four pages instead. The third page will say \"3 out of 3\". \n\nArgument for 'timeout' control: we've all waited too long for searches\n\nArgument for 'hit limit' control:\nI really don't need to know that I'll have 14 thousand results. I'm not going to view them all.\n\nArgument for 'ram limit' control:\nOver-complex queries can cause Java OutOfMemory errors, and Tomcat does not recover gracefully.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Sean Timm",
            "id": "comment-12537480",
            "date": "2007-10-25T02:38:08+0000",
            "content": "This is related to LUCENE-997 \"Add search timeout support to Lucene\". "
        },
        {
            "author": "Sean Timm",
            "id": "comment-12576375",
            "date": "2008-03-07T21:13:23+0000",
            "content": "This issue involves the time out portion only. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13580225",
            "date": "2013-02-17T17:11:58+0000",
            "content": "Cleaning up old JIRAs, re-open if necessary.  "
        }
    ]
}