{
    "id": "SOLR-4460",
    "title": "When you have multiple collections, the cloud radial graph view seems to place them right on top of each other.",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "",
    "attachments": {
        "cloud.jpg": "https://issues.apache.org/jira/secure/attachment/12569460/cloud.jpg",
        "cloud-radial-onecollection.png": "https://issues.apache.org/jira/secure/attachment/12569463/cloud-radial-onecollection.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13578962",
            "date": "2013-02-15T05:38:16+0000",
            "content": "Even with one collection, the radial graph is nearly useless.  Attached screenshot.\n\nEven the regular graph has the names overlapping the lines, but in that case, the lines are in the background and are a different enough color that it's still all readable.  IMHO it would be better to move the names off of the lines. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15388860",
            "date": "2016-07-22T04:06:17+0000",
            "content": "Is this still relevant to new UI? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15389783",
            "date": "2016-07-22T16:31:43+0000",
            "content": "As far as keeping the radial graph, I was testing a situation where there were 1,600 replicas scattered about and it turns out that this is more useful than I thought in that situation as it shows whether any nodes are not green in a single picture. In the \"graph\" view,\nyou have to scroll a really long time to get all this.\n\nThat said the new UI has a drop-down in the graph view to show up/down/whatever nodes. That view still shows whole collections though which can make it unwieldy. Perhaps a related idea would be to only show the replicas in the graph view that met certain criteria? And perhaps something similar in the radial view (i.e. similar options)?\n\nKind of a tangent to the base issue of making the radial view more readable I admin. "
        }
    ]
}