{
    "id": "SOLR-4432",
    "title": "Developer Curb Appeal: Eliminate the need to run Solr example once in order to unpack needed files",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In the SolrCloud instructions it says you must run the solr in the example directory at least once in order to unpack some files, in order to then use the example directory as a template for shards.\n\nIdeally we would unpack whatever we need, or do this automatically.\n\nDoc reference:\nhttp://lucidworks.lucidimagination.com/display/solr/Getting+Started+with+SolrCloud\n\nSee the red box that says:\n\"Make sure to run Solr from the example directory in non-SolrCloud mode at least once before beginning; this process unpacks the jar files necessary to run SolrCloud. On the other hand, make sure also that there are no documents in the example directory before making copies.\"",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13575984",
            "date": "2013-02-11T19:04:37+0000",
            "content": "It's just a zip file - anyone serious would just put an unzip command in their script. Not sure who put that doc, but I'd have just said to unzip it. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13582717",
            "date": "2013-02-21T00:27:05+0000",
            "content": "Hi Mark,\n\nAlthough I agree with your comment, it's yet another extra manual step to get wrong, and that has to be consistent done on all 4 machines.\n\nIf this were the only issue, maybe it's minor, but all those stupid little commands to remember all add up, especially when you're new.  Solr has a lot of those fiddly little things that more modern engines take care of automatically.\n\nAnd if we know we need it, then why not just do it automatically? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13582799",
            "date": "2013-02-21T01:57:51+0000",
            "content": "And if we know we need it, then why not just do it automatically?\n\nBecause the only way to do it automatically in a webapp world is to put it in the Solr dist unzipped already - meaning we either stop shipping the war file as well (which some people use), or we balloon the size of the dist.\n\nMaking people put in a one liner to unzip it before using the zkcli tool seemed preferable to me.\n\nI suppose you could make the argument that it's better we ship it exploded and force those using the war to zip it up into a war themselves. I'd be open to that. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13582801",
            "date": "2013-02-21T02:00:18+0000",
            "content": "and that has to be consistent done on all 4 machines.\n\nThat's never been a problem for me. The only sane way I've ever managed a SolrCloud cluster is minimally using shell scripts and ssh. I write one script, and it runs on all the nodes.\n\nYou also don't need to extract the war on all 4 machines - just the machine you are going to run the zkcli script on - you need to access the class files to run it. The other nodes will auto extract the war when you start jetty/solr. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13589567",
            "date": "2013-02-28T14:34:50+0000",
            "content": "I suppose you could make the argument that it's better we ship it exploded and force those using the war to zip it up into a war themselves. I'd be open to that.\n\nAnyone else have any opinions on that? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13589572",
            "date": "2013-02-28T14:43:43+0000",
            "content": "Unzip on demand from zkcli.sh? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13589599",
            "date": "2013-02-28T15:19:23+0000",
            "content": "Why not self-contained runnable & portable jar? Size will be about 1.2M i believe. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13589629",
            "date": "2013-02-28T16:15:58+0000",
            "content": "Unzip on demand from zkcli.sh?\n\nThat seemed like a decent idea.\n\nWhy not self-contained runnable & portable jar? \n\nThat almost sounds even better, but I think perhaps a fair bit of work in comparison. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717162",
            "date": "2013-07-23T18:47:19+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971268",
            "date": "2014-04-16T12:57:37+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15487756",
            "date": "2016-09-13T16:59:53+0000",
            "content": "It's no longer a requirement to run Solr once before bootstrapping SolrCloud, so this has been taken care of in another issue. "
        }
    ]
}