{
    "id": "SOLR-12639",
    "title": "Umbrella JIRA for adding support HTTP/2, jira/http2",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "http2"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This ticket will aim to replace/add support of http2 by using jetty HTTP client to Solr. All the works will be committed to jira/http2 branch. This branch will be served like a stepping stone between the master branch and Mark Miller starburst branch. I will try to keep jira/http2 as close as master as possible (this will make merging in the future easier). In the same time, changes in starburst branch will be split into smaller/testable parts then push it to jira/http2 branch. \n\nAnyone who interests at http2 for Solr can use jira/http2 branch but there is no backward-compatibility guarantee.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-09-11T16:31:40+0000",
            "content": "I was doing some research on HTTP/2 and found that Kerberos/NTLM is not supported with HTTP/2? It looks like most servers will fall back to HTTP 1.1 if Kerberos authentication is required. I don't know if there is any way to work around this. Searching for \"http/2 kerberos\" in Google isn't promising. ",
            "author": "Kevin Risden",
            "id": "comment-16610902"
        },
        {
            "date": "2018-09-12T16:07:05+0000",
            "content": "Hi Kevin Risden all the terminologies like Kerberos/NTLM/Spnego still spin my head when I read about them. But I had been working on back-porting the KerberosPlugin to use HTTP/2 based on HttpClient implementation (jira/http2), the related tests for them is still good so far (if you can test it manually and verify my changes that will be great).\n\nI also asked the Jetty community a hand for adding the SPNEGO authentication support to Jetty Client as well as review my changes on jira/http2. They are on progress on doing that : https://github.com/eclipse/jetty.project/issues/2868. Therefore by the time jira/http2 get merged it will works as normally in HTTP 1.1. Basically it means that what used to work will still work with Http2SolrClient\n\n\n\nIt looks like most servers will fall back to HTTP 1.1 if Kerberos authentication is required\n\n\nI don't think so since all the steps of the authorization are done through HTTP headers which is independence with HTTP protocol version. ",
            "author": "Cao Manh Dat",
            "id": "comment-16612403"
        },
        {
            "date": "2018-09-13T12:22:44+0000",
            "content": "The problem with Kerberos and HTTP/2 is that HTTP/2 is multiplexed and Kerberos typically requires multiple requests. This is typically a request -> 401 response -> challenge -> answer. Solr may not need to worry about this if Jetty handles the fallback. If Kerberos auth is required though, the Solr server will need to listen for both HTTP 1.1 and HTTP/2 I think.\n\n \n\nSome references about how this may not work well with HTTP/2. The first link describes the overall problem. The next is a message list about authentication with HTTP/2. The last few are about browsers needing to fallback to HTTP 1.1.\n\n\thttps://support.radware.com/app/answers/answer_view/a_id/19024/~/note-regarding-ntlm-with-http%2F2\n\thttps://www.ietf.org/mail-archive/web/httpbisa/current/msg26809.html\n\t\n\t\thttps://www.ietf.org/archive/id/draft-montenegro-httpbis-multilegged-auth-01.txt\n\t\n\t\n\thttps://www.fxsitecompat.com/en-CA/docs/2017/ntlm-authentication-fails-in-certain-cases/\n\t\n\t\thttps://bugs.chromium.org/p/chromium/issues/detail?id=713851\n\t\thttps://bugzilla.mozilla.org/show_bug.cgi?format=default&id=1346392\n\t\n\t\n\n ",
            "author": "Kevin Risden",
            "id": "comment-16613409"
        },
        {
            "date": "2018-09-13T23:30:00+0000",
            "content": "I don't think there are any thing like fallback to HTTP 1.1 right now. But does Solr support NTLM?\n\nEven someone try to do that, I don't think this will be a pleasure experience since Apache HttpClient does not support more than one challenge response. ",
            "author": "Cao Manh Dat",
            "id": "comment-16614161"
        },
        {
            "date": "2018-11-12T19:45:53+0000",
            "content": "There was an email today on the Jetty list about the latest release.  The important part of that email (for this issue) said this:\n\n\nUsers on Java 11 runtimes and users of HTTP/2 are encouraged to upgrade as soon as they are able.\n\n\n\nHere's the list of changes:\n\nhttps://github.com/eclipse/jetty.project/releases/tag/jetty-9.4.13.v20181111 ",
            "author": "Shawn Heisey",
            "id": "comment-16684305"
        }
    ]
}