{
    "id": "SOLR-1656",
    "title": "XInclude's are resolved relative CWD, not instance dir",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As noted on the mailing list, when an XInclude in a config files refrences a relative path, it's resolved relative the CWD of the servlet container, and not the instanceDir of the core...\n\n http://old.nabble.com/using-Xinclude-with-multi-core-to26548400.html#a26548400",
    "attachments": {
        "Support_SAX_SystemId_via_wrapping_InputStream.patch": "https://issues.apache.org/jira/secure/attachment/12471753/Support_SAX_SystemId_via_wrapping_InputStream.patch",
        "SOLR-1656.patch": "https://issues.apache.org/jira/secure/attachment/12472078/SOLR-1656.patch",
        "SOLR-1656-fallback.patch": "https://issues.apache.org/jira/secure/attachment/12472114/SOLR-1656-fallback.patch",
        "SOLR-1656-mockup.patch": "https://issues.apache.org/jira/secure/attachment/12471884/SOLR-1656-mockup.patch",
        "SOLR-1656_Support_SAX_SystemId_via_wrapping_InputStream.patch": "https://issues.apache.org/jira/secure/attachment/12444515/SOLR-1656_Support_SAX_SystemId_via_wrapping_InputStream.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12790448",
            "date": "2009-12-14T23:35:56+0000",
            "content": "The probably is probably caused by the default behavior of DocumentBuilder when it doesn't know the filename of the XML it is parsing – Config.java only provides an InputStream "
        },
        {
            "author": "Paul Libbrecht",
            "id": "comment-12790460",
            "date": "2009-12-14T23:43:40+0000",
            "content": "I may be very wrongly informing but using\n\n i = new InputSource(<theInputStream>);\n i.setSystemId(file.toURL().getExternalForm());\n\nis a recipe that has worked many times and allows relative resolution.\n\n  new InputSource(file.toURL())\n\nshould as well.\n\npaul "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12791130",
            "date": "2009-12-16T02:12:59+0000",
            "content": "I may be very wrongly informing but using ...\n\nI'm sure you are correct, but as i mentioned, Config only has an InputStream when it instantiates the DocumentBuilder. (hence: non trivial fix) "
        },
        {
            "author": "David Smiley",
            "id": "comment-12867584",
            "date": "2010-05-14T17:37:27+0000",
            "content": "Attached is a patch implementing this.  This patch is against r941377. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12867669",
            "date": "2010-05-14T20:48:39+0000",
            "content": "David: Interesting Idea.  i must admit that while it feels very dirty, it's simplicity has some appeal.\n\nI'm not positive, believe we could actually take this further by using ClassLoader.getResource() to generate a systemId for items pulled from the classpath as well (but i'm not sure if hte resulting URLs would be of any use to the DocumentBuilder if it doesn't also use the SolrResourceLoader)\n\nPersonally I think we should just bite the bullet and:\n\n\timplement a new SolrResourceLoader.openResourceAsInputSource(String)\n\tadd the necessary constructors to start instantiating Config related options (SolrConfig, IndexSchema, etc) from InputSources\n\n\n\nwhat appeals to me about your idea is that it wouldn't conflict with adding support for InputSource, and could work as a nice safety net for code that might use SolrResourceLoader to get an InputStream even if we had a new method for getting InputSources.\n\n(the one key change i might suggest is to replace your InputStreamWithSystemId class with a one method marker interface \"SystemIdable\" and then use anonymous classes that implement that method – it seems a little cleaner, and allows for the possibility of decorating other things with systemIds ... like Readers perhaps) "
        },
        {
            "author": "David Smiley",
            "id": "comment-12867679",
            "date": "2010-05-14T21:05:21+0000",
            "content": "I thought of making a SolrResourceLoader.openResourceAsInputSource(String) and it wasn't clear earlier what sort of arrangement should exist between providers of InputSource objects and their consumers with regard to cleanup. (i.e. closing streams).  So I just read the javadoc now.  It seems to me that this method could be supported but we'd create the input stream on the fly via extending InputSource and doing the work in the getter.  We don't want to create the stream if nobody calls it (even if we know that our particular consumer happens to call it and close it).  Apparently the caller of the getInputStream is supposed to close it so perhaps this means we don't even need to close it in the Config constructor since the doc builder parse() method will. "
        },
        {
            "author": "Joachim Martin",
            "id": "comment-12888541",
            "date": "2010-07-14T21:12:39+0000",
            "content": "I'm having a similar problem with using XInclude to import a transformers.js script file in DataImportHandler:\n\n    <script xmlns:xi=\"http://www.w3.org/2001/XInclude\">\n        <xi:include parse=\"text\" href=\"file:transformers.js\"/>\n    </script>\n\nAt runtime, the XML parser looks for this in my solr directory, not parallel to my db-data-config.xml (in the core/conf directory).\n\nHaving the source for script transformers in a separate js file allows me to use an IDE to check syntax, etc- very helpful.\n\n[I'm assuming this is the same problem, but not sure] "
        },
        {
            "author": "David Smiley",
            "id": "comment-12982339",
            "date": "2011-01-16T17:04:36+0000",
            "content": "It would be really nice to get this into the next version (3.x).  If a committer agrees, can we get the \"fix version\" in JIRA set? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12982340",
            "date": "2011-01-16T17:09:28+0000",
            "content": "I totally missed this issue... i've been fighting with this in the tests myself.\n\nI think we should fix this issue in 3.x, though I don't have the background to\nreview your patch (at a glance the toASCIIString etc makes me nervous,\nbut i have no idea whats going on)  "
        },
        {
            "author": "David Smiley",
            "id": "comment-12998458",
            "date": "2011-02-23T17:17:04+0000",
            "content": "I provided an updated patch:\n\n\tUsing Hoss's suggestion of a HasSystemId interface. However note I couldn't do away with the InputStreamWithSystemId class since Hoss's suggestion of an anonymous inner class doesn't allow extending and implementing an interface at the same time.\n\tAdded documentation of file.toURI().toASCIIString(), which is per rule specified in RFC 2396. I don't claim credit for knowing this, I stole this comment and code out of the JDK in StreamResult.java.\n\tUpdated test to not include the hack of copying the resource to the CWD.\n\n\n\nIs this going to make it into 3.1?  "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12998505",
            "date": "2011-02-23T19:03:55+0000",
            "content": "This path at least fixes the CWD problem in an non-intrusive way using a interface hack. I think that's perfectly fine to preserve the SystemID along with the InputStream.\n\nProblem is that the XML handling is a little bit inconsistent, because it currently only work for files and only if the files are in exact same directory. Theoretically, it should be possible that a XML file that is in the conf folder (which is part of the classpath) can load a file from the lib folder (which is also part of the resource classpath and should work with a relative filename only path) or even from inside a JAR file (if the java package name == classpath directory is identical).\n\nThis could only be solved by e.g. supplying a method RessourceLoader.asFooBarResolver that returns a class that implements both org.xml.sax.EntityResolver, javax.xml.transform.URIResolver (to work with either SAX and TRAX) and delegates all requests to the underlying classloader. Example could be taken from http://www.ibm.com/developerworks/xml/library/x-tipentres.html (warning: this example is not correct, but goes into right direction).\n\nAnother solution might be to not pass streams around, but simply feed the xml parser with the URL.toString() returned by ClassLoader.getResource(). This would also work with JAR files (I use this quite often in my code to parse XSL or other XML files in the JAR file of my programs):\n\n\nfinal URL url=MyClass.class.getResource(\"myXSLTFile.xslt\");\nif (url == null) throw new FileNotFoundException();\nfinal Templates templates = transformerFactory.newTemplates(new StreamSource(t.toString()));\n\n\n\nThis would also successfully load relative resources, but not accross JAR files or different dirs (so \"./anyfile.xml\" would only find the file if its in same java package in same JAR files but not if the file is in a different JAR file or other classpath entry in same package). "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12998509",
            "date": "2011-02-23T19:13:58+0000",
            "content": "Hoss:\n\n\nI'm not positive, believe we could actually take this further by using ClassLoader.getResource() to generate a systemId for items pulled from the classpath as well (but i'm not sure if hte resulting URLs would be of any use to the DocumentBuilder if it doesn't also use the SolrResourceLoader)\n\nThat's perfectly fine, all XML parsers support any URL that java's URL class can load. To passing new InputSource(URL.toString()) always works with all known parsers (see above). "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-12998735",
            "date": "2011-02-24T08:00:24+0000",
            "content": "Will it work if the included file resides in ZooKeeper? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12998739",
            "date": "2011-02-24T08:07:54+0000",
            "content": "Will it work if the included file resides in ZooKeeper?\n\nThat's exactly the problem I am talking about. With my solution it would work if the files can be loaded by the URL with a custom URLConnection class. With David's patch that is attached to this issue, it will not work at all.\n\nThe most complete version would be to wrap the SolrResourceLoader as org.xml.sax.EntityResolver and javax.xml.transform.URIResolver. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12998740",
            "date": "2011-02-24T08:09:16+0000",
            "content": "I will work on a patch doing this today. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999129",
            "date": "2011-02-24T23:46:51+0000",
            "content": "Here is a first mockup (branch_3.x like the previous patch) of the version with EntityResolver.\n\nThis patch has some backwards breaks, because for XML files it is always broken to parse without a system identifier, so the ctors of SolrSchema and SolrConfig should not take InputStream but more a InputSource wrapper. With this patch everything compiles and tests and resolves correctly, but plugins using old methods may fail (needs review).\n\nHow it works:\nThe system identifier is no longer a plain filename with path, it gets initialized using a custom URI scheme \"solrres:\". This scheme is resolved using the EntityResolver that utilizes SolrResourceLoader. As long as somebody only gives relative URLs in XIncludes or anywhere else (this is also extendable to other places, not only xinclude, e.g. external XML entities inside XSLs, config of DIH,...), the files are staying using this scheme and are resolved by the custom EntityResolver. As soon as scheme changes, the default resolver is used.\n\nBecause of this, the good thing is, that somebody can still use absolute filesystem URLs or even external URLs in the xincludes, by using full schemed URIs like file:///my/absolute/path.\n\nOther places in Solr that load XML and support Xinclude must also changed to this, currently almost every place where solr loads XML files from ResourceLoader using InputStreams are broken.\n\nQuestionable is also backwards compatibibility. Ideally there should be a loadResourceAsInputSource() method in ResourceLoader so DIH can also use it, which would also break backwards (interface!).\n\nThis patch is currently only for review about the idea. Comments welcome! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999132",
            "date": "2011-02-24T23:49:29+0000",
            "content": "I forgot: This patch currently hides some deprecated methods in SolrResourceLoader by making them private. This is done to check that no place in solr uses the old methods anymore. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999139",
            "date": "2011-02-25T00:00:48+0000",
            "content": "After thinking a little bit about it, I found out that supporting XInclude at all for InputStream-only resources is broken and also a security leak and should be switched off:\nWith my patch all SolrConfigs/SolrSchemas are correctly loaded using InputSource. But the Config base class is also used e.g. for parsing some requests where the XML comes from network as InputStream only. Supporting xinclude here is broken, as this network stream has no systemId, so I would simply disable xinclude and the EntityResolver if Config class only gets an InputStream instead of InputSource. Also it should not be possible to load arbitrary files from the filesystem referenced by a xml file in a network stream (this is somehow a security leak).\nAfter making the whole thing separate for InputSource and InputStreanm, it could also easily be made backwards compatible, as the InputStream methods are separate and support no xinclude and are not. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12999216",
            "date": "2011-02-25T04:58:24+0000",
            "content": "Uwe, I'm trying to parse your last comment (without having looked at your patch), and it's unclear if you're saying \"xinclude here is broken\" after your patch still or if you fixed that somehow.\n\nIs some fix, either mine or the more comprehensive Uwe fix, going to make it into 3.1? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999262",
            "date": "2011-02-25T08:33:27+0000",
            "content": "My last comment simply means, that enabling XInclude for ConfigParsers that work on InputStreams is broken (e.g. when a request comes in from network via http) because no SystemID. I simply want to change the code to disable xinclude for those parsers.\n\nI will work on my patch today and look for other parts in Solr where XInclude is used or complex XML files that support href-like. One example is DIH, which config file supports xinclude but has the same problem. Also XSLs loaded by xml response writer should use the custom EnityResolver.\n\nI will also make the patch almost backwards compatible.\n\nI will talk with Robert about including into 3.1, I don't see a problem. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999834",
            "date": "2011-02-26T20:26:32+0000",
            "content": "Here is a new patch, redesigned:\n\n\n\tThe resolver was moved into a util class in common pkg. This resolver supports all types EntityResolver, URIResolver, XMLResolver used by inconsistent XML APIs to resolve systemIds\n\tThe backwards breaks were minimized (only in IndexSchema the InputStream was changed to InputSource, because Config needs that).\n\tNot only xincludes use ResourceLoader, also XSLTResponseWriter takes care, so includes/imports of stylesheets are done by ResourceLoader\n\tDIH also loads its config file and support xinclude from ResourceLoader. The API was changed to remove the stupid String containing the config file (that was crazy!)\n\tDIH's XSL loader in XPathEntityProcessor was changed to also use ResourceLoader, before it always used CWD!!!\n\tXInclude is only enabled, if a systemId is available\n\n\n\nI will wait a day until I commit, please review! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999837",
            "date": "2011-02-26T20:31:09+0000",
            "content": "Sorry, last patch was outdated. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999946",
            "date": "2011-02-27T12:41:32+0000",
            "content": "Final patch:\n\n\tAdded a test for the resolver\n\tFixed more config files to use correct systemIds (cores config file)\n\tchanged URI scheme a little bit to use nicer looking authority component for absolute paths\n\thack in resolver for absolute-relative systemIds in HREfs (see comment)\n\n\n\nWill commit soon and port to trunk! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999949",
            "date": "2011-02-27T12:52:47+0000",
            "content": "Committed 3.x revision: 1075044 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999961",
            "date": "2011-02-27T14:16:39+0000",
            "content": "Committed trunk revision: 1075053\n\nAbout the ZooKeeper question: XInclude and all other things should now work with Zookeper. I have no local Cloud installation, so I could not test it, but with my changes all relative hrefs in XML config files should now be resolved through ZK, too, as SkSolrResourceLoader is used for resolving.\n\nMark Miller, can you test this somehow? If it does not work, please reopen. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12999963",
            "date": "2011-02-27T14:26:19+0000",
            "content": "About the ZooKeeper question: XInclude and all other things should now work with Zookeper. I have no local Cloud installation, so I could not test it\n\nIf you have a normal solr instance with an xinclude somewhere under \"conf\", then one can just do this:\n\njava -Dbootstrap_confdir=./solr/conf -Dcollection.configName=myconf -DzkRun -jar start.jar\n\n\nThat's just the first example in http://wiki.apache.org/solr/SolrCloud "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999980",
            "date": "2011-02-27T15:38:41+0000",
            "content": "XInclude fallback does not work because ResourceLoader must throw IOException on missing file.\n\nFixing this in SystemIdResolver "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999982",
            "date": "2011-02-27T15:40:04+0000",
            "content": "Patch, will commit now to trunk and 3.x. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12999983",
            "date": "2011-02-27T15:47:28+0000",
            "content": "fallback fixed in trunk (1075079) and 3.x (1075081) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12999985",
            "date": "2011-02-27T16:05:16+0000",
            "content": "Confirmed that XInclude (and fallback) work in zookeeper. Nice work! "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013242",
            "date": "2011-03-30T15:45:58+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}