{
    "id": "SOLR-9478",
    "title": "Do delta import will loss some documents, when the documents added in the duration of delta import.",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.5.2"
        ],
        "affect_versions": "5.5,                                            5.5.2,                                            6.0",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "hello guys,\nI met a problem when i using the solrcloud mode. When the solr instance run delta-import, it may take \nsome time to be finished( my data source is mysql database). So during this time, the new added documents\nwill loss, the deltaQuery, i use SUBDATE(${dih.last_index_time}, INTERVAL 2 MINUTE), \nlet it run the delta-import 2 mins earlier than the last_index_time, if the delta-import's duration is 5 mins, it will loss the records at the first 3 mins.\n    Our servers doesn't use solr cloud mode before, we deal with this issue is tring to rewrite dataimport.properties file, \nquery the max(sys_time_stamp), which will help to record the max time stamp, and let the solr can run delta import standing \nby the time found in the file, of course, it will never miss docuements. \n   But now, we use solrcloud, the dataimport.properties is on the zookeeper, and we may have multiple collections for the \nsame core.how can i update the dataimport.properties file now in colleciton now? Do you have any solution to help record\n the max(sys_time_stamp) in dataimport.properties, rather than using the time of delta-import start to run?\n\nCheers",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-05T09:52:41+0000",
            "author": "Muḥammad T Jack",
            "content": "Yeah, we got the  same problem. We have two solr instance running on the same shard. ( actually we just have only one shard).\n\nWe are not using dataimport.properties which stored in zookeeper. Since it is difficult to figure out which collection we are using when use collection alias.\n\nWe are using cronjob to run delta import every single minute, but when a delta import running on solr instance. another delta import must wait for it until server free. Just for example , Sometimes it may takes about 3 minutes to finish delta import. So the data changed during this period are lost.\n\nIs there any better solutions to do delta import when solr running on cloud mode ?\n\nThanks\nMuḥammad T Jack ",
            "id": "comment-15464638"
        },
        {
            "date": "2016-09-05T19:24:55+0000",
            "author": "Erick Erickson",
            "content": "Please raise issues like this (which appear to be usage, not a code problem) on the user's list before raising a JIRA. We try to reserve JIRAs for known code issues (bugs or enhancements), not usage questions. \n\nSee the \"mailing lists\" section here: http://lucene.apache.org/solr/resources.html ",
            "id": "comment-15465637"
        },
        {
            "date": "2016-09-06T01:25:41+0000",
            "author": "ted zhu",
            "content": "thank you very much, i 'll send a mail to solr-user\n\nOn Tue, Sep 6, 2016 at 3:25 AM, Erick Erickson (JIRA) <jira@apache.org>\n\n\n\n\n– \nTed Zhu 祝海潮\n\n\tSoftware Development, China*\n\n\n\n\nDirect: +86 (21) 6032 7330Mobile: +86 155 021 91092\n\n*Mintel Information Consulting (Shanghai) Co., Ltd *\n\n*25th Floor | Broad Silver International Building | 398 Huaihai Zhong Road\n\n<http://www.mintel.com/en/apac-consulting/>\n\n– \n\n\n\n\nMintel Group Ltd | London | Chicago | New York | Sydney | Shanghai | Tokyo | Mumbai | Singapore | Kuala Lumpur | Sao Paulo | Belfast\n\nContact details for our offices can be found at http://www.mintel.com/office-locations.\n\nThis email and any attachments may include content that is confidential, privileged, or otherwise protected\nunder applicable law. Unauthorised disclosure, copying, distribution, or use of the contents is prohibited \nand may be unlawful. If you have received this email in error, including without appropriate authorisation, \nthen please reply to the sender about the error and delete this email and any attachments.\n ",
            "id": "comment-15466102"
        }
    ]
}