{
    "id": "SOLR-10803",
    "title": "Mark all Trie/LegacyNumeric based fields @deprecated in Solr7",
    "details": {
        "labels": "",
        "priority": "Blocker",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "7.0",
            "7.1",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "If we want to be able to remove support for legacy numerics from Solr in 8.0, we need to forbid the use of Trie*Field in indices that are created on or after 7.0.\n\nAt a minimum, we can mark them deprecated and plan to remove them in 8.0, so the usual compatibility rules will apply.\n\nat a later date we can (in theory) provide a conversion tool – or convert automatically – to point fields",
    "attachments": {
        "SOLR-10803.patch": "https://issues.apache.org/jira/secure/attachment/12880500/SOLR-10803.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-02T13:35:51+0000",
            "content": "I put the blocker priority since I think it is a better experience if all 7.x indices can be used with Solr 8, but there is also the possibility of just removing Trie*Field in 8.0 and refusing to open any index that would make use of those fields, even if they were created in 7.x. ",
            "author": "Adrien Grand",
            "id": "comment-16034693"
        },
        {
            "date": "2017-06-02T13:54:15+0000",
            "content": "That's a good idea. Disallow to create new indexes with trie fields. Maybe also similar stuff to prevent FieldCache usage? ",
            "author": "Uwe Schindler",
            "id": "comment-16034720"
        },
        {
            "date": "2017-06-02T14:23:18+0000",
            "content": "Maybe also similar stuff to prevent FieldCache usage?\n\n+1 that would be great! Then we could remove FieldCache too in 8.0. ",
            "author": "Adrien Grand",
            "id": "comment-16034775"
        },
        {
            "date": "2017-06-02T15:00:11+0000",
            "content": "FieldCache\nI'd suggest to also enable DocValues by default for all string/numeric/date fields, unless explicitly disabled. I have seen that Solr 7 allows to merge non-docvalues segments to ones with docvalues using uninverter with a special mergepolicy. IMHO, this merge policy should be the default, just printing a line of information to the logs, so users know that their index segments are updated and this may temporarily require more ram. When using an index created with 7.x  (maybe using the new metadata added by Adrien Grand recently) and something tries to access FieldCache (e.g. for sorting or facetting or functions), it should fail the query.\n\nIn addition, the merge policy could also be used to convert Trie* to Point* values by first uninverting (if no docvalues on trie) and redindexing the fields during merging... (not sure how to do this, but should work somehow). ",
            "author": "Uwe Schindler",
            "id": "comment-16034822"
        },
        {
            "date": "2017-06-03T04:42:48+0000",
            "content": "\nQuick side digressions...\n\nMaybe also similar stuff to prevent FieldCache usage? ... I have seen that Solr 7 allows to merge non-docvalues segments to ones with docvalues using uninverter with a special mergepolicy. ...\n\nThat feels like a very orthoginal idea (or 2?) that should really be discussed in their own Jiras since they are broader in scope then just Trie vs Point.  (I'm not familar enough with what would be involved to even create the jira)\n\n\nI'd suggest to also enable DocValues by default for all string/numeric/date fields, unless explicitly disabled.\n\nI like this idea – but it's definitely orthoginal to the topic at hand.\n\nI've spun that off into SOLR-10808\n\n\n\n\nI put the blocker priority since I think it is a better experience if all 7.x indices can be used with Solr 8, but there is also the possibility of just removing Trie*Field in 8.0 and refusing to open any index that would make use of those fields, even if they were created in 7.x.\n\nCoincidently, sarowe & cassandra & I were just talking yesterday about our concerns that beyond \"known gaps\" in terms of Solr features that work with Trie fields but not (yet) Point fields (ex:  SOLR-9989, SOLR-10503, SOLR-9985, etc...) a larger concern as we move towards 7.0 is that test coverage of PointFields in Solr is currently pretty shallow.  We don't really have a very good idea of what does/doesn't work with PointFields, which is disconcerting for pushing them as the \"default\" (or \"recommended\") numeric types in Solr – let alone forbiding the use of (new) Trie fields as suggested here.\n\nWhich is why I've started working on SOLR-10807 – the current aim is a quick and dirty way to help identify all of the potentially problematic areas as quickly as possible, by forcing every test to use PointFields instead of TrieFields.  See comments in that Jira for details, but the nutshell is: at this point it's hard to guess how many features/test might fail if we cut over to PointFields – because a big portion of our tests are using/expecting the 'id' field to be numeric, and before we can even get to the meat of the test, using a Point based numeric as the 'id' field causes all sorts of problems because they don't have any 'Terms' for updateDocument/deleteDocument\n\nIn addition, the merge policy could also be used to convert Trie* to Point* values by first uninverting (if no docvalues on trie) and redindexing the fields during merging... (not sure how to do this, but should work somehow).\n\nIf we think it's viable to create a MergePolicy (Wrapper) that could convert Trie fields to Point fields, then my straw many suggestion would be that in 7.x we only discourage Trie fields, but not ban them completely – with some strongly worded warnings that Trie Fields will be completely removed in 8.0, and any index that uses them will require manual upgrade using a special converstion tool.\n\nAs things stand today, even if that MergePolicy/tool doesn't yet exist when 7.0 comes out, I'd rather say \"7.x indexes using Trie fields MAY require reindexing in 8.0, pending possible development of a tool to upgrade Trie fields to Point fields\" then ban Trie fields outright.\n\n(Hell: As things stand today, even if we were confident it would be impossible to create such a tool/mergepolicy, I'd still rather say \"7.x indexes using Trie fields will REQUIRE reindexing in 8.0\" then to change the default configsets in 7.0 to use Points, let alone ban new Trie fields)\n\n\n ",
            "author": "Hoss Man",
            "id": "comment-16035800"
        },
        {
            "date": "2017-06-30T04:02:56+0000",
            "content": "Maybe also similar stuff to prevent FieldCache usage?\nCreated SOLR-10982. Feel free to comment there. ",
            "author": "Tomás Fernández Löbbe",
            "id": "comment-16069435"
        },
        {
            "date": "2017-07-07T16:01:48+0000",
            "content": "Seems like SOLR-10760 should be sufficient to have people use point fields by default. ",
            "author": "Yonik Seeley",
            "id": "comment-16078292"
        },
        {
            "date": "2017-07-07T21:38:52+0000",
            "content": "Seems like SOLR-10760 should be sufficient to have people use point fields by default.\n\nThat doesn't address the broader scope of concerns uwe & adrien expressed about what happens to people who already use Trie fields (or add them to collections they create with solr7) when solr8 comes around.\n\n(Assuming SOLR-10760 makes it into 7.0) Perhaps this issue should be renamed/reclassified as \"Mark all Trie/LegacyNumeric based fields @deprecated in Solr7\" – At which point the existing checks in SolrResourceLoader will log a warning and we'll be free to remove them in solr8 ",
            "author": "Hoss Man",
            "id": "comment-16078736"
        },
        {
            "date": "2017-07-20T00:34:33+0000",
            "content": "since i haven't seen any objections, i've updated the summary/description. ",
            "author": "Hoss Man",
            "id": "comment-16094008"
        },
        {
            "date": "2017-07-20T00:45:46+0000",
            "content": "we can't actually do this until we have a non-LegacyIntField/LegacyNumericUtils version of EnumField.  setting SOLR-11023 as a blocker. ",
            "author": "Hoss Man",
            "id": "comment-16094019"
        },
        {
            "date": "2017-07-20T18:06:45+0000",
            "content": "Bulk editing 27 jiras matching the following JQL query to include the \"numeric-tries-to-points label...\n\n\n(issue in linkedIssues(SOLR-10807) OR issue in linkedIssues(SOLR-8396) OR issue in linkedIssues(SOLR-9995)) AND project = SOLR AND status != CLOSED\n\n\n\nthese 27 jiras can be identified by searching for the comment string \"20170720hossbulkeditlabel\"\n\nemail notification is being suppressed. ",
            "author": "Hoss Man",
            "id": "comment-16095111"
        },
        {
            "date": "2017-08-04T23:53:58+0000",
            "content": "Patch deprecating all Trie-related classes.\n\nCommitting shortly. ",
            "author": "Steve Rowe",
            "id": "comment-16115130"
        },
        {
            "date": "2017-08-04T23:55:12+0000",
            "content": "Commit 6aeae1c0a87d587cec94622fc582510745db4cec in lucene-solr's branch refs/heads/branch_7_0 from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6aeae1c ]\n\nSOLR-10803: Mark all Trie/LegacyNumeric based fields @deprecated in Solr7. ",
            "author": "ASF subversion and git services",
            "id": "comment-16115132"
        },
        {
            "date": "2017-08-04T23:55:15+0000",
            "content": "Commit 0278603e980e00d316e8354230609fc66deb17e0 in lucene-solr's branch refs/heads/branch_7x from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0278603 ]\n\nSOLR-10803: Mark all Trie/LegacyNumeric based fields @deprecated in Solr7. ",
            "author": "ASF subversion and git services",
            "id": "comment-16115133"
        },
        {
            "date": "2017-08-04T23:55:17+0000",
            "content": "Commit f962effd128345c60d4f0cbe41e00d5baa5fdbbb in lucene-solr's branch refs/heads/master from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=f962eff ]\n\nSOLR-10803: Mark all Trie/LegacyNumeric based fields @deprecated in Solr7. ",
            "author": "ASF subversion and git services",
            "id": "comment-16115134"
        },
        {
            "date": "2017-10-17T11:04:21+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16207462"
        }
    ]
}