{
    "id": "SOLR-10595",
    "title": "Redirect Confluence pages to new HTML Guide",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Once the new Ref Guide is live, we may want to redirect pages from Confluence to the new HTML version. \n\nI'm undecided if this is the best idea, I can see pros and cons to it. On the pro side, I think it helps firmly establish the move away from Confluence and helps users adjust to the new location. But I could see the argument that redirecting is overly invasive or unnecessary and we should just add a big warning to the page instead.\n\nAt any rate, if we do decide to do it, I found some Javascript we could tell Confluence to add to the HEAD of each page to auto-redirect. With some probably simple modifications to it, we could get people to the right page in the HTML site: https://community.atlassian.com/t5/Confluence-questions/How-to-apply-redirection-on-all-pages-on-a-space/qaq-p/229949",
    "attachments": {
        "solr_name_to_new.map.txt": "https://issues.apache.org/jira/secure/attachment/12881573/solr_name_to_new.map.txt",
        "new-page-urls.txt": "https://issues.apache.org/jira/secure/attachment/12867444/new-page-urls.txt",
        "solr_redirects.conf": "https://issues.apache.org/jira/secure/attachment/12881571/solr_redirects.conf",
        "page-tree.xml": "https://issues.apache.org/jira/secure/attachment/12867441/page-tree.xml",
        "solr_id_to_new.map.txt": "https://issues.apache.org/jira/secure/attachment/12881572/solr_id_to_new.map.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-10T21:54:49+0000",
            "content": "the only downside to the javascript approach is that search engines would never \"de-index\" the cwiki pages in favor of the new ones.\n\nI think the ideal solution would be:\n\n\n\task infra to modify the cwiki configs so any https://cwiki.apache.org/confluence/display/solr/.* URLs get rewritten to something like https://lucene.apache.org/solr/guide/old/*\n\tsetup our own rewrite mapping rules for each URL from /solr/guide/old/.* to ... whatever\n\n\n\n(doing 2 redirects means we can directly tweak the mappings later if we decide we want to, w/o neeing to involve infra) ",
            "author": "Hoss Man",
            "id": "comment-16005522"
        },
        {
            "date": "2017-05-10T22:02:34+0000",
            "content": "Adding page-tree.xml from Confluence conversion. ",
            "author": "Cassandra Targett",
            "id": "comment-16005530"
        },
        {
            "date": "2017-05-10T22:24:11+0000",
            "content": "ask infra to modify the cwiki configs so any https://cwiki.apache.org/confluence/display/solr/.* URLs get rewritten ...\n\nHmmm... the only hitch to that plan is that for pages with \"special\" characters in their names, cwiki doesn's use URLs with the space (/solr/ in them, and just uses the pageId as the URL...\n\n\n\tCross Data Center Replication (CDCR)\n\t\n\t\thttps://cwiki.apache.org/confluence/pages/viewpage.action?pageId=62687462\n\t\n\t\n\tCollections / Core Admin\n\t\n\t\thttps://cwiki.apache.org/confluence/pages/viewpage.action?pageId=32604191\n\t\n\t\n\tPlugins & Stats Screen\n\t\n\t\thttps://cwiki.apache.org/confluence/pages/viewpage.action?pageId=32604180\n\t\n\t\n\n\n\n...i think there are handul more like that (with \"/\" in their title)\n\nIn any case, i'm attaching a tab delimited file based on the page-tree.xml that cassandra provided with the pageId,new-short-name,Original Title of every cwiki page – we can ultimately use this to create whatever type of redirect mapping we need (mod_rewrite RewriteMap dbm file, javascript, whatever...)\n\n\n\nFile created via with the following perl one liner, followed by a little manual cleanup...\n\n\nperl -nle 'if (/<page id=\"(.*?)\" title=\"(.*?)\"/) { my ($n, $title) = ($1,$2); my $url = $title; $url =~ tr/A-Z/a-z/; $url =~ s/[^a-z0-9]+/-/g; print \"$n\\t$url\\t$title\" }' < page-tree.xml  > new-page-urls.txt\n\n ",
            "author": "Hoss Man",
            "id": "comment-16005556"
        },
        {
            "date": "2017-07-10T09:25:15+0000",
            "content": "+1 to try to get a proper HTTP redirect 301 Moved Permanently.\n\nHoss' plan for a 2-phase redirect sounds good. Benefit is that Google et.al will transfer the \"Page rank\" of the old cwiki pages onto the new HTML ref guide so they do not need time building up cred from scratch. However, if the redirects go to a particular version (6_6) then that is kind of waste anyway, since once we're at e.g. 7.5 the old CWIKI links would still redirect to the 6.6 refguide... Which begs the question whether we should establish a version-less URL for the ref-guide, which do not redirect to a particular version but stays on that URL? It could be e.g. http://lucene.apache.org/solr/guide/latest/ ??\n\nGuess the front-page of the ref-guide is a special case, which could permanently redirect to http://lucene.apache.org/solr/guide/ ",
            "author": "Jan Høydahl",
            "id": "comment-16080057"
        },
        {
            "date": "2017-07-11T13:47:31+0000",
            "content": "Which begs the question whether we should establish a version-less URL for the ref-guide\n\nThis already exists - put in https://lucene.apache.org/solr/guide/coreadmin-api.html and it redirects to https://lucene.apache.org/solr/guide/6_6/coreadmin-api.html. There is a rule in .htaccess to redirect to the proper version, which will change as new versions are released:\n\n\nRedirectMatch temp /solr/guide/(?!index.html)([a-z].*) /solr/guide/6_6/$1\n\n\n\nI can't remember what issue I did that on, but it was around the time of the 6.6 release. ",
            "author": "Cassandra Targett",
            "id": "comment-16082213"
        },
        {
            "date": "2017-07-11T20:07:36+0000",
            "content": "Note the rest of my sentence that you quoted from: \"...which do not redirect to a particular version but stays on that URL\"\n\nIf we redirect confluence to this redirect that in turn redirects to 6_6 then the PageRank of a page will not be permanently transferred to a stable URL in the new guide but to a moving target.. ",
            "author": "Jan Høydahl",
            "id": "comment-16082879"
        },
        {
            "date": "2017-08-08T17:36:25+0000",
            "content": "\nNote the rest of my sentence that you quoted from: \"...which do not redirect to a particular version but stays on that URL\"\nIf we redirect confluence to this redirect that in turn redirects to 6_6 then the PageRank of a page will not be permanently transferred to a stable URL in the new guide but to a moving target..\n\nThe existing /guide/foo -> /guide/X_Y/foo redirects are 302(temporary) redirects, so in theory any bookmark/link/301(permanenant) redirect to /guide/foo should maintain the existing PageRank/goodness/history of the original page, even if /guide/foo then ultimately does a 302(temporary) redirect to some other /guide/X_Y/foo\n\n(If folks really wnat to go further and have /guide/latest/foo URLs that serve up content w/o a redirect that should probably be discussed in it's own broader scope jira along with doing the same for javadocs ... IIRC that idea – for jdocs – was proposed in the past and deemed confusing for folks who try to bookmark the docs for the \"current\" release they are using, and then come back later and the same url they bookmarked before now talks about code newer then what they are using)\n\n\nBut frankly: regardless of wether a \"latest\" URL redirects or does a server side rewrite, I think having the cwiki redirects go to version-less URLs is a bad idea.  If you asked me 5 months ago i would have been on board, but the switch to asciidoc has already started facilitating/motivating people to discuss ideas about how to revamp and re-organize the content into new pages (with new URLs) now that it's so much easier to edit, and I'm concerend that having cwiki->/guide/latest redirects will be harmful in the long run as the content on those pages change and/or pages get renamed, moved, etc....\n\nI think in the long term it's better for our users to (301-permenantly) redirect the cwiki URLs to guide/6_6 since that's what those cwiki pages – at the moment they were last in use – most directly map to content wise.\n\nIf we're going to worry about people with \"old\" bookmarks/links finding \"old\" versions of pages, we should wory about that and care about it just as much/more with the existing /guide/X_Y URLs moving forward (as new versions get released) as we might care about legacy cwiki.apache.org urls – and solve that type or probably independently (possible with a javascript+css info box or something like that in the hosted HTML pages?)\n\nFor the same reasons/concerns, I no longer think my original suggestion of a \"two layer\" redirect is a good idea – depending on how we might implement the cwiki.apache.org/.* -> /guide/old/. URLs (301 vs 302) and likewise how (301 vs 302) we might do the /guide/old/. -> /guide/X_Y (or /guide/old/.* -> /guide/latest) i feel like things could get really complicated/confusing/bad in terms of what URLs google displays in results, how bookmarks get updated, etc...\n\n\n\nI think the next step should be to file an INFRA jira requesting new redirects added on cwiki.apache.org that 301 redirect the old cwiki page names/numbers directly to the lucene.apache.org/solr/guide/6_6/ equivilent URLs, and work with infra to provide the redirect rules in whatever format they prefer (list of RewriteRules, DB mapping file, etc...) in the aim of redirecting as many URL variants as reasonably possible.\n\nExample: both of these URLs below should redirect to https://lucene.apache.org/solr/guide/6_6/function-queries.html\n\n\n\thttps://cwiki.apache.org/confluence/display/solr/Function+Queries\n\thttps://cwiki.apache.org/confluence/pages/viewpage.action?pageId=32604260\n\n\n\n\nIf there are no objections in the next day or two, i'll follow up with infra on how to proceed.\n ",
            "author": "Hoss Man",
            "id": "comment-16118709"
        },
        {
            "date": "2017-08-08T17:49:26+0000",
            "content": "Not exactly an objection and since y'all have been doing the heavy lifting whatever you decide is fine by me...\n\nThe new doc site lacks search as we all know. Doing a redirect makes it harder to find, say ADDREPLICA for instance. Does it make sense to sequence redirects after search works on the new site? ",
            "author": "Erick Erickson",
            "id": "comment-16118744"
        },
        {
            "date": "2017-08-08T21:33:41+0000",
            "content": "I see the benefit of redirecting cwiki to 6_6 guide, and they probably outweigh the downsides. As time passes, the new guide will have built a reputation of its own.\n\nStill, I fear that people searching for e.g. \"solr function queries\" in the future will be served an arbitrary version of the guide, whichever happens to have the highest cred out there. I hate it when I land on an outdated guide version when searching for a specific product feature. But that can be mitigated by flashing a warning that a newer version exists, and preferably offer a link to corresponding page for that version.\n\n+1 to go ahead with Hoss' plan. ",
            "author": "Jan Høydahl",
            "id": "comment-16119060"
        },
        {
            "date": "2017-08-09T17:44:30+0000",
            "content": "But that can be mitigated by flashing a warning that a newer version exists, and preferably offer a link to corresponding page for that version.\n\nSpun off into LUCENE-7924\n\nDoing a redirect makes it harder to find, say ADDREPLICA for instance. Does it make sense to sequence redirects after search works on the new site?\n\nAdding search to the new ref-guide seems like an orthoginal issue to adding redirects.  But for the sake of argument, let's assume for now they should be considered part and parcel...\n\nTo you, today, as an experienced user of cwiki: adding redirects may make it harder to find the docs on ADDREPLICA because you have preconcieved impressions that going to an existing page on cwiki.apache.org and doing a search in that search box will help you find it – but the docs you find that way are stale and out of date.  A new user – even if you deliberately instilled in them the preconcieved knowledge that going to cwiki is the best way to find docs – may get frustrated when they can't find docs on commands/features added after the ref-guide migration using that same approach (and the likehook of that happening will only increase – never decrease – as time goes on and more docs are added/changed).  In the more general case that a new user does NOT already have preconcieved knowledge that going to cwiki is the best way to find docs, they are most likely to try and find dogs using google/web-search – in which case the (current) lack of redirects means they are in roughly the same boat: they are very likely to first find stale / out of date (and growing more out of date daily) documentation.\n\nadding cwiki->lucene.apache.org redirects seems like it can only improve the situation for most users – independent of the question of when/how we add new (explicit) search functionality for the current hosted ref-guide.\n\n\n\nI'll prep some mapping files and file an INFRA link soon. ",
            "author": "Hoss Man",
            "id": "comment-16120341"
        },
        {
            "date": "2017-08-09T18:08:25+0000",
            "content": "I'll prep some mapping files and file an INFRA link soon.\n\n+1, I'm on board with what you've outlined so far. ",
            "author": "Cassandra Targett",
            "id": "comment-16120388"
        },
        {
            "date": "2017-08-09T22:28:30+0000",
            "content": "This already exists - put in https://lucene.apache.org/solr/guide/coreadmin-api.html and it redirects to https://lucene.apache.org/solr/guide/6_6/coreadmin-api.html. \n\nThis will not survive renames or restructuring. An elegant approach would be that /solr/guide/foo would return the page from the latest version that returns a 200 response for that page name. I.e. we could have a CGI that either looks up a static list of valid pages per release or attempts a HEAD request against newest first and then each older release before returning a 301 redirect to the correct page. ",
            "author": "Jan Høydahl",
            "id": "comment-16120755"
        },
        {
            "date": "2017-08-11T23:46:13+0000",
            "content": "\nAn elegant approach would be that ...\n\nI'm not really sure that understand what you're suggesting, or how it would be beneficial in the long run – but it definitely seems to be off topic for this particular jira given the concensus so far... Did you mean to post that in the LUCENE-7924 issue i spun off?\n\n\n\n\nUgh ... it's been far too long since i had to do non-trivial stuff with mod_rewrite.  My RewriteMap+RewriteCond-fu was weak and took far longer then i expected to get these working...\n\nI've tested the attached solr_redirects.conf as best I could using a mock-server, with the attached *.map.txt files generated using the following perl scripts...\n\n\nperl -nle 'chomp; @x = split /\\s+/, $_, 3; print \"$x[0] /$x[1].html\"' < ../new-page-urls.txt > solr_id_to_new.map.txt\n\nperl -nle 'chomp; @x = split /\\s+/, $_, 3; $x[2] =~ s/\\s+/\\+/g; print \"$x[2] /$x[1].html\"' < ../new-page-urls.txt > solr_name_to_new.map.txt\n\n\n\n...and then manually tweaking the entry for \"/\" and adding the header comments.\n\nI'll open an INFRA ticket with a summary of what we want and link back here. ",
            "author": "Hoss Man",
            "id": "comment-16124281"
        },
        {
            "date": "2017-08-29T15:41:35+0000",
            "content": "Just FYI, INFRA-14971 makes getting any sort of redirect in place - even if it's not perfect - a bit more pressing: People using the old Ref Guide are now missing critical info since somehow all data in code blocks have mysteriously disappeared. See https://cwiki.apache.org/confluence/display/solr/Post+Tool for just one example. ",
            "author": "Cassandra Targett",
            "id": "comment-16145501"
        },
        {
            "date": "2017-08-29T16:54:16+0000",
            "content": "cassandra pointed out to me offline that i never explicitly mentioned in a comment here: INFRA-14849  is the issue we're currently \"blocked\" on to have the actual redirects added (i linked the jiras when i created it weeks ago, but didn't explicitly call it out in a comment so folks might have missed it) ",
            "author": "Hoss Man",
            "id": "comment-16145662"
        },
        {
            "date": "2017-09-28T17:03:11+0000",
            "content": "infra has deployed these changes. ",
            "author": "Hoss Man",
            "id": "comment-16184470"
        }
    ]
}