{
    "id": "SOLR-12641",
    "title": "Support rolling updates when jira/http2 get merged",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Right now, Http2SolrClient can't connect to old Solr nodes, this seems an issue of Jetty HTTP client (https://github.com/eclipse/jetty.project/issues/1308). To support rolling updates, this problem must be solved.\n\nAfter discussing with other guys, we agree that rolling updates can be no support in Solr 8.0 with default settings since it is a major release. Users who want to do rolling updates must follow these two steps.\n\n\tUpgrade nodes will start with a special flag to indicate that they will use HTTP/1.1 as the protocol for intercommunication.\n\tWhen all nodes are in version 8.0, restart nodes and remove above special flag, therefore nodes will communicate with others using HTTP/2 from thereafter.\n\n\n\nThis issue will aim to introduce that special flag. Note that by default HTTP/2 still the default protocol for Solr 8.0.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-13T15:23:25+0000",
            "content": "Quoting elyogreg from Jetty #1350:\n@elyograg that is correct, there is no way to do it currently. An instance of HttpClient is created with a specific transport and currently cannot switch to another transport.\n\nYou can partially workaround this by having two HttpClient instances, one with the HTTP/1.1 transport and one with the HTTP/2 transport, but you have to try one, if it fails try the other, it's clunky.\nSeems like currently the only way is to try and use the HTTP2 client, and fail over to the HTTP1.1 client, until issue #1350 is resolved. ",
            "author": "Bar Rotstein",
            "id": "comment-16578441"
        },
        {
            "date": "2018-08-15T04:26:38+0000",
            "content": "Yeah, we must have a workaround if #1350 is not resolved. ",
            "author": "Cao Manh Dat",
            "id": "comment-16580701"
        },
        {
            "date": "2018-09-03T11:09:39+0000",
            "content": " The first solution is\n\n\tUsing HTTP/1.1 as default for Http2SolrClient in Solr 8.0, therefore nodes will communicate with others using HTTP/1.1 (note that servers still accept both HTTP/1.1 and HTTP/2 connections)\n\tDo rolling updates \n\tWhen all nodes are in version 8.0, restart nodes with enabling HTTP/2 flag for Http2SolrClient, therefore nodes will communicate with others using HTTP/2 from thereafter.\n\n\n\nThe second solution can be adding a HTTP/2 flag support on clusterstate for every replica. Whenever a new connection is created we will base on that flag to create proper HTTP/2 or HTTP/1.1 connection. This can a little bit tricky and needs more tests to make sure everything works correctly.\n\nWhat do you guys think Shawn Heisey, Steve Rowe, Shalin Shekhar Mangar ",
            "author": "Cao Manh Dat",
            "id": "comment-16602046"
        },
        {
            "date": "2018-09-10T08:15:15+0000",
            "content": "Commit afe88fb8b85eebc42b02c8bdd8fd54e70907d1e2 in lucene-solr's branch refs/heads/jira/http2 from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=afe88fb ]\n\nSOLR-12641: Support rolling updates when jira/http2 get merged ",
            "author": "ASF subversion and git services",
            "id": "comment-16608852"
        }
    ]
}