{
    "id": "SOLR-1772",
    "title": "UpdateProcessor to prune \"empty\" values",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Wish",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Users seem to frequently get confused when some FieldTypes (typically the numeric ones) complain about invalid field values when the inadvertantly index an empty string.\n\nIt would be cool to provide an UpdateProcessor that makes it easy to strip out any fields being added as empty values ... it could be configured using field (and/or field type) names or globs to select/ignore certain fields – i haven't thought it through all that hard",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12836173",
            "date": "2010-02-20T14:19:50+0000",
            "content": "Going forward this should be less of an issue since the new numeric types all do validation on their input. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12836933",
            "date": "2010-02-22T22:00:25+0000",
            "content": "Actually my point is that the new FieldTypes make it  more of an issue (in the eyes of end users) because now Solr errors out on empty (numeric) field values ... having an UpdateProcessor like this would be an easy solution for people who just want a simple way to tell Solr to ignore empty fields (with certain names, or certain types) "
        },
        {
            "author": "David Smiley",
            "id": "comment-12837939",
            "date": "2010-02-24T18:32:42+0000",
            "content": "I was just talking to a Solr user who was confused that the empty string was being indexed at all, for fields that aren't even numbers.  They thought this was equivalent to not sending it any value.  I haven't verified this first hand but I believe it.  Perhaps it would make sense for all fields types to ignore an empty string by default, and then if for some weird reason I can't contemplate, you could disable it for a certain field.  Does that make sense? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12838008",
            "date": "2010-02-24T21:40:43+0000",
            "content": "David - I think that could make sense.  I'd almost rather see the default behavior changed rather than to put another configurable component in the chain that would slow things down (slightly) for everyone. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12839812",
            "date": "2010-03-01T19:27:22+0000",
            "content": "I'd almost rather see the default behavior changed rather than to put another configurable component in the chain that would slow things down (slightly) for everyone.\n\nThat seems backwards – if FieldType(s) start checking for the empty string, that's a few extra cycles of cost that everyone spends even if their indexing clients are already well behaved and only send \"real\" values.\n\nAdding it as an optional UpdateProcessor makes it something that only people who need hand holdinghave to spend cycles on.\n\n... confused that the empty string was being indexed at all, for fields that aren't even numbers. They thought this was equivalent to not sending it any value. I haven't verified this first hand but I believe it.\n\nNope: there are many use cases for both strings and numbers where you may need to \"skip\" a value in a multiValued field – parallel arrays and such. ... it's actually one main situations we still have where IntField comes in handy (besides just supporting completely legacy Lucene indexes) "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-13222212",
            "date": "2012-03-05T08:15:02+0000",
            "content": "Hoss: is this same with a part of SOLR-2802 (RemoveBlankFieldUpdateProcessorFactory)? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13222542",
            "date": "2012-03-05T19:30:40+0000",
            "content": "yep ... covered as part of SOLR-2802 "
        }
    ]
}