{
    "id": "SOLR-3651",
    "title": "unable to find Instance directory names with \".\"",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "multicore"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "In multicore scenario, if I have \".\" in instance directory name - it is not able to find it in solr UI or even not able to ping it due to which I'm not able to get the statistics regarding that particular index like last modified time etc..\n\nExample:\n\nTry giving an instance directory name as \"vempap.public.message\" - you can see the core loaded in the UI, but when you click on it - it says \"vempap.public.message\" Not Found .. I spent a lot of time debugging & now, when I just replace \".\" with \"_\" - it works fine & well..\n\nPlease let me know if it is intended to be like that or it is a bug. Sorry it is already mentioned earlier - couldn't find related bug when I did a quick search.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13418729",
            "date": "2012-07-19T22:25:15+0000",
            "content": "Phani: just to be clear, am i correct in understanding that you only see problems with these core names in the admin UI?  correct?\n\nie: when you say \"...or even not able to ping it\" and \"I'm not able to get the statistics\" you mean that in the UI, you can't use the 'Ping' button, or view the UI page listing statistics – correct?  \n\nIf you try to access /solr/vempap.public.message/admin/ping or /solr/vempap.public.message/admin/mbeans do those URLs load?\n\ndo you see any problems in the solr logs?\n\n\n "
        },
        {
            "author": "Phani Vempaty",
            "id": "comment-13418761",
            "date": "2012-07-19T23:01:28+0000",
            "content": "Hello Hoss,\n\nYes, that is correct.\n\nI'm not able to see anything in solr logs - no exceptions nothing.\n\neven, when I try to load it directly, it says \"404 Not Found #/vempap.public.message\"\n\nI tried debugging how the request is passing - for some means proper path is not being sent to the \"SolrDispatchFilter\" (the request path is just /) .. but when I change \".\" with \"_\", then it gets the correct path. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539586",
            "date": "2016-10-02T02:43:06+0000",
            "content": "Is this still an issue with new Admin UI in latest Solr? "
        }
    ]
}