{
    "id": "SOLR-10296",
    "title": "Convert existing Ref Guide and post-conversion cleanup",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "We have developed several tools and scripts for converting the Ref Guide out of Confluence which get us most of the way to a fully converted set of pages. However, we already know that there are several issues that could not be automated.\n\nFrom https://github.com/ctargett/refguide-asciidoc-poc/issues/27, we have this list:\n\n\n\tThe conversion process will insert TODOs for several items that we thought might be problematic during conversion; these need to be reviewed and resolved. Some of these items are also covered in the below topics.\n\tBlock elements in tables. The current version of the PDF creation tool we are using does not handle those properly (see https://github.com/ctargett/refguide-asciidoc-poc/issues/13). In some cases, we should remove the table entirely and present the content in a new way (using, most often, labled lists instead).\n\tReview and (usually) remove huge Tables of Contents from the top of pages. The current design of the online version will automatically create a TOC for the page, we don't need another one and in some cases this TOC was hand-created so can't be removed via conversion.\n\tNon-image attachments. Some SVG files will be converted to images, but they should not be treated as images.\n\tFailed link conversions. Despite my best attempts, many dummy URLs are treated by Confluence as real URLs (meaning, dummy URLs like http://<host>:<port>/solr are coded in Confluence's XHTML with <a> tags). These will be converted as URLs but will throw errors during the conversion process. In some cases, the URLs aren't just these example URLs but are indicative of a real problem that needs to be resolved.\n\tSpurious <br/> tags. Some API pages have a list of available calls structured as a list but without being a real ordered or unordered list. These will convert badly. The issue https://github.com/ctargett/refguide-asciidoc-poc/issues/31 has a list of pages where this might be a problem.\n\tAppropriate Lead Paragraphs. The stylesheet for HTML pages will make the first paragraph of every HTML page a slightly larger font, by way of introduction. In many cases, the first paragraph is not really ready for that sort of treatment and should be revised to be a more succinct introduction to the feature or further contents of the page.\n\n\n\nMore problems may be added to this issue as items that specifically need to be cleaned up.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-15T20:53:25+0000",
            "content": "One thing about this is that Confluence will need to be locked against any editing after we do an export and start conversion/cleanup (We can convert 100 times with no issues, it's the effort into the post-conversion cleanup that we don't want to waste). This can be easily achieved with permissions, by denying everyone edit access but only read/comment access. (Maybe, actually, \"everyone - 1\" so someone can still get in there if necessary.) ",
            "author": "Cassandra Targett",
            "id": "comment-15926978"
        },
        {
            "date": "2017-05-03T22:26:39+0000",
            "content": "To add to the list, so I don't forget. There are 2 pages in Confluence that use the excerpt macro and 3 places that use the excerpt-include macro to pull in the section from one of the other pages. The fact that these contain shared content is lost during the conversion.\n\nThe pages are:\n\n\n\thttps://cwiki.apache.org/confluence/display/solr/Collection-Specific+Tools (collection-specific-tools.adoc) has an excerpt that is pulled into https://cwiki.apache.org/confluence/display/solr/Core-Specific+Tools (core-specific-tools.adoc) and https://cwiki.apache.org/confluence/display/solr/Using+the+Solr+Administration+User+Interface (using-the-solr-administration-user-interface.adoc)\n\t\n\t\tThese pages have an additional problem, which is that the content is mostly links to other pages, and during conversion those are turned into hard-coded links back to Confluence. This might actually be coming from the export from Confluence, but it really doesn't matter where it comes from, they'll need to be fixed.\n\t\n\t\n\thttps://cwiki.apache.org/confluence/display/solr/Field+Type+Definitions+and+Properties (field-type-definitions-and-properties.adoc) has an excerpt that is pulled into https://cwiki.apache.org/confluence/display/solr/Defining+Fields (defining-fields.adoc)\n\n\n\nThere are a couple options for resolution IMO:\n\n\n\tIgnore the problem for now. Content is duplicated across pages, but these two cases aren't really that onerous.\n\tStart an \"inclusion library\" of small bits of content that isn't a standalone page, but is designed to be pulled into other pages when they are built as HTML and PDF. I want to start doing this eventually, but hoped to avoid it until we got everything all set up and stabilized.\n\n\n\nThe right solution might be a mix of both - ignore it for now, and hopefully soon introduce the inclusion library in a more thoughtful way. ",
            "author": "Cassandra Targett",
            "id": "comment-15995805"
        },
        {
            "date": "2017-05-05T15:31:02+0000",
            "content": "As of this morning, I've locked Confluence for all edits to pages. I made new exports, and ran them through the conversion scripts.\n\nSince I just did this a couple weeks ago, there weren't many pages changed. This commit: https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=4dca53bf59e138b90db7b89c7cf9ca37fcadbe46 has all the updated files, so the jira/solr-10290 branch is up to date with Confluence as of this morning. ",
            "author": "Cassandra Targett",
            "id": "comment-15998463"
        },
        {
            "date": "2017-05-08T21:03:32+0000",
            "content": "Checkpoint: Cassandra and I (mostly cassandra) have been working on a lot of this since friday morning.\n\nHere's where \"things left todo\" stand AFAICT....\n\n\n\twe've manually added some TODO comments to the source where we punted on decisisons while working through the docs - those are going to need some discussion\n\tthere was a conveniently timed PDF plugin update over the weekend that solved a lot of the table issues for us so that the formatting is fine for now – but one thing we still need to address is the column widths so that the tables are readable\n\t\n\t\twe also need to remove the automatically generated TODO comments saying that those tables need fixed\n\t\n\t\n\tthe \"hard coded\" table of contents should have all been cleaned up, but there's a new issue in SOLR-10612 about some auto-generated TOC cleanup we want to do\n\tI think cassandra still needs to commit some of the non-image attachments (ie: SVGs) from cwiki?\n\tlinks should all be fixed - so we should be free and clear to bulk remove the OLD_CONFLUENCE_ID comments in all the source files\n\tI think we still need to audit the list of pages mentioned here for BR cleanup: https://github.com/ctargett/refguide-asciidoc-poc/issues/31\n\texcerpt / excerpt-include decisions\n\ti'd like to sanity check the output of this grep command to make sure we don't have any code blocks that are going to be syntax highlighted in a totally nonsense manner...\n\ngrep -A4 '\\[source,.*\\]' src/*.adoc\n\n\n\n ",
            "author": "Hoss Man",
            "id": "comment-16001527"
        },
        {
            "date": "2017-05-08T21:13:47+0000",
            "content": "\n\n\tthere was a conveniently timed PDF plugin update over the weekend that solved a lot of the table issues for us so that the formatting is fine for now – but one thing we still need to address is the column widths so that the tables are readable\n\t\n\t\twe also need to remove the automatically generated TODO comments saying that those tables need fixed\n\t\n\t\n\n\n\nI'm working on this now - about 1/2 through the PDF. I'm removing the old TODO comments as I go (and have thus evaluated if things are OK) - I will do a sweep afterward for any remaining TODOs that talk about the old issue with tables.\n\nI think cassandra still needs to commit some of the non-image attachments (ie: SVGs) from cwiki?\n\nNot sure what you mean? ",
            "author": "Cassandra Targett",
            "id": "comment-16001555"
        },
        {
            "date": "2017-05-08T21:28:21+0000",
            "content": "Not sure what you mean?\n\nSorry – this was on the list from github#27 but i realize now the intent got a little jumbled when it was sumarized in SOLR-10296...\n\nthe migration code renames/copies any attachments used as images, but there are a handful of SVG files (the \"source code\" for some diagrams) that will need to be manually renamed/copied\n\n...basically if you run find raw-export/attachments/ -name *.svg there should be at least 2 files that were attached to confluence pages which we should preserve in git along side the images they were used to generate (so if anyone wants to edit the images they can)\n\nLooking at my old export, i see...\n\n\nattachments/32604162/52035807.svg\nattachments/32604257/62692025.svg\n\n\n\n...grepping the raw HTML exports for what pages those were attached to i think the new names/locations for those files should be...\n\n\n52035807.svg -> images/a-quick-overview/sample-client-app-arch.svg\n62692025.svg -> images/other-parsers/graph_qparser_example.png\n\n\n\n(I can commit the svg files i've got from my old (Feb) export if you want — looks like neither of those have been edited in confluence since then) ",
            "author": "Hoss Man",
            "id": "comment-16001574"
        },
        {
            "date": "2017-05-08T21:32:24+0000",
            "content": "Oh, I got you. If you have them, go ahead - I'm also confident they haven't changed since then. ",
            "author": "Cassandra Targett",
            "id": "comment-16001583"
        },
        {
            "date": "2017-05-09T01:40:26+0000",
            "content": "links should all be fixed - so we should be free and clear to bulk remove the OLD_CONFLUENCE_ID comments in all the source files\n\nI realized that in order to safely remove those we need to sanity check that no links were trying to use them – which means SOLR-10640 really needs to be done.\n\nI started working on that and realized there are actually 54 \"broken\" links – either because of this or because of ids that explicitly exist in one page, but implicitly exist in a diff page of the PDF (because of the page shortname).\n\nI'm going to work on cleaning all of those up before pushing my current work. ",
            "author": "Hoss Man",
            "id": "comment-16001905"
        },
        {
            "date": "2017-05-09T04:38:05+0000",
            "content": "I'm going to work on cleaning all of those up before pushing my current work.\n\nok ... we should be all good on links/anchors, and ant build-site should now complain if any links break. ",
            "author": "Hoss Man",
            "id": "comment-16002015"
        },
        {
            "date": "2017-05-09T14:59:09+0000",
            "content": "I finished the last of the tables & verified there aren't any more \"TODO: this table breaks..\" comments in any of the docs. We may want to adjust the column sizes on individual tables, but that can be dealt with later on an as-needed basis.\n\nI also went through and fixed any URL examples that were unescaped (\"http://localhost:8983/...\") and came out in PDF and HTML as clickable links. ",
            "author": "Cassandra Targett",
            "id": "comment-16002827"
        },
        {
            "date": "2017-05-09T19:54:32+0000",
            "content": "All of the remaining issues on Hoss' list from 8 May can be deferred. This new Guide is ready to merge with master.\n\nHoss's list remaining (for posterity):\n\n\n\twe've manually added some TODO comments to the source where we punted on decisisons while working through the docs - those are going to need some discussion\n\tthe \"hard coded\" table of contents have all been cleaned up, but there's a new issue in SOLR-10612 about some auto-generated TOC cleanup we want to do\n\n ",
            "author": "Cassandra Targett",
            "id": "comment-16003414"
        },
        {
            "date": "2017-05-09T23:43:54+0000",
            "content": "To add to the list, so I don't forget. There are 2 pages in Confluence that use the excerpt macro and 3 places that use the excerpt-include macro ...\n\nI spun this off into SOLR-10655 ",
            "author": "Hoss Man",
            "id": "comment-16003769"
        },
        {
            "date": "2017-05-10T22:17:44+0000",
            "content": "Per Hoss' comment in SOLR-10290, the conversion is complete and we've merged this with master: https://issues.apache.org/jira/browse/SOLR-10290?focusedCommentId=16005503&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-16005503\n\nhttps://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=95968c69 ",
            "author": "Cassandra Targett",
            "id": "comment-16005548"
        }
    ]
}