{
    "id": "SOLR-12019",
    "title": "Prepare Streaming Expressions for machine learning functions",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "streaming expressions"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.6",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This ticket is to prepare the Streaming Expressions framework for the next phase of development which will focus on machine learning.\n\nBecause this next phase will involve a large number of new functions it will be important to prepare the Streaming Expressions framework before getting started.\n\nThere are three main goals of the ticket:\n\n1) Refactoring of code and test cases to prepare for the new machine learning functions.\n\n2) Improve the documentation of the current statistical functions and refactor the docs so they can support the new machine learning functions.\n\n3) Integrate the http://haifengl.github.io/smile/ libraries. Now that the Apache Commons Math integration is close to completion its time to start on the Smile machine learning integration.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-09T01:01:33+0000",
            "content": "Move issue from deprecated 'In  Progress' back to 'Open' ",
            "author": "Gavin",
            "id": "comment-16574128"
        },
        {
            "date": "2018-10-15T04:58:56+0000",
            "content": "Joel Bernstein Hi, Joel, any rough prediction on how long will it take to integrate with Smile library into Solr   Though it would be a great feature to have Machine Learning with Solr. Thanks for taking time on this issue ",
            "author": "rayeaster",
            "id": "comment-16649723"
        },
        {
            "date": "2018-10-15T20:17:50+0000",
            "content": "I'm very close to starting work on the Smile integration. I'll be taking the same approach as with Apache Commons Math which is to add new functions with every release. So it will be a gradual ramp up. The big question is what to do first? I was thinking of adding some of the regression algorithms that are not in Apache Commons Math, such as Lasso and Ridge. Then adding classifiers (SVM, NaiveBayes etc...). I'm also interested in the plotting. ",
            "author": "Joel Bernstein",
            "id": "comment-16650730"
        },
        {
            "date": "2018-10-16T11:57:05+0000",
            "content": "Joel Bernstein Thanks for the update. Thought the author of smile library (github @haifengl) would love to provide his insight for you. Cheers. Looking forward to gradual release  ",
            "author": "rayeaster",
            "id": "comment-16651569"
        }
    ]
}