{
    "id": "SOLR-12700",
    "title": "solr user used for crypto mining hack",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.6",
        "resolution": "Invalid",
        "status": "Resolved"
    },
    "description": "I am struggling to fight an attack were the solr user is being used to crate files used for mining cryptocurrencies. The files are being created in the /var/tmp and /tmp folders.\n\nIt will use 100% of the CPU. \n\nI am looking for help in stopping these attacks.\n\nAll files are created under the solr user.\n\nAny help would be greatly appreciated.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-25T22:29:00+0000",
            "content": "Please ask questions like this on the solr-user mailing list, not in JIRA.\n\nThere is nothing in the information provided that gives any clue that Solr would be the reason for your issues. However, there has been a number of security issues patched in recent versions of Solr. Stating 6.6 as your version does not tell us what bugfix release you are on, so you could still be vulnerable to some of these that were fixed in 6.6.4. or 6.6.5.\n\nI'm closing this issue as invalid. Your next steps could be\n\n\tSend an email to the solr-user list (http://lucene.apache.org/solr/community.html#mailing-lists-irc) asking for advice. You should include much more details, suspicious logs etc when you send that email\n\tSeek professional guidance to clean your servers or start with clean servers to make sure no malware remains. The OS, Java etc should of course also be fully patched.\n\tUpgrade to the newest Solr release (either latest 7.x or latest 6.6.x) which plugs some known weaknesses in various request handlers which COULD potentially be ways to break into a system. See https://lucene.apache.org/solr/7_4_0/changes/Changes.html for details.\n\tMake sure that Solr is NEVER exposed to an insecure network, it should always be behind firewalls, open only to your app servers.\n\tI'm sure you may get more advice on the user's mailing list\n\n\n\nPlease do not continue discussion in this Jira issue. Only if/when a NEW code issue has been identified in Solr after the mailing list discussion, should you file a new bug report here. ",
            "author": "Jan Høydahl",
            "id": "comment-16592726"
        }
    ]
}