{
    "id": "SOLR-10871",
    "title": "Remove monospace text from headings in Ref Guide",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Monospace text doesn't look great in section headings in the PDF - the font color is different and the size is smaller. With the old way of generating the PDF we could make it the same color & adjust the font size so it was less jarring. We don't have that option now, so the difference is much more pronounced.\n\nI found 148 instances of this in 40 files. I think we can make that \"normal\" text without losing any important information for the reader.\n\nAttaching screenshots of what it used to look like and what it now looks like, to illustrate the difference.",
    "attachments": {
        "monospace-in-header-new.png": "https://issues.apache.org/jira/secure/attachment/12872711/monospace-in-header-new.png",
        "monospace-in-header-old.png": "https://issues.apache.org/jira/secure/attachment/12872712/monospace-in-header-old.png",
        "Screen Shot 2017-06-12 at 11.20.04 AM.png": "https://issues.apache.org/jira/secure/attachment/12872723/Screen%20Shot%202017-06-12%20at%2011.20.04%20AM.png",
        "ref-guide-monospace-headings.txt": "https://issues.apache.org/jira/secure/attachment/12872736/ref-guide-monospace-headings.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-12T15:26:22+0000",
            "content": "I think there would be a semantic loss in some cases if we can't highlight stuff that's currently monospaced, in some (other) way.\n\nHere's PDF screenshot of the possibilities I could think of: Screen Shot 2017-06-12 at 11.20.04 AM.png.  Note that bold doesn't have any effect, I'm assuming because the headings are already (effectively) bolded.\n\nIf we do decide to continue including some form of highlighting, I'd vote for underlined. ",
            "author": "Steve Rowe",
            "id": "comment-16046674"
        },
        {
            "date": "2017-06-12T15:53:53+0000",
            "content": "I'm guessing i'm personally responsible for at least 140 of those instances.\n\ni've always thought the differentiated font in the header was nice because it helped draw attention to the fact that they were the names of params – but i think in the new world order removing the font change and indicating that in some other way is fine.  quotes, single quotes, italics, etc... or in some cases maybe just rewording the header where it may not be obvious (ie: always use the form \"The foo parameter\") will probably suffice?\n ",
            "author": "Hoss Man",
            "id": "comment-16046714"
        },
        {
            "date": "2017-06-12T16:14:00+0000",
            "content": "Note that bold doesn't have any effect, I'm assuming because the headings are already (effectively) bolded.\n\nYes, headings are already bold. \n\nItalics could work. I wonder about the inconsistency about using italics in headings and monospace in text - perhaps it's fine, though. I could see  the same argument about removing the monospace from headings - it's inconsistent. But, in the case of the monospace, the effect turns out to be more jarring than useful. The goal is to convey information to the reader without causing unnecessary interruption in the flow of their reading. Italics would flow with the text.\n\nProbably 80% or more of the usages are in regard to parameters, and like the example I showed, the heading clearly states the section is about \"The start Parameter\", \"The fq Parameter\", \"The facet.query Parameter\", etc. Does differentiating the text style for the name of the parameter help the reader without interrupting his/her reading? I'm open to being convinced about that, but I'm not yet.\n\nI'm not a fan of using quotes, since I think we already use them very inconsistently - for example, sometimes when we refer to the techproducts example we put \"techproducts\" in monospace, but sometimes it's in single quotes, and sometimes it's double quotes, and other times it's a combo of these. ",
            "author": "Cassandra Targett",
            "id": "comment-16046732"
        },
        {
            "date": "2017-06-12T16:31:40+0000",
            "content": "I'm not a fan of using quotes, since I think we already use them very inconsistently...\n\nThat's the argument for why i originally used monospoace in the headers - to try and be consistent \n\nProbably 80% or more of the usages are in regard to parameters, and like the example I showed, the heading clearly states the section is about \"The start Parameter\", ...\n\nmy only concern (in the past) about having no typographic distrinction is the risk of a \"Who's on First\" situation? ... things like \"The facet.query Parameter\" are pretty self describing, but something like \"The start Parameter\" or \"The sort Parameter\" might be confusing to new users w/o quotes or some other form of indication that it's a \"literal\" parameter name... \"Yes, i am in fact interested in the parameter for doing a sort - please tell me what it's name is!\"\n\nBut this is likely just a theoretical problem that doesn't really exist – if the sections are written well, as soon as the reader gets to the first sentence after the heading, it should be obvious. ",
            "author": "Hoss Man",
            "id": "comment-16046743"
        },
        {
            "date": "2017-06-12T16:55:08+0000",
            "content": "Attaching what egrep -r --include=\"*.adoc\" '^=+.*`' finds for me on master under solr/solr-ref-guide/: 188 instances, of which 103 include \"aram\" (54%).\n\nFor those 54%, I agree that \"The XXX Parameter\" wouldn't benefit much from highlighting XXX.\n\nSimilarly, 28 of the headings (14%) consist of a heading that is entirely in monospace.  These  also wouldn't benefit much from highlighting.\n\nLooking at the remaining 57 (30%), I don't see any that would be irreparably harmed by removing all highlighting.  In some cases, using italics for symbols (e.g. !, ||, +, -, &&) might actual make them look worse.\n\nOn balance, I guess I'm +1 to removing all highlighting (rather than substituting e.g. italics). ",
            "author": "Steve Rowe",
            "id": "comment-16046774"
        },
        {
            "date": "2017-06-12T17:02:44+0000",
            "content": "If we do decide to continue including some form of highlighting, I'd vote for underlined.\n\nIn an offline discussion, Cassandra Targett mentioned that underlined text usually means hyperlinks, and pointed me to https://github.com/asciidoctor/asciidoctor/issues/867, an asciidoctor issue that includes a comment describing why using underlines in digital pubs is a bad idea.  In part:\n\n\nAll the major style guides (Chicago, New York) explicitly advise against the use of the underline, labeling it as legacy, and the HTML5 specification discourage its use in normal text to avoid confusion with hyperlinks. Text should be emphasized using italics (preferred), bold (used sparingly) or an alternative styling that is still accessible.\n\nI agree, and I withdraw my preference for underscores (if any highlighting ends up being used). ",
            "author": "Steve Rowe",
            "id": "comment-16046785"
        },
        {
            "date": "2017-06-12T17:20:52+0000",
            "content": "How about this - I'll commit the change to remove them all to master and tomorrow we can see how they look in the Jenkins build (https://builds.apache.org/job/Solr-reference-guide-master/). If it's dissatisfactory, we'll revert the commit and use italics instead. ",
            "author": "Cassandra Targett",
            "id": "comment-16046808"
        },
        {
            "date": "2017-06-12T17:31:06+0000",
            "content": "How about this - I'll commit the change to remove them all to master and tomorrow we can see how they look in the Jenkins build (https://builds.apache.org/job/Solr-reference-guide-master/). If it's dissatisfactory, we'll revert the commit and use italics instead.\n\n+1 ",
            "author": "Steve Rowe",
            "id": "comment-16046814"
        },
        {
            "date": "2017-06-12T19:18:15+0000",
            "content": "Commit 0411504dd8dfccb2d997546759c1f26d7bb0eae9 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0411504 ]\n\nSOLR-10871: remove backticks for monospace type in headings ",
            "author": "ASF subversion and git services",
            "id": "comment-16046964"
        }
    ]
}