{
    "id": "SOLR-1703",
    "title": "Sorting by function problems on multicore (more than one core)",
    "details": {
        "affect_versions": "1.5",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "multicore",
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "When using sort by function (for example dist function) with multicore with more than one core (on multicore with one core, ie. the example deployment the problem doesn`t exist) there is a problem with not using the right schema. I think there is a problem with this portion of code:\n\nQueryParsing.java:\n\n\npublic static FunctionQuery parseFunction(String func, IndexSchema schema) throws ParseException {\n    SolrCore core = SolrCore.getSolrCore();\n    return (FunctionQuery) (QParser.getParser(func, \"func\", new LocalSolrQueryRequest(core, new HashMap())).parse());\n    // return new FunctionQuery(parseValSource(new StrParser(func), schema));\n}\n\n\n\nCode above uses deprecated method to get the core sometimes getting the wrong core effecting in impossibility to find the right fields in index.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12796874",
            "date": "2010-01-05T22:18:12+0000",
            "content": "Indeed - that's a bug.  New solr code shouldn't be using parseFunction. "
        },
        {
            "author": "Billy Morgan",
            "id": "comment-12857568",
            "date": "2010-04-15T22:12:08+0000",
            "content": "I believe this to be the cause of the problem I  am experiencing..\n\nI start tomcat and everything works as normal. I then trigger a process which updates our synonym files and tells each of the cores affected to reload to pickup the changes. Once reloaded the fields used by the sort functions can no longer be found.\n\nRestarting tomcat fixes the problem but isn't an option on our production servers. Any idea when this bug will be ironed out or a possible work around for my situation in the meantime? "
        },
        {
            "author": "Billy Morgan",
            "id": "comment-12857573",
            "date": "2010-04-15T22:21:00+0000",
            "content": "Just an updated to my previous post...\n\n It appears that the sort function tries to run against whichever core was last reloaded. I know this won't be much help to anyone else but luckily this gives me a hacky yet workable fix to my problem, as only one of my cores uses sort functions I just need to make sure it is always reloaded last. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872617",
            "date": "2010-05-27T22:09:17+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043735",
            "date": "2011-06-03T16:46:48+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106320",
            "date": "2011-09-16T14:50:34+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237070",
            "date": "2012-03-23T20:31:39+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        }
    ]
}