{
    "id": "SOLR-5339",
    "title": "solr-core-4.4's ip is not right when the os is centos 5.6 sometimes",
    "details": {
        "affect_versions": "4.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - Clustering"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "when I install the solr-cloud on the centos5.6 . it is strange that sometimes ,the ip is not correct which is displayed on the http://192.168.10.54:8081/solr/#/~cloud , it is 202.106.199.36,but my actual is 192.168.10.54. but on the windows it is right. and i found it is because of hostaddress = InetAddress.getLocalHost().getHostAddress(); in ZkController.java . sometimes the method which get ip is not correct .we should not trust . so i think in linux we should not use this method",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13793533",
            "date": "2013-10-13T00:10:51+0000",
            "content": "You can manually specify what hostname or address will go into the cloud configuration with by specifying instance parameters in solr.xml.\n\nhttp://wiki.apache.org/solr/SolrCloud#SolrCloud_Instance_Params\n\nIf the wrong address is being detected, then it is likely that your operating configuration isn't set up according to your expectactions.  For a linux machine, the best config is usually as described below, assuming that myhost.example.com is the fully qualified name for your host:\n\n\n\tThe actual hostname of the machine should be myhost - the short name.  On CentOS, this is defined in /etc/sysconfig/network.\n\tIn /etc/hosts, only one entry should have the machine's actual hostname on it, and it should look like the following:\n\n\n\n192.168.10.54    myhost.example.com myhost\n\nThis should ensure that when the local IP address is looked up, it will use that entry in /etc/hosts.  When you ask for the hostname, you will get 'myhost'. and when you ask for the fully qualified hostname, you will get 'myhost.example.com'.\n\nI can't guarantee that the configuration I have described will work for every situation, but it should ensure that Solr detects correctly. "
        }
    ]
}