{
    "id": "SOLR-1067",
    "title": "QueryParsing.parseFunction uses Singleton Core (SolrCore.getSolrCore())",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "QueryParsing.parseFunction is a static utility method that depends on the SolrCore.getSolrCore singleton – but it is not yet deprecated and is used in some rather important places in the code base (the result is that the last core initialized\n\nit was noted a while back, with some comments about how to tackle the problem, but it looks like we never opened an issue to deal with it...\n\nhttp://www.nabble.com/QueryParsing-using-SolrCore.getSolrCore()-td19806087.html\n\n...we should deal with this in some way prior to the 1.4 release (if nothing else, we need to document it as a caveat).",
    "attachments": {
        "SOLR-1067.patch": "https://issues.apache.org/jira/secure/attachment/12415938/SOLR-1067.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12681034",
            "date": "2009-03-11T21:25:38+0000",
            "content": "to followup on a comment i made in that email thread...\n\n\nThe sanest thing to do would probably be to make parseFunction construct a\nlocal instance of FunctionQParser (with a null SolrQueryRequest) instead\nof using QParser.getParser(...).  that should be fairly close to the way\nit worked in older versions\n\n(hmmm... except FunctionQParser does something similar to get a\nValueSourceParser ... a new constructor for FunctionQParser that\nexplicitly tells it to use ValueSourceParser.standardValueSourceParsers\nmight be in order).\n\nI think it goes without saying that QueryParsing.parseFunction should be\ndeprecated as well ... fortunately it's only used in a few places in the\ncore code ... unfortunately those places also don't currently have access\nto a SolrQueryRequest at the moment:\n  1) SolrPluginUtils.parseFuncs – should probably be deprecated, callers\nof it should start using the QParser APIs.\n  2) SolrQueryParser.getFieldQuery – it's only used if the\nSolrQueryParser was constructed with an IndexSchema and not with a QParser\n(in which case it can ask the QParser for a subParser) .. the IndexSchema\nconstructor should probably be deprecated as well (but i haven't dug in to\nsee how far down the rabit hole that change would go) \n\nIf we gave FunctionQParser a constructor that took in an IndexSchema instead of a SolrQueryRequest, then that new constructor could be used by both QueryParsing.parseFunction and SolrQueryParser.getFieldQuery and – we'd still need to use the ValueSourceParser.standardValueSourceParsers as well, but that would be better then picking the ones declared arbitrarily in the last core. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12740906",
            "date": "2009-08-08T16:07:59+0000",
            "content": "Here's a patch that incrementally improves the situation.\nI think the only place a QParser isn't used now is deleteByQuery. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12740921",
            "date": "2009-08-08T17:22:01+0000",
            "content": "I think we've done everything reasonable for 1.4, moving the rest to 1.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872494",
            "date": "2010-05-27T22:06:31+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043814",
            "date": "2011-06-03T16:47:12+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106370",
            "date": "2011-09-16T14:50:47+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237081",
            "date": "2012-03-23T20:31:42+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13290467",
            "date": "2012-06-06T21:56:10+0000",
            "content": "no longer a problem in 4.0 due to both of these (deprecated) methods having been removed. "
        }
    ]
}