{
    "id": "SOLR-11402",
    "title": "DataImportHandler dataimport.properties should write to data dir by default",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "4.10,                                            5.5,                                            6.6",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Currently, DIH drops the dataimport.properties file in the core directory by default, but the data directory seems to be the logical choice.\n\n\n\tThe core directory tends to be read-only.\n\tThe data directory is the write area, and the dataimport.properties file is tied to the index, rather than the core configurations.\n\n\n\nDocker is a use case where the current behavior is glaringly problematic: The core directory lives in the container layer, and any files that Solr writes there disappear when the container is restarted (forcing a subsequent full index). The data directory, on the other hand, is already persisted to a volume (according to normal practice), so if it were the default location to write dataimport.properties, it would behave as one would expect.\n\nIt's possible to work around this (using PropertyWriter, symlinks, or other tricks), but this shouldn't be necessary.\n\n\n\tDownstream Solr Docker ticket: https://github.com/docker-solr/docker-solr/issues/150\n\tSOLR-1970, in which others make the same argument",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-26T02:49:15+0000",
            "content": "+1 clearly a problem.\n\nFYI in SolrCloud, dataimport.properites is saved to ZooKeeper, which is a decent spot for it since it's a Solr \"collection\" level setting, not core. ",
            "author": "David Smiley",
            "id": "comment-16180125"
        }
    ]
}