{
    "id": "SOLR-8518",
    "title": "Implement ResultSetMetaDataImpl getColumnType and getColumnTypeName",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Resolved",
        "resolution": "Implemented",
        "priority": "Major"
    },
    "description": "DBVisualizer uses getColumnType and getColumnTypeName to determine which ResultSetImpl.get* method to use when displaying the data otherwise it falls back to ResultSetImpl.getObject.",
    "attachments": {
        "SOLR-8518.patch": "https://issues.apache.org/jira/secure/attachment/12784327/SOLR-8518.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-07T20:56:24+0000",
            "author": "Kevin Risden",
            "content": "Requires ResultSetMetaDataImpl class from SOLR-8513 to be merged first. ",
            "id": "comment-15088091"
        },
        {
            "date": "2016-01-26T03:05:02+0000",
            "author": "Kevin Risden",
            "content": "Implemented SOLR-8518 based on Joel Bernstein's suggestion of using the pushback stream to grab the first tuple. This tuple is then used to determine type information. ",
            "id": "comment-15116565"
        },
        {
            "date": "2016-01-26T03:19:43+0000",
            "author": "Joel Bernstein",
            "content": "Using the approach where we look at the column types of the first real Tuple means that numerics will always be either a long or a double. From a practical standpoint this approach is very fast and it will work fine with visualization clients. As the implementation matures we can look at ways to cache the real types in the SQLHandler and return it with the meta-data tuple. ",
            "id": "comment-15116584"
        },
        {
            "date": "2016-01-26T13:46:18+0000",
            "author": "Joel Bernstein",
            "content": "Before we commit to this approach I have a question.\n\nHow much of the Catalog (DatabaseMetaData) information are we going to need to get DBVisualizer working?\n\nIf we're going to need to get the DatabaseMetaData working for SOLR-8502 then it makes sense to populate the column types directly from the Catalog. But if we can close out SOLR-8502 without digging into the DatabaseMetaData then let's take that the first Tuple approach in the latest patch.\n ",
            "id": "comment-15117197"
        },
        {
            "date": "2016-01-26T14:35:06+0000",
            "author": "Kevin Risden",
            "content": "Well a very rough DBVisualizer is currently working as of SOLR-8512 getting committed. There are some \"errors\" that get printed about getting catalog/schema info and some other minor things.\n\nAs far as this ticket, I think the catalog and getColumnType/getColumnTypeName are going to have to both be implemented separately. There are fields can be created by a query (ie: concat, constants, aliases) that won't match what the schema says. Using the first tuple is the only sure way to get the proper types returned from a query I think. ",
            "id": "comment-15117294"
        },
        {
            "date": "2016-01-26T14:42:07+0000",
            "author": "Joel Bernstein",
            "content": "Ok, we'll go with the latest patch then. I think the main goal is to get DBVisualizer working. We can always change things in later tickets as things mature. ",
            "id": "comment-15117305"
        },
        {
            "date": "2016-01-26T15:46:54+0000",
            "author": "Joel Bernstein",
            "content": "I made a few slight changes and am running precommit now.\n\n1) I moved the wrapping of the PushBackStream into the ResultSetImpl. Just felt this was a detail only the ResultSet needed to know.\n2) Checking for null value on a column and setting the class to String. This is actually correct because only String fields can be null. Numerics will return 0 if null. ",
            "id": "comment-15117421"
        },
        {
            "date": "2016-01-26T16:15:18+0000",
            "author": "Joel Bernstein",
            "content": "commit: https://github.com/apache/lucene-solr/commit/3654fc33b9e2ac0066d03ae864dea418d27f8841 ",
            "id": "comment-15117498"
        }
    ]
}