{
    "id": "SOLR-9839",
    "title": "Use 'useFactory' in tests instead of setting manually",
    "details": {
        "components": [
            "Tests"
        ],
        "type": "Test",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Minor"
    },
    "description": "We have several tests that will explicitly set a directory factory via SysProp, some of which forget to unset it.\n\nWe should use useFactory so that we can benefit from the call to resetFactory in SolrTestCaseJ4.teardownTestCases.",
    "attachments": {
        "SOLR-9839.patch": "https://issues.apache.org/jira/secure/attachment/12842232/SOLR-9839.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-12-07T22:51:59+0000",
            "author": "Mike Drob",
            "content": "naive search-and-replace patch. ",
            "id": "comment-15730192"
        },
        {
            "date": "2016-12-07T23:45:46+0000",
            "author": "Erick Erickson",
            "content": "There's also the SystemPropertiesRestoreRule that can be used so you don't have to remember to undo system properties.\n\nuseFactory still looks like a good idea, just mentioning the Rule bit for completeness. ",
            "id": "comment-15730331"
        },
        {
            "date": "2016-12-08T18:42:32+0000",
            "author": "Mike Drob",
            "content": "Looks like SystemPropertiesRestoreRule is automatically applied to everything inheriting from SolrTestCaseJ4. In which case, it would still be nice to remove the manual resetting from a bunch of out test cases. In light of this, I still think the code change is fine as is.\n\nThe commit message in the patch references the wrong JIRA. Erick Erickson - is there anything else that you think needs to be changed? ",
            "id": "comment-15733025"
        },
        {
            "date": "2016-12-08T18:46:14+0000",
            "author": "Erick Erickson",
            "content": "Mike:\n\nMostly I was just adding color commentary..\n\nWhat commit message? ",
            "id": "comment-15733041"
        },
        {
            "date": "2016-12-09T18:58:40+0000",
            "author": "Mike Drob",
            "content": "Sorry for being unclear. The patch file I posted would automatically include a commit message if applied using git am. That commit message was the one I meant. ",
            "id": "comment-15736019"
        },
        {
            "date": "2016-12-20T19:50:44+0000",
            "author": "Mike Drob",
            "content": "Erick Erickson - what do you think the path forward on this is? Good to commit? Close as \"won't fix\" due to SystemPropertiesRestoreRule? ",
            "id": "comment-15765086"
        },
        {
            "date": "2016-12-20T22:59:51+0000",
            "author": "Erick Erickson",
            "content": "Mike:\n\nThis patch doesn't seem necessary at this point in light of the restore rule.  Although it does bring up the interesting point whether we should remove the separate invocation of this rule in tests that extend SolrTestCaseJ4... ",
            "id": "comment-15765504"
        },
        {
            "date": "2017-01-05T20:30:56+0000",
            "author": "Mike Drob",
            "content": "For future reference, there are ~175 invocations of System.clearProperty across the various Solr tests that we might be able to get rid of and rely completely on the restore rule. I'm not in favor of that solution, since it makes it very non-intuitive to understand what is going on, but it is worth considering if somebody ever attempts to do other clean up in the tests. ",
            "id": "comment-15802445"
        }
    ]
}