{
    "id": "SOLR-6475",
    "title": "SOLR-5517 broke the ExtractingRequestHandler / Tika content-type detection.",
    "details": {
        "affect_versions": "4.7",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Hi,\n\nas discussed with \"hoss\" on IRC, i'm creating this Issue about a problem we recently ran into:\n\nOur company uses Solr to index user-generated files for fulltext searching (PDFs, etc.) by using the ExtractingRequestHandler / Tika. \nSince we recently upgraded to Solr 4.9, the indexing process began to throw the following exception: \"Must specify a Content-Type header with POST requests\" (in solr/servlet/SolrRequestParsers.java, line 684 in the 4.9 source).\n\nThis behavior was introduced with SOLR-5517, but even as the Solr wiki states, Tika needs the content-type to be empty or not present to trigger auto detection of the content- / mime-type.\n\nSince both features block each other, but are basically both correct behavior, \"hoss\" suggested that Tika should be fixed to trigger the auto-detection on content-type \"application/octet-stream\" too and i highly agree with this proposal.\n\nTest case:\nJust use the example from the ExtractingRequestHandler wiki page:\n\ncurl \"http://localhost:8983/solr/update/extract?literal.id=doc5&defaultField=text\"  --data-binary @tutorial.html  [-H 'Content-type:text/html']\n\n\nbut don't send the content-type, obviously. or you could just use the \"SimplePostTool (post.jar)\" mentioned in the wiki, but i guess this would be broken now, too.\n\nProposed solution:\nFix the Tika content guessing in that way, that it also triggers the auto detection on content-type \"application/octet-stream\".\n\nThanks,\nDominik",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Anurag Sharma",
            "id": "comment-14176067",
            "date": "2014-10-18T17:50:29+0000",
            "content": "Is't it part of Tika project as the fix is expecting in Tika to  triggers the auto detection on content-type \"application/octet-stream\"? Am I missing anything? "
        }
    ]
}