{
    "id": "SOLR-2730",
    "title": "Highlighting is not HTML-encoded when fallback to alternate field",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "When highlighter finds matches in the field and returns the snippets, all other text returned is HTML-encoded, i.e. a <br> in the field will be displayed as a literal tag instead of causing a break.\n\nBut when hl.alternateField is used, and the query does not match any words in the field, the alternate fallback field is returned as is, without being HTML-encoded.\n\nThis is inconsistent and causes problems in the client. HTML-encoding in the client is not an option since the highlighted snippets then would break.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13090963",
            "date": "2011-08-25T12:07:38+0000",
            "content": "Suggested fixes:\nA) Also HTML-encode fallback field content, as is done for normal highlighted content. This can be controlled with hl.htmlEncodeFallback=true to give the possibility for backwards compat\nB) Include a flag in the highlighting result which says whether fallback has occurred, so client can do something intelligent "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-13091041",
            "date": "2011-08-25T14:36:39+0000",
            "content": "Duplicate of SOLR-2603? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13091056",
            "date": "2011-08-25T15:02:51+0000",
            "content": "Yea, think so. I searched for possible existing issues but found none. Marking as duplicate "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13420370",
            "date": "2012-07-23T00:02:53+0000",
            "content": "Seems as this was not a duplicate after all "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13420380",
            "date": "2012-07-23T01:13:44+0000",
            "content": "My bad, SOLR-2603 works like a charm  "
        }
    ]
}