{
    "id": "SOLR-10352",
    "title": "Low entropy warning in bin/solr script",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCLI"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "We should add a warning in the startup script for Linux, if the output of the following is below a certain threshold (maybe 300?). The warning could indicate that features like UUIDField, SSL etc. might not work properly (or be slow). As a hint, we could then suggest the user to configure a non blocking SecureRandom (SOLR-10338) or install rng-tools, haveged etc.\n\n\ncat /proc/sys/kernel/random/entropy_avail\n\nOriginal discussion:\nhttps://issues.apache.org/jira/browse/SOLR-10338?focusedCommentId=15938904&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-15938904",
    "attachments": {
        "SOLR-10352.patch": "https://issues.apache.org/jira/secure/attachment/12860693/SOLR-10352.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-23T19:11:43+0000",
            "content": "I dont want to hijack the original intention of this issue. So let me know if this is not the point .. \n\nI think it is a valid point that entropy might run out also in production not just in test suites. Just came to my mind what if we had non-blocking SecureRandom as a default in the startup scripts. And - if overwritten - the warning could give the feedback to the user.\n\nI think this link was cited in one of the issues. It argues for the usage of /dev/urandom:\nhttp://www.2uo.de/myths-about-urandom/ ",
            "author": "Mihaly Toth",
            "id": "comment-15939053"
        },
        {
            "date": "2017-03-27T18:13:02+0000",
            "content": "Attached patch to include warning if available entropy is below 300 ",
            "author": "Esther Quansah",
            "id": "comment-15943761"
        },
        {
            "date": "2017-03-27T18:26:38+0000",
            "content": "Commit 2ba54a36babd4cb6f2fb97e0f550d4980dbbced5 in lucene-solr's branch refs/heads/master from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2ba54a3 ]\n\nSOLR-10352: bin/solr script now prints warning when available system entropy is lower than 300 ",
            "author": "ASF subversion and git services",
            "id": "comment-15943786"
        },
        {
            "date": "2017-03-27T18:27:41+0000",
            "content": "Commit 6ecbe32dc2fdd2c3103e91cc9650395184f6499d in lucene-solr's branch refs/heads/branch_6x from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6ecbe32 ]\n\nSOLR-10352: bin/solr script now prints warning when available system entropy is lower than 300 ",
            "author": "ASF subversion and git services",
            "id": "comment-15943789"
        },
        {
            "date": "2017-03-27T18:29:19+0000",
            "content": "Thanks Esther Quansah! ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15943792"
        },
        {
            "date": "2017-03-28T15:16:54+0000",
            "content": "Apologies, I missed Mihaly's comment on this issue before closing it. Reopening this so that discussion can continue. ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15945362"
        },
        {
            "date": "2017-03-28T16:12:47+0000",
            "content": "Just came to my mind what if we had non-blocking SecureRandom as a default in the startup scripts\nMy thought is that we should not change this by default, since /dev/random has been preferred by cryptographers and sysadmins for SSL. However, since the article argues that there are no downsides of using /dev/urandom, I think we can recommend that hte user use that when the entropy is low. This could be included in the warning message from the script. What do you think? ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15945454"
        },
        {
            "date": "2017-03-28T17:16:44+0000",
            "content": "Personally I think we really should not convolute the two issues of: \n\n\twarning if entropy is low\n\tchanging the default source of entropy.\n\n\n\nthose should really be 2 completely distinct discussions.\n\none is an simple choice/discussion: is there any cost/overhead of giving the user a warning about entropy?\n\nThe other is a more nuanced discussion about the risks/rewards of using diff sources of entropy and how that affects the confidence in our encryption based features: that deserves a lot more discussion in it's own jira.\n\n\n\nWith that said: here are my thoughts on the current patch/commit made so far in this jira...\n\nI don't think it's useful as implemented.  \n\nIIUC having this type of check solely on startup may be missleading to users – just because there is \"low\" entropy available when solr starts up doesn't mean there will be low of entropy for the (long) life of the solr server process.  LIkewise if there is \"high\" entropy on startup that doesn't mean everything will be fine and there's nothing to worry about: the available entropy could drop over time and cause performance issues later.\n\nRather then warning about this in bin/solr I feel like this type of information should be exposed by the solr metrics code, so people can easily monitor it over the life of the solr server process – either via a command line script we could provide, or via JMX, or via the admin UI ... we could even consider putting incorporating some specific \"node health\" metrics (entropy level, max open files, free disk, etc...) directly into the main screen of the Admin UI along with specific warnings/suggestions such as the text this issue added about SSL & UUIDField. ",
            "author": "Hoss Man",
            "id": "comment-15945570"
        },
        {
            "date": "2017-03-28T18:45:53+0000",
            "content": "Hoss Man, I think it is a good point that entropy could, in theory, go up and down over the course of the life of a Solr process. In practice, a host with high entropy (say baremetal) continues to remain in high entropy available state; and low entropy hosts (say VMs) continue to remain in a low entropy mode. So, although in theory a system could get in and out of the diminished available entropy state, in practice, afaik, a good system remains good and a bad one remains bad. Hence, a startup warning feels like a sensible thing to throw out there.\n\nRather then warning about this in bin/solr I feel like this type of information should be exposed by the solr metrics code, so people can easily monitor it over the life of the solr server process\nI feel that a start up warning should definitely be thrown, since we already know that there will be a problem. Having metrics support and UI warning is a great idea. However, I think we should do both (startup warning and metrics/UI warning). ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15945718"
        },
        {
            "date": "2017-03-29T13:37:59+0000",
            "content": "Ishan Chattopadhyaya, Esther Quansah, may I ask why the final commit makes comparison with 30000? AFAIK, it never goes over 4096 [1].\n\n[1] \"The read-only file entropy_avail gives the available entropy. Normally, this will be 4096 (bits), a full entropy pool.\" - https://linux.die.net/man/4/random ",
            "author": "Mano Kovacs",
            "id": "comment-15947139"
        },
        {
            "date": "2017-03-29T13:52:23+0000",
            "content": "Commit efdb04d06c9d37b543ab0469c65f3474c34d455a in lucene-solr's branch refs/heads/master from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=efdb04d ]\n\nSOLR-10352: Fixing available entropy warning limit to 300 ",
            "author": "ASF subversion and git services",
            "id": "comment-15947158"
        },
        {
            "date": "2017-03-29T13:53:18+0000",
            "content": "Commit e03d82eb45083a11ce97038d8054c3077068bed4 in lucene-solr's branch refs/heads/branch_6x from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e03d82e ]\n\nSOLR-10352: Fixing available entropy warning limit to 300 ",
            "author": "ASF subversion and git services",
            "id": "comment-15947160"
        },
        {
            "date": "2017-03-29T13:55:16+0000",
            "content": "Thanks for the catch, Mano. I was testing Esther's patch with that high value to trigger that warning, but forgot revert to her patch before committing. ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-15947164"
        },
        {
            "date": "2018-03-23T21:29:14+0000",
            "content": "Closing issue; it was shipped in 7.0. ",
            "author": "David Smiley",
            "id": "comment-16412110"
        }
    ]
}