{
    "id": "SOLR-7159",
    "title": "Add httpclient connection stats to JMX report",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.3",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Currently, we are logging the stats of httpclient as part of debug level.\n\n2015-01-20 13:47:48,640 DEBUG org.apache.http.impl.conn.PoolingClientConnectionManager: Connection request: [route: {}->http://plh04.wil.csc.local:8983][total kept alive: 254; route allocated: 100 of 100; total allocated: 462 of 10000]\n\nInstead, it would be good to expose these metrics via JMX for easy checking.",
    "attachments": {
        "SOLR-7159v4.patch": "https://issues.apache.org/jira/secure/attachment/12700983/SOLR-7159v4.patch",
        "SOLR-7159v3.patch": "https://issues.apache.org/jira/secure/attachment/12700958/SOLR-7159v3.patch",
        "Screen Shot 2015-02-25 at 7.17.05 PM.png": "https://issues.apache.org/jira/secure/attachment/12700959/Screen%20Shot%202015-02-25%20at%207.17.05%20PM.png",
        "jmx-layout.png": "https://issues.apache.org/jira/secure/attachment/12700894/jmx-layout.png",
        "SOLR-7159v2.patch": "https://issues.apache.org/jira/secure/attachment/12700889/SOLR-7159v2.patch",
        "SOLR-7159.patch": "https://issues.apache.org/jira/secure/attachment/12700737/SOLR-7159.patch",
        "Screen Shot 2015-02-25 at 7.20.52 PM.png": "https://issues.apache.org/jira/secure/attachment/12700961/Screen%20Shot%202015-02-25%20at%207.20.52%20PM.png",
        "Screen Shot 2015-02-25 at 7.21.09 PM.png": "https://issues.apache.org/jira/secure/attachment/12700962/Screen%20Shot%202015-02-25%20at%207.21.09%20PM.png",
        "Screen Shot 2015-02-25 at 7.18.17 PM.png": "https://issues.apache.org/jira/secure/attachment/12700960/Screen%20Shot%202015-02-25%20at%207.18.17%20PM.png",
        "Screen Shot 2015-02-25 at 2.05.34 PM.png": "https://issues.apache.org/jira/secure/attachment/12700887/Screen%20Shot%202015-02-25%20at%202.05.34%20PM.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-25T11:46:26+0000",
            "author": "Vamsee Yarlagadda",
            "content": "Here is the first draft of the patch.\n\nAs per the latest 4.10 release, we have two separate http connection pools - UpdateShardHandler (handles all the updates) and HttpShardHandler/HttpShardHandlerFactory (handles all queries). And these two classes are created for every core setup. So i ended up adding the logic to the existing MBean of every core to display the httpclient connection stats. (Screenshot attached).\n\nKindly let me know with any suggestions or comments. I will refine the patch accordingly. ",
            "id": "comment-14336401"
        },
        {
            "date": "2015-02-25T12:53:17+0000",
            "author": "Shawn Heisey",
            "content": "New 4.x development is no longer happening.  A new stable branch was created some time ago (branch_5x) and just recently the 5.0.0 version was released.\n\nYour patch did apply successfully to branch_5x and to trunk, so it is usable as-is.  We prefer patches against trunk, though patches against the stable branch are almost as good.  If the patch is against a branch that no longer sees active development (or a release tag), there tend to be problems applying it to current branches.\n\nIt's very good to get these values added to JMX, but having them in the admin UI will make them accessible to a lot more people.  If you have no idea how to do that, then that's something a committer can take on ... but if you do know how, please do so and submit a new patch.\n\nI will need to get to someplace I can actually look at the JMX structure to know whether I have any comments about the location you have chosen.  My initial instinct is that it should not have been placed directly on the root of the core, but until I look at how everything is arranged, I will defer comment. ",
            "id": "comment-14336453"
        },
        {
            "date": "2015-02-25T22:47:10+0000",
            "author": "Vamsee Yarlagadda",
            "content": "Shawn Heisey Thanks for the feedback.\n\n\n\tUpdated my patch to refer to the trunk.\n\tThe reason why i ended up putting under core is because every core instance has its own update and query httpclients. So i thought having it as part of core stats makes more sense. I am open for more feedback here.\n\tI followed this wiki (https://wiki.apache.org/solr/SolrJmx) to see the JMX stats (latest screenshots attached)\n\tLooks like even Solr admin web ui uses the MBeans to populate the stats. That being said, the existing patch also shows stats on the solr web ui  (screenshot attached)\n\n ",
            "id": "comment-14337381"
        },
        {
            "date": "2015-02-25T23:06:11+0000",
            "author": "Shawn Heisey",
            "content": "Attaching a screenshot of a JMX connection (using jconsole) that shows the layout on a 4.7.2 server with \"core\" selected and fully expanded.\n\nMy thoughts:  The ideal JMX layout I thought of would be very difficult to show in the admin UI, so perhaps httpclientQueryStats and httpclientUpdateStats can be siblings to core.  The four values that you currently have in a single string could then be shown as separate Attributes. ",
            "id": "comment-14337416"
        },
        {
            "date": "2015-02-26T02:21:29+0000",
            "author": "Otis Gospodnetic",
            "content": "Vamsee Yarlagadda - yes, please split those into multiple attributes - I think this is more common/standard AND, importantly, easier for monitoring tools to work with. Think of MBeans in JMX as the API.  For example, what if in the next Solr version somebody decides to add another value to that \"\n{...}\n\" string?  Various tools out there that parsed this might break. ",
            "id": "comment-14337716"
        },
        {
            "date": "2015-02-26T03:47:05+0000",
            "author": "Vamsee Yarlagadda",
            "content": "Updated the patch to display:\n\n\thttpclient stats as individual attributes instead of printing it as one long string.\n\tquery, update stats are moved from CORE to resective QUERYHANDLER, UPDATEHANDLER category.\n\n\n\nScreen shots attached to show how the JMX and Solr admin UI looks like with these stats. ",
            "id": "comment-14337809"
        },
        {
            "date": "2015-02-26T04:41:25+0000",
            "author": "Mark Miller",
            "content": "Great work vamsee. Looks like some of the formatting needs updating to meet the format guidlines though: http://wiki.apache.org/solr/HowToContribute#Helpful_Resources ",
            "id": "comment-14337860"
        },
        {
            "date": "2015-02-26T06:26:44+0000",
            "author": "Vamsee Yarlagadda",
            "content": "Updated the patch with recommended code style.\nMark Miller Let me know if they if there is still something specifically wrong with the formatting. ",
            "id": "comment-14337969"
        }
    ]
}