{
    "id": "SOLR-6368",
    "title": "Admin UI should include a query parser playground",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "When I type in a query it gets parsed differently at search time ( debug=query) than what I sees in the Analysis tab.\n\nI will happen when my queries are phrase queries, and has query time shingles/ multi word synonyms. The reason being the Analyzer sees it as 1 token when doing a regular search VS multiple tokens when seeing it via the Analysis -> Field Value ( Query ) text box\n\nThere could be two options - \n1. In Admin UI -> Analysis -> Field Value ( Query ) text box we should also provide another text box for 'defType'. And the query gets parsed via the QParser specified. Briefly looking at FieldAnalysisRequestHandler it's not obvious to me if this is possible though.\n\n2. Add another tab in the Admin UI which shows how a query gets parsed given the QueryParser",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-14095414",
            "date": "2014-08-13T12:27:03+0000",
            "content": "#2 is my recommendation.  Conflating analysis and query parsing is tricky business.  To have a comparable query parser testing page, it's not (necessarily) about a specific field or type, but rather a query, a query parser, and potentially many other parameters.   For example, for dismax, you need to specify qf at least, and likely you'd want pf and other parameters in there to see how they work.  \n\nPersonally, I like simply going to /select?rows=0&defType=dismax&qf=fields...&debug=true and looking at that output.  Putting something like that into the admin UI would indeed be handy though. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14095626",
            "date": "2014-08-13T15:50:18+0000",
            "content": "Don't we already have the query page in the admin UI? There's a debugQuery checkbox there which returns this info...\n\nThat said, how many times have we seen people on the user's list (or done it ourselves) miss that what they put into the analysis page is after the query parsing is done. Doing something here seems like a Good Thing.\n\nPerhaps a variant on 1 is possible. Rather than another tab, or trying to shoehorn things into the FieldAnalysisRequestHandler, just fire off a second query  from the admin UI at the indicated request handler and display the \"parsedQuery\" of the debug output.\n\nWhatever it is, I'd keep it real simple. Only allow specification of the request handler, no parameters, no nothing. If they want to do that, they can go to the query page or the raw URL.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14095722",
            "date": "2014-08-13T17:08:15+0000",
            "content": "FYI: i spent a bunch of time trying to figure out a good way to integrate analysis debugging into query parser debugging a few years back, and couldn't make any progress on it ... but i did post some notes: SOLR-1749 "
        }
    ]
}