{
    "id": "SOLR-10036",
    "title": "Revise jackson-core version from 2.5.4 to latest",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "7.4",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The current jackson-core dependency in Solr is not compatible with Amazon AWS S3 dependency. AWS S3 requires jackson-core-2.6.6 while Solr uses jackson-core-dependency-2.5.4. This is blocking the usage of latest updates from S3.\n\nIt would be greatly helpful if someone could revise the jackson-core jar in Solr to the latest version. This is a ShowStopper for our Public company.\n\nDetails of my Setup:\nSolr Version: 6.3\nAWS SDK version: 1.11.76",
    "attachments": {
        "SOLR-10036.patch": "https://issues.apache.org/jira/secure/attachment/12850888/SOLR-10036.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-01-26T03:40:35+0000",
            "content": "Is there any chance you could give it a try and submit a patch since you have a test setup? ",
            "author": "Erick Erickson",
            "id": "comment-15839131"
        },
        {
            "date": "2017-01-26T19:57:28+0000",
            "content": "I bumped the jackson version to 2.8.6 in the ivy properties on master, then started running Solr tests.  It took three tries, but they finally passed.  The first two runs had entirely different tests fail, so I don't think that it was caused by the change. ",
            "author": "Shawn Heisey",
            "id": "comment-15840326"
        },
        {
            "date": "2017-01-26T20:01:30+0000",
            "content": "Not sure if this matters but when Hadoop updated the Jackson version they stopped at 2.7.8 due to incompatibilities. HADOOP-12705 Not sure if this would affect the HDFS integration?  ",
            "author": "Kevin Risden",
            "id": "comment-15840333"
        },
        {
            "date": "2017-01-26T20:16:25+0000",
            "content": "Is HDFS integration tested at all in our codebase? ",
            "author": "Shawn Heisey",
            "id": "comment-15840360"
        },
        {
            "date": "2017-01-26T20:20:41+0000",
            "content": "Just double checked there are tests for HDFS integration. If those pass guess its good for me. ",
            "author": "Kevin Risden",
            "id": "comment-15840369"
        },
        {
            "date": "2017-01-26T20:22:55+0000",
            "content": "Regarding Erick's comment, I did change the Solr dependency of jackson-core from 2.5.4 to 2.6.6 and that resolved my issue. But I'm not sure if it would break any other parts associated with it. I do not even have deep knowledge of the Solr. So would have appreciated your help. And thank you for being active on this! ",
            "author": "Shashank Pedamallu",
            "id": "comment-15840376"
        },
        {
            "date": "2017-01-26T20:40:57+0000",
            "content": "Mark MillerMike Drob Do you have any comments? ",
            "author": "Erick Erickson",
            "id": "comment-15840410"
        },
        {
            "date": "2017-01-27T00:56:11+0000",
            "content": "+1 to upgrade versions - Jackson has been much better about documenting their back compat issues recently than they were in the days of 1.x\nLooking over the list, there shouldn't be anything that affects us. Hadoop stopping at 2.7.x is surprising to me, but it looks like they are planning on jackson 2.8.x in hadoop 3 (which will happen may or may not happen in our lifetimes).\n\nWhile I'd generally suggest using the last patch release of the minimum supported version we need to get things working (2.6.7) for client compat reasons, the security fixes in only present in 2.7.x+ push me towards that instead.\n\ntl;dr: I trust Jackson to be largely compatible across the board, and where possible we should not hold ourselves to Hadoop's \"latest and greatest of 2005\" philosophy. ",
            "author": "Mike Drob",
            "id": "comment-15840774"
        },
        {
            "date": "2017-02-03T18:44:02+0000",
            "content": "Shawn Heisey - Are you planning to post a patch/commit the bump of jackson? ",
            "author": "Kevin Risden",
            "id": "comment-15851914"
        },
        {
            "date": "2017-02-03T20:27:13+0000",
            "content": "Patch against master.  Precommit passes on Linux.\n\nRealized that I was running tests as root, which makes some of them fail.  Trying again as a regular user. ",
            "author": "Shawn Heisey",
            "id": "comment-15852066"
        },
        {
            "date": "2017-02-03T22:10:09+0000",
            "content": "Tests passed as soon as I stopped using root.  ",
            "author": "Shawn Heisey",
            "id": "comment-15852200"
        },
        {
            "date": "2017-02-06T17:15:35+0000",
            "content": "Hi,\n\nThank you for working on this issue. Can someone comment on when this change can be visible in a release approximately.\n\nThanks,\nShashank ",
            "author": "Shashank Pedamallu",
            "id": "comment-15854386"
        },
        {
            "date": "2017-02-06T18:08:15+0000",
            "content": "Shawn Heisey - the change looks reasonable to me. planning to commit?\n\nShashank Pedamallu - If this gets committed, it would be in the next minor release of 6.x. That is 6.5 as of right now.  ",
            "author": "Kevin Risden",
            "id": "comment-15854469"
        },
        {
            "date": "2017-02-06T18:09:23+0000",
            "content": "Realized that I was running tests as root, which makes some of them fail. Trying again as a regular user.\nShawn Heisey - already filed as SOLR-10027  ",
            "author": "Mike Drob",
            "id": "comment-15854471"
        },
        {
            "date": "2017-03-06T20:10:40+0000",
            "content": "There's now a fully shaded AWS JAR, jackson included. See HADOOP-14040.\n\nAt 50 MB it's big, and has been causing some problems simply due to classloader overhead and distribution, hence we aren't (currently) backporting in Hadoop. But it stops your choice of jackson being dictated by the S3 integration. ",
            "author": "Steve Loughran",
            "id": "comment-15897977"
        },
        {
            "date": "2018-04-09T22:52:13+0000",
            "content": "I wanted to provide a bit of testing information on this issue:\n\n \n\nI replaced jackson core/databind/annotations 2.5.4 with version 2.9.5. I did NOT replace jackson-dataformat-smile 2.5.4 at this point. Just FYI, this jar has since been deprecated and is now part of the jackson-dataformat-binary module.\n\nAfter replacing these .jars I was able to start Solr, create a new core, create a new collection, alter the schema, index and query json. I have noted no errors.\n\n \n\n  ",
            "author": "Kevin Cowan",
            "id": "comment-16431456"
        },
        {
            "date": "2018-04-26T22:14:11+0000",
            "content": "I can agree with the notion that Solr should stay current on its dependencies whenever that is possible.  But something occurred to me while thinking about this:\n\nSolr is intended to be a completely self-contained service.  The version of any dependency that Solr includes (such as Jackson) should not matter to any other software on the system.  Normally other software will be entirely separate from Solr. ",
            "author": "Shawn Heisey",
            "id": "comment-16455459"
        },
        {
            "date": "2018-04-26T22:15:46+0000",
            "content": "Kevin pointed me to this offline which is a list of CVEs for jackson . So we should upgrade jackson . On the other hand if we can move it's usage to noggit or something then we reduce another dependency . I'll start investigating tomorrow ",
            "author": "Varun Thacker",
            "id": "comment-16455462"
        },
        {
            "date": "2018-04-27T20:15:49+0000",
            "content": "Here's my analysis:\n\n\tWe can't remove jackson. Calcite/hadoop and probably a few other projects needs it as a dependency. Currently within Solr a few contribs use jackson-core directly.\n\tCurrent Hadoop version: 2.7.4\n\thadoop-common and hadoop-hdfs ( 2.7.4 ) explicitly have jackson 1.9.13 as a dependency\n\tSolr currently uses Jackson 2.5.4 and the latest Jackson version is 2.9.5\n\tDidn't run into any issues while running \"ant test\" and \"ant -Dtests.nightly=true \"-Dtests.class=org.apache.solr.cloud.hdfs.*\"\" ( one test was hung but that's probably the test being flaky. Didn't have any class not found issues )\n\n\n\n \n\nShawn Heisey I think we should just commit this?  ",
            "author": "Varun Thacker",
            "id": "comment-16456989"
        },
        {
            "date": "2018-04-27T20:41:24+0000",
            "content": "Let's get it upgraded!   I think going to the latest is better than a step to an intermediate version.  It looked like the patch goes to 2.8.6. ",
            "author": "Shawn Heisey",
            "id": "comment-16457023"
        },
        {
            "date": "2018-04-27T21:46:55+0000",
            "content": "Hi Shawn,\n\nDo you want to commit this . Otherwise happy to pick it up and wrap it up ",
            "author": "Varun Thacker",
            "id": "comment-16457116"
        },
        {
            "date": "2018-04-29T19:47:19+0000",
            "content": "Commit f6cbb2db6be608cacc0c15f34d1db1b53b16d560 in lucene-solr's branch refs/heads/master from Varun Saxena\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=f6cbb2d ]\n\nSOLR-10036: Upgrade jackson from 2.5.4 to 2.9.5 ",
            "author": "ASF subversion and git services",
            "id": "comment-16458139"
        },
        {
            "date": "2018-04-29T20:00:17+0000",
            "content": "Commit 935b0c89c6ecb446d7f05d938207760cd64bcd04 in lucene-solr's branch refs/heads/branch_7x from Varun Saxena\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=935b0c8 ]\n\nSOLR-10036: Upgrade jackson from 2.5.4 to 2.9.5\n\n(cherry picked from commit f6cbb2d) ",
            "author": "ASF subversion and git services",
            "id": "comment-16458145"
        },
        {
            "date": "2018-04-29T20:00:39+0000",
            "content": "Thanks all! ",
            "author": "Varun Thacker",
            "id": "comment-16458146"
        }
    ]
}