{
    "id": "SOLR-5222",
    "title": "Sorting on dynamic fields using DocValues sorts empty values always first",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When using DocValues for sort fields, \"sortMissingLast=true\" seems not to work - which makes sense as DocValues require a value for every document. The workaround is to use a default value which is alphanumericly sorted last. But when specifying the sort field as a dynamic field, the default value is not applied when a document does not contain that field.\nTo make it work, I had to define every single sort field explicitly.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13762186",
            "date": "2013-09-09T19:33:16+0000",
            "content": "In the past docValues required having a default Value in order to work, so i'm actaully suprised that you were even allowed to configure a dynamicField using docValues – that probably should have just given you a hard error on startup.\n\nfortumately this limitation (requiring a default value) has already been removed so in Solr 4.5 it will no longer be required, and sortMissing will work on dynamic fields with docValues (see SOLR-5165)\n\nI've got a patch to DocValuesMissingTest in progress to prove this - i'll finish it up and commit after i get back from lunch. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13762205",
            "date": "2013-09-09T19:52:27+0000",
            "content": "Seems like the real bug is unrelated to docvalues: if you try to supply a default value for a dynamic field you should get an exception. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13762395",
            "date": "2013-09-09T22:29:43+0000",
            "content": "Commit 1521304 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1521304 ]\n\nSOLR-5222: test proving that dynamicField's using docValues work as expected with missing values "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13762400",
            "date": "2013-09-09T22:33:26+0000",
            "content": "Commit 1521307 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1521307 ]\n\nSOLR-5222: test proving that dynamicField's using docValues work as expected with missing values (merge r1521304) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13762401",
            "date": "2013-09-09T22:34:15+0000",
            "content": "I've committed my test refactoring/additions for DocValuesMissingTest to also cover the dynamic field variations...\n\nCommitted revision 1521304.\nCommitted revision 1521307.\n\nSeems like the real bug is unrelated to docvalues\n\nAgreed – my point was just that up to Solr 4.4, it should have been impossible to configure dynamicFields with docValues, because of the mutually exclusive requirements.  I've opened SOLR-5227 to fix the dynamicField+defaultValue error checking problem.\n "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787082",
            "date": "2013-10-05T10:19:07+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}