{
    "id": "SOLR-11750",
    "title": "Collection aliases should be easier manage",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "6.6,                                            7.0.1,                                            7.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Currently the only way to determine which aliases apply to a collection is to go into the tree view of the cloud page and look at the contents of the aliases node. It would be handy to have this information alongside the other collection details. Also, the delete alias drop-down shows all of the aliases for all collections, not just the one that applies to the currently viewed collection.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-12-18T20:09:42+0000",
            "content": "Currently the only way to determine which aliases apply to a collection is to go into the tree view of the cloud page and look at the contents of the aliases node.\n\nI believe this is false.  I'm looking at the code for ClusterStatus and it has an \"aliases\" key that maps collection names to the alias(es) that it is a member of.\nNevertheless I think your point is centrally about the UI (Component/s:Admin UI) not wether or not Solr gives this information in some API call (which it does). ",
            "author": "David Smiley",
            "id": "comment-16295610"
        },
        {
            "date": "2017-12-18T21:04:09+0000",
            "content": "Exactly right. This is something that I think should be added to the Angular CollectionsController, or somewhere thereabout.  ",
            "author": "Scott Stults",
            "id": "comment-16295661"
        },
        {
            "date": "2017-12-29T23:04:47+0000",
            "content": "Also, another thing that should be cleaned up with this... the delete alias drop down gets funky if you actually delete one. the drop down gains a second blank line (probably where the alias was removed). This goes away if the page is refreshed. ",
            "author": "Gus Heck",
            "id": "comment-16306592"
        }
    ]
}