{
    "id": "SOLR-4629",
    "title": "Stronger standard replication testing.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Test",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I added to these tests recently, but there is a report on the list indicating we may still be missing something. Most reports have been positive so far after the 4.2 fixes, but I'd feel better after adding some more testing.",
    "attachments": {
        "SOLR-4629_emptycommittest_and_numfoundrefactor_and_waitparam.patch": "https://issues.apache.org/jira/secure/attachment/12576698/SOLR-4629_emptycommittest_and_numfoundrefactor_and_waitparam.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Commit Tag Bot",
            "id": "comment-13609891",
            "date": "2013-03-22T04:11:55+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1459618\n\nSOLR-4629: More Replication testing. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13609904",
            "date": "2013-03-22T04:26:34+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1459620\n\nSOLR-4629: More Replication testing. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13609952",
            "date": "2013-03-22T05:19:09+0000",
            "content": "I added version checking to one of the configuration tests and a new test. The new test will do n loops of:\n\nadd random number of docs to master\ncommit\nrandomly update conf file or not\nslave calls replicate\ncompare doc count\ncompare versions "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13620481",
            "date": "2013-04-03T01:15:58+0000",
            "content": "Mark Miller: can you please sanity check this patch for me?\n\nThe initial motivation was adding \"testEmptyCommits\" to help verify that the situation observed in SOLR-4661 didn't actually cause any problems.  \n\nSince a key point of the new test was to ensure that replication happened even if no new docs were added by a commit, i couldn't rely on the existing hack of \"rQuery\", so i added a \"wait\" option to command=fetchindex that causes the command request to block until the Thread running doFetch finishes (here's where my first concern is: is having this option a bad idea? should we document it or keep it hidden for tests?)\n\nsince i was looking at rQuery, i noticed it was sleeping at least 100ms on every call, even if the results were already available, so i reworked that a bit, and in the process refactored a \"numFound\" helper utility.\n\n\n\nAssuming this patch – in particular the \"wait\" option on fetch index – seems ok to folks, i think we could probably speed up TestReplicationhandler considerably by changing all of the individual tests to explicitly call pullFromMasterToSlave() instead of using rQuery to wait for polling ... it seems like we should really only need a single test of the polling feature, everything else being tested can be verified with blocking calls to command=fetchindex ... right? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13620493",
            "date": "2013-04-03T01:34:19+0000",
            "content": "Looks good to me.\n\nis having this option a bad idea? should we document it or keep it hidden for tests?\n\nIt seems fine to me, but it seems safer to not advertise initially. No demand yet anyway. I'd doc it as subject to change and unsupported myself. \n\ni think we could probably speed up TestReplicationhandler \n\n+1 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13621476",
            "date": "2013-04-03T23:08:27+0000",
            "content": "Linking two bugs i noticed symptoms of while working on these tests. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13621479",
            "date": "2013-04-03T23:11:00+0000",
            "content": "revised patch based on further testing.\n\nas noted on the mailing list, \"doTestIndexAndConfigAliasReplication\" already occasionally fails because the core reload happens async and the test queries too quickly – with my patch, i noticed it failing a lot more (because i had eliminated a lot of automatic sleep in rQuery) so in this patch i updated it to include a polling on the core status to watch for the core reload to finish.\n\nstill doing some heavy looped test runs to see if any other problems shake out. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13621583",
            "date": "2013-04-04T00:33:55+0000",
            "content": "with the last patch, i was seeing a lot of failures from checkForSingleIndex in doTestStressReplication when i hammered on the tests.\n\nDiscussing with miller on IRC, our theory was that this was another situation where the core reload (because of conf file changes) wasn't happening fast enough, the check was seeing both the old and new directories during the core reload.\n\nBased on this theory, i added the same watchCoreStartAt logic to doTestStressReplication – but i'm still seeing checkForSingleIndex fail because 3 index dirs are found instead of 2, and in most cases the seeds seem to fail consistently.\n\neven w/ hammering the tests with multiple threads, this seed (using hte attached patch against trunk r1464110) consistently fails for me...\n\n\n[junit4:junit4]   2> NOTE: reproduce with: ant test  -Dtestcase=TestReplicationHandler -Dtests.method=doTestStressReplication -Dtests.seed=F431DE409B18D684 -Dtests.slow=true -Dtests.locale=no_NO_NY -Dtests.timezone=Europe/Minsk -Dtests.file.encoding=UTF-8\n[junit4:junit4] FAILURE 10.7s | TestReplicationHandler.doTestStressReplication <<<\n[junit4:junit4]    > Throwable #1: java.lang.AssertionError: [./org.apache.solr.handler.TestReplicationHandler$SolrInstance-1365034992030/slave/collection1/data/index.20130404032320911, ./org.apache.solr.handler.TestReplicationHandler$SolrInstance-1365034992030/slave/collection1/data/index.20130404032314898, ./org.apache.solr.handler.TestReplicationHandler$SolrInstance-1365034992030/slave/collection1/data] expected:<2> but was:<3>\n[junit4:junit4]    > \tat __randomizedtesting.SeedInfo.seed([F431DE409B18D684:2F9ADE869E30BF37]:0)\n[junit4:junit4]    > \tat org.apache.solr.handler.TestReplicationHandler.checkForSingleIndex(TestReplicationHandler.java:813)\n[junit4:junit4]    > \tat org.apache.solr.handler.TestReplicationHandler.doTestStressReplication(TestReplicationHandler.java:787)\n\n\n\nMark Miller: can you sanity check this latest patch and try that seed?  if that seed passes for you (try hammering the tests with \"ant test -Dtestcase=TestReplicationHandler -Dtests.dups=10 -Dtests.jvms=5\") "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13629687",
            "date": "2013-04-12T01:57:31+0000",
            "content": "\nAfter adding a lot of debug logs, and walking through the results of lots of failed tests compared to successful tests, and a lot of vigorous, physical consultation between my forehead and my desk i think i've finally tracked down the cause of all the \"expected 2 got 3\" failures from checkForSingleIndex.\n\nThe problem in a nutshell is one of concurrency. When the test thread makes a request to the master or to the slave those requests are handled by a jetty thread which (via SolrDispatchFilter) creates a SolrQueryRequest, which has a searcher ref, which has a Directory ref.  When the request is done, the SolrQueryRequest is closed, hich releases the searcher ref, which releases the directory ref – but by the time this happens, the response has already been returned to the \"client\" (the test thread), and the test thread may enter checkForSingleIndex to acquire the lock on the CacheDirectoryFactory (to check the list of cached paths) before the resources from a previos rquest have been completely released – so the test fails because an Directory from an old request still hasn't been released.\n\nExample...\n\n\nTime   Test-Thread              Jetty-Thread-N\n0      http request->jetty\n1                               accept http request\n2                               create solr query request\n3                               incref searcher, incref dir\n4                               process solr query request\n5                               test thread<-write http response\n6      process response\n7      ...    \n8      assert(2=num dirs)\n9                               decref seracher, decref dir, release dir\n\n\n\nI think the key change is to modify checkForSingleIndex so that instead of asserting exactly 2 paths in the cache, we assert that there are only 2 paths that are not \"done\" – allowing for the possibility of other paths still being tracked because of requests still being closed.\n\n\nThe attached patch makes this change – there are still some nocommits (in particular i completely commented out hte replication core reloading to rule that out as a possible cause, but there's also some excessively absurd logging) but even if you ignore all that, after replacing \"CachingDirectoryFactory.getPaths()\" with \"CachingDirectoryFactory.getLivePaths()\" I have yet to see \"expected:<2> but was:<3>\" in any test run.  If you tweak that method to eliminate the \"!val.doneWithDir\" dir check, you should start seeing the failures come back.\n\nI'll clean the patch up more tomorow and run some more exhaustive tests to be sure i haven't broken anything, but i wanted to post what i had in case i got hit by a buss (and to ensure Mark Miller doesn't see any flaw with my \"getLivePaths()\" change before i get too happy about it)\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13629692",
            "date": "2013-04-12T02:05:27+0000",
            "content": "bq: vigorous, physical consultation between my forehead and my desk \n\nAnd here I thought I was the only one that felt that way from time to time <G>.... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13630436",
            "date": "2013-04-12T18:20:49+0000",
            "content": "Cleaned up the patch to remove all nocommits and improve the javadocs a bit. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13631262",
            "date": "2013-04-14T04:02:40+0000",
            "content": "I committed my patch to trunk & 4x, leaving issue open because i think miler had some other test improvements in mind as well.\n\nCommitted revision 1467723.\nCommitted revision 1467725. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717133",
            "date": "2013-07-23T18:47:13+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13862649",
            "date": "2014-01-05T20:46:40+0000",
            "content": "Calling this done for now. Anything else can get it's own issue. "
        }
    ]
}