{
    "id": "SOLR-3112",
    "title": "after running 'ant test' solr/solrj/src/test-files/solrj/solr/shared/test-solr.xml is leftover",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "This is especially confusing, as then it looks like you dont have a clean checkout.\n\nFor now it should be under svn:ignore, but ultimately we really should not be creating files under src/test-files",
    "attachments": {
        "SOLR-3112.patch": "https://issues.apache.org/jira/secure/attachment/12519638/SOLR-3112.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Luca Cavanna",
            "id": "comment-13236493",
            "date": "2012-03-23T10:18:56+0000",
            "content": "Looks like the test which leaves the test-solr.xml there is TestEmbeddedSolrServer. I'm working on fixing it. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13236508",
            "date": "2012-03-23T10:47:20+0000",
            "content": "Thanks for taking a look Luca! \nI was unable to fix this with my first shot on SOLR-3268... I'm guessing really the test just needs to be fixed. "
        },
        {
            "author": "Luca Cavanna",
            "id": "comment-13236667",
            "date": "2012-03-23T15:23:17+0000",
            "content": "I noticed that TestSolrProperties and TestEmbeddedSolrServer were really similar. They both worked on the test-files folder, but the last one cleaned everything at the end, while the second one not.\nI created a base class to avoid copy pasting the same code, then I changed both to work on a temp directory, without modifying anything on the test-files folder.\n\nRegarding the other elevate-data-distrib.xml problem mentioned in the SOLR-3268, I had a look at it. It seems to copy the core/src/test-files/solr/conf/elevate.xml to same path but different filename (elevate-data-distrib.xml) right before testing. Then the test uses the new file and doesn't clean it at the end. Well, I wonder why the test makes that copy. Maybe I didn't get something, but rather than cleaning at the end, my patch removes that copy and the test seems to work anyway. Let me know if there's a better fix for this! "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13236695",
            "date": "2012-03-23T15:46:55+0000",
            "content": "Wow, thanks Luca for fixing these test issues! I just committed this. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13236746",
            "date": "2012-03-23T16:29:49+0000",
            "content": "Thanks!\n\nOne thing: we should now be able to remove the extra <delete/> and the extra comment on \"ant clean\" in solr's build.xml? "
        }
    ]
}