{
    "id": "SOLR-3415",
    "title": "web gui: Show urls for every command, not just the query",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It is very very helpful to see all of the different calls made by the old UI. The query box has a handy 'show the http' box. Please make this common to all of the pages, and also show the Ajax calls.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13262546",
            "date": "2012-04-26T12:06:29+0000",
            "content": "I mostly understand what you'd like to have, but it's not that easy (as for the query page) for most of the others. the dashboard is fetching at least 4 different sources, schema-browser has also to do additional calls to get all required informations.\n\n..., and also show the Ajax calls\nWhat do you mean? Do we have Ajax Calls where typical used Spinners are missing? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13263091",
            "date": "2012-04-26T20:24:46+0000",
            "content": "I use the old admin UI as an exploration tool for drilling down into problems, not as a dashboard. The new UI is very much an operations dashboard. I often need to use and change the direct Solr calls to figure out what I want to look for.\n\nAlso, I often have intermittent or buggy connections, and if the spinner blocks I can't re-start the ajax call. I don't care about the display, but the underlying information. \n\nDo we have Ajax Calls where typical used Spinners are missing?\nNo, I was mistaken there. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13264277",
            "date": "2012-04-28T09:46:46+0000",
            "content": "Hm, first Idea for that: Use the whitespace on top of the UI as Log for all Ajax-Requests? So you could see which ones are triggered from the UI, and perhaps we can put there some Controls (at least stop, perhaps restart, ..) in place? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13264433",
            "date": "2012-04-28T23:07:23+0000",
            "content": "Right. There are JSON editor tools in browsers. Something that lets you edit and resubmit the posted JSON?\n\nThis is veering off into interactive troubleshooting  "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15389001",
            "date": "2016-07-22T06:33:47+0000",
            "content": "Can we close this? These days all the browsers include developer/troubleshooting tools, including with interactive editing of query and so on. Seems like too low level for the Admin UI. "
        }
    ]
}