{
    "id": "SOLR-4747",
    "title": "DIH close database connection directly after entity is completed",
    "details": {
        "affect_versions": "4.2",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I use DIH to create an index for a number of postgres databases. These databases all contain an identical schema/table setup. The config looks like <entity rootEntity=\"false\"><entity/><entity/></entity> repeated for each datasource. The readonly flag is set to true on the subentity objects. For each database solr creates three connections. These connections remain active as \"idle in transaction\" until the indexer is finished. As the number of databases times three exceeds my max_connections setting in postgres the indexer inevitably fails halfway through with a no more connections available error.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13638031",
            "date": "2013-04-22T14:25:35+0000",
            "content": "It sounds like you want DIH to close all connections per root entity as soon as all rows have been processed. This way, when DIH goes to the next root entity, connections for the previous entity's data sources would have been closed. If so, the title of the issue should be changed because DIH does close connections but not when you expect. "
        },
        {
            "author": "Remko Kuipers",
            "id": "comment-13638928",
            "date": "2013-04-23T10:20:41+0000",
            "content": "I had assumed the connections would be closed automatically, especially as I'm using readOnly on the root entities, after the entities using them were done. But you are right, if there is a way to instruct the DIH to commit the transaction and close the commits directly after the entity is finished that would solve the issue. I'll update the title accordingly. "
        }
    ]
}