{
    "id": "SOLR-2253",
    "title": "Solr should be able to keep on truckin' if a shard fails during a distributed search",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Critical",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Solr 1.4.x currently abandons searches if a shard fails during a distributed search.  A trivial patch to the SearchHandler class would allow the user to tell Solr to \"keep on trucking\" in these cases.  Solr can indicate that the search response is \"partial\" via existing response header conventions, as well as include details about which shard failed.",
    "attachments": {
        "SOLR-2253.patch": "https://issues.apache.org/jira/secure/attachment/12460465/SOLR-2253.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Rich Cariens",
            "id": "comment-12935806",
            "date": "2010-11-25T17:27:40+0000",
            "content": "I've attached a patch for the following classes:\n\n  org.apache.solr.handler.component.SearchHandler\n  org.apache.solr.common.params.CommonParams\n\nand the example search request handler configuration:\n\n  example/solr/conf/solrconfig.xml\n\nTo see this patch in action, apply it at the solr root and run \"ant example\".  Then follow the distributed search example instructions (http://wiki.apache.org/solr/DistributedSearch#Distributed_Search_Example) to get two Solr instances running locally.  Run the curl command to search across both instances.  Stop the instance that's listening on port 7574 and re-run the curl command.  You will get a search response containing a header that reports you've got partial results, as well as which shard failed. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12936132",
            "date": "2010-11-26T23:53:35+0000",
            "content": "SOLR-1143 \nWe've already been around the block on this one \n\nThanks for your enthusiasm!\n "
        },
        {
            "author": "Tommaso Teofili",
            "id": "comment-13224760",
            "date": "2012-03-07T21:59:56+0000",
            "content": "I think we can mark this one as duplicate of SOLR-1143 "
        }
    ]
}