{
    "id": "SOLR-11144",
    "title": "Analytics Component Documentation",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.2",
            "master (8.0)"
        ],
        "affect_versions": "7.1",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Adding a Solr Reference Guide page for the Analytics Component.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-08-09T17:24:02+0000",
            "content": "GitHub user HoustonPutman opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/229\n\n    SOLR-11144: Initial version of the analytics component reference.\n\n\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/HoustonPutman/lucene-solr analytics-solr_ref_guide\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/229.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #229\n\n\ncommit 54410ff9d13efcf174cff3ad0d8667cbe84e75a1\nAuthor: Houston Putman <hputman1@bloomberg.net>\nDate:   2017-08-03T16:33:00Z\n\n    SOLR-11144: Initial version of the analytics component reference.\n\n ",
            "author": "ASF GitHub Bot",
            "id": "comment-16120305"
        },
        {
            "date": "2017-08-09T17:35:46+0000",
            "content": "Thanks for the pull request! I'll assign this to myself and will try to get you feedback in the next couple of days. ",
            "author": "Cassandra Targett",
            "id": "comment-16120325"
        },
        {
            "date": "2017-08-29T15:48:57+0000",
            "content": "Any feedback Cassandra Targett? ",
            "author": "Houston Putman",
            "id": "comment-16145514"
        },
        {
            "date": "2017-08-29T18:14:50+0000",
            "content": "Sorry Houston Putman, I looked at it briefly but not as deeply as I wanted to, then went on vacation and now I'm focused on finishing the minimum needs for 7.0 Ref Guide. I haven't forgotten about it yet. I was tentatively hoping we could get it into 7.0, but probably more likely 7.1. ",
            "author": "Cassandra Targett",
            "id": "comment-16145822"
        },
        {
            "date": "2017-08-30T17:46:56+0000",
            "content": "Sounds good, thanks for the update. ",
            "author": "Houston Putman",
            "id": "comment-16147675"
        },
        {
            "date": "2017-10-18T17:19:58+0000",
            "content": "I've finally finished a rather thorough round of review & edits for these docs. I changed a lot of stuff, so I created a branch jira/solr-11144 and have pushed that so you can pull the branch if you want - it's up to date with master as of a few minutes ago.\n\nI didn't keep a list of the stuff I changed as I went, so this list is from memory - if you notice anything I changed to be incorrect, please let me know.\n\n\n\tI changed all of the usages of ⟹ to \\=>. The character you used rendered very small in both HTML and PDF. I could have left it as => and asciidoctor would have converted it to a nice icon that's larger than what you had used, but this doesn't work in the PDF at all, so precommit doesn't allow it.\n\tA lot of your examples in the reference pages were in the form of \"example input\" => \"example output\", but the input/output sections should be separately monospaced to avoid confusion about which is input and which is output. I changed these so it would look like \"example input => example output\" instead.\n\tI normalized a lot of uses of bold text, particularly in examples, and changed a lot of capitalization of words to lower case.\n\tIn analytics-reduction-functions.adoc, all of the examples were marked as Labeled Lists (with the double colons at the end of the line), but unlike the other pages of reference, there are no examples that follow. Since there was no entry for the list, this broke the PDF. I removed all of these so they are just plain examples on a single line for each reduction function.\n\tIn analytics.adoc:\n\t\n\t\tI changed the presentation of many of the sections of parameters - we generally do these as Labeled Lists, but you used nested unordered lists (i.e., bullet points) which were quite confusing. I think I grokked the relationships between all the parameters, but you should double-check those because I had a hard time wrapping my head around it completely. As a related note, parameters should also always be in monospace instead of bold - I think I caught all of these, but may have missed one or two.\n\t\tI added some comments that we should address, particularly in the faceting & grouping section. I could see this aspect of the component being used a lot, and the parameters seem under-described to me.\n\t\tThe section on Setup didn't cover adding the path to the .jar to the <lib> directive in solrconfig.xml, so I added that. The Overview section was also removed and replaced with it's sub-sections as main sections.\n\t\n\t\n\n\n\nOne thing I did not fix but needs to be fixed is a mismatch in some pages between the page title and the page shortname - in order for PDF linking to work properly, every page-shortname must match the title and must match the filename (without the .adoc file extension), due to the way the PDF is built as one massive file. If they don't match, the bookmark reference in the PDF won't point to anything and users will jump halfway through a section (if the link happens to work at all, sometimes it won't). This wasn't something you would have known when you wrote this, but we need to fix it before we commit it. We can either change the page-shortname & filenames on these pages or change the page titles - which do you prefer? These are the pages with the mismatch:\n\n\n\tanalytics-reduction-functions.adoc\n\tanalytics-mapping-functions.adoc\n\tanalytics-expression-sources.adoc\n\n\n\nI think that's the bulk of what I changed but may have forgotten some major things since I've been looking at this off & on for a few weeks between other tasks - if you have any questions, please let me know. ",
            "author": "Cassandra Targett",
            "id": "comment-16209702"
        },
        {
            "date": "2017-10-24T15:01:56+0000",
            "content": "Houston Putman - did you have any thoughts on my feedback in the previous comment? I had hoped to get this into the 7.1 Ref Guide, but we need to get that going soon and if you're tied up with other things we can wait until 7.2. ",
            "author": "Cassandra Targett",
            "id": "comment-16217066"
        },
        {
            "date": "2017-10-24T20:45:42+0000",
            "content": "Hey Cassandra Targett. Sorry I'm a bit busy right now, but I should be able to get around to this next week. I believe the Analytics bug fix patch is going into 7.2, so I'm ok with waiting for 7.2 for this. ",
            "author": "Houston Putman",
            "id": "comment-16217662"
        },
        {
            "date": "2017-10-24T20:57:20+0000",
            "content": "Sounds good Houston, thanks. ",
            "author": "Cassandra Targett",
            "id": "comment-16217692"
        },
        {
            "date": "2017-10-30T21:45:00+0000",
            "content": "Cassandra Targett, I'm going through the changes now. Thank you for all the help!\n\nI've updated the following and made a pull request:\n\n\tAdded parameter sections for all of the facet types\n\tFixed the example analytics expression, since there was a mistake in one of the lines.\n\tChanged the Strings section in Analytics-expression-sources.adoc to use and unordered list instead of an ordered list.\n\tChanged the Titles of the mismatched pages to reflect their shortnames. (So I removed the 'Reference' at the end of each)\n\n\n\nHere is the pull request.\n\nDid I miss anything? Is there anything else that we need to do? ",
            "author": "Houston Putman",
            "id": "comment-16225788"
        },
        {
            "date": "2017-11-01T20:38:07+0000",
            "content": "Changed the Titles of the mismatched pages to reflect their shortnames. (So I removed the 'Reference' at the end of each)\n\nSince my previous comment, Hoss figured out a way to remove the need for that title/shortname/filename match (SOLR-11540), so we don't need to declare page-shortname and page-permalink as params on each page anymore. I'll take those out of your latest patch for you. If you want to add \"Reference\" back into the titles, let me know and I'll add those back in - we don't need to match titles to filenames anymore at all.\n\nThe other changes look pretty straightforward, I'll do one more review for typos and commit. ",
            "author": "Cassandra Targett",
            "id": "comment-16234706"
        },
        {
            "date": "2017-11-01T21:20:44+0000",
            "content": "I'm fine keeping the \"Reference\" out of the titles. ",
            "author": "Houston Putman",
            "id": "comment-16234768"
        },
        {
            "date": "2017-11-02T18:18:48+0000",
            "content": "Commit 6428ddb10e975f8b8955aebb9b59e5de201face0 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6428ddb ]\n\nSOLR-11144: Add Analytics Component docs to the Ref Guide ",
            "author": "ASF subversion and git services",
            "id": "comment-16236314"
        },
        {
            "date": "2017-11-02T18:19:13+0000",
            "content": "Commit ebcf7c7acfd49d29193cb44fa6f1759f0d156658 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ebcf7c7 ]\n\nSOLR-11144: Add Analytics Component docs to the Ref Guide ",
            "author": "ASF subversion and git services",
            "id": "comment-16236315"
        },
        {
            "date": "2017-11-02T18:22:35+0000",
            "content": "Big thank you, Houston Putman, for writing these docs and then being so patient waiting for the review.  ",
            "author": "Cassandra Targett",
            "id": "comment-16236322"
        },
        {
            "date": "2017-11-02T19:24:15+0000",
            "content": "I did neglect to add the PR #s to my commit message to close them - if you wouldn't mind closing them yourself, Houston, that would be great. ",
            "author": "Cassandra Targett",
            "id": "comment-16236432"
        },
        {
            "date": "2017-11-02T19:31:52+0000",
            "content": "Github user HoustonPutman commented on the issue:\n\n    https://github.com/apache/lucene-solr/pull/229\n\n    Analytics reference merged in [this commit.](https://github.com/apache/lucene-solr/commit/6428ddb10e975f8b8955aebb9b59e5de201face0) ",
            "author": "ASF GitHub Bot",
            "id": "comment-16236449"
        },
        {
            "date": "2017-11-02T19:31:53+0000",
            "content": "Github user HoustonPutman closed the pull request at:\n\n    https://github.com/apache/lucene-solr/pull/229 ",
            "author": "ASF GitHub Bot",
            "id": "comment-16236450"
        }
    ]
}