{
    "id": "SOLR-9079",
    "title": "Upgrade commons-lang to version 3.x",
    "details": {
        "components": [],
        "type": "Wish",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Current version used is /commons-lang/commons-lang = 2.6 and a key motivation would be to have commons.lang3 APIs available e.g. org.apache.commons.lang3.tuple.Pair as an alternative to org.apache.solr.common.util.Pair variant.\n\nThis dev list posting reports on exploring use of 3.4 instead of 2.6 and concludes with the discovery of an optional zookeeper dependency on commons-lang-2.4 version.\n\nSo upgrading commons-lang can't happen anytime soon but this ticket here to track motivations and findings so far for future reference.\n\nselected links into other relevant dev list threads:\n\n\thttp://mail-archives.apache.org/mod_mbox/lucene-dev/201605.mbox/%3CA9C1B04B-EA67-4F2F-A9F3-B24A2AFB8598%40gmail.com%3E\n\n\n\n\n\n\thttp://mail-archives.apache.org/mod_mbox/lucene-dev/201605.mbox/%3CCAN4YXvdSrZXDJk7VwuVzxDeqdocagS33Fx%2BstYD3yTx5--WXiA%40mail.gmail.com%3E\n\n\n\n\n\thttp://mail-archives.apache.org/mod_mbox/lucene-dev/201605.mbox/%3CCAN4YXvdWmCDSzXV40-wz1sr766GSwONGFem7UutkdXnsy0%2BXrg%40mail.gmail.com%3E\n\n\n\n\n\thttp://mail-archives.apache.org/mod_mbox/lucene-dev/201605.mbox/%3cc6c4e67c-9506-cb1f-1ca5-cfa6fc880586@elyograg.org%3e",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-05-06T15:48:36+0000",
            "author": "Shawn Heisey",
            "content": "Finished checking the dependencies on all the non-lucene_solr jars in WEB-INF/lib, using maven central.  Other dependencies (besides zookeeper) which depend on commons-lang 2.x:\n\ncommons-configuration (we're using a release that's over 7 years old!)\nhadoop-common\nhadoop-hdfs ",
            "id": "comment-15274248"
        },
        {
            "date": "2016-05-06T19:00:51+0000",
            "author": "Alan Woodward",
            "content": "I'd actually go the other way, and try and remove commons-lang entirely.  Guava too, and commons-configuration if we can.  We're on Java 8 now, lots of the things that these libraries were introduced to fix are part of the core language.  And the few methods that we do need, we can fork and include in a Utils package.  Importing jars for the sake of a couple of classes just bloats the distribution and leads to dependency hell. ",
            "id": "comment-15274569"
        },
        {
            "date": "2016-05-06T19:23:02+0000",
            "author": "Mike Drob",
            "content": "Is there a benefit to removing commons-lang or guava when we still transitively depend on them? ",
            "id": "comment-15274593"
        },
        {
            "date": "2016-05-06T19:35:51+0000",
            "author": "Alan Woodward",
            "content": "Depends if they're compile-time or runtime dependencies, I guess.  I think it's worth exploring, anyway. ",
            "id": "comment-15274614"
        },
        {
            "date": "2016-05-06T20:38:41+0000",
            "author": "Erick Erickson",
            "content": "+a lot, I hadn't thought sideways at the problem.\n\nThe argument that \"some other dependency includes it so we might as well use it\" is not something I can subscribe to., it just means those other projects should see if they can get rid of those dependencies too \n\nSmart-aleckness aside, I think there are very sound reasons to remove dependencies if we can. The point of third-party dependencies it to reduce the work developers need to do. Including a dependency requires ongoing work to maintain it (witness this discussion and Shawn's efforts to see about upgrading). So moving from some dependency to core Java seems like a total win to me.\n\nOf course \"It Depends\"(tm) on how much effort it would take to remove the dependencies..... ",
            "id": "comment-15274688"
        },
        {
            "date": "2016-05-06T20:46:33+0000",
            "author": "Mike Drob",
            "content": "The arguments about developer effort to upgrade versions and ensure compatibility make sense to me. That seems more important than a couple of megabytes here or there. ",
            "id": "comment-15274706"
        },
        {
            "date": "2016-05-07T17:05:35+0000",
            "author": "Mark Miller",
            "content": "I don't see commons-lang causing bloat or dependency hell. If we are going to use third party libraries at all, it seems like a simple one. Sure, if we are not taking advantage of a library, better to not depend on it, but I don't see a reason to try and save hundred's of K or even MB's here and there. I don't really like the idea of making our own Util versions to avoid dependencies either. We are not a library, we are a search server, and and the core dependencies are not that large at all in this age. ",
            "id": "comment-15275309"
        }
    ]
}