{
    "id": "SOLR-7",
    "title": "can't post queries",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "One can't currently post a query (must be an http-get).\nThe same servlet handles /update and /select, and the doPost method always treats the request as an update.",
    "attachments": {
        "update_servlet.txt": "https://issues.apache.org/jira/secure/attachment/12325018/update_servlet.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12373427",
            "date": "2006-04-06T04:53:26+0000",
            "content": "I remember being slightly anoyed by this at one point, and thinking it would be really easy to refactor the code into two seperate servlets bound to the seperate paths – but then i realized the init method for hte servlet is what makes the core, and I wasn't motivated enough to make a choice of how to deal with that.\n\nThe simplest approach would probably be to have a QueryServlet bound to /select that is in charge of initializing the core, and an UpdateServlet bound to /update ... since arguably there are more use cases where you might want to query a port without ever updating it then there are to updating a port without ever querying it.\n\nOf course, a seperate servlet/filter could be created to manage the core, it doesn't really matter that much "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12373542",
            "date": "2006-04-07T05:05:57+0000",
            "content": "as discussed in email, a ServletContextListener registered in the web.xml using <listener> would be the most logical place to put core construction/desrtuction.\n\non a slightly related note: if/when someone splits the curernt SolrServlet into an UpdateServlet and a QueryServlet, it would probably make sense for both of them to be regsitered with <load-on-start>1</load-on-start>. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12373543",
            "date": "2006-04-07T05:07:37+0000",
            "content": "er, scratch that load-on-startup comment ... i'm two times a fool for both missunderstanding the meaning of that tag for hte last 3 years and for not reading to the end of a thread before summarizing it in a bug. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12373547",
            "date": "2006-04-07T05:19:36+0000",
            "content": "here is a quick refactor...\nany objections?\n\nthe context listener stuff is independent and can be handled later. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12373654",
            "date": "2006-04-08T00:05:11+0000",
            "content": "OK, posting queries to /select now works for me, and updates are handled by a separate servlet. "
        }
    ]
}