{
    "id": "SOLR-5931",
    "title": "solrcore.properties is not reloaded when core is reloaded",
    "details": {
        "affect_versions": "4.7",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "multicore"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "When I change solrcore.properties for a core, and then reload the core, the previous values of the properties in that file are still in effect. If I unload the core and then add it back, in the “Core Admin” section of the admin UI, then the changes in solrcore.properties do take effect.\n\nMy specific test case is a DataImportHandler where db-data-config.xml uses a property to decide which DB host to talk to:\n\n\n<dataSource driver=\"org.postgresql.Driver\" name=\"meta\" url=\"jdbc:postgresql://${dbhost}/${solr.core.name}\" .../>\n\n\n\nWhen I change that dbhost property in solrcore.properties and reload the core, the next dataimport operation still connects to the previous DB host. Reloading the dataimport config does not help. I have to unload the core (or fully restart the whole Solr) for the properties change to take effect.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13954969",
            "date": "2014-03-31T06:27:21+0000",
            "content": "Are you sure this used to work ever? I mean is it a bug or an enhancement request? "
        },
        {
            "author": "Gary Yue",
            "id": "comment-13954986",
            "date": "2014-03-31T07:10:41+0000",
            "content": "Hi,\n\nI also notice the same problem. (I am upgrading from 3.5 to 4.7)\nI used to be able to define master.url in solrcore.properties, and any changes there will take effect after an reload.\nHowever, this is no longer working on 4.7.\nI notice the doc says:\n------------\nStarting with Solr4.0, the RELOAD command is implemented in a way that results a \"live\" reloads of the SolrCore, reusing the existing various objects such as the SolrIndexWriter. As a result, some configuration options can not be changed and made active with a simple RELOAD...\n\nIndexWriter related settings in <indexConfig>\n<dataDir> location\n-----------\n\nNot sure if this includes properties defined in solrcore.properties file.\n\nGary\n "
        },
        {
            "author": "Gunnlaugur Thor Briem",
            "id": "comment-13955085",
            "date": "2014-03-31T10:43:00+0000",
            "content": "I can't say for sure whether this worked earlier (I only just started to use solrcore.properties to control this, at the same time as I was upgrading exactly like Gary, from 3.5 to 4.7).\n\nIn any case, I do consider it a bug, even if only in the sense of “violating the principle of least astonishment.” : ) Applying configuration changes is the whole point of reloading the core, for me at least — and changes in solrconfig.xml and schema.xml and db-data-config.xml do get applied, so it seems incongruous for solrcore.properties to be different. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13955131",
            "date": "2014-03-31T12:27:52+0000",
            "content": "I'm pretty sure this never worked. That said, I agree that it should work.\n\nShalin:\nSo dont' waste any time looking for \"what changed to break this functionality\", I strongly doubt you'll find anything like that. This is just new functionality...\n\nAlan Woodward do you agree?\n "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13955153",
            "date": "2014-03-31T13:02:19+0000",
            "content": "I don't think it would have worked when I started looking at this code, but I can't speak for what it did before...\n\nI guess what needs to be done is to add a 'reload' method to CoresLocator which will update the CoreDescriptor - at the moment CDs are immutable across the lifetime of the CoreContainer, except for create() and unload() calls (which is why this works if you unload and then create the core). "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13955386",
            "date": "2014-03-31T17:04:34+0000",
            "content": "Yeah, this makes sense. The properties should be reloaded upon core reload. The thing is that I can't find how these properties make their way into DIH. I'll have to setup an example and step through with a debugger. I don't think I'll find the time this week. "
        },
        {
            "author": "Gary Yue",
            "id": "comment-13955475",
            "date": "2014-03-31T18:17:36+0000",
            "content": "Is there a good workaround in the meantime?\nWe need a quick way to switch master URL on individual the slaves in case of site issues. Updating solrconfig.xml directly for particular slave doesn't work well because the change will get overwritten on each replication (unless we change this in master's solrconfig as well)\n\nAlso, looks like i can't even call \"CREATE\" with the new property b/c starting in solr 4.3+, it will return throw an error and ask you to call \"RELOAD\" instead. (where as in solr3.x this i s essentially doing a RELOAD with new properties) \n\nthx! "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13955756",
            "date": "2014-03-31T21:43:21+0000",
            "content": "Gary:\n\nFirst, this would have been best asked on the user's list first...\n\nBut if you're using old-style master/slave configurations, you can configure the replication to take particular files from the master and replicate them to a differently-named file on the slave. See the example here (conffiles is the param). Does that work?\n\nSee: https://cwiki.apache.org/confluence/display/solr/Index+Replication "
        },
        {
            "author": "Gary Yue",
            "id": "comment-13955910",
            "date": "2014-03-31T23:56:47+0000",
            "content": "thanks Eric. I'll ask on the user list for these kind of questions going forward.\n\nRegarding your suggestion: i am aware of such support, but not sure how this is different from changing the \"replication for slave\" section of solrconfig.xml on master solr. In both cases, you will need to make a change on master box, and it can take up to few minutes for the files to be replicated (especially if u have multiple level of replication hierarchy, for example master A-> repeater B->slave C). I understand that this may be the only workaround available though, as there appears to be no other way of getting RELOAD to re-read a local property file (like solrconfig.properties) which is not meant to be replicable. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13956051",
            "date": "2014-04-01T03:06:24+0000",
            "content": "\nIs there a good workaround in the meantime?\nWe need a quick way to switch master URL on individual the slaves in case of site issues. Updating solrconfig.xml directly for particular slave doesn't work well because the change will get overwritten on each replication (unless we change this in master's solrconfig as well)\n\nOne option is using xinclude in your solrconfig.xml file.  In solrconfig.xml, you would have something like this:\n\n\n<requestHandler name=\"/replication\" class=\"solr.ReplicationHandler\" xmlns:xi=\"http://www.w3.org/2001/XInclude\">\n  <lst name=\"slave\">\n    <xi:include href=\"masterUrl.xml\">\n      <xi:fallback><str name=\"masterUrl\">http://default_master:port/solr/corename</str></xi:fallback>\n    </xi:include>\n    <!-- other replication options -->\n  </lst>\n</requestHandler>\n\n\n\nWith this config, normally masterUrl does not need to exist.  When you need to switch the master URL, create masterUrl.xml in the same location as solrconfig.xml and reload/restart.  It needs contents like this:\n\n\n    <str name=\"masterUrl\">http://master_host:port/solr/corename</str>\n\n\n\nYou can also do this without the fallback, in which case you'd use a config like this and masterUrl.xml would always need to exist.\n\n\n<requestHandler name=\"/replication\" class=\"solr.ReplicationHandler\" xmlns:xi=\"http://www.w3.org/2001/XInclude\">\n  <lst name=\"slave\">\n    <xi:include href=\"masterUrl.xml\" />\n    <!-- other replication options -->\n  </lst>\n</requestHandler>\n\n\n\nAs long as you don't include masterUrl.txt in the list of config files to replicate, it won't get overwritten on the slave.\n\nThis is only to give you the general idea of xinclude.  You can rearrange this in any way that you require. "
        },
        {
            "author": "Gary Yue",
            "id": "comment-13956190",
            "date": "2014-04-01T07:37:01+0000",
            "content": "thanks Shawn. This should work for me! "
        },
        {
            "author": "Dominik Siebel",
            "id": "comment-14043093",
            "date": "2014-06-25T06:35:04+0000",
            "content": "Addition: It also seems that properties linked via solr.xml core attribute \"properties\" are not reloading anymore (version 4.6).\nI used to use this file to dynamically enable/disable replication for specific nodes and reload the core. Now I have to restart the whole Node.\nThis definitely worked before (version 4.3) Does this qualify as a \"bug\" Shalin Shekhar Mangar ?  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14043391",
            "date": "2014-06-25T12:32:35+0000",
            "content": "Does this qualify as a \"bug\" Shalin Shekhar Mangar ? \n\nI'd say so  "
        },
        {
            "author": "Balaji",
            "id": "comment-14319770",
            "date": "2015-02-13T09:14:28+0000",
            "content": "When this issue will be fixed. I am in Production phase. After upgrading from Solr 4.1 to 4.10.3, In final testing stage only I have found this issue . Could you please suggest me any solution for this issue. And I have tried what Shalin Shekhar Mangar suggested to add an xml file. Please suggest something.\nThanks in advance. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14320258",
            "date": "2015-02-13T15:16:09+0000",
            "content": "bq: When this issue will be fixed.\n\nPatches always welcome, see: http://wiki.apache.org/solr/HowToContribute\n "
        },
        {
            "author": "Brad",
            "id": "comment-14680822",
            "date": "2015-08-10T21:47:15+0000",
            "content": "+1 "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539789",
            "date": "2016-10-02T05:28:57+0000",
            "content": "This case seems to be a mix of lacked-features, maybe-bug, and is again an old version of Solr (so may have been fixed already).\n\nI don't see any next action in this. I think it may be easiest to close this issue and open a new one if something like this comes up against latest Solr. "
        }
    ]
}