{
    "id": "SOLR-3474",
    "title": "It would be great if the SolrCloud cluster viz views would auto refresh.",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Admin UI",
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "If you are sitting on that screen and knock down a server, would be nice for that to show up without requiring a refresh.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13280835",
            "date": "2012-05-22T09:26:40+0000",
            "content": "Mark, what would you like to see here? Only the state of live_nodes? or should we refresh both, live_nodes and clusterstate.json? A automatic refresh every 10 seconds, the same way we have it already on the logviewer? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13280934",
            "date": "2012-05-22T13:21:00+0000",
            "content": "I think live_nodes and clusterstate.json auto update would be nice - but most important to me is the cluster state visualization - I guess that means we need to get both cluster.json and live_nodes anyway, because you need all that to create the cluster viz. My worry is that you put your browser on that page to make sure everything is happy, and oh a node goes down and everything still looks green an hour later - until you hit refresh...\n\nEvery 10 seconds sounds reasonable to me. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13280941",
            "date": "2012-05-22T13:34:54+0000",
            "content": "perhaps i should write down everything i think about the next time ;o i was also talking about the two Graph-Views. I'll see what we can do here, hold on  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412112",
            "date": "2012-07-11T22:26:03+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429852",
            "date": "2012-08-07T03:43:36+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445535",
            "date": "2012-08-31T01:04:02+0000",
            "content": "There is no indication that anyone is actively working on this issue, so removing 4.0 from the fixVersion. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13455717",
            "date": "2012-09-14T10:53:40+0000",
            "content": "I just had a talk at JavaZone about Solr4 and SolrCloud, and used the cluster graph to demonstrate failover etc. How about a refresh setting defaulting to 10s but which can be changed with a dropdown?\n\nAlso, is it possible to dynamically adapt the size of the graph? When you have a small 2-3 node cluster, it is displayed on a fraction of the available space, and for my conference audience they could not read the text on the nodes. It would be great that if on every refresh, you also calculate optimal zoom factor. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13455719",
            "date": "2012-09-14T10:54:43+0000",
            "content": "Indicating fix for 4.1 since this is not critical enough for 4.0 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13540928",
            "date": "2012-12-29T15:48:57+0000",
            "content": "An option to change the refresh rate sounds good - on a large cluster, it could take a fair bit of time to keep pulling down cluster info for example.. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717339",
            "date": "2013-07-23T18:47:55+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971192",
            "date": "2014-04-16T12:57:25+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}