{
    "id": "SOLR-4332",
    "title": "Adding documents to SolrCloud collection broken when a node doesn't have a core for the collection",
    "details": {
        "affect_versions": "4.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "In SOLR-4321, it's documented that creating a collection via API results in some nodes having more than one core, while other nodes have zero cores.\n\nNot sure if this is desired behavior, but when a node doesn't know about a core, it throws a 404 on select/update.\n\nReproduction:\n-Create a 2 node SolrCloud cluster\n-Create a new collection with numShards=1. 50% of your cluster will have a core for that collection.\n-Do an update or select against the node that doesn't have the core. 404\n\nLike I said, not sure if this is desired behavior, but I would expect a cluster of nodes to be able to forward requests appropriately to nodes that have a core for the collection.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13560792",
            "date": "2013-01-23T16:10:01+0000",
            "content": "If we want the simplicity of being able to push content to ANY node in the cluster, and expect it to be forwarded to the correct master (the way I've understood the intention), then this is a \"bug\".\n\nCustomers using a ZK aware client should be fine as it is \"intelligent\", but others need to keep track of this themselves.\n\n+1 to finding a solution to this "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13560839",
            "date": "2013-01-23T17:20:14+0000",
            "content": "It's not necessarily desired behavior, but it is known behavior. We have talked about having a core act as a scatter-gather core in this case - and I've even played around along those lines once. Never finished it though - one tricky issue to deal with is if there are no cores...so should we just create a tmp core to do the search? \n\nIt's basically in the future improvement bucket. Patches welcome though. "
        }
    ]
}