{
    "id": "SOLR-7830",
    "title": "topdocs facet function",
    "details": {
        "components": [
            "Facet Module"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "A topdocs() facet function would return the top N documents per facet bucket.\nThis would be a big step toward unifying grouping and the new facet module.",
    "attachments": {
        "ALT-SOLR-7830.patch": "https://issues.apache.org/jira/secure/attachment/12925760/ALT-SOLR-7830.patch",
        "SOLR-7830.patch": "https://issues.apache.org/jira/secure/attachment/12757105/SOLR-7830.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-17T15:56:04+0000",
            "author": "Yonik Seeley",
            "content": "Here's a draft patch - no distributed merging code yet.\n\nThis is the first facet function / aggregation that supports JSON rather than just function query notation.  The query parameters are taken from the JSON Request API: http://yonik.com/solr-json-request-api/\n\n// retrieve the top document per facet bucket based on another lucene query\ntop : \n{ topdocs : \"another_lucene_query\" }\n\n// retrieve the top document per facet bucket based on the main query & sort\ntop : \"topdocs()\"\n\n// A bigger example using all of the supported args:\n\ntop : {\n  type : topdocs,\n  query : \"another_lucene_query\",\n  offset : 0,\n  limit : 5,\n  sort : \"field_i desc\",\n  fields : \"id,*_s,custom_val:add(field1,field2)\"\n}\n\n ",
            "id": "comment-14803125"
        },
        {
            "date": "2015-09-17T20:09:50+0000",
            "author": "Yonik Seeley",
            "content": "New patch with missing TopDocsAgg.java added ",
            "id": "comment-14804405"
        },
        {
            "date": "2018-05-30T14:21:27+0000",
            "author": "Tim Owen",
            "content": "I've attached a new patch, I took your original patch and updated it for the 7x branch, then added distributed search support (the merging and re-sorting).\n\nWe wanted this functionality as it's really useful to fetch 1 or 2 sample documents with each bucket for some of our use-cases, and this approach of using the topdocs aggregate function works really nicely.\n\nThe only limitation is that the sorting for distributed searches can only work with field sorting, not with functional sorting, and you can only sort by fields that are included in the results (otherwise it would need to include the sort values in shard responses - this could be done, but it was more complex and we didn't need that for our use-case). Also, the offset parameter isn't used, but we felt pagination of these topdocs was quite niche (but it could be added to this patch). ",
            "id": "comment-16495223"
        }
    ]
}