{
    "id": "SOLR-2567",
    "title": "Solr should default to TieredMergePolicy",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.3",
            "4.0-ALPHA"
        ],
        "components": [
            "update"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "even if we set a luceneMatchVersion to >= 3.2 (SOLR-2557),\nSolr still defaults to LogByte",
    "attachments": {
        "SOLR-2567.patch": "https://issues.apache.org/jira/secure/attachment/12481056/SOLR-2567.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13042080",
            "date": "2011-06-01T10:09:33+0000",
            "content": "the patch currently adjusts the default based on luceneMatchVersion, but this is confusing if we release 3.2 that \"disagrees\" with lucene's actual 3.2 defaults.\n\nwe could check onOrAfter 3.3 at least to be safe so we don't surprise anyone when 3.3 comes out "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042406",
            "date": "2011-06-01T20:37:59+0000",
            "content": "updated the patch, to check onOrAfter 3.3.\n\nAlso it applies mergefactor and compoundfile to TieredMergePolicy.\n\nI think this is ready to commit. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13042413",
            "date": "2011-06-01T20:42:05+0000",
            "content": "Patch looks great – thanks Robert! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13042426",
            "date": "2011-06-01T20:54:45+0000",
            "content": "the patch currently adjusts the default based on luceneMatchVersion, but this is confusing if we release 3.2 that \"disagrees\" with lucene's actual 3.2 defaults.\n\nI don't think all of Solr's defaults need to match Lucene's defaults in general - we can take it on a case-by-case basis.  In this case, a TieredMergePolicy default certainly does make sense.  I'm not even sure it needed to be linked to luceneMatchVersion... it's a rare solr user that would depend on the specifics of merging or docid behavioral changes. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042442",
            "date": "2011-06-01T21:16:53+0000",
            "content": "Well, mostly here I was admitting that I screwed this up for 3.2\n\nOne of the major reasons we respun was to ensure solr used the most recent lucene version configuration so it had features like this... yet it still didnt enable TieredMP.\n\nI guess what I'm saying is... I'm willing to respin if anyone thinks its a huge deal. In this case I honestly think our 3.2RC is a good release even though this isn't enabled yet, and we should just target 3.3. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13042447",
            "date": "2011-06-01T21:30:23+0000",
            "content": "I just wanted to remember that the matchVersion stuff this time is done without reparsing each time duck\n\nI agree with Yonik, that in the case of Solr, we can easily change the default without matchVersion, as nothing in solr depends on docids in order. Solr always used real docids. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13042452",
            "date": "2011-06-01T21:35:02+0000",
            "content": "I don't think we should respin – just make it the default MP for 3.3?\n\nBut, I think we should use luceneMatchVersion to conditionalize it.\nIt's a biggish change, that docIDs can now be \"shuffled\", so in case\nthere is some Solr app out there that relies on docIDs staying in order,\nwe should respect the luceneMatchVersion. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13042457",
            "date": "2011-06-01T21:40:28+0000",
            "content": "Additionally, I dont think its a problem to respin because of that. If we want consistency in Solr with Lucene (and I am huge +1 to be consistent in all case - this time against Yonik), we should respin and fix this (along with the small issues brought on the vote thread). "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042458",
            "date": "2011-06-01T21:40:35+0000",
            "content": "Solr always used real docids.\n\nEven when you sort only by score? in this case the lucene docid is the \"tiebreaker\", no? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13042461",
            "date": "2011-06-01T21:46:50+0000",
            "content": "My initial reaction was it was not worth re-spinning for this either. But mostly based on the assumption that the user could just configure it, and at worst we could drop a note about it.\n\nThen I saw that there would be some side affects to that based on this patch? I didn't really look closely, but from memory, I guess it would disable being able to set compound file? And you wouldn't be able to change the tiered policies settings? Or does Solr's config any given method voodoo work in this case?\n\nEither way, I'd be fine if we didn't respin or if we did. It would still be an improvement, even if it didn't support compound, and then that can be another improvement. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042465",
            "date": "2011-06-01T21:47:44+0000",
            "content": "Additionally, I dont think its a problem to respin because of that. \n\nYou are right, its no problem at all to respin, I don't mind doing this at all. The only problem is that committers must spend their time to re-review the release candidate, but I suppose if they watch the commits list they can be more confident in their checking and not have to waste a lot of time, since its only this issue and maybe two other small things that were found.\n\nIn fact, Mike committed a \"HuperDuper\" automated-checker to do some of the grunt work of checking a release to luceneutil today: http://code.google.com/a/apache-extras.org/p/luceneutil/source/detail?r=5bf3a0ea4922bbeb38a0a16c503b42e07c028eab\n\nSo maybe its a good opportunity to use this utility to aid in easier review of release candidates. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042471",
            "date": "2011-06-01T21:57:19+0000",
            "content": "\nThen I saw that there would be some side affects to that based on this patch? I didn't really look closely, but from memory, I guess it would disable being able to set compound file? And you wouldn't be able to change the tiered policies settings? Or does Solr's config any given method voodoo work in this case?\n\nRight, this is definitely a downside to not having this patch, they cannot set compoundFile or mergeFactor. \n\nAnd you are also right about tiered policy settings... you will notice I didn't actually enable these in the patch. I guess thats because I thought it would be confusing to add \"MP-specific\" settings all piled in to the config. I was planning on opening another issue for this to allow for a factory configuration like other things, especially so I can pass a 'long' random seed so that tests can use MockRandomMergePolicy  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042475",
            "date": "2011-06-01T22:07:53+0000",
            "content": "Anyway, I'm interested in what others think the right thing to do here is... we can bring it to the dev@ list if it will grab more attention.\n\nthe choices to me seem to be:\n\n\trelease 3.2 as is, enable TieredMergePolicy in 3.3, using luceneMatchVersion >= 3.3\n\trelease 3.2 as is, enable TieredMergePolicy in 3.3, just changing the default completely.\n\trespin and use this patch, with TieredMergePolicy defaulted on for luceneMatchVersion >= 3.2 (consistent with lucene), but you don't have total configuration over all its settings (just mergefactor and compoundfile).\n\trespin like the above, but also quickly try to add support for MergePolicyFactory or similar, so that all tieredMP settings are exposed\n\n\n\nand maybe there are other ideas I haven't mentioned. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13042479",
            "date": "2011-06-01T22:12:22+0000",
            "content": "+1 for #1 (release 3.2 as is, enable full TMP support in 3.3) "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13042484",
            "date": "2011-06-01T22:20:49+0000",
            "content": "+1 for #1 too "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13042533",
            "date": "2011-06-02T00:36:00+0000",
            "content": "Yeah, our release process can be painful enough (esp given the 72 hr thing) that I don't think this should keep us from releasing 3.2.\nI'm fine with #1 or #2 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13042658",
            "date": "2011-06-02T09:21:17+0000",
            "content": "OK, I created SOLR-2572 to improve mergepolicy configuration. \n\nThis way when we enable TieredMP, the user will be able to configure all of its options "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13046100",
            "date": "2011-06-08T17:36:09+0000",
            "content": "ok, here's a patch for committing.\n\nAfter reviewing SOLR-2572, I think its overkill at the moment.\n\nThis is because SolrPluginUtils.applySetters takes care of all possible parameters we have in all of our mergepolicies (including contrib) available today: all the parameters are setters that take primitive types.\n\nSo, I'd like to commit this shortly and cancel SOLR-2572 as \"won't fix\".\n\nI added a test that configures some tiered-mp specific stuff. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13058959",
            "date": "2011-07-02T02:43:14+0000",
            "content": "Bulk close for 3.3 "
        }
    ]
}