{
    "id": "SOLR-7327",
    "title": "DefaultSolrHighlighter should lazily create a FVH FieldQuery.",
    "details": {
        "components": [
            "highlighter"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Duplicate",
        "priority": "Minor"
    },
    "description": "DefaultSolrHighlighter switches between both the standard/default/classic Highlighter and the FastVectorHighlighter, depending on parameters and field options.  In doHighlighting(), it loops over the docs, then loops over the highlighted fields, then decides to use one highlighter or the other.  Outside of the doc loop it creates a FastVectorHighlighter instance (cheap) and a related FieldQuery object that may or may not be cheap.  fvh.getFieldQuery takes an IndexReader instance and it will be used for certain queries like MultiTermQuery (e.g. wildcards).  We shouldn't be doing this unless we know we'll actually need it – it should be lazily constructed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-30T14:15:19+0000",
            "author": "David Smiley",
            "content": "Note that there is even some argument it shouldn't be using the top-level IndexReader when we can supply a TermVectorLeafReader thin wrapper around term vector Terms instance.  I'm unsure what the net perf trade-off would end up being.  I do know that the MultiTermQuery wouldn't be limited to the top-1024 terms though (more accurate highlights), and that's good.\n\nside-note: unfortunately the Terms implementation provided by CompressingTermVectorsReader is O(N) for many interactions.  If it had an FST based terms dictionary, this would unlikely be so; which isn't to say an FST is required just that efficient lookup would have been simple. ",
            "id": "comment-14386742"
        },
        {
            "date": "2016-11-10T21:21:13+0000",
            "author": "David Smiley",
            "content": "Done in SOLR-6692 already ",
            "id": "comment-15655178"
        }
    ]
}