{
    "id": "SOLR-8039",
    "title": "Add new book: Apache Solr Search Patterns",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Jayant Kumar is proud to announce the book 'Apache Solr Search Patterns' by Packt Publishing. This book is for developers who have prior knowledge on Solr and are looking at procuring advanced strategies for improving their search using Solr. Also, if you work with analytics to generate graphs and reports using Solr and you are a search architect who is looking forward to scale your search using Solr, then this book is a perfect guide for you.\n\nApache Solr Search Patterns begins with a brief introduction of analyzers and tokenizers to understand the challenges associated with implementing large-scale indexing and multilingual search functionality. It then moves on to working with custom queries and understanding how filters work internally. While doing so, it also helps the readers create their own query language or Solr plugin that does proximity searches. \n\nFurthermore, the book discusses how Solr can be used for real-time analytics and tackle problems faced during its implementation in e-commerce search. It then dives into the spatial features such as indexing strategies and search/filtering strategies for a spatial search. And also do an in-depth analysis of problems faced in an ad serving platform and how Solr can be used to solve these problems.\n\nClick here to read more about the Apache Solr Search Patterns: http://bit.ly/1J2neZ9",
    "attachments": {
        "book_solr_patterns.jpg": "https://issues.apache.org/jira/secure/attachment/12765924/book_solr_patterns.jpg",
        "solr-8039.patch": "https://issues.apache.org/jira/secure/attachment/12765923/solr-8039.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-10-09T22:19:13+0000",
            "author": "Jayant Kumar",
            "content": "I have attached the patch with changes to the site. Please review.\nbook_solr_patterns.jpg goes inside assets/images (complete path : trunk/content/solr/assets/images) folder. ",
            "id": "comment-14951305"
        },
        {
            "date": "2015-10-10T20:28:48+0000",
            "author": "Steve Rowe",
            "content": "Updated patch to order the new book by publication date (it was published on 2015-04-26), to between \"Apache Solr Enterprise Search Server 3ed\" (published 2015-05-26) and \"Solr Cookbook 3ed\" (published 2015-01-23), and added link to the Solr front page book cover images, displacing \"Instant Apache Solr for Indexing Data How-to\".  Also renamed anchor fragment id and book image name from \"solr-patterns\" to \"solr-search-patterns\", to be more reflective of the book name and maybe avoid future name clashes.\n\nCommitting and publishing shortly. ",
            "id": "comment-14952041"
        },
        {
            "date": "2015-10-10T20:29:47+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1707910 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1707910 ]\n\nSOLR-8039: Add new book: Apache Solr Search Patterns ",
            "id": "comment-14952042"
        },
        {
            "date": "2015-10-10T20:36:28+0000",
            "author": "Steve Rowe",
            "content": "Committed and published. ",
            "id": "comment-14952045"
        }
    ]
}