{
    "id": "SOLR-2609",
    "title": "Allow arbitrary bbox lat-lon, not limited to circle",
    "details": {
        "affect_versions": "3.1",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "spatial"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The Spatial Search documentation states that you can create your own bounding box using a range query:\n\"Since the LatLonType field also supports field queries and range queries, one can manually create their own bounding box rather than using bbox: ...&q=:&fq=store:[45,-94 TO 46,-93]\"\n\nThis works unless your range covers an area where longitude goes from 180 to -180. For instance I want all items in the longitude range of \n178 to -177 which of course gives no results (it is not a valid numeric range). It's not really surprising that this doesn't work as it is just a standard range query with no spatial filters being applied.\n\nUPDATE\nUpdated issue to be an enhancement, title changed.\n\nDesired functionality is for bbox to accept coordinate parameters for an arbitrary size bounding box. The bbox should take into account the prime meridians, in particular the 180th meridian.\nDocumentation also needs to be updated to remove incorrect query example.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13051988",
            "date": "2011-06-20T14:27:34+0000",
            "content": "I highly doubt this can be fixed, based on how it works. The documentation/wiki should be updated to note this problem.\n\nI recommend you use bbox: http://wiki.apache.org/solr/SpatialSearch#bbox_-_Bounding-box_filter\nGranted you cannot specify an arbitrary bounding box, only one based on a point-distance, but this may be good enough. "
        },
        {
            "author": "Zac Smith",
            "id": "comment-13052093",
            "date": "2011-06-20T17:32:20+0000",
            "content": "It would be really great if there was support for creating arbitrary bounding boxes that do work over the 180th meridian.\nShould this be changed from a bug to a feature request to that end? "
        },
        {
            "author": "David Smiley",
            "id": "comment-13052136",
            "date": "2011-06-20T18:29:24+0000",
            "content": "Yes, this should be a feature request for \"Allow arbitrary bbox lat-lon, not limited to circle\".  Under the hood, I recall the first order of business is resolving the point-radius to a bounding box. At that point the special prime-meridian logic is handled. It seems it would not be hard to make a patch that ads new parameters for explicit lat-lon bbox params. "
        },
        {
            "author": "Zac Smith",
            "id": "comment-13052151",
            "date": "2011-06-20T18:49:36+0000",
            "content": "Thanks David, I have updated this to be a feature request. "
        }
    ]
}