{
    "id": "SOLR-3040",
    "title": "Avoid use of qt param for the DIH in the admin UI",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I really, really dislike that the qt parameter can used to refer to request handlers starting with a '/', especially for non-search handlers.  The admin UI has one place I am aware of that attempts to do this, which is the DIH's admin page.  Since we have two UIs in trunk, the new and old, there are actually two UIs where this occurs, and the old UI has two related files that need updating, in order to address this issue.\n\nAn example URL generated by the UI today is this:\n  http://localhost:8983/solr/rss/select?qt=/dataimport&command=show-config\nAnd here it is without using qt:\n  http://localhost:8983/solr/rss/dataimport?command=show-config\n\nI do realize that fixing this issue as I do in my patch will make the UI not work if the DIH isn't registered with a leading '/', but honestly I wonder who if anyone out there does that.  And even then, it's easily rectified.",
    "attachments": {
        "SOLR-3040_avoid_qt_for_DIH_in_admin_ui.patch": "https://issues.apache.org/jira/secure/attachment/12510816/SOLR-3040_avoid_qt_for_DIH_in_admin_ui.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13214321",
            "date": "2012-02-23T05:18:35+0000",
            "content": "I'm going to commit this within 24 hours unless someone says otherwise.   "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13214530",
            "date": "2012-02-23T10:28:42+0000",
            "content": "+0 - just be sure to call out a sufficient CHANGES entry that mentions that non-/-prefixed DIH handlers will need to be changed.  And maybe only do this change on 4.x rather than 3.x since it is kind of an unnecessary break.\n\nDon't get me wrong, I'm all for getting Solr to handle path-based request handlers without qt - I'd rather all request handlers be path-based personally (even if I'm the one that committed qt=/rh to work, as this was for consistency on the client-side) and to get rid of qt fully (but that's a separate issue). "
        },
        {
            "author": "David Smiley",
            "id": "comment-13214619",
            "date": "2012-02-23T13:21:05+0000",
            "content": "Thanks for reminding me to add a CHANGES entry because I definitely should.  I plan on doing this on both branches because I think it would be both unlikely and a bad idea for someone to not have a leading slash on their DIH handler, and it's trivial for them to fix, and if they insist on not fixing it then this piece of the admin UI won't work which is hardly the end of the world – it's just an html page.\n\nThe rest of your comment pertains to SOLR-1233 which as you surmised is what I'll be doing next.  Lets discuss that issue there, not here. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13214908",
            "date": "2012-02-23T18:22:45+0000",
            "content": "Sorry, I was thinking this was more externally visible of a change, in that the URLs you were changing were ones external systems would hit, but now I'm clear.... updated to +1 based on clarity   It's all internal to the DIH control panel (which arguably shouldn't be embedded in the core webapp anyway, eh). "
        },
        {
            "author": "David Smiley",
            "id": "comment-13215449",
            "date": "2012-02-24T07:03:37+0000",
            "content": "Committed branch_3x: r1293105 trunk: r1293102\n\nCHANGES.txt entry underneath upgrade instructions:\n\n* SOLR-3040: The DIH's admin UI (dataimport.jsp) now requires\n DIH request handlers to start with a '/'. (dsmiley)\n\n\n\n\nFYI it turned out that in the span of time since when I did the first patch and when I committed now, the new admin UI already gained this limitation (leading '/' required).  Wether deliberate or accidental, I'm glad. "
        },
        {
            "author": "Chris Male",
            "id": "comment-13215451",
            "date": "2012-02-24T07:08:10+0000",
            "content": "Thanks for tackling this David, its a good improvement. "
        }
    ]
}