{
    "id": "SOLR-9575",
    "title": "Initialize an empty solr-home",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "The user may not want to use Solr's default solr-home dir location – most likely to use a separate disk.  If you do this, there are two main problems:\n\n\tsolr.xml & zoo.cfg aren't there\n\tconfigsets aren't there\n\n\n\nOf course you could copy it manually but that's an extra step, and it's particularly annoying to add this step to a Docker setup.  Docker is all the rage these days, and for good reason.  If I mount a volume at /opt/solr/server/solr then it basically masks this part of the built-in Solr image (thus making configsets completely invisible) and points to some place that will be empty.  Solr obviously complains.  I could set the solr-home to some other path that I mount, but Solr would still complain about an empty solr-home – no solr.xml\n\nIf solr-home is empty, and if it's a dir other than the default solr-home, then I think the solr-home should be initialized with solr.xml and zoo.cfg copied from the default solr-home.  I think configsets should be referenced from the default solr-home if there is no configsets dir in solr-home.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-27T22:31:21+0000",
            "author": "Jan Høydahl",
            "content": "+1 ",
            "id": "comment-15527608"
        },
        {
            "date": "2016-09-28T00:24:06+0000",
            "author": "Hoss Man",
            "content": "If solr-home is empty, and if it's a dir other than the default solr-home, then I think the solr-home should be initialized with solr.xml and zoo.cfg copied from the default solr-home.\n\n-1\n\nAs a general pattern, the idea that \"directory X is empty, (or non-existent) therefore solr should fill it in with defaults\" is dangerous because it leads to situations where people make mistakes during installation and configure/run solr with the wrong paths (typo, mistaken understanding of what dir they need, etc....) and there is no obvious feedback that something is wrong.\n\nI'd much rather see us add a bin/solr init-home /some/dir/that/is/empty/or/does/not/exist command that copies the suggested defaults over then have it happen automagically\n\n(see for example SOLR-8649 where there is a discussion of the merits of moving away from automagically creating paths in ZK because people run into exactly this type of mistake with ZK chroot directory mistakes) ",
            "id": "comment-15527895"
        },
        {
            "date": "2016-09-28T02:03:00+0000",
            "author": "Erick Erickson",
            "content": "+1 to Hoss' idea. I also would rather fail than do things under the covers.\n\nIf it addresses the basic concern I think it's a much better idea than creating the SOLR_HOME dir automagically. ",
            "id": "comment-15528104"
        },
        {
            "date": "2016-09-29T19:33:02+0000",
            "author": "David Smiley",
            "content": "Thanks for the input.  SOLR-8649 would not be a problem with the additional requirement of \"empty\" as indicated in the title of this ticket.  It should not be enough for solr.xml to be absent, in what I propose here – the directory should be empty. If that is not convincing enough, then what about an additional optional env variable like SOLR_HOME_INIT_EMPTY?  I'm not opposed to a separate bin/solr init-home ... suggestion, but that doesn't resolve this issue – it doesn't help Docker specifically in which I can only set one command to run, plus env variables.  Yeah people can and do build their own images for software they use all the time, but Solr would be much easier to use via Docker if we didn't ask people to do that. ",
            "id": "comment-15533808"
        },
        {
            "date": "2017-02-02T10:31:00+0000",
            "author": "Jan Høydahl",
            "content": "Discovered that Solr's own install_solr_service.sh script forgets to copy zoo.cfg into /var/solr/data/, causing an error when creating a collection in embedde-zk mode.\n\nIt may not be very common to use the installer to install a single-node with embedded ZK, but it's a bug, so I filed SOLR-10088.\n\nFor this special case I think that Solr could have safely initialized the zoo.cfg file, since we're in embedded ZK mode, and solr.xml already exists... ",
            "id": "comment-15849769"
        },
        {
            "date": "2017-03-04T22:54:42+0000",
            "author": "Jan Høydahl",
            "content": "Just committed a fix to SOLR-10088 which at least makes the install script do the right thing.\n\nSo what's the next step for this issue? Perhaps a compromise could be a sys prop to force init of SOLR_HOME? E.g. -Dsolr.home.init=true? So the default would be false as today, but it would be possible to start Solr on a new HOME with one command as David requests. ",
            "id": "comment-15895930"
        },
        {
            "date": "2017-03-06T05:06:48+0000",
            "author": "David Smiley",
            "content": "Perhaps a compromise could be a sys prop to force init of SOLR_HOME? E.g. -Dsolr.home.init=true?\n\nRight.  Note that since the last time I commented, in the docker-solr project, I managed to convince its maintainer (Martijn Koster) to add an opt-in equivalent:  https://github.com/docker-solr/docker-solr/blob/master/scripts/init-solr-home#L26   INIT_SOLR_HOME env var.  Nonetheless it'd be better to have this feature up-streamed (in Solr proper) so that docker-solr needn't have this extra. ",
            "id": "comment-15896749"
        }
    ]
}