{
    "id": "SOLR-4280",
    "title": "spellcheck.maxResultsForSuggest based on filter query results",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.5"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "spellcheck.maxResultsForSuggest takes a fixed number but ideally should be able to take a ratio and calculate that against the maximum number of results the filter queries return.\n\nAt least in our case this would certainly add a lot of value. >99% of our end-users search within one or more filters of which one is always unique. The number of documents for each of those unique filters varies significantly ranging from 300 to 3.000.000 documents in which they search. The maxResultsForSuggest is set to a reasonable low value so it kind of works fine but sometimes leads to undesired suggestions for a large subcorpus that has more misspellings.\n\nSpun off from SOLR-4278.",
    "attachments": {
        "SOLR-4280-trunk-1.patch": "https://issues.apache.org/jira/secure/attachment/12569341/SOLR-4280-trunk-1.patch",
        "SOLR-4280.patch": "https://issues.apache.org/jira/secure/attachment/12776182/SOLR-4280.patch",
        "SOLR-4280-trunk.patch": "https://issues.apache.org/jira/secure/attachment/12592531/SOLR-4280-trunk.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Markus Jelsma",
            "id": "comment-13578361",
            "date": "2013-02-14T13:34:16+0000",
            "content": "Patch for trunk introducing a spellcheck.percentageResultsForSuggest. It uses the filterCache to check the maximum number of possible results so whether a term is misspelled relies on how large the maximum result set is and the value for this parameter. \n\n\nSince the filterCache cannot be retrieved from SolrIndexSearcher.getCache() at this moment you'll have to hack into it and have it add the filterCache to the cacheMap somewhere in the constructor.\n\n\ncacheMap.put(filterCache.name(), filterCache);\n\n "
        },
        {
            "author": "James Dyer",
            "id": "comment-13578447",
            "date": "2013-02-14T16:02:51+0000",
            "content": "Markus,\n\nOn SOLR-4278, you said,\n\n\nIt would be helpful if we can take the number of hits for a single filter from the filterCache itself.\n\nI think the key here is \"single filter\".  I think it would be possible for a user to misuse this feature and have it constantly adding entries to the filterCache to check if different scenarios have a high enough percentage to get a suggestion.  Can we lock it down so users won't have to deal with unexpected bad performance in this case? "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13578460",
            "date": "2013-02-14T16:15:32+0000",
            "content": "Hi James,\n\nI'm not sure that i follow. This patch only obtains the number of results for a given. If the user has a single filter in the query lang:nl this patch looks up the number of results for that filter only. The same is true for multiple filters e.g. fq=lang:en&fq=host:apache.org, it just iterates over the these filters in the cache and gets the number of documents they can return.\n\nHow would a user misuse this feature? This patch does not write to the filterCache, users do so by adding fq-parameters.\n\nThanks "
        },
        {
            "author": "James Dyer",
            "id": "comment-13578466",
            "date": "2013-02-14T16:25:29+0000",
            "content": "I'm thing I misunderstood initially.  Thanks for the clarification. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13709719",
            "date": "2013-07-16T12:34:24+0000",
            "content": "I forgot i had a working patch laying around. Specify spellcheck.percentageResultsForSuggest=0.25 to force maxResultsForSuggest to be 25% of the smallest filterQuery DocSet. This allows maxResultsForSuggest to be adjusted dynamically based on the filters specified. \n\nIt doesn't seem to work in a distributed environment although the parameters are passed nicely. I haven't figured that out yet, but all shards return the same collation for undistributed requests. Tips? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717248",
            "date": "2013-07-23T18:47:37+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13744941",
            "date": "2013-08-20T13:08:52+0000",
            "content": "New patch. This patch now also works in a distributed environment. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971244",
            "date": "2014-04-16T12:57:33+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "James Dyer",
            "id": "comment-15045768",
            "date": "2015-12-07T21:28:42+0000",
            "content": "Here is an updated patch for Trunk.  I've included unit tests and changed javadoc to reflect the added functionality.  I've also modified how this gets triggered.  Rather than introduce a new request parameter, the user passes in \"spellcheck.maxResultsForSuggest\" as a fractional percent, between 0 and 1.  So if the user wants no more than 5% of the most-selective filter's results to be the maximum results to trigger suggestions, they would specify \"spellcheck.maxResultsForSuggest=.05\".  If, for instance, the most-selective filter returns (by itself) 100 documents, then the effective maximum number of hits we will return without triggering spelling suggestions is 5.\n\nMarkus Jelsma does this all sound right to you?  Is this still a feature you want and would be interested in seeing committed? "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-15046790",
            "date": "2015-12-08T12:05:11+0000",
            "content": "Hello James Dyer - this sounds very good. However, an addition to this feature would be the option to also choose which filter the fraction operates on. I have seen some strange results when drilling deeper using more and more restrictive filters.\n\nIt was originally meant to use maxResultsForSuggest in a multi-tenant index. The current maxResultsForSuggest is not suitable for clients having a very large index and clients having a small index.\n\nHow about an optional spellcheck.maxResultsForSuggest.fq=field:value. If the user specifies this, the patch won't need to find the most restrictive filter.\n\nM. "
        },
        {
            "author": "James Dyer",
            "id": "comment-15046908",
            "date": "2015-12-08T14:23:53+0000",
            "content": "Markus Jelsma  Are you able to take the updated patch and add the additional functionality you suggest?  I agree that the \"most-restrictive\" filter might not serve everyone's needs, but all-in-all this might be a nice feature for multi-tenant situations. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-15048485",
            "date": "2015-12-09T11:01:03+0000",
            "content": "Updated patch. Added SPELLCHECK_MAX_RESULTS_FOR_SUGGEST_FQ = spellcheck.maxResultsForSuggest.fq to take a filter query. Only used if maxResultsForSuggest is a fraction. "
        },
        {
            "author": "James Dyer",
            "id": "comment-15062340",
            "date": "2015-12-17T17:05:51+0000",
            "content": "Clean-up patch with slightly better testing, javadoc.  Once I can run tests & precommit on it, I will commit this. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-15062645",
            "date": "2015-12-17T19:40:25+0000",
            "content": "Commit 1720636 from jdyer@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1720636 ]\n\nSOLR-4280: Allow specifying \"spellcheck.maxResultsForSuggest\" as a percentage of filter query results "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-15062652",
            "date": "2015-12-17T19:43:08+0000",
            "content": "Commit 1720637 from jdyer@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1720637 ]\n\nSOLR-4280: Allow specifying \"spellcheck.maxResultsForSuggest\" as a percentage of filter query results "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-15062716",
            "date": "2015-12-17T20:16:52+0000",
            "content": "Great work James! Many thanks! "
        },
        {
            "author": "James Dyer",
            "id": "comment-15062922",
            "date": "2015-12-17T21:58:34+0000",
            "content": "And thanks to you, Markus, for actually developing the code for this. "
        }
    ]
}