{
    "id": "SOLR-7393",
    "title": "HDFS poor indexing performance",
    "details": {
        "components": [
            "Hadoop Integration",
            "hdfs",
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.7.2,                                            4.10.3",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Critical"
    },
    "description": "When switching SolrCloud from local dataDir to HDFS directory factory indexing performance falls through the floor.\n\nI've also observed very high latency on both QTime and code timer on HDFS writes compares to local dataDir writes (using check_solr_write.pl from https://github.com/harisekhon/nagios-plugins). Single test document write latency jumps from a few dozen milliseconds to 700-1700 millisecs, over 2000 on some runs.\n\nA previous bulk online indexing job from Hive to SolrCloud that took 2 hours for 620M rows ended up taking a projected 20+ hours and never completing, usually breaking around the 16-17 hour timeframe when left overnight.\n\nIt's worth noting that I had to disable the HDFS write cache which was causing index corruption (SOLR-7255) on the advice of Mark Miller, who tells me this doesn't make much performance difference anway.\n\nThis is probably also related to SolrCloud not respecting HDFS replication factor, effectively making 4 copies of data instead of 2 (SOLR-6528), but that solely doesn't account for the massive performance drop going from vanilla SolrCloud to SolrCloud on HDFS HA + Kerberos.\n\nHari Sekhon\nhttp://www.linkedin.com/in/harisekhon",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-07T15:32:40+0000",
            "author": "Erick Erickson",
            "content": "Hmmm, what are the specifics? There are quite a few installations running Solr indexes over HDFS with reasonable performance. There's some penalty, but not \"severe\".  So I suspect there's something in your use of Solr over HDFS that's causing you heartburn. Without more details it's impossible to say much. ",
            "id": "comment-15318686"
        },
        {
            "date": "2016-06-07T16:05:43+0000",
            "author": "Hari Sekhon",
            "content": "The difference in write latency was measurably and consistently much higher using the code I mentioned above. The throughput when indexing from Hadoop via Hive/Pig was much worse too, details also mentioned above.\n\nThe only thing I changed in the config was the backend from single local mount point to HDFS directory factory (with Kerberos security settings enabled) as I was running out of space on single disk (SOLR-7256) and hoped to use the more scalable HDFS storage space I had. ",
            "id": "comment-15318760"
        },
        {
            "date": "2016-06-07T19:26:29+0000",
            "author": "Jan Høydahl",
            "content": "Could you share the HdfsDirectoryFactory settings you were having troubles with, along with other details about your cluster, HW, OS, memory settings, SolrCloud topology (#shards/replicas), index size etc? ",
            "id": "comment-15319179"
        },
        {
            "date": "2016-09-09T19:26:18+0000",
            "author": "David Johnson",
            "content": "Does Hadoop have the native library configuration set appropriately?   ",
            "id": "comment-15478021"
        }
    ]
}