{
    "id": "SOLR-8012",
    "title": "Field mapping portion of \"fl\" should be handled in the merger node",
    "details": {
        "components": [
            "search",
            "SearchComponents - other",
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Today \"fl\" is used for \na) filtering the fields and \nb) mapping the field names to alternate names.\n\nwe should optimize the network traffic by not passing the field mappings to all the nodes and run on the node which is fanning-out and merging the request.\n\nThis impacts the network in the cases where there are 100s of shards to send and the field mapping list is huge",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-05T17:14:58+0000",
            "author": "Shawn Heisey",
            "content": "Devil's advocate comment:\n\nWhat if you have thousands of fields in your index, but you only requested three of them?  Do you want your shards returning all of those fields to the merger, only to have virtually all of that information dropped before being sent to the client? ",
            "id": "comment-14732050"
        },
        {
            "date": "2015-09-06T04:49:05+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "I believe Chirag is suggesting that only the field mapping portion of the fl parameter not be sent over the network to each shard and handled entirely on the merger node. The actual field names to be fetched would still be sent to each shard. ",
            "id": "comment-14732188"
        },
        {
            "date": "2015-09-08T18:29:34+0000",
            "author": "Chirag Gupta",
            "content": "Thanks Shalin, I'm saying exactly what you explained.  ",
            "id": "comment-14735344"
        },
        {
            "date": "2015-09-08T18:31:30+0000",
            "author": "Chirag Gupta",
            "content": "Shawn, I was recommending to divide the parts of fl into two parts and not send the mapping part. Shalin explained it in the comment below pretty well.\n\nThanks\nChirag  ",
            "id": "comment-14735351"
        }
    ]
}