{
    "id": "SOLR-8919",
    "title": "Add SELECT COUNT(DISTINCT COL) queries to the SQL Interface",
    "details": {
        "components": [
            "Parallel SQL"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.2",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "While analyzing the Enron emails for SOLR-8888, I was wishing that COUNT(DISTINCT) was implemented. This ticket is to implement it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-06T23:23:35+0000",
            "author": "Kevin Risden",
            "content": "Joel Bernstein - Was there a patch you were working on for this? See that it says in progress. ",
            "id": "comment-15553538"
        },
        {
            "date": "2016-10-07T00:18:21+0000",
            "author": "Joel Bernstein",
            "content": "I planned on getting this in for Solr 6.2 but got side tracked on other tickets. So no patch yet. I'll un-assign myself. ",
            "id": "comment-15553654"
        },
        {
            "date": "2016-10-07T00:24:50+0000",
            "author": "Joel Bernstein",
            "content": "The approach I was going to use is to identify if it's a count distinct query and then just add a count stream to the select distinct logic. This would be in MapReduce mode. I believe count distinct is directly supported by the JSON facet API, so in facet mode, this might involve a change to the FacetStream. Or for the initial facet mode implementation we could just use the select distinct facet code and wrap a count stream. This would be easier then changing the FacetStream. ",
            "id": "comment-15553671"
        },
        {
            "date": "2017-03-05T01:33:15+0000",
            "author": "Kevin Risden",
            "content": "We should double check if this is still necessary or if SOLR-8593 is already generating a SQL plan that works. ",
            "id": "comment-15896014"
        },
        {
            "date": "2017-03-07T00:10:21+0000",
            "author": "Joel Bernstein",
            "content": "I haven't yet looked at the query place that Calcite is generating for this, but I suspect it may not work properly with all the functionality that is being pushed down.\n\nI'd like to push down this functionality anyway, because we have some nice tools for doing this in Solr. \n ",
            "id": "comment-15898430"
        },
        {
            "date": "2018-08-09T01:01:38+0000",
            "author": "Gavin",
            "content": "Move issue from deprecated 'In  Progress' back to 'Open' ",
            "id": "comment-16574142"
        },
        {
            "date": "2018-11-12T08:43:41+0000",
            "author": "Haochao Zhuang",
            "content": "We use an object of Pair<String, String> to represent  a tuple of AggFunctionName and Column. So how to represent the count function with DISTINCT?\n\nMaybe we have to have another function name to represent it by UNIQUE. This is okay for JSON Facet API. \n\nBut it is not really okay for MAP_REDUCE model.\n\n  ",
            "id": "comment-16683413"
        }
    ]
}