{
    "id": "SOLR-3421",
    "title": "Distributed Search doesn't allow for HTTP Authentication",
    "details": {
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SearchComponents - other"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "The distributed search feature allows one to configure the list of shards the SearchHandler should query and aggregate results from using the \"shards\" parameter. Unfortunately, there is no way to configure any sort of authentication between shards and a distributed search-enabled SearchHandler. It'd be good to be able to specify an authentication type, auth credentials, and transport security to allow installations that don't have the benefit of being protected by a firewall some measure of security.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Peter Sturge",
            "id": "comment-13264296",
            "date": "2012-04-28T11:54:08+0000",
            "content": "There is an existing patch for this behaviour - see:\n    issues.apache.org/jira/browse/SOLR-1861\n\nThis patch allows distributed credentials to be passed inside the url, where SearchHandler then parses this an creates HttpConnections for each shard in the distributed search.\nSome useful extensions to this approach would be the use of certificates (instead of explicit credentials), and/or acl lists stored on the server side, with pre-authentication (e.g. via passing hash values instead of explicit credentials). The base mechanism provided in this patch can be used in both cases.\n\nHTH!\nPeter "
        },
        {
            "author": "Peter Sturge",
            "id": "comment-13264297",
            "date": "2012-04-28T11:56:37+0000",
            "content": "It's also worth noting that one of the advantages of this approach is that is allows for partial results to be returned (with error details in the response) if one or more shards are unavailable, but others are ok. An optional flag to allow this (or not) can switch this feature on or off. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15622148",
            "date": "2016-10-31T13:28:24+0000",
            "content": "Closing as implemented, as we got built-in Auth with support for SolrCloud in 5.3. We'll also get Auth support for plain old master/slave search with SOLR-9640. "
        }
    ]
}