{
    "id": "SOLR-10284",
    "title": "Solr connection to Standalone node in Ensemble causes cluster failure",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.3,                                            6.4,                                            7.0,                                            7.1,                                            7.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I posted this issue on the Dev mailing list and was encouraged to create a Jira ticket.  This isn't a bug per-se.\n\nSolr connects / reconnects to \"Standalone\" Zookeeper nodes, within an ensemble cluster, which causes absolute havoc. \n\nI work for Dice.com, as one of the core search developers.\nI'm happy to write a patch, as we'll probably do that internally anyways.  I just want to get consensus from the community about how to provide the best solution.\n\nMy original email describing the issue: \nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201703.mbox/raw/%3CCACbtCQ2cSPA8NbnqCbXZE9nZdT40xFHjpUhAOqUnd%3DqZaRMEsA%40mail.gmail.com%3E/2\n\nProposed Solution:\n\nMy thought was an explicit setting in solr.in.sh \"ZK_STANDALONE\" (which would default to TRUE for the solr.in.sh file found next to bin/solr).  Upon connection or reconnection of the Zookeeper Client, it would ask the server \"are you standalone\", and disconnect if it is and ZK_STANDALONE=false, and try the next host.  If all hosts are in standalone, an error would be shown - \"No zookeeper hosts available, that aren't in standalone operation - The setting ZK_STANDALONE=false prevents connecting to a standalone Zookeeper\"\n\nIn order to urge users to use the setting, I would possibly also have a warning shown in the logs, if your ZK_HOSTS is set, has multiple hosts in the connection string, and ZK_STANDALONE is not false.\n\nI can't think of any implicit way to internalize a setting.... Other than....  ZK_HOSTS connection string setting has multiple hosts, there should be no scenario in which any node is standalone, so you could assume there should be no standalone servers.  But maybe an explicit setting is preferable.\n\nThis solution should be:\n1.) backwards compatible\n2.) have very little performance impact (1 extra call upon connection to ZK)\n3.) isolated to one part of the code.\n\nUpdate 6/26/2017:\n\nI started working on this, and it occurred to me the same issue exists for SolrJ clients.  So SolrJ might be the place to make this change. I'm not sure yet.\nA SolrJ client that has a multi-zk-node connection string that connects (even temporarily) to a zk host that is standalone will believe there are no Solr hosts that can answer the query, and you'll get the following error.  \n\nCloudSolrClient - Request to collection efc-profiles-match-col failed due to (510) org.apache.solr.common.SolrException: Could not find a healthy node to handle the request.\n\nI am not as familiar with the SolrJ codebase ... so I'll have to do some digging.\n\nInstead of moving onto a different Zookeeper host, the SolrJ client will think everything is fully working, just no Solr Hosts or Collections",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-21T13:59:30+0000",
            "content": "ZK_HOSTS connection string setting has multiple hosts, there should be no scenario in which any node is standalone, so you could assume there should be no standalone servers. But maybe an explicit setting is preferable.\nKeep it simple? boolean allowStandaloneZk = numZkHosts == 1;\nIf you write a patch and it passes all our tests I hope we are safe not to break anything (given that we have tests spinning up multi-node ensembles??). Then adding another unit test with the edge cases should solidify coverage (one standalone, WARN log but continue to work, all standalone -> fail?). ",
            "author": "Jan Høydahl",
            "id": "comment-15934660"
        },
        {
            "date": "2017-03-23T17:48:28+0000",
            "content": "Keep it simple? boolean allowStandaloneZk = numZkHosts == 1;\n\nTotally agree, just wasn't sure if there were any corner cases that this would disagree with, sounds like a plan.\n\nI'll update here with my progress on the patch and any further notes/questions.  Thanks for the input. ",
            "author": "Ben DeMott",
            "id": "comment-15938890"
        }
    ]
}