{
    "id": "SOLR-1025",
    "title": "QParsers ignore configured defaultType's",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Whilst trying to implement my own QParser that would work with any XML configured default query type, I noticed that the BoostQParserPlugin had a hard coded assumption that means it ignores the defaultType specified in the XML.\n\nThe problem appears to be the following line:\n\n        baseParser = subQuery(localParams.get(QueryParsing.V), null);\n\nPassing null into subQuery, appears to cause it to get an OldLuceneQParserPlugin if there is no defaultType specified as a localParam, i.e. it doesn't appear to look further down the chain to inspect whether a defaultType has been set in solrconfig.xml.\n\nOther QParsers appear to make similar assumptions (though I haven't tested them).  Changing the above code to the following should resolve the issue.  I'd suggest that this functionality should also be made available inside the QParser base class, so all QParsers can correctly resolve the defaultType.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12706216",
            "date": "2009-05-05T21:46:35+0000",
            "content": "Can you give a concrete example (actual query strings) of what isn't working? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12724160",
            "date": "2009-06-25T17:55:10+0000",
            "content": "Having the default type (defType) only affect the next immediate query parser was a design decision to avoid chaos when one changed a  high level defType.  The default type when not specified is always meant ot be standard lucene/solr syntax. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775663",
            "date": "2009-11-10T15:51:57+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}