{
    "id": "SOLR-9690",
    "title": "Date/Time DocRouter",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "This issue is for a custom Solr DocRouter that works with dates/times (or perhaps any field providing an int).",
    "attachments": {
        "DirectHashRouter.java": "https://issues.apache.org/jira/secure/attachment/12835132/DirectHashRouter.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-25T14:39:45+0000",
            "author": "David Smiley",
            "content": "I started playing with the idea of a custom DocRouter subclassing HashBasedRouter in which the hash integer is parsed from the router.field instead of using a hash function.  I'm thinking that this approach would then allow someone to possibly use shard splitting, and it might allow for more existing Solr infrastructure to be leveraged, for example the shard/slice hash ranges to pick which slice to go to.  The code is attached; it's really an un-used toy at this time.\n\nBut I don't yet know if this approach makes sense for how Solr should do date/time routing as a 1st class feature.  For example, what's the implication of   HashBasedRouter.hashToSlice() throwing an exception if it doesn't see a Slice with a range covering this document?  Maybe it's okay.  Out of scope of this JIRA issue but a follow-on would be auto-creation of shards, perhaps just-in-time (when docs arrive and there is no suitable shard).  And another JIRA issue would be capping a shard by size such that the last shard range's end range integer could be lowered to whatever the time is of the last document.\n\nShalin Shekhar Mangar I'm especially curious what your opinion is, given that you've done work pertaining the the existing DocRouters. ",
            "id": "comment-15605493"
        },
        {
            "date": "2017-08-14T23:32:37+0000",
            "author": "Michael Sun",
            "content": "It's a great idea Solr to be time-series aware. I also see design details in SOLR-11166  by Shawn Heisey.\n\nOne concern is load balancing. In some use cases the amount of docs indexed per day (or per week etc.) highly fluctuates and can't be predicted in advance. Using sharding approach, the time range for each shard seems decided when the shard is created, which is before Solr index any data for that shard. If it turns out the data volume for that shard is too high later, the only choice is shard splitting, which can be expensive.  ",
            "id": "comment-16126617"
        },
        {
            "date": "2017-09-01T18:17:18+0000",
            "author": "David Smiley",
            "content": "Michael Sun: Wether one partitions using a shard or collection technique, I think the end time of the lead partition (most current one) can be dynamic.  The name of the partition could be the start time.  The end time of a partition is immediately prior to whatever the start time is of the next partition.  But if there is no next partition, as in the case of the lead partition, we can extend it as long as needed.  This means we can create new partitions when the lead partition crosses a doc count threshold. \n\nThe main challenge I see would be if you, for whatever reason, end up loading data non-sequentially.  In this event, you would be adding data to partitions that aren't the leader, and they could grow large.  You might also add data way in the future (or simply much after the lead shard's date if even it isn't beyond \"now\"), that trigger partitions to be created based on a date threshold, yet then retroactively add data.  I think this would just be a documented issue and it's something most users could avoid or minimize.\n\nBTW I linked this to SOLR-11299 recently. ",
            "id": "comment-16150964"
        },
        {
            "date": "2017-10-24T20:12:56+0000",
            "author": "David Smiley",
            "content": "closing as \"Won't Fix\" but can be reopened if someone wants to tackle it.  I'm going about time partitioning differently in SOLR-11299. ",
            "id": "comment-16217609"
        }
    ]
}