{
    "id": "SOLR-327",
    "title": "shell scripts failed to run on Solaris 8 (and probably other non recent UNIX)",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "replication (scripts)"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "There are several places where commands used are incompatible with older UNIX versions, even though these capabilities are present.  There are ways to rewrite the shell scripts to be compatible with these older versions.\n\nThe first example is the use of pgrep.  Older machines will have grep, egrep and fgrep, but NOT pgrep. I've been doing UNIX for well over a decade and never heard of pgrep, although it is installed on my home server apparently. \n\nThere are also enhancements like the use of  'cp -l'.  This could be accomplished with the 'ln' command instead on older UNIX versions.  Since it's also used recursively in snapshooter, which 'ln' doesn't support, it makes the command more complex.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Bill Au",
            "id": "comment-12517996",
            "date": "2007-08-06T18:32:46+0000",
            "content": "The latest version of the scripts no longer use \"cp -l\" on Solaris:\n\nhttps://issues.apache.org/jira/browse/SOLR-282\n\nI no longer have access to a Solaris machine so I cannot check myself but according to the Solaris 8 documentation published by SUN pgrep is available on Solaris 8:\n\nhttp://docs.sun.com/app/docs/doc/806-0624/6j9vek5cu?a=view\n\nWhat other incompatibilities have you come across? "
        },
        {
            "author": "Ken Prows",
            "id": "comment-12518544",
            "date": "2007-08-08T20:46:09+0000",
            "content": "On Solaris 10 I also ran into a problem with the  date command. The -d option does not exist for the Solaris version of date. This causes the snappuller script to fail. In order to fix this, I made the below changes. Note that I made these changes off of the latest version from trunk (revision 556910) since there were already some Solaris fixes there.\n\nCHANGED:\n\nrsyncStart=`date +'%Y-%m-%d %H:%M:%S'`\nstartTimestamp=`date d \"$rsyncStart\" +'%Y%m%d%H%M%S'`\nrsyncStartSec=`date -d \"$rsyncStart\" +'%s'`\n\nTO:\n\nrsyncStartSec=`perl -e 'print time'`\nstartTimestamp=`perl -MPOSIX -e 'print POSIX::strftime(\"%Y%m%d%H%M%S\", localtime(time))'`\n\n\nCHANGED:\n\nrsyncEnd=`date +'%Y-%m-%d %H:%M:%S'`\nendTimestamp=`date d \"$rsyncEnd\" +'%Y%m%d%H%M%S'`\nrsyncEndSec=`date -d \"$rsyncEnd\" +'%s'`\n\nTO:\n\nrsyncEndSec=`perl -e 'print time'`\nendTimestamp=`perl -MPOSIX -e 'print POSIX::strftime(\"%Y%m%d%H%M%S\", localtime(time))'`\n\n\n\n\nAs a side note, I'd like to see the  scripts converted from bash to perl for better portability. If there is any interest in that, I'd like to help take that on. "
        },
        {
            "author": "Paul Sundling",
            "id": "comment-12518574",
            "date": "2007-08-08T23:11:47+0000",
            "content": "I agree with Ken.  The true issue I was pointing out was the issue of portability, with Solaris 8 being just a single use case.  So a particular command may be an issue on Solaris 8 or Solaris 10 or AIX or whatever.  \n\nThe CENTRAL question is do we provide the greatest portability, by a lowest common denominator bash script or use Perl script?  \n\nWhen I've built Perl in the past, it goes through an extensive check to see the capabilities of the underlying system.  Perl is probably the best bet for portability.  Perl is even available on Windows.\n\nOne thing is that with Perl scripts, users on Windows would expect the scripts to work there too.  Would the scripts all work on windows, including hard links? "
        },
        {
            "author": "Ken Prows",
            "id": "comment-12518810",
            "date": "2007-08-09T18:55:17+0000",
            "content": "I don't think there is anything the scripts do that couldn't be done using the ActivePerl on windows. Hard links work in windows for NTFS volumes.  There are even cpan modules that provide an rsync API. "
        },
        {
            "author": "Ken Prows",
            "id": "comment-12518815",
            "date": "2007-08-09T19:01:56+0000",
            "content": "On second thought, cygwin may be required to get the scripts to work in windows because of the ssh/rsync requirement. \n\nI've read that you can already get the current bash scripts to run under cygwin, so not much would change on the windows front. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12518822",
            "date": "2007-08-09T19:29:48+0000",
            "content": "Hard links work on NTFS, but the differing semantics still mess things up.\nFor example, you can't delete any of the links to an open file. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12519189",
            "date": "2007-08-11T02:51:44+0000",
            "content": "the replication scripts are not 100% portable on every OS out there – but i don't know that they ever can be – regardless of what language they are written in, or what filesystems are used.\n\nthe important thing is that they are abstracted from the Solr java code in a way that makes it possible for people with funky OSes/filesystems to implement any script/application they want and register it as a postCommit or postOptimize hook on a master box (and send a commit on slave machines when it's time to open a freshly synced index)\n\nif the bash scripts work for a lot of people – GREAT! ... if people want to provide perl scripts that do similar things, also great; if someone wants to submit C code for compiling native binary applications that take care of replication, that's great too.\n\nthe scripts we have now exist because they worked on the platform the original Solr developers used, that doesn't mean there can't be other completley different replication scripts/apps that work on other platforms (or work in completely different ways)  \n\nI personally am more concerned with making sure we don't break the scripts on any platforms they currently do work on then i am about making them work on new platforms. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12621018",
            "date": "2008-08-08T19:24:20+0000",
            "content": "I think this will all go away once SOLR-561 is in. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13580221",
            "date": "2013-02-17T17:07:36+0000",
            "content": "Cleaning up old JIRAs, re-open if necessary. "
        }
    ]
}