{
    "id": "SOLR-3935",
    "title": "Change the default jetty connector to be the NIO implementation.",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13528546",
            "date": "2012-12-11T01:03:25+0000",
            "content": "I still think we should do this. I'll start some investigation soon. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717282",
            "date": "2013-07-23T18:47:43+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971342",
            "date": "2014-04-16T12:57:49+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14492597",
            "date": "2015-04-13T16:30:48+0000",
            "content": "I thought we implemented and resolved this eons ago.  I guess I was wrong.  The jetty in 5.0 is still using the bio connector.\n\nI've been using the nio connector in my Solr install (built using the example jetty) for at least a couple of years on Linux with no ill effects.  I don't remember whether I switched to nio before or after the upgrade to Solr 4.x and jetty 8.  It was probably after that upgrade.\n\nI have not done any benchmarks to compare, but unless there's a problem in the implementation, nonblocking sounds better than blocking, right? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14492695",
            "date": "2015-04-13T17:26:48+0000",
            "content": "Looking at the test infrastructure, I see both the nio and bio implementations imported into JettySolrRunner.  Although there is code that checks whether the connectorName is SelectChannel (nio) or Socket (bio), that code requires a test property to override the default of SelectChannel, and I don't see any indication that this override can happen automatically or randomly:\n\n\nfinal String connectorName = System.getProperty(\"tests.jettyConnector\", \"SelectChannel\");\n\n\n\nI think that the tests will never choose bio connector types unless the user asks for it.  If that thought is correct, we are testing one jetty connector and shipping Solr with a config that uses another, which might lead to subtle bugs. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14493505",
            "date": "2015-04-14T03:31:15+0000",
            "content": "It appears that Jetty 9 (trunk) uses a completely different connector - ServerConnector.\n\nI believe that the upgrade to jetty 9 in branch_5x is planned soon ... which would make my earlier concerns moot. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14494256",
            "date": "2015-04-14T15:28:34+0000",
            "content": "Jetty 9 only has an NIO connector option, so I'm resolving this as a dupe. "
        }
    ]
}