{
    "id": "SOLR-2641",
    "title": "Auto Facet Selection component",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SearchComponents - other"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It sure would be nice if you could have Solr automatically select field(s) for faceting based dynamically off the profile of the results.  For example, you're indexing disparate types of products, all with varying attributes (color, size - like for apparel, memory_size - for electronics, subject - for books, etc), and a user searches for \"ipod\" where most products match products with color and memory_size attributes... let's automatically facet on those fields.",
    "attachments": {
        "SOLR_2641.patch": "https://issues.apache.org/jira/secure/attachment/12485655/SOLR_2641.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-13061582",
            "date": "2011-07-07T20:55:29+0000",
            "content": "Basic implementation of a search component to put after query and before facet that keys off a \"fields used\" field (see SOLR-1280 for how this can be created automatically too), selects the top N fields and sets those as facet.field's automatically. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13061584",
            "date": "2011-07-07T20:57:52+0000",
            "content": "There's loads of room for improvement here, and likely there's better ways to go about even the simple stuff I've done in this initial patch.  Some ideas for improvement: pluggable implementations to determine the \"best\" facets to auto-select given the current request and results, ability to tailor the parameters for each field selected for faceting (should facets be sorted by index or count order?  mincount?  limit?  how to determine these for each field?). "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13061588",
            "date": "2011-07-07T21:02:45+0000",
            "content": "What's needed for this type of thing to do the right thing with distributed search?   The delegating server will need to cull together the counts (in this current implementation) to determine the best field(s) to facet on before distributing those requests to ensure each shard is faceting on the same field(s).  Not sure, yet, how to go about that. "
        },
        {
            "author": "Upayavira",
            "id": "comment-13061810",
            "date": "2011-07-08T07:18:00+0000",
            "content": "Same issue with pivot facets (SOLR-792). I'm going to try to work it out (as a slow, background task). "
        },
        {
            "author": "Toke Eskildsen",
            "id": "comment-13063722",
            "date": "2011-07-12T05:26:09+0000",
            "content": "This looks like a variant of hierarchical faceting. For popularity count as selector, paths like \"color/green\", \"memory_size/4GB\" would produce the desired result. "
        }
    ]
}