{
    "id": "SOLR-7671",
    "title": "Dataimport not working",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2",
        "status": "Resolved",
        "resolution": "Incomplete",
        "priority": "Major"
    },
    "description": "When upgrading from Solr 5.1 to 5.2 I noticed right away when selecting any core that the Dataimport link no longer works. I did a few tests and even created a new core in a blacnk copy of 5.2 and got the same results.\n\nWhen I verify the logging I found the following \"ERROR null ShowFileRequestHandler Can not find: admin-extra.html [C:\\Smart-Service\\solr-5.2.0\\server\\solr\\test\\conf\\admin-extra.html]\"",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-06-12T18:13:25+0000",
            "author": "Erick Erickson",
            "content": "Please raise issues like this on the user's list first, and if a code problem is indicated then raise a JIRA. The error you're seeing about admin-extra.html is almost certainly irrelevant, that's been a long-standing red herring.\n\nYou haven't indicated how this is failing. When you post to the user's list, please include details of what exactly is happening. This might be useful to review: http://wiki.apache.org/solr/UsingMailingLists\n\nNote that a couple of issues have been fixed in Solr 5.2.1, but without a description of the problem you're encountering it's impossible to say whether they pertain. ",
            "id": "comment-14583818"
        },
        {
            "date": "2015-06-12T18:23:14+0000",
            "author": "Shawn Heisey",
            "content": "This is most likely the admin UI issue in SOLR-7588.\n\nThe actual dataimport handler works fine, it's the UI that doesn't.\n\nThe \"admin-extra.html\" error message is a red herring.  It's a completely harmless event and has nothing at all to do with the dataimport problem.\n\nSolr 5.2.1 fixes the problem.  We expect the release to be finalized tomorrow afternoon (in US timezones).  If all goes well with that, it should be available to everyone a few days after that. ",
            "id": "comment-14583837"
        }
    ]
}