{
    "id": "SOLR-4884",
    "title": "do confluence import of solr ref guide",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Process for importing Solr Ref Guide export from LucidWorks into cwiki.apache.org, based on the \"Adding a project Space\" instructions from INFRA...\n\nAll steps to be taken by Hoss, who is already a member of the confluence-admin group in CWIKI...\n\n\n\tDownload the ref guide 4.3 zip provided by Cassandra as an attachment in parent issue SOLR-4618 to my local computer\n\tuse the \"Remove Space\" operation on the existing SOLR space to remove it...\n\t\n\t\thttps://cwiki.apache.org/confluence/spaces/editspace.action?key=SOLR\n\t\tthe space is currently empty except for some stub content\n\t\n\t\n\tUse the \"Upload a zipped backup to Confluence\" form on the Confluence Backup admin page to upload & import that ZIP file into CWIKI\n\t\n\t\thttps://cwiki.apache.org/confluence/admin/backup.action\n\t\n\t\n\tBrowse the newly created (dynamic) SOLR wiki space to sanity check that the import seemed to have worked properly and the newly re-created SOLR space looks correct\n\tUpdate the Space permisions: https://cwiki.apache.org/confluence/spaces/spacepermissions.action?key=SOLR\n\t\n\t\tgrant total access to solr-admins and confluence-administrators (group)\n\t\tgrant access to everything except \"mail removal\" and \"space admin\" to solr-committers (group)\n\t\tgrant view & export access to confluence-users (group)\n\t\tgrant view access to autoexport (user)\n\t\tgrant view & export to anonymous (anon)\n\t\tRemove any individual rights granted to my account by Confluence when the Space was created.\n\t\tremove any other access that might have survived the import\n\t\n\t\n\tGoto Plugins, and Autoexport the initial site.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13673613",
            "date": "2013-06-03T21:34:27+0000",
            "content": "Updated steps based on new attachment provided in parent issue.  Cassandra Targett can you review and let me know if this looks correct to your knowledge? "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13674353",
            "date": "2013-06-04T13:05:25+0000",
            "content": "That looks right and matches the checklist I use for LucidWorks docs.\n\nWhen checking the content, I think there are going to be pages that use plugins not in use in CWIKI that will cause errors on pages. I mentioned these in my initial comment to SOLR-4618 (item 5):\n\nhttps://issues.apache.org/jira/browse/SOLR-4618?focusedCommentId=13607963&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13607963\n\nSince you have the rights to import the space, you also have the rights to add plugins. Or, I can remove references to them from the export I made and resubmit it. The really big one is the Navigation Plugin, which I used to add Next-Previous-Up page links at the bottom of nearly every page, it's also the easiest to remove if necessary. That plugin, however, is the most difficult to find and install - for some reason it's not in Atlassian's plugin marketplace, but I can upload the .jar for you if you want or point you to where I got it.\n\nI'll be interested to see how all the page formatting survives through autoexport - particularly the page with all the language tokenizers/filters.\n\nIf you don't like the stylesheet (assuming it survives the import; I can't remember if it does or not), it can be easily removed/modified from Space Admin -> Stylesheet. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13674520",
            "date": "2013-06-04T16:03:45+0000",
            "content": "When checking the content, I think there are going to be pages that use plugins not in use in CWIKI that will cause errors on pages. \n\n... right, my plan was as you suggested there: import and review and fix what breaks. \n\nThe key thing in my mind is that even besides those specific issues, even if we have those plugins installed – they may not play nice with the autoexport.  We just have to review+fix+iterate.\n\nSince you have the rights to import the space, you also have the rights to add plugins.\n\nI'm going to avoid doing that w/o explicit sign off from infra on the individual plugins since it involves running arbitrary binary code downloaded from a third party on apache.org hardware and i don't wnat to me the guy who fucks that up and lets in the trojan.\n\nOr, I can remove references to them from the export I made and resubmit it.\n\nAh ... interesting, i hadn't considered that it might be easier to fix on the lucid side and then re-import.  I'll keep that in mind.\n\nIf you don't like the stylesheet...\n\ni'm not worried about the styling in confluence since it will have to be redone for the autoexport anyway and that's configured differently .. low priority. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13674528",
            "date": "2013-06-04T16:16:26+0000",
            "content": "opened INFRA-6342 request for review of import process before i proceed so i don't surprise anybody "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13692287",
            "date": "2013-06-24T19:28:03+0000",
            "content": "Gavin handled the import in INFRA-6342 during hte confluence upgrade over the weekend.\n\nI just cleaned up / configured all the space permissions except for autoexport since that is apparently no longer supported on cwiki.\n\nI also enabled the (confluence) commenting perms from registered confluence users, since that now seems to be a viable way to deal with page comments now (see SOLR-4889)\n "
        }
    ]
}