{
    "id": "SOLR-12889",
    "title": "Clean up CoreAdmin behavior and responses when acting on cores that failed to initialize",
    "details": {
        "type": "Bug",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Minor",
        "resolution": "Unresolved",
        "affect_versions": "7.5"
    },
    "description": "Solr isn't behaving quite correctly when performing CoreAdmin actions on cores that exist, but failed to initialize.\n\n\tRELOAD works. That was made possible by SOLR-10021.\n\tUNLOAD works, and can even delete directories if asked to.\n\tRENAME works, but Solr must be restarted for the admin UI to reflect the new name in the \"SolrCore Initialization Failures\" message.\n\tSWAP doesn't actually work, but returns a response that LOOKS like it worked.\n\n\n\nI didn't try the other actions, because it doesn't really make any sense to allow those on a core that failed.\n\nWhat I see as things that need to be checked or implemented when acting on failed cores:\n\n\tSWAP\n\t\n\t\tFail fast.\n\t\tOR make it work properly. If we choose this, adjust the core name in the initFailures part of the STATUS response.\n\t\n\t\n\tRENAME\n\t\n\t\tFail fast.\n\t\tOR make it work properly. If we choose this, adjust the core name in the initFailures part of the STATUS response.\n\t\n\t\n\tUNLOAD\n\t\n\t\tThis looks like it behaves correctly.  Tried it with deleteInstanceDir=true and it did wipe out the whole core.\n\t\n\t\n\tOther actions not already mentioned\n\t\n\t\tFail fast\n\t\n\t\n\n\n\nSomething else to consider:  Get rid of the initFailures part of the STATUS response.  List all cores, even those that failed.  Include a boolean item in the response to indicate whether initialization succeeded, and only list some of the full information for a failed core.  This would make implementing SOLR-12863 easier.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16658014",
            "content": "The last part of the proposal, removing initFailures and just including failed cores in the regular core list, probably needs to be a master-only change.  An alternate idea for that: implement a LIST action that does what was proposed, and leave STATUS as it is. ",
            "author": "Shawn Heisey",
            "date": "2018-10-20T22:30:36+0000"
        },
        {
            "id": "comment-16658017",
            "content": "I'm really liking the idea of adding a LIST action.  That would allow us to have the same commit for all branches.  Optionally, we could deprecate STATUS and remove it in the next major version, with LIST as the replacement. ",
            "author": "Shawn Heisey",
            "date": "2018-10-20T22:35:22+0000"
        }
    ]
}