{
    "id": "SOLR-3848",
    "title": "dataimporthandler-extras depends on Tika but doesn't have it in it's ivy deps",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Noticed this while dealing with SOLR-3759...\n\n\n\tsolr/contrib/dataimporthandler-extras contains MailEntityProcessor and TikaEntityProcessor\n\tboth of these classes have acompile & runtime dependency on org.apache.tika.*\n\tsolr/contrib/dataimporthandler-extras/ivy.xml does not mention any external dependencies\n\tsolr/contrib/dataimporthandler-extras/build.xml has a \"resolve-extraction-libs\" to force solr/contrib/extraction to fetch it's deps so that dataimporthandler-extras can use them directly\n\tsolrconfig.xml files in example-DIH point to the contrib/extraction/lib/ dir to get the Tika dependencies for demo purposes\n\n\n\nI believe this is all intentional so that we don't have two copies of all the tika jars floating around, particularly in the binary releases, but even though i'm one of the people who was involved in setting things up this way in dataimporthandler-extras/build.xml, it still confused/surprised me...\n\nhttps://svn.apache.org/viewvc?view=revision&revision=1307563\nhttps://svn.apache.org/viewvc?view=revision&revision=1309503\n\nI think at a minimum, we should probably add some comments to dataimporthandler-extras/ivy.xml about this kludge, and probably call it out more in the various example-DIH/*/solrconfig.xml files as well.  That said: If anyone feels strongly that we should \"fix\" this so that dataimporthandler-extras/ivy.xml explicitly fetches the tika deps - please speak up.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13457258",
            "date": "2012-09-17T19:47:12+0000",
            "content": "I've commited hte comments i had in mind...\n\nCommitted revision 1386790.\nCommitted revision 1386792. -4x\n\nBut i'm leaving this issue open...\n\nOn IRC rmuir suggested that the \"correct\" fix for this would be to use the ivy 'conf' option with filename patterns so that the dataimporthandler-extras/build.xml wouldn't need any special logic, and the dataimporthandler-extras/ivy.xml could rever directly to the files in ../extraction/lib.  So, if i understand correctly, dataimporthandler-extras's ivy.xml would actually have the explicit list of jars that it wanted to fetch, and \"ant resolve\" would fetch those jars w/o caring if contrib/extraction built, but those jars would be fetched directly into extraction/lib.\n\nleaving this issue open for further discussion/considering about this idea. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13457261",
            "date": "2012-09-17T19:51:14+0000",
            "content": "yeah that fix might be more technically correct, but could also be more confusing. we would have to see what it looks like.\n\nMaybe better to just have a build.xml thats confusing than a build.xml AND ivy.xml thats confusing. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610817",
            "date": "2013-03-22T16:37:31+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1386792\n\nSOLR-3848: comments explaining workarround (merge r1386790) "
        }
    ]
}