{
    "id": "SOLR-10676",
    "title": "Optimize the reindexing of sunspot solr",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "clients - ruby - flare"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "5.0",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "We are using solr 5.0. <luceneMatchVersion>5.0.0</luceneMatchVersion>\nWe have more than 5 million products. It is taking around 3.30 hours to reindex all the products.\n\nFor optimizing the reindexing speed, we have used the following configurations\n\n<indexConfig>\n    <ramBufferSizeMB>960</ramBufferSizeMB>\n    <mergePolicyFactory>100</mergePolicyFactory>\n    <mergeScheduler class=\"org.apache.lucene.index.ConcurrentMergeScheduler\"/>+\n </indexConfig>\n\n<autoCommit> \n       <maxTime>${solr.autoCommit.maxTime:15000}</maxTime> \n       <openSearcher>false</openSearcher> \n     </autoCommit>\n<autoSoftCommit> \n       <maxTime>${solr.autoSoftCommit.maxTime:-1}</maxTime> \n     </autoSoftCommit>\n\nWe are indexing with the following option \n{ :batch_commit => false,:batch_size=>20000 }\n\nWe have set autocommit false in our model. So whenever a new record is inserted it is not automatically added to the solr index. But when a record is updated we manually call the Sunspot.index! method for that particular product data. Everyday we are inserting around .2 millions of records. We have target of 50 million products. \n\nIs there any way, that we can add to index only the new records or updated records?\n\nCan we increase the indexing speed by changing any of the current configurations?\n\nIf we add new products to the solr through ruby code by using loop, it fails miserably as it takes too much time.\n\nPlease help to find the best way to improve the indexing speed of solr.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-12T11:53:48+0000",
            "content": "Please ask your questions to the Sunspot community. This JIRA is a bug tracker for bugs or new features in the core Solr product.\n\nIf you still need to ask a solr-core related question, please post that to the solr-user@lucene.apache.org mailing list, and not to this bug tracker. See http://lucene.apache.org/solr/community.html#mailing-lists-irc\n\nPS: I would imagine that the Sunspot code could be optimized to not send documents one by one but in batches and perhaps avoid explicit commits etc??\n\nClosing this issue as invalid ",
            "author": "Jan Høydahl",
            "id": "comment-16008008"
        }
    ]
}