{
    "id": "SOLR-10285",
    "title": "Skip LEADER messages when there are leader only shards",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "7.1",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Implemented",
        "status": "Closed"
    },
    "description": "For shards which have 1 replica ( leader ) we know it doesn't need to recover from anyone. We should short-circuit the recovery process in this case. \n\nThe motivation for this being that we will generate less state events and be able to mark these replicas as active again without it needing to go into 'recovering' state. \n\nWe already short circuit when you set -Dsolrcloud.skip.autorecovery=true but that sys prop was meant for tests only. Extending this to make sure the code short-circuits when the core knows its the only replica in the shard is the motivation of the Jira.",
    "attachments": {
        "SOLR-10285.patch": "https://issues.apache.org/jira/secure/attachment/12867197/SOLR-10285.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-08T05:53:07+0000",
            "content": "Joshua Humphries did you have a patch for this?  or did we only discuss it? ",
            "author": "Scott Blum",
            "id": "comment-16000303"
        },
        {
            "date": "2017-05-08T15:56:31+0000",
            "content": "Scott Blum, I'm afraid I don't have a patch. I do have a branch where I made a lot of progress, but I did not finish getting unit tests to pass. The patch for SOLR-10277 ended up being sufficient for our restart-time objectives at the time, so I put it on the back-burner. This change would certainly reduce the restart time further, quite considerably, in fact, for deployments with a large number of shards that do not have multiple replicas. I'll dust it off today and try to assess remaining work to get it merge-worthy. ",
            "author": "Joshua Humphries",
            "id": "comment-16000967"
        },
        {
            "date": "2017-05-08T17:31:33+0000",
            "content": "Joshua:\n\n\"Yonik's law of patches\" reads \"A half-baked patch with no documentation, no tests and no backwards compatibility is better than no patch at all.\". \n\nPlease feel free to attach a patch even if it's not complete (even if it doesn't even compile!), with appropriate disclaimers. Even if someone picks up this JIRA and decides to use another approach they'll be able to benefit from what they see of your work.\n\nIt also is good if you mention that you won't be working on it, that way people won't wait if they want to pick it up.\n\nBest,\nErick ",
            "author": "Erick Erickson",
            "id": "comment-16001160"
        },
        {
            "date": "2017-05-09T22:04:21+0000",
            "content": "> \"Yonik's law of patches\" reads \"A half-baked patch with no documentation, no tests and no backwards compatibility is better than no patch at all.\".\n\nErick,\nIn that spirit, I managed to dig up this small patch. But full warning: it is not tested and has a couple of TODOs that are likely critical to actually address.\n\nI had kicked off a run of the existing test suite to see what this broke, but I no longer have the results of that run. I had not yet started to write new tests.\n\nAlso, the patch was created from a fork of 5.5.3. Hopefully it will apply cleanly for you. ",
            "author": "Joshua Humphries",
            "id": "comment-16003642"
        },
        {
            "date": "2017-10-02T02:37:36+0000",
            "content": "Hi Joshua Humphries, your patch looks good to me. About your TODO notes, I did some search and found that\n\n\tElectionContext is the only place use OverseerAction.Leader ( one for unset leader and one for set leader ).\n\tSTATE_PROP used in the second case is replica's state, which even not used in SliceMutator.setShardLeader\n\n\n\nSo your concern about \"mark the shard as inactive\" is not correct, right?\n\nThe only problem that can occur between upgrade is \n1. A replica ( repA ) is currently leader\n2. The overseer is very busy\n3. repA does unset leader operation ( which is delayed because overseer is very busy )\n4. repA get stopped in middle of the election process ( so set leader operation never get executed )\n5. repA start with the new code, then it saw it is the leader ( the unset operation in step 2 had not been executed ) so it skipped set leader operation.\n\nI think that above case is very very very rare and even it happens ( it can be fixed with FORCE_LEADER API ), Sysadmins must handle overwhelming in the number of operations in Overseer first. \n ",
            "author": "Cao Manh Dat",
            "id": "comment-16187638"
        },
        {
            "date": "2017-10-02T03:33:42+0000",
            "content": "Patch for this ticket including test. ",
            "author": "Cao Manh Dat",
            "id": "comment-16187648"
        },
        {
            "date": "2017-10-02T08:08:55+0000",
            "content": "Cleanup, will commit soon. ",
            "author": "Cao Manh Dat",
            "id": "comment-16187744"
        },
        {
            "date": "2017-10-02T17:26:25+0000",
            "content": "Hi Dat,\n\nDo you think it will be a good idea to wait for the leader message to be processed before we return?  ",
            "author": "Varun Thacker",
            "id": "comment-16188454"
        },
        {
            "date": "2017-10-03T01:35:19+0000",
            "content": "Hi Varun Thacker, I don't know why we have to wait for the leader message to be processed ( because this ticket skipped leader message )? Even if we send leader message and wait for it to be processed, we can easily get false positive, when the replica is already a leader and the unset leader message is in the queue.  ",
            "author": "Cao Manh Dat",
            "id": "comment-16189159"
        },
        {
            "date": "2017-10-03T02:00:17+0000",
            "content": "Commit fd2b4f3f868276a3b3e3b0b6845d1a7309c9cad0 in lucene-solr's branch refs/heads/master from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=fd2b4f3 ]\n\nSOLR-10285: Skip LEADER messages when there are leader only shards ",
            "author": "ASF subversion and git services",
            "id": "comment-16189175"
        },
        {
            "date": "2017-10-03T02:43:45+0000",
            "content": "Sounds good! ",
            "author": "Varun Thacker",
            "id": "comment-16189193"
        },
        {
            "date": "2017-10-04T02:00:40+0000",
            "content": "Commit 4f1513f3831640195d1bdbe6cd81d13f228233af in lucene-solr's branch refs/heads/branch_7x from Cao Manh Dat\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4f1513f ]\n\nSOLR-10285: Skip LEADER messages when there are leader only shards ",
            "author": "ASF subversion and git services",
            "id": "comment-16190682"
        }
    ]
}