{
    "id": "SOLR-8",
    "title": "need a way for tests to specify arbitrary solrconfig.xml files",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Sub-task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "currently, there is no mechanism to use more then one solrconfig.xml in a JVM.  this makes writing tests of incompatible config options impossible, so we should make whatever changes are neccessary so that TestHarness can be given a config file name inthe same way it takes a schema file name.",
    "attachments": {
        "SOLR-8.patch": "https://issues.apache.org/jira/secure/attachment/12325388/SOLR-8.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12374675",
            "date": "2006-04-16T14:40:50+0000",
            "content": "patch includes a static initConfig method in SolrConfig so that tests can re-init the config using whatever fiel they want.\n\n(I don't consider this a perfect solution, but it's the simplest one given that SolrConfig is a singleton – trying to change that would be scary)\n\npatch also includes:\n\n\tchanges to TestHarness, AbstractSolrTestCase, and all of the existing test class to utilize this\n\tnew copies of the configs previously used from the apps/SolrTest directory\n\tbuild.xml change so the CWD for the junit tests is a new test-files directory\n\n\n\nwith this patch, all conections between the junit tests and the legacy SolrTest code/directory are severed.\n\n\nif no one objects, i'll commit this in a day or two. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12374969",
            "date": "2006-04-19T00:20:26+0000",
            "content": "+1\n\nIt should only be used for testing though... (it's not thread-safe, among other issues having to do with how it's used...) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12374973",
            "date": "2006-04-19T00:44:15+0000",
            "content": "> It should only be used for testing though\n\nagreed, I was going to add a big fat warning about that, but I figured it would be obvious since the Config object is a singleton ... but i'll add it anyway. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12375046",
            "date": "2006-04-19T13:01:27+0000",
            "content": "patch commited with added warning about initConfig "
        }
    ]
}