{
    "id": "SOLR-4429",
    "title": "Adding new Packt Solr book \"Apache Solr 4 Cookbook\" to official Solr website book section and news",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Rafał Kuć and Packt Publishing are proud to announce the second edition of Apache Solr 4 Cookbook. The Cookbook is newly updated and improved with new chapters on SolrCloud and every chapter updated to Solr 4.\n\n\"Apache Solr 4 Cookbook\" features over 100 recipes to make Apache Solr faster, more reliable, and return better results. It will show you how to get the most out of your search engine. Full of practical recipes and examples, this book will show you how to set up Apache Solr, tune and benchmark performance as well as index and analyze your data to provide better, more precise, and useful search data.\n\nThe book will make your search better, more accurate and faster with practical recipes on essential topics such as SolrCloud, querying data, search faceting, text and data analysis, and cache configuration.\n\nWith numerous practical chapters centered on important Solr techniques and methods, Apache Solr 4 Cookbook is an essential resource for developers who wish to take their knowledge and skills further. Thoroughly updated and improved, this Cookbook also covers the changes in Apache Solr 4 including the awesome capabilities of SolrCloud.",
    "attachments": {
        "SOLR-4429.patch": "https://issues.apache.org/jira/secure/attachment/12568838/SOLR-4429.patch",
        "book_s3c.png": "https://issues.apache.org/jira/secure/attachment/12568837/book_s3c.png",
        "Cover image_Apache Solr 4 Cookbook.png": "https://issues.apache.org/jira/secure/attachment/12568802/Cover%20image_Apache%20Solr%204%20Cookbook.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Rafał Kuć",
            "id": "comment-13575686",
            "date": "2013-02-11T09:06:51+0000",
            "content": "Jitesh if you look at https://lucene.apache.org/solr/ Solr 4.0 Cookbook was already added in SOLR-4369 (the issue was resolved on 29th of January). "
        },
        {
            "author": "Jitesh Gawali",
            "id": "comment-13575693",
            "date": "2013-02-11T09:20:45+0000",
            "content": "Thanks Rafał, I missed checking the book feature on the website. However, I couldn't see the book listed in the book section. I was in touch with Bill Au regarding this, and he asked me to open a JIRA ticket like Julian had done for the previous book.\n\nSo I wanted to ask, will this ticket be useful in getting the book information uploaded to the book section: http://lucene.apache.org/solr/books.html? "
        },
        {
            "author": "Rafał Kuć",
            "id": "comment-13575696",
            "date": "2013-02-11T09:23:30+0000",
            "content": "Ahhh right, I didn't create the patch to add the book to books section. I'll provide a patch later today than   "
        },
        {
            "author": "Jitesh Gawali",
            "id": "comment-13575698",
            "date": "2013-02-11T09:26:18+0000",
            "content": "Cool, thanks! "
        },
        {
            "author": "Rafał Kuć",
            "id": "comment-13575862",
            "date": "2013-02-11T16:08:58+0000",
            "content": "I'm attaching the patch to add the \"Apache Solr 4 Cookbook\" information to books page. The cover picture for 4.0 cookbook is already in the images directory, so I'm omiting it. However, please add the book_s3c.png image back, because the previous cookbook is still in the books page. Thanks. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13575905",
            "date": "2013-02-11T17:12:37+0000",
            "content": "I committed the patch and the Solr 3 Cookbook image, and published the site.  I can see the changes on the book page now. "
        },
        {
            "author": "Rafał Kuć",
            "id": "comment-13575932",
            "date": "2013-02-11T17:50:11+0000",
            "content": "Thanks a lot Steve  "
        }
    ]
}