{
    "id": "SOLR-183",
    "title": "add getRequiredParameter() to SolrParams",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.2"
        ],
        "components": [],
        "type": "Wish",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I find myself including this with every patch, so i'll just separate it out.  This simply adds a utilty function to SolrParams that throws a 400 if the parameter is missing:\n\n/** returns the value of the param, or throws a 400 exception if missing */\n  public String getRequiredParameter(String param) throws SolrException {\n    String val = get(param);\n    if( val == null ) \n{\n      throw new SolrException( 400, \"Missing parameter: \"+param );\n    }\n    return val;\n  }",
    "attachments": {
        "RequiredSolrParams.java": "https://issues.apache.org/jira/secure/attachment/12352869/RequiredSolrParams.java",
        "SOLR-183-required-param.patch": "https://issues.apache.org/jira/secure/attachment/12352700/SOLR-183-required-param.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12478508",
            "date": "2007-03-06T18:37:01+0000",
            "content": "Ryan: this patch is nice and simple ... but it has me wondering if it might be more generally usefull to have this in a SolrParams decorator that applied it at the outermost level to all of the methods which don't take in a default? ...\n\n  SolrParams myParams = ...  \n  myParams = new RequiredSolrParams(myParams, \"sort\", \"q\", \"qf\", \"f.foo.facet.limit\");\n\n...\n\n  public class RequiredSolrParams extends SolrParams {\n    ...\n    SolrParams nested;\n    Set<String> required;\n    ...\n    public String get(String param) \n{\n      String val = nester.get(param);\n      if (null == val) throw new SolrException( 400, \"Missing parameter: \"+param );\n      return val; \n    }\n    ...\n    public String get(String param, String def) \n{\n       return nested.get(param, def); // bypass exception throwing when default\n    }\n    ...\n  }\n\n\n? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12478517",
            "date": "2007-03-06T18:53:08+0000",
            "content": "I've been using it as a check just before you use the variable:\n\nString key = params.getRequiredParam( 'key' );\n\nThis is nice and simple, the advantage to your suggestion is that you could use it to check non-string values:\n\nSolrParams required = new RequiredSolrParams( params, \"size\", \"debug\" ); \nint size = required.getInt( \"size\" );\nboolean debug = required.getBool( \"debug\" );\nString other = required.get( \"somethingelse\", \"defaultValue\" );\n\n\nI guess simple things might not be as simple as they seem! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12478523",
            "date": "2007-03-06T19:09:21+0000",
            "content": "yeha ... the one thing about an approach like this that i'm not sure how i feel about yet is that it pushes the list of things that should be required away from where they are actually used (at the moment of construction)\n\nanother approach that might cleaner would be to eliminate the explicit list of required fields, and say that if you use the decorator every param is required unless a default is specified, and then each time you ask for a param's value, you can use the orriginal params instance if it's not required, or the decorated params if it is...\n\n   SolrParams myParams = ...;\n   SolrParams required = new RequiredSolrParams(myParams);\n   ...\n   Integer foo = myParams.getInt(\"yak\"); ... not required, may be null\n   ...\n   Integer bar = required.getInt(\"yak\"); ... required in this use, exception if missing\n\n\n... "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12478525",
            "date": "2007-03-06T19:14:34+0000",
            "content": "yes, this is better.\n\nbut what should happen with \n Integer bar = required.getInt( \"yak\", 100 );\n\n\n\ttreat it as required.getInt() that will throw 400 if missing?\n\tequivolent to myParams.getInt( \"yak\", 100 );?\n\tunsuported operation? no.\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12478548",
            "date": "2007-03-06T20:00:46+0000",
            "content": "i see no reason why it shouldn't be \"equivolent to myParams.getInt( \"yak\", 100 );\" ... here's the interesting case...\n\n  Integer bar = required.getInt( \"yak\", null ); \n\n...in that case, i think there should be an exception unless \"yak\" exists.\n\nthe contract would be sumarized as \"no method will ever return null, under any circumstances\" "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12478552",
            "date": "2007-03-06T20:07:19+0000",
            "content": "I'm getting into it now...  the easiest is to throw a 400 exception for everyting.  the SolrParams abstract class calls get( '' ) for each of the getX( name, devault ) - so, we would have to overwrite all the getX functions rather then just the one.  If we do that, we may as well catch the 'parse exception' from Integer.parseInt() and send a 400 rather then a 500 w/ stack trace.  \n\nThat is cleaner from user standpoint, so it must be the better option.\n\n\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12478556",
            "date": "2007-03-06T20:13:34+0000",
            "content": "I like anything that can avoid yet another hash lookup in the common cases.\nI think either the original getRequired() or the separate  \"SolrParams required\" could fit the bill.\n\nThe latter is more powerful since it applies to all get methods, but it's also more awkward as you need to construct it wherever you need to get a required param. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12478600",
            "date": "2007-03-06T21:59:40+0000",
            "content": "This adds a RequiredSolrParams class that wraps most of the getXXX() functions and makes sure the value exists and is valid.\n\nthe case Hoss mentioned:\n Integer bar = required.getInt( \"yak\", null ); \n\nisn't possible since getInt() takes an 'int' not an Integer as the default\n\nI put the class in \"org.apache.solr.util\" rather then \"org.apache.solr.request\" - I'm really hoping with SOLR-135 most of the general non-lucene based helper classes can be in \"util\"\n\nYou'll notice some of the code style is a little non-standard - that helps my dyslexic head keep stuff straight (at least sometimes).\n\nYonik - there are no extra hash lookups with this.\n "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12478895",
            "date": "2007-03-07T21:08:03+0000",
            "content": "Er, sorry to be contrary, but to me it seems a bit excessive to go through so many hoops to support  the getXXX(param, default) methods, which contradicts the very nature of the class, which is to require parameters.\n\nIf one wanted to stick with Hoss' preference for a decorator, and kept the getXXX(param, default) method signatures defined in SolrParams, one could argue that it would make sense to make those methods simply return SolrExceptions, on the assumption that requires.getInt(param, 0) must be a programmer error.  That is of course automatically achieved if only get and getParams are overridden, as was proposed earlier.  It's not so terrible to maintain parallel params and requires references to the same underlying param list.\n\nBut if one is going to bother adding real implementations for every method signature in SolrParams, then why not simply dispense with the decorator and add getRequiredXXX(param) methods with default implementations directly to SolrParams, e.g.\n    getRequiredParam(String param)\n    getRequiredParams(String param)\n    getRequiredBool(String param)\n    getRequiredFieldBool(String field, String param)\n    ... etc.\n\nThat seems simpler, straightforward, and unambiguous. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12478905",
            "date": "2007-03-07T21:27:03+0000",
            "content": "I agree it is a bit excessive...  the thing that convinced me the hoops are ok is getting a 400 exception rather then a 500 exception for:\n\n int val = required.getInt( \"hello\" );\n\nThe hoops are ugly, but the result is that anything from the RequiredParams will be valid - and throw a 400 exception if not.  In my view, that is a different enough \"contract\" to warrant a special class rather then adding more functions to SolrParams.\n\nAll that said, simply adding getRequiredParam() to SolrParams is simple, clean and solves most cases I'm worried about. "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12478930",
            "date": "2007-03-07T22:20:27+0000",
            "content": "Modest proposal: If one is going to come up with a programmer-facing mechanism for required parameters (using any of the abovementioned schemes), why not also make it configuration-facing as well.  That is, in solrparams.xml:\n\n  <requestHandler name=\"blah\" class=\"solr.DisMaxRequestHandler\">\n     <lst name=\"defaults\">\n       <str name=\"version\">2.1</str>\n       <int name=\"rows\">0</int>\n       ...\n    </lst>\n    <lst name=\"requires\">\n      <str name=\"q\">A query must be specified using the q parameter</str>\n      <str name=\"version\">This handler depends on version being explicitly set</str>\n    </lst>\n    ...\n  </requestHandler> \n\nRequestHandlerBase would add to the definition and initialization of defaults, extends, and invariants, a fourth SolrParams called requires.  Then when the init is building the (invariants --> ((request --> defaults) + appends))) chain with DefaultSolrParams and AppendedSolrParams (delegated to method SolrPluginUtils.setDefaults), it could interpose a new class RequiredSolrParams which acts like DefaultSolrParams except it accepts the 'requires' SolrParams defined in the handler config, which in my proposal defines a param name/message pair.  If a param not found in the target SolrParams is defined in  'requires', the exception is thrown.  Otherwise the RequiredSolrParams behaves similarly to DefaultSolrParams (which it extends) by delegating the request up the chain, or if no chain is defined returning null.\n\nDepending on what the programmer wants, the RequiredSolrParams could be chained with just the request params:\n    (invariants -> ((requires -> request) -> defaults) + appends)\nor could be chained with the entire chain as it exists:\n    requires --> (invariants --> ((request --> defaults) + appends)))\n\nI've attached an illustrative implementation.  I must apologize, while it compiles I have not yet tested it, I am under deadline and have spent too much time on this today already; I'll try to do so over the weekend, along with the RequestHandlerBase/SolrPluginUtils implementation.  It accepts a requires SolrParams as described above, with the values interpreted as a Formatter string.  It also has an \"always required\" mode with a method signature which accepts a fixed message format string.  It also has a convenience method (temporarily commented out because of method signature clash) which shows how you can provide custom messages for some parameters but have a stock default message for others.\n\nI believe this object should be compatible with what Ryan posted, e.g. you could add implementations for getXXX(param, default) which override the \"throw the exception\" behavior it now has.\n\nAnyway, I am open to feedback.  Useful? Excessive? Broken? Stupid? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12478934",
            "date": "2007-03-07T22:36:32+0000",
            "content": "It seems bad to have the requited params be user configurable.  The real use case is that the RequestHandler developer wants to ask for a parameter and know that the error checking is taken care of.  \n\nIf the required params are configured externally, you run the risk of them getting out of sync with the handler code - not to mention that it really isn't something that should be configured.  If misconfigured you get a null pointer exception rather then 400...  defeating the purpose altogether. "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12478980",
            "date": "2007-03-08T00:02:30+0000",
            "content": "By the way, I think your logic to catch type conversion errors and return 400 with a specific error rather than let the request dispatcher return a generic 500, is very useful, but should be implemented directly in SolrParams and then get inherited by RequiredSolrParams, ServletSolrParams, etc. \n\nThe concern of \"supplied or not\" is different from the concern of \"well-formed or not\", and params.getInt( param-returning-\"notint\" ) is an error, and should ALWAYS return a specific and informative exception (code and message) as you have done, regardless of the underlying SolrParams implementation.  Ditto for params.getInt( param-returning-\"notint\", 999 ). "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12479175",
            "date": "2007-03-08T00:38:26+0000",
            "content": "I was unfortunately not very clear, and confounded 2 things, an enhanced programmer-facing API, based on yours, for request-handler developers, and secondly an API supported by RequestHandlerBase for request handler configurators. \n\nFrom the programmer perspective, my contribution is simply to allow specification of either a global error format, and/or a parameter-specific definition of which parameters are required and how missing required parameters should be reported.  It has no negative impact on the use case you desire, and the modified code should pass all the exists/doesn't exist tests in your RequiredSolrParamTest.java; if you slapped in your method signatures that return 400 SolrExceptions on bad type conversion, either into my RequiredSolrParams or SolrParams as I suggested above, it should pass all the tests, and if not, I will make it so.\n\nFor example,\n    Map<String,String> rmap = new HashMap<String, String>();\n    rmap.put( \"q\" , \"A query must be specified using the q parameter\"   );\n    rmap.put( \"version\"     , \"This handler depends on version being explicitly set\" );\n    SolrParams required = new RequiredSolrParams( params, new MapSolrParams( rmap ) );\n\nThis is similar to the suggestion in Hoss' first comment on this issue.\n\nThe other use-case is for the RequestHandler configurator.  There are a lot more of those than RequestHandler programmers.  My model is that they are defining request handling service APIs by defining <requestHandler>s in solrconfig.  Those APIs can be used by other web programmers in the organization, who will make mistakes in calling the API, as we all do.  RequestHandlerBase gives RequestHandler configurators three options for controlling the API, the invariants defaults and appends.  I am simply proposing a 4th option to define which parameters are required, and the error message that should be returned in the case it is missing.  It's not a comprehensive parameter validation mechanism, but such would be beyond the scope of SOLR.  However as someone who is actively creating RequestHandler APIs for other programmers in my organization, using custom code when necessary but avoiding it whenever possible, I think it might be useful.\n\nAnd in no way does this second use-case by itself allow RH configurators to override the first use-case requirements set up by RH programmers, unless the RH programmers make explicit provision to do so.  For example, by chaining a DefaultSolrParams with params derived from a <requestHandler> requires list in front of a default MapSolrParams like the above, the RH programmer allows the RH configurator to add new requirements, and externally change the error strings for programmer-supplied requirements, but not to remove programmer-supplied requirements.\n\nAnyway, hopefully I've better communicated the idea this time. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12482215",
            "date": "2007-03-19T20:53:23+0000",
            "content": "This update changes some things in response to JJ's comments.\n\nI agree the \"well-formed or not\" check should be directly in SolrParams - there is no reason to throw a 500 exception for rather then a 400 for bad input.\n\nThat leaves the one open question:\nShould getRequiredXXX() go directly in SolrParams or be implemented as a decorator?\n\nThis patch puts it directly in SolrParams (I don't care either way, I just want something so that I don't rewrite it for every custom handler).  It also adds a test case for SolrParams.\n\n\nJJ, can we move the RequiredSolrParams.java to a different issue?  It seems like a reasonable proposal but it does help the reason i opened this issue: a standard/quick way for the RequestHandler author to make sure parameters are specified.  \n "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12482455",
            "date": "2007-03-20T17:30:13+0000",
            "content": "I totally agree with Ryan that the question I raised about the value of specifying required params in solrconfig.xml RH definitions should be separated from this simpler programmer-API case.  I will speak no more of that on SOLR-183.\n\nRyan, after looking at your patch #4 I've had a change of heart about the getRequiredXXX approach.  To do it properly would require reduplication of every method signature, e.g. getFieldInt() and so forth, and wouldn't make any use of the bottleneck imposed by get/getParams.  Hoss' decorator approach coupled with your improved error handling automagically makes everything work with a trivial subclass.\n\nThis time I implemented and tested everything (attachment #5).  RequiredSolrParams is kept as a freestanding class which can be externally instantiated, but is also returned by a SolrParams.required() convenience method so we could stash a reference if desired, e.g.\n    params.required().getInt(\"xxx\")\n    params.required().getBoolean(\"yyy\")\n(but the wasted cycles and amount of garbage created from allocating  a new one is pretty trivial, so perhaps it's best not to add a slot to SolrParams)\n\nIn the bottleneck approach the inline-default methods e.g. getBool(\"xxx\", true) will fail when called on requires - but I think that is not such a bad thing.  Could be fixed if so desired with a _get().\n\nOne open question is getFieldParam:  Should the semantics of required.getFieldParam(\"facet.limit\", \"abc\") be to fail if the parameter is not supplied for the field (e.g. f.abc.facet.limit), or not supplied for either the field or as a general default (e.g. facet.limit)?  In the former case we don't need to override getFieldParam.  I can't think of a reason that one would want to require explicit field values and disallow general values, but perhaps someone else could, and a 'field strictness\" flag should be supplied in the RequiredSolrParams constructor.  For the moment I made it non-strict, but put in a public value allowing that to be controlled.\n\nI changed the order of operations in SolrParamTest so it starts at the simplest cases (present and non-required and inline defaults), then malformed values, then required values. I added the fall-through case for getFieldXXX.  I also started some tests of  DefaultSolrParams, to be extended to to AppendedSolrParams (getParams needs testing as well). "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12482467",
            "date": "2007-03-20T18:34:08+0000",
            "content": "Looks good.  thanks.  I agree it is cleaner as a decorator.  As a decorator, I think getInt( 'xxx', defaultVal ) shoould work, not throw an exception.\n\nI don't follow the strict/not strict logic to getFieldParam...  If you don't want strict checking, use the normal SolrParams, if you do, use RequiredSolrParams\n\nThis update changes things so the basic contract with RequiredSolrParams is that you get back a valid non-null value (unless you pass it in as a default)\n\n\n\tfunctions with default values call the wrapped params directly\n\treplaced tabs with 2 spaces\n\tremoved the 'strict' field logic\n\n\n "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12482686",
            "date": "2007-03-21T09:06:52+0000",
            "content": "Thanks for clarifying the semantics and the implementation, Ryan.\n\nIt's fine by me to remove the \"strictField\" logic from getFieldParam; as I said, I wasn't sure there would be any cases where a developer considered defining a non-field-limited value (facet.limit) an insufficient means to fulfill definition of a field-specific value (f.xxx.facet.limit).  Should such a case ever arise, they could subclass RequiredSolrParams to override getFieldParam and accomplish that themself. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12483885",
            "date": "2007-03-24T21:12:33+0000",
            "content": "Thanks, I just committed this. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589313",
            "date": "2008-04-15T23:44:45+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.2\n\n\n\nThe Fix Version for all 39 issues found was set to 1.2, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman2 "
        }
    ]
}