{
    "id": "SOLR-5434",
    "title": "Create minimal solrcloud example directory",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.8"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The various \"intro to solr cloud\" pages (for example https://cwiki.apache.org/confluence/display/solr/Getting+Started+with+SolrCloud) currently tell new users to use the example/ directory as a basis for setting up new cloud instances.  These directories contain, under the default solr/ solr home directory, a single core, defined to point to the collection1 collection.\n\nIt's not at all obvious that, to change the name of your collection, you have to go and edit the core.properties file underneath the solr/ directory.  A lot of users on the mailing list also seem to get confused by having to include bootstrap_confdir and numShards the first time they run solr, but not afterwards.  So here's a suggestion:\n\n\n\tHave a new solrcloud/ directory in the example webapp that just contains a solr.xml file\n\tChange the startup example code to just include -Dsolr.solr.home and -DzkRun\n\tTell the user to then run zkcli to bootstrap their configuration (solr startup and configuration loading are kept separate)\n\tTell the users to use the collections API to create a new collection, naming it however they want (confignames, collection names and core names are all kept separate)\n\n\n\nThis way, there's a lot less 'magic' and hidden defaults involved, and all the steps to get a cloud up and running (start processes, upload configuration, create collection) are made distinguishable.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Alan Woodward",
            "id": "comment-13819968",
            "date": "2013-11-12T09:51:57+0000",
            "content": "Thinking further, maybe an even nicer way to start things up would be to have a default new-style solr.xml that can be overridden by environment variables.  Then you just tell new users to start solr up with -DzkRun -Dsolr.solr.home=/path/to/where/I/want/data/stored, and it should Just Work.  No need to copy example directories anywhere. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13885299",
            "date": "2014-01-29T12:39:12+0000",
            "content": "I feel we have too many \"example\" directories already - and we don't manage to keep them up-to-date, other than the main collection1/conf one.\n\nHow about focusing towards making SolrCloud the default/preferred mode and defer to AdminGUI/ZkCLI to create collections. We should have examples but they should be minimal, with stripped-down solrconfig.xml. Some good ideas in SOLR-3619 too. "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13937350",
            "date": "2014-03-16T21:54:26+0000",
            "content": "I think I agree with Jan here.  An extra example dir is going to end up as just more noise. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13982616",
            "date": "2014-04-27T23:25:58+0000",
            "content": "Close issue after release of 4.8.0 "
        }
    ]
}