{
    "id": "SOLR-4207",
    "title": "Links to lucene in wiki are broken",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Since 4.0.0 has been released there are all links pointing to the lucene.apache.org domain are broken. Some examples:\n\nOn the SolrQuerySyntax page selecting a link to any function or to either DateField or DateMath will result in a 404.\n\nOn the SearchComponent page selecting any link to a specific component in the first list wil result in a 404.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13534190",
            "date": "2012-12-17T19:20:29+0000",
            "content": "Hi Aldo,\n\nThe wiki can be edited by anybody - when you see broken links like this, please go ahead and fix them yourself.\n\nUntil recently, the Solr API docs hosted on the website were not versioned - they were changed to reflect the latest release.  Now that they are versioned, links will need to be repaired to go to a specific version. \n\nFor example, the DateField link on the SolrQuerySyntax page is currently\n\n\nhttp://lucene.apache.org/solr/api/org/apache/solr/schema/DateField.html\n\n\n\nbut should be \n\n\nhttp://lucene.apache.org/solr/4_0_0/solr-core/org/apache/solr/schema/DateField.html\n\n\n\nJust replace api/ with 4_0_0/solr-core/.  See http://lucene.apache.org/solr/4_0_0/ for other modules' base URLs. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13534236",
            "date": "2012-12-17T19:55:03+0000",
            "content": "I brought this up a while back:\nhttp://lucene.472066.n3.nabble.com/links-to-javadoc-are-broken-td4020294.html\n\nThis isn't due to a lack of versioning (there's a redirect from api currently), but that the redirect no longer works because of a change of the structure of the javadocs (inserting a \"solr-core\" in the middle of the path).  That redirect needs to be fixed.  If I knew where it was, I'd do it.\n\nedit: I just found it (I hadn't realized it was under the cms).  I'll try a fix. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14076634",
            "date": "2014-07-28T19:16:02+0000",
            "content": "I think this has been fixed for a while. "
        }
    ]
}