{
    "id": "SOLR-5972",
    "title": "new statistics facet capabilities to StatsComponent facet - limit, sort and missing.",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I thought it would be very useful to enable limiting and sorting StatsComponent facet response.\nI chose to implement it in Stats Component rather than Analytics component because Analytics doesn't support distributed queries yet. \n\nThe default for limit is -1 - returns all facet values.\nThe default for sort is no sorting.\nThe default for missing is true.\nSo if you use stats component exactly as before, the response won't change as of nowadays.\nIf ask for sort or limit, missing facet value will be the last, as in regular facet.\nSort types supported: min, max, sum and countdistinct for stats fields, and count and index for facet fields (all sort types are lower cased).\nSort directions asc and desc are supported.\nSorting by multiple fields is supported.\n\nour example use case will be employees' monthly salaries:\n\nThe follwing query returns the 10 most \"expensive\" employees: \n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=salary sum desc&f.employee_name.stats.facet.limit=10\" \nThe follwing query returns the 10 least \"expensive\" employees:\n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=salary sum asc&f.employee_name.stats.facet.limit=10\" \nThe follwing query returns the employee that got the highest salary ever:\n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=salary max desc&f.employee_name.stats.facet.limit=1\" \nThe follwing query returns the employee that got the lowest salary ever:\n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=salary min asc&f.employee_name.stats.facet.limit=1\" \nThe follwing query returns the 10 first (lexicographically) employees:\n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=employee_name index asc&f.employee_name.stats.facet.limit=10\" \nThe follwing query returns the 10 employees that have worked for the longest period:\n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=employee_name count desc&f.employee_name.stats.facet.limit=10\" \nThe follwing query returns the 10 employee whose salaries vary the most:\n\"q=:&stats=true&stats.field=salary&stats.facet=employee_name&f.employee_name.stats.facet.sort=salary countdistinct desc&f.employee_name.stats.facet.limit=10\" \n\nAttached a patch implementing this in StatsComponent.",
    "attachments": {
        "SOLR-5972.patch": "https://issues.apache.org/jira/secure/attachment/12639171/SOLR-5972.patch",
        "SOLR-5972_multivalue_docvalue.patch": "https://issues.apache.org/jira/secure/attachment/12840394/SOLR-5972_multivalue_docvalue.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Elran Dvir",
            "id": "comment-14083916",
            "date": "2014-08-03T08:18:49+0000",
            "content": "I attached a newer patch with fix of calculation of existInDoc for multivalue fields "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14091573",
            "date": "2014-08-09T01:48:23+0000",
            "content": "Elran:\n\nI appreciate that you've put a lot of work into trying to improve the stats.facet feature of StatsComponent, but personally i don't think it's really wise for us to be pursuing multiple divergent sets of \"facet\" code in Solr.  The existing \"StatsComponent Faceting\" code has always felt like a kludge to me and has never worked as well or gotten as developer attention as the FacetComponent.\n\nI think in the long run, implementing things like SOLR-6351 to let people combine StatsComponent with FacetComponent, and deprecating stats.facet completely will make a lot more sense, and be a lot more powerful. "
        },
        {
            "author": "Elran Dvir",
            "id": "comment-14303217",
            "date": "2015-02-03T12:59:08+0000",
            "content": "Hi all,\n\nThis patch contains a new statistics result for a field - existInDoc. It returns the number of documents in which the field has a value (not missing).\nFor multivalue fields there is a calculation of existInDoc inside the class UnInvertedField.  \nSince Solr 4.10 there was a fix for a stats calculation of multi valued field which is doc valued. The class handling it is DocValuesStats.\nI want to support existInDoc calculation also for multi valued - doc valued field.\nHow Should I change DocValuesStats to support this?\n\nThanks.\n "
        },
        {
            "author": "Lyubov Romanchuk",
            "id": "comment-15692801",
            "date": "2016-11-24T09:44:49+0000",
            "content": "Hi all,\n\nAttached the patch for multi value docvalue fields. \n\nBest regards,\nLyuba "
        }
    ]
}