{
    "id": "SOLR-11361",
    "title": "After Restarting Solr 6.6.1 Seems to cause Error if Application is Reading/Writing?",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.6.1",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "I have just updated from Solr 6.2.1 to 6.6.1.  I put into place a fresh 6.6.1 and mounted our Core (umslogs).  This loaded perfectly fine on port 8181 and our application is able to write/read data.\n\nThe problem started when I restart Solr 6.6.1 and the below error appeared after Solr 6.6.1 came up accessible via the web page. \n\n*HttpSolrCall\nnull:org.apache.solr.core.SolrCoreInitializationException: SolrCore 'umslogs' is not available due to init failure: null *\n\nNext my testing lead me to start up Solr on port 8282 that no application is connecting/reading/writing to.  On this test umslogs core loads is perfectly fine after erroring above.\n\nNext my testing lead me to close our application that writes/reads to Solr 8181umslogs core and shutdown Solr 8282 umslogs core.  Then  I restarted  Solr back on Poret 8181 and the umslogs core loads properly and our application that that writes/reads to Solr 8181 is once again operational.\n\nOur application has used Solr 4.10.x, then Solr 6.2.x okay.  Then again I do not doubt that I might have done something wrong with the 6.6.1 upgrade that is causing the above behavior",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-17T15:36:30+0000",
            "content": "I just went and grabbed Solr 6.6.0 and unpacked it.  Then I copied my umslog core from 6.6.1 and ran the same tests.  The problem that I am seeing in v6.6.1 does not appear to happen in v6.6.0\n\nFor the record, I am running from Windows Command Line just using the -p 8181 or 8282 argument. \n\nIs this because of this error Lock held by this virtual machine:.  After a bit of time Solr 6.6.0 had the same error but the Core was still operational.  I stop 8181, move to port 8282 and there are no hard errors listed.  I move back to 8181 and the error is back.  Lastly I shut down Solr and just wait 30 minutes (perhaps more was not really counting) and 8181 comes up with no hard errors. ",
            "author": "Richard Rominger",
            "id": "comment-16169325"
        },
        {
            "date": "2017-09-17T21:16:55+0000",
            "content": "Closing as invalid.\n\nPlease, do not use JIRA for asking questions. This is most likely caused by something in your environment. Please head over to the solr-user mailing list to ask your question and you'll get help debugging your Windows system to see what may cause this lock behavior. ",
            "author": "Jan Høydahl",
            "id": "comment-16169421"
        },
        {
            "date": "2017-09-18T08:29:22+0000",
            "content": "Here are instructions for signing up to the mailing list: http://lucene.apache.org/solr/community.html#mailing-lists-irc\nThen later if it turns out to be a bug, we can create a new issue. ",
            "author": "Jan Høydahl",
            "id": "comment-16169739"
        },
        {
            "date": "2017-09-18T12:20:03+0000",
            "content": "I've done that after the fact but then found my issue was already reported and being looked into by Erick Erickson in SOLR-11297.  So I think there is more than a question but a issue going on here but regardless this SOLR-11361 at best a duplicate. ",
            "author": "Richard Rominger",
            "id": "comment-16169937"
        },
        {
            "date": "2017-09-18T17:05:23+0000",
            "content": "With 6.6.0, I see the problem in SOLR-11297.\n\nI was trying to track something down on the 6.6.0 install (/solr/admin/metrics not working), and came across an error about an index, but the error didn't mention the index directory.  Therefore I found the error logging in the source code, checked out the branch_6x code, modified the code to display what directory was having the issue, and built/installed version 6.6.2-SNAPSHOT.\n\nWith the upgrade, I began having problems where cores actually did not successfully load, which is a very different problem than SOLR-11297.  I saw the \"SolrCore 'xxxxxx' is not available due to init failure: null\" message in my logs just like this issue mentions, but could not find anything in the logs that actually indicated why the core failed to initialize. ",
            "author": "Shawn Heisey",
            "id": "comment-16170307"
        },
        {
            "date": "2017-11-04T18:26:08+0000",
            "content": "Best that I can tell, this is no longer happening with Solr 6.6.2 ",
            "author": "Richard Rominger",
            "id": "comment-16239148"
        }
    ]
}