{
    "id": "SOLR-10494",
    "title": "Switch Solr's Default Response Type from XML to JSON",
    "details": {
        "labels": "",
        "priority": "Blocker",
        "components": [
            "Response Writers"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.0",
            "7.1",
            "master (8.0)"
        ],
        "affect_versions": "7.0",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Solr's default response format is still XML, despite the fact that Solr has supported the JSON response format for over a decade, developer mindshare has clearly shifted toward JSON over the years, and most modern/competing systems also use JSON format now by default.\n\nIn fact, Solr's admin UI even explicitly adds wt=json to the request (by default in the UI) to override the default of wt=xml, so Solr's Admin UI effectively has a different default than the API.\n\nWe have now introduced things like the JSON faceting API, and the new more modern /V2 apis assume JSON for the areas of Solr they cover, so clearly we're moving in the direction of JSON anyway.\n\nI'd like propose that we switch the default response writer to JSON (wt=json) instead of XML for Solr 7.0, as this seems to me like the right direction and a good time to make this change with the next major version.\n\nBased upon feedback from the Lucene Dev's mailing list, we want to:\n1) Change the default response writer type to \"wt=json\" and also change to \"indent=on\" by default\n2) Make no changes on the update handler side; it already works as desired (it returns the response in the same content-type as the request unless the \"wt\" is passed in explicitly).\n3) Keep the /query request handler around since people have already used it for years to do JSON queries\n4) Add a commented-out \"wt=xml\" to the solrconfig.xml as a reminder for folks on how to change (back) the response format.\n\nThe default format change, plus the addition of \"indent=on\" are back compat changes, so we need to make sure we doc those clearly in the CHANGES.txt. There will also need to be significant adjustments to the Solr Ref Guide, Tutorial, etc.",
    "attachments": {
        "SOLR-10494.branch_7x.patch": "https://issues.apache.org/jira/secure/attachment/12878378/SOLR-10494.branch_7x.patch",
        "SOLR-10494.patch": "https://issues.apache.org/jira/secure/attachment/12874616/SOLR-10494.patch",
        "SOLR-10494": "https://issues.apache.org/jira/secure/attachment/12872487/SOLR-10494",
        "SOLR-10494-withdocs.patch": "https://issues.apache.org/jira/secure/attachment/12873730/SOLR-10494-withdocs.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-04-15T21:08:44+0000",
            "content": "+1 ",
            "author": "Jan Høydahl",
            "id": "comment-15970148"
        },
        {
            "date": "2017-05-07T18:55:09+0000",
            "content": "Solr 7 is just a month away, do you have time to work on this, Trey? ",
            "author": "Jan Høydahl",
            "id": "comment-15999997"
        },
        {
            "date": "2017-05-16T11:28:17+0000",
            "content": "Trey Grainger do you plan to put up a patch for this? Shouldn't bee a very big one.. ",
            "author": "Jan Høydahl",
            "id": "comment-16012188"
        },
        {
            "date": "2017-05-16T19:59:45+0000",
            "content": "Hi Jan Høydahl. Sorry - I missed you first message last week. Sure - I should be able to get a patch posted this weekend.\n\n-Trey ",
            "author": "Trey Grainger",
            "id": "comment-16013015"
        },
        {
            "date": "2017-05-17T02:17:17+0000",
            "content": "+1 for json as the default response format\n\nsome places in Solr use json as the default such as: config api, security api , streaming api, v2 API . These components have done explicit coding to make json the defualt. We need to remove those as a part of the cleanup ",
            "author": "Noble Paul",
            "id": "comment-16013410"
        },
        {
            "date": "2017-06-05T22:39:43+0000",
            "content": "One observation noted in SOLR-10812 was although the V2 APIs standardize JSOn it didn't have indent=on . I guess that's also part of the scope for this Jira?\n\nAlso should we mark this as a blocker for 7.0 to change it? ",
            "author": "Varun Thacker",
            "id": "comment-16037790"
        },
        {
            "date": "2017-06-06T00:05:07+0000",
            "content": "Yes, we should keep indent=on by default. There purpose of json output is to make the output more human readable ",
            "author": "Noble Paul",
            "id": "comment-16037877"
        },
        {
            "date": "2017-06-08T12:34:03+0000",
            "content": "Started working on this two weeks ago and then got busy. The actual changes were super quick, but after I made them it was taking over 2 hours to run the unit tests with lots of failures and several test suites timing out.\n\nJust got back to this today and have pretty much everything diagnosed and am working on fixes. In short, SolrTestCaseJ4 has XPath checking hard-coded in its design, so I need to now pass in wt=xml explicitly there, and there are a handful of test suites (i.e. replication/backup/restore and hdfs) that are explicitly checking XML strings and looping forever until they get those strings back (hence timing out).\n\nI'm making changes to explicitly request XML right now for those tests where they are expecting it and will get a patch posted hopefully today. ",
            "author": "Trey Grainger",
            "id": "comment-16042630"
        },
        {
            "date": "2017-06-08T13:36:27+0000",
            "content": "Question: I'm making indent=on the default. Any objections if I make indent=on the default for all TextResponseWriters, or do I need to limit the change to only the \"wt=json\" (now default writer) case.\n\nThe writers impacted from what I can tell are:\nGEOJSONWriter\nJSONWriter\nXMLWriter\nSchemaXMLWriter\nPHPWriter\nPythonWriter\nRubyWriter\n\nIt's a little complicated because most of these (geojson, php, python, ruby) actually inherit from the JSONWriter, so if I need to leave indent=off on those then I have to go in and set it explicitly on them since their base class will now have indent on by default.\n\nUnless anyone objects, I'm just going to set indent=on by default on all of these. Please let me know if anyone disagrees. ",
            "author": "Trey Grainger",
            "id": "comment-16042701"
        },
        {
            "date": "2017-06-11T14:56:00+0000",
            "content": "Initial patch, with all unit tests broken by the change now passing. Haven't changed to indent=on by default yet or removed setting of json explicitly in various places yet, though, as I've been trying to change one variable at a time to minimize complications.\n\nFor some reason, switching to json by default has caused ant precommit to complain about resource leak in about 60 places. I'm not sure what is causing these at the moment, but want to address that first before adding any additional changes to the patch. ",
            "author": "Trey Grainger",
            "id": "comment-16045999"
        },
        {
            "date": "2017-06-12T03:24:33+0000",
            "content": "New patch fixing a precommit error. Comment earlier about unclosed resources was apparently pre-existing (those are warnings and not errors) and I just noticed it because of an unrelated error, so going to ignore those. Working on indent=on by default for next patch. ",
            "author": "Trey Grainger",
            "id": "comment-16046188"
        },
        {
            "date": "2017-06-20T06:38:50+0000",
            "content": "We should also set json.nl=map as the default ",
            "author": "Noble Paul",
            "id": "comment-16055220"
        },
        {
            "date": "2017-06-20T08:10:57+0000",
            "content": "Some comments\n\n\tCould you add a .patch extension to the patch attachments for easier consumption? \n\tRemove superflous <str name=\"wt\">json</str> from various solrconfig.xml's (I counted 14 locations including ref-guide)\n\tRemove superflous wt=json from various places (There are hundreds, including Admin UI, READMEs etc)\n\tDocument the new default in ref-guide\n\tCHANGES entry\n\tChanges to Solr website, most importantly Quickstart Tutorial\n\n ",
            "author": "Jan Høydahl",
            "id": "comment-16055323"
        },
        {
            "date": "2017-06-20T17:28:41+0000",
            "content": "yes, I'll address all of the code/config changes above. I'll get the patch updated to include the indent=on change first (fixing unit tests now... were more that broke than I was expecting due to indention) and then do the cleanup of the configs, admin, readme's, as a follow on patch.\n\nOnce those are in, I can take a look at the ref-guide, website, and quickstart, though I'm afraid I may need some help pull all of those off in any reasonable timeframe for 7.0, as I'd expect there to be a lot of changes required there. ",
            "author": "Trey Grainger",
            "id": "comment-16056131"
        },
        {
            "date": "2017-06-20T19:00:08+0000",
            "content": "I'm happy to help with doc/website updates. Some of the ref guide references might be big and would delay this change significantly (IOW, may make it miss 7.0).\n\nRe: quickstart - I proposed in SOLR-10842 to move that to the Ref Guide, and I'm working up a patch (maybe this week? it's a huge reorg). I think we could let that go from this patch in deference to this other effort, again to not hold up what should be a pretty minor change.\n\nRemove superflous wt=json from various places (There are hundreds, including Admin UI, READMEs etc)\n\nI could not find 100s of references. Jan Høydahl, Can you give a list, or the grep/sed/whatever that you used to find those? ",
            "author": "Cassandra Targett",
            "id": "comment-16056285"
        },
        {
            "date": "2017-06-20T19:10:46+0000",
            "content": "That was just a IDEA search, see https://www.dropbox.com/s/4dan2pdt21d2t99/wt_json.png?dl=0\nCould be that all the uses in TestSolrConfigHandler.java are still necessary, or should that API also default to JSON response... ",
            "author": "Jan Høydahl",
            "id": "comment-16056294"
        },
        {
            "date": "2017-06-20T20:26:19+0000",
            "content": "Here's a patch with Trey Grainger's changes + ref guide changes. Nearly all of the changes needed were to simply remove &wt=json&indent=true from examples. Of course I found a couple unrelated glaring issues I couldn't let pass by, but I kept those to an extreme minimum. \n\nI reviewed all the places in the Ref Guide where wt is mentioned. Turns out we never actually said XML is the default...just said you had to use wt=json. I also updated the solrconfig.xml request handler defaults examples.\n\nOne thing I neglected to look for were places where an example request does not specify wt=xml but the example response is XML. I can do another pass for those at a later time - I would guess there aren't a lot of those. ",
            "author": "Cassandra Targett",
            "id": "comment-16056403"
        },
        {
            "date": "2017-06-20T20:36:52+0000",
            "content": "Good work Cassandra. Think your patch is reversed though  ",
            "author": "Jan Høydahl",
            "id": "comment-16056416"
        },
        {
            "date": "2017-06-20T20:52:15+0000",
            "content": "Is it? Damn it. We need How To Contribute docs that don't assume every task is 2nd nature to everyone at all times.\n\nSecond try attached. If it's still wrong I don't know what to do. ",
            "author": "Cassandra Targett",
            "id": "comment-16056440"
        },
        {
            "date": "2017-06-21T08:06:40+0000",
            "content": "No worries  This time it came out right ",
            "author": "Jan Høydahl",
            "id": "comment-16057140"
        },
        {
            "date": "2017-06-23T21:29:06+0000",
            "content": "Thanks, Cassandra Targett! I'm building off you patch and making final changes. Been a bit slammed this week and am unavailable to work on this for the next 24-36 hours, but I expect to have the next (hopefully final, or close to it) patch pushed sometime on Sunday (in the U.S.). ",
            "author": "Trey Grainger",
            "id": "comment-16061521"
        },
        {
            "date": "2017-06-25T15:05:21+0000",
            "content": "Also should we mark this as a blocker for 7.0 to change it? - Varun Thacker\n\nI just updated it to be a blocker, Varun. I'm working on what should be the final patch today. Hopefully this can be reviewed and make it in for 7.0. ",
            "author": "Trey Grainger",
            "id": "comment-16062350"
        },
        {
            "date": "2017-06-27T05:22:01+0000",
            "content": "Ok, I think I'm nearly done. This patch (SOLR-10494.patch) includes removing all the extraneous \"wt=json\" and \"indent=on\" references, adding a commented out version of \"wt=xml\" to the example solrconfig.xml's, unit test updates, some additional updates to the tutorials and docs (also incorporating Cassandra Targett's), and updating the admin UI (query section) to handle the new defaults.\n\nThe only issue I'm running into is that for some reason I haven't figured out yet, turning \"indent\" on has broken some of the parent/child relationship tests (i.e. TestHierarchicalDocBuilder.testThreeLevelHierarchy, SolrExampleTests.testChildDocTransformer. It initially appears to be some xml parsing issue issue with the extra whitespace, which would be odd, but I haven't dug in yet.  Once I figure those out, I'll update the patch, and then I think this will be ready for review. ",
            "author": "Trey Grainger",
            "id": "comment-16064287"
        },
        {
            "date": "2017-07-05T14:31:54+0000",
            "content": "I tried to debug theTestHierarchicalDocBuilder.testThreeLevelHierarchy test failure, and I see that the test data is different but that may be the intention, to randomize the hierarchy. The patch is pretty large so I guess several things could affect this. At least the failures are 100% reproducible so it should be possible to get to the end of it. ",
            "author": "Jan Høydahl",
            "id": "comment-16074859"
        },
        {
            "date": "2017-07-20T20:44:48+0000",
            "content": "So, any progress on this so we have a chance of getting it into 7.0.0? I don't have the chance to work on it the next 4 weeks  ",
            "author": "Jan Høydahl",
            "id": "comment-16095339"
        },
        {
            "date": "2017-07-21T15:56:54+0000",
            "content": "Hi Jan Høydahl.\n\nI picked it up a few times, but was developing against master and kept running into stability issues with other tests every time I pulled. I finally switched over to just developing on the 7.x branch instead to prevent those stability issues. I have an updated patch which fixes some (now) merge conflicts with the default configset changes, and all tests appear to be passing except the TestHierarchicalDocBuilder.testThreeLevelHierarchy one. I still haven't been able to dig deep enough to understand what is effecting that one.\n\nI DO know that the issues is related to indention. If I go into the test and override it to \"indent=off\" then it succeeds, but I have no idea why indention being on is causing the failure. Also, doing that in the test is probably just masking another underlying problem, which may not even be test related, so I really need to understand exactly where things are breaking down to know if it's a test problem or an actual functionality problem somewhere.\n\nAt any rate, I'll post my updated patch here shortly. I'm a little tight on time this next week, so hopefully I can enlist someone else to assist on my end later today, as well. ",
            "author": "Trey Grainger",
            "id": "comment-16096408"
        },
        {
            "date": "2017-07-21T17:28:37+0000",
            "content": "Here's the most up-to-date patch against branch_7x. ",
            "author": "Trey Grainger",
            "id": "comment-16096573"
        },
        {
            "date": "2017-07-21T19:11:09+0000",
            "content": "Here's an update patch against master (58358099bf72b) ... most of the conflicts were in the ref guide, and i'm pretty sure i captured the intent of all the cahnges – but i haven't reviewed that part in depth.\n\nIn truth, i haven't reviewed much of the patch at all – i've been looking into the test failures.  I'm pretty sure the root problem here is that with the change to default to indent=true, really deep XML docs are including more newlines in places they weren't before, and that's causing some bugs in the SOlrJ XMLResponseParser because i think it causes the XMLStreamReader to consider that \"non-ignorable\" whitespace so it's returning it as CHARACTER data in places where the parser doesn't expect CHARACTER data.\n\nthis seems like a legic bug that we should fix as a blocker to making these changes – i'll dig in more and file a new jira once i have a more concrete diagnoses ",
            "author": "Hoss Man",
            "id": "comment-16096716"
        },
        {
            "date": "2017-07-22T01:44:11+0000",
            "content": "\n\n...I'm pretty sure the root problem here is that with the change to default to indent=true, really deep XML docs are including more newlines in places they weren't before, and that's causing some bugs in the SOlrJ XMLResponseParse ...\n\nThe scope of the bug was much more narrow then i realized: it only affected nested child docs when indent=true (newlines had nothing to do with it) – fixed now in SOLR-11136.\n\n\n\nI tried to debug theTestHierarchicalDocBuilder.testThreeLevelHierarchy test failure, and I see that the test data is different but that may be the intention, to randomize the hierarchy.\n\nthat failure is actually really simple: the xpath is badly written.  it's using syntax like /arr[@name='id' and .='\"parentId1\"'] which only works if all of the accumlated text data inside the <arr> equal parentId after they've been concatenated – but when indent=true there are additional (whitespace) text data nodes in the DOM before and after the <str>...</str>.\n\nIn the attached path i simplified & tightened up these xpaths to be explicit about looking for the <str>...</str> content.\n\n(NOTE: still haven't actaully reviewed the patch, just focused on getting the tests to pass) ",
            "author": "Hoss Man",
            "id": "comment-16097059"
        },
        {
            "date": "2017-07-22T17:15:50+0000",
            "content": "Jan Høydahl: FWIW, I still haven't reviewed the patch in depth, and I'm leaving for a 2 week vacation in a few days (w/limited bandwidth between now and then).\n\nIf you already reviewed the meat of the patch and were satisfied with the changes but just got blocked on the test failures before you were ready to commit, then by all means please proceed with committing – but you may want to re-review the ref-guide changes since i had to resolve a lot of patch merge conflicts there. ",
            "author": "Hoss Man",
            "id": "comment-16097385"
        },
        {
            "date": "2017-07-24T15:42:11+0000",
            "content": "Commit 6a59253ec34e9e08d6b2306b51c81199d3f3d828 in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6a59253 ]\n\nSOLR-10494: Make default response format JSON (wt=json), and also indent text responses formats (indent=on) by default ",
            "author": "ASF subversion and git services",
            "id": "comment-16098595"
        },
        {
            "date": "2017-07-24T17:44:10+0000",
            "content": "backport was while jira was down, so gitbot didn't note all the commits...\n\nmaster - 6a59253ec34e9e08d6b2306b51c81199d3f3d828\n7x - 8ea4c0790d003efafe893db3d6ab33ad494a1213\n7_0 - 477c2188ef9f2c82902cf4ed1ccb91bfc6ab5ebf\n\n ",
            "author": "Hoss Man",
            "id": "comment-16098891"
        },
        {
            "date": "2017-07-24T19:15:11+0000",
            "content": "Smoke tester is unhappy on master because a Solr query response is in JSON vs XML - from https://builds.apache.org/job/Lucene-Solr-SmokeRelease-master/823/:\n\n\n[...]\n  [smoker] Solr techproducts example launched successfully. Direct your Web browser to http://localhost:8983/solr to visit the Solr Admin UI\n   [smoker]       test utf8...\n   [smoker]       run query...\n   [smoker] FAILED: response is:\n   [smoker] {\n   [smoker]   \"responseHeader\":{\n   [smoker]     \"status\":0,\n   [smoker]     \"QTime\":0,\n   [smoker]     \"params\":{\n   [smoker]       \"q\":\"video\"}},\n   [smoker]   \"response\":{\"numFound\":3,\"start\":0,\"docs\":[\n[...]\n\n\n\nFrom smokeTestRelease.py:\n\n\n859: print('      run query...')\n860: s = load('http://localhost:8983/solr/techproducts/select/?q=video')\n861: if s.find('<result name=\"response\" numFound=\"3\" start=\"0\">') == -1:\n862:   print('FAILED: response is:\\n%s' % s)\n\n ",
            "author": "Steve Rowe",
            "id": "comment-16099004"
        },
        {
            "date": "2017-07-24T20:19:47+0000",
            "content": "gah ... sorry ... i didn't even think about that.\n\nlemme review the rest of the smoketester a bit more and figure out if it makes more sense to just add wt=xml, or to redo these bits to expect json by default. ",
            "author": "Hoss Man",
            "id": "comment-16099067"
        },
        {
            "date": "2017-07-24T22:36:38+0000",
            "content": "Commit 56ad1a7a9b049e7399c0e482dcf6f4f395472f5b in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=56ad1a7 ]\n\nSOLR-10494: fix smoker ",
            "author": "ASF subversion and git services",
            "id": "comment-16099210"
        },
        {
            "date": "2017-07-24T22:37:43+0000",
            "content": "Commit 25637fbba37e5c339562748e4bddcde31869ca2b in lucene-solr's branch refs/heads/branch_7_0 from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=25637fb ]\n\nSOLR-10494: fix smoker\n\n(cherry picked from commit 56ad1a7a9b049e7399c0e482dcf6f4f395472f5b) ",
            "author": "ASF subversion and git services",
            "id": "comment-16099211"
        },
        {
            "date": "2017-07-24T22:37:45+0000",
            "content": "Commit 34e3ef7d7b0823085ec34166af13ced1df56e09a in lucene-solr's branch refs/heads/branch_7x from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=34e3ef7 ]\n\nSOLR-10494: fix smoker\n\n(cherry picked from commit 56ad1a7a9b049e7399c0e482dcf6f4f395472f5b) ",
            "author": "ASF subversion and git services",
            "id": "comment-16099213"
        },
        {
            "date": "2017-07-24T22:40:05+0000",
            "content": "this change fixed smoketest for me on master, so i went ahead and backported it – but i'm actually still sanity testing on 7x/7_0 ",
            "author": "Hoss Man",
            "id": "comment-16099214"
        },
        {
            "date": "2017-10-17T11:03:46+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16207371"
        }
    ]
}