{
    "id": "SOLR-4209",
    "title": "asm-3.1.jar is missing",
    "details": {
        "affect_versions": "4.0",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "One of Tika dependency file is missing on Solr 4.0. \nWhen posting java class files into Solr via SolrCell, those files can't be indexed without asm-3.1.jar.",
    "attachments": {
        "SOLR-4209.patch": "https://issues.apache.org/jira/secure/attachment/12561438/SOLR-4209.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shinichiro Abe",
            "id": "comment-13534698",
            "date": "2012-12-18T06:28:13+0000",
            "content": "Here is a patch. Please apply this. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13534841",
            "date": "2012-12-18T11:57:56+0000",
            "content": "I dont think we should do this.\n\nWe are using asm 4.0 elsewhere. we cannot also depend on 3.1 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13534849",
            "date": "2012-12-18T12:27:11+0000",
            "content": "Reference discussion: LUCENE-4263 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13534861",
            "date": "2012-12-18T12:51:22+0000",
            "content": "asm 4.1 already! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13534863",
            "date": "2012-12-18T12:54:14+0000",
            "content": "In general, tika-extraction only ships with all JARS needed to extract text documents. Indexing Java CLASS files is somehow strange with Solr, especially as the metadata extracted is very limited. If you want to do this, you can always place the mssing JAR files in the lib folder of your Solr installation. We are also missing other JAR files, like NETCDF support (at least in 3.6, because NETCDF needs Java 6, but Lucene 3.x is Java 5 only). "
        },
        {
            "author": "Shinichiro Abe",
            "id": "comment-13534960",
            "date": "2012-12-18T15:19:33+0000",
            "content": "Thank you for the reply.\n\nManifoldCF can crawl to file server where it stores various files, .class files too, and posts to Solr.\nAs ManifoldCF user, we would like to search text which is extracted not only from general files but also from class files. That 's why I requested.\n\nCurrently by missing a part of Tika dependencies as Solr's OOTB, Solr returns 500 and then by this server error ManifoldCF's crawling is aborted after some retrying.  \nOf course I can place jar files manually but I think I need ams in lib folder by default.\nTika 1.2 depends on asm-3.1. Conflicting versions of same jar is not good? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13535099",
            "date": "2012-12-18T17:46:20+0000",
            "content": "I think we should document which document types are supported by the solr-release out-of the box (README file). Class files are definitely not a common use case for Solr indexing so I disagree with including the parser dependencies. Solr is a text indexing server, so the primary list of parsers should be document parsers, not parsers for binary-only file formats without any useful text content for a full text search engine.\n\nI just repeat: You can add the missing parsers to your lib folde rof the Solr installation.\n\n-1 to add support for ASM and NETCDF or MP3 files out of the box. This bloats the release only useful for 0.01% of all users. It is so easy to download the remaining JAR files and place them in lib folder.\n\nI would +1 to add a setting to SolrCell so it can ignore files that have no parser or where the parser is disabled because of missing dependencies (TIKA itsself already handles this by catching ClassNotFoundEx and ignoring those parsers).\n\nTika 1.2 depends on asm-3.1. Conflicting versions of same jar is not good?\n\nYou cannot upgrade this version as ASM 4.x is incompatible to 3.x, but using same package names, but largely different API (e.g. interfaces got classes and so on). "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13800615",
            "date": "2013-10-21T12:47:53+0000",
            "content": "Yea, let's document in the ref guide what parsers ship with Solr and where to go to find additional parsers.\n\nHowever, throwing an exception when a parser does not exist is way better than silently ignoring the document. Clients like MCF should know that a document was not indexed and why. Perhaps we should improve SolrCell to respond with HTTP \"415 Unsupported Media Type\" when a parser was not found? See http://en.wikipedia.org/wiki/List_of_HTTP_status_codes#415 "
        }
    ]
}