{
    "id": "SOLR-6482",
    "title": "Add an onlyIfDown flag for DELETEREPLICA collections API command",
    "details": {
        "affect_versions": "5.0,                                            6.0",
        "status": "Closed",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Having the DELETEREPLICA delete the index is scary for some situations, especially ones in which the operations people are taking more explicit control of the topology of their cluster. As we move towards ZK being the \"one source of truth\" and deleting replicas that then come back up, this is even scarier.\n\nI propose to have an optional flag onlyIfDown that remove the replica from the ZK cluster state if (and only if) the node was offline. Default value: false.",
    "attachments": {
        "SOLR-6482.patch": "https://issues.apache.org/jira/secure/attachment/12666580/SOLR-6482.patch",
        "SOLR-6482-test.patch": "https://issues.apache.org/jira/secure/attachment/12669294/SOLR-6482-test.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-14121982",
            "date": "2014-09-04T21:16:01+0000",
            "content": "Here's a first cut at the patch, still need to add tests but this seems to work when I tested it manually.\n\nIts pretty simple all told, it seems like it shouldn't interfere with the \"ZK as truth\" model. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14126220",
            "date": "2014-09-08T22:34:18+0000",
            "content": "Patch with a test as well, the test shamelessly piggy-backed on an existing test....\n\nThis may be ready to commit, all tests pass, but I'd like to give people a chance to comment. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14133517",
            "date": "2014-09-15T03:07:37+0000",
            "content": "Final patch with CHANGES.txt added "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14133518",
            "date": "2014-09-15T03:08:07+0000",
            "content": "Commit 1624930 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1624930 ]\n\nSOLR-6482: Add an onlyIfDown flag for DELETEREPLICA collections API command "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14134019",
            "date": "2014-09-15T15:33:43+0000",
            "content": "Hmmm, don't ask me how, but somehow my latest patch didn't have the tests in it, I'll fix today. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14134963",
            "date": "2014-09-16T05:00:31+0000",
            "content": "I'm a little confused about this feature. You say that deleting index automatically is scary and then you talk about ZK as truth and about replicas coming back up. What is the use-case behind onlyIfDown? Why would anyone invoke DELETEREPLICA against a replica if they don't want it to be removed from cluster state? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14135611",
            "date": "2014-09-16T15:40:57+0000",
            "content": "I'm confused by this as well. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14135890",
            "date": "2014-09-16T18:24:56+0000",
            "content": "@Shalin:\n\nbq: Why would anyone invoke DELETEREPLICA against a replica if they don't want it to be removed from cluster state?\n\nIt's really the opposite, something of a safety valve. It's a situation where you only want to affect the cluster state, you do not want to actually delete a replica if it's live. Particularly for cleanup when a machine has died and it's never coming back.\n\nI'm looking at it as a paranoia flag for DELETEREPLICA that expresses \"if I screwed up and called this on a live replica, ignore the command\". Operationally, it's scary to turn a script loose for maintenance that may, through a programming error or whatever, delete all the nodes on my system.\n\nOne can argue that all this can be done by examining the cluster state and issuing the delete replica only for nodes that are down and not need to add a flag to DELETEREPLICA and I suppose that's true. But operations folks would like this kind of safety valve.\n\nI'm not quite sure how this plays out in the ZK being \"the one source of truth\" model, when we get there it may be irrelevant. But we're not there yet, it's completely optional, and if omitted the behavior is the same as now so it's not a big change. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14136587",
            "date": "2014-09-17T00:49:57+0000",
            "content": "Commit 1625441 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1625441 ]\n\nSOLR-6482: Omitted tests "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14136635",
            "date": "2014-09-17T01:25:23+0000",
            "content": "Patch for the somehow-omitted files. Should be applied after SOLR-6482.patch "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14137359",
            "date": "2014-09-17T14:56:39+0000",
            "content": "Commit 1625621 from Erick Erickson in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1625621 ]\n\nSOLR-6482: Add an onlyIfDown flag for DELETEREPLICA collections API command "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14137361",
            "date": "2014-09-17T14:58:15+0000",
            "content": "Incorporates the forgotten test too "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14332772",
            "date": "2015-02-23T05:01:50+0000",
            "content": "Bulk close after 5.0 release. "
        }
    ]
}