{
    "id": "SOLR-106",
    "title": "new facet params: facet.sort, facet.mincount, facet.offset",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.2"
        ],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "a couple of new facet params:\nfacet lists become pageable with facet.offset, facet.limit  (idea from Erik)\nfacet.sort explicitly specifies sort order (true for count descending, false for natural index order)\nfacet.mincount: minimum count for facets included in response (idea from JJ, deprecate zeros)",
    "attachments": {
        "facet_params.patch": "https://issues.apache.org/jira/secure/attachment/12348916/facet_params.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12464561",
            "date": "2007-01-14T06:14:33+0000",
            "content": "Attached untested code... I don't want to bother testing + adding test code w/o feedback on direction.\n\nChanges included in this code:\n\n\tfacet.offset, facet.sort, facet.mincount support (detailed above)\n\tavoid temporary HashMap when sort=false, add directly to response\n\tfor sorted case, keep track of min element in the queue to avoid needlessly adding pairs\n\n "
        },
        {
            "author": "Andreas Hochsteger",
            "id": "comment-12464596",
            "date": "2007-01-14T15:59:28+0000",
            "content": "What about a facet filter query to only return facets which match a certain query?\n\nIn our case we use categories which are organized hierarchically via a path syntax.\nDocumets have different categories attached which is indexed by a solr field.\n\nNow certain apps (which deal with these documets) are interested in a specific category subpath.\nIf you use faceted searching you get all categories back - not only those in which the application is interested in.\n\nCurrently we use a workaround which uses an additional solr search field that just contains the categories for the application, but this doesn't scale very well.\nWould it be possible to add an additional filter query for facets to limit the facets which are actually returned in the faceted search?\n\nThoughts? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12464652",
            "date": "2007-01-15T04:34:36+0000",
            "content": "Yonik: i think all of these params make sense.  i only skimmed the code cahnges breifly but they look sound to me.\n\nAndreas: there was some discussion on the list about being able to specify a \"prefix\" that facet field values must match to be listed (which would trivial and efficient for TermEnum based facets, and doable for FieldCache facets) ... that makes a lot of sense to me in a \"type ahead\" word completion type of application (like google suggest) but the situation you describe doesn't relaly make sense to me – if your client is only interested in documents in certain categories, then don't you want to filter the documents by do just those categories (at which point the facets will also be filtered) ... can you start a thread on solr-user describing your situation/scaling issue?\n\n\n "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12464658",
            "date": "2007-01-15T05:54:21+0000",
            "content": "+1 on direction, and based on a quick scan of the patch.\n\nIt could be sort=asc|desc|none rather than true|false, but I'm not sure whether anyone would ever have a use for asc so it's probably not worth implementing.\n\nOf course extending to caching the facet tallies would dramatically speed paging.  Perhaps both getFieldCacheCounts and getFacetTermEnumCounts should return a Collection, which could be a BoundedTreeSet when sorting or a List implementation when not, holding all the counts >= facet.mincount; then getTermCounts could centralize the paging and response creation and provide an object to (someday) cache.  It would lose the mincount=0 optimization for getFieldCacheCounts, but how many users are really going to want mincounts=0 unless the list is small and non-sparse in which case the optimization isn't a big win anyway. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12464661",
            "date": "2007-01-15T06:17:19+0000",
            "content": "I did have a reservation about always guaranteeing a sort order... I wasn't sure if it would always be easy to maintain term-sort order in future implementations.  If that were the case, maybe it should be sort=count|term|none... might be more future-flexible, but harder to remember than a boolean.\n\nJust curious, what are your usecases for facet paging, and what percent of facet queries would have an offset other than 0? "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12464698",
            "date": "2007-01-15T08:56:51+0000",
            "content": "Case for Facet Count Caching: Paging through the hitlist (as well as paging through the facet list).  In some cases it appears that generating the facet counts takes much longer than generating the hitlist.  And that's certainly the case when the hitlist is retrieved from cache.\n\nCase or Facet Paging:  The UI design I'm doing back-end for has a list of facets with 5 top values each, and a \"More...\" link when there are indeed more than 5 facet values.  Traversing that link is supposed to show a page with all facet values which fit, and Prev and Next paging buttons to access those which don't.  This browser shows counts and can be sorted by count but by default is sorted alphabetically by term.  Next to each term is a checkbox; after browsing and checking, a button returns to the hitlist but adds a big OR of the checked terms as an fq. So for example if a user searches and gets 437 hits with rutabaga in the title, having 264 unique author names, they might want to browse the list looking for friends.  Then after browsing and checking they can see a hitlist of all articles written by friends with rutabage in the title.\n\nI don't have any idea what the proportion of facet queries would have offset > 0 e.g. where the user has moved to the next page, but I assume it's non-rare.\n\nIt occurs to me that facet.limit should NOT do double-duty for paging: In a world where facet counts are cached, facet.limit should continue to play its current role, and limit the number of ranked values that make it into the BoundedTreeSet and thus the cache.  Then facet.offset and facet.count could be used to return a subset.  facet.limit==0 --> no limit, but can still be paged.\n\nCase for pulling response generation out of getFieldCacheCounts and getFacetTermEnumCounts:  I (truly) have a 37 million document index which I need to facet on Author, of which there are millions.  The TermEnum algorithm is clearly unsuited, and the FieldCache algorithm requires an inordinate amount of memory; I had to disable it.  So rather than tell management \"can't be done\", I think I need to plug in at least one more algorithm, e.g. using TermFreqVectors, to SimpleFacets.  Would love not to have to replicate the response generation code.\n\nOr the sorting code.  Just had an idea:  It would be even nicer if the counting logic could be passed some object, say an implementation of TermCountRecorder, which has an add(String term, int count) method.\n\n\tThat object would encapsulate and isolate the generation of CountPair objects, the filtering for mincount, and whatever varieties of sorting are supported.\n\tRather than have one object with multiple pathways e.g. for term vs. count vs. no sorting, a static factory method could take the field, sort, and mincount arguments and return an anonymous implementation based on a List or a TreeSet or whatever.\n\tThe factory could also be told whether the counting logic guarantees adding terms in term (index) order, and if not but if term order were requested it could return an implementation which sorts by term text, otherwise a simple List.\n\tIt could be the object that gets cached for that query for that field.\n\tIt could have a generateResponse(offset, count) method which generates the <list name=\"<facetfield>\">\n\tIt could optimize memory when multiple TermCountRecorders corresponding to different queries are cached for a field, by maintaining a single WeakHashMap of term strings for the field, so each TermCountRecorder with the same term has a pointer to the same String object – essentially like String.intern() but the scope is the field and the master value would disappear once all cached TermCountRecorders referencing it disappear.\n\tIt would make life much easier for a faceting approache where rather than iterating field->document it might be more efficient to iterate document->field (e.g. TermFreqVectors?): A TermCountRecorder could be allocated for each faceting field using that algorithm and have add(...) called in a round-robin fashion as documents are iterated. At the end all could be added to the cache and, whether added or retrieved, would have generateResponse called.\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12465248",
            "date": "2007-01-16T18:31:43+0000",
            "content": "committed, with tests and other changes.\nI'll work on updating docs shortly. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12465254",
            "date": "2007-01-16T19:10:23+0000",
            "content": "Thanks for the info JJ... didn't see your update untill after I committed this (I'm running a bit behind all the solr traffic \n\n> Case for Facet Count Caching: Paging through the hitlist \n\nHmmm, yes that would be good for a more stateless client.  Even more efficient would be to recognize in the client that since you are only changing a page in the hitlist, the facets won't change (and hence don't re-query).\n\n> It occurs to me that facet.limit should NOT do double-duty for paging:\n\nOr, it should only be used for paging, specifying the number to be returned.  The BoundedTreeSet size and caching are an implementation detail and shouldn't be in the API unless really necessary.  If it matters in the future, we could add a hint specifying how much \"extra\" should be computed.\n\n> Case for pulling response generation out of getFieldCacheCounts and getFacetTermEnumCounts\n\nSure, makes sense.  Don't view the current facet code as \"done\"... I have a lot of little ideas on how to make it better, esp for cases like faceting on author.\n\n> TermFreqVectors\nRegarding this, do you have any performance data on it... my assumption was that it would be too slow for a large number of hits.  Perhaps still a good option to have if the number of hits are small and the fieldcache isn't an option though.\n\n> Just had an idea: It would be even nicer if the counting logic could be passed some object,\nYup, separating those things was on my todo list.\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589322",
            "date": "2008-04-15T23:44:45+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.2\n\n\n\nThe Fix Version for all 39 issues found was set to 1.2, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman2 "
        }
    ]
}