{
    "id": "SOLR-118",
    "title": "Some admin pages stop working with \"error 404\" as the only symptom",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "This was reported to the mailing list a while ago, see http://mail-archives.apache.org/mod_mbox/lucene-solr-user/200610.mbox/%3cf752f5320610311359y365d6322lb9b4e409f5557dfc@mail.gmail.com%3e\n\nToday I'm seeing the same thing on a Solr instance that has been running since January 9th (about 13 days) with the plain start.jar setup. Index contains 150'000 docs, 88322 search requests to date.\n\n$ curl http://localhost:8983/solr/admin/analysis.jsp\n<html>\n<head>\n<title>Error 404 /admin/analysis.jsp</title>\n</head>\n<body>\n<h2>HTTP ERROR: 404</h2><pre>/admin/analysis.jsp</pre>\n<p>RequestURI=/solr/admin/analysis.jsp</p>\n...\n\ncurl http://localhost:8983/solr/admin/index.jsp\n<html>\n<head>\n<title>Error 404 /admin/index.jsp</title>\n</head>\n<body>\n<h2>HTTP ERROR: 404</h2><pre>/admin/index.jsp</pre>\n<p>RequestURI=/solr/admin/index.jsp</p>\n...\n\nOther admin pages work correctly, for example http://localhost:8983/solr/admin/stats.jsp\n\nI don't see any messages in the logs, which are capturing stdout and stderr from the JVM.\n\nI guess I'll have to restart this instance, I'm out of possibilities to find out what's happening exactly.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12466464",
            "date": "2007-01-22T14:25:23+0000",
            "content": "What version of jetty was it?  The one included with Solr?\n\nI don't personally have experience with Solr + Jetty and long uptimes.  We use Resin in-house, and don't have any uptime issues. "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12466468",
            "date": "2007-01-22T14:42:51+0000",
            "content": "Yes, this is the Jetty that is bundled with Solr, Jetty/5.1.11RC0 according to the \"Server\" HTTP header.\n\nI haven't investigated on the Jetty side yet, it might be a known bug there "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12466489",
            "date": "2007-01-22T15:52:45+0000",
            "content": "Maybe it's time to upgrade to the latest Jetty, or at least start evaluating it?\nThat would also remove the requirement for a JDK over a JRE, and speed up JSP page compilation too. "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12466496",
            "date": "2007-01-22T16:28:28+0000",
            "content": "Upgrading is probably a good idea, at least to a released 5.x version, as apparently we're using a release candidate. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12466535",
            "date": "2007-01-22T19:47:10+0000",
            "content": "FYI: there was more tothat orriginal thread then the apache archives show (because they are split up by month) here's the full discussion...\n\nhttp://www.nabble.com/Admin-page-went-down-tf2548760.html#a7103716\n\n...at the time i wasn't able to reproduce the problem, but i wasn't hammering the port very hard.  I suspect heavily that since hte problem was only with the admin pages, and all of the update/query functionality still worked fine that it was a JSP issue with Jetty. "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12466539",
            "date": "2007-01-22T19:55:46+0000",
            "content": "> I suspect ....that it was a JSP issue with Jetty. \n\nYes, certainly. Nothing seems to indicate a problem in Solr's code. "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12480010",
            "date": "2007-03-12T08:36:32+0000",
            "content": "I'm seeing another, probably related, problem, on a Solr instance that's been running for 23 days: solr/admin/stats.xsl returns a 404 error, so although solr/admin/stats.jsp returns the correct XML it is not displayed in my browser.\n\nIt seems like the default servlet (which serves static files) is dead, although the rest works fine. Most probably a Jetty issue. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12507990",
            "date": "2007-06-25T20:54:02+0000",
            "content": "FYI: I think i may have found one possible cause of this problem .. not sure if there are other causes.\n\n1) open two terminals both of which are in the solr example directory.\n2) in terminal A, run 'java -jar start.jar'\n3) note that the following URLs all work fine...\n   http://localhost:8983/solr/\n   http://localhost:8983/solr/select/?q=solr&version=2.2&start=0&rows=10&indent=on\n   http://localhost:8983/solr/admin/\n4) in terminal B, run \"java -jar start.jar\"\n5) note that in terminal b, the server logs a \"java.net.BindException: Address already in use\" exception but the process does not terminate itself.\n6) note that while the process in terminal B is still running, the urls from step#3 still work fine, and the queries are logged to terminal A\n7) hit Ctrl-C in terminal B to kill that process, wait for it to log \"Shutdown hook complete\" and return your prompt\n8) note that the following URLs now 404...\n   http://localhost:8983/solr/admin/\n   http://localhost:8983/solr/\n9) note that this URL (and all non JSP non flat file solr urls) continues to work, and log the request to terminal A...\n   http://localhost:8983/solr/select/?q=solr&version=2.2&start=0&rows=10&indent=on\n\n\n..in short, i suspect this is a jetty problem, relating to people inadvertently trying to run two instances on the same port, and the shutdown hook for the second instance that does not actually bind to the port inadvertently breaks the first instance. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12507994",
            "date": "2007-06-25T21:06:47+0000",
            "content": "Nice find!  Has this been reported to the Jetty folks, or is this something we can solve with configuration? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12508000",
            "date": "2007-06-25T21:24:31+0000",
            "content": "i haven't reported anything, and i didn't really dig into it with much depth ... i just randomly discovered it while testing out something else.  (This is the first time i've ever been able to reproduce the problem, i suspect because i tend to leave myself logged into my machines for years at a time with dozens of terminals open each dedicated to one and only one purpose ... so i'd never tried running the solr example code in more then one terminal – let alone the only two at the same time.  the only reason i noticed today was because i'd brought up a new terminal last week to use for giving a solr demo on my second monitor (the first new terminal i've opened in about 2 months mind you) and i never shut it down until i noticed today that my regular solr example running terminal was misbehaving.) "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12508159",
            "date": "2007-06-26T12:33:59+0000",
            "content": "Scanning the past comments....\n\nMy first guess would be that Jetty was left configured as is by default, which means it expanded webapps in /tmp/Jetty__some_dir_here....  Some UNIX boxes are configured to purge old files from /tmp/ in order not tu run out of free disk space in /tmp partition.  Perhaps this is what happened here.\n\nThe fix is to configure Jetty to expand webapps to a dir that does not get purged.  Of course,  I cannot remember the property name for that. "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12508253",
            "date": "2007-06-26T17:32:55+0000",
            "content": "Otis, I guess we'll owe you a free beverage of his choice, your guess sounds totally right.\n\nAccording to http://docs.codehaus.org/display/JETTY/Temporary+Directories the easiest fix might be to create a $(jetty.home)/work directory, which Jetty will use. I haven't checked if this works with the Jetty that's embedded with Solr. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12508313",
            "date": "2007-06-26T20:16:49+0000",
            "content": "Ah, yes, that will work.  I have Jetty set up like that for http://simpy.com/ , that is why I knew the answer. \n\nBeverage of choice....hm, a glass of hot milk?  "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12512710",
            "date": "2007-07-14T12:24:17+0000",
            "content": "We have confirmed Otis's hypothesis by deleting Jetty's work dir under /tmp while Solr runs, which causes the 404 to appear as described above.\n\nI have added this to the Solr FAQ [1], and added Otis to my \"IOU a glass of milk\" list.\n\n[1] http://wiki.apache.org/solr/FAQ#head-eff0fcf7bd2ef9385999b1b5c71fffb34e568e8b "
        }
    ]
}