{
    "id": "SOLR-10561",
    "title": "Unified Highlighter not responding with more than 13 snippets",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "contrib - Velocity"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.5",
        "resolution": "Invalid",
        "status": "Resolved"
    },
    "description": "Hi, I've been working on a Solr project in Windows for a while... here i'm trying to index a book containing (118,704 words) and then do a basic term search, however the Velocity interface is not returning the expected results, Velocity will only return a maximum of 13 terms highlighted within 13 snippets, even though my snippets is set to much higher than 13. I've tried this both with the Original and Unified highlighter with the same results.\n\nThe XML data file for my book has the following fields as shown below:\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<add>\n<doc>\n<field name=\"id\">WALDEN-utf8.xml</field>\n<field name=\"title\">WALDEN</field>\n<field name=\"catagory\">Sam-tests</field>\n<field name=\"content\">\n(118,704 words) ... too large to paste here!\n</field>\n<field name=\"keywords\"></field>\n</doc>\n</add>\n\n\n\tI've modified my schema via the API and indexed my file successfully.\n\tI've also managed to turn on highlighting using the following command:\n\n\n\ncurl http://localhost:8983/solr/mycore/config/params -H 'Content-type:application/json' -d \"{\"set\":{\"browse\":\n{\"hl\":\"on\",\"hl.method\":'original',\"hl.snippets\":'1000',\"hl.fl\":'*'}\n}}\"\n\nAgain Velocity will return the correct number of highlighted terms, in the correct number of snippets if i reduce the hl.snippets field to anything less than or equal to 13.\n\n\n\tI've also read the documentation online at: https://cwiki.apache.org/confluence/display/solr/Highlighting\n\n\n\nand it clearly says:\n\"hl.snippets\t1\tSpecifies maximum number of highlighted snippets to generate per field. It is possible for any number of snippets from zero to this value to be generated.\"\n\nI'm not sure why this is happening, is my approach to the whole project wrong? I have read that Solr can successfully index many books. The Admin UI logs doesn't show any problems either, also I've been looking on the net but still no luck as to as why this is happening. Please help and apologies if my method or place of escalation is not correct (newbie ).\nPlease let me know if you require further information as well.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-04-24T18:31:29+0000",
            "content": "First, unless it's best to discuss topic on the user's list first, we try to reserve the JIRA system for known code issues rather than usage questions.\n\nVelocity is a demonstration UI, I'd guess there's an arbitrary limit in there, you can look through the velocity code and see. But you simply cannot expose velocity to end users, that gives them total access to your corpus you give them your Solr URL, and you'd give users essentially unlimited access.\n\nTry using the raw URL, plus insure that your highlighter configuration in solrconfig.xml doesn't have an invariant for the max number of snippets allowed.\n\nYou can find instructions for the Solr user's list here:\n\nhttp://lucene.apache.org/solr/community.html\n\nI'll close this JIRA, we can open a new one if there's a code change required.\n\nBest,\nErick ",
            "author": "Erick Erickson",
            "id": "comment-15981632"
        }
    ]
}