{
    "id": "SOLR-1022",
    "title": "suggest multiValued for ignored field",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "We are actually using the suggested \"ignored\" field in the schema.  I have found, however, that Solr still throws a error 400 if I send in an unmatched multi-valued field.\n\nIt seems that if I set this ignored field to be multiValued than a document with unrecognized single or multiple value fields is sucessfully indexed.\n\nAttached patch alters this suggested item in the schema.",
    "attachments": {
        "SOLR-1022.patch": "https://issues.apache.org/jira/secure/attachment/12400351/SOLR-1022.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12674507",
            "date": "2009-02-18T07:55:41+0000",
            "content": "I must have missed some releated thread on the ML... but can you explan what you mean by \"an unmatched multi-valued field\"?\nAnd what does \"ignored\" field mean?  Thanks. "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12674584",
            "date": "2009-02-18T12:15:46+0000",
            "content": "The \"ignored\" field is non-indexed and non-stored.   The suggested function in the example schema.xml is to avoid Solr errors when there is a doc field that matches nothing in the schema.\n\nI found that the one in the example schema being single-valued, if I send in an unmatched multi-valued field I still get the error that enabling this field was intended to prevent.\n\nI did not send to the ML, since this seemed pretty trivial, but I can do so as well. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12674743",
            "date": "2009-02-18T19:11:52+0000",
            "content": "good cache peter, that is a bad example ... it was in a DIH example as well so i fixed that too...\n\nCommitted revision 745615. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775661",
            "date": "2009-11-10T15:51:57+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}