{
    "id": "SOLR-399",
    "title": "SolrConfig.Initializable: allow configurable class instances to depend on the SolrCore instance",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "WHAT:\nThis patch introduces initialization behaviors for instances of configurable classes.\n\nWHY:\nIntroduced through solr-215, SolrConfig.Initializable allows some classes (Tokenizer, Filter) to get access to the SolrConfig at initialization time.\nIt would be convenient to extend this so that instances of configurable classes could access objects known by the core - and thus the schema . \nsee http://www.nabble.com/SolrConfig.Initializable-tf4665036.html\n\nHOW:\nSolrConfig is extended to declare some new initialization dedicated interfaces (Initializable, InitializablePlugin, InitializableBy) that classes wishing to benefit from the initialization behaviors need to implement. SolrCore.Initializable interface is also introduced for the same purpose. All those interfaces require the implementation of some 'init' method.\n\nIt is guaranteed that:\n1/ SolrConfig.Initializable*.init is called before SolrCore.Initializable.init\n2/ SolrCore.Initializable.init is guaranteed to be called only once when it is successful at core initialization time.\n\nWhen the core is being initialized, all instances that go through SolrConfig.initInstance that are SolrCore.Initializable are queued into an initialization list that guarantees uniqueness (aka they are only queued once).\nAt the end of core initialization, the solrConfig.init(core) is called; this triggers the call to SolrCore.Initializable.init(core) for each queued instances. That method must be implemented to return 'true' if the initialization has been performed, 'false' if it must be re-evaluated. This allows one instance to depend on another initialization (a tokenizer could require a fieldType).\nSolrconfig will loop around the queue while it can successfully initialize instances or new ones are posted; if the loop can not reduce the number of instances expecting initialization, it is considered an error (and this will avoid potentially cyclic dependencies).\n\nAfter the core has been initialized, the SolrConfig will automatically post instance to the SolrCore queue & empty it right away with the same behavior.\nNote that after the core has been initiallized, the SolrConfig is bound to that core; reusing such a bound SolrConfig for another core will generate an exception.\n\nUSAGE:\nAny class that implements one of SolrConfig.Init* interface implements some 'init' method that will be called through SolrConfig.\nThe sequence of call is:\nSolrConfig.Initializable instance = solrConfig.newInstance(\"name.of.class\");\n...\nsolrConfig.initInstance(instance, args);",
    "attachments": {
        "solr-399.patch": "https://issues.apache.org/jira/secure/attachment/12368494/solr-399.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Henri Biestro",
            "id": "comment-12538019",
            "date": "2007-10-26T17:01:32+0000",
            "content": "The patch is not yet functional (tests fail). "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12538530",
            "date": "2007-10-29T16:04:31+0000",
            "content": "Working version - limited to Token&Filter factories (can be generalized to other plugins when needed if ok)\nIncludes a test case for tokenizers depending on field types. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12542303",
            "date": "2007-11-14T02:20:27+0000",
            "content": "updated to work with trunk.\n\nI'll post my comments on the mailing list:\nhttp://www.nabble.com/SolrConfig.Initializable-tf4665036.html#a13339931 "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12544621",
            "date": "2007-11-21T22:30:05+0000",
            "content": "SOLR-414 takes care of the problems this patch solves "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12549431",
            "date": "2007-12-07T15:15:54+0000",
            "content": "solr-414 resolved this. "
        }
    ]
}