{
    "id": "SOLR-1858",
    "title": "Embedded Solr does not support Distributed Search",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It is impossible to do a Distributed Search across multiple cores in an EmbeddedSolr instance. Distributed Search only works for Solr HTTP-controlled shards, and EmbeddedSolr does not export an HTTP interface.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Lance Norskog",
            "id": "comment-12852228",
            "date": "2010-04-01T02:55:21+0000",
            "content": "The use case for this feature is that it may be convenient to manage multiple shards in an embedded instance, and do a distributed search across them. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12853047",
            "date": "2010-04-03T01:27:43+0000",
            "content": "Also, Distributed Search by one core among other cores in the same instance must use the HTTP transport rather than direct internal access. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12853053",
            "date": "2010-04-03T01:54:55+0000",
            "content": "This could be handled with one simple change: add a new URL protocol 'solr'.\n\nDetails: the SolrJ library would include a new method that creates a server from an URL, and the server factory would support 'solr://' and 'solr://core' as URLs. The meaning of \"solr://\" changes when used within an app, an EmbeddedSolr instance, or within the web app.\n\n In an Embedded Solr instance, it refers to the embedded instance itself. In a servlet container instance, it refers to that instance. 'solr://' would not be supported within a client app, because there is no Solr instance in the app.\n\nIn short, the 'solr://' URL refers to the Solr instance available within the current JVM, via the current classloader.  "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12853054",
            "date": "2010-04-03T01:58:20+0000",
            "content": "Use cases possible:\n\n\tAn embedded instance can do a distributed search across multiple cores which are inside the instance or are remote.\n\tThe SolrEntityProcessor is an (uncommitted) plugin for the DataImportHandler (SOLR-1499). It does a search against a Solr instance and supplies the resulting document, or document series, to the DIH processing chain. With the 'solr://' option, this tool can do queries against its own Solr instance with no HTTP overhead.\n\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12867662",
            "date": "2010-05-14T20:38:38+0000",
            "content": "Another point: a distributed search across embedded cores should be serial, not parallel. "
        }
    ]
}