{
    "id": "SOLR-10822",
    "title": "Concurrent execution of Policy computations should yield correct result",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Sub-task",
        "fix_versions": [
            "7.1",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Policy framework are now used to find replica placements by all collection APIs but since these APIs can be executed concurrently, we can get wrong placements because of concurrently running calculations. We should synchronize just the calculation part so that they happen serially.",
    "attachments": {
        "SOLR-10822.patch": "https://issues.apache.org/jira/secure/attachment/12879848/SOLR-10822.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-20T12:58:24+0000",
            "content": "synchronizing just the computing part is not really useful. Overseer must either wait till the collection admin operations are complete or there should be mechanism to borrow session from an ongoing operation. We should warn users in the policy framework documenation that running multiple ops in parallel may lead to incorrect placements of replicas ",
            "author": "Noble Paul",
            "id": "comment-16055709"
        },
        {
            "date": "2017-07-19T22:16:35+0000",
            "content": "Share a Policy.Session object across all the commands\n\n\n\tWhen a Policy.Session is required, try to borrow one\n\tif there is no session in use create one create one\n\tThe session will be kept active as long as the suggestions from that session are being executed. After all the suggestions are executed (or failed), the session can be destroyed\n\tIf another command needs to do replica placement, and an active session is available, reuse it\n\tIf no suggestions from a session are being executed, discard the session\n\n ",
            "author": "Noble Paul",
            "id": "comment-16093886"
        },
        {
            "date": "2017-10-17T11:04:32+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16207486"
        }
    ]
}