{
    "id": "SOLR-4646",
    "title": "[edismax] let lowercaseOperators default to \"false\"",
    "details": {
        "affect_versions": "4.1,                                            4.2",
        "status": "Resolved",
        "fix_versions": [
            "7.0"
        ],
        "components": [
            "query parsers"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Documentation says:\nlowercaseOperators\nThis param controls whether to try to interpret lowercase words as boolean operators such as \"and\", \"not\" and \"or\". Set &lowercaseOperators=true to allow this. Default is \"false\".\n\nBut in fact lowercaseOperators=true by default.\nAnd if one of boolean operators in lowercase is present in query it turns off mm parameter:\n\n\n\tq=Young+6+or+Ariston&defType=edismax&qf=name&mm=100%25&debugQuery=true\n  \"parsedquery_toString\": \"+((name:young) (name:6) (name:ariston))\"\n\n\n\n\n\tq=Young+6+or+Ariston&defType=edismax&qf=name&mm=100%25&lowercaseOperators=false&debugQuery=true\n  \"parsedquery_toString\": \"+(((name:young) (name:6) (name:ariston))~3)\"",
    "attachments": {
        "SOLR-4646.patch": "https://issues.apache.org/jira/secure/attachment/12873119/SOLR-4646.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13616752",
            "date": "2013-03-28T22:48:02+0000",
            "content": "This is correct, I just updated the documentation. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13616767",
            "date": "2013-03-28T23:00:39+0000",
            "content": "Validated that lowercaseOperators default is \"true\" in 4.1, 4.2 and trunk. Updated documentation. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13620375",
            "date": "2013-04-02T22:46:57+0000",
            "content": "Wait a minute - I'd argue that the default here should be false and we should change the code?\n\nAn example is that in Norwegian language, the word \"and\" means \"duck\", the word \"or\" means \"alder\" and \"not\" means \"seine\". The same may be true for many other languages, and requiring uppercase operators by default makes perfect sense. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13620805",
            "date": "2013-04-03T10:14:20+0000",
            "content": "Reopening awaiting further discussion "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13620814",
            "date": "2013-04-03T10:21:10+0000",
            "content": "Tested this with Solr3.5 and it seems the default has been \"true\" all the way. Although I have not hit concrete problems due to this I always thought it defaulted to false.\n\nAnyone else in favor of changing the default to \"false\" from v4.3? We could check luceneMatchVersion to keep old default for pre-4.3 solrconfigs... "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13620836",
            "date": "2013-04-03T10:59:58+0000",
            "content": "I think the documentation was wrong because it says that Solr does something when in reality it does a different thing, and it's not due to a bug. That's why I think the fix was to change the docs to reflects what Solr really does. \nThat said, I'm OK with changing the default for future versions, your comment on Norwegian language makes sense to me. If we do so, we should make sure that the documentation clearly says that up to 4.2 you get one behavior, and after that you get a different one.  "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13620865",
            "date": "2013-04-03T11:49:36+0000",
            "content": "up to 4.2 you get one behavior, and after that you get a different one\n\nHmmm... I would think that as a general proposition, intentional, incompatible behavior changes should be limited to major releases of trunk, and not to dot releases, where the expectation is that existing apps should still \"just work\" unless the issue is clearly a bug. In this case, sure, some people consider it a bug, but the reality is that they just don't like the default for some cases.\n\nSo, if you want to propose this \"improvement\" for trunk, 5.0, fine. But I don't think it is appropriate to change the rules of the road in a dot release - unless it is a compelling, global problem - which it doesn't appear to be. I mean, the subset of apps that do have an issue with this have a very simple workaround (set lowercaseOperators to false in \"defaults\" in their query request handler.)\n\nAnd to be clear, support for lower case operators is an intentional feature. Granted, not everyone agrees, now.\n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13620879",
            "date": "2013-04-03T12:18:00+0000",
            "content": "That's what luceneMatchVersion is for - if you upgrade solr.war without bumbing version in solrconfig, you get the \"old\" behavior. If you start from scratch or migrate your config bumping luceneMatchVersion, you do a conscious choice, and can adjust according to CHANGES.TXT.\n\nThus if the community feels this is a bad default we should not be afraid to rectify that now. Google.com enforces uppercase operators - probably because of user confusion and wrong results with lowercase - so why should we set the bar lower?\n\n+1 to change the default from true to false (don't care which version, 4.3 or 5.0)\n\nThis issue also touches SOLR-3580 which proposes to replace the lowercaseOperators param with a more flexible variant. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13620894",
            "date": "2013-04-03T12:58:37+0000",
            "content": "+1 to change the default from true to false\n\n+1 - might as well do it in 4.3. I think it's fairly clear that false is a better default. It's great that we offer both.\n "
        },
        {
            "author": "David Smiley",
            "id": "comment-13621038",
            "date": "2013-04-03T16:44:30+0000",
            "content": "+1 to change the default from true to false\n+1 "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13621080",
            "date": "2013-04-03T17:23:09+0000",
            "content": "-1 but... I won't strenuously resist the proposed change.\n\nIn some sense, it is a reasonable change - edismax is closer to the traditional Solr query parser.\n\nBut, in a larger sense, the original goal od edismax was to try to establish a new and higher bar of usability - the idea that you have to use upper case for keywords is a holdover from the crude old days of search. Sure, we have the option to disable this \"improvement\", but somehow the cultural knowledge of the motivation for that improvement seems to have gotten lost, and now people are retreating to the barbaric past of primitive search.\n\nAlso, the discussion has failed to note that the pf2 and pf3 parameters will actually include the operator keywords for phrase boosting. For example, a query for \"in and out or not\" (no quotes) will do boosting for \"in and out\", \"and out or\", and \"out or not\", so relevance will be quite decent - even or Norwegion text!\n\nSo, I don't see what significant downside the proposed change would fix, at the cost of defaulting to a more old-fashioned approach to search. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13621092",
            "date": "2013-04-03T17:38:58+0000",
            "content": "But, in a larger sense, the original goal od edismax was to try to establish a new and higher bar of usability\n\nRight - lowercase \"and\" and \"or\" were meant to be a natural language improvement (while not being that bad when used as literals instead of operators).  The current behavior is certainly not a bug and Tomas had the correct doc fix. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13621119",
            "date": "2013-04-03T17:59:40+0000",
            "content": "Right - lowercase \"and\" and \"or\" were meant to be a natural language improvement (while not being that bad when used as literals instead of operators). \n\nThat's why its a nice option.  The better default allows you to be explicit in this case. Guessing operators makes a much better option. "
        },
        {
            "author": "David Smiley",
            "id": "comment-14903047",
            "date": "2015-09-22T17:36:18+0000",
            "content": "This is an old conversation but I hit this today (from real user queries) and thought I'd offer my opinion.  Allowing lowercase operators, as it's currently implemented in edismax is trappy.  A user might type \"foo bar or baz\", and based on how edismax is implemented, \"foo\" will always be BooleanClause.Occur.SHOULD  ('mm' is ignored, 'q.op' is ignored).  I'd feel better about it if in this mode, the default operator was set to AND.  Nonetheless I think this feature is trappy; users don't necessarily know this syntax and it's implications. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14903313",
            "date": "2015-09-22T19:44:18+0000",
            "content": "The comment from David Smiley talks about implementation.  My opinion below is about the default setting.\n\nI think the default should be false.  There are plenty of situations where the word that gets turned into an operator is better suited as part of the query.  For example, \"q=peaches and cream\" is an example where \"and\" as a term can be extremely important to obtaining relevant results.  Depending on the content in the index, it can be a very different query than \"q=peaches AND cream\".  With the current default, you can only achieve the latter query, unless you do tricks like stick an escape in the operator:\n\n\nq=peaches an\\d cream\n\n\n\nLowercase operators is a feature that many people want, so it's a good thing that we have this setting.  In my opinion, enabling it by default is the wrong thing to do. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-14903508",
            "date": "2015-09-22T21:47:44+0000",
            "content": "lowercase \"and\" and \"or\" were meant to be a natural language improvement\nSetting a natural language \"improvement\" as default when it only works for english language content seems odd. For content in any other language, it won't work since we use other words for and/or, and instead you may get weird behavior. That is a bit too much magic for a default setting, so I still support a change to false as default. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16050156",
            "date": "2017-06-15T08:36:23+0000",
            "content": "Reviving this. The 7.0.0 release is an excellent timing to change the lowercaseOperators default from true to false! We'll only commit it to master. "
        },
        {
            "author": "David Smiley",
            "id": "comment-16050406",
            "date": "2017-06-15T12:27:27+0000",
            "content": "+1 Jan Høydahl!  Thanks for taking care of it. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16050471",
            "date": "2017-06-15T13:23:06+0000",
            "content": "Patch "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16051098",
            "date": "2017-06-15T21:35:42+0000",
            "content": "New patch that makes the default depend on luceneMatchVersion. I.e. we'll respect the old default if people bring over their configs without explicitly bumping version. "
        },
        {
            "author": "David Smiley",
            "id": "comment-16051336",
            "date": "2017-06-16T03:44:53+0000",
            "content": "+1 patch looks good. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16051595",
            "date": "2017-06-16T08:36:03+0000",
            "content": "Thanks for the review David!\n\nOops, just saw that I switched true and false in \"upgrading\" section of CHANGES.txt. New patch attached.\n\nI'll commit this in a few days. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-16055614",
            "date": "2017-06-20T11:39:48+0000",
            "content": "Commit 8648b005e28d24b7e18726502ae1ea5fffa44a5c in lucene-solr's branch refs/heads/master from Jan Høydahl\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=8648b00 ]\n\nSOLR-4646: eDismax lowercaseOperators now defaults to \"false\" for luceneMatchVersion >= 7.0.0 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-16055618",
            "date": "2017-06-20T11:41:41+0000",
            "content": "Commit 3bb8939afec6b6e26689de580ddc5311bd5f0680 in lucene-solr's branch refs/heads/master from Jan Høydahl\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=3bb8939 ]\n\nSOLR-4646: Add the word \"optionally\" to refGuide:\n\n\toptionally treats \"and\" and \"or\" as \"AND\" and \"OR\" in Lucene syntax mode.\n\n "
        }
    ]
}