{
    "id": "SOLR-4957",
    "title": "Audit format/plugin/markup problems in solr ref guide related to Confluence 5.x upgrade",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The Solr Ref guide donated by lucidworks is now live on the ASF's CWIKI instance of Confluence – but the CWIKI is in the process of being upgraded to confluence 5.x (INFRA-6406)\n\nWe need to audit the ref guide for markup/plugin/formatting problems that need to be fixed, but we should avoid making any major changes to try and address any problems like this until the Confluence 5.x upgrade is completed, since that process will involve the pages being \"converted\" to the newer wiki syntax at least twice, and may change the way some plugins work.\n\nWe'll use this issue as a place for people to track any formating/plugin porblems they see when browsing the wiki – please include the URL of the specific page(s) where problems are noticed, using relative anchors into individual page sections if possible, and a description of the problem seen.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13692491",
            "date": "2013-06-24T22:39:10+0000",
            "content": "Things i've noticed so far (some of which cassandra mentioned in advance in SOLR-4618) ...\n\n\n\tlink checker plugin isn't installed/working\n\t\n\t\thttps://cwiki.apache.org/confluence/display/solr/Internal+-+Link+Check\n\t\n\t\n\tUnable to render embedded object: File (external-link-grey-gradient02.png) not found.\n\t\n\t\tmany pages, example: https://cwiki.apache.org/confluence/display/solr/Installing+Solr#InstallingSolr-RelatedTopics\n\t\tlooks like a missing attachment from the root page, but may be a missing part of the theme?\n\t\tsince the ultimate goal is primarily a PDF export, we may just want to covert all of these to more explicit extenal links by showing the URL\n\t\n\t\n\tUnknown macro: \n{topofpage}\n\t\n\t\tmany pages, example: https://cwiki.apache.org/confluence/display/solr/Language+Analysis#LanguageAnalysis-KeyWordMarkerFilterFactory\n\t\n\t\n\n "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13693202",
            "date": "2013-06-25T17:51:40+0000",
            "content": "Comments about the specific problems found so far - there are other problems I'll add in other comments.\n\nlink checker plugin isn't installed/working \n\nThe page to check links needs two plugins to really use it:\n\n\tReporting Plugin. This is a free plugin in Confluence 3.5.x, but moves to a pay model in Confluence 4.x+. Once the Confluence upgrade is complete, this will stop working again until ASF infra figures out the licensing for it, if they intend to do that. It basically provides the structure of the page with page titles, links to pages, and the links on those pages that either pass/fail the link check.\n\tLink Validator Plugin: this is free, even after Confluence 4 & 5. However, the only thing it does on its own is check the link it's given. It's the reporting plugin that actually goes through all the pages to find the links to feed into the link validator. Without the reporting plugin, all links need to be fed into this plugin manually.\n\n\n\nThe report works OK - it's better than not having one at all, but it isn't perfect. It often reports links as bad or unknown when they work just fine, but I've only rarely seen it report a link as good that wasn't good. It checks all the links every time the page is loaded, so if people are hitting it often, I suspect that might cause a performance issue (not a major one for occasional use - but if 100s or 1000s of users are loading the page every day, I wouldn't be surprised to hear of a problem). In LucidWorks documentation, I hide the link check page to everyone but myself, so if those plugins are installed, page permissions should be set to a limited group.\n\nUnable to render embedded object: File (external-link-grey-gradient02.png) not found.\n\nBah, my fault. At one time I had a little icon next to links as an indicator that the link went somewhere other than another page of the Solr Ref Guide (like, the link went to the Solr Wiki). It didn't export well into PDF at all - it put the icon on it's own line instead of next to the link like it was supposed to - so I later decided to remove it. I thought I'd scrubbed the pages more thoroughly, but it looks like I didn't finish that before I exported. All you need to do is add the little icon to the root page for now. Or, to remove it entirely it's used exclusively in the Related Topics sections of the pages it appears on (i.e., I never used it in the middle of a paragraph, only in the lists of related links at the bottom of some pages).\n\nThe icon came from this site: http://www.shapes4free.com/vector-icons/external-link-icons/. I was going to upload the graphic here, but I checked the license and it said not to upload it to another website. However, the graphics are free to use without attribution or backlinks. Here is the full license: http://www.shapes4free.com/license/.\n\nUnknown macro: {topofpage}\n\nThat's a simple user macro that could be added. It adds HTML to the page to link back to the top of a page, which is helpful for very long pages. An alternative would be to just split those pages into smaller ones. Or, the macro could easily be replaced with HTML code in the page, but for me a macro is easier to use and remember. This one only works with the Documentation Theme, which is what the Solr Ref Guide is using now. \n\nIn Confluence 3.5.x, go to User Macros in the Confluence Admin. Enter a name, description, visibility to users, and what category it should appear in if someone is browsing through the macro browser. Then select \"No macro body\" under \"Macro Body Processing\", then HTML for \"Output Format\". In the Template section add '<p style=\"text-align:right\"><a href=\"#main\">Back to Top</a></p>'. Save and it's done.\n\nIn my tests, this converts fine with the upgrade to Confluence 4+ and the new storage format. Because the higher Confluence versions are storing pages in XHTML, and this is already HTML, there's no problem. The only thing that might need to be modified is to add a line before the HTML code that says '## @noparams'. I'm still learning these things in Confluence 4, but I believe that says the macro has no parameters for a user to respond to and is required for macros with no parameters.\n\nNote, if a different space theme is used, the href target in the HTML would need to be changed to '#content' instead of '#main'. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13693221",
            "date": "2013-06-25T18:11:25+0000",
            "content": "The Language Analysis (https://cwiki.apache.org/confluence/display/solr/Language+Analysis) page has two problems with it:\n\n\n\tMissing {topofpage} macro \n\nAs mentioned in prior comment that is a user macro that provides the HTML to link back to the top of long pages.\n\n\n\tMissing {unicode-text} macro \n\nThis is another User Macro that is only used on the Language Analysis page. It sets the font in the PDF export to a unicode font to properly render some of the more complex language examples on that page. At LucidWorks, our PDF font is Verdana, which does not properly render Arabic, Chinese, Japanese, Hindi, Persian and Thai. This macro sets a CSS class for those snippets of text that didn't render right, and the CSS for the PDF uses that class to set the font as Arial Unicode. If you use a Unicode font as the body for the whole PDF, you can remove the references to this macro. If you use an even less-unicode-compatible font than Verdana, you may need to expand the use of the macro.\n\nThis macro had problems in my test conversion to Confluence 4, but I have not yet had a chance to look at what the problems were or if they are easy to fix.\n\n "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13693304",
            "date": "2013-06-25T19:31:00+0000",
            "content": "The page https://cwiki.apache.org/confluence/display/solr/Client+API+Lineup looks fine now, but it contains a macro from a plugin that becomes for-fee after upgrade to Confluence 4+.  It's the 'table-plus' macro from the Tables Plugin, which provides advanced table options like row highlighting, column sorting, and auto-row-numbering, among other features. It doesn't serve a huge purpose there except to provide column sorting.\n\nIt's the only page I know of that uses that plugin. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13693449",
            "date": "2013-06-25T22:29:02+0000",
            "content": "Problems with https://cwiki.apache.org/confluence/display/solr/Uploading+Data+with+Index+Handlers\n\n\n\tContains missing 'topofpage' macro references\n\tAn example got munged and some text is being misinterpreted as italics and also as a macro call. This is right before the start of the section 'Updating Only Part of a Document'. The section should read:\n\n\n\n\nYou can also specify _version_ with each \"delete\":\nString str = \"{'delete':'id':50, '_version_':12345}\" \n\n\n\nBoth '_version_' and '{'delete':'id':50, '_version_':12345}' need to be fixed by escaping the wiki markup so it gets rendered the way it's supposed to.\n\nThere are a lot of places where I had to escape curly brackets - there might be a bunch of those lurking around. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13703564",
            "date": "2013-07-09T17:58:30+0000",
            "content": "i opened an issue with infra to find out if we can get the reporiting and linkvalidating plugins installed once the confluence upgrade is done ... if not, we can just purge that page. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13703684",
            "date": "2013-07-09T19:18:06+0000",
            "content": "Since it looks like the Solr 4.4 release is going to happen before the Confluence upgrade is finished, i'm going to press forward with trying to fix these markup problems as things stand. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13703797",
            "date": "2013-07-09T21:13:33+0000",
            "content": "Done...\n\n\n\tlink checker page: i added a note to the page that it won't work unless/until INFRA-6536 is resolved ... i'm not super worried about this since it's not part of the doc itself.\n\ttopofpage – i added the macro, works lik a charm\n\texternal-link-grey-gradient02.png – i just deleted this from all the affected pages\n\ttable-plus on Client+API+Lineup – i just removed this markup to save us headaches down the road (if it was used more extensively it might be worth trying to ask infra to buy & install it after the upgrade, but it really doesn't seem that useful since hte primary distrobution mechanism is going to be PDF.\n\tUploading+Data+with+Index+Handlers - fixed the code escaping.\n\n\n\nStill outstanding...\n\n\n\tunicode-text – Cassandra Targett can you please post the specifics of hte macro you used in the past so i can try it out?  (if it breaks after the confluence upgrade is done so be it, but i'd like to try and get it working now for the Solr 4.4 release)\n\n\n\n\n\nonce the unicode-text macro is added, i think we can go ahead and resolve this issue and move forward with having any problems discovered in the future reported either as new issues (for big general problems) or as comments on pages (for minor tweaks) "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13703813",
            "date": "2013-07-09T21:25:25+0000",
            "content": "Here is the definitions for the unicode-text macro:\n\nMacro Body Processing: Convert wiki markup to HTML\nOutput format: HTML\nTemplate: <p class=\"unicode-text\">$body</p>\n\nThis wraps the text in a class. The '$body' is there to insert whatever is on the page between the <p> tags.\n\nIn the CSS, this is defined:\n\n\np.unicode-text {\n   font-family: \"Arial Unicode\";\n}\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13704014",
            "date": "2013-07-09T23:45:47+0000",
            "content": "Thanks cassandra,\n\ni added the macro and the PDF CSS, but it still isn't working quite right in the PDF.  Since this is a PDF specific issue however, let's track it in SOLR-4886.\n\n\neverything else here seem to be done. "
        }
    ]
}