{
    "id": "SOLR-142",
    "title": "RawResponseWriter - replace /admin/get-file.jsp",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A RawResponseWriter writes a ContentStream directly to the response.\n\nThis is useful to spit back a file directly from solr.  This implementation looks for a response property named \"content\" and sends it to the client.  If it can't find one, it delegates the response to another ResponseWriter.\n\nAs an example, I added a GetAdminFileRequestHandler to replace /admin/get-file.jsp",
    "attachments": {
        "SOLR-142-RawResponseWriter.patch": "https://issues.apache.org/jira/secure/attachment/12350366/SOLR-142-RawResponseWriter.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-12470323",
            "date": "2007-02-05T19:33:37+0000",
            "content": "The RawResponseWriter is configured by default (just like JSON etc)\n\nOne could create it explicitly and specify what 'base' response writer it should use (JSON etc)\n\n <queryResponseWriter name=\"raw\" class=\"org.apache.solr.request.RawResponseWriter\">\n    <int name=\"base\">JSON</int>\n </queryResponseWriter> \n\n\n\t- - - - - -\n\n\n\nI added a GetAdminFileRequestHandler that is configured to use wt=raw by default.  I wanted to delete get-file.jsp, but it is needed to include:\n\n<jsp:include page=\"get-file.jsp?file=admin-extra.html&optional=y\" flush=\"true\"/>\n\n(which, by the way, spits out HTML in the middle of a table declaration)\n\n\n\t- - - - - - - -\n\n\n\nI deleted raw-schema.jsp that did not appear to be referenced by anything\n\n\n\t- - - -  - - -\n\n\n\nI could not help myself and added:  GetSystemPropertiesRequestHandler and deleted get-properties.jsp.  Unlike get-properties.jsp, GetSystemPropertiesRequestHandler  spits back properties formatted by the selected ResponseWriter.  It also added the ability to get a single property "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12470729",
            "date": "2007-02-06T20:26:32+0000",
            "content": "Ryan, i really like the idea of a RawResponseWriter, and your GetAdminFileRequestHandler ... for a hwile now i've been thinking that it would be good to change the admin/gettableFiles section of hte solrconfig so that...\n\n\tfiles could have a default content-type specified\n\tdirecotries could be listed (with a content-type to assume for all files in that directory)\n...and then replace get-file.jsp with a servlet that used the extra path info to find the filename, and supported query args to override the default content-type with text/plain\n\n\n\nmy motivation being to help with things like SOLR-75 where we sometimes need the schema as XML, but othertimes we want to return it as plain text ... and to let the XmlResponseWriter start supporting useful params telling it what stylesheet from the xslt directory to include in the response (for client site styling using a stylesheet served from the solr server)\n\n – but i like your idea of a RequestHandler/ResponseWriter better.\n\nwe should consier deprecating admin/gettableFiles completley, and moving the info about what file are gettable directly into the init params for the GetAdminFileRequestHandler (where it can also support the content-type/direcotry stuff that i described)\n\nin that case, we'd need to leave get-files.jsp where it is, so something still supports the legacy admin/gettableFiles list of files. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12471426",
            "date": "2007-02-08T18:28:03+0000",
            "content": "Posted an update to this patch.  It may be getting away from my original goal to get a RawRequestHandler committed soon... but oh well.\n\nThis adds RequestHandlers for a bunch of admin thing that could (should) be spit back in the standard response writer format.\n\nsome urls to check:\n\nhttp://localhost:8983/solr/admin/file\nhttp://localhost:8983/solr/admin/file?file=protwords.txt\nhttp://localhost:8983/solr/admin/file?file=schema.xml\nhttp://localhost:8983/solr/admin/file?file=schema.xml&txt=true\nhttp://localhost:8983/solr/admin/threads\nhttp://localhost:8983/solr/admin/registry\nhttp://localhost:8983/solr/admin/registry?wt=json&indent=true\nhttp://localhost:8983/solr/admin/stats\nhttp://localhost:8983/solr/admin/ping\nhttp://localhost:8983/solr/admin/properties\nhttp://localhost:8983/solr/admin/properties?name=java.home\nhttp://localhost:8983/solr/admin/logging\nhttp://localhost:8983/solr/admin/logging?set=FINE\n\nTo get these to display nicely, we would need an xls file and link to:\nhttp://localhost:8983/solr/admin/stats?stylesheet=admin.xls\n\nI like this direction because it moves solr away from the need for a JDK, removes a bunch of code from jsp scriptlets, and makes the admin info easily available to clients through JSON/xml etc. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12473581",
            "date": "2007-02-16T01:31:21+0000",
            "content": "this version of the patch is only the RawResponseWriter.  I am moving all the admin changes to SOLR-162.  For an example of the RawResponseWriter in use, see that patch. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12474322",
            "date": "2007-02-20T00:39:25+0000",
            "content": "revised version of Ryan's latest patch – just adds some documentation.\n\nthe patch is nice and clean and simple – but without anything illustrating it's use i'm hesitent to commit it.\n\n(i know a lot of the previous code in this issue got migrated to SOLR-162, but perhaps at least the GetAdminFileRequestHandler should be part of this patch so the basic functionality for getting a file and writing it's raw stream is commited all at once. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12474328",
            "date": "2007-02-20T01:24:45+0000",
            "content": "Thanks for looking at that.  Here is an updated version that includes GetAdminFileRequestHandler.java from SOLR-162\n\nThis patch also deletes /admin/get-file.jsp and changes to /admin/index.jsp that point to this handler.  That is good because it moves away from some ugly jsp scriptlet code - it is bad because if someone just updates the .war file without updating solrconfig.xml they will get a 404.  \n\nYou make the call on what part is appropriate to add at this time.  \n\nthanks\nryan\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12492410",
            "date": "2007-04-27T22:09:53+0000",
            "content": "I still haven't looked at Ryan's latest patch on this issue (from Feb!) but if the only issue is that /admin/get-file.jsp has been deleted so links on the admin screen won't work because they assume the new handler, then maybe the best way to solve this is:\n\n1) change the admin.jsp screen not to include links to either get-file.jsp or the new GetFile handler by default (a good idea since people might want to change the name of the handler) but if a gettableFiles section exists in the solrconfig, continue to link to get-files.jsp\n2) document in the CHANGES recommending that people use the new GetFile handler and add links to it in an admin-extras.html file (since only they know which handler name they used)\n3) makr get-files.jsp as heavily deprecated (so we can eventually get rid of it) and make it delegate to an anonymous on the fly created instance of the GetFile handler. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12492592",
            "date": "2007-04-29T19:17:54+0000",
            "content": "I think the best thing to do now is split this into two issues:  \n\n1. just the RawResponseWriter and the GetFile handler.  (you did review this way back in feb!)\n2. Update the admin .jsp to use the new handlers wherever possible and provide a path to support path based request handlers going forward "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12554604",
            "date": "2007-12-27T19:45:25+0000",
            "content": "resurrecting an old patch from February.  This uses the request handler framework to return raw admin files. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12554610",
            "date": "2007-12-27T21:13:24+0000",
            "content": "The ShowFileRequestHander should be added to the standard /admin request handlers in SOLR-447 "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12554937",
            "date": "2007-12-29T18:12:53+0000",
            "content": "Updated so that SOLR-447 AdminHandler automatically registers the ShowFile handler "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12627165",
            "date": "2008-08-30T00:00:10+0000",
            "content": "adding some linked issues for posterity. "
        }
    ]
}