{
    "id": "SOLR-3239",
    "title": "DocTransformer for formatting CurrencyField as a virtual field",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "With the new CurrencyField from SOLR-2202, we can now do range queries, sort and soon faceting on CurrencyField.\n\nOne thing we cannot do is return a converted value. We can only return the stored value which must be in the same currency as it was entered, e.g. \"10.0,USD\". People now have to do this conversion in application layer, reading the same currency.xml file as in Solr. This is a mess to keep in sync, and is hard to support with other ExchangeRateProviders or in other client languages than Java.\n\nThis patch should implement a Function which takes a field name and requested currency as input and returns the converted value. Optionally it could also take care of localized display, e.g. \"$10.0\" instead of \"10.0,USD\". Proposed syntax:\n\n\n&fl=title,price:currency(price_c,EUR)         # Returns price_c in EUR as \"price\"\n&fl=title,price:currency(price_c,EUR,en_US)   # Returns price_c in EUR, formatted according to en_US locale",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13228356",
            "date": "2012-03-13T12:34:33+0000",
            "content": "A special case would be that you want only formatting, not conversion. Perhaps that could be done with an empty or \"null\" value for currency?\n\n&fl=title,price:currency(price_c,,en_US)   # Returns price_c, formatted according to en_US locale\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13228403",
            "date": "2012-03-13T14:12:42+0000",
            "content": "Nice idea using a function here! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13510157",
            "date": "2012-12-05T00:10:33+0000",
            "content": "A special case would be that you want only formatting, not conversion.\n\nI'm not sure if that's a good idea ... it's tempting to look at your examples and think it should be the original currency, but what about when it's wrapped in another function?\n\nThis comes up because of some of the questions in SOLR-4138 – I think it would make a lot of sense if \"currency(price_c)\" returned the \"human\" value of the price_c field in the default currency, (ie: \"5.5\" if the indexed value is equivalent to \"5.5,USD\") regardless of which currency was used when the doc was indexed.  That way you could do things like \"sum(currency(price_field),prod($ship_cost,weight_field))\" and get comparable values across all documents regardless of the currency used in each document.\n\nit might make more sense to have a \"currency(...)\" function that explicitly deals with the conversion of different currencies, and then have an independent [currencyft] DocTransformer for dealing with the locale based formatting of currency.  We'd get the \"currency conversion as input to other functions\" benefit i described above independently from the need to format; and you could have the \"format currencies in locale\" benefit independently of whether someone actually used CurrencyField\n\nnot to mention then you cold wrap the formating around some complex function that involved the currency values...\n\n\n?q=foo\n// uses default currency for consistency of value comparisons\n&total_price=sum(currency(price_field),prod($ship_cost,weight_field))\n&sort=$total_price+asc\n// fmt overrides default currency to be users currency\n&fl=id,[currencyfmt v=$total_price currency=GBP locale=en_us]\n\n\n\n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13558442",
            "date": "2013-01-20T23:52:09+0000",
            "content": "It makes sense to separate conversion and formatting, like you propose. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13592987",
            "date": "2013-03-05T02:56:10+0000",
            "content": "FYI: SOLR-4138 added a currency(...) function like the one i proposed.  the only thing left is a DocTransformer for arbitrary currency formatting. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717326",
            "date": "2013-07-23T18:47:52+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971082",
            "date": "2014-04-16T12:57:06+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}