{
    "id": "SOLR-1426",
    "title": "Allow delta-import to run continously until aborted",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Modify the delta-import so that it takes a perpetual flag that makes it run continuously until its aborted.\n\nhttp://localhost:8985/solr/select/?command=delta-import&clean=false&qt=/dataimport&commit=true&perpetual=true\n\nperpetual means the delta import will keep running and pause for a few seconds when running queries.\n\nThe only way to stop delta import will be to explicitly issue an abort like so:-\n\nhttp://localhost:8985/solr/tickets/select/?command=abort",
    "attachments": {
        "delta-import-perpetual.patch": "https://issues.apache.org/jira/secure/attachment/12419343/delta-import-perpetual.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Abdul Chaudhry",
            "id": "comment-12754363",
            "date": "2009-09-11T21:40:28+0000",
            "content": "Uploaded a patch that implements this feature.\n\nRan all unit tests on my tree and they pass.\n\nThe only thing I have hard-coded is the sleep interval which is :-\nThread.sleep(3000)\n\nThis should probably be configurable. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12754497",
            "date": "2009-09-12T09:13:29+0000",
            "content": "isn't it easily achieved by a cron job which continuously fires a delta-import?\n\nis this a common enough usecase which requires to make it a part of DIH\n\nanyway I shall move it to 1.5 , because we are only doing ug-fixes for 1.4 now "
        },
        {
            "author": "Abdul Chaudhry",
            "id": "comment-12754816",
            "date": "2009-09-14T03:46:39+0000",
            "content": "You can run a crontab every minute but I need near real-time changes mirrored from a set of tables in a database to a search index. \n\nYou should be aware that Lucene 2.9 includes what it calls near realtime search capabilities and if you include these into solr 1.4 then the use case for delta-import will probably change from running every few hours and minutes (which is probably what you are used to right now) and quickly move to running every few seconds.  In that case running a crontab every minute is too long to wait and writing a script to call curl every few seconds will seem like an excessive use of system resources.\n\nSo, in answer to your question, it's probably is not a common use case now but with lucene 2.9 it will become a common use case.\n\nAnyway, Its your call - take it or leave it.\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12754823",
            "date": "2009-09-14T04:57:49+0000",
            "content": "I am not agiuanst the idea itself. I am just calling for a consensus. This can be something we can consider.\nThere are a few things to consider.\n\n\tthe time interval as you mentioned ,\n\tThere should be a way to stop any perpetual operation (without aborting the existing one)\n\tit should not be just for one command .It should be independent of the command name\n\n "
        },
        {
            "author": "Abdul Chaudhry",
            "id": "comment-12755077",
            "date": "2009-09-14T16:56:38+0000",
            "content": "The perpetual option only makes sense for one command; that is the delta-import command. I could not see a compelling use case for using perpetual with any other command.\n\nThe abort should stop any in-flight delta-import which is the current behaviour with the patch.\n\nThe sleep interval should be set using something like \"perpetual.delay\" and default to a reasonable value such as 3 secs. "
        },
        {
            "author": "Abdul Chaudhry",
            "id": "comment-12761289",
            "date": "2009-10-01T18:12:13+0000",
            "content": "NOTE: the last_index_time is broken with the perpetual patch\n\nI hacked around this by changing the data-config.xml file for the deltaQuery to do something like this:-\n\nWHERE updated_at > DATE_SUB('${dataimporter.last_index_time}',INTERVAL 10 SECOND)\n\nThis is because of the time discrepancy between the sleep and the writers last_index_time.\n\nHowever, it looks like the delta-import is broken in the latest build of solr trunk revision 820731. It looks like the lastIndexTime in the DataImporter is not populated after a delta and so if you used ${dataimporter.last_index_time} then the deltaQuery uses the wrong time. \n\nI am going to wait until delta-import is fixed before I update a patch. "
        },
        {
            "author": "Abdul Chaudhry",
            "id": "comment-12761300",
            "date": "2009-10-01T18:52:00+0000",
            "content": "The SOLR-783 fix seems to force you to use the entity name with the last_index_time\n\nMy fix for this was to change the deltaQuery like so :-\n\nWHERE updated_at > DATE_SUB('${dataimporter.[name of entity].last_index_time}',INTERVAL 10 SECOND)\n "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12761469",
            "date": "2009-10-02T04:26:05+0000",
            "content": "${dataimporter.last_index_time} also should work  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872459",
            "date": "2010-05-27T22:05:44+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043751",
            "date": "2011-06-03T16:46:53+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106293",
            "date": "2011-09-16T14:50:25+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412076",
            "date": "2012-07-11T22:25:56+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429751",
            "date": "2012-08-07T03:42:42+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445558",
            "date": "2012-08-31T01:28:21+0000",
            "content": "\n\tThere is no indication that anyone is actively working on this issue, so removing 4.0 from the fixVersion.\n\tAssigning in hopes he can assess the current patch to possible revisit the issue\n\n "
        },
        {
            "author": "James Dyer",
            "id": "comment-13446007",
            "date": "2012-08-31T14:43:27+0000",
            "content": "This sort of thing is needed for sure, especially now that we have such good NRT support in 4.0.  But the patch here is shortsighted as it works only with the delta import command (you can do incremental updates with \"full-import\" ; often its the better choice).  I'm also not sure I like the approach of putting the DIH handler thread in a perpetual loop and having it sleep a few seconds in between each iteration.  \n\nUnless someone objects, I want to mark this as \"won't fix/duplicate\" and I think we need to work on SOLR-2305 or something like it instead. "
        },
        {
            "author": "Abdul Chaudhry",
            "id": "comment-13446398",
            "date": "2012-08-31T21:35:14+0000",
            "content": "I would avoid using the DIH for incremental updates. You need to be careful synchronizing with an eventually consistent database. I would go to the 'source' that manages the updates/inserts before they even get to the database and push to SOLR from the source. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13447722",
            "date": "2012-09-04T14:32:02+0000",
            "content": "Closing for now as this doesn't seem like the best approach to handling NRT with DIH.  Can be reopened if someone wants to pursue this again. "
        }
    ]
}