{
    "id": "SOLR-2607",
    "title": "Clean up /client directory",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "clients - java",
            "clients - ruby - flare"
        ],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The /clients directory is a bit of a mess.  The only actively maintained client SolrJ is actually in the /dist directory!   The other clients that used to be in here, /php and /javascript (I think!) have been moved.  The only one is /ruby, and it isn't actively maintained the way other ruby clients are.\n\nI'd recommend just removing the /clients directory since it's very confusing to a new user who would logically go here to find clients, and only find a ruby one!  It would also let us slim down the size of the download.\n\nAlterntively if we want the /clients directory, then lets copy over the solrj lib to this dir instead of /dist\n\nI am happy to submit a patch if this makes sense.",
    "attachments": {
        "SOLR-2607.patch": "https://issues.apache.org/jira/secure/attachment/12515507/SOLR-2607.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13155035",
            "date": "2011-11-22T11:44:03+0000",
            "content": "+1 I saw this earlier but just thought about it again when reviewing the 3.5.0 RC. I'd say get rid of /client altogether "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13155188",
            "date": "2011-11-22T14:58:21+0000",
            "content": "I'll take this one... since I'm the culprit littering /clients now.  I'm going to move solr-ruby and flare over to my github account.  solr-ruby will be entirely deprecated in favor of RSolr, and I'll be moving the remaining goodies from solr-ruby (Mapper and Indexer, both very handy features not found elsewhere) into RSolr.\n\nI'll aim to tackle this before years-end over holiday breaks. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13155226",
            "date": "2011-11-22T16:08:35+0000",
            "content": "I went ahead and took care of this on trunk.  svn exported to https://github.com/erikhatcher/solr-ruby-flare.\n\nRIP solr-ruby and flare.  Long live Flare!\n\nFor future reference, if you're using solr-ruby, consider switching to RSolr - http://rubygems.org/gems/rsolr\n\nFlare was the precursor prototype that morphed into the popular Blacklight framework - http://projectblacklight.org "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13155227",
            "date": "2011-11-22T16:10:24+0000",
            "content": "going to re-open... we may want to also remove client/ fully?  It's nice to have the pointer to the wiki though.  Thoughts? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13156334",
            "date": "2011-11-23T22:14:06+0000",
            "content": "I'd say kill client/ and add a paragraph in README.TXT about clients with a link to Wiki. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13213113",
            "date": "2012-02-21T23:43:10+0000",
            "content": "Attached patch removes clients folder and adds two lines to README. Waddaya think, time to resolve this issue? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13213609",
            "date": "2012-02-22T13:30:31+0000",
            "content": "Thanks Jan, committed. "
        }
    ]
}