{
    "id": "SOLR-11284",
    "title": "Distributed searches with the shards parameter does not work with collection alias",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "When \"shards\" parameter is used for a collection alias solr gives an error  \"msg\":\"no servers hosting shard: \" even if the shard is present. If i use the alias for only 1 collection it works as it expected, but when i add extra collection to the alias it does not work gives the error above. Solr version is 6.1.0.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-08-25T00:41:12+0000",
            "content": "We need a lot more information to possibly try to reproduce this. Exactly what are you specifying for \"shards\"? What are your alias definitions? Imagine you were given this problem description and asked to fix it. How would you possibly know how to reproduce it?\n\nSecond, please raise issues on the user's list before raising a JIRA to determine whether this is a usage issue or a real bug. ",
            "author": "Erick Erickson",
            "id": "comment-16140996"
        },
        {
            "date": "2017-08-25T06:53:19+0000",
            "content": "Sorry for inconvenience, i searched the bug list and did not find any related so decided to create an issue here  \n\nHere are the details : \n\nI have collections according to year for my data which are divided into shards according to months. (e.g collection name col_2013, shards -> 201301,201302,...,201312 / col_2014 -> 201401, 201402, 201403 etc.)\n\nFor all collections i created an alias to dynamically manage my data. (e.g col_arc -> colr_2013, col_2014, col_2015, col_2016)\n\nWhen i query my data with adding \"shards\" parameter for routing requests to specific shards (since i have lots of shards each contain huge amount of data) solr raises the error mentioned above. If alias points to only 1 collection, it behaves as it is expected. (no excepiton raised, the request is routed to given shards)\n\nhttp://localhost:8983/solr/col_arc/select?indent=on&q=*:*&wt=json&shards=201301,201302,201303\n\n{\n  \"responseHeader\":{\n    \"zkConnected\":true,\n    \"status\":503,\n    \"QTime\":19,\n    \"params\":{\n      \"q\":\":\",\n      \"shards\":\"201301,201302,201303\",\n      \"indent\":\"on\",\n      \"wt\":\"json\"}},\n  \"error\":{\n    \"metadata\":[\n      \"error-class\",\"org.apache.solr.common.SolrException\",\n      \"root-error-class\",\"org.apache.solr.common.SolrException\"],\n    \"msg\":\"no servers hosting shard: \",\n    \"code\":503}} ",
            "author": "omer aygun",
            "id": "comment-16141289"
        }
    ]
}