{
    "id": "SOLR-8943",
    "title": "Solr tutorial can give errors when indexing techproduct data depending on what user has already indexed",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "http://lucene.apache.org/solr/quickstart.html currently says...\n\n\nSolr's install includes a handful of Solr XML formatted files with example data (mostly mocked tech product data). NOTE: This tech product data has a more domain-specific configuration, including schema and browse UI. The bin/solr script includes built-in support for this by running bin/solr start -e techproducts which not only starts Solr but also then indexes this data too (be sure to bin/solr stop -all before trying it out). However, the example below assumes Solr was started with bin/solr start -e cloud to stay consistent with all examples on this page, and thus the collection used is \"gettingstarted\", not \"techproducts\".\n\nBut the assumption at the end of this paragraph – that the sample techproduct documents can be added to the existing gettingstarted collection – is fundementally flawed based on how the early sections of the tutorial are written.\n\nWith a completley clean, unused, empty gettingstarted demo collection, bin/post -c gettingstarted example/exampledocs/*.xml does work (on master anyway) but if you have been following along with teh tutorial you don't have a completley empty gettingstarted collection – you will already have at a minimum the files in \"docs\", but also the user has been enocuraged to index arbitrary files from their computer...\n\n\nIndexing a directory of \"rich\" files\n...\nbin/post -c gettingstarted docs/\n...\nTo index your own data, re-run the directory indexing command pointed to your own directory of documents. For example, on a Mac instead of docs/ try ~/Documents/ or ~/Desktop/ ...\n\n...once the user has done that, it is not safe to assume that the techproduct sample documents can definitely be imported cleanly",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-04T18:18:01+0000",
            "author": "Hoss Man",
            "content": "something needs to change here ... perhaps add a section on explicitly creating collections (a sorely lacking bit of info in the tutorial anyway) and skip the introduction of the techproducts sample data until after that happens? ",
            "id": "comment-15224716"
        },
        {
            "date": "2017-10-05T14:39:04+0000",
            "author": "Cassandra Targett",
            "content": "This is fixed (IMO) by the redesign of the tutorial done in SOLR-10842. ",
            "id": "comment-16192958"
        }
    ]
}