{
    "id": "SOLR-2991",
    "title": "In 3X, <lockType/> not used consistently in all places Directory objects are instantiated",
    "details": {
        "affect_versions": "3.1,                                            3.2,                                            3.3,                                            3.4,                                            3.5,                                            3.6,                                            3.6.1",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "nipunb noted on the mailing list then when configuring solr to use an alternate <lockType/> (ie: simple) the stats for the SolrIndexSearcher list NativeFSLockFactory being used by the Directory.\n\nThe problem seems to be that SolrIndexConfig is not consulted when constructing Directory objects used for IndexReader (it's only used by SolrIndexWriter)\nI don't think this is a problem in most cases since the IndexReaders should all be readOnly in the core solr code) but plugins could attempt to use them in other ways.  In general it seems like a really bad bug waiting to happen.",
    "attachments": {
        "SOLR-2991.patch": "https://issues.apache.org/jira/secure/attachment/12586174/SOLR-2991.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13237082",
            "date": "2012-03-23T20:31:42+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412193",
            "date": "2012-07-11T22:26:18+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429794",
            "date": "2012-08-07T03:43:06+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451079",
            "date": "2012-09-07T22:30:37+0000",
            "content": "removing fixVersion=4.0 since the entire point of this issue is that it was spun off from SOLR-2654 where the underlying bug was already fixed in the 4.x branch.\n\nthis issue remains open should someone choose to tackle it on the 3x branch "
        },
        {
            "author": "Alexander Kanarsky",
            "id": "comment-13675252",
            "date": "2013-06-04T21:12:34+0000",
            "content": "While I agree that this is a minor issue since the index readers/searchers should not be directly using lock factory set, it makes sense to have a consistent lock types between readers and writers. Proposed patch seems to fix the problem, it just ensures the proper lock factory is set after the opening of the Directory. I reused the static method in SolrIndexWriter, but since the method does not really belongs to the SolrIndexWriter it could be shared between readers and writers. "
        }
    ]
}