{
    "id": "SOLR-8538",
    "title": "Kerberos ticket is not renewed automatically when storing index on secured HDFS",
    "details": {
        "components": [
            "Hadoop Integration",
            "hdfs",
            "security"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "It seems that when Solr is configured to stores its index files on a Kerberized HDFS, there is no built in mechanism by which Solr will renew its Kerberos ticket before it expires.\n\nThe impact is that after the default ticket lifetime has elapsed (typically 24 hours) Solr becomes unable to connect to HDFS to read/write and requires a restart or a manual kinit command to be run.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-19T15:43:06+0000",
            "author": "Andrew Bumstead",
            "content": "It turns out this is an effect of HADOOP-10786, which impacted automatic re-login on certain versions of JDK. This has been fixed as of Hadoop 2.6.1, 2.7.0.\nA work around for those affected is to run Solr with JDK 1.7.0_79. ",
            "id": "comment-15106887"
        },
        {
            "date": "2016-01-19T17:18:44+0000",
            "author": "Erick Erickson",
            "content": "Thanks for letting us know what the resolution was! ",
            "id": "comment-15107033"
        },
        {
            "date": "2016-12-13T19:49:29+0000",
            "author": "Kevin Risden",
            "content": "Just want to add a note here in case anyone else stumbles across this:\n\nThe Kerberos ticket renewal issue is fixed as stated above in Hadoop 2.6.1 and 2.7.0. Solr 6.2.0 updated to Hadoop 2.7.2 dependencies. As far as I can tell, if you are using > JDK 1.7.9_79 or JDK 1.8, Solr <6.2.0, and want to store indices on Kerberized HDFS then you need to use Hadoop 2.6.1+ dependencies otherwise you will most likely get ticket renewal issues after some time (usually 24 hours). ",
            "id": "comment-15746074"
        },
        {
            "date": "2016-12-15T23:09:13+0000",
            "author": "Kevin Risden",
            "content": "The related HWX community post: https://community.hortonworks.com/questions/9394/kerberos-ticket-isnt-being-renewed-by-solr-when-st.html ",
            "id": "comment-15752795"
        }
    ]
}