{
    "id": "SOLR-12746",
    "title": "Ref Guide HTML output should adhere to more standard HTML5",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.6",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Done",
        "status": "Resolved"
    },
    "description": "The default HTML produced by Jekyll/Asciidoctor adds a lot of extra <div> tags to the content which break up our content into very small chunks. This is acceptable to a casual website reader as far as it goes, but any Reader view in a browser or another type of content extraction system that uses a similar \"readability\" scoring algorithm is going to either miss a lot of content or fail to display the page entirely.\n\nTo see what I mean, take a page like https://lucene.apache.org/solr/guide/7_4/language-analysis.html and enable Reader View in your browser (I used Firefox; Steve Rowe told me offline Safari would not even offer the option on the page for him). You will notice a lot of missing content. It's almost like someone selected sentences at random.\n\nAsciidoctor has a long-standing issue to provide a better more semantic-oriented HTML5 output, but it has not been resolved yet: https://github.com/asciidoctor/asciidoctor/issues/242\n\nAsciidoctor does provide a way to override the default output templates by providing your own in Slim, HAML, ERB or any other template language supported by Tilt (none of which I know yet). There are some samples available via the Asciidoctor project which we can borrow, but it's otherwise unknown as of yet what parts of the output are causing the worst of the problems. This issue is to explore how to fix it to improve this part of the HTML reading experience.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-09-05T21:14:25+0000",
            "content": "There is a project to add a new HTML5 backend (aka output format) for Asciidoctor: https://github.com/jirutka/asciidoctor-html5s/ that in theory would only require us to add a new Ruby gem to the requirements to build. I experimented with this briefly but was not able to get it to work properly with Jekyll and our build processes. I manually copied in the templates it uses and got an error that it did not know what to do with some of our content, so my assessment is that this project isn't yet ready for complex docs like ours. ",
            "author": "Cassandra Targett",
            "id": "comment-16604960"
        },
        {
            "date": "2018-09-05T21:16:46+0000",
            "content": "There is also a sample library of custom backends provided by the Asciidoctor project: https://github.com/asciidoctor/asciidoctor-backends. However, the README says it only supports Slim v2.x (the project is now on v3.x), so these may be out of date. Many of the provided sample output formats have also been supplanted by other projects so it's possible these have not been kept up to date. ",
            "author": "Cassandra Targett",
            "id": "comment-16604963"
        },
        {
            "date": "2018-09-05T21:19:30+0000",
            "content": "And, a little bit more about how Readability works in FF - it's assumed Safari, etc., work similarly:\n\n\n\tComment to a StackOverflow question about how FF's Reader View works: https://stackoverflow.com/questions/30661650/how-does-firefox-reader-view-operate/30688312#30688312\n\tThe GitHub repo for FF's Readability algorithm: https://github.com/mozilla/readability\n\n ",
            "author": "Cassandra Targett",
            "id": "comment-16604966"
        },
        {
            "date": "2018-09-20T17:54:52+0000",
            "content": "There is now a branch for this work, that is getting close to being ready to merge: https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=tree;h=refs/heads/jira/solr-12746;hb=refs/heads/jira/solr-12746\n\nSome info:\n\n\tThese changes require us to add a new _templates directory to direct Asciidoctor to use different selectors and classes when building the HTML. I started out with templates from https://github.com/jirutka/asciidoctor-html5s, but modified them in many ways to change their classnames to the ones we were already using to simplify the process of fixing our CSS files.\n\t\n\t\tI have not yet dug into adding license info to Solr for use of these (or if I even need to since we aren't distributing the templates themselves), but the project uses the MIT license so it should be fine whatever we end up needing to do (TODO).\n\t\n\t\n\tThe Liquid templates used by Jekyll are still there, and have been modified to use <nav> and <article> tags instead of divs to identify the sections of the page that are content vs navigational elements.\n\tI tried to simplify some of the layers of divs, but there's possibly more that could be done. For example, for a paragraph there used to be about 6 nested divs, like: column > post-content > main-content > sect1 > sectionbody > paragraph > p, but now it's closer to: column > content > sect1 > p.\n\tI threw in some other CSS changes for stuff that has been bugging me - specifically the padding of 2nd level bullets in the in-page TOC, and changing the 2nd level bullets to use an open circle instead of \"-\".\n\n\n\nCaveats:\n\n\tThe templates require that you have Slim installed locally in order to build the HTML. I've added instructions for this to solr-ref-guide/README.txt in the branch, but have not updated the Jenkins build script yet (TODO).\n\tThere is an error output by the Slim engine (Slim::Engine: Option :asciidoc is invalid) during the HTML build for every template (so, 30+ times). I suspect it's related to a part of our Jekyll config that we have to have. There is supposedly some way to declare to Slim that it should ignore this, but I haven't yet been able to figure it out yet. I also asked about it on the Asciidoctor mailing list, but have not yet had a reply (TODO).\n\n ",
            "author": "Cassandra Targett",
            "id": "comment-16622419"
        },
        {
            "date": "2018-10-18T21:13:00+0000",
            "content": "Based on feedback I got from the Asciidoctor community, this error I mentioned as the #2 caveat earlier:\n\nThere is an error output by the Slim engine (Slim::Engine: Option :asciidoc is invalid) during the HTML build for every template (so, 30+ times).\n\nis resolved by downgrading the Slim version to v3.0 instead of 4.0.1 which I'd installed as the latest since the templates didn't specify any specific version. I don't think we care about the Slim version, so I can update the README and Jenkins scripts to force this version and we can call that problem resolved.\n\nI found some more CSS changes to fix & still a TODO or two I'd mentioned earlier, so I'll update the branch with these changes as soon as I can (next week). ",
            "author": "Cassandra Targett",
            "id": "comment-16655875"
        },
        {
            "date": "2018-10-23T00:20:57+0000",
            "content": "I've now updated the jira/solr-12746 branch to master as of last night, and added a couple more CSS fixes, added a license reference to NOTICE.txt [1], and updated the README and dev-tools/scripts/jenkins.build.sh scripts for the proper Slim version as mentioned in the earlier comment [2].\n\nAlexandre Rafalovitch, I think you were interested in this issue last week?\n\nI think this is ready to go. I'll check it out a bit more before committing - thoughts/reviews are welcome.\n\n[1] - I'm not sure if I really needed to include the license for 3 reasons: 1) we aren't distributing the templates at all, just the output of the templates; 2) I borrowed only the templates while the project they are from includes much more; and 3) I also modified the templates to make integration easier, so they aren't the same as the originals. Out of abundance of caution and respect for the original author I included a mention in NOTICE.txt anyway.\n\n[2] - The need to define the Slim version is temporary. After I mentioned to the Asciidoctor project that I had the problem and that downgrading Slim fixed it, they were able to identify the Slim API changes in Slim's v4.0 release that caused the problem. Asciidoctor's future 1.5.8 release (which we'll consume in some way, eventually) will include the fix. This is the issue that has the fix: https://github.com/asciidoctor/asciidoctor/issues/2928. The error is harmless, just alarming, so if anyone is using Slim 4.x and sees the error, they can continue without any problems. Downgrading just allows us to avoid having to see it 30+ times for every HTML build. ",
            "author": "Cassandra Targett",
            "id": "comment-16659870"
        },
        {
            "date": "2018-10-29T20:08:45+0000",
            "content": "I can't find anything else that needs to be fixed in this right now - perhaps will find things later, but there's nothing really glaring that's wrong. I'm going to commit this tomorrow if there aren't any comments or objections. ",
            "author": "Cassandra Targett",
            "id": "comment-16667686"
        },
        {
            "date": "2018-10-30T02:34:35+0000",
            "content": "I tried to get this to work (ant clean build-site) but was not able to.\n\nFirst, it was missing a gem, but I was able to progress by installing asciidoctor-html5s. Except it was refusing to install with normal command, I had to use:\n\nsudo gem install asciidoctor-html5s --pre\n\n \n\nThen it was failing with conversion error on 'field-type-definitions-and-properties.adoc' due to 'Could not find a converter to handle transform: empty'.\n\n \n\n-build-site:\n [echo] Running Jekyll...\n [exec] Configuration file: /home/arafalov/Solr/solr-12746/solr/build/solr-ref-guide/content/_config.yml\n [exec] Source: /home/arafalov/Solr/solr-12746/solr/build/solr-ref-guide/content\n [exec] Destination: ../html-site\n [exec] Incremental build: disabled. Enable with --incremental\n [exec] Generating... Deprecation: The 'gems' configuration option has been renamed to 'plugins'. Please update your config file accordingly.\n [exec] \n [exec] jekyll 3.5.0 | Error: Could not find a converter to handle transform: empty\n [exec] Conversion error: Jekyll::AsciiDoc::Converter encountered an error while converting 'field-type-definitions-and-properties.adoc':\n [exec] Could not find a converter to handle transform: empty\n [exec] Result: 1\nbuild-site:\n [java] Exception in thread \"main\" java.lang.NullPointerException\n [java] at CheckLinksAndAnchors.main(CheckLinksAndAnchors.java:156)\n\n\n \n\n \n\nI was not able to get past that. I am on Ubuntu. My gem list (gem list |grep \"jekyll|doctor|slim\"):\n\n \n\nasciidoctor (1.5.6.2)\nasciidoctor-html5s (0.1.0.beta.11)\njekyll (3.5.0)\njekyll-asciidoc (2.1.0)\njekyll-sass-converter (1.5.2)\njekyll-watch (2.1.2, 1.5.1)\nslim (3.0.9) \n\n\n  ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-16668030"
        },
        {
            "date": "2018-10-30T13:14:47+0000",
            "content": "I wrote up in the README in the branch that all you should need is the slim gem. You're running into a similar problem I had when I tried to integrate asciidoctor-html5s directly, so I did not integrate that project directly; I only copied the templates themselves.\n\nHowever, I listed my own gems and realized that I've been running my tests with that gem installed; removing it causes the errors you probably saw about it being missing. I'll add it back in and take a look at what's happening and fix the README accordingly. Thanks for trying it out to find this. ",
            "author": "Cassandra Targett",
            "id": "comment-16668682"
        },
        {
            "date": "2018-10-30T14:30:36+0000",
            "content": "I figured out that we can remove the dependency on the asciidoctor-html5s gem by removing the 2 lines at the start of _templates/helpers.rb that require it. This seems to have no impact on the templates (but we can't remove the file entirely; the templates rely on some of what it does).\n\nAlexandre Rafalovitch, you're able to build the Ref Guide HTML fine on master, right? ",
            "author": "Cassandra Targett",
            "id": "comment-16668789"
        },
        {
            "date": "2018-10-30T16:01:14+0000",
            "content": "I can build on master yes. And it now builds on the branch with those two dependencies commented out.\n\nAnd the HTML looks so much cleaner now! And smaller.\n\nThere are still build errors for PDF and a deprecation warning for HTML stages, but both of these are on trunk as well, so not an issue here.\n\n+1 ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-16668938"
        },
        {
            "date": "2018-10-30T18:03:13+0000",
            "content": "Thanks again Alexandre, I'm glad to figure out those lines were causing the problem. ",
            "author": "Cassandra Targett",
            "id": "comment-16669132"
        },
        {
            "date": "2018-11-05T15:09:26+0000",
            "content": "Commit 1e3cc4861aafb832065ccba1d14c2c0280a449ba in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=1e3cc48 ]\n\nSOLR-12746: Simplify the Ref Guide HTML structure and use semantic HTML tags where possible. Adds new template files for Asciidoctor HTML conversion. ",
            "author": "ASF subversion and git services",
            "id": "comment-16675290"
        },
        {
            "date": "2018-11-05T15:10:20+0000",
            "content": "I'm going to let this sit a little bit on master before backporting to branch_7x. I want to make sure I have the changes to the Jenkins Ref Guide build script right before propagating any mistakes there. ",
            "author": "Cassandra Targett",
            "id": "comment-16675291"
        },
        {
            "date": "2018-11-05T19:18:22+0000",
            "content": "Commit 2633e0e0cfc2278aa08ae1f066e02b681e7b7fee in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2633e0e ]\n\nSOLR-12746: Simplify the Ref Guide HTML structure and use semantic HTML tags where possible. Adds new template files for Asciidoctor HTML conversion. ",
            "author": "ASF subversion and git services",
            "id": "comment-16675636"
        },
        {
            "date": "2018-11-05T19:19:31+0000",
            "content": "Four consecutive Jenkins build runs were as expected, so I backported the change to 7x. ",
            "author": "Cassandra Targett",
            "id": "comment-16675637"
        },
        {
            "date": "2018-11-19T20:54:28+0000",
            "content": "Commit 4efaecac34159ee1b718c548530d20d80c1fb4bf in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4efaeca ]\n\nSOLR-12746: Fix formatting for callout list numbers and preamble sections ",
            "author": "ASF subversion and git services",
            "id": "comment-16692256"
        },
        {
            "date": "2018-11-19T20:55:04+0000",
            "content": "Commit d37554e88ecfab2c274bbfd185856b8f737ea350 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d37554e ]\n\nSOLR-12746: Fix formatting for callout list numbers and preamble sections ",
            "author": "ASF subversion and git services",
            "id": "comment-16692259"
        },
        {
            "date": "2018-11-19T20:55:26+0000",
            "content": "Commit bbe9511894340df14b938565cf3575540ca2f21b in lucene-solr's branch refs/heads/branch_7_6 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=bbe9511 ]\n\nSOLR-12746: Fix formatting for callout list numbers and preamble sections ",
            "author": "ASF subversion and git services",
            "id": "comment-16692261"
        },
        {
            "date": "2018-11-19T20:59:58+0000",
            "content": "The change to remove dependence on the asciidoctor-html5s gem broke the ability for numbers in callout lists to be formatted properly. The most recent commit before this comment fixes those. \n\nI also noticed I had missed the formatting of \"preamble\" or \"lead\" sections on each page - it's supposed to be slightly larger. I added the new class/element structure to the CSS definitions and that fixed them. ",
            "author": "Cassandra Targett",
            "id": "comment-16692271"
        },
        {
            "date": "2018-11-20T15:16:22+0000",
            "content": "Commit 4efaecac34159ee1b718c548530d20d80c1fb4bf in lucene-solr's branch refs/heads/jira/http2 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4efaeca ]\n\nSOLR-12746: Fix formatting for callout list numbers and preamble sections ",
            "author": "ASF subversion and git services",
            "id": "comment-16693364"
        }
    ]
}