{
    "id": "SOLR-3333",
    "title": "Create an option that allows a query to be cached, but not used for warming",
    "details": {
        "affect_versions": "3.5,                                            4.0-ALPHA",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The application that uses my Solr install builds complex filter queries for employees because they have access to everything, whereas most users have access to a small subset.\n\nBecause of this, autowarming on the filterCache can take 30-60 seconds even though autoWarm is set to just 4 queries.\n\nIf we had a way (probably a localparam) to tell Solr to not use those filters when autowarming, but to go ahead and put them in the filterCache and use them until there's a new commit, that would eliminate this problem.  Employees might have their queries take longer, but regular users would not be affected.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13248292",
            "date": "2012-04-06T12:57:11+0000",
            "content": "I don't think I can implement this.  My knowledge of Solr internals simply isn't strong enough. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13248385",
            "date": "2012-04-06T14:11:30+0000",
            "content": "Are there other auto-warming queries you want to have done? Because it almost sounds like you just want to turn off autowarming in the filter cache.\n\nOr if they're unlikely to be re-used anyway, would it work to set cache=false on the original fq? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13248579",
            "date": "2012-04-06T18:33:58+0000",
            "content": "I would like to have our application code tag those nasty employee filters with something that makes them ineligible for autowarming, but still eligible for caching, which would keep them around until the next commit.  I am pretty sure our code is capable of knowing that the user is a special user, typically admin or system.\n\nAn update cycle runs once a minute for the index as a whole, but changes are tracked on a per-shard basis.  Commits on each shard are only done if something on that particular shard actually changes.  The large shards where this is a problem typically go several minutes between commits, and that might extend to an hour or more.\n\nI will talk to our developers about using the cache=false localparam for now, but I am hoping for the ability to use the cache for those nasty filters but not include them for warming.  Having recently toyed with the cache code (SOLR-2906), I know this may not be trivial. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13248602",
            "date": "2012-04-06T19:02:08+0000",
            "content": "I never actually answered your first question.  Yes, I do want most entries in the filter cache to be usable for autowarming.  Most users have relatively few boolean clauses in their filter queries.  Employees are the common exception.  We get a few hundred boolean clauses in ours.  Plans are being discussed to greatly reduce that, but I'm not sure we'll ever get away from it entirely. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13254664",
            "date": "2012-04-16T13:03:32+0000",
            "content": "I just thought of a localparam syntax for this: \n{!cache=nowarm} "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636620",
            "date": "2013-04-19T17:14:43+0000",
            "content": "I hope someone can fix this, but I know that at this time it's not something I can tackle without generous hand-holding.  If there are no takers soon, I'll go ahead and close the issue.\n\nThis is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        }
    ]
}