{
    "id": "SOLR-5523",
    "title": "Implement proper security when writing config files to Solr",
    "details": {
        "affect_versions": "6.0",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Follow up on SOLR-5518 and SOLR-5287. We need to add proper security for writing files to Solr.\n\nI can't pursue this for some time. If we decide to pull this out, we need to ust remove EditFileRequestHandler, that should do it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Gregory Chanan",
            "id": "comment-14160675",
            "date": "2014-10-06T18:42:58+0000",
            "content": "FWIW I'm planning to address this with Apache Sentry (it may already work with minimal effort, but I haven't tested this specific feature or a 5.0 version of Solr).  I'm not sure if it will be sufficient to point to another project, but we should at least not preclude another project like Sentry integrating with Solr to provide it's own security model. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14160830",
            "date": "2014-10-06T19:55:08+0000",
            "content": "Gregory Chanan:\n\nThis was a whole kerfuffle where Stefan and I were allowing arbitrary XML files to be written to Solr's config directory, which opens up a vulnerability. I'm not sure how Sentry plays here. There's lots of discussion in the referenced JIRAs in case you're interested in what lead up to this.\n\nThe basic thing Stefan and I were working on is that it's pretty frustrating that we have to go outside of Solr and into a text editor in order to make any change to your Solr config files. Now, that said, how this plays with ZooKeeper keeping Solr's config files is kind of an open question. I mean you can view the XML in the Solr Admin screen, and with just a few little tweaks you could edit them... .but those tweaks are pretty bad from a security perspective. \n\nRegardless, your understanding of security & related issues is waaaay better than mine, so if you think Sentry can make all this work that'd b egreat. This particular JIRA is just hanging around to insure we don't release trunk/5.0 (now) without disabling or fixing this feature. "
        },
        {
            "author": "Gregory Chanan",
            "id": "comment-14160836",
            "date": "2014-10-06T19:57:38+0000",
            "content": "Erick Erickson Thanks Erick, I read through those JIRAs.  I just put the above as a placeholder in case someone decides to implement some authorization support in Solr proper to support those patches. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14268064",
            "date": "2015-01-07T19:27:09+0000",
            "content": "This JIRA was a place marker for SOLR-5287 security-related issues. Since we're pulling all traces of that JIRA and the problem is now in the realm of \"managed schemas\", this is no longer relevant. "
        }
    ]
}