{
    "id": "SOLR-3346",
    "title": "qt Dispatching Request Handler",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Instead of 'qt' being handled by the SolrDispatchFilter (a Servlet Filter), it would be better implemented as a request handler, with a suggested name of DispatchingRequestHandler.  This is better because:\n\n\tit keeps the servlet filter more focused / simplified (albeit just a little)\n\tit simplifies solrconfig.xml by removing/deprecating handleSelect=\"true\".  'qt' is less magic, it works more explicitly.\n\tif you don't want to use 'qt' dispatch, simply don't use DispatchingRequestHandler\n\tDispatchingRequestHandler would get used by EmbeddedSolrServer but SolrDispatchFilter is not.\n\n\n\nCredit: Hoss's idea, Erik coded a first draft",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13250742",
            "date": "2012-04-10T15:30:47+0000",
            "content": "I think I would prefer leaving things as they are (as you say, it's just a small piece of code in the SolrDispatchFilter... and \"qt\" is all about dispatching!)\nIt would seem to introduce extra overhead for anyone that wanted to use \"qt\" as they did before, and there's a good probability that it would introduce more bugs as well. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13278434",
            "date": "2012-05-17T23:59:40+0000",
            "content": "Credit: Hoss's idea\n\nto be clear, i did not suggest that we should eliminate qt support from SolrDispatchFilter.\n\nwhat i said in SOLR-3161 was...\n\n\nchange the example solrocnfig to use handleSelect=\"false\"\n ...\nBonus points: someone can write a DispatchingRequestHandler that can optionally be configured with some name (such as \"/select\") and does nothing put look for a \"qt\" param and forward to the handler with that name – but it can have configuration options indicating which names are permitted (and any other names would be rejected)\n\nmy entire point was that we should leave in support for 'handleSelect=\"true\"' exactly as it is for the multitudes of existing users who are happy using \"qt\" w/o any security concerns, but that we could also offer an optional DispatchingRequestHandler for people who want param based dispatching but want to limit it to only certain handlers "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13278453",
            "date": "2012-05-18T00:33:02+0000",
            "content": "I'm too overwhelmed with other stuff to battle this, but I entirely disagree.  SolrDispatchFilter needs to have it's logic moved down a layer when it comes to determining which request handler to hit, in my opinion.  Having this kind of logic at the web tier, for one thing, requires that folks using Solr embedded (or in direct connection kinda tests) have to recreate this logic.  That's just one reason we should eliminate the handleSelect/qt business.  As we've seen, though, it's a thorny topic that necessitates changes in 3rd party clients, etc to eliminate qt, and this is what this issue is about - keeping a backwards-compatible layer for qt support while making it trivial to enable or not.  Hoss mentioned \"multitudes of existing users who are happy using 'qt' without security concerns\" - my assertion is that these users don't know the types of capabilities that are open (perhaps thinking if they just removed/blocked /admin that they'd be safer). "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717452",
            "date": "2013-07-23T18:48:17+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16055307",
            "date": "2017-06-20T07:57:55+0000",
            "content": "Do people still think we should keep \"qt\" and \"handleSelect\" around forever? I'd vote for ripping it all out for 8.0 and provide this Handler if there is a user demand for it. "
        },
        {
            "author": "David Smiley",
            "id": "comment-16056191",
            "date": "2017-06-20T18:01:35+0000",
            "content": "Jan Høydahl see SOLR-6807.  I'd love to see 6807 done for v7.0.  Then we can think of either ripping out handleSelect functionality out and stop there or as this issue suggest, replace with a similar request handler. "
        }
    ]
}