{
    "id": "SOLR-4934",
    "title": "Prevent runtime failure if users use initargs \"useCompoundFile\" setting on LogMergePolicy or TieredMergePolicy",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "LUCENE-5038 eliminated setUseCompoundFile(boolean) from the built in MergePolicies\n\texisting users may have configs that use <mergePolicy> init args to try and call that setter\n\twe already do some explicit checks for these MergePolices in SolrIndexConfig to deal with legacy syntax\n\tupdate the existing logic to remove \"useCompoundFile\" from the MergePolicy initArgs for these known policies if found, and log a warning.\n\n\n\n(NOTE: i don't want to arbitrarily remove \"useCompoundFile\" from the initArgs regardless of class in case someone has a custom MergePolicy that implements that logic – that would suck)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13687310",
            "date": "2013-06-18T22:35:06+0000",
            "content": "Committed revision 1494348.\n\nThe fix itself was fairly small, and the bulk of the change was svn copying of test configs so i just went ahead and committed to trunk instead of attaching a patch.\n\nIf there are no objections, i'll backport to 4x later tonight or early tommorow. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13688104",
            "date": "2013-06-19T16:07:40+0000",
            "content": "I was getting ready to file an issue, glad I found this before doing so.  The only thing I knew was that LUCENE-5038 had caused Solr to make compound files and the useCompoundFile setting under indexConfig that I found in the branch_4x example wasn't turning it off.\n\nA connected discussion, for which I can file an issue if necessary: Assuming there are plenty of file descriptors available, will a user get better performance from compound files or separate files?  Is it dependent on other factors like filesystem choice, or is one a clear winner?  The outcome of that discussion should decide what Solr's default is when no related config options are used. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13688179",
            "date": "2013-06-19T17:24:38+0000",
            "content": "The only thing I knew was that LUCENE-5038 had caused Solr to make compound files and the useCompoundFile setting under indexConfig that I found in the branch_4x example wasn't turning it off.\n\nOh ... hmmm, yeah ... i hadn't noticed that.  definitely a bug there.  I've opened SOLR-4941 to track that, and we'll leave this issue specifically about the broken initargs config option.\n\nEDIT: fixed issue number "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13688184",
            "date": "2013-06-19T17:27:44+0000",
            "content": "merged r1494348 -> 4x as r1494696 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13688190",
            "date": "2013-06-19T17:33:55+0000",
            "content": "Assuming there are plenty of file descriptors available, will a user get better performance from compound files or separate files?\n\nSearching on the index will have no negative impact. IndexInputSlicer returns optimized indexinputs that remove the whole file offset stuff. Indexing speed is identical, too, but merging (done in background) is more expensive. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716816",
            "date": "2013-07-23T18:38:40+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}