{
    "id": "SOLR-4681",
    "title": "Add spellcheck to default /select handler",
    "details": {
        "affect_versions": "4.2",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "In SOLR-4680 I put a patch to fix spellcheck for the /spell handler.\n\nThis bug/patch does that and also adds spellcheck to the default /select launch.  I'm putting it as a separate bug because I suspect some people may have stronger feelings about adding a component to the default that everybody uses.\n\nHowever, in Solr we DO expose the spellcheck box under /select, and it does not work, so I really think we should spellcheck should be in the default.",
    "attachments": {
        "SOLR-4681-with-default-select.patch": "https://issues.apache.org/jira/secure/attachment/12577329/SOLR-4681-with-default-select.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Bennett",
            "id": "comment-13624201",
            "date": "2013-04-05T23:55:19+0000",
            "content": "Fixes default spellcheck configuration AND adds spellcheck to default /select so that the Spellcheck checkbox works.\n\nThis is a superset of SOLR-4680. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13624210",
            "date": "2013-04-05T23:59:25+0000",
            "content": "SOLR-4681 is a superset of SOLR-4680 "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13630499",
            "date": "2013-04-12T19:04:59+0000",
            "content": "Do we really want /select to have spell checker configured?   The reason it has not historically been wired in by default is that it requires schema-specific configuration to make work.  I think this is fine with the /browse handler since all of that is example data schema specific, but /select should stay pretty general, eh? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13636328",
            "date": "2013-04-19T12:42:17+0000",
            "content": "-1\nLet /select stay clean.\n\nWould it be interesting to add a parameter to let you add a search component through HTTP request? &last-components=spellcheck,elevate ? Why must it be locked down in the xml? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13698805",
            "date": "2013-07-03T10:46:11+0000",
            "content": "However, in Solr we DO expose the spellcheck box under /select, and it does not work, so I really think we should spellcheck should be in the default.\n\nIf this is the main concern, a better solution is letting the GUI disable/grey-out the spellcheck checkbox if the selected handler is not configured with the spellcheck component.\n\nDon't know if it is easy to get to such info through clean REST APIs. We cannot rely on a component named \"spellcheck\", since it may be named anything when looking at a custom solrconfig. You could fire a dummy query and look at the response but that is not very clean? "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16321110",
            "date": "2018-01-10T21:07:05+0000",
            "content": "Resolving as Won't Fix since we've discussed ad nauseam what to do with default configs, etc., and we always return back to the same principle to leave it as empty and clean as possible, which is reflected in the comments here from 4+ years ago.\n\nI could have left this open for the suggested enhancement that the UI grey out the spellcheck box if it's not configured, but that feels like an improvement rather than a bug and IMO should be another issue. "
        }
    ]
}