{
    "id": "SOLR-5896",
    "title": "Create and edit a CWiki page that describes UpdateRequestProcessors, especially FieldMutatingUpdateProcessors",
    "details": {
        "affect_versions": "4.8,                                            6.0",
        "status": "Closed",
        "fix_versions": [
            "4.10"
        ],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "The capabilities here aren't really documented as a group anywhere I could see in the official pages, there are a couple of references to them but nothing that really serves draws attention. These need to be documented.\n\nWhere does it make sense to put this? It doesn't really fit under \"Understanding Analyzers, Tokenizers, and Filters\", except kinda since they can be used to alter how data gets indexed, think of the Parse[Date|Int|Float..] factories.\n\nStraw-man: add child pages to \"Understanding Analyzers, Tokenizers, and Filters\" for \"What is an UpdateRequestProcessor\", \"UpdateRequestProcessors\", and probably something like \"How to configure your UpdateRequestProcessor\". Or???",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13943316",
            "date": "2014-03-21T18:00:16+0000",
            "content": "I have plenty of examples for these (and all other) update processors in my e-book:\nhttp://www.lulu.com/us/en/shop/jack-krupansky/solr-4x-deep-dive-early-access-release-7/ebook/product-21203548.html "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13944308",
            "date": "2014-03-23T02:35:55+0000",
            "content": "My current attempt at the full catalogue is at: http://www.solr-start.com/info/update-request-processors/ \n\nThere is a couple of issues I saw when I built it:\n\n\tFairly deep inheritance hierarchy (which is the main reason this jira exists, I guess)\n\tLocation of non-core URPs to ensure the jars are on the library path (only a couple of classes to date)\n\tJavadocs, as non-core URPs are not just in different packages, they are in different javadoc sets altogether and cannot be discovered when browsing Javadoc by parent page\n\tShort names (solr.X), also for core- vs. non-core- components\n\n\n\nIncidentally, all of the above problems (and a couple more) are even more present for the Analyzers, Tokenizers and Filters. That's why I built: http://www.solr-start.com/info/analyzers/\n\nBoth of the resources above (and several others coming later) and built by reverse engineering the production release, looking at the jars and javadocs. Basically, brute-forcing the results from the ground-truth as opposed to trying to figure out the quirks of the build-system and source-control.  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14116858",
            "date": "2014-08-31T19:21:26+0000",
            "content": "Short descriptions are added to the Reference Guide. There's room for any supporting detail we need, but at least it lets users know these exists. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-14118410",
            "date": "2014-09-02T17:38:37+0000",
            "content": "This isn't really ready for publication. I'm reopening and assigning to myself to keep working on for 4.11.\n\nAt a minimum, the list of factories should link to the javadocs instead of requiring users to go hunt for them.\n\nPreferably though it would have some examples of using these and how they would change things for the user. Maybe not every single processor needs an example, but I'm sure there are a few that are used more commonly than others.\n\nComments, examples, etc., are welcome on the page itself: https://cwiki.apache.org/confluence/display/solr/Update+Request+Processors "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14118420",
            "date": "2014-09-02T17:47:10+0000",
            "content": "Cassandra:\n\nI'll be glad to help, but time is limited so I may peck at it one at a time. Moving it to 4.11 is fine with me... "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-14118443",
            "date": "2014-09-02T18:06:09+0000",
            "content": "Closing again as this is really a duplicate of SOLR-5896. "
        }
    ]
}