{
    "id": "SOLR-11527",
    "title": "The Solr start script should detect service install and recommend NOT calling script directly",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-23T03:20:50+0000",
            "content": "In situations where a user installs the Solr service to a *NIX system with gnu tools, running bin/solr start directly (instead of starting the service) will result in very different behavior than the user likely expects.\n\nI think that the start script should detect when Solr has been installed as a service.  When that status is detected, ut should output a warning if started in the \"manual\" way.\n\nTo do this, the service installer script should create a file with a name like \"install.params\" in the install directory (default /opt/solr).  The init script should set an environment variable, something like SOLR_STARTED_FROM_INIT.  I can envision a scenario where a later service install could utilize information in the install.params file.\n\nIf consensus says that the filename and environment variable name are terrible, feel free to bikeshed.\n\nIf the bin/solr script finds the install.params file, and does NOT find the SOLR_STARTED_FROM_INIT variable, it should output a warning that says something like this:\n\n\n=== WARNING ===\nSolr has been installed as a service.  This script execution is taking place *outside* of the service.  Solr should be started with the service command or the init script, not run directly from the install directory.\n===============\n\n ",
            "author": "Shawn Heisey",
            "id": "comment-16214581"
        },
        {
            "date": "2017-10-23T03:25:10+0000",
            "content": "Here's an related but very different idea to do instead:\n\nHave bin/solr (and the init script) utilize the install.params file so that bin/solr and /etc/init.d/solr will produce identical behavior when the install script has been used.\n\nI'm hesitant to go this route, because there might be situations where somebody actually does want to start an \"out-of-the-box defaults\" Solr instance on a system where they have used the service install.  This is probably extremely rare, but I can imagine a situation where somebody might actually want to do it. ",
            "author": "Shawn Heisey",
            "id": "comment-16214584"
        }
    ]
}