{
    "id": "SOLR-814",
    "title": "Add new Japanese Hiragana Filter and Factory",
    "details": {
        "affect_versions": "1.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Japanese Hiragana and Katakana character sets can be easily translated between. This filter normalizes all Hiragana characters to their Katakana counterpart, allowing for indexing and searching using either.",
    "attachments": {
        "SOLR-814.patch": "https://issues.apache.org/jira/secure/attachment/12392368/SOLR-814.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Todd Feak",
            "id": "comment-12640604",
            "date": "2008-10-17T18:10:18+0000",
            "content": "Attached patch containing Filter, Factory, and Unit Tests for both "
        },
        {
            "author": "Walter Underwood",
            "id": "comment-12640605",
            "date": "2008-10-17T18:15:07+0000",
            "content": "This seems like a bad idea. Hirigana and katakana are used quite differently in Japanese. They are not interchangeable.\n\nI was the engineer for Japanese support in Ultraseek for years and even visited our distributor there, but no one ever asked for this feature. They asked for a lot of things, but never this.\n\nIt is very useful, maybe essential, to normalize full-width and half-width versions of hirigana, katakana, and ASCII. "
        },
        {
            "author": "Todd Feak",
            "id": "comment-12640615",
            "date": "2008-10-17T18:29:13+0000",
            "content": "Yes, they are used differently. \n\nHowever, a word written in Hiragana is the same word when written in Katakana. Same meaning. Futhermore, it's not always cut and dried which to use. For example, a movie title may be written in Hiragana or Katakana, depending on the Director's preference. The user (searcher) may not have remembered the Director's preference, so may search using the other. Without this normalization they would get a search miss.\n\nI don't doubt your experience at Ultraseek, but this feature was explicitly asked for by Japanese (native speaking) engineers at Sony. I just (literally) double checked with a couple of onsite native speaking Japanese engineers and both agree that this is useful, at least for our searches.\n\nI would say that it should be up to the schema developer as to whether this functionality is useful or not for their situation. Either way, I offer it up to the community for their decision. "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-12662776",
            "date": "2009-01-11T13:16:09+0000",
            "content": "Using CharFilter can solve this problem in a flexible manner. "
        }
    ]
}