{
    "id": "SOLR-3238",
    "title": "Sequel of Admin UI",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Catch-All Issue for all upcoming Bugs/Reports/Suggestions on the Admin UI",
    "attachments": {
        "solradminbug.png": "https://issues.apache.org/jira/secure/attachment/12518783/solradminbug.png",
        "SOLR-3238.patch": "https://issues.apache.org/jira/secure/attachment/12518836/SOLR-3238.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Vadim Kisselmann",
            "id": "comment-13230030",
            "date": "2012-03-15T09:58:17+0000",
            "content": "I use Solr 4.0 from trunk(latest) with tomcat6.\n\nI get an error in New Admin UI (since one week, i update every day from trunk):\n\nThis interface requires that you activate the admin request handlers, add the following configuration to your solrconfig.xml:\n<!-- Admin Handlers - This will register all the standard admin RequestHandlers. -->\n<requestHandler name=\"/admin/\" class=\"solr.admin.AdminHandlers\" />\n\nAdmin request Handlers are definitely activated in my solrconfig. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13230043",
            "date": "2012-03-15T10:30:09+0000",
            "content": "I got this error with trunk checkout using \"ant run-example\", too. But only on the first run, later runs work.\n\nEDIT: I think this has nothing to do with the admin UI. When this happened, I got some Exceptions in the startup of Solr. Can you check for them in the logs? Unfortunately I cannot reproduce at the moment. "
        },
        {
            "author": "Vadim Kisselmann",
            "id": "comment-13230056",
            "date": "2012-03-15T10:46:41+0000",
            "content": "It's weird\n\n\"ant run-example\" starts server with jetty, and it works. \nAs next step i build it one more time with \"ant example\" and start my tomcat, and it works, too.\n\nWhen i update to new Solr version from trunk, and build it with \"ant example\", i get this error again. \n\nEDIT: no errors at this time in my log files. "
        },
        {
            "author": "Vadim Kisselmann",
            "id": "comment-13230104",
            "date": "2012-03-15T12:32:36+0000",
            "content": "Now i have error messages:\n\nSCHWERWIEGEND: The web application [/solr2] appears to have started a thread named [main-SendThread(zookeeper:2181)] but has failed to stop it. This is very likely to create a memory leak.\nException in thread \"Thread-2\" java.lang.NullPointerException\n\tat org.apache.solr.cloud.Overseer$CloudStateUpdater.amILeader(Overseer.java:179)\n\tat org.apache.solr.cloud.Overseer$CloudStateUpdater.run(Overseer.java:104)\n\tat java.lang.Thread.run(Thread.java:662)\n15.03.2012 13:25:17 org.apache.catalina.loader.WebappClassLoader loadClass\nINFO: Illegal access: this web application instance has been stopped already.  Could not load org.apache.zookeeper.server.ZooTrace.  The eventual following stack trace is caused by an error thrown for debugging purposes as well as to attempt to terminate the thread which caused the illegal access, and has no functional impact.\njava.lang.IllegalStateException\n\tat org.apache.catalina.loader.WebappClassLoader.loadClass(WebappClassLoader.java:1531)\n\tat org.apache.catalina.loader.WebappClassLoader.loadClass(WebappClassLoader.java:1491)\n\tat org.apache.zookeeper.ClientCnxn$SendThread.run(ClientCnxn.java:1196)\n15.03.2012 13:25:17 org.apache.coyote.http11.Http11Protocol destroy\n\nSLF4J: The requested version 1.5.8 by your slf4j binding is not compatible with [1.6]\nSLF4J: See http://www.slf4j.org/codes.html#version_mismatch for further details.\nlog4j:WARN No appenders could be found for logger (org.apache.solr.core.SolrResourceLoader).\nlog4j:WARN Please initialize the log4j system properly.\n\n\nSteps:\nI deleted the one default core in solr.xml, because i would create new cores with CoreAdminHandler.\nI started tomcat.\nNow it's completely broken. Rebuild and restart, whether jetty or tomcat, change nothing. \n\n\nEDIT:\ni get the same problem on another server(tomcat, sharded, without ZK). With an old revision from Feb. it works,\nwith new checkout from trunk not.\n\nEDIT2:\nIt works when i remove the example-folder, checkout new version from trunk and rebuild it. i think it's a problem\nwith solr.xml. On server-restart it breaks. With older revisions like r1292064 from Feb. it works.\nI think you're right, this has nothing to do with the admin UI. Sorry for spam here.\nNew Issue?  "
        },
        {
            "author": "Aliaksandr Zhuhrou",
            "id": "comment-13231527",
            "date": "2012-03-16T19:04:15+0000",
            "content": "As a suggestion can we allow specify default Query Response Writer. I am using a custom writer which is default response writer and I can't select it using an admin interface. Can we add a option \"default\" to the WT select on query tab which forces Solr to use the default one? Also I think we can build a select list directly from the current solr configuration. "
        },
        {
            "author": "Chun Chen",
            "id": "comment-13231912",
            "date": "2012-03-17T10:45:09+0000",
            "content": "Have a look at \"solradminbug.png\". \nI have no idea what's wrong with it. Are the \"start\" or \"rows\" parameters essential?\nbut if i use \"curl http://dog:8983/solr/dataimport?command=full-import\", that is ok. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13232007",
            "date": "2012-03-17T16:41:25+0000",
            "content": "Chen, that's correct .. i've fixed that already a few days ago while improving the handling of dataimports. Actually preparing the patch which includes this change.  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13232437",
            "date": "2012-03-19T04:47:49+0000",
            "content": "+1 \n\nStefan – go ahead and commit! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13234197",
            "date": "2012-03-21T08:34:51+0000",
            "content": "Updated Patch, will commit soon "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13234226",
            "date": "2012-03-21T09:37:30+0000",
            "content": "Committed in revision 1303326 "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13234227",
            "date": "2012-03-21T09:40:37+0000",
            "content": "New Issue?\nVadim, i think that would make sense yes \n\nThe Code which shows the error message you've mentioned on the first comment, is this one: https://github.com/steffkes/solr-admin/blob/master/js/scripts/app.js#L212 - it's requesting /admin/system "
        },
        {
            "author": "Emma Bo Liu",
            "id": "comment-13246521",
            "date": "2012-04-04T18:00:31+0000",
            "content": "cloud/zookeeper-data cannot show the node tree as the previous version.It says 'Fetch zookeeper data'without showing anything of the solr node. "
        },
        {
            "author": "Emma Bo Liu",
            "id": "comment-13246536",
            "date": "2012-04-04T18:18:56+0000",
            "content": "when accessing the solr new admin UI http://localhost:8983/solr/#/cloud, the error message window pop up saying ' 500 error get#/cloud cannot call method 'attr' of undefined\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13246938",
            "date": "2012-04-05T01:51:27+0000",
            "content": "I'm not sure what issue to attach this to, so it may make sense to make a new issue.  Here is general wishlist of things I think would help...\n\n\n\tFrom the analysis page, can there be a link to the relevant field/fieldType in schema-browser?\n\tFrom the schema-browser, can there be a link to the analysis page (with the right field selected?) Perhaps the text \"Index Analyzer\" and \"Query Analyzer\" could be links\n\tIn the schema-browser, when you click on a term, it loads in the query window, it should also execute the query!\n\tWhy does Autoload™ have a tm?\n\tI assume Autoload is writing a cookie... can it also keep the number of terms?  Perhaps also the checked state on analysis verbose output?\n\tOn the schema-browser page, the text \"Index Analyzer\" shows up on one line, but \"Query Analyzer\" gets broken into two lines.\n\tWhen showing the number of matching Docs for a field, can the number be a link to a query?  For example with the field \"id\", the link can be to: q=id:[* TO *]\n\tThe plural names in schema-browser are inappropriate at times – not a big deal, but if we replaced \"Fields/Types\" with \"Field:/Type:\"  I think it works OK in both singular and plural cases\n\tIn the plugin page, there are lots of URLs that would be great if they were actually URLS.  When we show a link to \"http://wiki.apache.org/solr/StandardRequestHandler\" that should be a real URL\n\n\n\n\nThings are really looking great!\n\n\n "
        },
        {
            "author": "Chris Male",
            "id": "comment-13246941",
            "date": "2012-04-05T02:06:31+0000",
            "content": "Perhaps its useful to have a few sub-tasks for each of these? Then we don't have a single issue with lots of disconnected patches and comments. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13247612",
            "date": "2012-04-05T20:17:28+0000",
            "content": "Here are some smaller issues to track "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13249979",
            "date": "2012-04-09T17:21:08+0000",
            "content": "It would be nice to see a total document count across the shards. "
        },
        {
            "author": "dylan",
            "id": "comment-13253059",
            "date": "2012-04-13T02:04:40+0000",
            "content": "Chinese words collected by admin ui are not correctly recognized by /analysis/field or /select.\n1. open admin ui. Singlre Core > Query.\nadd q: name:中文\nand I get the following information in tomcat's log:\npath=/select params=\n{wt=xml&rows=10&start=0&q=name:?????￥}\n hits=0 status=0 QTime=2\n\n2.  open admin ui. Singlre Core > Analysis.\nFieldValue: 中文\nand I get the following information in tomcat's log:\npath=/analysis/field params=\n{analysis.showmatch=true&analysis.query=&analysis.fieldname=ageseg&analysis.fieldvalue=?????￥&wt=json}\n status=0 QTime=2 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13253299",
            "date": "2012-04-13T11:38:24+0000",
            "content": "dylan:\n\nHow are you looking at your log? Because when I try cut/paste of your string in the admin analysis page, the return display in the admin UI has the characters correctly displayed, identified as IDEOGRAPHIC with raw byte sequences like: 'e4 b8 ad' and 'e6 96 87' (which I admit I haven't a clue whether they're correct or not). But the log shows gibberish (Jetty).\n\nSo my assumption here would be that the admin UI is fine, but the characters are being munged somewhere else, perhaps logging? Perhaps settings for your display in your editor or terminal session?\n\nOf course I could be all wet here. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13262074",
            "date": "2012-04-25T20:57:55+0000",
            "content": "Since more of the UI is now actually loaded asynchronously, it is subject to the jetty's DefaultServlet cacheing headers, which are non-existent by default.  I found it highly annoying today when I updated Solr to find that the UI wasn't updated, even when I told my browser to force-reload.  I had to clear my browser cache.  I looked into this a bit and I propose that example/etc/webdefault.xml has the \"cacheControl\" piece of it be un-commented, and set the max-age to 60 (in seconds).  It is unlikely the timespan between a browser requesting it and Solr being shut down, updated, redeployed, and the browser fetches it again.  Possible but unlikely.  When this time span is exceeded, a browser would re-request the resources but it would get back a small 304 status to indicate the file hasn't changed, assuming it hasn't.  To be clear, this applies to the admin UI in the out-of-the-box jetty configuration, and doesn't apply to searches.  Sound good?  I can commit it trivially. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13262084",
            "date": "2012-04-25T21:03:32+0000",
            "content": "Given how easy it is to stop Solr and potentially bring up a different Solr version at the same URL in very little time, perhaps max-age should be 10 seconds. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13262106",
            "date": "2012-04-25T21:18:06+0000",
            "content": "My only concern is that the schema browser page. The calls to calculate some of the stats, particularly the \"load term info\" button can be quite expensive on large systems; to get the top terms you have to spin through all the terms in the field. But otherwise, I'd call a fast age-out a feature, \n\nNow, I know very little about jetty configuration so this may be all wet, but aging out that information quickly would make the schema-browser part of the UI quite hard to use. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13262140",
            "date": "2012-04-25T21:36:11+0000",
            "content": "Jetty's \"DefaultServlet\" serves static content, such as the CSS, Solr logo, and all the page templates.  Any dynamically generated data, such as what comes from Solr itself via its request handlers, don't apply to what I propose.\n\nYou should know that the \"load term info\" information is not cached by the browser; it re-requests it every time it is asked for, just like any other request to Solr itself, given Solr's default HTTP cache settings (which is not to cache).  There might be caching on the Solr side but I doubt it. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13262146",
            "date": "2012-04-25T21:41:25+0000",
            "content": "For the real release we want a long cache.  (though it is an admin UI, so its not all that important)\n\nfor JS dev, can't you just disable HTTP cache in FF/firebug? "
        },
        {
            "author": "David Smiley",
            "id": "comment-13262168",
            "date": "2012-04-25T21:57:18+0000",
            "content": "I didn't know Firebug could do that, although this doesn't completely address the issue.  I didn't set out to do Solr development today, I merely wanted to see the latest UI so I could do a screen capture.  Looking at Firebug when I was diagnosing this, showed that it decided to cache the stuff for a few days on me – I forget how long exactly.\n\nAnother option to solve this well-known problem (this is hardly specific to Solr) is to attach a nonce query parameter to the static resources.  This nonce could be the Solr build release string seen on the front string.  Essentially when a template is requested, it would request /solr/tpl/query.html?nonce=4.0.0.2012.04.25.16.10.30 "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13262180",
            "date": "2012-04-25T22:06:08+0000",
            "content": "I like the idea of adding version to the param string – that could be initalized in index.html too\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13264270",
            "date": "2012-04-28T09:28:33+0000",
            "content": "I'm not sure what issue to attach this to, so it may make sense to make a new issue. Here is general wishlist of things I think would help...\n\n\tFrom the analysis page, can there be a link to the relevant field/fieldType in schema-browser?\n\tFrom the schema-browser, can there be a link to the analysis page (with the right field selected?) Perhaps the text \"Index Analyzer\" and \"Query Analyzer\" could be links\n\tIn the schema-browser, when you click on a term, it loads in the query window, it should also execute the query!\n\tWhy does Autoload™ have a tm?\n\tI assume Autoload is writing a cookie... can it also keep the number of terms? Perhaps also the checked state on analysis verbose output?\n\tOn the schema-browser page, the text \"Index Analyzer\" shows up on one line, but \"Query Analyzer\" gets broken into two lines.\n\tWhen showing the number of matching Docs for a field, can the number be a link to a query? For example with the field \"id\", the link can be to: q=id:[* TO *]\n\tThe plural names in schema-browser are inappropriate at times – not a big deal, but if we replaced \"Fields/Types\" with \"Field:/Type:\" I think it works OK in both singular and plural cases\n\tIn the plugin page, there are lots of URLs that would be great if they were actually URLS. When we show a link to \"http://wiki.apache.org/solr/StandardRequestHandler\" that should be a real URL\n\n\n\nAll of them changed.\n\n\n\tI assume Autoload is writing a cookie... can it also keep the number of terms? Perhaps also the checked state on analysis verbose output?\n\tWhen showing the number of matching Docs for a field, can the number be a link to a query? For example with the field \"id\", the link can be to: q=id:[* TO *]\n\n\n\nSchema-Browser/Autoload was already using a cookie, Analysis/Verbose now too. Schema-Browser got a separate \"Query\"-Link in the TopTerms-Section. In the first row \"[NN]/NN Top-Terms\" the second Number is already a link to load all Top-Terms, therefore i couldn't change this one into a link to the Query.\n\nIf we'd like to have a possibility to load every time all available Top-Terms, we could add another checkbox (right below the \"[_] Autoload\" one? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13264273",
            "date": "2012-04-28T09:30:59+0000",
            "content": "cloud/zookeeper-data cannot show the node tree as the previous version.It says 'Fetch zookeeper data'without showing anything of the solr node.\n\nSorry Emma, i overlooked your comment - is it still not working for you? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13264359",
            "date": "2012-04-28T16:57:12+0000",
            "content": "I have just fired up the example from a trunk checkout that's a day or two old and taken a quick look.\n\nOn the analysis page: Is it possible to have the information fields always appear in the same order?  That order is up to you, I just want it to be consistent.  I just ran an analysis on the title field in the trunk example and the first step in the output was in this order: text, start, end, type, position.  The other two steps were ordered like this: text, position, start, end, type.  At first I thought that the position had disappeared after the first step, then I noticed it was still there, just in a different place.\n\nOn the logging page: Many of the settings show null, italicized.  This would be fine, except that when you click on one, null is not one of the choices.  You have to choose UNSET to keep the setting the same.  One of them needs to change to match the other.  My thought is that in both places it should be \"unset\" or \"not set\" – lowercase and italicized.\n\nOn the Plugins page under the core: You can't open more than one of the dropdown items at once, and you can't close a dropdown once it's open.  It's very helpful for me to be able to see more than one set of cache statistics at the same time.  If you can open more than one of them, you need to be able to close them as well. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13264361",
            "date": "2012-04-28T17:08:00+0000",
            "content": "Being used to the 3x gui, I was initially looking for statistics but didn't find it.  I was a little bit surprised to find it under Plugins.  I would have expected that section to be called Statistics.  If having \"plugin\" in the name is something you find to be important, perhaps it should be called \"Plugin Stats\" or \"Plugins/Statistics\" or something else that makes it clear? "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13276647",
            "date": "2012-05-16T10:38:24+0000",
            "content": "There's a small issue on the analysis page. After submitting the form with whitespace in the fields they are printed again still being url encoded with + for whitespace. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13276662",
            "date": "2012-05-16T11:16:45+0000",
            "content": "There's a small issue on the analysis page. After submitting the form with whitespace in the fields they are printed again still being url encoded with + for whitespace.\n\nThanks Markus, should be fixed in r1339114 "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13276669",
            "date": "2012-05-16T11:31:40+0000",
            "content": "Being used to the 3x gui, I was initially looking for statistics but didn't find it. I was a little bit surprised to find it under Plugins. I would have expected that section to be called Statistics. If having \"plugin\" in the name is something you find to be important, perhaps it should be called \"Plugin Stats\" or \"Plugins/Statistics\" or something else that makes it clear?\n\nI don't remember why i started with naming it \"Plugins\" ;o But i don't mind if we change names, so committed in r1339120 new Name \"Plugins / Stats\", Statistics is a bit too long and would result in a Two-Liner "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13281607",
            "date": "2012-05-23T13:40:08+0000",
            "content": "I think it would also be useful to display the shard information in the core overview page such as its ID and whether it is a leader. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13291374",
            "date": "2012-06-07T22:15:10+0000",
            "content": "I fired up the example from branch_4x today so I could check something in the new admin GUI, and found a couple of things I thought were worth mentioning.\n\nWhat I needed to check was whether the pages were machine-readable.  I've currently got an index status page written in Perl that parses the XML output from the current admin GUI on four Solr servers.  The new GUI is absolutely beautiful from a human perspective, but I need to be able to pull the displayed information out in a machine-readable form as well.  Is there any way to do that?\n\nThe next version of my status page will be written in Java.  What kind of options will I have available for retrieving statistical information from a remote Solr instance?\n\nWhen I fired up the multicore example, I found that the cache statistics pages for both cores only had fieldCache and fieldValueCache.  The documentCache, filterCache, and queryResultCache were not present.  If there were other things missing, I didn't notice. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13291407",
            "date": "2012-06-07T23:12:29+0000",
            "content": "What I needed to check was whether the pages were machine-readable\n\nThe new javascript gets all its data from normal request handlers\n\nbut I need to be able to pull the displayed information out in a machine-readable form as well. Is there any way to do that?\n\nYes, use normal solr requests.  If you turn on firebug (or equivalent) you can see what the UI is actually calling to get out the machine readable values.  For cache stats, that will be something like:\nhttp://localhost:8983/solr/admin/mbeans?stats=true&wt=json "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13291422",
            "date": "2012-06-07T23:38:43+0000",
            "content": "Yes, use normal solr requests. If you turn on firebug (or equivalent) you can see what the UI is actually calling to get out the machine readable values. For cache stats, that will be something like: http://localhost:8983/solr/admin/mbeans?stats=true&wt=json\n\nAwesome!  I can even use wt=xml and modify my Perl script for any differences between 3.x and 4.x.  I have just tried the same URL on 3.x and found that it works there, too.  My scripts currently use the stats.jsp and a couple of other URLs, not mbeans.  I will have to experiment, but do you know of any documentation that covers everything that's available?\n\nWith SolrJ, currently I can use ModifiableSolrParams and set qt to /admin/mbeans to make this work.  In the wake of issues like SOLR-3161, SolrJ might need a new way to specify the base URL path. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13291429",
            "date": "2012-06-07T23:45:42+0000",
            "content": "My scripts currently use the stats.jsp\n\nA big goal was to drop the totally untested jsp files and make sure all the logic is in standard request handlers.\n\ndo you know of any documentation that covers everything that's available?\n\nnot really – i suggest looking at the requests with firebug.  There are docs on the wiki, but it far from everything\n\nSolrJ might need a new way to specify the base URL path.\n\nyou should be able to get to anything with existing solrj API, just use solr.setQueryType( \"/admin/mbeans\" ) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412104",
            "date": "2012-07-11T22:26:01+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429896",
            "date": "2012-08-07T03:44:06+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445511",
            "date": "2012-08-31T00:38:23+0000",
            "content": "Doesn't look like there's anything else to do in this issue, any additional work should really be tracked in individual issues.\n\nsteffkes did a bunch of work tracked here that doesn't seem to have ever been recorded in CHANGES.txt, so i went ahead and added a line item about it...\n\nCommitted revision 1379237. trunk\nCommitted revision 1379239. 4x "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13654036",
            "date": "2013-05-10T10:33:48+0000",
            "content": "Closed after release. "
        }
    ]
}