{
    "id": "SOLR-11925",
    "title": "Auto delete oldest collections in a time routed alias",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Sub-task",
        "fix_versions": [
            "7.3"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The oldest collections in a Time Routed Alias should be automatically deleted, according to a new alias metadata that establishes how long.  It can be checked as new data flows in at TimeRoutedAliasUpdateProcessor and thus it won't occur if new data isn't coming in.",
    "attachments": {
        "SOLR-11925.patch": "https://issues.apache.org/jira/secure/attachment/12908921/SOLR-11925.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-02-02T05:23:42+0000",
            "content": "The attached patch deletes old collections immediately before creating a new collection.  Includes test.  The only nocommit is to rename RoutedAliasCreateCollectionCmd to MaintainRoutedAliasCmd since it doesn't just create now.\n\nMisc Time Routed Alias changes:\n\n\torg.apache.solr.client.solrj.request.CollectionAdminRequest.ModifyAlias#addMetadata now returns \"this\" to support chained method calls\n\n\n\nIncluded with this patch are some internal refactorings/improvements:\n\n\tCollectionsHandler.handleResponse is now named sendToOCPQueue (I chose the same name as operation.sendToOCPQueue boolean field).  The API contract of this method is simpler to understand as well; it does not take in the SolrQueryResponse.\n\tAdded SolrResponse.getException that parses out the \"exception\" with response code & message to create a SolrException.  This logic used to be in handleResponse/sendToOCPQueue but it's generally useful and helped enable the improved method signature.  Two of sendToOCPQueue()'s callers use this method.\n\tDateMathParser now has a constructor that takes both \"now\" and the timezone; formerly it only had one for the timezone and it required that you call setNow if you wanted to do that.  I felt that was a weird asymmetry; both can be done through the constructor now.\n \n\n ",
            "author": "David Smiley",
            "id": "comment-16349809"
        },
        {
            "date": "2018-02-08T03:31:44+0000",
            "content": "Took a look at the patch, here are my thoughts:\n\nLike:\n\n\trename of handleResponse\n\tfluent style for addMetadata (returning the command)\n\tcreate and delete sections of results \n\tNice cleanup in invokeAction, especially collecting and propagating the exception earlier.\n\n\n\nQuestion:\n\n\tWhy is remoteInvoke on RouedAliasCreateCollectionCommand when it's only used from TimeRoutedAliasUpdateProcessor?\n\tRename field on zkstateReader aliasesHolder to aliasesManager?\n\tYou added 2 parseSolrDateToInstant() methods with different params, but neither seems to be used?\n\tin your cleanup of invokeAction etc, you seem to have dropped some conditionals looking for null or -1 error codes, which was added by MarkMiller in 2013... (bottom of handleResponse, which is now sentToOCPQueue) Any idea what that was trapping? Why is it not needed now?\n\n\n\nThought about:\n\n\tThinking about the validation in TimeRoutedAlias ... Does seem that if an alias metadata gets messed up causing validation issue, all operations sending data to that alias will start failing. This worried me initially, but is probably ok. Must not get used in ModifyAlias in the future, since that would make it impossible to repair broken metadata. Not something we are doing now, but a potential pitfall. In constructor validation of values often worries me due to the inability to model busted state if state becomes busted.\n\tWe seem to rely on applyModificationandExportToZk to ensure that the alias is updated before deleting collections, but I think that's a little risky given the need for zookeeper watches to update. If we delete collections quickly after that nodes that have not processed watch notifications may send to the deleted shard? Do we need another (ugly, but magic) 100ms wait\n\tI think we can worry about making deletion async if that becomes a pain point later. Simple to start as you have it now is good.\n\n\n\nSuggest:\n\n\tJavadoc for deleteCollectionsAndUpdateAlias() - especially explanation of the correct notion for the \"from\" parameter.\n\tSimilarly doc for autoDeleteBeforeTime property on TimeRoutedAlias... time stuff is always fiddly, helps to have some doc. Not sure why it's not autoDeleteAfterInterval? Maybe you mean autoDeleteIfBefore?\n\n ",
            "author": "Gus Heck",
            "id": "comment-16356438"
        },
        {
            "date": "2018-02-08T19:46:40+0000",
            "content": "Why is remoteInvoke on RouedAliasCreateCollectionCommand when it's only used from TimeRoutedAliasUpdateProcessor?\n\nI thought it might be nice to have a static method on the command with typed arguments so that it's (a) easy to invoke remotely, and (b) keeps details of composing & writing the message in one class.  Do you think this is worse?\n\nRename field on zkstateReader aliasesHolder to aliasesManager?\n\n+1 will do\n\nYou added 2 parseSolrDateToInstant() methods with different params, but neither seems to be used?\n\nWhoops. I'll delete them; they are one-liners any way.\n\nyou seem to have dropped some conditionals looking for null or -1 error codes\n\nThat moved to a new method on SolrResponse: getException().  I appreciate it's complicated to follow this in the diff; I found the original code being refactored difficult to understand.\n\nThinking about the validation in TimeRoutedAlias...\n\nGood commentary... yeah something to be mindful of in ModifyAlias in the future.\n\nWe seem to rely on applyModificationandExportToZk to ensure that the alias is updated before deleting collections, but I think that's a little risky...\n\nThe code here is running on the node that has the Overseer, and thus issuing an admin command to delete the collection from the same node \"sees\" the same state (I think).  If I'm wrong, what you describe doesn't sound serious?  deleteOldestCollectionsAndUpdateAlias() will not throw an exception (thus won't prevent creating next collection), it will return errors in the overseer message response if there are any (results.add(...)).  If this comes to pass, we could modify DeleteCollectionCmd to ensure it's aliases is up to date first.\n\nJavadoc/doc\n\n+1 will do. ",
            "author": "David Smiley",
            "id": "comment-16357477"
        },
        {
            "date": "2018-02-08T22:02:52+0000",
            "content": "I updated the patch with your feedback; mostly adding some docs and rewording this setting to \"autoDeleteAge\".  If tests check out I'll commit tonight.  Thanks for your feedback Gus! ",
            "author": "David Smiley",
            "id": "comment-16357636"
        },
        {
            "date": "2018-02-09T04:16:23+0000",
            "content": "Commit 02b5172ea2e677e137b1d8563b335434433e048f in lucene-solr's branch refs/heads/master from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=02b5172 ]\n\nSOLR-11925: Time Routed Aliases: router.autoDeleteAge feature ",
            "author": "ASF subversion and git services",
            "id": "comment-16357901"
        },
        {
            "date": "2018-02-09T04:16:24+0000",
            "content": "Commit 1527ce57d49721923ae43a81a10fe872ce94a2d8 in lucene-solr's branch refs/heads/master from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=1527ce5 ]\n\nSOLR-11925: Rename RoutedAliasCreateCollectionCmd as MaintainRoutedAliasCmd (internal Cmd) ",
            "author": "ASF subversion and git services",
            "id": "comment-16357902"
        },
        {
            "date": "2018-02-09T04:22:47+0000",
            "content": "Commit 5ce83237e804ac1130eaf5cf793955667793fee0 in lucene-solr's branch refs/heads/branch_7x from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5ce8323 ]\n\nSOLR-11925: Time Routed Aliases: router.autoDeleteAge feature\n\n(cherry picked from commit 02b5172) ",
            "author": "ASF subversion and git services",
            "id": "comment-16357904"
        },
        {
            "date": "2018-02-09T04:22:48+0000",
            "content": "Commit ec8d22a1ce23d03699315f9aa64da2a54441deae in lucene-solr's branch refs/heads/branch_7x from David Smiley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ec8d22a ]\n\nSOLR-11925: Rename RoutedAliasCreateCollectionCmd as MaintainRoutedAliasCmd (internal Cmd)\n\n(cherry picked from commit 1527ce5) ",
            "author": "ASF subversion and git services",
            "id": "comment-16357905"
        }
    ]
}