{
    "id": "SOLR-11696",
    "title": "/query page generates http link that loads incorrectly-encoded url",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "i'm trying to query documents that contain both \"Covers for Modular Outdoor Club Chairs\" and \"Resort Club & Ottoman Set\" in my \"vv\" array field.\n\nthat single ampersand seems to breaking the default url encoding that is generated in my browser (Chrome 62.0.3202.94) when i click the search link generated at the top of the /query page of the solr UI.\n\nin the UI, my q is\n\n\nvv:\"Covers for Modular Outdoor Club Chairs\" && vv:\"Resort Club & Ottoman Set\"\n\n\n\nthe UI generates the following url.  when I click it, i get different results from the results in the /query UI\n\n\nhttp://localhost:8983/solr/films/select?q=vv:\"Covers for Modular Outdoor Club Chairs\" && vv:\"Resort Club & Ottoman Set\"\n\n\n\nbecause the url gets encoded wrong.  Resultant url seen in browser:\n\n\nhttp://localhost:8983/solr/films/select?q=vv:%22Covers%20for%20Modular%20Outdoor%20Club%20Chairs%22%20&&%20vv:%22Resort%20Club%20&%20Ottoman%20Set%22\n\n\n\nProperly-encoded url that leads to correct results:\n\n\nhttp://localhost:8983/solr/films/select?q=vv%3A%22Covers%20for%20Modular%20Outdoor%20Club%20Chairs%22%20%26%26%20vv%3A%22Resort%20Club%20%26%20Ottoman%20Set%22\n\n\n\n(encoded using https://www.urlencoder.org/)\n\nif the Solr UI is to generate a clickable link that appears to be equivalent to the UI's search, then it ought to link to the correct search.\n\ni'm listing this as a \"bug\" even though it seems to be more of a \"flaw\" because it's an issue that breaks the user experience and leads to unexpected results.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-01-16T17:35:33+0000",
            "content": "I saw the \"easy fix\" label here and thought I'd work on this. Would the owners mind assigning this to me? It would be my first PR/fix and I'd appreciate guidance in executing this as well! ",
            "author": "Aditya Srinivasan",
            "id": "comment-16327435"
        },
        {
            "date": "2018-01-16T17:47:14+0000",
            "content": "I'm pretty sure JIRA's can't be assigned to a non committer.\n\nBut that doesn't matter, you've effectively assigned it to yourself to by volunteering...\n\nTo work on it, just dive in and make it work. This page has a bunch of tips on how to get the code, compile, set up an IDE and the like:\n\nhttps://wiki.apache.org/solr/HowToContribute\n\nIt'll take a bit of hunting to track down where this should be done, and unfortunately I don't have much knowledge of how the admin UI is put together. I do know it's in Angular JS, so look for a lot of *.js files.....\n\n  ",
            "author": "Erick Erickson",
            "id": "comment-16327455"
        }
    ]
}