{
    "id": "SOLR-208",
    "title": "RSS feed XSL example",
    "details": {
        "affect_versions": "1.2",
        "status": "Closed",
        "fix_versions": [
            "1.2"
        ],
        "components": [
            "clients - java"
        ],
        "type": "New Feature",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A quick .xsl file for transforming solr queries into RSS feeds. To get the date and time in properly you'll need an XSL 2.0 processor, as in http://wiki.apache.org/solr/XsltResponseWriter .  Tested to work with the example solr distribution in the nightly.",
    "attachments": {
        "rss.xsl": "https://issues.apache.org/jira/secure/attachment/12355434/rss.xsl",
        "atom.xsl": "https://issues.apache.org/jira/secure/attachment/12357915/atom.xsl"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Brian Whitman",
            "id": "comment-12488419",
            "date": "2007-04-12T16:24:31+0000",
            "content": "Attaching the rss.xsl file – just put this in solr/conf/xslt/ and then try\n\nhttp://localhost:8983/solr/select?q=ipod&wt=xslt&tr=rss.xsl\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12496144",
            "date": "2007-05-15T21:32:51+0000",
            "content": "these seems like a handy little example to me ... anyone see any objections to including this as example/solr/conf/xslt/rss_example.xsl assuming we...\n\n1) add the stock License header\n2) change the title to \"Example Solr RSS Feed\"\n3) fill in the main description tag with some text like...\n   This has been formatted by the sample \"rss_example.xsl\" transform - use your own XSLT to get a nicer RSS feed\n4) eliminate the docpos variable since it isn't used. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12496607",
            "date": "2007-05-17T16:06:29+0000",
            "content": "+1 for including this.  I imagine a lot of people will want this to provide \"subscribe to search results for a saved search\" type functionality. "
        },
        {
            "author": "Walter Underwood",
            "id": "comment-12496608",
            "date": "2007-05-17T16:14:35+0000",
            "content": "What kind of RSS?\n\n-1 unless it is Atom. The nine variants of RSS have some nasty interop problems, even between\nthose that are supposed to implement the same spec.\n\nEven better,  a GData interface returning Atom.\n "
        },
        {
            "author": "Brian Whitman",
            "id": "comment-12496612",
            "date": "2007-05-17T16:32:27+0000",
            "content": "I'm not involved or familiar with the RSS wars but I will say that this is a quick example of getting RSS out of Solr in the easiest possible way. It worked on every single browser and newsreader I tried it on. There's no reason we can't also include an atom_example.xsl as well. I don't understand why you would use GData for this at all, but i am probably out of my league there.\n\n+1 for adding except remove the XSL2.0 references, not worth the  confusion, date handling is not necessary for the exampledocs test case. "
        },
        {
            "author": "Walter Underwood",
            "id": "comment-12496624",
            "date": "2007-05-17T16:59:14+0000",
            "content": "I wasn't in the RSS wars, either, but I was on the Atom working group. That was a bunch of volunteers making a clean, testable spec for RSS functionality (http://www.ietf.org/rfc/rfc4287). RSS 2.0 has some bad ambiguities, especially around ampersand and entities in titles. The default has changed over the years and clients do different, incompatible things.\n\nGData is just a way to do search result stuff that we would need anyway. It is standard set of URL parameters for query, start-index, and categories, and a few Atom extensions for total results, items per page, and next/previous.\n\nhttp://code.google.com/apis/gdata/reference.html "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12496649",
            "date": "2007-05-17T17:54:36+0000",
            "content": "Plus there is contrib/gdata-server under Lucene waiting to be used, so there already is gData-something in Luceneland. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12497684",
            "date": "2007-05-22T03:27:30+0000",
            "content": "As an example, I don't think it matters if this is RSS, Atom, or GData.  It just needs to show that you can transform solr results into a \"standard\" syndication format.\n\nAny real example would need to change the specifics dramatically (unless you really wanted the description to be a list of \"features\" and link to http://localhost:8983/solr/select?q=id:${id})\n\nAs hoss suggests, I think this is good to include as long as the comments make it clear that you need to change stuff to make it 'real' - this may include reformatting to atom or gdata... "
        },
        {
            "author": "Brian Whitman",
            "id": "comment-12497902",
            "date": "2007-05-22T15:53:56+0000",
            "content": "Someone else questioned my choice of RSS spec last night. I don't want my tiny Solr contribution to become a political issue! +1 on noting that it's incomplete and will have to be changed for the user's specific scenario. I'll make it Atom.  "
        },
        {
            "author": "Brian Whitman",
            "id": "comment-12497983",
            "date": "2007-05-22T20:13:18+0000",
            "content": "Adding atom.xsl (replaces rss.xsl)\n\nChanges:\n\n\n\tAdded apache header\n\tAtom, not RSS 2.0\n\n\n\nIt validates on feedvalidator.org as atom 1.0 except for the link rel=self, since that's on localhost) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12498280",
            "date": "2007-05-23T16:05:01+0000",
            "content": "+1 on including this in the 1.2 release "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12498781",
            "date": "2007-05-24T19:08:56+0000",
            "content": "i have no interest in format holy wars, and i'm a big fan of well defined standards, but the fact remains that even if \"RSS\" is ambiguous to feed parsers, the concept isn't ambiguous to people, and the more examples we have for stylizing Solr responses the better ... so i've committed them both with some whitespace cleanup and standardized blurbs about being for example purposes only (matches the HTML example blurb).\n\n\nCommitted revision 541391. "
        }
    ]
}