{
    "id": "SOLR-391",
    "title": "Date type parser is overly fussy",
    "details": {
        "affect_versions": "1.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The parser for the Solr 'date' type is overly picky. It requires an entire year-month-day-T-hour-minute-second-Z string.\n\nHowever, when it is printed out it does not include the Z at the end. Thus, a naive XSL script that translates the output into an XML that can be re-fed with the Solr input format has to include the trailing Z to get dates to parse.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12537484",
            "date": "2007-10-25T03:30:59+0000",
            "content": "> However, when it is printed out it does not include the Z at the end.\nThat would be a bug...\n\nHow does one reproduce this?  I checked XML, JSON, Python, and Ruby output writers... they all include the Z for the DateField type. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12539870",
            "date": "2007-11-03T05:42:42+0000",
            "content": "This was with Solr 1.2 release. If it works now,\nthat's great!\n\n\n\nhttps://issues.apache.org/jira/browse/SOLR-391?page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#action_12537484\n\n\n__________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12539882",
            "date": "2007-11-03T05:48:09+0000",
            "content": "I don't know of any specific change to anything related to Dates or output formats that would have changed this ... can you elaborate on what you meant in your original bug report by \"when it is printed out it does not include the Z at the end\" ?\n\nIn what context are you referring to dates being printed out?\nUsing 1.2 can you reproduce this using the example configs/docs?  \nwhat URL can be used to see dates without the Z ? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13579827",
            "date": "2013-02-16T16:28:07+0000",
            "content": "Cleaning up old JIRAs, re-open if necessary. Appears to be fixed.  "
        }
    ]
}