{
    "id": "SOLR-5557",
    "title": "Replicatable version from master not shown in slave admin panels",
    "details": {
        "affect_versions": "4.6",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "The Overview and Replication panels for a slave core include three fields to show what version of the index is used:\n\nMaster (Searching)\nMaster (Replicable)\nSlave (Searching)\n\nThe \"Master (Replicable)\" field is left blank.\n\n\"steffkes\" on IRC suggests that there is a typo somewhere; that the relevant fields are referenced inconsistently as \"replicatableGeneration\" and \"replicableGeneration\".",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Fred Drake",
            "id": "comment-13849763",
            "date": "2013-12-16T21:48:12+0000",
            "content": "Screen shot showing the missing field:\nhttp://www.fdrake.net/x/solr-admin-ui.png "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13975718",
            "date": "2014-04-21T17:00:12+0000",
            "content": "Sorry for not getting back on this earlier Fred Drake, had a quick look on this and i'm not sure what i thought i was seeing back then :? Can't produce that right now .. i did setup a master + slave, configured replication, made a few commits on the master and i'm seeing the correct versions - on both places, dashboard & replication page.\n\nsince that issue is from December and the only related issue (SOLR-4661) was committed in April .. i'd guess that is still happening for you? If so, let me know.  "
        },
        {
            "author": "Fred Drake",
            "id": "comment-13996951",
            "date": "2014-05-13T22:01:18+0000",
            "content": "I'm getting a reasonable behavior at this point as well:\nhttp://www.fdrake.net/x/solr-admin-ui-today.png\n\nThe size for the replicable version is still omitted, but I'm not worrying about that.\n\nOne difference:  I'm now using Jetty; I believe I was still using Tomcat when I originally reported this. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-14150159",
            "date": "2014-09-26T23:00:56+0000",
            "content": "I'm closing this one now, since it seems to work. if it doesn't .. please reopen and add a explaining comment. "
        }
    ]
}