{
    "id": "SOLR-8872",
    "title": "ChaosMonkey depends on AbstractFullDistribZkTestBase, can't be used with MiniSolrCloudCluster",
    "details": {
        "components": [],
        "type": "Test",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "After burning a bunch of hours/brain cells trying to tweak ChaosMonkey so that i could use it in a MiniSolrCloud test, i finally just gave up and am filing this issue as a TODO for the future.\n\nChaosMonkey's functionality is directly tied to AbstractFullDistribZkTestBase internals (notably the CloudJettyRunner inner class, and the shardToJetty and shardToLeaderJetty Maps).\n\nSomeone smarter then me will have to spend some time figuring out how to untangle this stuff if we ever want to support using CHaosMonkey with MiniSolrCloud.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-18T23:22:45+0000",
            "author": "Mark Miller",
            "content": "We have to do that generally anyway so that all tests can move. If we ever want to remove legacyCloud or properly finish and test ZK=truth mode, we can't have this old style preconfigured SolrCore test. We need to allow all the same stuff work easily with MiniSolrCloudCluster. ",
            "id": "comment-15202354"
        },
        {
            "date": "2016-03-18T23:24:10+0000",
            "author": "Mark Miller",
            "content": "Of course we can also just preconfigure 0 cores and use collection api like some tests do now, but there has been wide agreement we want to move away from that overall pattern to using the MiniSolrCloudCluster anyway. At some point, I or someone else will bite the bullet on it. ",
            "id": "comment-15202355"
        },
        {
            "date": "2016-03-21T00:43:35+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1aa1ba3b3af69cad65b7a411ca88e120a418a598 in lucene-solr's branch refs/heads/jira/SOLR-445 from Chris Hostetter (Unused)\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=1aa1ba3 ]\n\nSOLR-445: harden & add logging to test\n\nalso rename since chaos monkey isn't going to be involved (due to SOLR-8872) ",
            "id": "comment-15203597"
        }
    ]
}