{
    "id": "SOLR-8805",
    "title": "Special Characters is not highlighting",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "Special Characters are not highlighting in solr version 5\n\nFor e.g if i search keyword test & test, but in the highlighter output its only highlighting the value test",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-08T18:35:27+0000",
            "author": "David Smiley",
            "content": "It's a little unclear from your description but is your expectation that '&' is highlighted?\n\nBTW I suspect you should have asked first on the solr-user list because it's quite likely there is no bug ",
            "id": "comment-15185451"
        },
        {
            "date": "2016-03-08T18:52:49+0000",
            "author": "Bala",
            "content": "Do you want me to sent e-mail to solr-user@lucene.apache.org before creating bug?\n\nPlease help. ",
            "id": "comment-15185491"
        },
        {
            "date": "2016-03-08T18:55:14+0000",
            "author": "David Smiley",
            "content": "Now that you've created the issue; might as well follow through with it.  But in the future, please send to solr-user unless you're confident enough in it being a bug and just report it to JIRA. ",
            "id": "comment-15185496"
        },
        {
            "date": "2016-03-08T18:57:14+0000",
            "author": "Bala",
            "content": "Sure. Could you please help on that why '&' is not highlighted in the response ",
            "id": "comment-15185502"
        },
        {
            "date": "2016-03-08T19:08:20+0000",
            "author": "David Smiley",
            "content": "Ok so my assumption is right: you want '&' highlighted.\n\nThis is entirely based on your text analysis configuration (\"analyzer\" in the schema).  You might use Solr's \"analysis\" screen to troubleshoot this.  For example, just to prove this, if you hypothetically switch to nothing but a WhitespaceTokenizerFactory, you should see the highlighting work.\n\nAnother possible problem to consider is query parser interaction.  If you use a guery grammer that treats '&' as a query operator, it isn't highlighted either.  But Solr's shipping QParsers don't do that.  '&&' is a query operator, BTW. ",
            "id": "comment-15185530"
        }
    ]
}