{
    "id": "SOLR-1852",
    "title": "enablePositionIncrements=\"true\" can cause searches to fail when they are parsed as phrase queries",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4.1"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Symptom: searching for a string like a domain name containing a '.', the Solr 1.4 analyzer tells me that I will get a match, but when I enter the search either in the client or directly in Solr, the search fails. \ntest string:  Identi.ca\n\nqueries that fail:  IdentiCa, Identi.ca, Identi-ca\n\nquery that matches: Identi ca\n\n\nschema in use is:\nhttp://drupalcode.org/viewvc/drupal/contributions/modules/apachesolr/schema.xml?revision=1.1.2.1.2.34&content-type=text%2Fplain&view=co&pathrev=DRUPAL-6--1\n\nScreen shots:\n\nanalysis:  http://img.skitch.com/20100327-nt1uc1ctykgny28n8bgu99h923.png\ndismax search: http://img.skitch.com/20100327-byiduuiry78caka7q5smsw7fp.png\ndismax search: http://img.skitch.com/20100327-gckm8uhjx3t7px31ygfqc2ugdq.png\nstandard search: http://img.skitch.com/20100327-usqyqju1d12ymcpb2cfbtdwyh.png\n\nWhether or not the bug appears is determined by the surrounding text:\n\n\"would be great to have support for Identi.ca on the follow block\"\n\nfails to match \"Identi.ca\", but putting the content on its own or in another sentence:\n\n\"Support Identi.ca\"\n\nthe search matches.  Testing suggests the word \"for\" is the problem, and it looks like the bug occurs when a stop word preceeds a word that is split up using the word delimiter filter.\n\nSetting enablePositionIncrements=\"false\" in the stop filter and reindexing causes the searches to match.\n\n\nAccording to Mark Miller in #solr, this bug appears to be fixed already in Solr trunk, either due to the upgraded lucene or changes to the WordDelimiterFactory",
    "attachments": {
        "SOLR-1852_testcase.patch": "https://issues.apache.org/jira/secure/attachment/12440009/SOLR-1852_testcase.patch",
        "SOLR-1852.patch": "https://issues.apache.org/jira/secure/attachment/12439994/SOLR-1852.patch",
        "SOLR-1852_solr14branch.patch": "https://issues.apache.org/jira/secure/attachment/12446096/SOLR-1852_solr14branch.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Peter Wolanin",
            "id": "comment-12850608",
            "date": "2010-03-27T23:36:21+0000",
            "content": "This patch was created by Mark Miller - it's a back port of Solr trunk code plus a tweak to let 1.4 compile\n\nWith this updated WordDelimiterFilter if I reindex the bug seems to be fixed.\n\nIn terms of the bug's symptoms to reproduce it, it looks as though Identi.ca is treated as phrase query as if I had quoted it like \"Identi ca\".  That phrase search also fails.  I had expected that Identi.ca would be the same as Identi ca (i.e. 2 separate tokens, not a phrase). "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12850610",
            "date": "2010-03-28T00:01:03+0000",
            "content": "The changes in the patch originate at SOLR-1706 and SOLR-1657, however I don't think it's actually the same bug as SOLR-1706 intended to fix since the the admin analyzer interface the generated tokens look correct. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12850612",
            "date": "2010-03-28T00:18:36+0000",
            "content": "The changes in the patch originate at SOLR-1706 and SOLR-1657, however I don't think it's actually the same bug as SOLR-1706 intended to fix since the the admin analyzer interface the generated tokens look correct. \n\nYeah, I don't like the situation at all, as its not obvious to me at a glance how the trunk impl fixes your problem, but at the same time how this changed behavior slipped passed the random tests on SOLR-1710. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12850613",
            "date": "2010-03-28T00:27:06+0000",
            "content": "ok, so your bug relates somehow to how the accumulated position increment gap is handled.\n\nThis is how your stopword fits into the situation, somehow the new code is handling it \"better\"  for your case, but perhaps its wrong.\n\nthere are quite a few tests in TestWordDelimiter, which it passes, but I'll spend some time tonight verifying its correctness before we declare success... "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12850671",
            "date": "2010-03-28T13:03:13+0000",
            "content": "attached is a testcase demonstrating the bug.\n\nThe problem is that if you have, for example \"the lucene.solr\", where \"the\" is a stopword, the Solr 1.4 WordDelimiter bumps the position increment of both \"lucene\" and \"solr\" tokens:\n\n\n\tlucene (posInc=2)\n\tsolr (posInc=2)\n\tlucenesolr (posInc=0)\n\n\n\nInstead it should look like:\n\n\n\tlucene (posInc=2)\n\tsolr (posInc=1)\n\tlucenesolr (posInc=0)\n\n\n\nIn my opinion the behavior of trunk is correct, and this is a bug. \nBut I don't know how to fix just Solr 1.4's WDF in a better way than dropping in the entire rewritten WDF... "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12852216",
            "date": "2010-04-01T01:36:43+0000",
            "content": "I'm afraid of WDF, but I don't think I am the only one, and I think it would be good to fix this bug.\n\nIf no one objects, I'd like to commit these patches (testcase and backport the trunk filter) to the 1.5 branch in a few days.\n "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12852233",
            "date": "2010-04-01T03:12:52+0000",
            "content": "I'm confused by that comment - I thought this code is already in 1.5/trunk and the issue is backporting to the 1.4 branch? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12852234",
            "date": "2010-04-01T03:17:55+0000",
            "content": "Peter it is... but admittedly it has not been in trunk for very long, and WDF is pretty complex.\n\nIt's a bit scary to backport a rewrite of it for this reason, but at the same time, we've got this bug \nand the other config bugs found in SOLR-1706, so I think its the right thing to do...  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12852811",
            "date": "2010-04-02T13:19:58+0000",
            "content": "Committed the test to trunk: revision 930262. "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12870624",
            "date": "2010-05-24T14:59:44+0000",
            "content": "now this has been in trunk longer, do you feel any more confident about a back port? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12870628",
            "date": "2010-05-24T15:05:40+0000",
            "content": "now this has been in trunk longer, do you feel any more confident about a back port?\n\nI feel more confident about the new implementation of WordDelimiterFilter, yes.\n\nI suppose the question here is if the 1.5 branch is dead or not (no one seems to commit to it) "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12870631",
            "date": "2010-05-24T15:09:06+0000",
            "content": "Also, Mark mentioned to me he had concerns about 'index back-compat'.\n\nObviously, if we fix the bug, we 'break' this in the sense that you now index with correct positions... "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12871123",
            "date": "2010-05-25T12:56:28+0000",
            "content": "I'm thinking about 1.4 backporting - not sure what's happening with 1.5\n\nYes, you'd have to re-index if we have to backport to 1.4, but I assume that's only going to affect documents that would currently have broken searches? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12873454",
            "date": "2010-05-30T16:41:19+0000",
            "content": "I am willing to do the backport here if people want this in 1.4.1, just let me know. "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12873461",
            "date": "2010-05-30T17:31:06+0000",
            "content": "\nYes, I'd propose to have this in 1.4.1 since it's a pretty serious bug in the places where it manifests. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12874399",
            "date": "2010-06-02T03:35:50+0000",
            "content": "here is the patch for solr 1.4. This also fixes SOLR-1706 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12874727",
            "date": "2010-06-02T18:35:48+0000",
            "content": "Committed revision 950711. Thanks Peter! "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-12910287",
            "date": "2010-09-16T19:59:40+0000",
            "content": "I realize this is closed, but I found a workaround for those who are still working with a pre-fix version.\n\nJust put the stopwords filter after the Word Delimiter filter. That worked for us without impacting much else, until we can get over to the new version. "
        }
    ]
}