{
    "id": "SOLR-6297",
    "title": "Distributed spellcheck with WordBreakSpellchecker can lose suggestions",
    "details": {
        "affect_versions": "4.9",
        "status": "Closed",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When performing a spellcheck request in distributed environment with the WordBreakSpellChecker configured, the shard response merging logic can lose some suggestions. Basically, the merging logic ensures that all shards marked the query as not being correctly spelled, which is good, but also expects all shards to return some suggestions, which isn't necessarily the case. So if shard 1 returns 10 suggestions but shard 2 returns none, the final result will contain no suggestions because the term has suggestions from only 1 of 2 shards.\n\nThis isn't the case with the DirectSolrSpellChecker which works properly.",
    "attachments": {
        "SOLR-6297.patch": "https://issues.apache.org/jira/secure/attachment/12659930/SOLR-6297.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "James Dyer",
            "id": "comment-14086619",
            "date": "2014-08-05T18:58:53+0000",
            "content": "Here is a patch with a failing unit test.  Note that when a word-break suggestion comes solely from 1 shard, it is the \"suggestions\" section that is left off the response.  The suggestion is still there and it is properly used for collations. "
        },
        {
            "author": "James Dyer",
            "id": "comment-14088288",
            "date": "2014-08-06T21:27:00+0000",
            "content": "This patch fixes word-break suggestions by ensuring that both WordBreakSolrSpellChecker and ConjuctionSolrSpellChecker always output every original term, even if the list of suggestions is empty.  This is consistent with the behavior of DirectSolrSpellChecker.\n\nThis approach is problematic for combined-word suggestions as the various shards cannot know which new terms were invented by others.  For this, SpellCheckComponent will need to loosen its requirement that all shards return a term in order for it to be in the final response. "
        },
        {
            "author": "James Dyer",
            "id": "comment-14089685",
            "date": "2014-08-07T19:43:45+0000",
            "content": "This version of the patch handles combine suggestions also.  This requires shards to send out a list of the original query terms in the shard-to-shard response.  When putting the response back together, query terms are always included if they were not part of the original query, even if not all shards returned them in the spellcheck response.  This allows \"original\" terms invented by WordBreakSolrSpellchecker to be included in the final response to the client. "
        },
        {
            "author": "James Dyer",
            "id": "comment-14120147",
            "date": "2014-09-03T17:47:07+0000",
            "content": "Here is an up-to-date patch for trunk. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14121366",
            "date": "2014-09-04T13:57:06+0000",
            "content": "Commit 1622476 from jdyer@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1622476 ]\n\nSOLR-6297: Fix for Distributed WordBreakSolrSpellChecker "
        },
        {
            "author": "James Dyer",
            "id": "comment-14121373",
            "date": "2014-09-04T14:00:18+0000",
            "content": "Working on backport for 4.11 . \n\ncc: Steve Molloy - are you able to verify this trunk version fixes your particular problem? "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14121733",
            "date": "2014-09-04T18:37:43+0000",
            "content": "Commit 1622526 from jdyer@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1622526 ]\n\nSOLR-6297: Fix for Distributed WordBreakSolrSpellChecker "
        },
        {
            "author": "Steve Molloy",
            "id": "comment-14134412",
            "date": "2014-09-15T20:16:57+0000",
            "content": "Sorry for not replying sooner, but yes, I applied the patch to our codebase and it seems to fix the issue. Thanks. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14332941",
            "date": "2015-02-23T05:02:43+0000",
            "content": "Bulk close after 5.0 release. "
        }
    ]
}