{
    "id": "SOLR-3932",
    "title": "SolrCmdDistributorTest either takes 3 seconds or 3 minutes.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "SolrCloud",
            "Tests"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I've looked into this a little in the past, but had not come to a conclusion. It really bugs me because it doubles my test run time from 3 minutes to 6 minutes when it happens.\n\nI've been looking into it today and I think I've tracked the problem down to mostly test bugs. One real bug around distrib commit ordering was also uncovered.",
    "attachments": {
        "stack.txt": "https://issues.apache.org/jira/secure/attachment/12548797/stack.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13474465",
            "date": "2012-10-11T19:53:33+0000",
            "content": "Hmm...not sure if the fixes around the test I made just made this less likely to trigger or what...but once I also did a fix for SOLR-3933 I started seeing the long hangs again.\n\nIt seems mainly taking a long time in socket read calls...\n\nA sample stack trace attached. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13474470",
            "date": "2012-10-11T19:56:59+0000",
            "content": "I'm not sure what the heck is on the other end of these socket read hangs - the stack trace indicates it could only be jetty?\n\nI've tried a variety of settings in both jetty and httpclient to how this changes - I did find that if i drop max connections per host in http client to 2 or 3, I don't seem to see the issue.\n\nAlso, only allowing like 2 httpclients to fire at a time (rather than the default of 8 per host), seemed to make the issue go away or happen much less frequently.\n\nBoth options would seem to simply decrease the load...\n\nI'm not sure what is up yet - I've also tried upgrading httpclient/components - but no luck. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13474574",
            "date": "2012-10-11T22:40:11+0000",
            "content": "So doing other things to relieve the stress also hide the issue - eg raising our update buffer size...\n\nI pinged yonik about this to see if he had any ideas and he brought up that I should try the NIO jetty Connector impl. For various reasons we don't currently default to it.\n\nThat actually seems to work much better. We have advanced a couple Jetty versions since the Connector impl was chosen, so perhaps it's time to come back to this choice. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13474581",
            "date": "2012-10-11T22:49:22+0000",
            "content": "There is still more to investigate, but I created SOLR-3935 to track looking into changing our default Connector impl. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610640",
            "date": "2013-03-22T16:23:27+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1402362\n\nSOLR-3933: Distributed commits are not guaranteed to be ordered within a request.\n\nSOLR-3939: An empty or just replicated index cannot become the leader of a shard after a leader goes down. \n\nSOLR-3971: A collection that is created with numShards=1 turns into a numShards=2 collection after starting up a second core and not specifying numShards. \n\nSOLR-3932: SolrCmdDistributorTest either takes 3 seconds or 3 minutes. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610644",
            "date": "2013-03-22T16:23:47+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1402361\n\nSOLR-3933: Distributed commits are not guaranteed to be ordered within a request.\n\nSOLR-3939: An empty or just replicated index cannot become the leader of a shard after a leader goes down. \n\nSOLR-3971: A collection that is created with numShards=1 turns into a numShards=2 collection after starting up a second core and not specifying numShards. \n\nSOLR-3932: SolrCmdDistributorTest either takes 3 seconds or 3 minutes. "
        }
    ]
}