{
    "id": "SOLR-8228",
    "title": "Facet Telemetry",
    "details": {
        "components": [
            "Facet Module"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "As the JSON Facet API becomes more complex and has more optimizations, it would be nice to get a better view of what is going on in faceting... what methods/algorithms are being used and what is taking up the most time or memory.\n\n\n\tthe strategy/method used to facet the field\n\tnumber of unique values in facet field\n\tmemory usage of facet field itself\n\tmemory usage for request (count arrays, etc)\n\ttiming of various parts of facet request (finding top N, executing sub-facets, etc)\n\n\n\nThis will also help with unit tests, making sure we have proper coverage of various optimizations.\n\nSome of this information collection may make sense to happen all the time, while other information may be calculated only if requested.\n\nWhen adding facet info to a response, it could be done one of two ways:\n 1. in the existing debug block in the response, along with other debug info, structured like \n 2. directly in the facet response (i.e. in something like \"_debug_\" that is a sibling of \"buckets\")\n\nWe need to also consider how to merge distributed debug info (and add more info about the distributed phase as well).  Given this, (2) may be simpler (adding directly to facet response) as we already have a framework for merging.\n\nAlthough not necessarily part of this initial issue, we should think about how to get information about certain requests that does not involve modifying the actual request or response.  For example, \"log telemetry data for the next N requests that match this pattern\".  Something like that would more naturally point to method 1 for returning the data (i.e. separate from the response).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-21T14:22:56+0000",
            "author": "Otis Gospodnetic",
            "content": "\nAlthough not necessarily part of this initial issue, we should think about how to get information about certain requests that does not involve modifying the actual request or response. For example, \"log telemetry data for the next N requests that match this pattern\". Something like that would more naturally point to method 1 for returning the data (i.e. separate from the response).\n\nYes. Think operations and monitoring, and tools that need to collect this data, but are obviously not Solr clients issuing queries and collecting this info from responses.  So, logs, JMX, stats API, that sort of stuff. ",
            "id": "comment-15020494"
        }
    ]
}