{
    "id": "SOLR-9077",
    "title": "Streaming expressions should support collection alias",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.4"
        ],
        "affect_versions": "5.5.1",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "Streaming expressions should support collection aliases. \n\nWhen I tried to access collection alias I get a null pointer exception. \n\nissue seems to be related to following code: clusterState.getActiveSlices returns null \n\n\nCollection<Slice> slices = clusterState.getActiveSlices(this.collection);\n\n\n\nfix seems to fairly simple , clusterState.getActiveSlices can be made aware of collection alias. I am not sure what will happen when we have large alias which has hundred of slices.",
    "attachments": {
        "SOLR-9077.patch": "https://issues.apache.org/jira/secure/attachment/12836177/SOLR-9077.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-16T17:10:04+0000",
            "author": "Kevin Risden",
            "content": "Dennis Gove - Looks like there is some related code to getting info about aliases here:\n\nhttps://github.com/apache/lucene-solr/blob/master/solr/solrj/src/java/org/apache/solr/client/solrj/impl/CloudSolrClient.java#L1299\n\nIn CloudSolrStream, all that looks like it needs to be done is get all the collections (from aliases too) and then add all the replicas from those collections. I can put a patch together for that.\n\nAre there other places where aliases would be used that I need to check? ",
            "id": "comment-15580253"
        },
        {
            "date": "2016-10-17T13:32:33+0000",
            "author": "Dennis Gove",
            "content": "It might be necessary to do that in each source stream, though a centralized location might be better. The StreamFactory could be a place to store the aliases after looking them up but I'm not 100% sure that's the best place. ",
            "id": "comment-15582274"
        },
        {
            "date": "2016-10-31T17:02:08+0000",
            "author": "Kevin Risden",
            "content": "First pass at trying to make aliases work. There are no tests yet but existing tests pass. This is an approach of refactoring getting slices. ",
            "id": "comment-15622734"
        },
        {
            "date": "2016-10-31T17:26:12+0000",
            "author": "Kevin Risden",
            "content": "Attaching patch with randomized alias vs collection for JdbcTest, StreamingTest, StreamExpressionTest, and JDBCStreamTest. Tests seem to be passing for me locally.\n\nJoel Bernstein or Dennis Gove - Can you take a look and see if this is sane? ",
            "id": "comment-15622796"
        },
        {
            "date": "2016-10-31T17:32:16+0000",
            "author": "Kevin Risden",
            "content": "Fixed issue w/ StatementImpl for JDBC when using alias. ",
            "id": "comment-15622812"
        },
        {
            "date": "2016-10-31T18:29:44+0000",
            "author": "Kevin Risden",
            "content": "Remove some unused imports ",
            "id": "comment-15622960"
        },
        {
            "date": "2016-10-31T20:33:08+0000",
            "author": "Joel Bernstein",
            "content": "Looks good from a quick review, but it's a pretty big patch. It will take a little time to take the whole thing in. If you're feeling comfortable with it feel free to commit, I'm sure this code will get exercised plenty before the 6.4 release. ",
            "id": "comment-15623330"
        },
        {
            "date": "2016-10-31T20:38:33+0000",
            "author": "Kevin Risden",
            "content": "Yea most of the changes are actually test variable changes (COLLECTION -> COLLECTIONORALIAS). Wasn't sure how else to make that change. The important section is confined to CloudSolrStream.getSlices(). The changes I'm concerned with are the FeaturesSectionStream, ParallelStream, TextLogitStream, and TopicStream. These all had getActiveSlices. Not sure the slices HAD to be for a specific collection. Now they should work with all slices from all collections in an alias.\n\nAny easier way to view is here: https://github.com/apache/lucene-solr/commit/1e9a285d53ee1a57a0229c4eaf6666deb8f13c35 ",
            "id": "comment-15623346"
        },
        {
            "date": "2016-10-31T20:49:47+0000",
            "author": "Joel Bernstein",
            "content": "ParallelStream should be fine as it's just a bag of worker nodes. We may not want to support aliases for the FeatureSelectionStream, TextLogitStream and TopicStream. In particular the TopicStream relies on checkpoints which are specific to a physical collection. The FeatureSelectionStream and TextLogitStream probably don't need to support alias and may just complicate things.\n ",
            "id": "comment-15623381"
        },
        {
            "date": "2016-11-01T17:29:29+0000",
            "author": "Kevin Risden",
            "content": "Currently the matching logic is as follows:\n\n\tcollection name case sensitive\n\tcollection name case insensitive\n\talias name case sensitive\n\n\n\nThis means that current behavior for TopicStream, FeatureSelectionStream, and TextLogitStream would be unaffected and would just add the alias support. Are there any known downsides to using aliases other than maybe complicating things? It looks to me that slices are what is used for the checkpoints so that would just work with aliases getting more slices. \n\nI'll double check the tests for TopicStream, FeatureSelectionStream, and TextLogitStream to make sure those are being tested with aliases.\n\nOne item that I might adjust with the tests is to make sure aliases are pointing to multiple collections. Currently the alias only points to a single collection. ",
            "id": "comment-15626072"
        },
        {
            "date": "2016-11-01T19:57:27+0000",
            "author": "Suds",
            "content": "One issue I faced is I was working with large cluster ~40 nodes (40 shards) in that case it would have  many slices per alias not sure if we need to throw error as it may cause issues while creating fixed size threadpool if no of slices > some number? ",
            "id": "comment-15626500"
        },
        {
            "date": "2016-11-01T21:39:34+0000",
            "author": "Joel Bernstein",
            "content": "The problem with aliases with Topics is that encourages using the alias as a pointer to the collection. When someone reassigns the alias to a different collection, it will break the topic even if the data is the same. I think it makes sense to treat topics as an outlier and not support aliases for it.\n ",
            "id": "comment-15626756"
        },
        {
            "date": "2016-11-04T17:04:33+0000",
            "author": "Kevin Risden",
            "content": "Patch that makes TopicStream, FeatureSelectionStream, and TextLogitStream not support aliases. It would be easy to add later by changing the getSlices checkAlias parameter. ",
            "id": "comment-15637011"
        },
        {
            "date": "2016-11-04T17:05:46+0000",
            "author": "Kevin Risden",
            "content": "Suds - Not sure if this would cause an issue. I would leave that as a follow up if that is an issue. Alias support is missing for Parallel SQL/JDBC and would love to get this in for 6.4. ",
            "id": "comment-15637018"
        },
        {
            "date": "2016-11-16T02:34:39+0000",
            "author": "ASF subversion and git services",
            "content": "Commit ace423e958182aa8ad6329f5cc1dc3ca6cd877c7 in lucene-solr's branch refs/heads/master from Kevin Risden\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ace423e ]\n\nSOLR-9077: Streaming expressions should support collection alias ",
            "id": "comment-15669140"
        },
        {
            "date": "2016-11-16T02:47:18+0000",
            "author": "ASF subversion and git services",
            "content": "Commit e3db9f3b8a28e1de0b6fcd5cb358a948f7a23423 in lucene-solr's branch refs/heads/branch_6x from Kevin Risden\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e3db9f3 ]\n\nSOLR-9077: Streaming expressions should support collection alias ",
            "id": "comment-15669172"
        }
    ]
}