{
    "id": "SOLR-4105",
    "title": "SolrCloud - Restarting a Solr Node Causes Random Results",
    "details": {
        "affect_versions": "6.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "For Brief description, basically restarting a Solr instance in cloud causes a weird behavior, it shows results, randomly from the instance itself and then the leader, which causes seeing 0 results and then correct amount of results.\n\nIn addition to this, the restarted node wont be sync'ed with the rest of the cloud, unless you delete the data folder's contents before restarting.\n\nFor more details, you can follow the thread here:\n\nYou can see the details and flow of the issue here: http://lucene.472066.n3.nabble.com/Weird-Behaviour-on-Solr-5x-SolrCloud-td4021219.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Po Rui",
            "id": "comment-13502612",
            "date": "2012-11-22T06:50:37+0000",
            "content": "It cause the load balance for search. it means your search requests may not handle by instance A even you send them to A. more detail:\n1 slice with 2 shards refer to A(leader) and B(replica).when you send a search request to A it assign to A or B randomly by A.\nso the situation in http://lucene.472066.n3.nabble.com/Weird-Behaviour-on-Solr-5x-SolrCloud-td4021219.html is normal. \nThe problem is the restarted B doesn't recovery to the leader A. it may be a bug or cause a uncompleted feature due to the recovering base on file level and commit version  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13505745",
            "date": "2012-11-28T18:19:43+0000",
            "content": "This was on trunk Po? If so, I think recovery should work now. "
        },
        {
            "author": "Deniz Durmus",
            "id": "comment-13506056",
            "date": "2012-11-28T23:44:07+0000",
            "content": "yes, it is now working properly. "
        },
        {
            "author": "Po Rui",
            "id": "comment-13507167",
            "date": "2012-11-30T07:34:21+0000",
            "content": "\n\n\nMark \n   sometimes the recovery thread doesn't work well. for 4.0 it always failed in some case. we are working on the root cause.\n\n\n\n "
        }
    ]
}