{
    "id": "SOLR-137",
    "title": "fieldtype -> fieldType consistency change in schema.xml",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Pasting from solr-dev to track this:\n\nA #code4libber made this comment a moment ago:\n\n     \"(nitpick) when you finalize the DTD for schema.xml, could you\nmake fieldtype camel-case like the others. Or make the others lower-\ncase.\"\n\nI nixed the thought of a DTD, but it does look funny now that I look\nat it.\n\nI agree the inconsistency isn't ideal.\nWhat's your preference... all camel case or all lower?\n\nI think camelCase is fine since it'd only require one place to be changed instead of others.  Doesn't matter to me at all personally... I'll tinker with schema.xml to tweak it, so as long as the example schema.xml is solid and consistent I'm happy.  And, maybe, just maybe schema.xml will be generated from a user-interface driven model... hmmmm.... I'm still on the fence on whether schema.xml should be generated or generic, or a hybrid somehow.\n\n Perhaps we can modify it to be case-insensitive (to keep\nbackwards compatibility)?   Or if it already is case-insensitive we\nshould make the example schema.xml's to be consistent.\n\nThoughts?\n\nIt is case sensitive, but it shouldn't be too hard to make things\nconsistent and keep back compatiblity, and performance doesn't matter\nsince it's parsing at startup.   Then we should erase every trace of\nthe old style in the docs and example.\n\n+1",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12492942",
            "date": "2007-05-01T20:47:38+0000",
            "content": "this was fixed by yonik on April 11 in r527594\n\nhttp://svn.apache.org/viewvc?view=rev&revision=527594 "
        }
    ]
}