{
    "id": "SOLR-3181",
    "title": "New Admin UI, allow user to somehow cut/paste all the old \"Zookeeper\" info.",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When tracking down issues with ZK, the devs ask about various bits of data from the cloud pages. It would be convenient to be able to just capture all the data from the old /solr/admin/zookeeper.jsp page in the admin interface to be able to send it to anyone debugging the info. \n\nPerhaps just a \"get debug info for Apache\". Or even more cool \"copy debug info to clipboard\" if that's possible. Is this just the raw data that the cloud view is manipulating? It doesn't have to be pretty although indentation would be nice.",
    "attachments": {
        "SOLR-3181.patch": "https://issues.apache.org/jira/secure/attachment/12516675/SOLR-3181.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13219317",
            "date": "2012-02-29T16:18:33+0000",
            "content": "This is a separate bit of functionality, though. That said if it's easy to put in 3162  we can just do it there and close this JIRA. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13219336",
            "date": "2012-02-29T16:38:08+0000",
            "content": "Well, it depends ;o)\n\nFirst, what data should be included? i tried to transfer all (relevant?) information to the new cloud-tab. left out the count of children, just because you see them in the tree .. and the version is one click away in the details on the right (together w/ all the other properties)\n\nPerhaps it's the easiest of you attach one sample here? Just format it, like it's the best for you (as dev) to work with and i'll try to generate it like that?\n\nSecond (you knew it, right? *g), copying to the Clip should be easy while using http://code.google.com/p/zeroclipboard/ . If the Browser does not support this, we could just show a Layer containing the Output so that the User could manually copy + paste it.\n\n– Edit\n\nAh, just to mention it .. the \"Content Preview\" as it's available in the old interface was dropped it .. i don't know if this is really helpful? Most of the Files are just showing the included License-Header, and even if they start with real content, it's truncated :/ "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13219372",
            "date": "2012-02-29T18:03:15+0000",
            "content": "bq: ...what data should be included?\n\nAll of it <G>. The idea here is someone says \"I'm having trouble\", and we can reply \"copy me all the data when you press ###\". Don't get me wrong, the navigation is great. But a new user (or even an experienced one) doesn't necessarily know which bits are important. I'm thinking if they had a \"get troubleshooting dump\" button that went out and got, as a start, the raw page that pops up in the old zookeeper.jsp page however ugly, it'd save a world of back-and-forth.\n\nAnd if the schema.xml and solrconfig.xml available through the Cloud stuff (for any node) were available, well!\n\nAnd as to how it gets shown, whether copied to clipboard or not I leave as an exercise to the implementer <G>.. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13220029",
            "date": "2012-03-01T13:50:19+0000",
            "content": "Hm, about something like that? We could allow ?dump=true as Param for the ZookeeperServlet, reuse printZnode() which is already used for showing the Details\n\n(Yes, the Output contains actually escaped quotes, because the Change from SOLR-3162 is pending) "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13223243",
            "date": "2012-03-06T13:26:07+0000",
            "content": "+1\nWhy stop there  We could generate a debug-info.zip including a complete ZK tree dump, stats, system parameters, HW & OS info (perhaps through http://support.hyperic.com/display/SIGAR/), info from JMX etc. That would be an incredibly useful remote troubleshooting tool! But I guess it would be a separate JIRA... "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13223383",
            "date": "2012-03-06T16:30:31+0000",
            "content": "Should fix the problem with multiple escapes by using BytesRef.utf8ToString. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13224480",
            "date": "2012-03-07T16:31:37+0000",
            "content": "Fixed as part of SOLR-3162\nr: 1298010 "
        }
    ]
}