{
    "id": "SOLR-6535",
    "title": "Adding new inKstall Solr book \"Mastering Apache Solr\" to official Solr website book section and news",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Mathieu Nayrolles and Inkstall Publications are proud to announce their latest book —Mastering Apache Solr.  This book will empower you to provide a world-class search experience to your end users through the discovery of the powerful mechanisms presented in it.\n\nMastering Apache Solr is a short, focused, practical, hands-on guide containing crisp, relevant, systematically arranged, progressive chapters. These chapters contain a wealth of information presented in a direct and easy-to-understand manner. Highlighting Solr's supremacy over classical databases in full-text search, this book covers key technical concepts which will help you accelerate your progress in the Solr world.\n\nMastering Apache Solr starts with an introduction to Apache Solr, its underlying technologies, the main differences between the classical database engines, and gradually moves to more advance topics such as boosting performance. In this book, we will look under the hood of a large number of topics and discuss answers to pertinent questions such as why denormalize data, how to import classical databases' data inside Apache Solr, how to serve Solr through five different web servers, how to optimize them to serve Solr even faster. An important and major topic covered in this book is Solr's querying mechanism, which will prove to be a strong ally in our journey through this book. We then look at boosting performance and deploying Solr using several servlet servers. Finally, we cover how to communicate with Solr using different programming languages, before deploying it in a cloud-based environment.\n\nMastering Apache Solr is written lucidly and has a clear simple approach. From the first page to the last, the book remains practical and focuses on the most important topics used in the world of Apache Solr without neglecting important theoretical fundamentals that help you build a strong foundation.",
    "attachments": {
        "book_mas.jpg": "https://issues.apache.org/jira/secure/attachment/12669739/book_mas.jpg",
        "books.mdtext": "https://issues.apache.org/jira/secure/attachment/12669740/books.mdtext"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mathieu N",
            "id": "comment-14139028",
            "date": "2014-09-18T15:00:17+0000",
            "content": "book cover "
        },
        {
            "author": "Mathieu N",
            "id": "comment-14139029",
            "date": "2014-09-18T15:00:31+0000",
            "content": "diff "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14181767",
            "date": "2014-10-23T18:52:23+0000",
            "content": "I committed the text in the attached patch to the books page, with one change: I removed the links to the publisher's page for the book, except for two places: the first mention of the title, and the book cover; that's what's done with the other books.\n\nI added the book's cover image to the book slide, displacing the oldest of the four books there.\n\nI also added the book cover image to the new site being built over at SOLR-6058 - the regularly built version is here: http://lucene.lukesh.com/solr/. (The book descriptions there aren't yet in sync with the existing website.) "
        }
    ]
}