{
    "id": "SOLR-4945",
    "title": "Japanese Autocomplete and Highlighter broken",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Autocomplete is implemented with Highlighter functionality. This works fine for most of the languages but breaks for Japanese.\n\nmultivalued,termVector,termPositions and termOffset are set to true.\n\nHere is an example:\n\nQuery: product classic.\n\nResult:\n\nActual : \n\nこの商品の互換性の機種にproduct 1 やclassic Touch2　が記載が有りません。 USB接続ケーブルをproduct 1 やclassic Touch2に付属の物を使えば利用出来ると思いますが 間違っていますか？\n\nWith Highlighter (<em> </em> tags being used):\n\nこの商品の互換性の機種<em>にproduct</em> 1 <em>やclassic</em> Touch2　が記載が有りません。 USB接続ケーブルをproduct 1 やclassic Touch2に付属の物を使えば利用出来ると思いますが 間違っていますか？\n\nThough query terms \"product classic\" is repeated twice, highlighting is happening only on the first instance. As shown above.\n\nSolr returns only first instance offset and second instance is ignored.\n\nAlso it's observed, highlighter repeats first letter of the token if there is numeric.\nFor eg.Query : product and We have product1, highlighter returns as p<em>product</em>1.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Christian Moen",
            "id": "comment-13690131",
            "date": "2013-06-21T08:34:18+0000",
            "content": "Hello Shruthi,\n\nDoes this have anything to do with autocomplete or is this solely a highlighting issue?  Which field type are you using?  Are you using JapaneseTokenizer as part of this field type with search mode turned on?  Thanks. "
        },
        {
            "author": "Shruthi Khatawkar",
            "id": "comment-13690421",
            "date": "2013-06-21T16:05:17+0000",
            "content": "Hi Christian,\n\nFor me this looks to be an issue with highlighting, suggestedTextHighlightOffset is returning incorrect values.\nWhen I run the same Query just with Autocomplete everything looks fine.\n\nWe are using - SenTokenizerFactory.\n\nIn the Analysis tab I can see words being tokenised correctly. For most of the cases Term Position and Source start end are defined right. For the above scenarios all the offset values seems to be right.\n\nJust one observation though (this is pretty confusing)- In few cases SenTokenizerFactory returns same offset values for repetitive words. For e.g.. if there are 2 instances of product in a sentence then both have the same source start and end as 0,4.  "
        },
        {
            "author": "Shruthi Khatawkar",
            "id": "comment-13693531",
            "date": "2013-06-26T00:19:58+0000",
            "content": "Hi,\n\nCan somebody please throw light on this.\n\nRegards,\nShruthi "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13693894",
            "date": "2013-06-26T10:33:27+0000",
            "content": "Hello Shruthi,\n\nCould you confirm if you see this problem when using JapaneseTokenizerFactory?  \n\nSenTokenizerFactory isn't part of Solr and if you are seeing funny offsets there, that could be the root cause of this.  This is my speculation only – I really don't know...\n\nI believe JapaneseTokenizerFactory in normal mode gives a similar segmentation to SenTokenizer and it would be good to see if we can reproduce this using JapaneseTokenizerFactory.\n\nMany thanks. "
        },
        {
            "author": "Shruthi Khatawkar",
            "id": "comment-13694138",
            "date": "2013-06-26T18:27:52+0000",
            "content": "Thanks Christian.\n\nWe are using Solr 1.4.1 version, is JapaneseTokenizerFactory compatible with this version?\n\nRegards,\nShruthi "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13694148",
            "date": "2013-06-26T18:40:38+0000",
            "content": "No, it's not. JapaneseTokenizerFactory is available in 3.6 or newer.  Kindly upgrade to the latest version of Solr (currently 4.3.1) and see if the problem persists.  If it does, please indicate how you reproduced it in detail so we can start investigating the cause.  Thanks. "
        },
        {
            "author": "Shruthi Khatawkar",
            "id": "comment-13694152",
            "date": "2013-06-26T18:48:30+0000",
            "content": "Thanks Christian.\n\nAs of now we have no plans to upgrade Solr, is there any other way I can resolve this?\n\nApparently, we have Autocomplete and Highlight working fine for most of our other languages.\n\nRegards,\nShruthi "
        },
        {
            "author": "Jun Ohtani",
            "id": "comment-13694508",
            "date": "2013-06-27T05:49:56+0000",
            "content": "Hello Shruthi,\n\nYour situation is same this issue ?\nhttps://issues.apache.org/jira/browse/SOLR-1624\n "
        },
        {
            "author": "Shruthi Khatawkar",
            "id": "comment-13694511",
            "date": "2013-06-27T05:52:53+0000",
            "content": "Hi Jun,\n\nYes it is, but it is only for Japanese Language.For other languages it works fine.\n\nI did try applying the patch, but had no luck.\n\nRegards,\nShruthi\n\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13694525",
            "date": "2013-06-27T06:31:25+0000",
            "content": "This has nothing to do with Japanese, it can happen with other Analyzer-combinations, too. The Japanese analyzer in your case just triggers this bug in the highlighter.\n\nThe patch from this issue won't apply to such old Solr versions. I think you have to upgrade! "
        },
        {
            "author": "Shruthi Khatawkar",
            "id": "comment-13695587",
            "date": "2013-06-28T17:32:35+0000",
            "content": "Thanks All.\n\nRegards,\nShruthi "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539468",
            "date": "2016-10-02T01:28:02+0000",
            "content": "The issue was fixed in later (3.x) version of Solr "
        }
    ]
}