{
    "id": "SOLR-4057",
    "title": "SolrCloud will not run on the root context.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "If you try and pass an empty hostContext to solrcloud when trying to run on the root context, the empty value simply triggers using the default value of 8983.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Roman Shaposhnik",
            "id": "comment-13494313",
            "date": "2012-11-09T21:04:48+0000",
            "content": "it appears that specifying hostContext=\".\" works as expected or am I missing something? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13494327",
            "date": "2012-11-09T21:32:45+0000",
            "content": "Interesting - doesn't seem very intuitive to me though - especially because we don't ask for a path - we ask for a string value of the context - at the least it would still be an issue that it's not documented - and it's not something I'd want to require seeing in the resulting URL strings. Even if some people thought it was clear that it was a path so you could use . for the root context, I don't think most people associate . and .. with URL's the same way they do with files. I and at least one other did not anyway \n\nIt's a great workaround though.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13494344",
            "date": "2012-11-09T21:59:50+0000",
            "content": "Changing to minor priority given the workaround - I'd like to fix the cosmetic issue and make documentation less of an issue - I'll also add doc to the wiki to be explicit on the topic. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13498084",
            "date": "2012-11-15T15:57:24+0000",
            "content": "I actually don't like the idea of making empty string work for the root context - in pretty much all the other cases, empty string means take the default and the default is /solr. I'd change the default to /, but it's a back compat issue I'd rather not deal with. So it seems the best method is document a token for this - and \".\" seems as good as any. We can document and visually clean it up by removing it from the url. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13511134",
            "date": "2012-12-06T05:50:36+0000",
            "content": "If the current patch in SOLR-4136 gets committed, people can use hostContext=\"/\" to specify that they are running on the root context – to me this seems more natural then using hostContext=\".\" (and i think less prone to potential problems/lag with servlet contains that might handle requests for \"http://foo:8080/./collection1/bar\" by issuing a redirect to http://foo:8080/collection1/bar\")\n\nI think we should actually go one step further and start encouraging people to always specify the leading \"/\" when using hostContext, so it more naturally matches the way servlet containers are configured, and make this change to the exmaple jetty context file...\n\n\nIndex: example/contexts/solr.xml\n===================================================================\n--- example/contexts/solr.xml\t(revision 1417733)\n+++ example/contexts/solr.xml\t(working copy)\n@@ -1,8 +1,8 @@\n <?xml version=\"1.0\"?>\n <!DOCTYPE Configure PUBLIC \"-//Jetty//Configure//EN\" \"http://www.eclipse.org/jetty/configure.dtd\">\n <Configure class=\"org.eclipse.jetty.webapp.WebAppContext\">\n-  <Set name=\"contextPath\">/solr</Set>\n+  <Set name=\"contextPath\"><SystemProperty name=\"hostContext\" default=\"/solr\"/></Set>\n   <Set name=\"war\"><SystemProperty name=\"jetty.home\"/>/webapps/solr.war</Set>\n   <Set name=\"defaultsDescriptor\"><SystemProperty name=\"jetty.home\"/>/etc/webdefault.xml</Set>\n   <Set name=\"tempDirectory\"><Property name=\"jetty.home\" default=\".\"/>/solr-webapp</Set>\n-</Configure>\n\\ No newline at end of file\n+</Configure>\n\n\n\n...so that we can easily document using java -DhostContext=/ [other cloud options] -jar start.jar as a trivial way to specify the context path that is used both for jetty to listen at and solr to publish in zk. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13528256",
            "date": "2012-12-10T20:36:41+0000",
            "content": "Okay, cool - sounds good to me. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13530502",
            "date": "2012-12-12T23:44:30+0000",
            "content": "neccessary changes in linked issue have ben commited.  I've updated wiki to note that using the leading slash of context should be used starting in 4.1, so it should be clear to folks how to use the root context "
        }
    ]
}