{
    "id": "SOLR-5545",
    "title": "Solr should warn if schema.xml has unrecognized tags or typos in tag names",
    "details": {
        "affect_versions": "4.6",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "If schema.xml contains unknown tags (tag names with typos) but the document is well-formed then Solr starts without letting user know that there are some potential configuration problems. For example, here is schema.xml I had:\n\n\n    <fieldType name=\"text_engram_front\" class=\"solr.TextField\">\n      <avalyzer type=\"index\">\n        <tokenizer class=\"solr.StandardTokenizerFactory\"/>\n        <filter class=\"solr.ICUTransformFilterFactory\" id=\"Any-Latin;Latin-ASCII;Lower()\"/>\n        <filter class=\"solr.EdgeNGramFilterFactory\" minGramSize=\"1\" maxGramSize=\"20\"/>\n      </avalyzer>\n      <analyzer type=\"query\">\n<!-- skipped -->\n      </analyzer>\n    </fieldType>\n\n\n\nNote that index analyzer tag name is written as avalyzer (it's v instead of n). Solr would save me several hours if it logged a warning that schema.xml contains unknown tags.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13845263",
            "date": "2013-12-11T10:16:19+0000",
            "content": "Actually there is already an open issue for that topic: SOLR-1758 .. besides that:\n\nAs for schema.xml: because of some design decisions made way early on in  Solr's lifespan, this is pretty much impossible – every custom  TokenFilterFactory or TokenizerFactory is allowed to define whatever attributes it wants, so while an XSD could be created to verify if some (incredibly simple) schema.xml files are valid, lots of schema.xml files that failed validation could be run fine with the proper plugins loaded. \n– Hossman on http://lucene.472066.n3.nabble.com/schema-xml-XSD-DTD-tp778505p780720.html "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13845285",
            "date": "2013-12-11T10:55:00+0000",
            "content": "Actually, the Tokenizer/TokenFilter/CharFilters already throw an exception, if they get invalid properties as attributes. This only works with \"new\" factories, older ones maybe from plugins cannot handle this. All the provided ones from the distribution of Lucene can do this.\n\nBut we do not check the general structure of the XML document. I don't think a schema would help (as Hoss pointed out), but we can maybe handle that in the schema parser that it throws execption on unknown elements / attributes (like the analysis factories do). "
        }
    ]
}