{
    "id": "SOLR-5303",
    "title": "numShards property is not properly taken into account",
    "details": {
        "affect_versions": "4.2,                                            4.3.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "It looks like the 'numShards' argument is ignored by SolR. The number of shards is always defaulted to 1 unless cores are dynamically created with Collection API.\n\nI had this log :\nINFO: numShards not found on descriptor - reading it from system property, I looked for the piece of code where the log was located ((https://svn.apache.org/repos/asf/lucene/dev/trunk/solr/core/src/java/org/apache/solr/cloud/ZkController.java)) and I found a possible error :\n\nlog.info(\"numShards not found on descriptor - reading it from system property\");\nnumShards = Integer.getInteger(ZkStateReader.NUM_SHARDS_PROP);",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13786989",
            "date": "2013-10-05T09:34:04+0000",
            "content": "I can't reproduce this with Solr 4.3.1. I used the Example A from SolrCloud wiki at http://wiki.apache.org/solr/SolrCloud#Example_A:_Simple_two_shard_cluster with -DnumShards=2 and 2 shards are indeed created.\n\nThe code in question is correct. From Integer.getInteger javadocs:\n\nDetermines the integer value of the system property with the specified name.\nThe first argument is treated as the name of a system property. System properties are accessible through the System.getProperty(String) method. The string value of this property is then interpreted as an integer value and an Integer object representing this value is returned. Details of possible numeric formats can be found with the definition of getProperty.\nIf there is no property with the specified name, if the specified name is empty or null, or if the property does not have the correct numeric format, then null is returned.\nIn other words, this method returns an Integer object equal to the value of:\ngetInteger(nm, null)\n\nThe maxShardsPerNode is another property which limits the actual number of physical shards per Solr node. This defaults to 1 unless you're using the collection API. Perhaps that is confusing you? I'll close this issue and I request you to discuss this on the solr-user mailing list. "
        },
        {
            "author": "Federico Piai",
            "id": "comment-13789089",
            "date": "2013-10-08T10:32:15+0000",
            "content": "OK I'm sorry for the false positive. What actually confused me is that numShards must be passed as system property (with -D option) while for instance solr.home can be passed this way or as an environment variable (eg in Tomcat's context.xml). I tried to put numShards in context.xml of SolR but it did not work.\nThank you for your answer. "
        }
    ]
}