{
    "id": "SOLR-5771",
    "title": "Add SuppressSSL instead of static boolean in SolrTestCaseJ4",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.8",
            "6.0"
        ],
        "components": [
            "Tests"
        ],
        "type": "Test",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Currently, as of 4.7, solr test-framework classes can no longer be used by downstream projects, because ssl configuration will fail (and it expects this stuff from outside the source code tree in example/ etc, which makes it impossible).\n\nThere is a boolean to disable SSL, but it cannot work correctly unless you set it in a static initializer (to \"beat\" the SolrTestCaseJ4.beforeClass to the punch). Then the problem is afterClass turns it off, so if you have e.g. a base class run by 2 tests in the same jvm, boom.\n\nAn alternative way, so people can use test-framework again, is to just have an annotation to do this. Thats how e.g. codecs and so on are disabled in lucene.",
    "attachments": {
        "SOLR-5771.patch": "https://issues.apache.org/jira/secure/attachment/12630799/SOLR-5771.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13910814",
            "date": "2014-02-24T21:10:16+0000",
            "content": "heres a patch to start with... seems to work... "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13910838",
            "date": "2014-02-24T21:29:23+0000",
            "content": "Thanks for bringing this up! This static pattern looked so wrong to me! I was confronted by this on the weekend when I cleaned up the morphlines code, but I was afraid to touch it; wanted to come back to it this week. Your fix is so wonderful and looks like syntactic sugar! \n\nUwe\n\n^^^ is this enough for @UweSays? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13910847",
            "date": "2014-02-24T21:36:22+0000",
            "content": "Thanks! \n\nDon't really know the annotations life cycle, so the static was all I knew of to get ahead of beforeClass. It was ugly (the other guy working on SSL recoiled as well, but you had to disable before beforeClass). As Robert pointed out though, there is a problem with this and inheritance.\n\nAn annotation that can jump in before beforeClass is much nicer and actually works properly. "
        },
        {
            "author": "Gregory Chanan",
            "id": "comment-13911021",
            "date": "2014-02-25T00:03:10+0000",
            "content": "We ran into this as well with Apache Sentry, thanks for fixing it!\n\nIs it expected that downstream projects should add in the annotation?  As you noted, ssl configuration will fail because it expects stuff from example/ – we can't test for this and automatically disable? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13911551",
            "date": "2014-02-25T13:14:02+0000",
            "content": "\nIs it expected that downstream projects should add in the annotation? As you noted, ssl configuration will fail because it expects stuff from example/ – we can't test for this and automatically disable?\n\nNo. This issue is just to replace the static boolean with an annotation. For me, thats enough, as it makes the solr code itself cleaner, and it also gives downstream projects back the same capabilities they had in 4.6 and before.\n\nYes its true, in practice you will have to do this right now if you want to use these test classes all in an outside project. As far as autodetection, I don't think tests should automatically 'pass' when misconfigured: that makes them useless. I also think things like example keystores are useless too, and that the only proper fix is to move that \"test keystore\" to a src/resources in the test-framework.jar. But personally I don't want to tackle all this (please open an issue if you do!) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13911584",
            "date": "2014-02-25T13:50:04+0000",
            "content": "Commit 1571691 from Robert Muir in branch 'dev/trunk'\n[ https://svn.apache.org/r1571691 ]\n\nSOLR-5771: Add SuppressSSL instead of static boolean in SolrTestCaseJ4 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13911589",
            "date": "2014-02-25T13:55:30+0000",
            "content": "Commit 1571695 from Robert Muir in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1571695 ]\n\nSOLR-5771: Add SuppressSSL instead of static boolean in SolrTestCaseJ4 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13982592",
            "date": "2014-04-27T23:25:51+0000",
            "content": "Close issue after release of 4.8.0 "
        }
    ]
}