{
    "id": "SOLR-895",
    "title": "DataImportHandler does not import multiple documents specified in db-data-config.xml",
    "details": {
        "affect_versions": "1.3,                                            1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "In our system we have multiple kinds of items that need to be indexed. In the database, they are represented as 'one table per concrete class'. We are using the DataImportHandler to automatically create an index from our database. The db-data-config.xml file that we are using contains two 'Document' elements: one for each class of item that we are indexing.\n\nExpected behavior: the DataImportHandler imports items for each 'Document' tag defined in the configuration file\nActual behavior: the DataImportHandler stops importing it completes indexing of the first document\n\nI am attaching a patch, with a unit test that verifies the correct behavior, it should apply against the trunk without problems. I can also supply a patch against the 1.3 branch if you would like.",
    "attachments": {
        "import-multiple-documents.patch": "https://issues.apache.org/jira/secure/attachment/12395299/import-multiple-documents.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Cameron Pope",
            "id": "comment-12653363",
            "date": "2008-12-04T17:05:20+0000",
            "content": "This is a patch to DataImporter that causes it to import all documents defined in the config file. There is also a unit test to verify correct behavior. It should apply against the svn trunk without any problems. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12653366",
            "date": "2008-12-04T17:19:58+0000",
            "content": "why can't this be achieved using multiple root-entities under the same document? "
        },
        {
            "author": "Cameron Pope",
            "id": "comment-12653396",
            "date": "2008-12-04T18:18:27+0000",
            "content": "I tried moving both root entities under the same <document> element and specifying 'docRoot=\"true\"' for both of them and that appears to work. Thanks.\n\nSince I am new to Solr, please forgive me for logging what is probably not a bug at all. Is specifying multiple 'root' entities the envisioned way to solve this problem, or is it a workaround? Just curious and trying to gain a better understanding of the design (I noticed parts of the DataImporter assume multiple <Document> elements and other parts assume only one), and if so, I'd be happy to update the wiki to include it – I imagine I am not the only one who has a database schema like this who wants to create an index with Solr. \n\nAll in all, I have been hugely impressed with Solr and the DataImportHandler - both are incredible pieces of work. Thanks! "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12655570",
            "date": "2008-12-11T08:45:01+0000",
            "content": "Multiple documents is a legacy design issue that we are trying to remove altogether. Initially DataImportHandler was an external stand-alone server writing documents to Solr. Therefore it had multiple <document> elements to write to multiple cores. Once it was integrated inside Solr itself, it made sense to move away from that design.\n\nJust use a single document always and use multiple root entities if needed. If you have multiple cores, each core should have its own DataImportHandler configuration. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12656316",
            "date": "2008-12-13T17:49:35+0000",
            "content": "Marking this as won't fix per the discussions. "
        }
    ]
}