{
    "id": "SOLR-143",
    "title": "Support for PMD and Clover",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "had some time on a plane this weekend, so I adapted some of the clover hooks from Java-Lucene to Solr's build.xml and also put in hooks for running PMD (a bug pattern finding tool).\n\nthe PMD hook actually teste the PMD ruleset twice, once warning about any violations, and once failing the build if any serious violations were found ... the goal would be to hook this into the \"ant test\" target so you can't successfully build if you have any serious rule violations.\n\ni strarted with a custom ruleset based on some of the bigger rules from PMD ... the theory being that as well clean up the code base we can add more nit-picky rules if we want to \n\nUser is required to provide their own copy of PMD and/or clover on in an ANT_LIB. Clover requires (ASF committer) license, PMD is freely available...\n\nhttp://pmd.sourceforge.net/",
    "attachments": {
        "pmd-and-clover.diff": "https://issues.apache.org/jira/secure/attachment/12350420/pmd-and-clover.diff",
        "SOLR-143-CloverAndPMD.patch": "https://issues.apache.org/jira/secure/attachment/12358992/SOLR-143-CloverAndPMD.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12470490",
            "date": "2007-02-06T09:06:02+0000",
            "content": "this patch includes some XSLT/javascript from the PMD 3.9 release so i'm not granting lcense for inclusion until i double check that is viable. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12470614",
            "date": "2007-02-06T15:35:35+0000",
            "content": "While checking is nice, I'm not sure about requiring PMD before you can build Solr.\nIs PMD better than the code inspections in IntelliJ/Eclipse? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12470721",
            "date": "2007-02-06T20:01:09+0000",
            "content": "my thinking is that initially PMD would be a completely optional step, which committers are encouraged to run before committing, and which the nightly build runs with the \"serious\" threshold low enough that only extreme rules cause a build failure. ... the main goal would be having a report on the live site showing where in the nightly builds questionable behavior is (mush as the goal of clover is to have the reports about hte nightlies to see where we need more test coverage)\n\ni agree – it PMD shouldn't be mandatory just to build Solr.\n\nI can't make any specific comments about PMD being better then the tools that various IDEs have ... as i understand it many IDEs use either PMD or FindBugs ... my goal was just to have something that could be run as part of theautomated builds.\n\n(by all means: people using IDEs with code inspectors should run them and fix anything that looks suspicious) "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12501698",
            "date": "2007-06-05T21:36:49+0000",
            "content": "Updated to apply with trunk – unlike the original patch, this does not try to fix the serious errors (we can do that later)\n\nFor anyone trying to run - this does not require that you have PMD or clover, it just generates reports if you ask for them (and have it configured)\n\nFor anyone trying to run, these are the command lines:\n ant clean\n ant test -Drun.clover=true\n ant clover-reports -Drun.clover=true\n ant pmd-reports \n\nIs there a reason to have the -Drun.clover configuration rather then the target specifying if clover is used or not? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12501708",
            "date": "2007-06-05T21:50:18+0000",
            "content": "Ryan, i haven't looked at your updated patch, but i don't understand your last comment...\n\n> Is there a reason to have the -Drun.clover configuration rather then the target specifying if clover is used or not?\n\nhow would that work exactly?  the run.clover property is what's used to ensure that code is compiled with clover hooks (in the existing \"compile\" target) and that the clover db is initialized prior to running the unit tests (in the existing \"test\" target). "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12501725",
            "date": "2007-06-05T22:38:51+0000",
            "content": "> \n> Ryan, i haven't looked at your updated patch, but i don't understand your last comment...\n> \n\nThere is nothing interisting in the changes, it just does not conflict with the recently added init-forrest-entities\n\nThe patch also removes your attempts to fix the PMD serious errors (4 months later, most of the .java files have conflict)  We should probalby fix them when this does get added.\n\n\n>> Is there a reason to have the -Drun.clover configuration rather then the target specifying if clover is used or not?\n> \n> how would that work exactly?  the run.clover property is what's used to ensure that code is compiled with clover hooks (in the existing \"compile\" target) and that the clover db is initialized prior to running the unit tests (in the existing \"test\" target).\n> \n\nmagic!\n\nI just looked into other projects I thought did this - they have different 'compile' tasks for test and dist and require everyone to have clover.  This is not appropriate for solr, so the -Drun.clover option is better. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12505372",
            "date": "2007-06-15T21:26:08+0000",
            "content": "what do you think about including this soon?  With all the recent changes, it would be nice easily integrate with clover... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12505426",
            "date": "2007-06-16T04:15:22+0000",
            "content": "1) i never got a chance to look into the license issues of including the XSLT for\nformating the PMD output in solr\n\n2) since opening this issue, i have found better ways to do things with PMD instead of needing to run the analysis twice.\n\n\nIt might be best to just pursue the clover integration separately from the PMD stuff since many people use IDEs that have \"code inspectors\" for doing PMD type stuff built into them. ... then we can revist PMD later if we want.\n "
        },
        {
            "author": "Paul Sundling",
            "id": "comment-12519525",
            "date": "2007-08-13T20:56:09+0000",
            "content": "It would be trivial to integrate PMD and clover if you add a maven build.  There are already plugins and I've used them successfully myself.  They run during \"site\" generation which generates reports, although they can also be used to fail a build if desired.\n\nThe eclipse plugin for PMD is great, because it includes links to the detailed description on why the issues are a bad practice.  There were a few links missing, but I added a patch to add the missing links.  However there is a bug in the eclipse plugin where the links stop working if you export the ruleset. (http://sourceforge.net/tracker/index.php?func=detail&aid=1745607&group_id=132036&atid=723729)  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12571228",
            "date": "2008-02-21T23:15:48+0000",
            "content": "Grant did a much cleaner job of adding Clover support to the build files in SOLR-479\n\neventually i'd like to come back and add the PMD support in, but it's a pretty low priority (particularly until some other issues with our automated builds get resolved) "
        }
    ]
}