{
    "id": "SOLR-10453",
    "title": "setBasicAuthHeader should be deprecated in favor of SolrClientBuilder methods",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrJ"
        ],
        "type": "Sub-task",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Now that builders are in place for SolrClients, the setters used in each SolrClient can be deprecated, and their functionality moved over to the Builders. This change brings a few benefits:\n\n\n\tunifies SolrClient configuration under the new Builders. It'll be nice to have all the knobs, and levers used to tweak {{SolrClient}}s available in a single place (the Builders).\n\treduces SolrClient thread-safety concerns. Currently, clients are mutable. Using some SolrClient setters can result in erratic and \"trappy\" behavior when the clients are used across multiple threads.\n\n\n\nThis subtask endeavors to change this behavior for the setBasicAuthHeader setter on all SolrClient implementations.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-04-08T20:18:43+0000",
            "content": "Perhaps I was too quick in  marking this as duplicate of SOLR-12194. Jason Gerlowski can you elaborate on which setBasicAuthHeader method your are referring to here, I can only find one private method in HttpSolrClient? and why it should be deprecated? ",
            "author": "Jan Høydahl",
            "id": "comment-16429874"
        },
        {
            "date": "2018-04-09T19:47:54+0000",
            "content": "When I created this a while back, it was in a group of related stories centered around making our SolrClient implementations more immutable (and hopefully safer for multi-threading).  In generating those JIRAs, I grabbed a list of all the \"setters\" I saw, and must have missed that this one was internal/not-a-setter.\n\nSo to answer your actual question, I don't think this is a duplicate of SOLR-12194, but you were right to close it (if only because it's invalid). ",
            "author": "Jason Gerlowski",
            "id": "comment-16431123"
        },
        {
            "date": "2018-04-09T19:56:41+0000",
            "content": "Marking as invalid ",
            "author": "Jan Høydahl",
            "id": "comment-16431134"
        }
    ]
}