{
    "id": "SOLR-9925",
    "title": "Child documents missing from replicas during parallel delete+add",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.5.2,                                            6.3",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "When pushing documents to Solr in parallel, doing a delete-by-query and then add for the same set of IDs within each thread results in some of the replicas missing some of the child documents.  All the parent documents are successfully replicated.\n\nThis appears to trigger some sort of race condition, since:\n\n\n\tDocuments are never missing from the leader.\n\tDocuments might be missing from the replicas.\n\tWhen they are missing, the number and which documents are different for each replica and each run.\n\tIt happens more easily with large documents; my test script needs a huge number of documents to trigger it a small number of times, whereas it happens ~5% of the time on our dataset.\n\tWe're currently on Solr 5.5.2, but I've also managed to trigger it on 6.3.0\n\tWhen not running anything in parallel, this doesn't occur.\n\n\n\nQuick aside, since this is surely the first thing that will jump out:  We can't just do an update due to to the uniqueKey/_root_ issue behind SOLR-5211.",
    "attachments": {
        "generate.py": "https://issues.apache.org/jira/secure/attachment/12845585/generate.py",
        "run.sh": "https://issues.apache.org/jira/secure/attachment/12845584/run.sh"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-01-04T17:47:13+0000",
            "author": "Dan Sirotzke",
            "content": "run.sh - Test script for setting up solr ",
            "id": "comment-15798866"
        },
        {
            "date": "2017-01-04T17:47:59+0000",
            "author": "Dan Sirotzke",
            "content": "generate.py - Test script for pushing data in parallel ",
            "id": "comment-15798870"
        },
        {
            "date": "2017-06-26T19:56:17+0000",
            "author": "Brandon Chapman",
            "content": "We have seen this same issue on Solr 6.4.2. If you send deleteByQuery, \n\n\"_root_ :THE_ROOT\"\n\n with an add for the same document in the same request, you can trigger this easily.\n\nIn our case we had to use a deleteByQuery due to deleteById not working correctly on sharded collections. Our only solution is to go back to a non-sharded collection so we can use deleteById. \n\nRelevant ticket about deleteById being broken https://issues.apache.org/jira/browse/SOLR-8889 ",
            "id": "comment-16063663"
        }
    ]
}