{
    "id": "SOLR-2752",
    "title": "leader-per-shard",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "We need to add metadata into zookeeper about who is the leader for each shard, and have some kind of leader election.",
    "attachments": {
        "SOLR-2752.patch": "https://issues.apache.org/jira/secure/attachment/12493919/SOLR-2752.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13102117",
            "date": "2011-09-10T19:26:06+0000",
            "content": "I've hacked out an initial rough patch for this. More tests, refactoring, thinking, etc to come.\n\nAdds a new /collections/\n{collection}/leader_elect node.\n\nWhen a core registers, it creates a new ephemeral node under /collections/{collection}\n/leader_elect/\n{shard}/election/\n\neg\n\n/collections/{collection}/leader_elect/{shard}\n/election/n_0000000001\n\nIf that is the lowest n_*, the core sets itself as the leader in /collections/\n{collection}\n/leader_elect/\n{shard}\n/leader\nIf that is not the lowest n_*, the core puts a watch on the node before it. If that node goes down, the core initiates the leader election process again, see's if it's the lowest n, if so it's the leader, else make a new watch on the n_* node before it.\n\nRough early exploration stuff, more to follow. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13102282",
            "date": "2011-09-11T14:43:15+0000",
            "content": "new patch - much stronger test, a couple fixes, refactor most of the leader election code into its own class. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13102283",
            "date": "2011-09-11T14:48:10+0000",
            "content": "Just a quick correction to first comment - cores create an ephemeral|sequential node - not just ephemeral. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13102315",
            "date": "2011-09-11T17:44:04+0000",
            "content": "Another new patch:\n\nI moved SolrZooKeeper to the org.apache.zookeeper package so that I could add a simulated timeout method for tests.\n\nI also wrote a new test that starts up a bunch of replicas and then times out the leader. After waiting for the leader to reconnect, all of the other replicas are killed and I check that the first leader is again the leader. I wrote this test because I knew it would fail and that on reconnecting, clients don't jump back into the leader election process.\n\nSo I also added to the client reconnection impl - on reconnect, all SolrCores are re-registered. This also has the advantage that any SolrCores that where created while the connection was down are put into play. That allows the new test to pass. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13102355",
            "date": "2011-09-11T21:37:02+0000",
            "content": "feeling motivated I guess - another patch with a bunch of polish "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13103084",
            "date": "2011-09-12T21:38:18+0000",
            "content": "Another patch I suppose - rename existing tests to LeaderElectionIntegrationTest and a new LeaderElectionTest that just tests the LeaderElector class itself. Also a bit more javadoc. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13106622",
            "date": "2011-09-16T17:40:42+0000",
            "content": "I think we need a try catch around setting the watch on the next guy in line - he may have been cut down between seeing he was next and setting the watch - we probably want to check if we are the leader again if an exception is thrown setting the watch.\n\nTried making a stress test that could catch this, but tough window to hit... "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13115771",
            "date": "2011-09-27T18:16:56+0000",
            "content": "While working on the tests for this I ran into and filed a locale bug in zk: https://issues.apache.org/jira/browse/ZOOKEEPER-1206 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13116009",
            "date": "2011-09-27T23:40:12+0000",
            "content": "I've committed this early work to the solrcloud branch "
        }
    ]
}