{
    "id": "SOLR-6121",
    "title": "cursorMark should accept sort param without explicit uniqueKey, do implicit uniqueKey tie breaker sort under the hood",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "If you are using the cursorMark (deep paging) feature, you shouldn't have to add the uniqueKey to the sort parameter.  If the user doesn't do it, the user obviously doesn't care about the uniqueKey order relative to whatever other sort parameters they may or may not have provided.  So if sort doesn't have it, then Solr should simply tack it on at the end instead of providing an error and potentially confusing the user.  This would be more user friendly.\n\nQuoting Hoss from SOLR-5463:\n\nThe reason the code currently throws an error was because i figured it was better to force the user to choose which tie breaker they wanted (asc vs desc) then to just magically pick one arbitrarily.\n\nIf folks think a magic default is a better i've got no serious objections – just open a new issue.",
    "attachments": {
        "SOLR-6121.patch": "https://issues.apache.org/jira/secure/attachment/12658362/SOLR-6121.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "ayush mittal",
            "id": "comment-14067430",
            "date": "2014-07-19T07:48:12+0000",
            "content": "Hello i am newbie , could you please elaborate "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14067988",
            "date": "2014-07-20T17:26:07+0000",
            "content": "+1 I think this is a good idea "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14067996",
            "date": "2014-07-20T17:45:45+0000",
            "content": "If folks think a magic default is a better i've got no serious objections\n\n+1, I don't think there's much to gain from forcing a user to specify a tiebreaker.  We don't force them to do it for non cursorMark sorts. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14073401",
            "date": "2014-07-24T17:22:20+0000",
            "content": "I don't think there's much to gain from forcing a user to specify a tiebreaker.\n\nA good reason why forcing the user to explicitly include the uniqueKey in the sort string to use cursor's occurred to me this morning while replying to a solr-user thread (\"Subject: How to migrate content of a collection to a new collection\"):\n\n\nIt forces the user to be aware that Solr will be sorting on the uniqueKey. It's not hidden from them, and they are given an opportunity to consider the resulting RAM impacts.\n\n\nSince the memory usage of the FieldCache is certainly non-trivial on really large collection, making user is explicitly aware that their uniqueKey needs to be in the sort puts them in the position to consider their memory needs and/or make an informed decision about enabling docValues on their uniqueKey field (something most people probably wouldn't ever need to do unless they normally have reasons to do range queries or sort on their uniqueKey field)\n\nAs things stand right now, if someone switches their usage from sort=foo+asc&start=0&rows=100 to sort=foo+asc&start=0&rows=100*cursorMark=* they get a clear error that they need to consider how they want their uniqueKey field to be included in the sort.  If we change the code to silently rewrite their sort param to be sort=foo+asc,+id+asc internally w/o any obvious feedback to them, that could chew up a lot of ram on them unexpectedly, and they could see really weird performance changes and/or OOM and think it's some inherent behavior/problem with using cursors.\n\n\nSo i think i take back my \"i've got no serious objections\" comment, and instead vote \"-1\" to the idea.\n\nI'd rather users get an error the first time they try and have to manually change things, then be frustrated/confused by why cursors (seemingly) degrade their overall system performance so much. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14073413",
            "date": "2014-07-24T17:32:54+0000",
            "content": "I'm sympathetic to all that, but still come away thinking it should not be required and all those concerns should be front and center on the docs for deep paging. I think the average user won't understand anything extra about performance or requirements whether they are forced to supply this or not. "
        },
        {
            "author": "David Smiley",
            "id": "comment-14073440",
            "date": "2014-07-24T18:01:36+0000",
            "content": "I get your point Hoss.  I tend to think there's value in having the ID be a docValues field (which alays your concern), and especially if Solr was better about consulting docValues for it if this was so, like if you only want the unique key such as a shard over-request for matching document IDs. "
        },
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-14073441",
            "date": "2014-07-24T18:01:47+0000",
            "content": "Looking at this differently, should it be a requirement for the unique key to be present? May be my sort key is unique as well even if not the schema's unique key, or the chances of their being duplicates is so low that I am happy for that odd search to skip a result instead of every search incurring the overhead. Should we just allow any sort specification and probably error, and have an optional param which explicitly tells you that this is fine? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14073471",
            "date": "2014-07-24T18:17:23+0000",
            "content": "or the chances of their being duplicates is so low that I am happy for that odd search to skip a result instead of every search incurring the overhead\n\nit's not just a question of missing an occasional doc – w/o a definitive tie breaker included in the cursorMark, you'll get an infinite loop any time the the number of docs with identical sort values is greater then the size of the rows param.  Definitely not a trap we want to leave in for users who just don't think to include \"id\" in the sort\n\nMay be my sort key is unique as well even if not the schema's unique key, ... have an optional param which explicitly tells you that this is fine?\n\nthat seems like a good idea, but is really orthogonal to the spirit of this jira which is about simplifying the user experience and magically adding the uniqueKey tiebreaker behind the scenes.\n\nfor expert users who know their sort is already unique, and want to add a new param that tells the cursor code \"skip the overhead of uniqueKey tiebreaker, my last clause is guaranteed to be a tiebraker\" seems fine – please open a new jira.\n "
        },
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-14073534",
            "date": "2014-07-24T19:10:19+0000",
            "content": "w/o a definitive tie breaker included in the cursorMark, you'll get an infinite loop any time the the number of docs with identical sort values is greater then the size of the rows param\n\nAh, yes, that would be bad. Didn't think that through..\n\nfor expert users who know their sort is already unique, and want to add a new param that tells the cursor code \"skip the overhead of uniqueKey tiebreaker, my last clause is guaranteed to be a tiebraker\" seems fine – please open a new jira.\n\nRaised SOLR-6277. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14073570",
            "date": "2014-07-24T19:49:23+0000",
            "content": "revising summary to distinguish from SOLR-6277 "
        },
        {
            "author": "Ramana",
            "id": "comment-14075286",
            "date": "2014-07-26T07:17:32+0000",
            "content": "Attached is the patch for the changes.\nNow, cursorMark accepts sort param without explicit unique key. \nWhen user querying something like http://localhost:8983/solr/collection1/select?q=*hd*&sort=price+desc&rows=5&cursorMark=* \nunder the hood we are adding the unique key field to the sort. In this example it is \"id desc\".\n\nIn the QueryParsing class, while preparing the sort specification for the query, Now we are verifying if the \"cursorMark\" is there in the URL, If exists, we are identifying the unique key and adding to sort. With these changes we will not get the error \"Cursor functionality requires a sort containing a uniqueKey field tie breaker\"  error. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14097372",
            "date": "2014-08-14T18:50:32+0000",
            "content": "Here's an example from irc (reposted with brett_h's permissions) of exactly the kind of thinking i'm happy to see happening given the current constraint...\n\n\n11:24 < brett_h:#solr> is ... sorting strings in Solr pretty much a bad idea?\n11:24 < brett_h:#solr> it kills my query, but it's required that I use my uniqueKey to do a cursorMark\n11:30 <@hoss:#solr> kills your query how?\n11:30 <@hoss:#solr> memory wise you mean?\n11:31 <@hoss:#solr> have you looked into docValues?\n11:36 < brett_h:#solr> memory, yeah\n11:36 < brett_h:#solr> hoss: ahhh, forgot docvalues on this field\n11:36 <@hoss:#solr> you should definitley consider using docValues on your uniqueKey ... should reduce the memory needs \n                    when sorting\n11:36 < brett_h:#solr> thanks\n11:39 <@hoss:#solr> brett_h: do you mind if i post a transcrit of this exchange in SOLR-6121 as an examle of my concerns?\n11:39 < brett_h:#solr> fine by me hoss\n11:41 < brett_h:#solr> in my case, like the ticket says, I don't care at all about the tie breaker\n11:41 < brett_h:#solr> I do however care about perf :)\n11:41 < brett_h:#solr> not sure how I missed docvalues on it, I use them for all other sorts\n11:41 < brett_h:#solr> just wasn't thinking since I literally only want to use it as a tie breaker\n11:41 <@hoss:#solr> brett_h: exactly ... which is why you'd probably like SOLR-6277, but SOLR-6121 would have screwed \n                    you w/o being obvious why, correct?\n11:44 < brett_h:#solr> correct\n\n\n\n1) brett knew from the current error message in place that he had to include his uniqueKey in the sort\n2) when he added uniqueKey to his sort, the memory usage went way up (because of FieldCache) and he could equate that in his head as a direct effect of adding the uniqueKey to the sort clause (instead of it being done behind the scenes w/o him knowing)\n3) that lead him (admitedly, via asking on irc - but he probably would have gotten it on his own soon, see his comment about other sort fields) to realize he should add docValues on his uniqueKey field.\n4) if we had SOLR-6277, that would also be a viable option for him – and something the current cursorMark error message could suggest as an alternative to adding the uniqueKey.\n\nwhich re-iterates my thinking: \n\n\tthe proposal in this issue seems like a bad idea\n\tSOLR-6277 seems like a a better idea\n\n "
        }
    ]
}