{
    "id": "SOLR-5642",
    "title": "Query User Interface is Unnecessarily Cryptic",
    "details": {
        "affect_versions": "4.6",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Solr depends on a lot of parameters to perform queries. These parameters have one- or two-character names like \"q\" and \"fq\" and \"fl\" and \"df\". It would be extremely easy and extremely helpful to users to use tooltips in the web UI that could explain what these parameters actually mean, and it would be further helpful to link directly to the documentation for each. Right now I have no idea what they mean and since there's several versions of the documentation I'm not even sure how to find the best place to look.\n\nAlso, the word \"Dataimport\" on the left should be two words: \"Data Import\" both because \"dataimport\" is not a word in any language and because the \"Schema Browser\" appears as two proper words.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13875759",
            "date": "2014-01-18T22:17:18+0000",
            "content": "+1, would be a nice improvement to the UI. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13917150",
            "date": "2014-03-01T18:40:58+0000",
            "content": "David did some work on SOLR-3317, we added a title attribute on the inputs itself, which show a tooltip if you hover over them. having them (also or instead?) on the labels might be (more) sense, agreed .. and having information for all of them, as well. \n\nAaron Greenspan would you mind adding a list for all parameters you did already lookup (and find)? "
        },
        {
            "author": "Aaron Greenspan",
            "id": "comment-14661297",
            "date": "2015-08-07T04:40:52+0000",
            "content": "The problem is that I have no idea what they mean, and that's why I need the explanation.\n\nThis is a problem all throughout the web UI. The field names should be in English (or a spoken/written non-computer language), not XML variable names that no one knows except a few core programmers. "
        },
        {
            "author": "Gus Heck",
            "id": "comment-16327375",
            "date": "2018-01-16T16:55:36+0000",
            "content": "The existing labels are a bit cryptic, but the admin ui is not really meant for non developers either. It seems to me that the labels could be more helpful for new developers however, and having labels like Query (&q=) would have a somewhat tutorial effect. Mouse over's are not helpful until people know they are there, and even then they are painfully slow UI (imho).  a  symbol that links to docs would also be good, but gets slightly complicated since, as the OP notes there are lots of versions, and several locations, and infrastructure gets reorganized from time to time potentially breaking such links. I think to make it sane, the html docs would need to be packaged and installed locally, and served by our jetty.    "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-16332700",
            "date": "2018-01-19T18:29:26+0000",
            "content": "ticket cross-referencing: SOLR-5642 and SOLR-11797 both share the idea of the admin UI linking or otherwise pointing more towards the documentation "
        }
    ]
}