{
    "id": "SOLR-29",
    "title": "backup utility does not work on OS X",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The 'cp' command on OS X doesn't support the -l option, so the backup script doesn't work.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12421894",
            "date": "2006-07-18T16:25:11+0000",
            "content": "Would something like this work on OS X?\nln index/* snapshot/ "
        },
        {
            "author": "Bill Au",
            "id": "comment-12422107",
            "date": "2006-07-19T12:26:41+0000",
            "content": "Snapshots are taken using \"cp -l\" to save space using hard links.  I didn't realize until now that bacukp are taken the same way.  So the backups are not really backups in the traditional sense because any changes made to the backups (besides removing an index file) are reflected in the original also.  Do folks think that this will be an issue?\nShould we make \"regular\" copies for backups? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12422162",
            "date": "2006-07-19T15:00:37+0000",
            "content": "That is a point...\nLucene never changes segment files, so it's not a problem there, but if there is disk corruption, or if someone goes and manually edits a segment file with vi or something, then the \"backup\" will also be affected. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12422433",
            "date": "2006-07-20T14:52:15+0000",
            "content": "Exactly.  That's why I am leaning towards not using hard links for backup.\n\nBy the way,\n\nln index/* snapshot/\n\ndoes work on OS X.\n\nI will open up separate bug to modify snapshooter to do that so that snapshots can be taken on OS X. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12422497",
            "date": "2006-07-20T21:19:42+0000",
            "content": "i'm a little worried about the possibility of \"ln index/* snapshot/\" failing when there are a large number of files in the index and the wildcard expansion overwhelms the shells max command length (or whatever the limitation is ... i'm not much of a shell programming guy, i just remember we had a similar problem with \"ls -1 *\" in snapcleaner didn't we?) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12422499",
            "date": "2006-07-20T21:30:30+0000",
            "content": "Do a switch based on uname, so most systems could use the existing cp -l ? "
        },
        {
            "author": "Bill Au",
            "id": "comment-12422660",
            "date": "2006-07-21T14:49:09+0000",
            "content": "Good point, Hoss.  I will do some experimenting when I have access to my OS X box.\nI am thinking of using find and xargs.  I need to verify that they work the same way on OS X.\n\nYes, we can either do a switch based on uname or test to see if cp supports the -l option.\n\nI am pretty sure the problem can be fixed.  The only open issue for me is the use of hard link for backup. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12422812",
            "date": "2006-07-22T05:11:36+0000",
            "content": "i remeber thinking the hard link was weird the first time i noticed it – but then i figured it was acctually kind of cool because it saved space ... the idea of backup corruption because people muck with the live index files (external of Solr) isn't something i ever considered.\n\nI think ditching the hard links is a good idea. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12739554",
            "date": "2009-08-05T15:10:51+0000",
            "content": "The new Java based replication works fine on OS X and can handle backups "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775496",
            "date": "2009-11-10T15:51:41+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}