{
    "id": "SOLR-12724",
    "title": "Trying to connect solr to tomcat container",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Incomplete",
        "status": "Resolved"
    },
    "description": "",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-30T19:22:33+0000",
            "content": "First of all, there's no data here to help you solve your issue.\n\nSecond this is not an appropriate use of Solr's JIRA, the issue tracker is not a support portal. We try to reserve the JIRA system for code issues rather than usage questions.\n\n Please ask the question here: solr-user@lucene.apache.org, see: http://lucene.apache.org/solr/community.html#mailing-lists-irc\n\n When you raise question on the user's list, include pertinent details, including sample data, queries and responses if possible, along with what you expect to see but don't.\n\n  ",
            "author": "Erick Erickson",
            "id": "comment-16597816"
        },
        {
            "date": "2018-08-30T19:29:33+0000",
            "content": "I have been attempting to connect the official solr 7.4 container found on hub.docker.com to a Tomcat container running on port 8080, the Tomcat instance is fronted but a separate httpd apache server which is publishing static content.  I have the apache connecting to the tomcat and the solr containers.\n\nI mapped the solr container to the cmscontent I am using on the tomcat and the apache.  I have created a solr user on the apache and the tomcat containers and I have added solr each as a group, but I cannot get the solr container to index any of the files and run.\n\nIs there someone who can assist with the path or the sets I need to make it work?  I even tried to build a fresh box  with no joy\n\n \n\n \n\n \n\n  ",
            "author": "Ray Oh",
            "id": "comment-16597823"
        },
        {
            "date": "2018-08-30T20:02:34+0000",
            "content": "Thanks for the guidance and apologies for using the Jira in the inappropriate way.  I will try the suggested path\n\n  ",
            "author": "Ray Oh",
            "id": "comment-16597869"
        }
    ]
}