{
    "id": "SOLR-3990",
    "title": "index size unavailable in gui/mbeans unless replication handler configured",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [
            "6.4"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Unless you configure the replication handler, the on-disk size of each core's index seems to be unavailable in the gui or from the mbeans handler.  If you are not doing replication, you should still be able to get the size of each index without configuring things that won't be used.\n\nAlso, I would like to get the size of the index in a consistent unit of measurement, probably MB.  I understand the desire to give people a human readable unit next to a number that's not enormous, but it's difficult to do programmatic comparisons between values such as 787.33 MB and 23.56 GB.  That may mean that the number needs to be available twice, one format to be shown in the admin GUI and both formats available from the mbeans handler, for scripting.",
    "attachments": {
        "SOLR-3990.patch": "https://issues.apache.org/jira/secure/attachment/12658832/SOLR-3990.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13507665",
            "date": "2012-11-30T21:35:56+0000",
            "content": "That may mean that the number needs to be available twice, one format to be shown in the admin GUI and both formats available from the mbeans handler, for scripting.\n\nI think the system info handler does exactly that - I remember working on it at some point. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13507708",
            "date": "2012-11-30T22:14:33+0000",
            "content": "Is the system info handler accessed via the /admin/system URL?  If so, it doesn't seem to have the index size.\n\nI would prefer to have it accessible via /admin/mbeans?stats=true so that I don't have to make more than one SolrJ call per core to gather stats, but you should do whatever makes the most sense for Solr, not for me.  I'll adapt to it either way. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530637",
            "date": "2012-12-13T03:27:11+0000",
            "content": "Sorry, didn't mean it had the index size - that it did the same thing - includes human readable stats and 'raw' stats. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13530643",
            "date": "2012-12-13T03:38:05+0000",
            "content": "If you are not doing replication, you should still be able to get the size of each index without configuring things that won't be used.\n\nagreed ... adding the current index size (in both raw and human readble formats) as a stat to either the \"SolrCore\" or \"SolrIndexSearcher\" could make sense.\n\nThat may mean that the number needs to be available twice\n\nyeah, i'm not sure why Replicationhandler only exposes the human readable version at the moment. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636738",
            "date": "2013-04-19T19:04:09+0000",
            "content": "I think this issue will be a good learning experience for me.  If anyone knows exactly what to do and wants it implemented faster, feel free to take over.\n\nThis is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717131",
            "date": "2013-07-23T18:47:13+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13970935",
            "date": "2014-04-16T12:56:40+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14080455",
            "date": "2014-07-31T03:50:12+0000",
            "content": "Patch against branch_4x, for comment.  I've centralized the getIndexSize method and added the size in bytes and readable units to the core stats.  For 5.0, will we still need the index size in the replication stats, or should the webUI get that info from the core stats? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14111345",
            "date": "2014-08-26T21:09:59+0000",
            "content": "+1 LGTM\n\nFor 5.0, will we still need the index size in the replication stats, or should the webUI get that info from the core stats?\n\nYank it from ReplicationHandler from 5.0. I'll give a patch to read the size from the core stats. "
        },
        {
            "author": "Keith Laban",
            "id": "comment-15188248",
            "date": "2016-03-09T22:51:43+0000",
            "content": "Bumping this ticket. Attaching a new patch for current master (should also apply to 5x) "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-15798638",
            "date": "2017-01-04T16:21:18+0000",
            "content": "This may be moot in recent versions – the /replication handler is implicitly created even if it's not configured.  Even so, I think it's probably a good idea to move the functionality to something more central. "
        },
        {
            "author": "Dennis Gove",
            "id": "comment-15798792",
            "date": "2017-01-04T17:24:02+0000",
            "content": "I agree, I think it still makes sense to put this in a more central location. I'd expect to be able to ask the core what the index size is. "
        },
        {
            "author": "Dennis Gove",
            "id": "comment-15798803",
            "date": "2017-01-04T17:28:00+0000",
            "content": "Only changes in this are the hashes for the diff (applied to current master). No code changes. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-15799707",
            "date": "2017-01-04T23:35:08+0000",
            "content": "Commit bd39ae9c9d8500d92306478fb51ee6e19009cee9 in lucene-solr's branch refs/heads/master from Dennis Gove\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=bd39ae9 ]\n\nSOLR-3990: Moves getIndexSize() from ReplicationHandler to SolrCore "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-15799743",
            "date": "2017-01-04T23:48:23+0000",
            "content": "Commit 973a48e3e7fddef2ee3a21864783423974d6c6b7 in lucene-solr's branch refs/heads/branch_6x from Dennis Gove\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=973a48e ]\n\nSOLR-3990: Moves getIndexSize() from ReplicationHandler to SolrCore "
        },
        {
            "author": "Dennis Gove",
            "id": "comment-15799746",
            "date": "2017-01-04T23:49:38+0000",
            "content": "Committed into both master and branch_6x.\n\nThank you, Shawn! "
        }
    ]
}