{
    "id": "SOLR-3144",
    "title": "Parameter marshalling is broken in Solrj JavaBinUpdateRequestCodec",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "The parameter marshalling de-marshalling is broken in Solrj's JavaBinUpdateRequestCodec. \n\nThe bug can be reproduced by adding a parameter e.g. overwrite=false as parameter to the UpdateRequest. After desiarilizing on the backend side the value will be not \"false\" it will be \"[false]\" which results in an Exception in the backend and documents will not be imported.\n\nThis issue can easily be fixed by replacing the serialization method with the correct one in SolrParams. See also this gist for a working version: https://gist.github.com/1853544",
    "attachments": {
        "JavaBinUpdateRequestCodec.patch": "https://issues.apache.org/jira/secure/attachment/12515595/JavaBinUpdateRequestCodec.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jörg Maier",
            "id": "comment-13213682",
            "date": "2012-02-22T15:07:58+0000",
            "content": "Attached patch. "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13213758",
            "date": "2012-02-22T16:45:54+0000",
            "content": "Hi Jörg,\n\nWhat version did you see this problem with? I tried to fix this already in SOLR-3037 but perhaps I missed something... "
        },
        {
            "author": "Jörg Maier",
            "id": "comment-13214395",
            "date": "2012-02-23T07:04:04+0000",
            "content": "Hi Sami,\n\ni was working on an earlier build than the current head. Obviously previous to your fix. I couldnt verify the existence of this bug on trunk anymore and everything works fine for me. I missed SOLR-3037.\n\nHowever it might be a good idea to replace the toNamedList method in the Codec by the toNamedList method from SolrParams.\n\nI close this as duplicate to SOLR-3037. "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13214401",
            "date": "2012-02-23T07:08:04+0000",
            "content": "b1. However it might be a good idea to replace the toNamedList method in the Codec by the toNamedList method from SolrParams.\n\nYeah, I agree. "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13214440",
            "date": "2012-02-23T08:11:10+0000",
            "content": "I committed the changes you proposed in r1292690. Thanks! "
        }
    ]
}