{
    "id": "SOLR-9862",
    "title": "Cannot start Solr on Solaris/Super Cluster",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.3",
        "status": "Closed",
        "resolution": "Workaround",
        "priority": "Major"
    },
    "description": "Solr: 6.3\nOS: Solaris\nJAVA: 1.8.0_111\nHardware: Oracle Super Cluster\n\nWhen i start Solr, I get a message that does not allow Solr to startup, See cmd output below\nP.S: I am BRAND new to Solr. I installed and actually played with the previous version on exactly the same environment and had no issues\n\nroot@XXXXXXXXXXX:/u02/solr# java -version\njava version \"1.8.0_111\"\nJava(TM) SE Runtime Environment (build 1.8.0_111-b14)\nJava HotSpot(TM) 64-Bit Server VM (build 25.111-b14, mixed mode)\nroot@XXXXXXXXXXX:/u02/solr# echo $JAVA_HOME\n/u03/software/jdk1.8.0_111\nroot@XXXXXXXXXXX:/u02/solr# echo $PATH\n/u03/software/jdk1.8.0_111/bin:/usr/sbin:/usr/bin\nroot@XXXXXXXXXXX:/u02/solr# bin/solr start\nawk: can't open /version/ \n{print $2}\nYour current version of Java is too old to run this version of Solr\nWe found version , using command '/u03/software/jdk1.8.0_111/bin/java'\nPlease install latest version of Java 8 or set JAVA_HOME properly.\n\nDebug information:\nJAVA_HOME: /u03/software/jdk1.8.0_111\nActive Path:\n/u03/software/jdk1.8.0_111/bin:/usr/sbin:/usr/bin\nroot@XXXXXXXXXXX:/u02/solr#",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-12-13T18:10:14+0000",
            "author": "Uwe Schindler",
            "content": "I think this is a Solaris problem, because not all required GNU tools are available or have incompatible versions (like AWK, SED,...). If we want to fix this we would need a test.\n\nFYI, Policeman Jenkins also has a Solaris node, so we could setup a quick test (I can also give login credentials for development). ",
            "id": "comment-15745798"
        },
        {
            "date": "2016-12-13T18:11:37+0000",
            "author": "Kevin Risden",
            "content": "Not sure what is happening here but in Solr 6.3 SOLR-8080 was committed and added a check for Java version. Looks like that is what is causing the error here.\n\nJan Høydahl - any ideas? ",
            "id": "comment-15745800"
        },
        {
            "date": "2016-12-13T18:14:04+0000",
            "author": "Moenieb",
            "content": "Hi Guys,\n\nThanks for the quick responses, I now like Solr even MORE \nWhen I run the awk command as it is in the script directly on cmd, it actually brings back the version number correctly\n\n ",
            "id": "comment-15745812"
        },
        {
            "date": "2016-12-13T18:22:20+0000",
            "author": "Shawn Heisey",
            "content": "When I run the awk command as it is in the script directly on cmd, it actually brings back the version number correctly\n\nAre you running the awk command as the same user that starts Solr?  The problem looks like when awk is called by the start script, that it is getting a different binary than when you run it directly, because of a difference in PATH.  The difference in PATH might be due to a difference in shell – the shell being used by the bin/solr script (which should be bash) may be different than the shell you get when you log in. ",
            "id": "comment-15745835"
        },
        {
            "date": "2016-12-13T18:46:54+0000",
            "author": "Moenieb",
            "content": "Hi,\n\nWill a CHMOD 777 work to fix this for all users? ",
            "id": "comment-15745903"
        },
        {
            "date": "2016-12-13T18:49:06+0000",
            "author": "Shawn Heisey",
            "content": "No idea whether chmod 777 will help.  I can't tell what the issue is from the info you've shared so far.  What I wrote above is a guess.\n\n777 permissions are almost never a good idea – they allow write access to EVERYONE. ",
            "id": "comment-15745911"
        },
        {
            "date": "2016-12-13T18:52:18+0000",
            "author": "Moenieb",
            "content": "Hi,\n\nI am aware of this, but I am just trying to get Solr up and running for DEMO purposes.\nWill try to check profiles and paths again ",
            "id": "comment-15745926"
        },
        {
            "date": "2016-12-14T08:41:51+0000",
            "author": "Moenieb",
            "content": "Hi Guys,\n\nThanks for he assistance.\nSee below my cheat, for demo purposes only\nWill obviously need to still fix this\n\n\n\tset the JAVA_VER=8 seeing that the debug information says that Solr picks up the right version\n  JAVA_VER=8\n  #JAVA_VER=$(echo $JAVA_VER | awk -F '\"' '/version/ \n{print $2}\n')\n\n\n ",
            "id": "comment-15747690"
        },
        {
            "date": "2016-12-14T09:07:50+0000",
            "author": "Uwe Schindler",
            "content": "Hi,\nmost init scripts around there have special cases for various operating systems! Ours just relies on the default PATH to lookup shell tools. But other non-linux operating systems often have special paths for tools with more advanced capabilities. Most init scripts have therefore something like a switch/case construct to set some variables with absolute paths to tools on various operating systems. We may copy one from some other common tools and replace all calls with variables.\n\nE.g. on Solaris most advanced tools are not on default path for \"default users\" (for compatibility reasons with previous Solaris versions), so you need to refer to them absolutely, e.g. /usr/xpg4/bin/awk or use a different name nawk on solaris, which is a symlink to the previous xpg4 path (see https://docs.oracle.com/cd/E23823_01/html/816-5165/awk-1.html vs. https://docs.oracle.com/cd/E23823_01/html/816-5165/nawk-1.html). ",
            "id": "comment-15747752"
        },
        {
            "date": "2016-12-14T09:52:37+0000",
            "author": "Moenieb",
            "content": "Thanks for directing me guys, I really appreciate it.\nLets hope that I can start my sales pitch in January\n\nHoping to kick out OBIEE (BI) and some other triple store tool that is used as a search and indexing data tool.\nTrying to architeturally punt Solr on top of Hadoop running on Oracle Super Cluster.\nDid some initial tests a few months ago and it looked good in terms of scalability and responses\n\nP.S: I am actually a MS and SAP guy, but Solr has really got me interested ",
            "id": "comment-15747845"
        }
    ]
}