{
    "id": "SOLR-939",
    "title": "ValueSourceRangeFilter/Query",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Ability to do a range query based on a FieldCache entry or a FunctionQuery (ValueSource).\nEquivalent to Lucene's FieldCacheRangeQuery",
    "attachments": {
        "SOLR-939.patch": "https://issues.apache.org/jira/secure/attachment/12396802/SOLR-939.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12659382",
            "date": "2008-12-27T21:05:38+0000",
            "content": "Attaching incomplete draft to help give a feel for the approach.\n\nFunctionallity can be accessed via frange QParser (stands for function range).\n\nfq=\n{!frange l=5 u=10}popularity\n\nfq={!frange l=5 u=10}\nproduct(popularity,2) "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12679062",
            "date": "2009-03-05T03:57:53+0000",
            "content": "Yonik, if I understand this correctly (and I don't understand much), the difference between plain FieldCacheRangeFilter and ValueSourceRangeFilter is that VSRF can be used with fields as well as function queries, right?\n\nTo complete this patch, we would need modifications to other field types as well (just as the patch does for IntField). Are there other changes required before this can be committed? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12679236",
            "date": "2009-03-05T16:31:55+0000",
            "content": "Right - it made sense to me to go through the FunctionQuery/ValueSource abstraction to do range filters, as it's a superset of just going off of the FieldCache (it could work with functions, FileFloatSource, and future payload or column-stored fields too).\n\nI've been meaning to get back to this patch... at a minimum it would need support for all of the field types as well as tests.  I think I may even have some local updates since this last patch - I'll have to check.\n\nIt would be nice if one could tag a field with info to use ValueSourceRangeFilter for any range queries... but it doesn't seem necessary before committing this underlying functionality. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12679282",
            "date": "2009-03-05T18:22:34+0000",
            "content": "Right - it made sense to me to go through the FunctionQuery/ValueSource abstraction to do range filters, as it's a superset of just going off of the FieldCache (it could work with functions, FileFloatSource, and future payload or column-stored fields too).\n\nVery cool!\n\nIt would be nice if one could tag a field with info to use ValueSourceRangeFilter for any range queries\n\nAs an extra attribute in the schema? e.g.\n\n<field name=\"xyz\" type=\"integer\" indexed=\"true\" stored=\"true\" useValueSourceRangeFilter=\"true\" />\n\n\n\n+1 for this. It is easier/cleaner than the local param syntax but I guess we'd need to support both anyway. Solrj does not have API methods to manipulate local params and I think this is a good time to add that support.\n\nI've been meaning to get back to this patch... at a minimum it would need support for all of the field types as well as tests. I think I may even have some local updates since this last patch - I'll have to check.\n\nCan you post your updates? SOLR-940 (Trie support) is mostly done and I can try to spend some time on this one. Per the 1.4 release discussion, these two are the major features stopping the 1.4 release, though I'm sure we'll find more  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12680975",
            "date": "2009-03-11T18:38:26+0000",
            "content": "Here's the latest I had... I don't recall exactly what the state of things were, but I had started working on tests (TestRangeQuery) and it built an index will a bunch of different field types, but there wasn't  yet code to query. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12683892",
            "date": "2009-03-20T14:14:30+0000",
            "content": "Attaching patch with some more progress... fixed some bugs and created some query tests (currently failing). "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12685380",
            "date": "2009-03-20T22:29:36+0000",
            "content": "OK, I think I've fixed all the issues! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12689110",
            "date": "2009-03-25T13:32:14+0000",
            "content": "Committed. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12721839",
            "date": "2009-06-19T15:59:09+0000",
            "content": "I just happened to be looking at the code for this in StrField.java and I observed that the package-class StrFieldSource isn't being used. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775619",
            "date": "2009-11-10T15:51:54+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}