{
    "id": "SOLR-4434",
    "title": "Developer Curb Appeal: Better options than the manual copy step, and doc changes",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "We make developers manually copy the example directory to a named shard directory.\n\nDoc references:\nhttp://lucidworks.lucidimagination.com/display/solr/Getting+Started+with+SolrCloud\nhttp://wiki.apache.org/solr/SolrCloud\n\nSample commands:\ncp -r example shard1\ncp -r example shard2\n\nThe doc is perhaps geared towards a developer laptop, so in that case you really would need to make sure they have different names.\n\nBut if you're running on a more realistic multi-node system, let's say 4 nodes handling 2 shards, the the actual shard allocation (shard1 vs. shard2) will be fixed by the order each node is started in FOR THE FIRST TIME.\n\nAt a minimum, we should do a better job of explaining the somewhat arbitrary nature of the destination directories, and that the start order is what really matters.\n\nWe should also document that the actual shard assignment will not change, regardless of the name, and where this information is persisted?\n\nCould we have an intelligent guess as to what template directory to use, and do the copy when the node is first started.\n\nIt's apparently also possible to startup the first Solr node with no cores and just point it at a template.  This would be good to document.  There's currently a bug in the Web UI if you do this, but I'll be logging another JIRA for that.\n\nWhen combined with all the other little details of bringing up Solr Cloud nodes, this is confusing to a newcomer and midly annoying.  Other engines don't require this.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13576078",
            "date": "2013-02-11T20:13:49+0000",
            "content": "I'd simply not use shard1, shard2, etc. That is a bit confusing. I thought we used example1, example2, example3, etc. That seems much better. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13576081",
            "date": "2013-02-11T20:16:57+0000",
            "content": "http://lucidworks.lucidimagination.com/display/solr/Getting+Started+with+SolrCloud\n\nThat's Lucid doc and doesn't involve Apache.\n\nhttp://wiki.apache.org/solr/SolrCloud\n\nThat's using \n\nexample{n}\n\n it looks to me - not \n\nshard{n}\n\n - so it seems fine. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13582718",
            "date": "2013-02-21T00:30:43+0000",
            "content": "Understood, exammpleN vs. shardN, but still using some ordinal set of directories.  That really only makes sense if you're trying to run multiple nodes on a single laptop.\n\nI don't fully understand the distribution of labor between the wiki and Lucid's search hub.  Not sure who \"keeps them in sync\". "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13582796",
            "date": "2013-02-21T01:54:54+0000",
            "content": "That really only makes sense if you're trying to run multiple nodes on a single laptop.\n\nWhich is what you are doing in the documentation that you refer to on the Apache wiki.\n\nI don't fully understand the distribution of labor between the wiki and Lucid's search hub. Not sure who \"keeps them in sync\".\n\nLucid does - like I said, it has nothing to do with the Apache community. Our stuff is only on the Apache Solr wiki. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717110",
            "date": "2013-07-23T18:47:09+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971123",
            "date": "2014-04-16T12:57:13+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15487771",
            "date": "2016-09-13T17:05:17+0000",
            "content": "Again, I think the bin/solr script has allowed documentation modifications that take care of this issue. "
        }
    ]
}