{
    "id": "SOLR-2663",
    "title": "Refactor FieldTypePluginLoader out of IndexSchema",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I have a use case where i'd like to be able to programmaticly \"test\" if a (single) arbitrary FieldType configuration is valid, but this is currently impossibly because the code to parse/init FieldTypes is buried deep inside IndexSchema.readSchema using anonymous inner-subclasses of AbstractPluginLoader.\n\nI'd like to refactor this out into a concrete public class.  Regardless of my usecase, i think this is a good idea in general since it makes IndexSchema a lot easier to read/maintain and helps make it more obvious exactly what info is being used when initializing the FieldTypes+Analyzers",
    "attachments": {
        "SOLR_2663.patch": "https://issues.apache.org/jira/secure/attachment/12486912/SOLR_2663.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13067246",
            "date": "2011-07-18T19:55:22+0000",
            "content": "patch that refactors a big chunkc of IndexSchema.readSchema into a new public FieldTypePluginLoader.\n\nThis patch also adds a new public getDefaultLuceneMatchVersion() to IndexSchema (which seems like it should have been added a while ago) and converts the existing private IndexSchema.readSimilarity method into a package protected static method since it's used both for hte global default and for per field similarity (i thought about making it public, but it wasn't entirely obvious that it's something we really want to advertise) "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13067273",
            "date": "2011-07-18T20:26:18+0000",
            "content": "\nRegardless of my usecase, i think this is a good idea in general since it makes IndexSchema a lot easier to read/maintain and helps make it more obvious exactly what info is being used when initializing the FieldTypes+Analyzers\n\n+1, I find it hard to navigate this class, I think it helps to split it up. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13067901",
            "date": "2011-07-19T19:27:11+0000",
            "content": "Committed revision 1148494. "
        }
    ]
}