{
    "id": "SOLR-698",
    "title": "SpellCheckComponent should use the queryString set in the ResponseBuilder",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SpellCheckComponent should check if a previous component has set the queryString property on ResponseBuilder before using the \"q\" parameter.\n\nThis will allow it to be used with query components besides QueryComponent.",
    "attachments": {
        "SOLR-698.patch": "https://issues.apache.org/jira/secure/attachment/12388167/SOLR-698.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lars Kotthoff",
            "id": "comment-12622413",
            "date": "2008-08-14T01:35:08+0000",
            "content": "Isn't the queryString attribute of ResponseBuilder the same as CommonParams.Q? At least a quick review of the code suggests that it's only ever set to CommonParams.Q.\n\nCould you elaborate on how this allows SpellCheckComponent to be used with more components? If you need a special spellcheck query you can specify spellcheck.q in the request. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12622480",
            "date": "2008-08-14T08:50:33+0000",
            "content": "ResponseBuilder#setQueryString can be used by other components to change the query itself before it is passed down to SpellCheckComponent. Moreover all other components such as FacetComponent, QueryComponent and DebugComponent use the ResponseBuilder#getQueryString. I guess SpellCheckComponent should also do the same. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12622489",
            "date": "2008-08-14T09:22:54+0000",
            "content": "Committed revision 685830.\n\nThanks Steven! "
        },
        {
            "author": "Steven Broadbridge",
            "id": "comment-12622544",
            "date": "2008-08-14T13:20:45+0000",
            "content": "To answer Lars Kothoff's question:\nSuppose you have an \"advanced search\" form with range queries defined by pairs of input fields and multiple query fields with \"any word\", \"all words\" and \"exact phrase\" selectors. Suppose further that you cannot, are not allowed to, and/or don't want to use JavaScript to assemble \"q\" on the client side. Then you would create a custom SearchComponent to assemble the query string in prepare() and call ResponseBuilder#setQueryString (process() will be a noop). The QueryComponent down the chain will do the search with the specified query instead of looking for it in \"q\". SpellCheckComponent should do the same. And now it does! "
        }
    ]
}