{
    "id": "SOLR-2320",
    "title": "ReplicationHandler doesn't return master details unless it's also configured as a slave",
    "details": {
        "affect_versions": "1.4,                                            1.4.1",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "While investigating SOLR-2314 i found a bug which seems to be the opposite of the behavior described there – so i'm filing a seperate bug to track it.\n\nif ReplicationHandler is only configured as a master, \"command=details\" requests won't include the \"master\" section.  that section is only output if it is also configured as a slave.\n\nthe method responsible for the details command generates the \"master\" details just fine, but the code to add it to the response seems to have erroneously been nested inside an if that only evaluates to true if there is a non-null SnapPuller (ie: it's also a slave)",
    "attachments": {
        "SOLR-2320.patch": "https://issues.apache.org/jira/secure/attachment/12468723/SOLR-2320.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12983522",
            "date": "2011-01-19T03:35:46+0000",
            "content": "simple patch moving the code for adding the details out of the nested conditional.\n\nhoping someone who understands replication better then me can sanity check this.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12986127",
            "date": "2011-01-25T00:28:53+0000",
            "content": "Updated patch that includes a really trivial test of the details command (which fails w/o the previously mentioned fix) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12986154",
            "date": "2011-01-25T00:54:03+0000",
            "content": "enhanced the test to also look at the details command for a repeater.\n\nthis required some rather invasive refactoring of the test in order to be able to construct a SolrInstance which was both a master and a slave – but i think on the whole the test is improved (logic added for dealing with arbitrary \"solrconfig-${name}.xml\" files in SolrInstance constructor, and a lot of config file copying was refactored into common methods)\n\nIf there are no objections, i'll commit ASAP. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12986507",
            "date": "2011-01-25T16:41:48+0000",
            "content": "Committed revision 1063339. - trunk\nCommitted revision 1063343. - 3x "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013065",
            "date": "2011-03-30T15:45:26+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}