{
    "id": "SOLR-2223",
    "title": "Separate out \"generic\" Solr site from release specific content.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "It would be useful for deployment purposes if we separated out the Solr site that is non-release specific from the release specific content.  This would make it easier to apply updates, etc. while still keeping release specific info handy.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-12930173",
            "date": "2010-11-09T15:59:03+0000",
            "content": "The problem here is there is one and only one release specific doc.  It seems like a waste to move things around for one doc, but I suppose it is still worth it since there isn't a clean way to do it now. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12930178",
            "date": "2010-11-09T16:06:43+0000",
            "content": "Here's what I propose to do:\n\n\n\tMove main site to https://svn.apache.org/repos/asf/lucene/solr/site\n\tKeep tutorial and release content where it is\n\tUpdate the release packaging to bring in the non-release content as part of a release\n\tFix the docs on how to deploy it.\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12930241",
            "date": "2010-11-09T19:20:03+0000",
            "content": "Given the dev merge of lucene/solr, and the reduction in subprojects due to graduation, and the consideration of a using hte new CMS, now is probably a good time to consider abandoning the way we've been having distinct svn paths for the \"site\" of each subproject.\n\nwhy not move to a single \"site\" directory in svn for the entire TLP that  the CMS updates (which can still have subdirs by project and what not, but can easily maintain a consistent navigation and look and fell) and then keep only the releases specific docs in the individual sub-proj trunk dirs? "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12930284",
            "date": "2010-11-09T20:54:00+0000",
            "content": "Yes, Hoss, that would make sense.  I was just trying to do the least amount of work now for LUCENE-2746 to satisfy the needs there before we move to the new CMS. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12930314",
            "date": "2010-11-09T22:08:09+0000",
            "content": "I don't really understand why this blocks  LUCENE-2746 ? the solr \"site\" snapshot has always refered to \"trunk\", not the release -  it's something we've talked about changing to mimic the way lucene-java had release specific tutorials/docs but never got around to.\n\nAdding the TMs and consistent project name verbage to the site where it lives in svn right now and publishing should be just fine for satisfying LUCENE-2746  - no need to revamp how we build the site if we're just going to revamp it again using the CMS. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16019013",
            "date": "2017-05-21T22:42:23+0000",
            "content": "Closing ancient issue as \"not a problem\", since release-code is now in git anyways. Right? "
        }
    ]
}