{
    "id": "SOLR-9006",
    "title": "RealTime Get (RTG) does not return child documents from the transaction log",
    "details": {
        "components": [
            "SearchComponents - other"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.5,                                            6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "RealTimeGet component does not retrieves child documents from the transaction (update) log.   Although there is no mechanism, using /get to retrieve parent document with all its children.  Note: that _version_ field appears only on in the parent document and the update is only as a whole (parent with all children.)  Therefore, I think the capability (e.g. additional flag) to get parent with all its children is very important..",
    "attachments": {
        "SOLR-9006(6.0).patch": "https://issues.apache.org/jira/secure/attachment/12802376/SOLR-9006%286.0%29.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-20T07:59:01+0000",
            "author": "Ariel Lieberman",
            "content": "By all means not a perfect patch.   However, it conveys what needs to be fixed. \n(Note: This patch is on top of V6.0) ",
            "id": "comment-15249457"
        },
        {
            "date": "2016-05-05T07:35:45+0000",
            "author": "Ariel Lieberman",
            "content": "a fix. check if there is transformer in the request. ",
            "id": "comment-15272020"
        },
        {
            "date": "2016-05-05T07:40:10+0000",
            "author": "Ariel Lieberman",
            "content": "the patch, when retrieving from tlog, does not consider the actual information in the child transformer. it just brings all the doc children.  ",
            "id": "comment-15272026"
        },
        {
            "date": "2018-06-08T13:49:47+0000",
            "author": "David Smiley",
            "content": "This looks like a nasty oversight.  I figured RTG didn't supported nested docs as I was just looking through the RTG code and see no mention of \"child\" or \"nested\" and I see some code that should be doing child/nested stuff but is not. ",
            "id": "comment-16506046"
        }
    ]
}