{
    "id": "SOLR-8672",
    "title": "Unique Suggestions getter in Solrj",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.4.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Currently all the suggesters based on full field content retrieval gives back possibly duplicated suggestions.\n\nFirst observation , related the suggester domain, is that is unlikely we need to return duplicates ( actually we don't return the id of the document, or anything else, so having duplicates is arguably not a benefit) .\n\nI propose at least to offer via SolrJ  the possibility of getting the suggestions without duplicates.\nAny feedback is welcome.\nThe patch provided is really simple.",
    "attachments": {
        "SOLR-8672.patch": "https://issues.apache.org/jira/secure/attachment/12787474/SOLR-8672.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-11T18:00:43+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Thanks for the patch Alessandro. Wouldn't it be better to resolve this at the suggester level? There has been some discussions about this in LUCENE-6336 ",
            "id": "comment-15191305"
        },
        {
            "date": "2016-03-14T04:23:55+0000",
            "author": "David Smiley",
            "content": "+1 to the DedupDictionaryWrapper suggested in LUCENE-6336\nAlthough I sympathize with also going ahead with the practical simplicity of the patch here.  It's not an either-or... and this patch is simple and here today with a test.  +1 to this patch too. ",
            "id": "comment-15192727"
        },
        {
            "date": "2016-03-14T09:43:04+0000",
            "author": "Alessandro Benedetti",
            "content": "Hi David,\nI agree this was a simple contribution to try to have a quick fix to the problem at least at SolrJ level.\nI thought more about the problem, and I agree with Tomas.\nI even think we should NOT include my own patch here, this is my reason :\n\nif we add now this SolrJ support and in the future we add the suggester solrconfig.xml parameter, users are going to be confused.\nThe solrconfig.xml approach will be the most efficient and recommended but the presence of this method SolrJ side could grow confusion in people minds and generate some scenario where you use the Solrj method but actually going to the solr configuration would be optimal.\nDoes this make sense ?\n\nI will proceed in studying a little bit LUCENE-6336 and some internals, I will end up with a proposal here and in the mailing list ( with related Jira) .\n\nNot sure if a Dedup Wrapper is the best way, ideally I don't want to generate at all duplicates, avoid  a wrapper reading the list again and removing duplicates.\nI will spend some time on that!\n\nCheers ",
            "id": "comment-15192984"
        }
    ]
}