{
    "id": "SOLR-3830",
    "title": "Rename LFUCache to FastLFUCache",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I find it a little disturbing that LFUCache shares most of its behavior (not strictly bounded size, good at concurrent reads, slow at writes unless eviction is performed in a separate thread) with FastLRUCache while it sounds like it is the LFU equivalent of LRUCache (strictly bounded size, synchronized reads, fast writes) so I'd like to rename it to FastLFUCache.\n\nMaybe we should also rename these Fast*Cache to Concurrent*Cache so that people don't think that they are better than their non Fast alternatives in every way.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13454067",
            "date": "2012-09-12T15:40:16+0000",
            "content": "so I'd like to rename it to FastLFUCache.\n\n+1, it hasn't been used in the default solrconfig.xml, so this change shouldn't really affect anyone.\n\nI don't think we should rename the other ones that people are likely to have in their configs already though.  There is a note right next to where one would configure these cases that tries to explain the difference.  We should update that if it's not sufficient. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13454085",
            "date": "2012-09-12T16:10:56+0000",
            "content": "-1.\n\nRepeating my comment from SOLR-3393...\n\n\n#OhDearGodPleaseNotAnotherClassWithFastInTheName\n\nPlease, please, please lets end the madness of subjective adjectives in class names ... if it's an LFU cache wrapped around a \"hawtdb\" why don't we just call it \"HawtDbLFUCache\" ?\n\nwe should not be adding new names with \"Fast\" in front of them - it does nothing to help the user understand the value of the class.\n\n\nMaybe we should also rename these Fast*Cache to Concurrent*Cache so that people don't think that they are better than their non Fast alternatives in every way.\n\nI would much rather rename FastLRUCache to something else (with a deprecated FastLRUCache stub subclass still provided for config backcompat) then see any more a new Fast*Foo class. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13454154",
            "date": "2012-09-12T17:36:18+0000",
            "content": "OK, let's leave things as they are then.  Documentation is the key if we need to clarify anything. "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13454291",
            "date": "2012-09-12T19:49:30+0000",
            "content": "we should not be adding new names with \"Fast\" in front of them\n\nThis is why I also suggested to rename FastLRUCache to ConcurrentLRUCache in my 2nd paragraph (or something else, I'm open to other ideas).\n\nOK, let's leave things as they are then. Documentation is the key if we need to clarify anything.\n\nWhy don't you like renaming FastLRUCache to something else and adding a deprecated FastLRUCache subclass for backward compatibility, as Chris suggests? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13454299",
            "date": "2012-09-12T19:59:56+0000",
            "content": "I have a higher bar for renaming things in config files and APIs.\nSolr has a large user base with tons of people that know what things do, and we often overlook the downside of destroying collective knowledge by renaming things that are only a slight improvement.\n\nI personally think Lucene has gone rename-crazy and wouldn't do many of those if it were up to me... "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13454309",
            "date": "2012-09-12T20:10:10+0000",
            "content": "Given that we can neither rename LFUCache to FastLFUCache nor rename FastLRUCache to something else, I am marking this issue as won't fix since there is no way to have a consistent name for these two classes. "
        }
    ]
}