{
    "id": "SOLR-702",
    "title": "Long lists of synonyms seem not to work",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "I've been having issues with synonyms apparently not working. Shorter lists work just fine, while longer lists do not appear to work. I'll attach my schema, config, and synonyms file for testing. \n\nAs a quick example... this works...\nzutanoapparel => zutano\n\nBut this does not...\naadias, aadidas, aaidas, adadas, adaddas, adaddis, adadias, adadis, adaidas, adaies, addedas, addedis, addidaas, addidads, addidais, addidas, addidascom, addiddas, addides, addidis, adeadas, adedas, adeddas, adedias, adiada, adiadas, adiadis, adiads, adida, adidaas, adidas1, adidass, adidaz, adidda, adiddas, adiddias, adidias, adidis, adiidas, aditas, adudas, afidas, aididas, wwwadidascom => adidas\n\nThis works...\nliumiani, loomiani, lumaini, lumanai, lumani, lumiami, lumian, lumiana, lumianai, lumiari, luminani, lumini, luminiani => lumiani\n\nBut this does not...\nclegerie, cleregie, clergerie, clergie, robertclaregie, robert claregie, robertclargeries, robert clargeries, robertclegerie, robert clegerie, robertcleregie, robert cleregie, robertclergeic, robert clergeic, robertclergerie, robertclergi, robert clergi, robertclergie, robert clergie, robertclergoe, robert clergoe, robertclerige, robert clerige, robertclerterie, robert clerterie => Robert Clergerie",
    "attachments": {
        "schema.xml": "https://issues.apache.org/jira/secure/attachment/12388260/schema.xml",
        "solrconfig.xml": "https://issues.apache.org/jira/secure/attachment/12388261/solrconfig.xml",
        "Synonyms2.txt": "https://issues.apache.org/jira/secure/attachment/12388259/Synonyms2.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Matthew Runo",
            "id": "comment-12622619",
            "date": "2008-08-14T17:39:19+0000",
            "content": "My synonyms file. Some of them work, some do not. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12622640",
            "date": "2008-08-14T18:50:25+0000",
            "content": "I just tried some of these long lines, and they seem to work fine.\n\nThe \"text\" fieldType looks a bit interesting... you probably don't want the synonym filter to be after the stemmer. "
        },
        {
            "author": "Matthew Runo",
            "id": "comment-12622899",
            "date": "2008-08-15T15:43:59+0000",
            "content": "That's fair. Thank you for your help!  "
        }
    ]
}