{
    "id": "SOLR-2084",
    "title": "ContentStreamUpdateRequest should play nice even with no streams",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As noted by a user, attempting to use stream.file or stream.url with the ContentStreamUpdateRequest (an understandable situation that might arise if people aren't completely clear on when it's needed) can result in an NPE from CommonsHttpSolrServer (because it has no streams to send) ...\n\n\njava.lang.NullPointerException\n        at org.apache.solr.client.solrj.impl.CommonsHttpSolrServer.request(CommonsHttpSolrServer.java:381)\n        at org.apache.solr.client.solrj.impl.CommonsHttpSolrServer.request(CommonsHttpSolrServer.java:243)\n        at CommonTest.indexFilesSolrCell(CommonTest.java:59)\n        at CommonTest.main(CommonTest.java:26)\n\n\n\nUpdateRequest doesn't have this problem, In the pathological case of no streams ContentStreamUpdateRequest should behave just like UpdateRequest and QueryRequest.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12901648",
            "date": "2010-08-23T22:52:57+0000",
            "content": "Hmm... poking arround the code for a few minutes, the bug isn't as obvious as i thought.\n\n i expected to see a List of ContentStreams in ContentStreamUpdateRequest that defaults to \"null\", but that doesn't seem to be the case – it appears to be correct in maintaining an empty List.\n\nthe code arround line 381 or CommonsHttpSolrServer.request however seems fairly hokey.  It seems to be making some odd decisions about when to use a multi-part request, and if it decides it doesn't need a multipart request, then it assumes there is exactly one ContentStream – there is no accounting for the possibility of an UpdateRequest that has zero streams.\n\n(I'm not sure why UpdateRequest works even when no documents have been added ... it must tickle some change in the code path)\n\nIt's seems like we should just simplify the code to always use multipart when doing POST requests, and then a simple loop over the list of ContentStreams should work just fine. "
        }
    ]
}