{
    "id": "SOLR-6902",
    "title": "Use JUnit rules instead of inheritance with distributed Solr tests to allow for multiple tests without the same class",
    "details": {
        "components": [
            "Tests"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.1",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "Finally got annoyed enough with too many things being clubbed into one test method in all distributed Solr tests (anything inheriting from BaseDistributedSearchTestCase and currently implementing doTest)..\n\nThis just lays the groundwork really for allowing multiple test methods within the same class, and doesn't split tests as yet or flatten the inheritance hierarchy (when abused for doing multiple tests), as this touches a lot of files by itself. For that reason, the sooner this is picked up the better..",
    "attachments": {
        "SOLR-6902.patch": "https://issues.apache.org/jira/secure/attachment/12691520/SOLR-6902.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-30T19:47:46+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user andyetitmoves opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/121\n\n    Use JUnit rules instead of inheritance with distributed Solr tests to allow for multiple tests without the same class\n\n    Patch for SOLR-6902\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/bloomberg/lucene-solr trunk-shard-junit-rule\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/121.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #121\n\n\ncommit 02d678044a9f399a6bdf63e9a977d6e760a0a1bf\nAuthor: Ramkumar Aiyengar <raiyengar@bloomberg.net>\nDate:   2014-12-30T14:39:23Z\n\n    Use JUnit rules instead of inheritance with distributed tests to allow for multiple tests without the same class.\n\n ",
            "id": "comment-14261414"
        },
        {
            "date": "2014-12-30T19:51:12+0000",
            "author": "Ramkumar Aiyengar",
            "content": "There's a bit of a subtlety here btw with a re-implementation of the setUp/tearDown mechanism since I couldn't figure out a way to have rules run after they have (which are tagged @Before). ",
            "id": "comment-14261419"
        },
        {
            "date": "2015-01-10T14:08:56+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Updated diff to resolve conflicts against latest trunk ",
            "id": "comment-14272509"
        },
        {
            "date": "2015-01-10T18:23:26+0000",
            "author": "Erick Erickson",
            "content": "Where's the patch file? ",
            "id": "comment-14272633"
        },
        {
            "date": "2015-01-10T21:34:19+0000",
            "author": "Ramkumar Aiyengar",
            "content": "The patch is in the pull request, but if you need it as a patch file attached, here you go, I have attached it now.\n\n(I know you mentioned putting in a patch file instead of a PR in a different issue, it's just that I personally find it easier/better to use git + pr as a workflow, and the PR integration to dev-list and mails like http://markmail.org/message/whjq4u2zkpjoh4b2 seem to suggest that it's an accepted method. That said, if a committer requests it as a patch file, I am happy to oblige..) ",
            "id": "comment-14272701"
        },
        {
            "date": "2015-01-12T05:48:36+0000",
            "author": "Erick Erickson",
            "content": "Here's another version that removes a lot of the unused imports. I have to confess I've just skimmed it, I'll take a closer look at the base classes (where all the real action is) tomorrow.\n\nI guess my question for everyone is what the consensus is here? My reservation is mostly that this touches a lot of files, and we're trying to cut 5.0 next week. I'm reluctant to change this much code this close to setting the tag for 5.0. This seems more like style/cleanup than fixing outstanding problems, so I'm thinking that waiting until the label is set for 5.0 and putting this in 5.1 might be the right thing to do here, assuming there are no objections. Waiting will make resolving conflicts even more \"interesting\" since Alan is going to be in the test code for removing old-style solr.xml....\n\nThat said, if some of the heavy cloud hitters (e.g. Mark Miller Alan Woodward and  Noble Paul) think differently I'll be happy to commit this after the precommit problem is fixed (see below).\n\nThe precommit target fails with:\n/test-framework/src/java/org/apache/solr/BaseDistributedSearchTestCase.java:87: warning - @ShardsFixed(num is an unknown tag.\n\nThat's not a big deal though, I can ask someone who knows how to fix that where to look. LuceneTestCase? Anyway, if we go forward we can fix that I'm sure.\n\nBTW, I'm \"Git challenged\", and last time I tried to pull down a patch I somehow got the wrong stuff, thanks for providing it! Generally we like to have the patch rather than go to a repo so the JIRA is self-contained, we never know when a repo will go away. ",
            "id": "comment-14273237"
        },
        {
            "date": "2015-01-12T16:25:16+0000",
            "author": "Mark Miller",
            "content": "It's a great issue, but a bad idea to fuss with it right before 5.0 I think. We should be focused on test hardening rather than something that might introduce instability. I know that is a bit inconvenient, but Anshum has said he will be cutting an rc very soon.\n\nI think it's also too painful to simply do it on trunk for now and backport later.\n\nWe will have a release branch very soon though and then it can go in. ",
            "id": "comment-14273736"
        },
        {
            "date": "2015-01-12T17:12:10+0000",
            "author": "Erick Erickson",
            "content": "bq: a bad idea to fuss with it right before 5.0 I think\n\nYeah, that was my feeling too, nice to have confirmation...\n\nI'll try to keep my local copy up to date with trunk to make the eventual reconciliation smoother, we'll see how that works. ",
            "id": "comment-14273789"
        },
        {
            "date": "2015-01-12T18:37:23+0000",
            "author": "Ramkumar Aiyengar",
            "content": "No worries, putting this in after 5.0 is cut makes sense. Thanks for picking this up Erick! ",
            "id": "comment-14273913"
        },
        {
            "date": "2015-01-13T06:08:27+0000",
            "author": "Noble Paul",
            "content": "Erick Erickson This is long overdue and it is very annoying to have these tests all running from a single method. But as Mark mentioned , we are very close to 5.0 RC. So +1 for committing this after 5.0 branch ",
            "id": "comment-14274770"
        },
        {
            "date": "2015-01-17T00:20:46+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Erick Erickson, have modified your patch to get rid of the pre-commit issue. One of the files was also failing compile due to missing imports, have added that as well.. ",
            "id": "comment-14281038"
        },
        {
            "date": "2015-01-17T00:28:37+0000",
            "author": "Erick Erickson",
            "content": "Great, thanks! I was just about to tackle the annotation issue, now I don't have to.\n\nSorry about the missing import, I noticed that a couple of days ago, it's a result of some over-zealous cmd-X on my part when I was removing unused imports.\n\nShould be committing tonight/tomorrow now that 5.0 has been labeled. ",
            "id": "comment-14281048"
        },
        {
            "date": "2015-01-17T20:25:46+0000",
            "author": "Erick Erickson",
            "content": "Still doesn't pass precommit though, now the error is something about unbalanced </ul> in BaseDistributedSeachTestCase.ShardsRepeat.html. I may have some time to track this later this weekend...\n\nAnd, of course, as near as I can tell the generated file does not have any unbalanced <ul></ul> tags. Siiiigggghhhh, ",
            "id": "comment-14281526"
        },
        {
            "date": "2015-01-17T23:25:26+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Sorry, about that, I wasn't able to get that far in precommit because of an another issue on trunk currently due to a possibly broken checkJavadocLinks.py which is rejecting some external links.\n\nI fixed that, and now I see the issue. This is certainly a checkJavaDocs.py issue. It's munging and cutting the file up, and trying to validate this fragment which is one, munged, and two, cut up at a wrong place. It seems to be looking for the code between two h3 or h4's, and trying to match up ul's. It does try to add an extra ul sometimes, but in this case two ul's are needed.\n\n\n<ul><pre>public abstract&nbsp;int&nbsp;min</pre>\n<dl>\n<dt>Default:</dt>\n<dd>1</dd>\n</dl>\n</li>\n</ul>\n</li>\n</ul>\n<ul class=\"blockList\">\n<li class=\"blockList\"><a name=\"max--\">\n<!--   -->\n</a>\n<ul class=\"blockListLast\">\n<li class=\"blockList\">\n</ul>\n\n ",
            "id": "comment-14281591"
        },
        {
            "date": "2015-01-18T00:34:44+0000",
            "author": "Ramkumar Aiyengar",
            "content": "I am not sure how to proceed with the checkJavaDocs.py issue though. Michael McCandless, any suggestions, I see you have some experience with the file. With the patch above, looks like that script fails on solr/build/docs/solr-test-framework/org/apache/solr/BaseDistributedSearchTestCase.ShardsRepeat.html though the html appears to be fine.. ",
            "id": "comment-14281604"
        },
        {
            "date": "2015-01-18T23:40:43+0000",
            "author": "Ramkumar Aiyengar",
            "content": "On further inspection, doesn't look like this HTML verification adds any value, so created LUCENE-6188 to just remove it instead. ",
            "id": "comment-14282023"
        },
        {
            "date": "2015-01-19T00:15:04+0000",
            "author": "Anshum Gupta",
            "content": "This looks good from a first glance. Thanks for holding out and not pushing it into the 5.0 though . ",
            "id": "comment-14282037"
        },
        {
            "date": "2015-01-22T10:29:17+0000",
            "author": "Michael McCandless",
            "content": "I'm trying to dig into why the linter is upset by this patch ... but the patch fails to apply to current 5.x branch (at least 9 of the files match \"patch\" upset).  Is there a newer version of the patch that applies?  Or maybe we could commit this to a branch and I could run from there? ",
            "id": "comment-14287208"
        },
        {
            "date": "2015-01-22T10:42:26+0000",
            "author": "Ramkumar Aiyengar",
            "content": "The patch is highly perishable unfortunately  I will try to bring it up, but meanwhile you could use the pull request in the first update, that should reproduce the issue.. ",
            "id": "comment-14287226"
        },
        {
            "date": "2015-01-22T14:25:24+0000",
            "author": "Michael McCandless",
            "content": "Thanks Ramkumar Aiyengar I'm able to reproduce the linting bug from the original PR ... ",
            "id": "comment-14287501"
        },
        {
            "date": "2015-01-22T19:06:24+0000",
            "author": "Michael McCandless",
            "content": "OK I committed a fix to the linter ... try again? ",
            "id": "comment-14288003"
        },
        {
            "date": "2015-01-22T19:13:01+0000",
            "author": "Erick Erickson",
            "content": "Michael McCandless Thanks! \n\nAs Ram says, the half-life of this patch is short. I'd been keeping my copy up to date pretty much daily until Alan's check-in for removing support for old-style XML broke the easy updates. That code had to hit the test framework pretty heavily and I pretty much expected to have to update this patch as a result. Wish I'd been disappointed \n\nIt's on my list today/tonight unless interrupts occur or Ramkumar Aiyengar gets there first. ",
            "id": "comment-14288024"
        },
        {
            "date": "2015-01-23T05:19:02+0000",
            "author": "Erick Erickson",
            "content": "This version of the patch resolves the patching problems, compiles and precommit now passes! Many thanks to Michael McCandless.\n\nRamkumar Aiyengar any comments you'd like to make on what I had to do to reconcile this feel free. I had to reconcile three files by hand:\nExternalCollectionsTest\nAliasIntegrationTest\nBaseDistributedSearchTestCase\n\nIn addition, a new file had to stop using doTest:  RecoveryAfterSoftCommitTest\n\nFinally ShardRoutingTest just had some weird foo when the patch was applied, but the changes were minimal.\n\nRunning tests now, but probably won't see the results until tomorrow morning. If they all pass and there are no objections, I hope to commit this to trunk and 5x tomorrow or over the weekend.\n\nWhew! ",
            "id": "comment-14288765"
        },
        {
            "date": "2015-01-23T12:36:19+0000",
            "author": "Ramkumar Aiyengar",
            "content": "ExternalCollectionsTest: I think you would need to resurrect doTest now and rename it `test` with the @Test and @ShardsFixed tags – it now has two tests, and removing it will run them separately (and the second one won't run with shards setup) ",
            "id": "comment-14289191"
        },
        {
            "date": "2015-01-23T16:11:52+0000",
            "author": "Erick Erickson",
            "content": "Ramkumar Aiyengar Thanks, I must have been on drugs when I \"fixed\" that file.\n\nI changed it and the tests run, attaching a patch and committing shortly.\n\nAbsent this foo the tests ran successfully a couple of times so we'll see what we'll see. ",
            "id": "comment-14289454"
        },
        {
            "date": "2015-01-23T16:12:52+0000",
            "author": "Erick Erickson",
            "content": "Final patch with Ram's comments incorporated and CHANGES.txt ",
            "id": "comment-14289456"
        },
        {
            "date": "2015-01-23T16:13:35+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1654256 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1654256 ]\n\nSOLR-6902: Use JUnit rules instead of inheritance with distributed Solr tests to allow for multiple tests without the same class ",
            "id": "comment-14289459"
        },
        {
            "date": "2015-01-23T18:36:20+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1654300 from Erick Erickson in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1654300 ]\n\nSOLR-6902: Use JUnit rules instead of inheritance with distributed Solr tests to allow for multiple tests without the same clas ",
            "id": "comment-14289688"
        },
        {
            "date": "2015-01-23T18:37:24+0000",
            "author": "Erick Erickson",
            "content": "Thanks Ramkumar and Mike! ",
            "id": "comment-14289689"
        },
        {
            "date": "2015-01-25T15:35:41+0000",
            "author": "ASF GitHub Bot",
            "content": "Github user andyetitmoves closed the pull request at:\n\n    https://github.com/apache/lucene-solr/pull/121 ",
            "id": "comment-14291149"
        },
        {
            "date": "2015-02-14T19:29:18+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "This issue is incorrectly mentioned under 6.0 in the CHANGES.txt on trunk and under the \"Introduction\" section on branch_5x. ",
            "id": "comment-14321664"
        },
        {
            "date": "2015-02-14T20:03:47+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1659852 from shalin@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1659852 ]\n\nSOLR-6902: Move change log entry to 5.1 section ",
            "id": "comment-14321675"
        },
        {
            "date": "2015-02-14T20:06:19+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1659853 from shalin@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1659853 ]\n\nSOLR-6902: Move change log entry to 5.1 section ",
            "id": "comment-14321677"
        },
        {
            "date": "2015-04-15T00:30:40+0000",
            "author": "Timothy Potter",
            "content": "Bulk close after 5.1 release ",
            "id": "comment-14495340"
        }
    ]
}