{
    "id": "SOLR-9479",
    "title": "Extends DIH with transformation on Solr document level",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I use DIH to index nested documents.\nI have couple of use cases where field values on parent document depend on children documents values. The simplest one - I need to \"propagate\" values from all children documents to new field on parent document. It could be a little bit tricky with current DIH architecture when you can apply transformation for \"plain\" documents which considered as a plain map. See org.apache.solr.handler.dataimport.Transformer (You have to use some kind of \"transient fields\" in your data-config, this fields are populated from child sources, so sometimes you have to read child sources twice (or more times) for this. Maybe I do it wrong?)\n\nI decided that maybe it makes sense to be able to apply transformation after nested documents were converted from collection of maps into good old hierarchical SolrInputDocument. \n\nSo this initial patch was created: \n\n\tIt introduces concept of DocumentTransformer with Java interface\n\nSolrInputDocument transform(SolrInputDocument solrDoc, Context context) \n\n\tThis interface should be implemented by clients transformers. One simple example of such transformer, PropagationDocumentTransformer, is implemented. It parametrised by two field names - child and parent, and copied values from children documents to parent document.\n\tThis kind of transformer should be added into data-config.xml to corresponding parents entry:\n\n\n\n\ndocumentTransformer=\"org.apache.solr.handler.dataimport.PropagationDocumentTransformer\"",
    "attachments": {
        "SOLR-9479.patch": "https://issues.apache.org/jira/secure/attachment/12827062/SOLR-9479.patch"
    },
    "issue_links": {},
    "comments": []
}