{
    "id": "SOLR-332",
    "title": "Visibility of static int fields in FieldProperties should be increased to allow custom FieldTypes to use them",
    "details": {
        "affect_versions": "1.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Constants in org.apache.solr.schema aren't visible to classes outside that package, yet they're useful e.g. for custom FieldTypes.  Could their visibility be increased?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jonathan Woods",
            "id": "comment-12518788",
            "date": "2007-08-09T18:01:05+0000",
            "content": "I should have said: I'm assuming that the right way to define 'properties which must always be false' and 'properties which must always be true' in FieldType subclasses is by overriding FieldType.falseProperties etc.  If not, then I've missed the point. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12518800",
            "date": "2007-08-09T18:38:20+0000",
            "content": "Most of those properties are pretty low level... they were meant pretty much to map to the low level lucene field properties.\nsetting certain of them to false or true on a field would normally be done in the schema.xml\nI've done a few custom FieldType classes, but never had to touch those.\n\nWhat exactly are you trying to do? "
        },
        {
            "author": "Jonathan Woods",
            "id": "comment-12518806",
            "date": "2007-08-09T18:44:47+0000",
            "content": "I'm implementing ObjectField extends FieldType as per https://issues.apache.org/jira/browse/SOLR-328, and because it doesn't make sense (in this case) to have fields of this type as not STORED, for example, I was trying to ensure that STORED was always true.  Perhaps I've been missing the point about the function of solrschema.xml, which seems to be given pretty much free rein when defining applicable field types; but I thought that overriding trueProperties etc would be a way of preventing nonsensical configurations. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12519185",
            "date": "2007-08-11T02:18:18+0000",
            "content": "I wouldn't bother trying to enforce stored=true... there may be occasions when you actually want it to be false (field migration for example). "
        },
        {
            "author": "Jonathan Woods",
            "id": "comment-12519198",
            "date": "2007-08-11T05:59:57+0000",
            "content": "I understand.\n\nFeel free to close this issue if you think that's appropriate - it's pretty minor.  But it's not clear to me how anyone could make safe use of (the functionality) of falseProperties and trueProperties unless they were subclassing FieldType and in the the same package, simply because FieldProperties.INDEXED etc are package private.  Maybe there's a case for increasing the visibility of FieldProperties and its static constants. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12519278",
            "date": "2007-08-12T03:05:42+0000",
            "content": "It's been a while since I looked closely at FieldType, but i seem to remember a similar discussion coming up regarding the properties and isTokenized.\n\nIf people want to put logic like this in custom FieldTypes i think it makes more sense to add accessors (ala: isStored()) that can be used to check the prop values (or be overridden completely by subclasses to ignore the property outright) then it would to expose the properties directly.\n\nI agree trueProperties and falseProperties aren't curently safe to use in subclasses – i think the right way to fix that is to take away their protected status and make them private. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13014848",
            "date": "2011-04-01T22:09:38+0000",
            "content": "made protected in SOLR-2433 "
        }
    ]
}