{
    "id": "SOLR-7087",
    "title": "Temporary shard routing handoff for downed shards and repair",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Currently if a shard is lost (all of the replicas in a shard go down), there will be data loss as new documents that would be routed to the failed shard are dropped. \n\nOne potential way to mitigate this would be for Solr to recognize that a shard has gone down (no visible replicas in the cluster state) and temporarily re-route incoming documents to the remaining shards. It would keep a count of 'current active shards' as well as of the number of shards configured. When the number of active shards is less than the number configured, the routing algorithms would use that for shard keys possibly persisting the keys that would have been routed to the offline shard so that when that shard comes back online, the keys could be moved from the shard that hosted them to the one that should have gotten them. This assumes that the downed shards can recover their own Lucene indexes - if these are lost too because of a disk failure then we have to rebuild the index.  How to do that on a per-shard basis could be the subject of another ticket.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-07T00:07:06+0000",
            "author": "Mark Miller",
            "content": "data loss\n\nWe don't consider it data loss because those updates will not be accepted. A hinted handoff feature would be nice to add though, I agree. ",
            "id": "comment-14310247"
        },
        {
            "date": "2015-02-07T14:39:05+0000",
            "author": "Ted Sullivan",
            "content": "Fair point Mark, we may not call it data loss but the client may. It becomes their responsibility to log the doc ids that failed and to send them back when the shard is restored. Note that they should do this anyway because I see this as a way to mitigate not eliminate data loss. When I use this term now, I will qualify it to mean data loss within their entire system architecture. The client may not see the distinction, to them data loss is data loss.  I think that we should downgrade the impact to Minor but I understand from talking to Shalin Mangar about this, that it will probably not be trivial to implement.\n\nAs to what happens within a DIH pull. That may require another ticket. ",
            "id": "comment-14310748"
        }
    ]
}