{
    "id": "SOLR-9054",
    "title": "The new GUI is using hardcoded paths",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Closed",
        "resolution": "Duplicate",
        "priority": "Major"
    },
    "description": "(Edited)\nIf Apache Solr 6.0 is started without using the default context root \"/solr\"\nevery admin service will not work properly and is not possible to use the provided links to go back to the old GUI.\n\nIn the javascript files sometimes the parameter config.solr_path is ignored\nor replaced with the value /solr returning 404 on access.\n\nAffected files:  solr-webapp/webapp/js/services.js\nSuggested solution: Complete the integration with /js/scripts/app.js\n\nSome common use case which should be considered:\n\n\tDifferent version of Solr coexist in the same host.\n\tSometimes users have no direct access to the hosts but must use a proxied gateway (to interact with an external authentication system)\n\tA common practice is to hide internal hosts between an alias when behind a load balancer.\n  \"server.org/app1\",  \"server.org/app2\" and  \"server.org/app3\" may actually be running 3 different machines, but the user should not care about it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-05-02T15:01:38+0000",
            "author": "Cassandra Targett",
            "content": "Is this a duplicate of SOLR-9000? ",
            "id": "comment-15266740"
        },
        {
            "date": "2016-05-02T16:54:19+0000",
            "author": "Upayavira",
            "content": "Yes, it is a duplicate. \n\nWhen I implemented the new UI, I deliberately did NOT support diverting away from /solr. The location where Solr is mounted is not to be considered a user-configurable value - this, really, is a part of the move away from Solr being a War distributable to being an application in its own right.\n\nWhy do you want to replace the /solr portion of the URL? ",
            "id": "comment-15266966"
        },
        {
            "date": "2016-05-02T21:48:55+0000",
            "author": "Shawn Heisey",
            "content": "The location where Solr is mounted is not to be considered a user-configurable value\n\n+1 from me.\n\nEchoing my comment on SOLR-9000: I'm all for configurability ... but if everything is configurable, our job as developers gets a lot harder.\n\nI once read a really interesting message on the OpenNMS user list that comes to mind on this issue.  Somebody wanted to know why the IP address of a node was used as the primary key in the database, instead of something more useful to them, like a hostname, and I thought the response was particularly insightful regarding foundations and flexibility:\n\nhttps://sourceforge.net/p/opennms/mailman/message/18840361/ ",
            "id": "comment-15267571"
        },
        {
            "date": "2016-05-03T06:49:24+0000",
            "author": "Valerio Di Cagno",
            "content": "The reason we are trying to make the context configurable is: we would like to group our cores by project/context.\nIt is already possible to start solr with a different coreset on a different port but \nto handle security policies it would be easier if we could do something like:\nProject1 is restricted to Team1 and they can access it using host/solrPrj1\nProject2 is restricted to Team2 and they can access it using host/solrPrj2\n\nso if Team1 wish to upgrade their solr version while Team2 needs to hold on a previous version for a little more time we could do it without having to change the applications accessing solr.\n\nWhich is actually the very same reason a lot of enterprises use jndi and wallets instead of hardcoding their DB connections. ",
            "id": "comment-15268222"
        },
        {
            "date": "2016-05-03T13:57:18+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "to handle security policies it would be easier if we could do something like:\nIs there something specific that you are doing for security that Solr doesn't provide out of the box? ",
            "id": "comment-15268755"
        },
        {
            "date": "2016-05-05T08:57:36+0000",
            "author": "Valerio Di Cagno",
            "content": "Yes, we had to manually reenable the support for the jndi because the jetty-plus and the jetty-jndi modules were missing.\n\nAlso we need to make it possible to have different versions of Solr running at the same time and make the client work even if there is a rewrite rule or an host alias is active. ",
            "id": "comment-15272093"
        },
        {
            "date": "2016-07-21T09:58:09+0000",
            "author": "Alexandre Rafalovitch",
            "content": "The decision was not made, but at least the discussion should be all in one place. ",
            "id": "comment-15387458"
        },
        {
            "date": "2016-08-09T15:00:01+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Let's continue the discussion in the SOLR-9000 ",
            "id": "comment-15413671"
        }
    ]
}