{
    "id": "SOLR-1846",
    "title": "Remove support for (broken) abortOnConfigurationError",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Setting abortOnConfigurationError==false has not worked for some time, and based on a POLL of existing users, no one seems to need/want it, so we should remove support for it completely to make error handling and reporting work more cleanly.\n\nhttp://n3.nabble.com/POLL-Users-of-abortOnConfigurationError-tt484030.html#a484030",
    "attachments": {
        "SOLR-1846.patch": "https://issues.apache.org/jira/secure/attachment/12439811/SOLR-1846.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12849853",
            "date": "2010-03-25T19:12:57+0000",
            "content": "\nAttached patch should get us to a good point to tackle some of the related issues.  It updates all code paths (unless i missed one) that put something into SolrConfig.severeErrors so that that code path also explicilty throws the corrisponding exception.\n\nThis seems to be working well and is a good base for building up better per-core error reporting in SolrDispatchFilter (because now all the exceptions can be propogated up to CoreContainer and tracked per core)\n\nAs is, this patch breaks BadIndexSchemaTest ... and i'm not really sure what the 'right' fix is ... the test explicitly expects a bad schema.xml to be loaded properly, and then looks for 3 errors in SOlrCOnfig.severeErrors – errors are still added to severeErrors befor getting thrown, btu the test still errors out during setUp because the SolrCore can't be inited (because the IndexSchema doesn't finishing initing)\n\nmy best suggestion: split the test into three test, each using a differnet config (one per type of error tested) and assert that we get an exception during setUp. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12867740",
            "date": "2010-05-14T23:45:03+0000",
            "content": "updated patch to included the above mentioned suggestions for BadIndexSchemaTest ... it's actually a lot easier now that we have SolrTestCaseJ4\n\nAs part of this, i also enhanced AbstractPluginLoader to include the getMessage() from the exception it wraps in it's own message – this made the test easier to write, but also seems like a good idea in general (prior to this patch the exception messages just told you what type of plugin had a problem being initialized, and you had to look at the nested exception to see why it had a problem) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12868829",
            "date": "2010-05-18T21:08:40+0000",
            "content": "Committed revision 945886. "
        }
    ]
}