{
    "id": "SOLR-3093",
    "title": "Decide destiny of LuceneQueryOptimizer (solrconfig.xml: <boolTofilterOptimizer>)",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SolrConfig.java still tries to parse <boolTofilterOptimizer>\nBut the only user of this param was SolrIndexSearcher.java line 366-381 which is commented out since 3.1.\n\nFrom Solr3.6 we print a warning if we find this option is found in solrconfig.xml (SOLR-1052):\n\nWARN: solrconfig.xml: <boolTofilterOptimizer> is currently not implemented and has no effect.\n\n\n\nHowever, the dead, commented code is still in place in SolrConfig.java, SolrIndexSearcher.Java. We should decide what do do, either re-implement boolTofilterOptimizer or remove it completely.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13199768",
            "date": "2012-02-03T15:25:18+0000",
            "content": "and we fail hard if we find this config option in solrconfig.xml\n\nIt's just an optimization, so no need to fail.  Just remove all traces completely IMO. "
        },
        {
            "author": "Tommaso Teofili",
            "id": "comment-13199784",
            "date": "2012-02-03T15:41:59+0000",
            "content": "There is some code which tries to use it but I believe that since 1.4 there are more efficient ways to do the same. Should we also fail-fast if found in config or only print a warning?\n\nIMHO we should print a warning for 3.x and fail fast from 4 on. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13199789",
            "date": "2012-02-03T15:54:43+0000",
            "content": "Is there any use at all in the <HashDocSet> config any more? Should code related to this also be removed?\n\nI agree with Tommaso that fail fast is better, not to fool <=1.3 users who modify their old schema to believe that these settings have any effect at all, see discussion in SOLR-1052. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13199930",
            "date": "2012-02-03T18:47:48+0000",
            "content": "I think yonik's point is that unlike things in SOLR-1052 where existing users would have a reasonable expectation that the syntax would definitively do something (ie: use specific classes/settings), the config in this issue was always just an optimization hint, and the system ultimately works fine even if/when it is ignored.\n\nPersonally i think that in these cases, it would be sufficient to WARN that these optimization hints are no longer used and being ignored so people can clean up if/when they want, but since they don't have to change anything to have a working solr instance (that still externally behaves the way it would in older versions of solr) there's no reason to FAIL and annoy them.\n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13199945",
            "date": "2012-02-03T19:00:10+0000",
            "content": "Yea, we'll go for a WARN for these ones. Besides, it is nice that it's possible to drop-in upgrade war without upgrading config.\n\nThen when/if proper xsd validation comes around (SOLR-1758), I guess we'll need to tackle this and other similar cases again. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13200177",
            "date": "2012-02-04T00:02:00+0000",
            "content": "@MarkMiller: Just to be suer... In rev922957 with commit message \"a hackey commit of stuff needed to get on lucene 3.0.1\"  you commented out the code in SolrIndexSearcher related to LuceneQueryOptimizer to get it to compile. Was that intended as a permanent removal of the optimizer or did you plan to put it back? Do anyone want the optimizer back? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13218240",
            "date": "2012-02-28T14:50:20+0000",
            "content": "Mark, can you comment on the boolToFilterOptimizer code you commented out?\n\nI plan to include this issue in SOLR-1052 since it's all about cleaning up config parsing. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13228304",
            "date": "2012-03-13T10:08:01+0000",
            "content": "Assigning to Mark, as you commented out the code way back  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13407642",
            "date": "2012-07-06T01:17:06+0000",
            "content": "So I commented out the below. I would assume it was because Hits was removed. I don't recall if anything was actually using that method - perhaps not - if so, I'm not sure what I switched those callers to use - or if the optimizer could be used there if it made sense - I'll have to dig further when I get chance:\n\n\n          public Hits search(Query query, Filter filter, Sort sort) throws IOException {\n\t    // todo - when Solr starts accepting filters, need to\n\t    // change this conditional check (filter!=null) and create a new filter\n\t    // that ANDs them together if it already exists.\n\t\n\t    if (optimizer==null || filter!=null || !(query instanceof BooleanQuery)\n\t    ) {\n\t      return super.search(query,filter,sort);\n\t    } else {\n\t      Query[] newQuery = new Query[1];\n\t      Filter[] newFilter = new Filter[1];\n\t      optimizer.optimize((BooleanQuery)query, this, 0, newQuery, newFilter);\n\t\n\t      return super.search(newQuery[0], newFilter[0], sort);\n\t    }\n\t  } \n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412090",
            "date": "2012-07-11T22:25:58+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429764",
            "date": "2012-08-07T03:42:48+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445710",
            "date": "2012-08-31T06:13:10+0000",
            "content": "As Jan noted in his comment, this was ultimately dealt with in SOLR-1052 -  r1308608 adds a SolrConfig check if boolTofilterOptimizer is specified and if it is, logs a warning that it has no effect. "
        }
    ]
}