{
    "id": "SOLR-5805",
    "title": "SolrCloud: run a healthcheck in a background thread",
    "details": {
        "affect_versions": "4.7",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "From a discussion on the mailing list:\n\nWe had a brief SolrCloud outage this weekend when a node's SSD began to fail but the node still appeared to be up to the rest of the SolrCloud cluster (i.e. still green in clusterstate.json). Distributed queries that reached this node would fail but whatever heartbeat keeps the node in the clusterstate.json must have continued to succeed.\n\nWe eventually had to power the node down to get it to be removed from clusterstate.json.\n\nMark Miller:\n\"One simple improvement might even be a background thread that periodically checks some local readings and depending on the results, pulls itself out of the mix as best it can (remove itself from clusterstate.json or simply closes it’s zk connection).\"",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-13919350",
            "date": "2014-03-04T13:00:01+0000",
            "content": "+1. It would be good to also allow the ability to administratively inform a node that it's in an unhealthy environment (based off an external health check or manual intervention), this is something we have been meaning to get to sometime. Also, depending on the severity, taking out of the mix could just mean stop being the shard/overseer leader, stop servicing queries but continue updating indices, or stop all processing. "
        },
        {
            "author": "Steven Bower",
            "id": "comment-13919459",
            "date": "2014-03-04T14:47:22+0000",
            "content": "Probably best implementation would be a pluggable class that allows for custom definition of the healthcheck.. +1 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13919466",
            "date": "2014-03-04T14:52:13+0000",
            "content": "Probably best implementation would be a pluggable class that allows for custom definition of the healthcheck.\n\nYeah, I was thinking something pluggable, but perhaps with some low effort, sensible default impl?\n\nIt would also be interesting if you could just plug in a script that returned -1 or 0 as an option on top of custom java code. "
        }
    ]
}