{
    "id": "SOLR-12311",
    "title": "Suggester is not getting built on all replicas when \"suggest.build=true\" is issued",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "Suggester"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "7.3",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "The suggester dictionary is not getting built in all the replicas when a \"suggest.build=true\" is issued. It is getting built only on the replica that the first \"suggest.build=true\" query hits. Further queries that use the suggest component get only partial suggest results when the replicas where the dictionary is not built are hit.\n\nThis can be reproduced with the sample \"techproducts\" collection,\n\n\tCreate the \"techproducts\" collection with 2 shards and 2 replicas.\n\tThe default suggest component \"mySuggester\" has \"buildOnStartup\"=false\n\tSend in this query to build the suggester and query it, \"http://localhost:8983/solr/techproducts/suggest?suggest.build=true&suggest.dictionary=mySuggester&suggest.q=elec\" . You will see 4 suggestions.\n\tHit this query, without the \"suggest.build=true\" parameter multiple times and sometimes you will see 4 suggestions and in other times only 2 suggestions \"http://localhost:8983/solr/techproducts/suggest?suggest.dictionary=mySuggester&suggest.q=elec\"\n\tWhen the above query in Step 4 is sent with \"distrib=false\" to each of the replicas, we can see that some replicas does not return any results.\n\tWhen the logs are analyzed, we can see that the first time we send a query with \"suggest.build=true\", the suggest dictionary is built only on the replica that the distributed query hits and not the other ones.\n\n\n\nExpected behaviour:\n\nWith one \"suggest.build=true\" query, the dictionary should be built on all replicas, so that further queries can get all the suggestions.",
    "attachments": {},
    "issue_links": {},
    "comments": []
}