{
    "id": "SOLR-5912",
    "title": "Update ref guide (cwiki) ACL process to reflect new reality from infra",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Infra has rolled out a new process regarding how users/groups are managed in confluence.\n\nThe plus side: \"space admins\" can now affect the ACLs of a space, w/o needing to be confluence admins.\n\nThe down side: space admins can not control group membership - only confluence admins can, and infra is scaling back on who can/should be a confluence admin.\n\n\n\nIn a nutshell what needs to happen is:\n\n\n\tget the list of everyone currently in the solr-committers and solr-admin groups\n\tmanually add all of those people to the SOLR space ACLs using the appropriate permissions...\n\t\n\t\thttps://cwiki.apache.org/confluence/display/INFRA/Managing+permissions+on+your+project%27s+Confluence+Space\n\t\n\t\n\tUpdate our docs to reflect the new world order of how to grant ACLs to the SOLR space...\n\t\n\t\thttps://cwiki.apache.org/confluence/display/solr/Internal+-+CWIKI+ACLs\n\t\n\t\n\trequest infra remove the solr-committers & solr-admins groups once they are no longer needed",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13947292",
            "date": "2014-03-25T22:42:34+0000",
            "content": "Uwe, if you can handle this part...\n\nget the list of everyone currently in the solr-committers and solr-admin groups\n\n...and post the list of usernames here as a comment, then go ahead and re-assign to me and i'll take care of the rest.\n\nIf you can no longer access those groups, just re-assign back to me and i'll follow up with infra to get it. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13948226",
            "date": "2014-03-26T18:00:04+0000",
            "content": "Uwe got me the two lists, and i've manually added everyone to the space permsisions and updated our process docs.\n\nNext step, before asking infra to delete the groups, is to remove them from our space permisisons page – i want to hold off and do that at some point when Uwe (or someone else with confluence-admin permissions) is on IRC with me so he can re-add them in case i've borked something and lock myself out.\n\nI'll ping Uwe tomorrow AM my time see if he's around, not a rush at this point. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13948471",
            "date": "2014-03-26T21:14:26+0000",
            "content": "ACLs removed for solr-committers & solr-admins w/o incident.\n\nFiled INFRA-7508 to request that the groups be removed at some point when convenient so no one gets confused about why they don't seem to work anymore "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13948474",
            "date": "2014-03-26T21:15:38+0000",
            "content": "nothing more for us to do here - the infra issue is still open, but it doens't block any action on our part "
        }
    ]
}