{
    "id": "SOLR-488",
    "title": "Solr does not generate highlights when uniqueId field is not defined in the schema",
    "details": {
        "affect_versions": "1.2",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "highlighter"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Solr does not generate highlights when there is no uniqueId field defined in the schema. I believe the reason for this is that it's very difficult to modify or extend the XmlWriter behavior, which is why highlights reside in their own \"section\" in the response XML and subsequently need to be \"linked\" to their respective documents via the uniqueId field.\n\nOur schema does not define a uniqueId for various reasons but we still need highlights; the solution we came up with was to provide a user-definable \"link field,\" which is the document field whose value resides in the <lst name=\"215\"> elements in the generated output. I will presently attach a patch which adds a \"hl.link\" query parameter, which takes a field name and uses that as the \"link field.\" If the parameter is not specified the original behavior is used, so backwards compatibility is maintained.\n\nAs an aside, we've found this technique to be useful because our custom handlers add a lot of information to each document, and the way the response writer is implemented makes it nigh impossible to add information to any specific document within the response. I should probably open an issue which calls to reimplement this aspect of Solr.",
    "attachments": {
        "linkfield.HighlightingUtils.patch": "https://issues.apache.org/jira/secure/attachment/12376402/linkfield.HighlightingUtils.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Tomer Gabel",
            "id": "comment-12572054",
            "date": "2008-02-25T11:06:38+0000",
            "content": "Patch to HighlightingUtils.java: adds a \"link field\" parameter which allows highlight generation even when uniqueId is not defined in the schema. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12572312",
            "date": "2008-02-26T00:19:24+0000",
            "content": "Thanks for the patch!\n\nTomer, I just tested this scenario under trunk (1.3dev), and Solr does highlight documents if no uniqueKey is specified.  It is true that the highlight data is not labeled, but it is guaranteed to appear in the same order as the documents in the <results> section, so they are identifiable.\n\nWhy do you propose a query-time \"link\" field?  Do you need to be able to vary the field from request to request?\n\nAlso, it would be helpful to know why uniqueKey is not sufficient for this purpose. "
        },
        {
            "author": "Tomer Gabel",
            "id": "comment-12572407",
            "date": "2008-02-26T10:46:16+0000",
            "content": "Hi Mike,\n\nWe use a derivative of 1.2 here and have only just started looking at 1.3, however because of our development schedule I doubt we'll be able to safely use the trunk within the allotted time. Regardless, in 1.2 the highlights section is either missing or empty (can't remember which); if the order is guaranteed the same as the results this is probably good enough.\n\nAs for the query-time link field, it merely seemed like a path of least resistance to getting the functionality I need while maintaining backwards compatibility and with minimum intervention. I can't really think of a scenario where this will change (for the same schema) between requests.\n\nFinally, the unique key is insufficient because we simply don't use one. Due to various performance and design goals we prefer to handle duplicates on our own with an external system before even going to Solr. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12573080",
            "date": "2008-02-27T21:52:47+0000",
            "content": "Perhaps I should have been more clear: it is very unlikely that there will be a bugfix release for 1.2, so the best that can be done is to look at the closed issues in JIRA for the highlighter to find the change that fixed the bug in the current version.\n\nAs for uniqueKey, it is about more than finding duplicates at document insertion time.  It is also a unique identifier for each document used for federated search, highlighting, and other places (exactly what you are looking for).  If you want to turn off Solr's duplicate detection, just add allowDups=\"true\" to the <update/> you send to solr.  "
        },
        {
            "author": "Tomer Gabel",
            "id": "comment-12577479",
            "date": "2008-03-11T15:26:58+0000",
            "content": "I'll try the solution you've mentioned; worst case we'll use the custom-tailored solution... feel free to close the bug. If I still see this an issue with 1.3 I'll reopen it or post another one. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12577518",
            "date": "2008-03-11T17:10:32+0000",
            "content": "The principal issue is fixed in 1.3.\n\nThanks Tomer. "
        }
    ]
}