{
    "id": "SOLR-2989",
    "title": "Solr admin (Luke request handler) doesn't order the fields alphabetically",
    "details": {
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "SearchComponents - other"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It's always bugged me that the fields list for admin/schema browser haven't been alphabetical. We have users who have 100s of fields and it's hard to orient in an unordered list. \n\nI'll attach a patch momentarily that starts moves toward this. The thing I need someone to render judgement on is whether implementing the Comparable interface on SchemaField and FieldType are in any way dangerous. Note that they only compare on name, secondary and tertiary sources are unnecessary I think.\n\nThe other interesting bit is that the list of fields is actually (apparently) fetched in two stages. The first stage gets the ones in the schema and the second one gets dynamic fields that have been realized. So the \"fields\" section actually has two separate ordered sections. Which is kind of ugly, but given the new admin interface coming in 4.x I don't feel the urge to fix this.",
    "attachments": {
        "SOLR-2989.patch": "https://issues.apache.org/jira/secure/attachment/12508788/SOLR-2989.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13176799",
            "date": "2011-12-28T20:29:02+0000",
            "content": "First cut at a patch. This is for 3x because that's where I happened to be working, but if we carry this forward, I can put it on trunk to I assume. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13178020",
            "date": "2011-12-31T14:22:06+0000",
            "content": "This Jira will probably be killed, it's unnecessary to implement Comparable on SchemaField and FieldType after all. I'm working on SOLR-1931 and have implemented a LukeRequestHandler-only solution there. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13181028",
            "date": "2012-01-06T01:27:58+0000",
            "content": "Fixed as part of SOLR-1931 "
        }
    ]
}