{
    "id": "SOLR-10217",
    "title": "Add a query for the background set to the significantTerms streaming expression",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Following the work on SOLR-10156 we now have a significantTerms expression.\n\nCurrently, the background set is always the full index.  It would be great if we could use a query to define the background set.",
    "attachments": {
        "SOLR-10217.patch": "https://issues.apache.org/jira/secure/attachment/12866477/SOLR-10217.patch",
        "SOLR-20217.patch": "https://issues.apache.org/jira/secure/attachment/12857062/SOLR-20217.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-09T14:38:02+0000",
            "content": "Adding an initial patch for a significant terms background query.  I will work next on improving the tests. ",
            "author": "Gethin James",
            "id": "comment-15903133"
        },
        {
            "date": "2017-03-09T18:18:59+0000",
            "content": "I added a new patch file.  If you prefer a pull request let me know, I have the changes on a branch from master (https://github.com/covolution/lucene-solr/tree/SOLR-10217). ",
            "author": "Gethin James",
            "id": "comment-15903542"
        },
        {
            "date": "2017-03-09T19:07:57+0000",
            "content": "What's the reasoning behind having SignificantTermsStream accept a query instead of an incoming stream? If it accepted an incoming stream then the source data could be the result of any other stream whereas with a query the source data can only be the result of a Solr query. ",
            "author": "Dennis Gove",
            "id": "comment-15903656"
        },
        {
            "date": "2017-03-09T23:19:08+0000",
            "content": "Gethin and I had discussed using a stream for the background query. But it just seemed like the right approach in this scenario was to make it a query. The algorithm is written with an AnalyticsQuery and works directly with the index, so collecting a bitset for the background query scales really well. Using a stream we would have to feed docID's back into the AnalyticsQuery to get the background set, just seemed a lot less scalable.\n ",
            "author": "Joel Bernstein",
            "id": "comment-15904049"
        },
        {
            "date": "2017-05-04T19:10:45+0000",
            "content": "I reworked a few things in the new patch. I'll do some manual testing before committing. ",
            "author": "Joel Bernstein",
            "id": "comment-15997264"
        },
        {
            "date": "2017-05-05T15:10:45+0000",
            "content": "Latest work in progress ",
            "author": "Joel Bernstein",
            "id": "comment-15998451"
        },
        {
            "date": "2018-08-09T01:01:20+0000",
            "content": "Move issue from deprecated 'In  Progress' back to 'Open' ",
            "author": "Gavin",
            "id": "comment-16574093"
        },
        {
            "date": "2018-11-11T15:16:59+0000",
            "content": "A customer will start exploring significant terms soon and would be great to have this. Is is stable enough to get into 7.6 or 7.7? ",
            "author": "Jan Høydahl",
            "id": "comment-16682904"
        },
        {
            "date": "2018-11-12T10:13:13+0000",
            "content": "Joel Bernstein and I worked on this while we were at Alfresco, we have both left now and, to the best of my knowledge, no progress has been made.  If I remember correctly, the patch needed a different approach.  It is unlikely to get into a future release unless someone picks it up and does it .  Any update Joel? ",
            "author": "Gethin James",
            "id": "comment-16683512"
        },
        {
            "date": "2018-11-12T17:00:08+0000",
            "content": "I think Gethin pretty much sums it up. If I remember correctly there was something about the patch that needed more work. But I'd have to review again very closely to understand the issue. I think it's a nice feature though and would likely pick it back up again sometime in the future. Jan Høydahl, if there is a particularly strategic use case for the background query that you're looking at, feel free to explain it in the ticket and I can perhaps pick the ticket back up sooner. ",
            "author": "Joel Bernstein",
            "id": "comment-16684085"
        }
    ]
}