{
    "id": "SOLR-1917",
    "title": "Possible Null Pointer Exception in highlight or debug component",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "This bug may only show up if you have the patch for SOLR-1143 installed, but it should be fixed in any case since the existing logic is wrong.  It is explicitly looking for the nulls that can cause the exception, but only after the exception would have already happened.\n\nWhat happens is that there is an array of Map.Entry objects which is converted into a SimpleOrderedMap, and then there is a method that iterates over the SimpleOrderedMap looking for null names.  That's wrong because it is the array elements themselves which can be null, so constructing the SimpleOrderedMap throws an NPE.\n\nI will attach a patch.",
    "attachments": {
        "SOLR-1917.patch": "https://issues.apache.org/jira/secure/attachment/12444748/SOLR-1917.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "David Bowen",
            "id": "comment-12868458",
            "date": "2010-05-18T00:03:41+0000",
            "content": "By the way, the way this bug showed up was when highlighting was very slow, so that the first query from master to slave (fetching the top ids and scores) was fine, but the second query, to fetch the documents by id, timed out.  \n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13835731",
            "date": "2013-11-30T13:27:48+0000",
            "content": "2013 Old JIRA cleanup "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539551",
            "date": "2016-10-02T02:20:38+0000",
            "content": "Ancient bug that may or may not have been triggered by some other ancient code. No longer relevant. If still happens, a new issue can be opened. "
        }
    ]
}