{
    "id": "SOLR-2770",
    "title": "The Solr 3.4.0 release's maven artifacts don't include the jdk1.5-compiled carrot2-core jar",
    "details": {
        "affect_versions": "3.4",
        "status": "Closed",
        "fix_versions": [
            "3.5"
        ],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The Solr-specific jdk1.5-compiled version of the carrot2-core jar (in solr/contrib/clustering/lib/) was not part of the 3.4.0 release - there should be a 3.4.0/ directory here but there is not: http://repo1.maven.org/maven2/org/apache/solr/solr-carrot2-core/.  This artifact was part of the 3.3.0 release.  The build system changes under SOLR-2452 are the cause.\n\nDawid Weiss indicated on SOLR-2428 that this Solr-specific jdk1.5-compiled artifact will continue to be required for the remainder of the 3.X release line.",
    "attachments": {
        "SOLR-2770.patch": "https://issues.apache.org/jira/secure/attachment/12494661/SOLR-2770.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Dawid Weiss",
            "id": "comment-13105396",
            "date": "2011-09-15T14:47:42+0000",
            "content": "Ugh. We should have checked, thanks for catching this Steven. Is there a way to publish it still? "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13105410",
            "date": "2011-09-15T15:00:50+0000",
            "content": "Looks like this just affects the maven release; the main artifacts include the carrot2 JAR.\n\nIt makes me nervous changing 3.4.0 at this point – it's already released so it should be read only now?\n\nMaybe we can turn around a 3.4.1 in short order? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105468",
            "date": "2011-09-15T16:26:36+0000",
            "content": "\nIt makes me nervous changing 3.4.0 at this point – it's already released so it should be read only now?\n\nMaybe we can turn around a 3.4.1 in short order?\n\nMeh, seems like a lot of process to deal with a very small problem (relatively).  \n\nThis represents an interesting test case for your assertion about the read-only nature of releases, though, since: a) it's a third-party artifact that hasn't changed since the last release, and b) it's in the \"officially unsupported\" maven arena...  I mean, if we can't change (add to in this case) a release under this circumstance, then there likely are no circumstances in which an exception would be made to the read-only policy.\n\nI'll work on adjustments to the build to enable properly producing the artifact; we'll need this regardless of the targeted release. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105490",
            "date": "2011-09-15T16:55:22+0000",
            "content": "Hmm, would a Solr 3.4.1 release entail a Lucene 3.4.1 release?  Exactly the same as the 3.4.0 release?  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13105492",
            "date": "2011-09-15T16:56:14+0000",
            "content": "\nMeh, seems like a lot of process to deal with a very small problem (relatively). \n\nWe don't have to look at the problem this way though, if we want to spin out a quick 3.4.1, we already have 5 bugfixes (core+contrib)\nin the 3.x branch we could get out to the users...\n\nPersonally I'm almost shocked more issues didnt spin out of the massive build cleanup, it seems almost inevitable there would\nbe some issues... maybe we just fix this for now in 3.5, wait a little bit for people to try the 3.4 release and see if more are uncovered? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105509",
            "date": "2011-09-15T17:19:31+0000",
            "content": "maybe we just fix this for now in 3.5, wait a little bit for people to try the 3.4 release and see if more are uncovered?\n\nLucene/Solr's 4-8 week release interval makes it more difficult to argue against this idea  "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105530",
            "date": "2011-09-15T17:33:07+0000",
            "content": "Patch against branch_3x to generate the maven artifact for Solr-specific carrot2-core.\n\nCommitting shortly to branch_3x - I'll also forward-port to trunk, which has the same problem. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105546",
            "date": "2011-09-15T17:46:30+0000",
            "content": "I'll also forward-port to trunk, which has the same problem.\n\nAck, trunk does not have the same problem - the jdk16-compiled jar in trunk is exactly the same as the artifact already available from Maven central repository. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105549",
            "date": "2011-09-15T17:48:27+0000",
            "content": "Ack, trunk does not have the same problem - the jdk16-compiled jar in trunk is exactly the same as the artifact already available from Maven central repository.\n\nBTW, this is the source of the problem: since trunk doesn't need this behavior, I forgot to add it back when backporting the build changes to branch_3x. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13105556",
            "date": "2011-09-15T17:55:16+0000",
            "content": "Committed to branch_3x in r1171192. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13105648",
            "date": "2011-09-15T20:00:50+0000",
            "content": "Thanks Steven. "
        },
        {
            "author": "Richard Vowles",
            "id": "comment-13130329",
            "date": "2011-10-19T03:11:00+0000",
            "content": "Just as a matter of course, you have completely hosed the Maven repository for other version users. This file http://repo1.maven.org/maven2/org/apache/solr/solr-core/maven-metadata.xml should refer to all versions currently available so that those who use version ranges (such as [3.3.0]) can successfully resolve. Now we can't and are forced to upgrade. Please be sure to fix this as well. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13130631",
            "date": "2011-10-19T13:47:07+0000",
            "content": "Hi Richard,\n\nI was neither aware that maven-metadata.xml was hosed nor that it was the source of information for range usage (though I must say that \"[3.3.0]\" as a range is really strange - why not just use the exact version in that case?).\n\nBut you are not forced to upgrade.  You just specify the (exact) version you want in your dependency declaration.  No?\n\nFYI, issues like this would get more visibility on the solr-user mailing list.\n\nSteve "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13139529",
            "date": "2011-10-30T03:28:07+0000",
            "content": "Just as a matter of course, you have completely hosed the Maven repository for other version users. This file http://repo1.maven.org/maven2/org/apache/solr/solr-core/maven-metadata.xml should refer to all versions currently available so that those who use version ranges (such as [3.3.0]) can successfully resolve. Now we can't and are forced to upgrade. Please be sure to fix this as well.\n\nI have fixed the maven-metadata.xml files on the ASF source (a directory on people.apache.org) from which Maven central syncs its files, so once sync happens (should be less than 24 hours from now), these files will be fixed.\n\nI have opened an issue to fix the problem in future releases: LUCENE-3543. "
        }
    ]
}