{
    "id": "SOLR-8127",
    "title": "Luke request handler does not know about dynamic fields on other shards fast enough",
    "details": {
        "components": [
            "Schema and Analysis",
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.2",
        "status": "Closed",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "Add a document with a new (never seen before) dynamic field. It will not be visible through Luke requests on the other shards for quite a while, and there is no documentation regarding exactly how long it will take. The result is that a query to Luke must be made to every shard in the cluster if all dynamic fields are needed.\n\nAll shards should be aware of a new dynamic field within seconds, if not milliseconds.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-10-05T15:48:08+0000",
            "author": "Shawn Heisey",
            "content": "The actual Luke application is standalone Lucene-level program (separate from Solr) that can open a Lucene index.  The Luke support in Solr is similar – I believe that it only functions on the specific Lucene index stored in the shard replica that handles the request.  It has absolutely no knowledge of what happens at the upper levels of Solr or SolrCloud.  As far as I'm aware, it will never show you a dynamic field that is not explicitly present in the local Lucene index (shard replica).\n\nI'm assuming that when you say \"Luke\" you are referring to the Luke request handler in Solr, not the separate Luke application.\n\nWhat may be happening here, especially if your requests are being sent to the collection rather than a specific replica/shard, is that SolrCloud is bouncing your request between different shards and replicas within the collection, so the request may be handled by replica 1 of shard 1 on one attempt, then replica 3 of shard 7 on another attempt.  If this is what is happening, then that field will only be present in the results if the request ends up on a replica for the specific shard containing the document with that field. ",
            "id": "comment-14943555"
        },
        {
            "date": "2015-10-05T15:59:12+0000",
            "author": "Alex K",
            "content": "Amazingly quick response \n\nYou're right, I've updated the ticket title to indicate this is about the Luke request handler.\n\nI believe the scenario you described is exactly what's happening. I didn't know that Luke has no way of knowing this stuff, being at the Lucene level. Thank you for giving a definitive answer. ",
            "id": "comment-14943572"
        },
        {
            "date": "2015-10-05T16:28:05+0000",
            "author": "Upayavira",
            "content": "The Luke Request Handler inquires of an index, not a collection. Therefore, adding a document with a not-yet-seen dynamic field to another shard will never show on the current shard. This functionality long precedes SolrCloud and has not been updated to take account of it. You must think of the LukeRequestHandler as requesting index information relating to the shard you are querying, and no others.\n\nNot sure if there is something to be done with this ticket. Converting the LukeRequestHandler to handle distributed requests would be neat, but isn't what is described here. ",
            "id": "comment-14943612"
        }
    ]
}