{
    "id": "SOLR-3146",
    "title": "Create migration guide from 3.x to 4.0",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.2",
            "6.0"
        ],
        "components": [
            "documentation"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Spinoff from SOLR-3141:\n\n\nPerhaps an official migration guide on the CMS would be helpful too when 4.0 hits the road. Such a guide would be more in-depth than the upgrading notes in CHANGES. We could have a paragraph about optimize/forceMerge, and another paragraph about softCommit/commitWithin as preferred to explicit commit, which is also a huge mistake many people do, they do over-committing!",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13211900",
            "date": "2012-02-20T14:59:16+0000",
            "content": "Perhaps a page on the WIKI, and when mature, move to CMS? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13211918",
            "date": "2012-02-20T15:17:48+0000",
            "content": "So I've thought about changing to soft commits by default too.  Here's the issue:\nPeople use commit to make their recent updates visible (and a NRT softCommit would now be most appropriate).\nBut commit also flushes all segments to disk and syncs them, and in a master-slave scenario causes index changes to be replicable.\n\nOne possibility is to add a softCommit default of true to the normal update handlers.\nPeople migrating an existing solrconfig wouldn't get that default, but new users (or users starting from scratch with the new solrconfig would).\n\nI don't know if it's worth it or not though.  Thoughts? "
        },
        {
            "author": "Torin Danil",
            "id": "comment-13212469",
            "date": "2012-02-21T09:06:14+0000",
            "content": "I think there are a lot of features in upcoming lucene4: starting with NRTManager, and ending with automata support (with whole shebang of regexp queries, fast fuzzy and spellcheck)\n\nAll of these need to have hooks in SOLR (I might be mistaken, but from what I've seen in trunk, those are completely missing)\n\nSo I think it's acceptable that old solr users won't get new features, just some sane defaults, but to experience the full power of new release will be required to migrate. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13501206",
            "date": "2012-11-20T14:28:21+0000",
            "content": "Is this still needed, considering Solr 4.0 has been out for a over a month now and we haven't seen a ton of issues...? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13559076",
            "date": "2013-01-21T20:38:24+0000",
            "content": "Resolving as not a problem. CHANGES.TXT was probably enough  "
        }
    ]
}