{
    "id": "SOLR-6",
    "title": "Solr admin stylesheet doesn't work well with Internet Explorer",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The admin pages look different on firefox than on IE (6 or 7).\n\n\ttables in text analysis page span whole browser, regardless of cell size\n\tseparators visible in firefox aren't visible in IE",
    "attachments": {
        "iestyles.patch": "https://issues.apache.org/jira/secure/attachment/12336457/iestyles.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Greg Ludington",
            "id": "comment-12419606",
            "date": "2006-07-07T05:07:11+0000",
            "content": "The visual differences occur because IE 6 (I do not have IE7 to test) does not seem to apply border to rows, only to cells, and also does not understand some of the more advanced selectors you have used, such as XSLT-ish select by attributes, or by child and adjacent sibling.  I am a new user to solr, but this seemed like a low-risk area where I could pitch in and help.\n\nThis proposed patch puts the relevant css information into regular css classes, and then adjusts the jsps to match, e.g. instead of \n   tr > td[name=\"highlight\"]:first-child\n\nyou have\n   td.highlight\n\nThe meanings are slightly different, and they apply to a broader range of HTML, but it improves the look in IE and did not seem to have any negative impact in Firefox 1.5.0.4.  I did not migrate every css2 selector over to a class this way, but just those that made a large difference in the way IE6 rendered the page without resorting to css hackery.\n\nIf I missed any locations, or their are awkward results in this style, feel free to comment. I purposely did not make any effort to modify tabular.xsl, as this thread indicates it is deprecated:\n\nhttp://www.nabble.com/stylesheet-issue-tf1721121.html#a4675018 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12419796",
            "date": "2006-07-08T06:18:17+0000",
            "content": "Greg, thanks for the patch!\n\nOne thing that's still a little wonky is the verticle cell dividers (left/right borders i guess?) on the analysis.jsp page. In firefox they show up as black lines, but in IE they are white.\n\nif you've got any suggestions on what's causing that i think we could consider this bad boy resolved.\n\n(i tried adding the seemingly obvious...\n\n   border-left: 1px solid #ff0000\n   border-right: 1px solid #ff0000\n\n...to \"th, td\", and \"td.debugdata, td.highlight, td.responseHeader\" with no success) "
        },
        {
            "author": "Greg Ludington",
            "id": "comment-12419801",
            "date": "2006-07-08T07:29:27+0000",
            "content": "Wonky is the correct word – if the border-left is one pixel, it shows as white.  If it is two pixels, the color shows.  A border-right appears to work even with only one pixel.  Maybe IE7 gets it right, but not IE6 \n\nIf you are going to continue to have two column analysis tables, and the first column is a th, adding this appears to do the trick in both IE6 and Firefox 1.5:\n\ntable.analysis th {\n\tborder-right:1px solid #ff9933;\n}\n "
        },
        {
            "author": "Bill Au",
            "id": "comment-12420291",
            "date": "2006-07-11T19:22:44+0000",
            "content": "Looks good for both IE6 and IE7.  I have commited the changes.\nThanks Greg for your contribution. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12420292",
            "date": "2006-07-11T19:23:32+0000",
            "content": "Committed revision 420815. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589349",
            "date": "2008-04-15T23:56:44+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}