{
    "id": "SOLR-2502",
    "title": "Add in Examples/Documentation on the new Join functionality",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As the title says, add in an example and docs on the new Join functionality added via SOLR-2272.",
    "attachments": {
        "SOLR-2502.patch": "https://issues.apache.org/jira/secure/attachment/12478467/SOLR-2502.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-13030119",
            "date": "2011-05-06T20:26:57+0000",
            "content": "Docs are started at: http://wiki.apache.org/solr/Join "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13030120",
            "date": "2011-05-06T20:30:34+0000",
            "content": "Here's what I have in mind:\nAdd in manufacturers documents and then tie the various products we have back to the manufacturers.  \n\nA query then might look like:\nhttp://localhost:8983/solr/select/?q=\n{!join%20from=manu_id_s%20to=id}\nname:ipod "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13030906",
            "date": "2011-05-09T21:27:16+0000",
            "content": "here's some progress on this.  Adds in /browse capability for Join "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13031144",
            "date": "2011-05-10T12:32:37+0000",
            "content": "My main concern is the overloading of the example data and tutorial to carry along too much of this complexity - complexity that wouldn't be needed in many real-world scenarios.  It's great to have examples of this stuff, but our \"kitchen sink\" is getting pretty full and dirty.  \n\nSplitting the example into multiple different examples/scenarios each with their own simple light-weight UI's is where I'd rather see this go. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13031305",
            "date": "2011-05-10T18:50:18+0000",
            "content": "I think the data extension I've added is fairly reasonable (products are manufactured by a manufacturer).\n\nAs for the overloading of the tutorial, I don't know.  I'm not a UI guy, but I don't think it's too bad at this point.  I'm not sure about splitting it out or not, as I think that will create a lot of redundancy in the configuration as well as in the example dir (similar to multicore, DIH, etc. which are a bit clunky now) which then becomes more confusing as it's not clear where to look for what.  I think, ideally, we have a more holistic example that seamlessly ties in all the things and presents a single unified app that mirrors a real world application, such as a store. "
        }
    ]
}