{
    "id": "SOLR-5977",
    "title": "RunUpdateProcessor: Improve error reporting for \"appears to still contain Atomic document update operations\"",
    "details": {
        "affect_versions": "4.7.1",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "update"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "When an object in an update request is an instance of Map, we assume that it is an atomic update.  If it's not, DistributedUpdateProcessor will not do anything with it at all, which means that when RunUpdateProcessor is called, it will give the error message added by SOLR-4127.\n\nThe error message is perfectly fine if the request actually contains atomic update add/set/inc commands, but if the user is not doing Atomic Updates at all, they may be very confused.  They may have included a Map object or the similar XML/JSON construct without realizing that it's incorrect.\n\nI see two ways to handle it.  I like the second, but we might want to consider both.\n\n\n\tCreate a configuration element for DistributedUpdateProcessor that will log a warning when the key in the map is NOT add/set/inc or any other verbs we add to atomic updates.  Default it to false, but set it to true in any update chain examples.  Include comments indicating that it can be omitted or set to false if there are custom update components that utilize a Map object. One idea for the parameter name: warnOnInvalidAtomicUpdate\n\tImprove the error message.\n\t\n\t\tCreate DistributedUpdateProcessor.containsMap().\n\t\tUse the new method in isAtomicUpdate(), which should only return true if the key is one of the atomic update actions.\n\t\tRunUpdateProcessor should return the current error message when isAtomicUpdate returns true, and a different error message when only containsMap() is true.  We might want another method that will return the key value for the first Map found, to customize the error message.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Uwe Schindler",
            "id": "comment-13971366",
            "date": "2014-04-16T12:57:53+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}