{
    "id": "SOLR-4442",
    "title": "Developer Curb Appeal: Consider bringing up Solr in Cloud mode by default, or enable it with a single switch, or other system trivial setting",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "There's some talk that the days of single node search is dead.  I don't quite agree, but many people are doing multinode deployments, and other engines are assuming distributed search by default.\n\nShould we consider giving Solr this ability?  Perhaps in 5.0?\n\nOr at a minimum, have some other single switch or system setting or separate jar that causes Solr to do all of it's magic Zookeeper stuff by default.\n\nI've logged some other JIRA items to take care of some of the other things that you currently need to specify when starting up 4.1.  Until reasonable defaults can be worked out, this auto-cloud mode wouldn't make as much sense.\n\nIs there any harm in bringing up Solr with ZK even if you're only working on a single machine?  (assuming all the defaults are taken care of)\n\nOr perhaps there would be some switches, effectively:\n\n\t-cloud = assume cloud mode\n\t-dev_cloud = turn on multicast, autoport selection\n\t-laptop_cloud = assume we're doing cloud, autoports, etc, except limit it to localhost\n\n\n\nI realize there's a lot of technical details here, but the current Solr startup syntax and directories overhead makes it less appealing.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13717219",
            "date": "2013-07-23T18:47:31+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971003",
            "date": "2014-04-16T12:56:52+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15487798",
            "date": "2016-09-13T17:14:44+0000",
            "content": "The bin/solr script allows for 'solr start -c' to indicate Cloud mode when starting Solr. This automatically launches the embedded ZK if the -z parameter is not also present.I think this takes care of the general idea of this issue, which was to make it easier to launch in SolrCloud mode. \n\nI'll close this while acknowledging the other part of the issue, whether it should be the default all the time, remains specifically unaddressed. "
        }
    ]
}