{
    "id": "SOLR-7767",
    "title": "Zookeeper Ensemble Admin UI",
    "details": {
        "components": [
            "Admin UI",
            "SolrCloud"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "7.5",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "For SolrCloud mode can we have the functionality to display the live nodes from the zookeeper ensemble. So that user can easily get to know if any of zookeeper instance is down or having any other issue.",
    "attachments": {
        "zk-status-error.png": "https://issues.apache.org/jira/secure/attachment/12922369/zk-status-error.png",
        "zk-status-tab.png": "https://issues.apache.org/jira/secure/attachment/12922364/zk-status-tab.png",
        "zk-status-new.png": "https://issues.apache.org/jira/secure/attachment/12934391/zk-status-new.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-10T18:53:20+0000",
            "author": "Upayavira",
            "content": "SOLR-7666 is for tracking bugs found in 5.2.1 relating to the Angular UI vs the current one. This is a feature request so not connected to SOLR-7666.\n\nAdding this support to the UI is possible, assuming there is an API for it to expose - without that, the admin UI can't do much. ",
            "id": "comment-14622744"
        },
        {
            "date": "2015-07-10T19:09:03+0000",
            "author": "Edward Ribeiro",
            "content": "Oops, sorry Upayavira, got it. Thanks for explaining.  ",
            "id": "comment-14622772"
        },
        {
            "date": "2015-07-10T19:15:24+0000",
            "author": "Aniket Khare",
            "content": "I would like to take end to end reponsibility to create API as well as to change Admin UI to resolve this. What is the process to do that? ",
            "id": "comment-14622786"
        },
        {
            "date": "2015-07-10T19:54:11+0000",
            "author": "Erick Erickson",
            "content": "Aniket Khare See the \"how to contribute\" page here: https://wiki.apache.org/solr/HowToContribute. Since this is as big a topic as it is, let's take it in stages.\n\nFirst get the source code and compile it. From there I'd coordinate with Upayavira as he knows the new Angular JS code best. Be sure you're working in the new angular JS code, not the older stuff.\n\nAnd you're really looking at just this issue, right? This is just about seeing the states of various nodes.\n\nTypically, one will discuss approaches as part of the JIRA so people have a chance to chime in. ",
            "id": "comment-14622823"
        },
        {
            "date": "2015-07-10T20:19:45+0000",
            "author": "Upayavira",
            "content": "Be sure to distinguish between the Java API that exposes Zookeeper's status to the world, and the admin UI's view of that API. The latter will be comparatively easy, but cannot happen until the API is in Solr already. ",
            "id": "comment-14622848"
        },
        {
            "date": "2017-05-07T20:58:42+0000",
            "author": "Jan Høydahl",
            "content": "Aniket Khare is this still something you'd like to work on? A first baby step could perhaps be to ensure that Solr exposes ZK ensemble state somewhere, and once that is committed, continue with a UI to show it. ",
            "id": "comment-16000067"
        },
        {
            "date": "2018-05-08T00:38:38+0000",
            "author": "Jan Høydahl",
            "content": "Here is screenshot from a new \"Zookeeper\" tab in the cloud section:\n\n\n\nIt takes zkHost string and talks directly to each configured zookeeper using the low-level socket API \"four-letter-word\" and returns monitoring status (MNTR) as well as configuration details (CONF) for each ZK. It will also print warnings if there is an odd number of nodes, if there is a mix of standalone and ensemble nodes and other warning states.\n\nThe API is added to ZookeeperInfoHandler, with parameter mntr=true. Example:\n\nhttp://localhost:8983/solr/admin/zookeeper?mntr=true\n\n{\n  \"responseHeader\": {\n    \"QTime\": 24,\n    \"status\": 0\n  },\n  \"zkStatus\": {\n    \"details\": [{\n      \"clientPort\": \"9983\",\n      \"dataDir\": \"/Users/janhoy/git/lucene-solr/solr/server/solr/zoo_data/version-2\",\n      \"dataLogDir\": \"/Users/janhoy/git/lucene-solr/solr/server/solr/zoo_data/version-2\",\n      \"host\": \"localhost:9983\",\n      \"maxClientCnxns\": \"60\",\n      \"maxSessionTimeout\": \"40000\",\n      \"minSessionTimeout\": \"4000\",\n      \"ok\": true,\n      \"serverId\": \"0\",\n      \"tickTime\": \"2000\",\n      \"zk_approximate_data_size\": \"210920\",\n      \"zk_avg_latency\": \"0\",\n      \"zk_ephemerals_count\": \"3\",\n      \"zk_max_file_descriptor_count\": \"10240\",\n      \"zk_max_latency\": \"4\",\n      \"zk_min_latency\": \"0\",\n      \"zk_num_alive_connections\": \"3\",\n      \"zk_open_file_descriptor_count\": \"158\",\n      \"zk_outstanding_requests\": \"0\",\n      \"zk_packets_received\": \"165\",\n      \"zk_packets_sent\": \"167\",\n      \"zk_server_state\": \"standalone\",\n      \"zk_version\": \"3.4.11-37e277162d567b55a07d1755f0b31c32e93c01a0, built on 11/01/2017 18:06 GMT\",\n      \"zk_watch_count\": \"18\",\n      \"zk_znode_count\": \"79\"\n    }],\n    \"ensembleSize\": 1,\n    \"mode\": \"standalone\",\n    \"status\": \"green\"\n  }\n}\n\n\n\nHere's an example of an error (one zk cannot be reached):\n   ",
            "id": "comment-16466680"
        },
        {
            "date": "2018-05-08T07:50:57+0000",
            "author": "Upayavira",
            "content": "This is fantastic to see!\n\nQuestion - is it possible to show just the things we need to know, and then have an 'advanced' button to show all of those parameters? I'd say status, follower/leader/etc is really important, whilst the rest might be overwhelming.\n\n \n\n  ",
            "id": "comment-16467032"
        },
        {
            "date": "2018-05-08T09:02:32+0000",
            "author": "Jan Høydahl",
            "content": "Sure, this is first cut. We could have both a \"details\" button as well as a \"refresh\" button here. ",
            "id": "comment-16467117"
        },
        {
            "date": "2018-05-08T09:06:37+0000",
            "author": "Jan Høydahl",
            "content": "Here's the patch: GitHub Pull Request #373 ",
            "id": "comment-16467119"
        },
        {
            "date": "2018-05-08T14:29:00+0000",
            "author": "Erick Erickson",
            "content": "BTW, I haven't chimed in about all this but +1,000 for doing the work!\n\nI'd vote to add \"zk_version\", \"clientPort\", \"serverId\"  as things we\nneed to leave in if you decide trim the list down, as those are things\npeople often get wrong and it'd be nice to have those up-front.\n\nWDYT about the data dirs? I do note that your dataDir points to\n/dataLog and dataLogDir points to /data \n\nOr maybe just list the most important ones first?\n\nTotally up to you of course.\n\nErick\n ",
            "id": "comment-16467474"
        },
        {
            "date": "2018-05-08T14:44:00+0000",
            "author": "Jan Høydahl",
            "content": "Interesting find about datalog and data, this is an ensemble based on the default ZK docker image, so it's probably a bug there \n\nI think perhaps two lines are swapped in https://github.com/apache/zookeeper/blob/722ba9409a44a35d287aac803813f508cff2420a/src/java/main/org/apache/zookeeper/server/ZooKeeperServer.java#L212 \n\nI'll come up with a suggestion for short list... ",
            "id": "comment-16467493"
        },
        {
            "date": "2018-05-08T16:02:01+0000",
            "author": "Shawn Heisey",
            "content": "ZK 3.4.11 has ZOOKEEPER-2960 as a problem.  In that version, dataDir and dataLogDir are switched.  The project removed 3.4.11 from their mirrors and released 3.4.12 to fix the problem. ",
            "id": "comment-16467607"
        },
        {
            "date": "2018-05-29T21:21:06+0000",
            "author": "Jan Høydahl",
            "content": "I have not forgotten this, but if anyone feel like contributing some unit tests, refguide text etc, then  you're welcome  ",
            "id": "comment-16494295"
        },
        {
            "date": "2018-08-03T14:53:27+0000",
            "author": "Jan Høydahl",
            "content": "I'm approaching this again. Have pushed this to the PR\n\n\tCHANGES entry\n\tRefGuide description with screenshot (same as in this issue)\n\tAdded test ZookeeperInfoHandlerTest\n\n\n\nI think in the first version, we'll simply list all info in the table, then we could make fancy collapse in later iterations if needed. The same goes for refresh button, this UI is very simple, little data is fetched, and you can always reload in browser.\n\nOne improvement could be to register this monitoring on its own endpoint /admin/zookeeper/status, i.e. its own requestHandler, rather than overloading the ZookeeperInfoHandler, what do you think? ",
            "id": "comment-16568301"
        },
        {
            "date": "2018-08-03T17:37:47+0000",
            "author": "Upayavira",
            "content": "The way zookeeper is handled in the backend of the admin UI is a mess. A simple API that returns data as the UI expects it would be a great improvement. ",
            "id": "comment-16568522"
        },
        {
            "date": "2018-08-04T11:01:10+0000",
            "author": "Jan Høydahl",
            "content": "Pushed a change to move this functionality to a new separate ZookeeperStatusHandler and map it to /admin/zookeeper/status. \n\nHope to commit this soon.\n\nDo you think it will be confusion between the existing \"Tree\" view and this new \"Zookeeper\" view, since the old \"Tree\" view shows data from Zookeeper, while this new view shows monitoring and config about the Zookeeper ensemble. Perhaps we should name the new menu \"ZK status\" instead? ",
            "id": "comment-16569152"
        },
        {
            "date": "2018-08-04T17:29:59+0000",
            "author": "Shawn Heisey",
            "content": "Jan Høydahl, I do think that using \"ZooKeeper\" for the tab would be confusing in exactly the manner you describe.  Consider this as an idea: ZK Tree and ZK Status. ",
            "id": "comment-16569252"
        },
        {
            "date": "2018-08-04T19:45:08+0000",
            "author": "Jan Høydahl",
            "content": "New update:\n\n\tMenu is now labeled \"ZK Status\" (rename of existing \"Tree\" menu can be done later)\n\tAdded \"Refresh\" button\n\tAdded \"Toggle details\" button. By default only data above grey line is visible\n\tSee screenshot\n\n\n\n ",
            "id": "comment-16569272"
        },
        {
            "date": "2018-08-05T06:22:49+0000",
            "author": "Upayavira",
            "content": "This pic looks great. My question is whether you can draw more summary out of it and present it visually.\n\nYou have the \"Status: green\". Could that be a green bar across the top?\n\nYou only show a single ZK host. How would multiples show up? Perhaps they could show up as tabs? Or a list of hosts on the left, can be clicked to reveal the data about that node. Could you draw out things about the nodes, such as whether it is standalone/follower/etc as that is important, then hide (collapsed?) the details such as data size, etc?\n\nJust some thoughts. ",
            "id": "comment-16569388"
        },
        {
            "date": "2018-08-06T08:20:20+0000",
            "author": "Jan Høydahl",
            "content": "You have the \"Status: green\". Could that be a green bar across the top?\nI'm not a graphics designer, we can do better styling in followup issues  At least the colour of the text \"green\" is green..\nHow would multiples show up?\nUpayavira please see older screenshot in this comment where you see how it looks like with an ensemble. Each host gets its own column in the table. Since there will likely not be more than 3/5/7 hosts, I figured they will fit on one screen. If there is a need for paging horizontally that can be added later.\nCould you draw out things about the nodes, such as whether it is standalone/follower/etc as that is important, then hide (collapsed?) the details such as data size, etc?\nAs I said, the info above the grey line is what shows up by default, until you click the \"Toggle details\" button, then it all expands. \n\n \n\n  ",
            "id": "comment-16569860"
        },
        {
            "date": "2018-08-06T12:36:46+0000",
            "author": "Shawn Heisey",
            "content": "I'm not a graphics designer, we can do better styling in followup issues  At least the colour of the text \"green\" is green.\n\nSomething for one of those followup issues:  I was thinking that it might be a good idea to include a small icon in the tabs for the parts of the cluster section that have a status.  Off the top of my head that would include Graph and ZK Status.  Make it a red downward pointing triangle, a yellow square, or a green upward pointing triangle.  If we want to get fancy, it can have 3D shading.  Red would be used if ALL the top-level statuses are not green or at least one of them is red.  Yellow would be used if red status has not been discovered and any top-level statuses in the tab detail are not green.  I wonder if that also needs an auto-refresh checkbox that can re-check the status with ajax every 30 seconds or so and change the icon if the status changes.\n\nEdit: Just came across information saying that 7.5 has a Nodes tab now.  That could benefit from this icon idea too. ",
            "id": "comment-16570155"
        },
        {
            "date": "2018-08-06T12:53:40+0000",
            "author": "Jan Høydahl",
            "content": "I was thinking that it might be a good idea to include a small icon in the tabs for the parts of the cluster section that have a status.\nAs it is designed now, nothing is fetched from Solr before you select a sub menu. So your suggestion somehow implies that the UI will execute some API calls to Solr and then change those icons. \n\nPerhaps what we'd really want is to replace the top-level Dashboard with a \"Cluster Dashboard\" when in cloud mode. The cluster dashboard could pull data from various Handlers to produce an overview of status for the whole cluster, i.e. a widget for ZK, a widget with a list of downed nodes, another with latest ERROR log lines, another with overseer queue etc etc. But all of this would be for another Jira issue another day  ",
            "id": "comment-16570177"
        },
        {
            "date": "2018-08-06T13:51:38+0000",
            "author": "Shawn Heisey",
            "content": "But all of this would be for another Jira issue another day \n\nDefinitely.  The discussion here brought it to mind, and I wanted to make sure I got the idea written down while it was fresh.  I was just taking a few minutes before my morning commute to catch up on the deluge of email that I get. ",
            "id": "comment-16570227"
        },
        {
            "date": "2018-08-08T10:43:29+0000",
            "author": "Jan Høydahl",
            "content": "Final changes\n\n\tParameters which are only valid for ensemble mode is now only shown in that mode\n\tLeader text is shown in boldface for easier leader identification\n\tRenamed some UI tags, styles, methods, image from \"zookeeper\" to \"zkstatus\"\n\tFixed reference guide with new screenshot and updated menu name\n\n\n\nWill commit this now ",
            "id": "comment-16573006"
        },
        {
            "date": "2018-08-08T10:44:02+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 9306922d65a3995d5816ffd61ab59fedb5202e06 in lucene-solr's branch refs/heads/master from Jan Høydahl\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9306922 ]\n\nSOLR-7767: \"ZK Status\" sub menu under \"Cloud\" tab to see status of zookeeper ensemble ",
            "id": "comment-16573009"
        },
        {
            "date": "2018-08-08T11:40:29+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 572557d8fd2a6857e0fc9ab47de40601182c0915 in lucene-solr's branch refs/heads/branch_7x from Jan Høydahl\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=572557d ]\n\nSOLR-7767: \"ZK Status\" sub menu under \"Cloud\" tab to see status of zookeeper ensemble\n\n(cherry picked from commit 9306922) ",
            "id": "comment-16573074"
        },
        {
            "date": "2018-08-08T11:42:44+0000",
            "author": "Jan Høydahl",
            "content": "Done. Will resolve this issue when INFRA-16874 is fixed ",
            "id": "comment-16573077"
        },
        {
            "date": "2018-08-09T01:01:25+0000",
            "author": "Gavin",
            "content": "Move issue from deprecated 'In  Progress' back to 'Open' ",
            "id": "comment-16574106"
        }
    ]
}