{
    "id": "SOLR-1722",
    "title": "Allowing changing the \"special\" default core name, and as a default default core name, switch to using collection1 rather than DEFAULT_CORE",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.5",
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "see http://search.lucidimagination.com/search/document/f5f2af7c5041a79e/default_core",
    "attachments": {
        "SOLR-1722.patch": "https://issues.apache.org/jira/secure/attachment/12430282/SOLR-1722.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12800306",
            "date": "2010-01-14T19:06:55+0000",
            "content": "Quick patch whipped off to show the idea. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12800311",
            "date": "2010-01-14T19:19:04+0000",
            "content": "I never really looked at the previous implementation of DEFAULT_CORE... but now I see that the default core name (if passed in) is normalized to \"\".\nDoes this have any implications for the default core to also act completely like a normal core?  Do bad things happen in we normalized the other way (mapped \"\" to the defaultCoreName)? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12800318",
            "date": "2010-01-14T19:33:49+0000",
            "content": "I'll have to check it out a little more - Noble switched this method when we removed alias'.\n\nAs far as I've seen so far, its not a problem. This is how we allow localhost:8983/solr (with no core name) to work currently. But everything I've looked at so far still works if you use localhost:8983/solr/DEFAULT_CORE\n\nIf we mapped the other way we would have to come up with a different method (like alias) to allow localhost:8983/solr for the default core. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12804090",
            "date": "2010-01-23T15:10:39+0000",
            "content": "OK, so normalization to \"\" instead of the other way (to the non-zero length core name) did end up causing a problem in SolrCloud when we use the core of the request to look up the collection.\n\nSeems like we should try to normalize the other way, and perhaps do the normalization in the dispatch filter rather than all of the lookup methods in core container? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12805093",
            "date": "2010-01-26T16:56:10+0000",
            "content": "Right - the issue with cloud was that if you ask for the core name, it's known as \"\" rather than its \"other\" name.\n\nSo their are def advantages to doing this in the dispatch filter - you can use the non \"\" name and you can get rid of all the normalization going on in core container - \n\nthe problem is back compat I think - if we just normalize in the DispatchFilter, anyone counting on getting the default core with getCore(\"\") now will have their code broken. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12830943",
            "date": "2010-02-08T13:54:12+0000",
            "content": "If no one objects, I'd like to commit this soon. I think its a clear improvement on what is there now, so I'd like to get it in. I think we can talk about how the normalization occurs in another issue.\n\nDoing things differently has its own back compat issues, and it would be nice if this configurability wasn't caught up in it. Another option we have is to leave the normalization as it is, but just change getName so that it returns the default name rather than \"\". "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12840748",
            "date": "2010-03-03T17:35:50+0000",
            "content": "small bug - defaultCoreName is looked for at /solr, but should be /solr/cores - also, defaultCoreName should really not default to DEFAULT_DEFAULT_CORENAME "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12840753",
            "date": "2010-03-03T17:41:07+0000",
            "content": "I'm going to commit this fix a little later today. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872791",
            "date": "2010-05-28T03:03:02+0000",
            "content": "\nCorrecting Fix Version based on CHANGES.txt, see this thread for more details...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E "
        },
        {
            "author": "Ephraim Ofir",
            "id": "comment-12912573",
            "date": "2010-09-20T16:46:49+0000",
            "content": "Tried using the defaultCoreName attribute on a 2 core setup.  After performing a swap, my solr.xml no longer contains the defaultCoreName attribute, and the core which was dafult is now renamed to \"\", so after restart of the process can't access it by it's former name and can't perform other operations on it such as rename, reload or swap...\n\nCreated new issue for this bug:\nhttps://issues.apache.org/jira/browse/SOLR-2127 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12912588",
            "date": "2010-09-20T17:01:14+0000",
            "content": "Thanks for the report Ephraim, thanks for the report - could you make a new issue for this bug? "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013249",
            "date": "2011-03-30T15:45:59+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}