{
    "id": "SOLR-7627",
    "title": "Either automate or stop listing the \"Versions of Major Components\" in CHANGES.txt",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "At some point along the way, we got in the practice of having a \"Versions of Major Components\" sub-section in changes.txt for each release ... in addition to the normal practice of recording the individual Jiras when deps are upgraded.\n\nmaintaining this sub-section accurately seems very tedious and error prone (see SOLR-7626) so it seems like we should either:\n\n\n\tstop doing this completely and trust the users to look at the ivy files for the dependencies\n\tfind a way to automate this so we don't have to do it manually.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-06-02T20:38:02+0000",
            "author": "Hoss Man",
            "content": "straw man proposal for automation:\n\n\n\tCommit some new file MAJOR_DEPS_VERSIONS_TEMPLATE.txt and MAJOR_DEPS_VERSIONS.txt to svn\n\tthe \"TEMPLATE\" file should list the names of the \"major\" deps we care about, along with a variable for the version that matches what we use in ivy.  it can also have a header explaining what the file is for  example...\n\nThis file is used to generate MAJOR_DEPS_VERSIONS.txt when \"ant jar-checksum\" is run\n\nEverything above the \"CUT\" line will be removed when this file is processed\n---CUT---\nVersions of Major Components\n---------------------\nApache Tika ${/org.apache.tika/tika-core}\nJetty ${/org.eclipse.jetty/jetty-server}\n...\n\n\n\tmodify the ant jar-checksums so that after rebuilding each of the checksum files, it also rebuilds MAJOR_DEPS_VERSIONS.txt from the MAJOR_DEPS_VERSIONS_TEMPLATE.txt file using the same version variables.\n\tupdate the build scripts to ensure MAJOR_DEPS_VERSIONS.txt is included in the binary releases.  source releases should include both files.\n\tupdate the CHANGES.txt file to refer people to the new MAJOR_DEPS_VERSIONS.txt file.\n\n ",
            "id": "comment-14569704"
        },
        {
            "date": "2018-04-06T20:57:56+0000",
            "author": "Steve Rowe",
            "content": "FYI get_solr_init_changes() in addVersion.py, which is run by the release manager after branching for a release, automates initial populaton of this CHANGES.txt section, pulling versions from ivy-versions.properties.  This won't keep the versions in sync though. ",
            "id": "comment-16428987"
        }
    ]
}