{
    "id": "SOLR-6131",
    "title": "Remove deprecated Token class from solr.spelling package",
    "details": {
        "affect_versions": "4.8.1",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "spellchecker"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The deprecated Token class is used everywhere in the spelling package. I am attaching a patch that refactors/replaces all occurrences with the AttributeSource class. The tests are passing.\n\nNote: the AttributeSource class also replaces Token as a hash key in many places. Having stricter equals/hashCode requirements than Token, I am a bit concerned that it could produce some duplicate suggestions, especially in the case of ConjunctionSolrSpellChecker where merging of the different spell checking suggestions takes place. If this initial approach is fine, I can create some extra checks/unit tests for this.",
    "attachments": {
        "NukeToken.patch": "https://issues.apache.org/jira/secure/attachment/12648304/NukeToken.patch",
        "SOLR-6131.patch": "https://issues.apache.org/jira/secure/attachment/12648088/SOLR-6131.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ahmet Arslan",
            "id": "comment-14016855",
            "date": "2014-06-03T16:27:59+0000",
            "content": "I see it is used in many test cases and some other places too. May be we should delete it , as the deprecation message says, and fix all compilation errors? "
        },
        {
            "author": "Spyros Kapnissis",
            "id": "comment-14017385",
            "date": "2014-06-04T05:28:41+0000",
            "content": "Hi Ahmet, Yes, I already attached a patch that does that (replaces deprecated Token class with newer TokenStream API's AttributeSource). "
        },
        {
            "author": "Ahmet Arslan",
            "id": "comment-14017482",
            "date": "2014-06-04T08:15:42+0000",
            "content": "I mean deleting Token.java from source tree, as in this patch. And fixing remaining compile errors. "
        },
        {
            "author": "Spyros Kapnissis",
            "id": "comment-14017663",
            "date": "2014-06-04T12:43:30+0000",
            "content": "Not sure it's that easy. There are a lot of places that it is still being used, even though it's obsolete since version 2.9. Any refactoring has to happen incrementally imo. This patch is specifically for the solr.spelling package. "
        }
    ]
}