{
    "id": "SOLR-10648",
    "title": "Do not expose STOP.PORT and STOP.KEY in sysProps",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Not A Problem",
        "status": "Resolved"
    },
    "description": "Currently anyone with HTTP access to Solr can see the Admin UI and all the system properties. In there you find\n\n-DSTOP.KEY=solrrocks\n-DSTOP.PORT=7983\n\n\n\nThis means that anyone with this info can shut down Solr by hitting that port with the key (if it is not firewalled).\n\nI think the simple solution is to add STOP.PORT and STOP.KEY from $SOLR_START_OPTS to the $SOLR_JETTY_CONFIG[@] variable. It will still be visible on the cmdline but not over HTTP.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-07-09T16:18:41+0000",
            "content": "These properties are also exposed via `/admin/metrics?group=jvm`. A different mechanism is used there for hiding sensitive properties, namely a section in solr.xml:/solr/metrics/hiddenSysProps/str.\n\nThese two mechanisms should at least be made aware of each other, eg. the metrics could both filter out \"hidden\" sysprops, as well as redact those in listed in RedactionUtils. ",
            "author": "Andrzej Bialecki",
            "id": "comment-16537172"
        },
        {
            "date": "2018-10-04T08:01:20+0000",
            "content": "Also, the install script could by default generate a random STOP.KEY and put that in solr.in.sh, so that prod setups do not share the default solrrocks key.\nThese two mechanisms should at least be made aware of each other, eg. the metrics could both filter out \"hidden\" sysprops, as well as redact those in listed in RedactionUtils.\nThis is perhaps for another Jira issue, but should not the solr.xml configurable list be owned by RedactionUtils and not Metrics module? Then the metrics code can talk to RedactionUtils? ",
            "author": "Jan Høydahl",
            "id": "comment-16637916"
        },
        {
            "date": "2018-10-05T09:08:21+0000",
            "content": "Reading the Jetty docs at http://www.eclipse.org/jetty/documentation/current/start-jar.html#_startup_shutdown_command_line it appears that the STOP.PORT only listens on localhost, meaning that you have to have shell access to the server in order to stop Solr. I'll update the description.\n\nYou could argue that someone with shell access to the same box should not be able to stop Solr if he/she does not have access to the 'solr' user or root, but given that Solr most often is the only application running on a server, those with access are likely Solr admins. And even if we redact the STOP:KEY in the UI, a ps -aux will still reveal the cmdline, so it does not really fix that issue.\n\nI propose to close this as won't fix. But herhaps open another issue to unify Metrics hiddenSysProps and RedactionUtils ",
            "author": "Jan Høydahl",
            "id": "comment-16639511"
        },
        {
            "date": "2018-11-08T11:38:03+0000",
            "content": "Closing this, as the STOP.KEY leak is not a big issue.\n\nThe idea of unifying sys prop redaction to one location is carried over to SOLR-12976 ",
            "author": "Jan Høydahl",
            "id": "comment-16679641"
        },
        {
            "date": "2018-11-09T16:45:06+0000",
            "content": "If any users are unswayed by Jan's rationale above (+1, btw) and would like to hide sysprops from the Admin UI, then there is a workaround for this.  Users can edit solr.in.sh and define the -Dsolr.redaction.system.pattern sysprop under SOLR_OPTS:\n\n\nSOLR_OPTS=\"$SOLR_OPTS -Dsolr.redaction.system.pattern=(.*password.*|.*PORT|.*KEY)\"\n\n\n\n(Credit to Jan, who mentioned this on the mailing list) ",
            "author": "Jason Gerlowski",
            "id": "comment-16681687"
        }
    ]
}