{
    "id": "SOLR-1734",
    "title": "Add pid file to snappuller to skip script overruns, and recover from failure",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "replication (scripts)"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "The pid file will allow snappuller to be run as fast as possible without overruns. Also it will recover from a last failed run should an older snappuller process no longer be running.  The same has already been done to snapinstaller in SOLR-990.  Overlapping snappuller could cause replication traffic to saturate the network if a large Solr index is being replicated to a large number of clients.",
    "attachments": {
        "SOLR-1734-2.patch": "https://issues.apache.org/jira/secure/attachment/12434826/SOLR-1734-2.patch",
        "SOLR-1734.patch": "https://issues.apache.org/jira/secure/attachment/12431474/SOLR-1734.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Bill Au",
            "id": "comment-12805238",
            "date": "2010-01-26T22:11:01+0000",
            "content": "I am reusing the code from SOLR-990 which adds the same feature to snapinstaller.  I have added a \"-f\" command line argument to force the snappuller to run even if one is already running.  That will be useful if network capacity is not an issue. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12829614",
            "date": "2010-02-04T14:58:41+0000",
            "content": "The original patch has a slight race condition within the time window between testing for the presence and creation of the lock file.  Since snappuller is a bash script, the revised patch uses the noclobber option to prevent that.  "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-14661699",
            "date": "2015-08-07T11:43:13+0000",
            "content": "Closing very old issue that appears to not be a real problem any more. Please feel free to re-open should anyone feel this issue needs a resolution.\n\nNot using these scripts any more "
        }
    ]
}