{
    "id": "SOLR-1273",
    "title": "rectify confusing \"Replication\" and \"Distribution\" links on solr admin screen",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Sine 1.0, the Solr Admin screen has had a \"Distribution\" link which points to \"distributiondump.jsp\" and displays stats according to data files created by the snappuller/snapinstaller scripts\n\nWith the new java based replication, when a ReplicationHandler is enabled, we now have a \"Replication\" link on the admin page pointing to \"replication/index.jsp\" which displays stats/status for java based replication.\n\nIn at least one instance, these two different links confused a user...\nhttp://www.nabble.com/Replication-In-1.4-to24356158.html#a24356158\n\nWe need to rectify this confusion prior to releasing 1.4.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12730123",
            "date": "2009-07-12T17:56:36+0000",
            "content": "We should keep the logic and information displayed on distributiondump.jsp available for people who already use script based replication and want to upgrade to 1.4 (without switching to java based replication.\n\nMy suggestion would be to use a servlet mapping to map the \"distributiondump.jsp\" path to \"replication/index.jsp\" and add logic that JSP so that if no replication handler is registered, then it falls back to looking for the data files from script based replication and displays those.\n\nThis could also simplify the logic in the admin screen – instead of displaying the replication link only when a handler is registered, the link could always be displayed, and the replication JSP could then have a basic control flow of...\n\nif (replicationHandlersRegistered) {\n  displayReplicaitonStasAndControls()\n} else if (scriptReplicationDataFilesExist) {\n  displayStatsFromScriptDataFiles()\n} else {\n  displayWarningThatReplicationNotConfigured()\n  displayLinkToSOlrReplicationWikiPage\n} "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12730124",
            "date": "2009-07-12T17:58:25+0000",
            "content": "should be dealt with in conjunction to SOLR-1255 "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12730208",
            "date": "2009-07-13T04:19:31+0000",
            "content": "use a servlet mapping to map the \"distributiondump.jsp\" path to \"replication/index.jsp\"  ....\n\nI guess ,we should let people to have both the the options \n\ninstead of displaying the replication link only when a handler is registered, the link could always be displayed,\n\nWhy not show the link disabled? Atleast that suggests the user that the feature is disabled .There can be a link alongside the disabled link which can point to the wiki page. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12733887",
            "date": "2009-07-21T23:17:00+0000",
            "content": "I guess ,we should let people to have both the the options\n\ni suppose .. but it seems confusing.  a single page listing all of the replicatio relevant info seems more straight forward.\n\nWhy not show the link disabled? Atleast that suggests the user that the feature is disabled .There can be a link alongside the disabled link which can point to the wiki page.\n\nwell, partly because it makes the index.jsp more complicated, but also because it doesn't seem any more straightforward from a user perspective.  we can put links to a wiki page directly on the replication/distribution JSPs just as easily as we can put them next to links on the main admin screen – but if you only put them on the main admin screen you've still got to worry about people with bookmarks directly to the page. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12752905",
            "date": "2009-09-09T05:12:45+0000",
            "content": "I still think it would be a good idea in the long run to have a more unified approach to these two pages, but as a short term improvement to the situation, i've added links to the wiki so people can at least understand what each page is, and find docs that immediately point them to using the other if it's not hte one their looking for.\n\nCommitted revision 812772. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13631177",
            "date": "2013-04-13T21:27:30+0000",
            "content": "SPRING_CLEANING_2013 JIRAS The whole admin UI is now different. Open new JIRAs on the new UI if necessary. "
        }
    ]
}