{
    "id": "SOLR-2290",
    "title": "the termsInfosDivisor for readers opened by indexWriter should be configurable in Solr",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Solr allows users to set the termInfosIndexDivisor used by the  indexReader during search time  in solrconfig.xml, but not in the  indexReader opened by the IndexWriter when indexing/merging.\n\nWhen dealing with an index with a large number of unique terms, setting the termInfosIndexDivisor at search time is helpful in  reducing memory use.  It would also be helpful in reducing memory use during indexing/merging if it was made configurable for indexReaders opened by indexWriter during indexing/merging.\n\nThis thread contains some background:\nhttp://www.lucidimagination.com/search/document/b5c756a366e1a0d6/memory_use_during_merges_oom\n\nIn the Lucene 3.x branch it looks like this is done in IndexWriterConfig.setReaderTermsIndexDivisor, although there is also this method signature in IndexWriter.java: IndexReader getReader(int termInfosIndexDivisor)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jason Rutherglen",
            "id": "comment-12972847",
            "date": "2010-12-18T18:19:06+0000",
            "content": "Tom, I think this can be generified to use SOLR-1447's property injection into IWC. "
        },
        {
            "author": "Tom Burton-West",
            "id": "comment-12973990",
            "date": "2010-12-22T00:13:27+0000",
            "content": "Thanks Jason,\n\nI'm still working my way though the Solr codebase and don't yet really  understand the relationship between the lucene classes and the solr classes and the Solr config process.\n\nI'd like to do the property injection.  I'm having trouble conceptualizing what the entry would be in the solrconfig.xml file\nand what the name would be in SolrIndexConfig.  How do we distinguish  between the indexReader termInfoIndexDivisor used during search and the indexReader termInfoIndexDivisor for the indexReader that is used by the indexWriter?\n\nWould it be something like this?\n\n<<indexWriter name=\"IndexWriter\" class=\"org.apache.solr.update.SolrIndexWriter\">\n<int name=\"termInfosIndexDivisor\">8</int>\n</indexWriter>\n\n\nMaybe you could point me to the classes I should be looking at?\n\nTom "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-12974224",
            "date": "2010-12-22T14:46:35+0000",
            "content": "I think it'll require creating a new sub-element of mainIndex and indexDefaults called perhaps indexWriterConfig?  Because attributes such as unlockOnStartup and reopenReaders cannot be injected in, and we probably don't want to mix injected properties with non-injected properties? "
        }
    ]
}