{
    "id": "SOLR-574",
    "title": "Option to omit eTag cache (in favor of solely using last-modified)",
    "details": {
        "affect_versions": "1.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I like the idea of the http caching features in 1.3 but I don't want it to use ETags.  At least the lastModified headers are based off of a searcher open time but the ETags don't use this and will cause cached results to occur when I do things like restart the server (because I want to pick up changes in my new solrconfig file that affect query responses).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12596468",
            "date": "2008-05-13T17:37:35+0000",
            "content": "FWIW: this is precisely why the etagSeed option is supported – so Solr Admin's can make the etag change even though the index hasn't changed (ie: because of some other config changes that affect the response).\n\nbut i'm open to suggestions for new options ... the key thing being that we want both last-Mod and Etag to be generated by default, even if there is no <httpCaching> directive if hte solrconfig.xml "
        },
        {
            "author": "David Smiley",
            "id": "comment-12596523",
            "date": "2008-05-13T20:23:32+0000",
            "content": "I did notice that I could change the eTag value but why bother force me to remember to change it?\n\nCan you tell me why both eTags & las-mod need to be supported simultaneously?  It seems to me that last-mod alone is just fine.  I like that the last-mod can be based off of the indexreader open time; that seems ideal to me. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13591801",
            "date": "2013-03-03T17:51:29+0000",
            "content": "SPRING_CLEANING_2013 We can reopen if it's still an issue. "
        }
    ]
}