{
    "id": "SOLR-10422",
    "title": "Consolidate font directories",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "There are 2 font directories, one used for the HTML and another for the PDF. The directory for the fonts is a parameter, so I think we could consolidate and use only one directory for all fonts.\n\n(There were 3 directories, but I removed one with https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=6472b196372b387a43920781d3b2aad1d1d47544)\n\nIt's not quite related, but maybe a little...the HTML uses Proxima Nova, which may not be open licensed, while the PDF is using Noto Sans, which is Apache licensed. We could further consolidate by changing the HTML to use the same base fonts as the PDF.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-04-05T20:08:06+0000",
            "content": "I've committed to the jira/solr-10290 branch these changes:\n\n\n\tconsolidated HTML and PDF generation to use a single fonts directory, at solr-ref-guide/src/fonts\n\t\n\t\tchanged solr-ref-guide/pdf/themes/refguide-theme.yml to point to the new directory\n\t\n\t\n\tchanged the monospace text to use Inconsolata (Open Font licensed) in both HTML and PDF\n\t\n\t\tThis also removes the external Google font dependency to pull in Droid Sans Mono for the HTML version\n\t\n\t\n\tchanged HTML and PDF to use Noto Sans for all body text and headers\n\t\n\t\tpreviously headers in PDF used Raleway\n\t\n\t\n\tremoved now unused font files for Raleway, Proxima Nova and Ubuntu Sans Mono\n\tmoved fontawesome and glyphicon font files to new sub-directories under solr-ref-guide/src/fonts\n\t\n\t\tpreviously these were in that directory but are now in sub-dirs\n\t\n\t\n\n ",
            "author": "Cassandra Targett",
            "id": "comment-15957558"
        }
    ]
}