{
    "id": "SOLR-5030",
    "title": "determine & document specific steps to \"publish\" ref guide with each release",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "need to document the \"release process\" for the documentation...\n\n\n\thow is the PDF generated (SOLR-4886\n\twhen should things happen (ie: wait until code release vote is final for last minute doc fixes?)\n\tcall a vote on the PDF\n\twhere should PDF live once vote is done?\n\twhere to link to released PDF(s) from site, moinmoin, confluence nav\n\twhat content needs changed after being published (ie: 4.3 -> 4.4)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13706568",
            "date": "2013-07-12T02:05:16+0000",
            "content": "I've drafted an initial version of this documenting as best i can forsee how this should work...\n\nhttps://cwiki.apache.org/confluence/display/solr/Internal+-+How+To+Publish+This+Documentation\n\n..some of the details may change once we actually go through the process for 4.4, but i'd appreciate it if folks could look it over in advance and speak up early if you see anything that concerns you.\n\na few things i'd like to draw attention to...\n\n1) this assumes we'll want to keep the ref-guide(s) in a new dist dir: dist/lucene/solr/ref-guide, ala...\n\n\n\thttps://www.apache.org/dyn/closer.cgi/lucene/solr/ref-guide/apache-solr-ref-guide.X.X.pdf\n\thttps://archive.apache.org/dist/lucene/solr/ref-guide/apache-solr-ref-guide.X.X.pdf\n\n\n\n...this seems like it will be the best approach since we won't be doing \"bug fix\" releases (ie: 4.4.1) for the ref guide, so it does't make much sense to put them in the existing dist/lucene/solr/X.Y.0 directories – i don't want someone seeing a download link for dist/lucene/solr/4.4.0/apache-solr-ref-guide.4.4.pdf and thinking it doesn't apply to them since they are using 4.4.3\n\n2) I'm making some suppositions about where we'll want to start linking to the \"official\" versions of this guide once it is in fact official, but none of those links to be updated on release actually exist yet (because there is no current version) ... if you can think of other places that we should update with link, please comment.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13715664",
            "date": "2013-07-22T21:08:19+0000",
            "content": "I'm calling this done – the initial version is live, but it's a living doc that will evolve with each release. "
        }
    ]
}