{
    "id": "SOLR-9349",
    "title": "Schema API should never delete fields used elsewhere in the schema",
    "details": {
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "The Schema API should refuse to delete a field if it can detect that the deletion would cause the schema to fail to load.\n\nThis includes the field assigned to uniqueKey, fields used as copyField sources, and fields used as copyField destinations.  There may be other detectable problems that haven't been listed here.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-07-27T18:44:31+0000",
            "author": "Shawn Heisey",
            "content": "There are some other problem situations that would be very difficult to detect – such as deleting a field that is used for \"df\" or \"qf\" in a request handler definition.  That particular problem doesn't prevent a core from starting, but it does break queries. ",
            "id": "comment-15396135"
        },
        {
            "date": "2016-07-27T18:59:09+0000",
            "author": "Shawn Heisey",
            "content": "Manually editing the schema will still allow the user to shoot themselves in the foot.  We might need better error messages for those problems, but that's an entirely different issue. ",
            "id": "comment-15396159"
        },
        {
            "date": "2016-07-27T19:06:38+0000",
            "author": "Steve Rowe",
            "content": "Shawn Heisey, do you have evidence that this is a current problem?  AFAIK the schema API already implements what you think it should implement. ",
            "id": "comment-15396173"
        },
        {
            "date": "2016-07-27T19:14:28+0000",
            "author": "Steve Rowe",
            "content": "So looking at ManagedIndexSchema.deleteFields() I see that copyField source and dest are covered, but uniqueKey is not checked.  There's a chicken and egg problem here though, in that (un)setting the uniqueKey is not yet covered by the Schema API - see SOLR-7242. ",
            "id": "comment-15396191"
        },
        {
            "date": "2016-07-30T03:58:28+0000",
            "author": "Shawn Heisey",
            "content": "This came from a user on the mailing list who had deleted the \"id\" field using the Schema API, then found that none of the SolrCloud collections would work, which meant that the problem couldn't be solved without manually editing the schema and re-uploading to Zookeeper. ",
            "id": "comment-15400431"
        }
    ]
}