{
    "id": "SOLR-3223",
    "title": "excludes the lower bound in inclusive range queries with characters",
    "details": {
        "affect_versions": "3.5,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "while using a range query to retrieve all the record over a inclusive range with characters , eg\nname : [a TO e]\nthe returned result set excludes the lower bound in range query, like in this case it does not include the results with 'e' .\nPlease suggest any solution for this .",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13226102",
            "date": "2012-03-09T14:40:44+0000",
            "content": "First, usage issues like this are more appropriate to the user's list, see: http://lucene.apache.org/solr/discussion.html for instructions on how to subscribe. I'll close this.\n\nBut to your question (and please ask further ones on the user's list) I suspect that, if your example is exactly what you're submitting, that stopwords are removing the 'a' from your index, you need to use a field that does not have stopwords. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13226104",
            "date": "2012-03-09T14:41:06+0000",
            "content": "Actually a user's list question "
        },
        {
            "author": "abhimanyu",
            "id": "comment-13226776",
            "date": "2012-03-10T06:17:48+0000",
            "content": "thanks for your quick response , but i dont think the problem is related to stopwords, and i was referencing to the letter 'e' in the example . you can take any example or any permutation of range with characters, say it be [c TO k] or [m TO y] . In all the cases the parser excludes the last letter of the given range while outputting the result , i.e. . in these cases they would be 'k' and 'y' respectively. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13226876",
            "date": "2012-03-10T15:20:26+0000",
            "content": "abhimanyu, this does not appear to be a bug, but rather a question of how to use Solr.  \n\nPlease ask your question again on the solr users' mailing list: http://lucene.apache.org/solr/discussion.html.   "
        }
    ]
}