{
    "id": "SOLR-4991",
    "title": "Register QParserPlugin's as SolrInfoMBean's, allowing them to be visible externally like other plugins",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "query parsers"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "QParserPlugins currently cannot be seen externally as official plugins*.  Let's register them as SolrInfoMBeans so they can be seen remotely.\n\n\n\tYes, solrconfig.xml itself could be retrieved and parsed, but many other similar plugins are available as MBeans and so should be query parsers.",
    "attachments": {
        "SOLR-4991.patch": "https://issues.apache.org/jira/secure/attachment/12590556/SOLR-4991.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-13698469",
            "date": "2013-07-03T01:09:32+0000",
            "content": "Here's a patch that exposes all registered qparser plugins, including default built-in standard ones, as SolrInfoMBeans. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13699020",
            "date": "2013-07-03T14:29:37+0000",
            "content": "Here's an updated patch that adds numRequests to QParserPlugin to be returned in the mbean stats (this is congruent to the way highlighting components work, so I figured why not qparsers too), and adds incrementing numRequests in every current QParserPlugin.\n\nAlso added an icon for the plugin UI. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13699033",
            "date": "2013-07-03T14:41:23+0000",
            "content": "Any objections?  With or without the numRequests addition?   This all should be backwards compatible, but if anyone sees a problem let me know (custom query parsers will have numRequests=0 until they upgrade Solr and add numRequests++ in their createParser() method). "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13699120",
            "date": "2013-07-03T16:05:59+0000",
            "content": "+1 for the issue and the patch without numRequests. -0 for the patch with numRequests.\n\nJust wondering why would a query parser (or a highlighter for that matter) need numRequests? Correctness cannot be guaranteed for custom impls because they might forget to increment it. It works for handlers because RequestHandlerBase increments the counter. But if we decide to go this way, we should change it to be an AtomicLong. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13699228",
            "date": "2013-07-03T17:38:48+0000",
            "content": "QParserPlugins currently cannot be seen externally as official plugins\n\nWhy do we need to see these?  Any builtin plugins we should be able to just rely on them being there and this just adds more noise and startup costs.  Perhaps instead we need a way (if we don't have one already) for anyone (i.e. any kind of plugin) to add externally visible statistics? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13699565",
            "date": "2013-07-03T23:03:07+0000",
            "content": "Why do we need to see these?\n\nFor apps to be able to see what query parsers are available.  \n\nAny builtin plugins we should be able to just rely on them being there and this just adds more noise and startup costs. Perhaps instead we need a way (if we don't have one already) for anyone (i.e. any kind of plugin) to add externally visible statistics?\n\nIt's not really about the statistics for my initial use case - it's about an app pointed at a Solr and being able to discern what query parsers are available.\n\nThe main point here, forgetting about numRequests, is simply to have a way for plugins to be discoverable from the outside.  This fits in the longer term goal to RESTify all of these things, at least in my opinion, but this is an easy and useful capability in the mean time.\n\nJust wondering why would a query parser (or a highlighter for that matter) need numRequests? \n\nGood question, I wondered that myself when I saw HighlightingPluginBase do this.  But I can imagine it'd be useful to see which query parser(s) are being used.  One might even want to monitor for inadvertent, or even suspicious, uses of other query parsers.   "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13699613",
            "date": "2013-07-03T23:54:04+0000",
            "content": "Correctness cannot be guaranteed for custom impls because they might forget to increment it.\n\nSame with any subclasses of HighlightingPluginBase too.\n\nIt works for handlers because RequestHandlerBase increments the counter. But if we decide to go this way, we should change it to be an AtomicLong.\n\nI just followed HighlightingPluginBase using a long.  \n\nBut perhaps best to remove numRequests altogether here and just get the query parsers showing up as plugins minus any stats. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13704604",
            "date": "2013-07-10T14:19:21+0000",
            "content": "Here's a trunk-based patch without the numRequests.  I'll commit to trunk and 4x later today.\n\nIs this fair to commit to 4.4 branch as well? It'd be good to get this in there if possible. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13704610",
            "date": "2013-07-10T14:23:42+0000",
            "content": "Is this fair to commit to 4.4 branch as well? It'd be good to get this in there if possible.\n\n+1 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13704785",
            "date": "2013-07-10T17:27:09+0000",
            "content": "Commit 1501863 from Erik Hatcher\n[ https://svn.apache.org/r1501863 ]\n\nSOLR-4991: Register QParserPlugins as SolrInfoMBeans "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13704800",
            "date": "2013-07-10T17:38:08+0000",
            "content": "Commit 1501871 from Erik Hatcher\n[ https://svn.apache.org/r1501871 ]\n\nSOLR-4991: Register QParserPlugins as SolrInfoMBeans (merged from r1501863) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13704815",
            "date": "2013-07-10T17:46:09+0000",
            "content": "Commit 1501874 from Erik Hatcher\n[ https://svn.apache.org/r1501874 ]\n\nSOLR-4991: Register QParserPlugins as SolrInfoMBeans (merged from r1501863) "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716793",
            "date": "2013-07-23T18:38:36+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}