{
    "id": "SOLR-6401",
    "title": "Update CSS for Solr Ref Guide to format code examples automatically",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "In the online version of the Solr Ref Guide (https://cwiki.apache.org/confluence/solr), we have a number of code example boxes. We manually change the default styling to have a solid black border. It used to be relatively easy to set those properties each time you made a code box, but with the Confluence upgrades it's not as simple anymore, it requires a special level of access, and the convention isn't known by everyone so we're getting a melange of styles.\n\nWhat we'd like to do instead is set the formatting via the CSS. It's a simple change, but editing the CSS for the Solr space is limited to system admins of the Confluence instance only.\n\n1. Go to https://cwiki.apache.org/confluence/spaces/viewstylesheet.action?key=solr and click edit (at the bottom of the page).\n\n2. Add the following to the bottom of the existing CSS:\n\n\n#content .code {\n   border-color: black;\n   border-width: 1px;\n   border-style: solid;\n}\n\n\n\n3. Save and you're done.\n\nUwe Schindler, I've assigned to you because AFAIK you are the only one in Lucene/Solr with system admin-level access to CWIKI. If someone else has that access, please reassign as appropriate.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Cassandra Targett",
            "id": "comment-15589553",
            "date": "2016-10-19T19:02:40+0000",
            "content": "We've lived with this this long, and it hopefully we can make these changes with patches soon enough. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-15589918",
            "date": "2016-10-19T21:28:23+0000",
            "content": "I did not know about this issue and fixed it a minute ago! "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15589965",
            "date": "2016-10-19T21:45:17+0000",
            "content": "Sorry, I didn't mean to make you feel bad! I completely forgot I'd ever filed it. "
        }
    ]
}