{
    "id": "SOLR-4697",
    "title": "add 'zkHost=\"${zkHost}\"' to example solr.xml and deprecate hardcoded check for zkHost system property",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Similar to the work done in SOLR-4622 related to hostContext and hostPort, we should do a better job of advertising the zkHost setting in solr.xml and deprecate the explicit check for a zkHost property in SolrCore.initZooKeeper – so that it still works in 4.x with a warning, but in 5.0 zkHost must be specified in solr.xml, even if it's just to refer to a sys property with the same name",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13627344",
            "date": "2013-04-10T01:18:01+0000",
            "content": "I don't think we should do this - see my comment in SOLR-4622. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13627346",
            "date": "2013-04-10T01:18:07+0000",
            "content": "When i initially proposed this in SOLR-4622 miller commented...\n\nI think zkHost will likely fall out of solr.xml so that we can put those in zk. I think we really want to get system settings in the cloud just like core settings. It's fairly annoying now that to make many changes you need to update solr.xml on every node.\n\nwhile i can understand the motivation here, i still can't imagine a day when there is nothing like a slimmed down solr.xml that sits outside of zk...\n\n1) regardless of how much of what is currently in solr.xml that we can push into zk, the basic information of \"what zookeeper machines should i talk to\" still needs to be something we tell the machine so it can go talk to zk and get all it's details\n\n2) even if we generally encourage people to use system properties to specify things like zkHost (and hostContext, and hostPort) those sysproperties should generally just be used as substitutions into solr.xml (or whatever replaces it) for all the same reasons already mentioned in SOLR-4622: having them in the configs makes them self documenting for users who aren't familiar with the java code to to understand where they are coming from.\n\n3) we should not completely eliminate the ability for multiple solr instances running in a single servlet container to be a part of distinct solr clouds – which they would need to be if the only way to specific zkHost was a system property, since that would prevent them from using a different zk chroot "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13627354",
            "date": "2013-04-10T01:26:43+0000",
            "content": "regardless of how much of what is currently in solr.xml that we can push into zk, the basic information of \"what zookeeper machines should i talk to\" still needs to be something we tell the machine so it can go talk to zk and get all it's details\n\nThe fastest and most consistent route to getting solr.xml in zookeeper is to put it there - just like solrconfig.xml. Diverging too much too fast from non solrcloud mode needs to be considered carefully. It's not clear how the two modes will shake out. For now, it makes sense for core and system settings to be consistent.\n\n2)\n\nzkhost can't go in solr.xml - if you want to make a new config file for it to alleviate sys prop short falls, that's fine - there is likely another param or two that can go there - but it shouldn't go in solr.xml - almost all of that can go straight to zk right now and that will just bog it down - it's the wrong direction.\n\nwe should not completely eliminate the ability for multiple solr instances running in a single servlet container\n\nI have no interest in supporting multiple instances running in a single container, so I won't add anything of value here. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13627929",
            "date": "2013-04-10T16:00:36+0000",
            "content": "So basically, my thinking is that zkhost needs to be like solr.home. It's a similar level prop. It could either be set the same way, or perhaps there is some other mechanism.\n\nOff the top of my head, if you have a solr.properties file in solr.home, they are used in addition to cmd line sys props.  "
        }
    ]
}