{
    "id": "SOLR-10329",
    "title": "Rebuild Solr examples",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "examples"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Apache Solr ships with a number of examples. They evolved from a kitchen sync example and are rather large. When new Solr features are added, they are often shoehorned into the most appropriate example and sometimes are not represented at all. \n\nOften, for new users, it is hard to tell what part of example is relevant, what part is default and what part is demonstrating something completely different.\n\nIt would take significant (and very appreciated) effort to review all the examples and rebuild them to provide clean way to showcase best practices around base and most recent features.\n\nSpecific issues are around kitchen sync vs. minimal examples, better approach to \"schemaless\" mode and creating examples and datasets that allow to create both \"hello world\" and more-advanced tutorials.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-26T05:13:01+0000",
            "content": "Hello World!\n\nI am a second year software engineer student from Tunisia.\nI am excited and motivated to work on this project.\nI think this will be a great opportunity for me to learn Solr and improve the set of examples that this great project provides.\n\nTo be honest, I have no prior experience with Solr, but I have a little bit of knowledge about Lucene.\n\nWhat should be me next step? and what should I do to get involved in this project?\n\nWith love. ",
            "author": "Oussema Hidri",
            "id": "comment-15942142"
        },
        {
            "date": "2017-03-27T01:33:38+0000",
            "content": "Are you participating in the Google Summer of Code? You need to be registered and I believe the next step is to start doing a full proposal. Also, joining a Solr Users mailing list is a good idea. \n\nTo get familiar with Solr, I would recommend you to start by running and exploring all its examples. There are more of them than one would think. A good overview of first steps is available on my blog: http://blog.outerthoughts.com/2015/11/learning-solr-comprehensively/ ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15942516"
        },
        {
            "date": "2017-03-28T18:25:34+0000",
            "content": "Hey Alexandre,\n\nThank you for your response.\nI appreciated a lot your blog and I have played around with the provided examples.\nI will really appreciate your help and your opinion.\nI hope I am on the right track.\n\nWith love. ",
            "author": "Oussema Hidri",
            "id": "comment-15945670"
        },
        {
            "date": "2017-03-28T18:41:52+0000",
            "content": "You are on a right track, but the proposal does not have enough depth. I would recommend as a next step to look at the open JIRA issues and search for keyword example. And perhaps another search for component examples. This should give you a list of various issues seen with the examples. Without that, you will not know what goals you are satisfying in redoing the examples.\n\nYou can paste the list of all JIRAs dealing with examples and your categorization of issues in your proposal to show your understand the landscape. Also, I did not see this proposal on the GSOC site earlier today. Is it there? ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15945708"
        },
        {
            "date": "2017-03-28T18:47:47+0000",
            "content": "About the proposal; I have just submitted few minutes ago.\n\nOkey I will do that, and get back to you.\n\nThank you for you help =D\n\n ",
            "author": "Oussema Hidri",
            "id": "comment-15945720"
        },
        {
            "date": "2017-03-30T02:41:47+0000",
            "content": "Decisions to make if/when making examples uniform:\n\n\n\tShould multivalued fields be plural? Currently we have cat and features, both multivalued\n\tCamelCase or under_score? Currently we have inStock and content_type, as well as _src_\n\tDo we order definitions in the schema file as uniqueKey, fields, types? Or types, fields, uniqueKey? Or as whatever rewriting schema does just with more spaces and comments?\n\tWhat are the space rules for XML fie offsets, line continuations, comments, multi-line comments?\n\tHow much of current over-commented solrconfig.xml to actually keep, now much to keep by reference to the Reference Guide and how much not bother mentioning at all?\n\tWhere should examples be stored? Should the configset directory be renamed as we are not treating examples in them as configsets (not shared)\n\tShould we allow downloading example config directories from the web as part of bin/solr command?\n\n ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15948301"
        },
        {
            "date": "2017-03-30T02:43:34+0000",
            "content": "Hi Alexandre,\n\nI have modified the proposal once again, and as you told me I have included a list of JIRAs dealing with examples.\nI have also added more remarks and thoughts as I wondered more through the examples, I hope it has enough depth =).\nIf you please and add comments on the proposal, it will help me improve it and make me understand more the things that need to be done.\nAlso, the timeline section is not well developed. If you have enough time it will help to throw few suggestions on that section.\n\nWith love. ",
            "author": "Oussema Hidri",
            "id": "comment-15948302"
        },
        {
            "date": "2017-04-02T03:40:25+0000",
            "content": "hello sir, \nMy name is Avtar Singh, I have previously developed  a fact based question answering system based on Apache Solr and Apache Lucene. I would love to work on the project, I believe that I can do the project very efficiently.\nThank you ",
            "author": "Avtar Singh",
            "id": "comment-15952513"
        },
        {
            "date": "2017-06-28T05:20:10+0000",
            "content": "Hi Alexandre,\n\nI am looking at the new _default configset and see that we can make improvements to make it shorter and copy edit stuff\n\nFor example, this comment is outdated\n\n\nThis is the Solr schema file. This file should be named \"schema.xml\" and\n should be in the conf directory under the solr home\n (i.e. ./solr/conf/schema.xml by default) \n\n\n\nAnother example, do we need a dynamic field for currency ?\n\n\n<dynamicField name=\"*_c\"   type=\"currency\" indexed=\"true\"  stored=\"true\"/>\n\n\n\nShould we create a specific Jira for this as this Jira title mentions all examples ? Or should we limit the scope of this Jira?\n ",
            "author": "Varun Thacker",
            "id": "comment-16065940"
        },
        {
            "date": "2017-06-28T10:30:56+0000",
            "content": "This Jira was supposed to support a sort-of rethinking of the examples from the ground up. Unfortunately, due to work and personal commitments, I do not currently have the time to do it. But I still think it should stay as a placeholder for this higher-level effort and/or for somebody else to add their overall thoughts.\n\nIn a meanwhile, for the specific items, I think we should have individual Jiras.  ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-16066303"
        }
    ]
}