{
    "id": "SOLR-1505",
    "title": "Phrase query used when the value is not in quotas",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Example:\nIn query specified the next criteria:  title:water,ground (note: the value is not in quotas). For \"title\" field solr.PatternTokenizerFactory used with pattern=\", *\". After analysis Solr applies the query as phrase query: title:\"water ground\" which requires the presents of both words, etc..\n\nSo, basically  title:water,ground acts in the same way as title:\"water,ground\". There is no way how to avoid phrase query.\n\nWhen value is not in quotas then phrase query shouldn't be used.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12765268",
            "date": "2009-10-13T21:57:07+0000",
            "content": "There's no bug here ... this is the expected behavior of the standard QueryParser – when a \"chunk\" of input passed to an Analyzer produces multiple tokens with non-zero position offsets a phrase query is produced ... this is what makes NGrams, WordDelimiterFilter, and a host of other features work.\n\nIf differnet behavior is desired, then an alternate QueryParser should be used (alternately: an Analyzer where all tokens produced have the same position could be used, since QueryParser interprets those as alternate tokens and produces a BooleeanQuery ... assuming that's what you want)\n\n—\n\nIn the future: if you see behavior that you don't understand, please send am email to solr-user describing your goal, what you've tried so far, and the results you've gotten before assuming it's a bug and opening a Jira issue. "
        },
        {
            "author": "Alex Baranau",
            "id": "comment-12765392",
            "date": "2009-10-14T04:46:42+0000",
            "content": "In the future: if you see behavior that you don't understand, please send am email to solr-user describing your goal, what you've tried so far, and the results you've gotten before assuming it's a bug and opening a Jira issue.\n\nSure. Sorry for that: it was seemed to me that Yonik with his answer to my post in solr-user agreed that there is a bug...\n\nAlex. "
        }
    ]
}