{
    "id": "SOLR-3007",
    "title": "Indexing Failed.Rolled back Changes",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Hi,\n\nI am new to this SOLR.I was digging data import request handler for past few days and now i am doing some poc after i download the solr server. I do have a table called files and i want to perform the Full import as part of POC. I changed the data-config.xml and registered the data-config.xml at solr-config.xml at conf/. I hit the http request for full-import. Even though my query returns 3 rows outside the solr but it is not returning any rows inside the import.when i see the /data-import status i do find the error message.Indexing Failed.Changes rolled back. after i did some digging regarding the issue.i came to know that i missed dataimport.properties file at conf/. Now pls help me here\n\n1) Can anybody send me the sample file how the dataimport.properties file should be?\n2) Even though i am not performing delta import do i need dataimport.properties\n3) why i am not able to see any rows? what is the attribute i can check if the dataimport is successful? and in which file i will find this information.i think solr/data-import http request will help me?\n\nCan any body help me? i know this should be a basic problem, but i am beginner.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13180525",
            "date": "2012-01-05T17:00:53+0000",
            "content": "Raj:\n\nThe JIRAs are for code problems, fixing bugs, etc. It's more appropriate to raise questions like this on the solr users list, click the \"subscribe to list\" link in the \"users\" section here:\nhttp://lucene.apache.org/solr/mailing_lists.html\n\n "
        }
    ]
}