{
    "id": "SOLR-3304",
    "title": "Add Solr support for the new Lucene spatial module",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Critical",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Get the Solr spatial module integrated with the lucene spatial module.",
    "attachments": {
        "SOLR-3304-strategy-getter-fixed.patch": "https://issues.apache.org/jira/secure/attachment/12542140/SOLR-3304-strategy-getter-fixed.patch",
        "SOLR-3304_Solr_fields_for_Lucene_spatial_module (fieldName in Strategy).patch": "https://issues.apache.org/jira/secure/attachment/12535412/SOLR-3304_Solr_fields_for_Lucene_spatial_module%20%28fieldName%20in%20Strategy%29.patch",
        "SOLR-3304_Solr_fields_for_Lucene_spatial_module (fieldName in Strategy) - indexableFields.patch": "https://issues.apache.org/jira/secure/attachment/12542047/SOLR-3304_Solr_fields_for_Lucene_spatial_module%20%28fieldName%20in%20Strategy%29%20-%20indexableFields.patch",
        "SOLR-3304_Solr_fields_for_Lucene_spatial_module.patch": "https://issues.apache.org/jira/secure/attachment/12528098/SOLR-3304_Solr_fields_for_Lucene_spatial_module.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13244490",
            "date": "2012-04-02T19:28:44+0000",
            "content": "We're going to get to it; don't worry Bill. "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13244937",
            "date": "2012-04-03T03:34:48+0000",
            "content": "Let me know if I can help. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13278931",
            "date": "2012-05-18T16:31:53+0000",
            "content": "Attached is the first draft.\n\nThe Solr support for the new Lucene spatial module is a set of field types which are effectively adapters into the real logic in Lucene.  Even all the configuration option initialization from the fieldType attributes are done in Lucene.  A map of these is passed with a utility wrapper to detect which attributes were seen so that they can be removed afterwards. And so if you typo a parameter then you'll get an error like you would for any other field type.\n\nThe Lucene spatial module supports sorting indirectly by having a spatial Query's score be the distance.  Of course you don't always need the score/distance and so there is a local-param attribute needScore which can be set to false, such as in a filter query (see SOLR-2883).\n\nI'll say the tests here are so-so; I welcome input on how they can be structured to be more effective.  Since the real logic is all in the Lucene spatial module, ideally the tests on the Solr side would be fairly minimal in this regard... just instantiate the various field types exercising a few features and a few options.\n\nSome TODOs:\n\n\tDocument how to use it in the wiki\n\tAt least some basic tests for the SpatialTwoDoublesFieldType and SpatialTermQueryPrefixTreeFieldtype.\n\n\n\nAt least for now, I don't envision the capabilities here replacing the Solr spatial introduced in 3x; it is a new alternative. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13278935",
            "date": "2012-05-18T16:33:35+0000",
            "content": "Another TODO:\n\n\tin solr's example schema.xml add SpatialRecursivePrefixTreeFieldType and for that matter remove the old geohash one.\n\n "
        },
        {
            "author": "Itamar Syn-Hershko",
            "id": "comment-13279609",
            "date": "2012-05-19T20:01:14+0000",
            "content": "In continuation to the discussion on the spatial4j list, +1 for having all the tests with actual spatial logic reside in the Lucene spatial module, and have the Solr tests rely on that "
        },
        {
            "author": "Cody Young",
            "id": "comment-13397618",
            "date": "2012-06-20T16:34:46+0000",
            "content": "Haven't seen any movement on this in a while. What needs to be finished for this to be committed? "
        },
        {
            "author": "David Smiley",
            "id": "comment-13397642",
            "date": "2012-06-20T17:16:30+0000",
            "content": "I've been slowly getting back into this.  I developed some basic documentation but I haven't put it on the wiki yet.  I think I'll start by simply adding it as new page.  I welcome input on what to name the page  since it works significantly different than the existing Solr spatial (what I call Solr 3 spatial).  I moved a particular extensive geohash based search test that is in this patch to LUCENE-4157 last night.  I think what remains as far as this code is concerned is mostly about testing various field types with their configuration, but not worrying about in-depth testing of the algorithms which instead belongs in Lucene spatial module's tests. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13403327",
            "date": "2012-06-28T18:19:25+0000",
            "content": "Some initial documentation: http://wiki.apache.org/solr/SolrAdaptersForLuceneSpatial4 "
        },
        {
            "author": "David Smiley",
            "id": "comment-13405299",
            "date": "2012-07-02T20:09:46+0000",
            "content": "Here is an updated patch.\n\nEven though Lucene spatial now has most/all of the tests that were in this patch, I feel they were short enough to just keep them here as well, in their Solr form, to demonstrate how to do queries at the Solr level.\n\nChanges:\n\n\tAccount for the Spatial4j query package moving to Lucene Spatial\n\tAdded SpatialRecursivePrefixTreeFieldType into the example schema.xml registered with name \"location_2d_trie\" – comments on name?\n\tRemoved the old GeoHashField from the example schema.xml\n\tOne Test file: TestSolr4Spatial that is parameterized for 3 geo fields with varying configuration.\n\tAdded test for lat,lon order in results (which is a known failure right now).\n\n\n\nLeft to do:\n\n\tEnsure output field is lat,lon order for a geospatial context.  This should be addressed in Lucene Spatial or Spatial4j but probably not here, I feel.  Comments?\n\tTest 2d (non-geo) spatial.  Ugh.  I'd probably do another test file with similar tests, perhaps fewer.\n\tFix \"distErrPct\" taking a fraction and not a percent. This problem is in Lucene spatial.\n\n\n\nConcerns:\n\n\tThe TwoDoubles type is not tested here. If I were to add it, it would surely break as it can't handle circles and probably has other problems.  Thoughts, Ryan? I know you wrote that one.\n\tConsider moving the factory stuff out of Lucene spatial into the Solr adapters?  I put them in Lucene spatial because I was thinking of the bigger picture of clients other than Solr that might use the same name-value initialization parameters.  Chris doesn't seem to be a fan because the least-common-denominator way I represented this is a Map<String,String> which is admittedly dirtly.\n\n "
        },
        {
            "author": "David Smiley",
            "id": "comment-13408268",
            "date": "2012-07-06T20:03:21+0000",
            "content": "Attached is a new patch which assumes LUCENE-4188 (Strategy doesn't store shapes, and puts fieldName in Strategy) and LUCENE-4192 (no single createField()). "
        },
        {
            "author": "Andy Fowler",
            "id": "comment-13439918",
            "date": "2012-08-22T22:43:54+0000",
            "content": "I've been playing around with this against the current 4x branch. I've attached the original patch with one small tweak to AbstractSpatialFieldType.createFields, fixing a bug caught at compile-time. \n\nI'm pretty far out of my league trying to work on this, but I'm getting an NPE at AbstractSpatialFieldType.getQueryFromSpatialArgs(AbstractSpatialFieldType.java:178). It appears that createFields is never being called, so the fieldStrategyMap is empty when a query arrives. Not sure where in the lifecycle createFields is supposed to happen.\n\nJust throwing my progress out there for others looking at this. "
        },
        {
            "author": "Andy Fowler",
            "id": "comment-13440369",
            "date": "2012-08-23T15:19:07+0000",
            "content": "Attached is one more update to David Smiley's patch which resolves the NPE I was getting when trying to query on a geo field, before a document had been added (i.e. after restarting solr with an already-created index).\n\nInstead of assuming that the spacialStrategy had been instantiated during CreateFields, the same logic is used at query-time.\n\nIt applies cleanly to branch_4x and all tests pass for me. Thanks for your work on this, David! "
        },
        {
            "author": "David Smiley",
            "id": "comment-13452775",
            "date": "2012-09-11T06:47:52+0000",
            "content": "Thanks for finding and fixing that bug Andy. Your fix wasn't quite right though since the getStrategy() method you refactored synchronized on a parameter (pointless) instead of the field. I fixed this.\n\nThis new patch makes that and various other changes:\n\n\tsynchronized with the latest source tree (e.g. Spatial4j 0.3)\n\t\n\t\tThis means distances are now degrees based (0-180 for circle radius) not kilometers\n\t\n\t\n\tremoved ignoreIncompatibleGeometry option (see LUCENE-4173)\n\tUse the input string as the stored value that is returned.  So if you give \"lat,lon\" then that's what you get back, in whatever number of decimal places you chose.\n\tadded prefixGridScanLevel performance tuning option to SpatialRecursivePrefixTreeFieldType (simply exposed it from the strategy)\n\tkeep distErrPct as a fraction (no change)\n\n\n\nIt would be nice to have a kilometer unit option but that isn't easily done until Spatial4j's shape reader gets to be more flexible.  That can wait.\n\nThat \"needScore\" local-param hack (see SOLR-2883) is unfortunate, as Solr can't get a Filter from a field type.  I'm tempted to change the default to 'false' as leaving it at true' triggers large RAM requirements and slow-downs for SpatialRecursivePrefixTreeFieldType.  This could be an opportunity to specify what the score should be, come to think of it.  Instead of needScore=\"false\", maybe score=\"none\" (default) or score=\"distance\" or score=\"recipDistance\" or something like that.\n\nThe TwoDoubles strategy needs more attention and tests in Lucene spatial, but I don't want that to hold up this patch.  Shall I remove the adapter or let it get committed but don't advertise it until it's more worthy? "
        },
        {
            "author": "Andy Fowler",
            "id": "comment-13455401",
            "date": "2012-09-13T22:56:44+0000",
            "content": "Thanks David! I'm just getting back to looking at this. We previously used your SOLR-2155 patch, and this one is a big deal to us. It looks like you're depending on Lucene 5 StorableField in the fieldtype (from LUCENE-3312). I can't tell from that ticket if those changes are planned to be backported. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13455542",
            "date": "2012-09-14T02:55:09+0000",
            "content": "RE StorableField – small details like that I work out at commit time.  I develop against trunk and then the 4x backport has been trivial. "
        },
        {
            "author": "Robert Purdy",
            "id": "comment-13455997",
            "date": "2012-09-14T18:20:37+0000",
            "content": "Hi there, I was wondering if there was any further documentation on the syntax to use this feature? \n\nI have applied the latest patch and read through the wiki page and I am unsure of how to get the distance back from the point provided in the url. What would be the best shape to use to accomplish finding documents with a lon/lat and a radius? My example url I am using is: http://localhost:8080/solr/test/select?q=*%3A*&wt=xml&fq=\n{!needScore=true}\nlocation:\"Intersects(Circle(54.729696,-98.525391 d=0.0899320))\"&fl=*,score\n\nAlso mentioned in the wiki pages was that there was no documentation on sorting based on distance, anyone have an example of a sold query doing this?\n\nThanks Robert. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13456181",
            "date": "2012-09-14T21:49:22+0000",
            "content": "Here is an updated patch.  It depends on LUCENE-4208 (makeDistanceValueSource) and LUCENE-4389 (TwoDoubles dateline and circle) being applied.\nNotes:\n\n\tTwoDoublesStrategy is a decent strategy now, due to LUCENE-4389 and tests in that issue and this one.\n\tThe 'needScore' local-param is gone, replaced by 'score'.  'score' can be set to 'none' (the default) to use a constant of 1, or 'distance' to use the distance, or 'recipDistance' to use the reciprocal distance.  If you want to sort then use 'distance' (ascending) and if you want to boost relevancy by distance then I recommend 'recipDistance'.\n\n "
        },
        {
            "author": "David Smiley",
            "id": "comment-13456188",
            "date": "2012-09-14T22:06:39+0000",
            "content": "Hi Rob Purdy.  I don't have time to explain this query as I write this but peruse this example query which does just about everything:\n\nhttp://localhost:8983/solr/select?q=*%3A*&wt=xml&fq=\n{!%20v=$sq}\n&sq=store:%22Intersects%28Circle%2854.729696,-98.525391%20d=10%29%29%22&debugQuery=on&sort=query%28$sortsq%29+asc&fl=id,store,score,distdeg:query%28$sortsq%29&sortsq=\n{!%20score=distance%20v=$sq}\n\nI'll update the wiki within the next few days, hopefully. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13456448",
            "date": "2012-09-15T17:15:33+0000",
            "content": "The two issues this depends on are finally closed.  I plan on committing this one tomorrow to allow more time for feedback. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13456754",
            "date": "2012-09-17T04:25:31+0000",
            "content": "I made the return type of the AbstractSpatialFieldType.createField() be covariant and return Field, so as to be the same between both branches.\n\nCommitted to trunk & 4x.   "
        },
        {
            "author": "David Smiley",
            "id": "comment-13456767",
            "date": "2012-09-17T05:13:00+0000",
            "content": "The CHANGES.txt was just added as follows:\n\n* SOLR-3304: Added Solr adapters for Lucene 4's new spatial module.  With\n  SpatialRecursivePrefixTreeFieldType (\"location_rpt\" in example schema), it is\n  possible to index a variable number of points per document (and sort on them),\n  index not just points but any Spatial4j supported shape such as polygons, and\n  to query on these shapes too.  Polygons requires adding JTS to the classpath.\n  (David Smiley)\n\n "
        },
        {
            "author": "Ari Maniatis",
            "id": "comment-13502955",
            "date": "2012-11-22T22:57:34+0000",
            "content": "Early in this thread David Smiley listed a TODO item: \"Document how to use it in the wiki\". We are having considerable difficulty migrating from Solr 3.5 with SOLR-2155 to this new way of doing things. Any pointers to documentation for the new mechanism would be very much appreciated. "
        },
        {
            "author": "Ari Maniatis",
            "id": "comment-13502988",
            "date": "2012-11-23T02:29:09+0000",
            "content": "I know this is not a support forum, but for your reference, here are the issues our developer is struggling to find Solr4 documentation for:\n\n1) filter by the distance between course location field and Intersects(Circle) calculated by passed suburb params always returns empty result if we use solr.SpatialRecursivePrefixTreeFieldType filed type (as described in documentation this query and configuration changes should be used to kick off the plugin).\n2) updated org.apache.solr.schema.GeoHashField field type does not support geodist for multivalued fields and I not found the way how we can adjust this type to the same functionality as we have in SOLR-2155 plugin. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13503249",
            "date": "2012-11-23T17:06:08+0000",
            "content": "Ari; this is documented here:\nhttp://wiki.apache.org/solr/SolrAdaptersForLuceneSpatial4 "
        },
        {
            "author": "Ari Maniatis",
            "id": "comment-13503660",
            "date": "2012-11-26T08:14:29+0000",
            "content": "Thanks David. I've asked my developer to follow up on the mailing list with his detailed questions.\n\nhttp://apache.markmail.org/thread/af5kg26rdbdhkftw "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610826",
            "date": "2013-03-22T16:38:10+0000",
            "content": "[branch_4x commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1386475\n\nSOLR-3304: Added CHANGES.txt entry "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610827",
            "date": "2013-03-22T16:38:14+0000",
            "content": "[branch_4x commit] David Wayne Smiley\nhttp://svn.apache.org/viewvc?view=revision&revision=1386466\n\nSOLR-3304 Solr adapters for the new Lucene 4 spatial module "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13654153",
            "date": "2013-05-10T10:34:13+0000",
            "content": "Closed after release. "
        }
    ]
}