{
    "id": "SOLR-7728",
    "title": "bin/solr script: add port number to GC log filename",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "It'd be nice if the bin/solr script added the node's port number to the GC log file name in the same way it does for the console log.  \nThis helps those of us who run multiple nodes per machine match node <-> log.",
    "attachments": {
        "SOLR-7728.patch": "https://issues.apache.org/jira/secure/attachment/12749148/SOLR-7728.patch",
        "SOLR-7728-Branch5X.patch": "https://issues.apache.org/jira/secure/attachment/12749636/SOLR-7728-Branch5X.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-06-26T21:24:28+0000",
            "author": "Shawn Heisey",
            "content": "The GC log is created by Java itself, which has absolutely no idea what port number you're using. ",
            "id": "comment-14603610"
        },
        {
            "date": "2015-06-26T21:43:40+0000",
            "author": "Crawdaddy",
            "content": "Hey Shawn, isn't the log filename specified via -Xloggc, e.g. line 1241 of bin/solr?\n\n\n\tif verbose gc logging enabled, setup the location of the log file\nif [ \"$GC_LOG_OPTS\" != \"\" ]; then\n  GC_LOG_OPTS=($GC_LOG_OPTS \"-Xloggc:$SOLR_LOGS_DIR/solr_gc.log\")\nelse\n  GC_LOG_OPTS=()\nfi\n\n ",
            "id": "comment-14603643"
        },
        {
            "date": "2015-06-26T21:50:10+0000",
            "author": "Shawn Heisey",
            "content": "Your initial message didn't mention the filename, so I thought you were wanting an annotation inside the logfile.\n\nThe log filename could definitely include the port number. ",
            "id": "comment-14603654"
        },
        {
            "date": "2015-06-26T21:53:24+0000",
            "author": "Crawdaddy",
            "content": "Sorry for any confusion - revised ticket title. ",
            "id": "comment-14603661"
        },
        {
            "date": "2015-06-26T21:54:48+0000",
            "author": "Shawn Heisey",
            "content": "That probably would have been obvious if I had looked at what happens with the console log, but I didn't check that first.\n\nDevils advocate note: Why do you want more than one Solr instance per machine?  One Solr instance can handle any number of indexes, and running multiple instances will waste resources like memory, as well as make it necessary to be aware of the port number instead of simply letting all Solr instances run on the same port.\n\nIf you're running the cloud example, the different logs from each node are already in separate directories. ",
            "id": "comment-14603663"
        },
        {
            "date": "2015-06-26T23:04:50+0000",
            "author": "Crawdaddy",
            "content": "Shawn, we're building a large index that will ultimately span more machines than we currently have.  We've crammed multiple nodes onto fewer machines to start the process, then will move them off as we get more hardware.\nWe started with the intention of having fewer nodes hosting multiple shards, but in our tests the indexing performance against that config was much slower vs. having more nodes hosting single shards. ",
            "id": "comment-14603752"
        },
        {
            "date": "2015-08-06T23:03:52+0000",
            "author": "Michael Sun",
            "content": "Attach patch to add port number in GC log file name.\n\nIn addition, for 5.X branch, we may want to keep GC log file name without port number as default and add a parameter in solr script to add port number in GC log file name. It's to avoid breaking user's existing monitoring tools for running Solr 5.X. ",
            "id": "comment-14660947"
        },
        {
            "date": "2015-08-07T08:17:18+0000",
            "author": "Gregory Chanan",
            "content": "+1 patch looks generally good to me.\n\nIt looks like you generated the patch from solr/bin – can you regenerate it from the root?\n\nFor 5.x branch, making it an option sounds like a good idea.  Want to put up a patch for that, Michael? ",
            "id": "comment-14661485"
        },
        {
            "date": "2015-08-07T15:46:04+0000",
            "author": "Michael Sun",
            "content": "Thanks Gregory Chanan for reviewing. I uploaded a new patch generated from root as you suggested.\n\nFor 5.x branch fix, I can make an option. Should I open a new JIRA for 5.x fix or simply reuse this JIRA? Thanks. ",
            "id": "comment-14662001"
        },
        {
            "date": "2015-08-10T16:54:55+0000",
            "author": "Michael Sun",
            "content": "Attach the patch for 5.x branch. A new command line option -piln is added to bin/solr to add port number into GC log file name. ",
            "id": "comment-14680359"
        },
        {
            "date": "2015-08-10T20:20:05+0000",
            "author": "jmlucjav",
            "content": "Shouldn't the windows version (solr.cmd) be also modified?\n\nAlso, not totally the same issue but it's related, I noticed that in the windows version, when you disable GC logging (commenting out GC_LOG_OPTS) the gc log file is still created, even if it is empty. In the sh version if you disable GC_LOG_OPTS the file is not created. It's a small inconsistency. ",
            "id": "comment-14680702"
        },
        {
            "date": "2015-08-10T20:46:50+0000",
            "author": "Timothy Potter",
            "content": "Why wouldn't you just isolate logs per node using the SOLR_LOGS_DIR option in solr.in.sh? I don't see much benefit from keeping all the logs for multiple solr instances on the same host in the same directory. ",
            "id": "comment-14680737"
        },
        {
            "date": "2016-10-31T11:56:48+0000",
            "author": "Jan Høydahl",
            "content": "I think we should close this as won't fix and recommend that a user starting multiple nodes from the same server directory uses different SOLR_LOGS_DIR variables for each. Else, you'll have the same problem also with solr.log. Note that the variable supports relative dir, so to achieve logging to e.g. solr/server/8983-logs you could issue:\n\nSOLR_LOGS_DIR=8983-logs ; bin/solr -p 8983\nSOLR_LOGS_DIR=8080-logs ; bin/solr -p 8080\n\n\n\nPS: We recently added GC log rotation, so the gc logs will be named solr_gc.log.{0-9}[.current] ",
            "id": "comment-15621960"
        },
        {
            "date": "2017-08-14T13:05:04+0000",
            "author": "Christine Poerschke",
            "content": "SOLR-11233 just created concerning GC_LOG_OPTS customisation and if folks can then fully customize all the gc log options then they could include port numbers in the gc log file name if they wished? ",
            "id": "comment-16125658"
        }
    ]
}