{
    "id": "SOLR-8088",
    "title": "Distributed grouping seems to require docValues in 5.x, didn't in 4.x",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I have a field in my index that is lowercased after the KeywordTokenizer.  I wish to do grouping on this field.  It is a distributed index.\n\nThis works fine in Solr 4.9.1 running on Java 8.\n\nWhen I try the distributed grouping request (with the same schema) on Solr 5.2.1, it fails, with this exception:\n\n\njava.lang.IllegalStateException: unexpected docvalues type SORTED_SET for field 'ip' (expected=SORTED). Use UninvertingReader or index with docvalues.\n\n\n\nIf I make the same request directly to one of the shards on 5.2.1, it works.  If I create a copyField to a field using StrField with docValues, the distributed request works ... but then I lose the lowercasing.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-24T03:39:33+0000",
            "author": "Varun Thacker",
            "content": "HI Shawn,\n\nI think this is the same issue as SOLR-7495 ? ",
            "id": "comment-14905776"
        },
        {
            "date": "2015-09-24T07:05:14+0000",
            "author": "Shawn Heisey",
            "content": "I'm not sure whether it's the same problem.  It's not a numeric field, it's a TextField.  I'm also not doing facets, just grouping. ",
            "id": "comment-14905923"
        },
        {
            "date": "2015-09-24T12:40:37+0000",
            "author": "Yonik Seeley",
            "content": "Yet another problem caused by LUCENE-5666 ",
            "id": "comment-14906293"
        },
        {
            "date": "2015-09-24T20:00:46+0000",
            "author": "Shawn Heisey",
            "content": "Yet another problem caused by LUCENE-5666\n\nThat looks like all kinds of fun.  I saw what you said about that issue on the list thread talking about slow facets in 5.3.  I'm guessing that if you find a solution to the general problem, it will clean up this as well? ",
            "id": "comment-14906906"
        },
        {
            "date": "2015-11-20T17:46:31+0000",
            "author": "Shawn Heisey",
            "content": "Yonik Seeley, I know that fixing the fallout in Solr from LUCENE-5666 probably won't be easy.  Do we have a realistic timeframe for when a fix might happen?  I think I can probably use the \"copyField that has docValues\" workaround, but that might not be a realistic option for some.  There are likely legitimate cases where somebody wants to be able to group on a tokenized field. ",
            "id": "comment-15018406"
        }
    ]
}