{
    "id": "SOLR-1175",
    "title": "disable replication on master side",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In an environment where one master and several slaves are deployed, it usually takes more effort to discover all the slaves and disable replication on slave side (which is available right now), and it would be much easier to disable it on master instance (when, for example, there is a need to rebuild the index, yet search has to continue). The following is the original email describing a scenario when this feature is needed.\n\nHi,\n\nOccasionally, we want to build our indexes from scratch, and during this period we want our search continue to work. Here are the steps that I think will do it\n\n1. on all slaves: disable replication\n2. on master: stop the server\n3. on master: delete all the documents\n4. on master: restart the server\n5. on master: index all documents\n6. on slaves: enable replication\n\nThe only problem is: step 1 and 6. We may schedule any time to rebuild indexes and it is an automated process. It is possible to let the master to disable replication on all slaves, but then we have to discover all the slaves automatically, also exceptions may happen, e.g. a slave may be down at the time and then restarted later on. Anyhow it becomes an unreliable process. So I am thinking of somehow disabling replication on the master side during reindex, i.e. set a state on master so that any request for replication will be ignored. That all the steps described above will be on master side only.\n\nIs that possible?\n\nBy the way, I am talking about solr 1.4. I looked at how 1.3 works, and noticed that in 1.3 there is a way to disable replication on master side: shutdown rsyncd, so I guess it would be nice to have something equivalent in solr 1.4.\n\n\nThanks,\n\nJianhan",
    "attachments": {
        "SOLR-1175.patch": "https://issues.apache.org/jira/secure/attachment/12408658/SOLR-1175.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12711492",
            "date": "2009-05-21T06:42:56+0000",
            "content": "two commands are added 'disableReplication' and 'enableReplication' "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12711495",
            "date": "2009-05-21T06:58:36+0000",
            "content": "committed revision: 776978 "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775748",
            "date": "2009-11-10T15:52:05+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}