{
    "id": "SOLR-9513",
    "title": "Introduce a generic authentication plugin which delegates all functionality to Hadoop authentication framework",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.4",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Currently Solr kerberos authentication plugin delegates the core logic to Hadoop authentication framework. But the configuration parameters required by the Hadoop authentication framework are hardcoded in the plugin code itself. \nhttps://github.com/apache/lucene-solr/blob/5b770b56d012279d334f41e4ef7fe652480fd3cf/solr/core/src/java/org/apache/solr/security/KerberosPlugin.java#L119\n\nThe problem with this approach is that we need to make code changes in Solr to expose new capabilities added in Hadoop authentication framework. e.g. HADOOP-12082\n\nWe should implement a generic Solr authentication plugin which will accept configuration parameters via security.json (in Zookeeper) and delegate them to Hadoop authentication framework. This will allow to utilize new features in Hadoop without code changes in Solr.",
    "attachments": {
        "SOLR-9513-deprecate-GenericHadoopAuthPlugin.patch": "https://issues.apache.org/jira/secure/attachment/12848185/SOLR-9513-deprecate-GenericHadoopAuthPlugin.patch",
        "SOLR-9513_6x.patch": "https://issues.apache.org/jira/secure/attachment/12843940/SOLR-9513_6x.patch",
        "SOLR-9513.patch": "https://issues.apache.org/jira/secure/attachment/12843858/SOLR-9513.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-11-15T01:17:08+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user hgadre opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/114\n\n    SOLR-9513 A generic Solr authentication plugin to integrate with Hadoop\n\n\n\tAdded a generic Solr authentication plugin to integrate with Hadoop\n\tAdded delegation tokens support\n\tAdded proxy users support\n\n\n\n    Currently the unit tests are using kerberos authentication handler in\n    Hadoop. After Solr is updated to use Hadoop 3, these tests will be\n    modified to use multi-auth support in Hadoop.\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/hgadre/lucene-solr SOLR-9513_fix\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/114.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #114\n\n\ncommit 7562e0cecfc758aff4399909ef147114813204f8\nAuthor: Hrishikesh Gadre <hgadre@cloudera.com>\nDate:   2016-11-08T21:18:34Z\n\n    SOLR-9513 A generic Solr authentication plugin to integrate with Hadoop\n\n\n\tAdded a generic Solr authentication plugin to integrate with Hadoop\n\tAdded delegation tokens support\n\tAdded proxy users support\n\n\n\n    Currently the unit tests are using kerberos authentication handler in\n    Hadoop. After Solr is updated to use Hadoop 3, these tests will be\n    modified to use multi-auth support in Hadoop.\n\n ",
            "id": "comment-15665638"
        },
        {
            "date": "2016-11-15T01:17:34+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya Can you please take a look? ",
            "id": "comment-15665641"
        },
        {
            "date": "2016-11-17T17:18:33+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya any updates? ",
            "id": "comment-15674276"
        },
        {
            "date": "2016-11-17T17:29:12+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Apologies, it escaped my attention. I shall be able to review this early next week.  ",
            "id": "comment-15674300"
        },
        {
            "date": "2016-11-17T17:31:18+0000",
            "author": "Hrishikesh Gadre",
            "content": "Great thanks for reviewing this  ",
            "id": "comment-15674306"
        },
        {
            "date": "2016-12-06T13:19:42+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Sorry, it took me a while to review the patch. I think it looks good. Here are a few observations/suggestions:\n\n\n\tIn GenericHadoopAuthPlugin, Class.forName() was used for loading the client builder. However, we've used SolrResourceLoader.newInstance() traditionally for loading resources from the classpath (for reference, see CoreContainer's initializeAuthorizationPlugin() method).\n\tGenericHadoopAuthPlugin implements HttpClientBuilderPlugin, and hence necessarily uses a specified client builder factory to be used for internode communication. This is fine in many cases, however this removes the possibility of using the internal PKIAuthentication for internode communication. Consider a scenario where a cluster needs to be configured to use a hadoop-auth based authentication mechanism for user < - > solr communication, but simple PKI based authentication for solr < - > solr communication.\nI think we should give the users the option to use default authentication for internal communication (PKI authentication) or to use a client builder. I think what can be done is to somehow make the client builder factory optional, and use PKI based authentication where such a parameter is not passed in. This might mean that we have two concrete classes: one that implements HttpClientBuilderPlugin, one that doesn't.\n\tThe Hadoop based tests tend to not work well on Windows. Unless you've tested on Windows and found them to be working well, I suggest lets disable them (TestSolrCloudWithHadoopAuthPlugin, TestDelegationWithHadoopAuth). Please see SOLR-9460 for reference.\n\n ",
            "id": "comment-15725467"
        },
        {
            "date": "2016-12-06T19:36:44+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya Thanks for the review. I have addressed all the comments and updated the PR. Can you please take a look? ",
            "id": "comment-15726472"
        },
        {
            "date": "2016-12-07T20:27:00+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hrishikesh Gadre, I think the patch looks good. However, I'm slightly concerned about the names for the two plugins, i.e. SolrCloudHadoopAuthPlugin and GenericHadoopAuthPlugin. Given that both can be used in SolrCloud, I think it will be confusing for the user as to why are these named so. Do you think we can choose some other names that make the actual distinction clear? Perhaps something like (a) HadoopAuthPlugin and HadoopAuthWithPKIPlugin, or (b) HadoopAuthWithInterNodeAuthPlugin and HadoopAuthPlugin. I'm open to other suggestions as well. ",
            "id": "comment-15729826"
        },
        {
            "date": "2016-12-07T20:48:09+0000",
            "author": "Mark Miller",
            "content": "+1 ",
            "id": "comment-15729874"
        },
        {
            "date": "2016-12-08T00:29:28+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya How about\n\nGenericHadoopAuthPlugin --> can be used with standalone Solr as well as Solrcloud with PKI auth for internode communication\nConfigurableInternodeAuthHadoopPlugin --> extends from GenericHadoopAuthPlugin and allows you to configure internode auth scheme (useful only in Solrcloud). ",
            "id": "comment-15730434"
        },
        {
            "date": "2016-12-08T13:14:06+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "GenericHadoopAuthPlugin and ConfigurableInternodeAuthHadoopPlugin sound fine. Just as an aside, I was wondering if we can drop \"Generic\" as well; but I leave it to your judgement.\nHowever, I would prefer to refrain from highlighting (while documenting) the distinction between standalone and SolrCloud too much. I think both are potentially useful in standalone, since there can be internode communication even in non-SolrCloud/standalone setups (during master/slave replication). ",
            "id": "comment-15732177"
        },
        {
            "date": "2016-12-13T12:59:47+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hrishikesh, if you can update your pull request with the names you suggested or put a patch here, I can commit this. ",
            "id": "comment-15745099"
        },
        {
            "date": "2016-12-15T20:32:59+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya I have updated the PR. Can you please take a look?\n ",
            "id": "comment-15752438"
        },
        {
            "date": "2016-12-19T13:37:17+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Looks good. I've attached the patch here for reference and plan to commit shortly. ",
            "id": "comment-15761180"
        },
        {
            "date": "2016-12-19T15:15:40+0000",
            "author": "ASF subversion and git services",
            "content": "Commit a1a8b2864e621c18aa86b21d4a244233e991a47d in lucene-solr's branch refs/heads/master from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a1a8b28 ]\n\nSOLR-9513: Generic Hadoop authentication plugins, GenericHadoopAuthPlugin and ConfigurableInternodeAuthHadoopPlugin ",
            "id": "comment-15761421"
        },
        {
            "date": "2016-12-19T15:21:33+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hrishikesh Gadre, do you have a moment to please backport this to branch_6x? Unless you get to it first, I can do this, but later in the week. ",
            "id": "comment-15761440"
        },
        {
            "date": "2016-12-19T17:15:45+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya Yes I will submit a 6x patch later today. ",
            "id": "comment-15761726"
        },
        {
            "date": "2016-12-19T17:16:21+0000",
            "author": "ASF GitHub Bot",
            "content": "Github user hgadre closed the pull request at:\n\n    https://github.com/apache/lucene-solr/pull/114 ",
            "id": "comment-15761729"
        },
        {
            "date": "2016-12-19T19:56:16+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya Here is the patch for branch_6x ",
            "id": "comment-15762138"
        },
        {
            "date": "2016-12-20T15:31:23+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 791b8bc6bfde2197e52ab01d8ef0feea6e9838b7 in lucene-solr's branch refs/heads/branch_6x from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=791b8bc ]\n\nSOLR-9513: Generic Hadoop authentication plugins, GenericHadoopAuthPlugin and ConfigurableInternodeAuthHadoopPlugin ",
            "id": "comment-15764462"
        },
        {
            "date": "2016-12-20T17:17:09+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Thanks Hrishikesh Gadre!\n\nThere's a test failure [0], due to the test introduced here, on Java 9 and Windows. I don't think the test code is faulty, there could be some issue with the test runner setup. The mailing list thread is here [1] (FYI, Uwe Schindler).\n\n[0] - https://jenkins.thetaphi.de/job/Lucene-Solr-master-Linux/18574/\n[1] - http://lucene.472066.n3.nabble.com/JENKINS-EA-Lucene-Solr-master-Linux-32bit-jdk-9-ea-147-Build-18573-Still-Unstable-td4310502.html ",
            "id": "comment-15764718"
        },
        {
            "date": "2016-12-20T19:13:04+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 21a6fc3d763d2eedf665e13474b9f751301c738b in lucene-solr's branch refs/heads/branch_6x from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=21a6fc3 ]\n\nSOLR-9513: Fix test failure on Windows and Java9 by avoiding NPE in tearDownClass() ",
            "id": "comment-15764991"
        },
        {
            "date": "2016-12-20T19:13:30+0000",
            "author": "ASF subversion and git services",
            "content": "Commit b5cfb17bd0d56da03dbe1f179db0f03ea0acf735 in lucene-solr's branch refs/heads/master from Ishan Chattopadhyaya\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b5cfb17 ]\n\nSOLR-9513: Fix test failure on Windows and Java9 by avoiding NPE in tearDownClass() ",
            "id": "comment-15764992"
        },
        {
            "date": "2017-01-19T00:59:23+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "As I was working on the Ref Guide changes for this, I realized a confusing potential mistake has crept in. We have a GenericHadoopAuthPlugin class and a HadoopAuthPlugin class, both almost exact copies of each other. I guess this happened while trying to rename the plugin names at the time of updating the PR [0], and I didn't notice at the time of commit.\n\nThe tests are based on HadoopAuthPlugin, and we already have an RC for 6.4 out (and this is not important enough to hold up the release).\n\nAssuming my observations are correct and I'm not missing something, I propose the following now:\n\n\tWe go forward documenting the HadoopAuthPlugin (and the ConfigurableInternodeAuthHadoopPlugin).\n\tWe deprecate the GenericHadoopAuthPlugin, in favour of HadoopAuthPlugin.\n\n\n\nHrishikesh Gadre, what do you think? I'm attaching a patch (master) for this proposed change, which we can commit using another issue (since this one is already potentially released as it is part of 6.4 RC). SOLR-9984.\n\n[0] - https://github.com/apache/lucene-solr/pull/114.patch ",
            "id": "comment-15829086"
        },
        {
            "date": "2017-01-19T03:02:33+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya I think documenting just the HadoopAuthFilter is a good idea. But instead of deprecating it, I think we should just delete that class for following reasons,\n\n\n\tThis class is not directly interacting with client applications. Hence if some deployments are using this class, we can just ask them to change the security.json to point to HadoopAuthFilter (which will provide identical functionality).\n\tDeprecating a class has a hugh cost in the long term. e.g. if there are any API changes - we will still have to update this class. Also we will need to remember the fact that this class needs to be deleted at some point etc.\n\n\n\nIf deleting a class is not an option, why can't we spin another RC for 6.4 ? This functionality has very little or no interaction with the rest of the system. Hence just deleting it before the release seems like the right thing to do.\n\nCC Jim Ferenczi ",
            "id": "comment-15829217"
        },
        {
            "date": "2017-01-19T03:18:23+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya Yet another option may be to deprecate GenericHadoopAuthPlugin and have it extend HadoopAuthPlugin. That way the cost of having GenericHadoopAuthPlugin would be essentially 0. ",
            "id": "comment-15829230"
        },
        {
            "date": "2017-01-19T03:29:06+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "If deleting a class is not an option, why can't we spin another RC for 6.4 ?\nI think it is too much effort for little value.\n\nYet another option may be to deprecate GenericHadoopAuthPlugin and have it extend HadoopAuthPlugin.\nExactly what I tried to do in the patch here (also attached to SOLR-9984). If you can please review the patch, I'll commit it. This doesn't require us to re-spin. ",
            "id": "comment-15829242"
        },
        {
            "date": "2017-01-20T04:03:43+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hrishikesh Gadre, Cassandra Targett, can you please review the ref guide page [0] I added?\n\n[0] - https://cwiki.apache.org/confluence/display/solr/Hadoop+Authentication+Plugin ",
            "id": "comment-15831148"
        },
        {
            "date": "2017-01-20T05:25:40+0000",
            "author": "Hrishikesh Gadre",
            "content": "Ishan Chattopadhyaya Thanks for the writeup ! \n\nHere are couple of improvements, \n\n\n\tCan we add the configuration of proxy users in the examples? You can take a look at following snippet for reference,\nhttps://github.com/apache/lucene-solr/blob/a2131a9e1e3a22dec3ab2185c06999edac3e2f73/solr/core/src/test/org/apache/solr/security/hadoop/TestImpersonationWithHadoopAuth.java#L61\n\n\n\n\n\tInstead of\n\n\n\n\nIt must be noted that it is possible that the authentication configurations changes across Solr versions, depending\nupon the version of Hadoop used within Solr and also as per the Hadoop authentication library's release cycle and\nfeature changes. If you require a more stable setup, in terms of configuration, ability to perform rolling upgrades,\nbackward compatibility etc., you could choose some of the other supported authentication plugins.\n\n\n\n\n\nHow about\n\n\nPlease note that the version of Hadoop library used by Solr is upgraded periodically. While Solr will ensure the\nstability and backwards compatibility of the structure of the plugin configuration (viz. the parameter names of this\nplugin), the values of these parameters may change based on the version of Hadoop library. Please review the\nHadoop documentation for the version used by your Solr installation for more details.\n\nFor some of the authentication schemes (e.g. kerberos), Solr provides a native implementation of authentication\nplugin. If you require a more stable setup, in terms of configuration, ability to perform rolling upgrades,\nbackward compatibility etc., you should consider using such plugin. Please review _link_to_top_level_solr_auth_doc\nfor more details.\n\n ",
            "id": "comment-15831208"
        },
        {
            "date": "2017-01-20T14:39:27+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Changed as per your second suggestion. Will check the proxy users example on Monday. Thanks. ",
            "id": "comment-15831834"
        }
    ]
}