{
    "id": "SOLR-7474",
    "title": "Remove protocol name from base_url in cluster state",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Wish",
        "labels": "",
        "fix_versions": [
            "5.2",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "In order to setup SSL, a user must add a cluster property which enables HTTPS instead of HTTP. This property is used to create the base_url which is stored for every node in the cluster.\n\nThe above works fine if we assume that a user decides to enable SSL before creating the cluster. However, if a user with an existing cluster wants to start using SSL, he will need to manually edit his cluster state to switch the protocol stored inside base_url for every node from http to https. If we remove the protocol from the base_url, a user can shutdown the cluster, setup the certificates, add the cluster property and start the cluster thereby re-using the same cluster state which existed without manual modifications.\n\nAlternately, an extension to zkcli can be provided to change the cluster state. Thoughts?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-04-28T02:15:53+0000",
            "author": "Steve Davids",
            "content": "The base url should be generated by the node when it joins the cluster (or at least that's how it used to work), so  the sequence of events that you describe will work upon restart without having to touch the cluster state. The purpose of the SSLMigrationTest is to do just that - update ZK, restart all nodes, then verify the base_url was updated appropriately with the proper URL scheme. ",
            "id": "comment-14516197"
        },
        {
            "date": "2015-04-28T04:02:39+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Ah I see. I didn't realize that new state events can overwrite the old base_url information. Thanks Steve Davids! ",
            "id": "comment-14516300"
        },
        {
            "date": "2015-06-15T21:44:56+0000",
            "author": "Anshum Gupta",
            "content": "Bulk close for 5.2.0. ",
            "id": "comment-14586944"
        }
    ]
}