{
    "id": "SOLR-1086",
    "title": "Need to rectify inconsistent behavior when people associate an analyzer with a non-TextField fieldType",
    "details": {
        "affect_versions": "1.1.0,                                            1.2,                                            1.3,                                            1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Currently, specifying an <analyzer> is only supported when using the TextField class – however:\n 1) no error is logged if an <analyzer> is declared for other field types\n 2) the analysis screen gives the mistaken impression that the analyzer is being used...\nhttp://www.nabble.com/Field-tokenizer-question-to22594575.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12688863",
            "date": "2009-03-24T20:50:55+0000",
            "content": "\nwe could add a lot new error checking for to deal with these case, but personally i think we should make it possible to specify an Analyzer on any fieldType.  For every FieldType except TextField, the result would be the same as if every token produced by the analyzer had been added as a multivalue.  a new \"ConcatAllTokenFilter\" could be added to make it easy for people concat all tokens produced by a tokenizer and other tokenfilters back into a single string if necessary. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13604378",
            "date": "2013-03-16T19:07:02+0000",
            "content": "I think this is another great project for someone starting in to Solr/Lucene. It might be really useful to be able, for instance, to send the input into a date field through an analysis chain (perhaps custom) to deal with various date formats.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13606943",
            "date": "2013-03-19T22:29:11+0000",
            "content": "this issue actually pre-dates a lot of newer functionality in solr – in particular UpdateProcessors.\n\nI would suggest that while we should still add schema validation checking ot error if someone tries to use an analyzer where it's no supported (if it hasn't already been added?) for things like date format parsing or number format parsing (where you want it to produce Date/Integer/Float/etc objects for storage not just for term indxing) those would make the most sense as UpdateProcessors. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539456",
            "date": "2016-10-02T01:19:31+0000",
            "content": "This validation has been long fixed. Quick test throws back an error:\n\n\nStrField (ignored) does not support specifying an analyzer\n\n "
        }
    ]
}