{
    "id": "SOLR-2790",
    "title": "DataImportHandler last_index_time does not update on delta-imports",
    "details": {
        "affect_versions": "3.4",
        "status": "Closed",
        "fix_versions": [
            "3.4"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "When a full-index is run using the DataImportHandler, the last_index_time is updated.  But it is not updated when a delta-import is run.  Same issue reported here: http://mail-archives.apache.org/mod_mbox/lucene-solr-user/201104.mbox/%3CBANLkTi=CUnkZ26AJ8WCyFP7ujBjPNW6JTg@mail.gmail.com%3E\n\nNote that the DataImportHandler entry on the wiki states that the last_index_time should update on both delta-import and full-import.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Greg Martin",
            "id": "comment-13118255",
            "date": "2011-09-30T18:22:18+0000",
            "content": "Has any consideration been made to looking into this issue? "
        },
        {
            "author": "Chad Kouse",
            "id": "comment-13205795",
            "date": "2012-02-10T22:03:52+0000",
            "content": "I just went through the code – everything looks good – however I can see where this could happen due to file permissions on the file system.  \n\nIt looks like this property is persisted to the dataimport.properties file in your conf folder.  If solr can't write to this file, it will appear as if the last_index_time is not updating.  \n\nCode was added (not sure when) to surround this persist call with try/catch and add a status message \"Could not write property file. Delta imports will not work. Make sure your conf directory is writable\" if it cannot persist the file. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13496458",
            "date": "2012-11-13T19:24:25+0000",
            "content": "I agree with Chad:  DocBuilder does update dataimport.properties at the end of a delta-import.  SOLR-2551 added a warning message if the properties file is not writable.  SOLR-4051 makes it possible to configure the file location so non-writable locations can be easily worked around.   "
        }
    ]
}