{
    "id": "SOLR-10211",
    "title": "Solr UI crashes Solr server somtimes by repeating long requests",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "6.3",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I can observe the following behavior in the new UI:\n\n\tIf request takes to long\n\tPop up red \"Connection to Solr lost\" message.\n\tTry to repeat last request every few seconds to recover.\n\n\n\nAs this tactic may seem OK for real connection problems it may do a lot of harm if request takes long because it's heavy.\n\nI have had two such scenarios.\n1. Loading Schema (e.g. /#/collection1/schema). For big index this can require a a lot of memory initially. And it can take 20-30 seconds. But if such operation is repeated several times in a series is short time frame, resource requirements add up and this results in OOM exception on server side.\nThe workaround is to:\n\n\tTry to load schema\n\tIf red red \"Connection to Solr lost\" message pops up close Solr UI browser tab.\n\tWait a about minute for server to warm up.\n\tOpen a new Solr UI tab and load schema again, this time it works fast enough, probably to next index update.\n\n\n\n2. \"optimize now\" functionality we occasionally use. It can take a while for some collections (~100GB, 10M docs). If such request is repeated over longer period of time a whole Jetty thread pool can be exhausted leaving Solr unresponsive to any requests.\nIt's as easy as starting optimize and leaving your screen for 15 minutes with \"Connection to Solr lost\" message present.\n\nObserved on our few Solr instances after migration from 5.3 to 6.3.",
    "attachments": {
        "repeated optimize requests.png": "https://issues.apache.org/jira/secure/attachment/12855131/repeated%20optimize%20requests.png",
        "Connection to Solr lost message.png": "https://issues.apache.org/jira/secure/attachment/12855128/Connection%20to%20Solr%20lost%20message.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-02-28T13:03:49+0000",
            "content": "Is this connected (duplicate?) of SOLR-9818? ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15887948"
        },
        {
            "date": "2017-02-28T14:03:14+0000",
            "content": "Yes, looks like same root cause but different test cases. \nI'm not sure if there is a general solution in SOLR-10209 yet. I've asked in SOLR-10201 if it will solve this issue. ",
            "author": "Tomasz Czarnecki",
            "id": "comment-15888064"
        },
        {
            "date": "2017-02-28T14:11:39+0000",
            "content": "I got confirmation SOLR-10209 will resolve this and have connected both. ",
            "author": "Tomasz Czarnecki",
            "id": "comment-15888081"
        }
    ]
}