{
    "id": "SOLR-6042",
    "title": "Allow XInclude'ed config to have a top level <INCLUDE> which gets stripped",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The XInclude feature is pretty cool but it's limited to including a configuration element that has one top level tag.  For example \"<types>\".  That's a big limitation.  This issue proposes that a special XML element of the name \"INCLUDE\" (or whatever) be allowed in a config file, which is stripped out when Solr reads the file.  Solr would recursively check for elements of this name and if found then replace the node with all its children.  In practice, nobody would use this except as a root of an XInclude'ed configuration fragment.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13989690",
            "date": "2014-05-05T16:51:55+0000",
            "content": "See discussion at the end of SOLR-5228. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13989715",
            "date": "2014-05-05T17:13:46+0000",
            "content": "FYI: In addition to xinclude you can use named entities to include other stuff. the good thing with named entities is: they don't need a root element. The trick is to use the following code in your config file (xinclude is then not needed!):\n\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<!DOCTYPE solrschema [\n  <!ENTITY types SYSTEM \"mytypes.xml\">\n]>\n<schema name=\"example\" version=\"1.5\">\n  <elementA/>\n  <elementB/>\n  &types;\n  <somethingElse/>\n</schema>\n\n\n\nThe only backside: You have to declare the DTD on top of the file where you list all external references, give them \"entity names\". In the XML source code you can insert those entities with &entity;.\n\nSee also: https://github.com/mapnik/mapnik/wiki/ManagingLargeXmlFiles "
        },
        {
            "author": "David Smiley",
            "id": "comment-13989737",
            "date": "2014-05-05T17:25:59+0000",
            "content": "Ah; I forgot about entities; and the link at Mapnik was interesting. Uwe, in your opinion, would this issue still be useful? "
        }
    ]
}