{
    "id": "SOLR-130",
    "title": "[Patch] [Docu] Starting a mySolr document, which tries to explain how to setup a custom solr instance",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "While developing a custom search server based on solr I took some notes about the do's and don'ts. The initial patch is not a fully finished document but may invite other devs to enhance it.",
    "attachments": {
        "SOLR-130.diff": "https://issues.apache.org/jira/secure/attachment/12350040/SOLR-130.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Thorsten Scherler",
            "id": "comment-12469081",
            "date": "2007-01-31T15:59:42+0000",
            "content": "Initial version  "
        },
        {
            "author": "Antonio Eggberg",
            "id": "comment-12469121",
            "date": "2007-01-31T17:33:24+0000",
            "content": "Wow! you must be reading my mind  I can contribute with questions  As a newbie non-java user from an enterprise prospective! I am your idea target  Having said that I like to know about the following: \n\n1. The schema.xml and solrconfig.xml are in parts very well explained. But in some areas like as an example .. <indexDefaults> and other places there are no explanation. It would be nice to get more info there. Specifically for example if increase <mergeFactor> to 1000 what will happen? what are the highest value for each properties? what is for example a \"safe value\". \n2. It would be nice to create a deployment scenarios i.e a single server install with XXX CPU and YYY memory just running Solr with AAA thousand docs how should your config look like and why? and you can get about xxx Query/Sec or something..\n3. It would be nice to have a multi server deployment with some server spec and then how should the deployment be.\n4. It would also be nice to have more info regarding stopwords synonoms etc. usage and facet etc.. \n\nI know that all of the above are case by case cos configuration by default means case by case. But what I want to propose is a \"Guidelines or Best Practice\" based on your production implementation/deployment you have done with Cocoon. It would be nice to have some real world stories.\n\nI think you should do like the subversion book! - A Solr open source book!  \n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12469902",
            "date": "2007-02-02T23:05:24+0000",
            "content": "Perhaps this should be a Wiki page to make it easier to change / collaborate? "
        },
        {
            "author": "Thorsten Scherler",
            "id": "comment-12469978",
            "date": "2007-02-03T19:15:28+0000",
            "content": "done: http://wiki.apache.org/solr/mySolr\n\n@Antonio, thx for the feedback, I added your comment into the wiki page. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12470005",
            "date": "2007-02-03T22:37:40+0000",
            "content": "Thanks Thorsten, I've been meaning to write a step-by-step guide on how to get up and running with your own data. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12476698",
            "date": "2007-02-28T20:14:51+0000",
            "content": "closing. "
        }
    ]
}