{
    "id": "SOLR-5919",
    "title": "AbstractFullDistribZkTestBase: control server thinks it's part of the cloud, takes overseer role",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SolrCloud",
            "Tests"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I was banging my head trying to figure out why SOLR-5795 combined with SOLR-5823 wasn't working when I noticed something interesting as a result of some gratuituous logging:\n\n\n\tthe control server thinks it's in running in cloud mode, in a cluster consisting solely of itself, and acts as overseer\n\tnone of the nodes in the actual cluster being tested think they are the overseer\n\n\n\n...i haven't dug in very deep, but i suspect that some combination of the control server starting up first and thinking it's part of zk is leading to it becoming the overseer, even thought it evidently never thinks it's one of the leaders/replicas of the cloud cluster.\n\nIt's hard to see this problem w/o SOLR-5823 – i'll update the patch there with a test showing hte problem, but i wanted to make sure it got tracked in it's own bug.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13948866",
            "date": "2014-03-27T04:20:22+0000",
            "content": "I think that is completely fine and as per design. The control server is also aware of Zookeeper and belongs to a collection called control_collection. There should be one overseer across the entire cluster and it can be any node having a shard for any collection as long as it is aware of the same Zookeeper ensemble. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13949369",
            "date": "2014-03-27T14:14:17+0000",
            "content": "Yup. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13949498",
            "date": "2014-03-27T16:15:05+0000",
            "content": "Hmmm... ok: I definitely see that i was being stupid in thinking that every node in the cluster would be involved in hosting \"collection1\", and thus: the overseer may not be running on one of the nodes hosting the collection.  But....\n\nIt still seems really weird to me that the control server is part of the cluster (and can act as the overseer):\n\n1) that means the control server and the control_collection are running in \"zk mode\" so all of the test scaffolding that executes parallel queries against the cloudClient and the controlClient and then compares the results isn't actually comparing a cloud mode response with a standalone mode response – it's comparing a cloud mode multi-shard response with a cloud mode single-shard response.\n\n2) can't this lead to inconsistencies in chaos tests if the chaos monkey shuts down the server running the control_collection? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13949508",
            "date": "2014-03-27T16:18:45+0000",
            "content": "it's comparing a cloud mode multi-shard response with a cloud mode single-shard response.\n\nYeah, that's expected.\n\ncan't this lead to inconsistencies in chaos tests if the chaos monkey shuts down the server running the control_collection?\n\nNo, I don't think that is an issue. I do think it means we are not testing the overseer going down in chaosmonkey tests like we would like to though. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14192042",
            "date": "2014-10-31T16:52:10+0000",
            "content": "I think we should resolve this as invalid? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14192104",
            "date": "2014-10-31T17:19:45+0000",
            "content": "shalin: honestly i forgot all about this issue.\n\nI defer to you & miller on this - but reading back over the comments i still think my two concerns seems concerning...\n\n\n1) ... all of the test scaffolding ... isn't actually comparing a cloud mode response with a standalone mode response – it's comparing a cloud mode multi-shard response with a cloud mode single-shard response.\n\n2) can't this lead to inconsistencies in chaos tests if the chaos monkey shuts down the server running the control_collection?\n\n..but even if others agree, those should really be new/distinct issues. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14192611",
            "date": "2014-10-31T22:20:20+0000",
            "content": "I think it's a valid issue in that it points out we are missing test coverage. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14192617",
            "date": "2014-10-31T22:21:26+0000",
            "content": "it's comparing a cloud mode multi-shard response with a cloud mode single-shard response.\n\nThats as designed. If someone thinks it's an improvement to change it, that's probably worth it's own issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14192619",
            "date": "2014-10-31T22:22:46+0000",
            "content": "bq 2)\n\nIt won't shutdown anything in the control collection - that is the coverage we are missing - the fairly critical coverage of killing the Overseer randomly in ChaosMonkey tests - it's safe in the control collection. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14192629",
            "date": "2014-10-31T22:27:49+0000",
            "content": "1 + 2 seem like a chicken and egg to me ... if we leave the control collection in the cloud (instead of making it it's own isolated solr instance running in legacy non-cloud mode) then how do you prevent it from participating in overseer election? we can't allow ChaosMonkey to shutdown the control collection or comparisons with the control collection won't be reliable, but if it's always up it will get elected overseer pretty quick, and then overseer is never at risk anymore. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14192664",
            "date": "2014-10-31T22:46:39+0000",
            "content": "Nothing in the single shard control collection really depends on the Overseer once it's running. It's simulating a non cloud collection in almost all respects. \n\nWe don't want to shutdown the control collection. It's one server, it just runs.  \n\nWe simply want to make the overseer elected within collection1 sometimes.  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14192671",
            "date": "2014-10-31T22:50:46+0000",
            "content": "\nNothing in the single shard control collection really depends on the Overseer once it's running. It's simulating a non cloud collection in almost all respects.\n\nWe don't want to shutdown the control collection. It's one server, it just runs.\n\nWe simply want to make the overseer elected within collection1 sometimes.\n\nI don't disagree with any of those statements – but none of them really answer the crux of my question...\n\nif we leave the control collection in the cloud ... then how do you prevent it from participating in overseer election? ... it will get elected overseer pretty quick, and then overseer is never at risk anymore. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14192692",
            "date": "2014-10-31T23:04:20+0000",
            "content": "I don't know - depends on how whoever is solving this wants to tackle it.\n\nYou could look at starting control after the jetties - then it would end up last in line (these are horribly started sequentially after all) and chaosmonkey tests would get a bit more coverage.\n\nYou could use the new stuff that lets you prefer nodes as the overseer. That would increase coverage a bit. Randomly prefer all the collection1 jetties.\n\nOr you could change things at a deeper level to create more separation. Probably that's ideal, but given I can't work on it soon, I'm just as +1 on simply getting some Overseer kills in a chaosmonkey run with whatever improvement. "
        }
    ]
}