{
    "id": "SOLR-9702",
    "title": "Authentication & Authorization based on Jetty security",
    "details": {
        "components": [
            "security"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.2.1",
        "status": "Closed",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "(following up on comments initially posted on SOLR-7275).\n\nBack in Solr 4 days, user authentication could be handled by Jetty, and some level of authorization could be implemented using request regexp rules. This was explicitly documented in the SolrSecurity page:\n\nhttp://wiki.apache.org/solr/SolrSecurity?action=recall&rev=35#Jetty_realm_example\n\nIn particular, authentication could thus be performed against a variety of services implemented in Jetty, such as HashLoginService (mentioned explicitly in the above documentation, tested in production, does work) or possibly JAASLoginService, which in turn would open up the possibility to use a whole range of auth services (in particular LDAP servers).\n\nI see that the usage of Jetty is now \"an implementation detail\". Does this mean that the feature listed above is not supported anymore? (This is quite unfortunate IMO, as even just the HashLoginService would be useful to authenticate users against a database of UNIX crypt(3) passwords)\n\nThe new login services that are apparently being reimplemented in Solr itself seem to be much less flexible and limited.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-29T21:27:30+0000",
            "author": "Jan Høydahl",
            "content": "The old wiki article you refer to was a user-contributed recipe and was never \"supported\" as such.\nThe Solr/Lucene project will not officially endorse hacking the internal Jetty settings for the reasons you mention yourself.\nThat does not mean that you cannot get it working in your own environment by adding the missing JARs and setting things up – it is still Jetty. But you will be on your own for the next upgrade or if/when we stop using Jetty to power Solr.\n\nYour best action forward would be to describe what you are not able to do with our current Auth/Authz plugins, and see if there is interest in adding what you need, e.g. HashLogin. It is actually not very difficult to write your own security custom plugin either, perhaps wrapping the functionality from an existing library.\n\nThis issue will probably be closed as Won't fix  ",
            "id": "comment-15618754"
        },
        {
            "date": "2016-10-29T22:42:08+0000",
            "author": "Hrishikesh Gadre",
            "content": "which in turn would open up the possibility to use a whole range of auth services (in particular LDAP servers).\n\nI recently contributed LDAP authentication support in hadoop authentication framework (HADOOP-12082). SOLR-9513 is tracking the changes required to expose this functionality in Solr. May be you can use that ? ",
            "id": "comment-15618844"
        },
        {
            "date": "2016-10-30T09:44:32+0000",
            "author": "Anshum Gupta",
            "content": "Jan Høydahl I agree with you on that and think we should be able to close this out as Won't Fix. \n\nJetty being an implementation detail basically translates to - we should be able to swap it out (when needed) without worrying about any back-compat w.r.t. users hacking or relying on it directly.\n\nAlso, any further discussions on 'how to do X' should be a part of the mailing list instead of a JIRA and we should create an issue for a concrete use case that needs to be handled by Solr. ",
            "id": "comment-15619655"
        },
        {
            "date": "2016-10-30T14:35:20+0000",
            "author": "Thomas Quinot",
            "content": "I see, thanks for the explanations! I guess this issue could be usefully reformulated into an actionable one by making it a suggestion for a Solr Auth/Authz plugin based on JAAS. We'd thus get a variety of backend options (including LDAP) for a single one-time development effort. ",
            "id": "comment-15620036"
        },
        {
            "date": "2016-10-31T00:06:01+0000",
            "author": "Jan Høydahl",
            "content": "I'm closing this. Thomas Quinot please open a new \"Feature\" JIRA issue about your JAAS idea  ",
            "id": "comment-15620817"
        }
    ]
}