{
    "id": "SOLR-9338",
    "title": "Solr cloud setup for 2 node cluster using embedded zookeepr",
    "details": {
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.1",
        "status": "Closed",
        "resolution": "Workaround",
        "priority": "Major"
    },
    "description": "I recently started using solr. I explored quite a bit into solr core over single machine. But I struggled a lot when I wanted to start 2 node solr server with embedded zookeeper. Well cause there is no documentation for it. I think anyone who want to run solr as a cloud would like to set it up on more then one cluster and play around with collections, admin UI to get realistic learning of a solr cloud. \nHere are simple steps to achieve this:\nRun following on node where you want to start embedded zookeeper\n./bin/solr start -cloud\nAll other nodes:\n./bin/solr start -cloud -m 4g -z <node_with_zookeeper>:<zookeeper_port>\n\nAlso all command line utility like solr and post can use a decent documentation. Lot of options and commands are not even visible through call to `solr -help` . e.g. I didn't know till now that -healthcheck is a command!\n\nI know there's a rich solr API which is invaluable for development and production use but anyone who just picking up and wants to play around CLI is a great way.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-08-01T15:18:24+0000",
            "author": "Cassandra Targett",
            "content": "Looks like there are a couple of improvements being suggested here:\n\n\n\timprove the documentation on starting in SolrCloud mode, particularly on a single node\n\timprove bin/solr help output\n\n\n\nI'd suggest separate issues for each - the more targeted a request for improvement, the more likely someone will be able to pick it up and include it in a future release.\n\nFor the documentation part, there is some documentation for exactly your case. The Solr Start Script Reference page calls out starting in SolrCloud mode as a special case (https://cwiki.apache.org/confluence/display/solr/Solr+Start+Script+Reference#SolrStartScriptReference-SolrCloudMode), and points to the Getting Started with SolrCloud page (https://cwiki.apache.org/confluence/display/solr/Getting+Started+with+SolrCloud) which walks through a detailed example of starting Solr in SolrCloud mode on a single machine. I'm sure there are ways that could be easier to find or more clear - do you have suggestions that would have helped you nirav patel? ",
            "id": "comment-15402233"
        },
        {
            "date": "2017-06-28T23:40:34+0000",
            "author": "Jan Høydahl",
            "content": "Fixed by solr -e cloud -noprompt which sets up everything for you. ",
            "id": "comment-16067465"
        }
    ]
}