{
    "id": "SOLR-764",
    "title": "Support facet.sort=false (index order) with distributed search",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Distributed search does not currently support sorting facets by index order (facet.sort=false).",
    "attachments": {
        "SOLR-764.patch": "https://issues.apache.org/jira/secure/attachment/12389858/SOLR-764.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Amit Nithian",
            "id": "comment-12629874",
            "date": "2008-09-10T17:34:43+0000",
            "content": "Are you purposely trying to disable facet results? Why not simply pass in facet=false parameter? "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12629880",
            "date": "2008-09-10T17:42:20+0000",
            "content": "Have you tried a version which incorporates SOLR-755? This should have been fixed in that issue. "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12629887",
            "date": "2008-09-10T17:58:17+0000",
            "content": "I'm trying to get all facets from all shards, ordered alphabetically. I'm not trying to disable facets.\n\nSOLR-755 solves the case where facet.limit=-1 and facet.sort=true, but not where facet.sort=false. A comment in SOLR-755 states:\n\n\"Note that one must add facet.sorted=true in conjunction with facet.limit=-1 since it defaults to unsorted (or sorted-by-term), and this is currently unsupported by distributed search.\" "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12629890",
            "date": "2008-09-10T18:02:59+0000",
            "content": "Ah, right. Sorry, I missed that part. Out of interest, what is your use case that requires facet.sort=false? "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12629892",
            "date": "2008-09-10T18:11:54+0000",
            "content": "I want to show dynamic ranges for numeric facets. My (and probably most??) implementation for building dynamic ranges requires the numbers to be sorted by facet name rather than by occurrences. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12629930",
            "date": "2008-09-10T19:49:26+0000",
            "content": "Patch implementing support for facet.sort=false with distributed search.\n\nSimplified the existing code by removing things that weren't used and added an additional method to sort facets by term number. Note that this implementation is flawed – there are no distributed term numbers, therefore it's possible that several facet values have the same term number because they come from different shards. In that case the lexicographic order of the value will be used to break the tie. It is possible that facet values are returned in a different order for distributed and local setups.\n\nThe patch also adds a unit test, commented out because of the issues described above. "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12629949",
            "date": "2008-09-10T20:30:24+0000",
            "content": "I notice this patch consolidates the FacetInfo class' 'topFacets' & 'listFacets' into a single collection. Do you know why these were ever separate? I had guessed it was because when 'listFacets' was being populated (only when facet.sort=false), it was being populated with data that was already ordered correctly per shard, and that combining the data (while maintaining sort order) from each shard could be optimized beyond calling Arrays.sort(). \n\nShouldn't the getTermSorted method always use name instead of term number?  "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630136",
            "date": "2008-09-11T09:22:03+0000",
            "content": "As far as I could see, \"listFacets\" wasn't used anywhere in the code – everything was put into \"topFacets\" (which behaved exactly the same as \"listFacets\") and sorted in the final stage. I guess the idea was to have a data structure which automatically sorts entries as new ones are inserted. Optimising the combining of sorted data from the shards can't be done in the general case, as e.g. for sort by count the data returned affects the order – merging the results from 2 shards can change the order completely compared because you're adding up the counts.\n\nIf you specify facet.sort=false in a non-distributed setup, the facet values are ordered by term number as well – which happens to be the lexicographic order. Also, sorting by term name only really makes sense for string or text fields. "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12630285",
            "date": "2008-09-11T18:20:10+0000",
            "content": "Do you think it's worth keeping lexicographically sorted facets separate (i.e. in listFacets) and optimizing the combining code specifically for that case? \n\nI misunderstood what term number meant, thanks for clarifying. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630291",
            "date": "2008-09-11T18:28:26+0000",
            "content": "My gut feeling is that it's probably not worth the effort. Usually the number of facets will be very small and sorting the list will be very quick. For large numbers of facets, everything else will slow down as well. I don't think that sorting the list will become a bottleneck.\n\nOf course, you can make some real measurements and prove me wrong \nUnless the gain is significant, I'd prefer keeping the code as simple as possible. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12630309",
            "date": "2008-09-11T19:00:07+0000",
            "content": "I separated out topFacets from listFacets because I assumed the merging logic would be different .\nlist facet refinement seems pretty different than top facet refinement.\n "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630320",
            "date": "2008-09-11T19:21:01+0000",
            "content": "How is the refinement different? It seems to me that both methods operate on the same list, which is just sorted according to different criteria. Facets with less than the minimum count etc. still need to be filtered out the same way. "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12630397",
            "date": "2008-09-11T22:08:49+0000",
            "content": "I measured how long the sort takes in my case: for collections of up to about 1100 items it took less than 1 ms. Compared with my average response times (~1000 ms), it truly is insignificant. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12630423",
            "date": "2008-09-11T23:56:30+0000",
            "content": "How is the refinement different? \n\nThe lists are merged by sorting, then a window is selected to return.\n\nFor facets sorted by count, the counts (and thus the order) may not be correct.  Facet terms outside the window may actually be inside the window (or above it, changing the order).  The code calculates what terms (out of all those returned) could possibly change what the window looks like, taking into account the maximum value it could have for each shard based on what it saw from each.\n\nFor facets sorted by index order, the window into the list will not change based on any facet refinements.  Actually, we should remove any amount of \"over-requesting\" when sorting by index order.  The counts could be off though... we may not have the counts from certain shards.  So we only have to request counts when:\n\n\tthe term is in the window to be returned\n\tthe term is missing from a shard, and that term comes after the last term the shard returned.\n\n "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630527",
            "date": "2008-09-12T09:08:09+0000",
            "content": "I think we still need the over-requesting, regardless of the sort order. Through the facet.mincount parameter the count influences the window to be returned even if we're sorting by term order. We do need to get the exact counts. We can only relax this if facet.mincount isn't specified. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12630578",
            "date": "2008-09-12T14:36:29+0000",
            "content": "I think we still need the over-requesting, regardless of the sort order.\nGood point Lars.  There are some special cases that we probably want to optimize for, esp if they are the usual cases.  if mincount<=1 and sort==false it seems we can safely avoid any over-request. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630793",
            "date": "2008-09-13T16:45:05+0000",
            "content": "Attaching new patch which, as per Yonik's suggestion, doesn't refine facet counts when minCount <=1 and sort == false.\n\nRegarding the term order problem, I think it might be best to redesign the whole thing. Term order as such probably doesn't make a lot of sense, it's really used to get the terms in alphabetical order. So why not drop term order altogether and introduce lexicographic order instead. This probably also means changing the facet.sort parameter from a boolean to a string – \"count\" or \"lex\".\n\nThis would mean that the same query will return the same results for both distributed and non-distributed setups. The downside is that the facets always need to be sorted (i.e. more computation), but according to Wojtek's measurements this seems to be neglible.\n\nIf this seems like the right direction to go to, we should probably open another issue for this. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12662662",
            "date": "2009-01-10T14:31:18+0000",
            "content": "I think this is fixed with SOLR-781 and can be closed. Can anybody confirm? "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12670949",
            "date": "2009-02-05T23:21:22+0000",
            "content": "I found one small issue: sorting lexicographically gives the wrong order when the field type is a sortable number (e.g. sint). I think the fix is to change DistribFieldFacet.getLexSorted() to compare on term number instead of name. \n\n(maybe this should be a comment on SOLR 781 instead). "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12671470",
            "date": "2009-02-07T14:05:24+0000",
            "content": "What do you mean by wrong order? When sorting lexicographically, I would expect it to return something like 1, 10, 11, 2, 20, 3, 4, 5 etc. as this is the lexicographic order. Ordering those by numeric value should probably be a new parameter, like \"facet.sort=numeric\". "
        },
        {
            "author": "Wojtek Piaseczny",
            "id": "comment-12671496",
            "date": "2009-02-07T17:34:55+0000",
            "content": "In the new implementation, sort=false and sort=lex are the same. In the previous implementation, specifying sort=false would sort sortable-numbers (like sint) numerically, rather lexicographically. So there's a slight inconsistency between the new and old implementation. I like the idea of adding a numeric sort order. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12677132",
            "date": "2009-02-26T20:22:39+0000",
            "content": "I would expect it to return something like 1, 10, 11, 2, 20, 3, 4, 5 etc. as this is the lexicographic order\n\nNot for a field like sint, which is manipulated so that the lexicographic order is equal to the numeric order.\nLooks like we need to do FieldType.toInternal() to go back to the indexed form before doing string compares. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12677411",
            "date": "2009-02-27T16:31:02+0000",
            "content": "How about this patch to fix the sort order ?  It should make distributed search lex sort equal to what one would get for non-distributed search. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12677447",
            "date": "2009-02-27T18:25:59+0000",
            "content": "Looks good. I still think that the (semantically) better solution would be to make it explicit with a new parameter – which was one of the reasons for changing facet.sort from true/false to count/lex.\n\nThat said, we could also simply change \"lex\" to \"field\", meaning \"sort it by field value\" and Solr just does the right thing for the different field types. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12677454",
            "date": "2009-02-27T18:36:32+0000",
            "content": "\"lex\" originally made sense to me because it is index order, which is lexicographic for the indexed tokens (but not for the human-readable values).\nSo an \"integer\" field will sort the terms as 0,100,2\nwhile an \"sint\" field will show 0,2,100\n\nIt's not as simple to just \"do the right thing\" since it would carry a significant performance penalty (and that's something we shouldn't cover up or just automatically do).\n\nPerhaps a better name for \"lex\" would be \"index\"? "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12677490",
            "date": "2009-02-27T19:32:55+0000",
            "content": "When I said \"do the right thing\" I basically meant what your patch does already – sort according to the field type. I agree that \"index\" is a better name for it though. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12677525",
            "date": "2009-02-27T21:01:57+0000",
            "content": "Revised patch that switches \"lex\" to \"index\" to avoid confusion about which lex (the invisible indexed token, or the human readable label).\n\nTODO: update wiki when this patch is committed "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12677820",
            "date": "2009-03-01T16:29:57+0000",
            "content": "committed. "
        }
    ]
}