{
    "id": "SOLR-2314",
    "title": "replicate/index.jsp UI does not work with repeaters (both master and slave)",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Summary:\n==========\n\n\tAdmin UI replication/index.jsp checks for master or slave with the following code:\n   if (\"true\".equals(detailsMap.get(\"isSlave\"))) \n\tif slave, replication/index.jsp displays the \"Master\" and \"Poll Intervals\", etc. sections (everything up to \"Cores\")\n\tif false, replication/index.jsp does not display the \"Master\", \"Poll Intervals\" sections\n-This \"slave check/UI difference\" works correctly if the solrconfig.xml has a  \"slave\" but not \"master\" section or vice versa\n\n\n\nExpected results:\n==================\nSame UI difference would occur in the following scenario:\n   a) solrconfig.xml has both master and slave entries\n   b) use java.properties (-Dsolr.enable.master -Dsolr.enable.slave) to set \"master\" or \"slave\" at runtime\n\nOR\n    c) use solrcore.properties  to set \"master\" and \"slave\" at runtime\n\nActual results:\n==================\nIf solrconfig.xml has both master and slave entries, replication/index.jsp shows both \"master\" and \"slave\" section regardless of system.properties or solrcore.properties",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "will milspec",
            "id": "comment-12981080",
            "date": "2011-01-13T01:59:44+0000",
            "content": "Correction:\nWhere the bug says \"-Dsolr.enable.master\" it should have said  '-Denable.master'  (similarly for slave)\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12983456",
            "date": "2011-01-19T00:23:18+0000",
            "content": "something to be clear about here: there is nothing special about the system properties you describe – they are completely meaningless to Solr, and nothing in the code does or should ever check for them explicitly.  they only have meaning if you use them in your solrconfig.xml file, as a way to specify the values of the \"enable\" properties in the \"master\" and \"slave\" sections of the ReplicationHandler declaration.\n\nThe bug seems to be that the JSP for pretty printing the replication handler status is broken and assumes that something is either a master or a slave and doesn't realize that it's possible for something to be both (in the case of a repeater). if you execute the \"details\" command against the replication handler directly, you should see the correct information in the response...\n\nhttp://localhost:8983/solr/replication?command=details "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12983515",
            "date": "2011-01-19T03:08:46+0000",
            "content": "The more i look at this issue, the less i understand it.  testing on the trunk (where index.jsp is identical to the 1.4.1 release)...\n\n\n\tif i use a solrconfig.xml with only master settings, the h1 tag on the page includes \"Master\" and there are three pieces of data (Index Version, Location, and Size)\n\tif i use a solrconfig.xml with only slave settings, the h1 tag on the page includes \"Slave\" and there are numerous additional pieces of information, including all three property returned as a master\n\tif i use a solconfig.xml with both slave and master settings, the h1 tag includes \"Master & Slave\" and i get all of same data as before\n\tthis behavior doesn't change if i leave both the master/slave settings in the handler config, and use an \"enable\" attribute to activate them\n\tall of this behavior remains the same regardless of whether i use a system property to drive the enable attributes.\n\n\n\nSo based on that, i don't see a bug indicating that master details (or slave details) are displayed incorrectly by index.jsp when only one type is in use, but not when a box is a repeater.\n\nHowever...\n\nLooking at the code in index.jsp, i see that some of the details output when the handler is configured as a repeater come from the \"master\" details (\"confFiles\" and \"replicateAfter\") but the entire \"master\" section isn't returned by the details command when the replication handler is only a master.\n\nso there definitely seems to be a bug – i'm just not convinced it's what will ment when he filed this jira issue "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12983520",
            "date": "2011-01-19T03:32:13+0000",
            "content": "I've opened SOLR-2320 to track the bug i've identified, since it doesn't seem to be the same issue will was reporting.\n\nWill: if you can clarify the behavior you are seeing, and how it fails to match your expectations (ie: by providing actual config snippets and screenshots) that would help erify if we are talking about the same bug or not. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12986155",
            "date": "2011-01-25T00:55:07+0000",
            "content": "will: if you can try out the patch i've attached to SOLR-2320 and let me know if that solves the problem you were trying to describe, it would be much appreciated. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13578234",
            "date": "2013-02-14T08:39:06+0000",
            "content": "Closing old issue as the JSP's are now gone from Solr. Please re-open if still a problem. "
        }
    ]
}