{
    "id": "SOLR-35",
    "title": "URL escaping problems in webapp",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Tricia Williams reported problems with Cyrillic charsets when trying to search using the admin application, specifically NPEs and bad results.  \n\nThis patch fixes the webapp by specifying a character encoding for each of the admin pages.  \n\nI also discovered a second issue in StrUtils that wasn't encoding UTF-8 data properly, so I fixed that.  I'm attaching 2 patches.",
    "attachments": {
        "patch-utf-8-problems-webapp.patch": "https://issues.apache.org/jira/secure/attachment/12337181/patch-utf-8-problems-webapp.patch",
        "patch-utf-8-problems.patch": "https://issues.apache.org/jira/secure/attachment/12337182/patch-utf-8-problems.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12422198",
            "date": "2006-07-19T17:23:02+0000",
            "content": "Thanks Phil,\n\nPlease don't make formatting changes in patches that make other changes though... it makes it very hard to see what has changed.\n\nHere is what it looks like these patches do:\n\n\tadmin JSP pages: changes charset\n\tadds a space between the mime-type and charset\n    Example: \"text/xml;charset=UTF-8\" => \"text/xml; charset=UTF-8\"\n    Does this fix a bug, or is it just better style?\n\twhen logging requests, replaces partialURLEncodeVal with URLEncoder.encode()\n    one reason I didn't use this originally was that I wanted queries easier to read... encode() is both slower and encodes many things that don't need to be encoded.  \n   I would much rather see q=title:\"solr+search\" in the log, not q=%22title%3Asolr%20search%22\n\n "
        },
        {
            "author": "Philip Jacob",
            "id": "comment-12422223",
            "date": "2006-07-19T18:40:20+0000",
            "content": "Hey Yonik,\n\nCorrect on the admin pages.  I specified UTF-8 for everything.\n\nThe additional space after the semicolon in \"text/xml; charset=UTF-8\" is out of compliance.  See section 14.17 of HTTP/1.1:\n\nhttp://www.ietf.org/rfc/rfc2616.txt\n\nIt's a small issue, but I noticed it and figured that I'd fix it.\n\nUsing partialURLEncodeVal actually does cause bugs.  The querystring is written into the logfiles and when you use UTF-8 data in the 'q' parameter, it isn't escaped properly.  So while it may be slower, it in fact results in correct output being written by the logger. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12422225",
            "date": "2006-07-19T18:52:57+0000",
            "content": "I've committed most of the changes except the logging change, which I opened SOLR-36 for.\nIt does seem like it would be useful to percent encode non-ascii chars when logging the query params.\n\nThanks! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589343",
            "date": "2008-04-15T23:56:43+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}