{
    "id": "SOLR-10634",
    "title": "Move calculation of some aggregations to collection phase",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Facet Module"
        ],
        "type": "Improvement",
        "fix_versions": [
            "6.7",
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "From http://markmail.org/message/pwgnt7iqxkzcnckh\n\n\nThe current code is more optimized for finding the top K buckets from\na total of N.\nWhen one asks to return the top 10 buckets when there are potentially\nmillions of buckets, it makes sense to defer calculating other metrics\nfor those buckets until we know which ones they are.  After we\nidentify the top 10 buckets, we calculate the domain for that bucket\nand use that to calculate the remaining metrics.\n\nThe current method is obviously much slower when one is requesting\nall buckets.  We might as well just calculate all metrics in the\nfirst pass rather than trying to defer them.\n\nSo we should move aggregations from the second pass to the first pass under the following conditions:\n\n\tno limit (or a high limit compared to the number of potential buckets?)\n\tno sub-facets (or anything else) that will need the domain calculated anyway\n\taggregation is not really memory intensive per-slot (i.e. moving some calculations from per-bucket in the second phase, to all-buckets-in-parallel in the first phase could be really bad for peak memory usage)",
    "attachments": {
        "SOLR-10634.patch": "https://issues.apache.org/jira/secure/attachment/12867589/SOLR-10634.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-11T15:05:46+0000",
            "content": "Here's a first-cut patch.  Existing tests pass, but no specific tests yet to even see if it's being exercised.  I don't think that limit:-1 is exercised much at all either. ",
            "author": "Yonik Seeley",
            "id": "comment-16006600"
        },
        {
            "date": "2017-05-14T14:07:06+0000",
            "content": "I think that proposed approach should significantly speed up lots of real business cases when aggregations are calculated. Also I hope that it will provide possibility to review and simplify design of https://issues.apache.org/jira/browse/SOLR-8998. So I would ask to vote for this JIRA and merge the feature into SOLR codebase. ",
            "author": "Dr Oleg Savrasov",
            "id": "comment-16009749"
        },
        {
            "date": "2017-05-19T14:53:54+0000",
            "content": "Now that I'm back from ApacheCon, I'm working on this again.\nNeed tests and some sort of validation that it's kicking in when desired. ",
            "author": "Yonik Seeley",
            "id": "comment-16017491"
        },
        {
            "date": "2017-05-20T22:10:16+0000",
            "content": "OK, this patch adds tests to ensure that the changes haven't broken any behavior.  We still need changes to test that the optimization kicks in when desired though. ",
            "author": "Yonik Seeley",
            "id": "comment-16018627"
        },
        {
            "date": "2017-05-24T00:52:52+0000",
            "content": "Commit d60c72f34ca9c63ac6075e00dac844c6f052d0a8 in lucene-solr's branch refs/heads/master from Yonik Seeley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d60c72f ]\n\nSOLR-10634: calc metrics in first phase if limit=-1 and no subfacets ",
            "author": "ASF subversion and git services",
            "id": "comment-16022159"
        },
        {
            "date": "2017-05-24T02:11:59+0000",
            "content": "Commit 4f86bf6df8670c3f6d9ceb458be9f14df28b8aeb in lucene-solr's branch refs/heads/branch_6x from Yonik Seeley\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4f86bf6 ]\n\nSOLR-10634: calc metrics in first phase if limit=-1 and no subfacets ",
            "author": "ASF subversion and git services",
            "id": "comment-16022210"
        },
        {
            "date": "2017-05-24T02:16:35+0000",
            "content": "OK, I added DebugAgg to test for the optimization kicking in and committed. ",
            "author": "Yonik Seeley",
            "id": "comment-16022215"
        }
    ]
}