{
    "id": "SOLR-4273",
    "title": "Lazy/transient core loading - display cores not currently loaded with different background color",
    "details": {
        "affect_versions": "4.0",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "An idea related to SOLR-4267 and SOLR-4268.\n\nWhen using cores with the transient option turned on, there may be cores that are configured, but not actually loaded.  It would be useful to have those cores display in the core list, but with a different background color to indicate this not-loaded state.\n\nI don't think the color should be red, because red tends to indicate something is wrong.  If possible, whatever color is chosen should work for people with common forms of color blindness.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13545191",
            "date": "2013-01-05T22:04:19+0000",
            "content": "I just thought of another use for this idea - a red background color for cores that did not load due to an error.  If possible, clicking on the core would display any available error messages. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13566579",
            "date": "2013-01-30T16:23:23+0000",
            "content": "Right now, we only have loaded cores in that List - but if we have unloaded too (Erick Erickson is working on this at SOLR-3980), we can see what's possible "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636805",
            "date": "2013-04-19T19:57:33+0000",
            "content": "SOLR-3980 got resolved! I could eventually figure out how to implement this issue, but Stefan Matheis (steffkes) probably knows how to do it in his sleep.\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717306",
            "date": "2013-07-23T18:47:49+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971203",
            "date": "2014-04-16T12:57:27+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}