{
    "id": "SOLR-8027",
    "title": "Reference guide instructions for converting an existing install to SolrCloud",
    "details": {
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I have absolutely no idea where to begin with this, but it's a definite hole in our documentation.  I'd like to have some instructions that will help somebody convert a non-cloud install to SolrCloud.  Ideally they would start with a typical directory structure with one or more cores and end with cores named foo_shardN_replicaM.\n\nAs far as I know, Solr doesn't actually let non-cloud cores coexist with cloud cores.  I once tried to create a non-cloud core on a cloud install, and couldn't do it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-09T23:31:40+0000",
            "author": "Shawn Heisey",
            "content": "I can try out some things tonight when I get home, assuming the honeydew list is not extreme. ",
            "id": "comment-14737799"
        },
        {
            "date": "2015-09-10T17:58:07+0000",
            "author": "Erick Erickson",
            "content": "Hmmm...... It'd be great to have this documented!\n\nI gave this a quick shot just to see if it'd do what I'd expect and\nit's not actually that hard:\n\n0> created the \"techproducts\" non-solr-cloud collection\n1> shut down Solr\n2> moved the entire directory \"somewhere else\", not in the Solr tree\nto simulate, say, bringing it over from some other machine.\n3> brought up ZK and pushed the configuration file up\n4> started SolrCloud (nothing is in it as you'd expect)\n5> created a new collection with the config from step <3> (name irrelevant)\n6> shut down the cloud\n7> Copied just the contents of the index directory from step <0> to\nthe index directory created in <5>\n8> restarted SolrCloud\n\nAnd all was well.\n\nI also tried just creating a new collection (1 shard) and using\nMERGEINDEXES with the indexDir option which also worked. I think I\nlike that better, there are fewer places to mess things up,\nand it doesn't require bouncing SolrCloud. The first time I tried it I\ndidn't manage to issue the commit, so that should be called out. Also\nshould call out checking that the doc count is right since if a person\ngets nervous and issues the merge N times you have Nx the docs...\n\nYou'd want ADDREPLICAs once you were satisfied you'd moved the index\ncorrectly of course. And hope that the config you pushed up was\nactually OK. Perhaps something here about just moving the relevant\nparts of schema.xml rather than the whole (old) config dir? Or maybe\neven proofing things out on 5x first?\n\nOf course, all this assuming you couldn't just re-index fresh . ",
            "id": "comment-14739234"
        },
        {
            "date": "2015-09-10T21:10:17+0000",
            "author": "Shawn Heisey",
            "content": "Of course, all this assuming you couldn't just re-index fresh \n\nThat would definitely be the preferred way, and the first thing I hope the docs mention.\n\nI guess we'd need to decide whether the goal would be to get the conversion done first, or to set up a fully fault-tolerant cloud first ... the former would very likely be a lot easier, but I'd argue that the latter is much more useful for a production install.\n\nThanks for looking! ",
            "id": "comment-14739595"
        },
        {
            "date": "2015-09-11T00:45:48+0000",
            "author": "Erick Erickson",
            "content": "bq: I guess we'd need to decide whether the goal would be to get the conversion done first, or to set up a fully fault-tolerant cloud first\n\nWell, they aren't mutually exclusive at all.  In the stand-alone Solr -> 1 shard SolrCloud scenario, I'd start with just the single replica (1 shard, no followers) and do the MERGEINDEXES or copy the index. Then it's easy to use the Collections API ADDREPLICA command to, well, add replicas and let the recovery happen. You can add as many replicas as you want for throughput/fault tolerance reasons. Of course I wouldn't be adding docs during this phase, although you could....\n\nBut for any situation where you're going from one shard to multiple shards, I there are at least two options:\n1> do like above and use SPLITSHARD\n2> re-index from scratch. Of course I prefer this one.\n\nGoing from a sharded non-cloud to sharded SolrCloud is....trickier. You'd have to use implicit routing, then insure that the docs that got sent to Solr had the right value in the routing field..... ",
            "id": "comment-14739932"
        }
    ]
}