{
    "id": "SOLR-4425",
    "title": "Provide a way to change the 'logical' state of multiple shards atomically",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Provide a way to change state of multiple shards atomically perhaps through the Collection API.\nThis command should take a map (in some format) of <Shard, State> and update the state of the Shards (Slice) to the corresponding state atomically.\n\nThis is the 'slice' or 'logical' state rather than the per physical shard state.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Anshum Gupta",
            "id": "comment-13575860",
            "date": "2013-02-11T16:05:03+0000",
            "content": "Possible API formats:\n\nhttp://host:port/solr/admin/collections?action=UPDATESHARDSTATE&collection=<COLLECTION_NAME>&STATE1=<shard_1,shard_2>&STATE2=<shard_3,shard_4>\nThis would only handle acceptable shard states [STATE1/STATE2 = \"active\"] viz. \"active\" for now and we'd have to maintain this to cater to new states as and when introduced.\n\n OR\nhttp://host:port/solr/admin/collections?action=UPDATESHARDSTATE&collection=<COLLECTION_NAME>&shard_1=<state1>&shard_2=<state2>\nAnything other than collection name and action would be treated as possible <Shard, State> entry. We could either throw and exception and exit or just log an exception and continue in case of an invalid mapping.\n\nI personally would prefer the later as it doesn't come with a maintenance overhead. Suggestions are welcome. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13575953",
            "date": "2013-02-11T18:33:21+0000",
            "content": "I prefer the second. I think this issue could be tricky - publishing state on a nodes behalf is a little tricky because it's really easy for that node to publish it's own state and race with you on things. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13576025",
            "date": "2013-02-11T19:33:11+0000",
            "content": "prefer the second.\n\n+1\n\npublishing state on a nodes behalf is a little tricky\n\nIf this is for shard splitting, I imagine this is the state for a logical shard.\nWhat's the use case for this API anyway?  If the overseer is involved in splitting shards, it can update the states w/o using an external API?\n "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13576030",
            "date": "2013-02-11T19:35:19+0000",
            "content": "This is the shard (Slice and not Replica) state which doesn't really exist until now. We'd only start using it for the split command https://issues.apache.org/jira/browse/SOLR-3755.\nBut yes, once we have it, we certainly could have some tricky conditions. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13576034",
            "date": "2013-02-11T19:37:58+0000",
            "content": "\"If the overseer is involved in splitting shards, it can update the states w/o using an external API?\"\n\nWell, ideally yes. Let me just give it another thought as that was the original intention behind having this. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13576047",
            "date": "2013-02-11T19:48:39+0000",
            "content": "Ah, I'll change the title to be specific - currently, state in solrcloud is most recognizable as the shard state each core publishes. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13577373",
            "date": "2013-02-13T06:44:27+0000",
            "content": "Gave this some more thought and I'll push this back and come back to it (if really required) when there's another usecase.\nWould have all of this handled in the Overseer as Yonik suggested. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13650242",
            "date": "2013-05-06T23:42:43+0000",
            "content": "The \"updateshardstate\" action is implemented as an overseer command as part of the shard splitting feature. "
        }
    ]
}