{
    "id": "SOLR-8191",
    "title": "Guard against CloudSolrStream close method NullPointerException",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "CloudSolrStream doesn't check if cloudSolrClient or solrStreams is null yielding a NullPointerException in those cases when close() is called on it.",
    "attachments": {
        "SOLR-8191.patch": "https://issues.apache.org/jira/secure/attachment/12768304/SOLR-8191.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-16T00:39:39+0000",
            "author": "Jason Gerlowski",
            "content": "The current patch still applies cleanly.  Fixing this NPE might not be hugely important, but this bug is blocking SOLR-8190, which would be a nice improvement IMO. (Not a huge deal, but still a nice little tidbit).\n\nLooking at CloudSolrStream a little closer though, it seems odd to perform a null-check on close(), but not any of the other places that cloudSolrClient is used.  For instance, check out the protected constructStreams() method, which is invoked on each call to open().\n\nThose are just my observations at a glance.  I'm not very familiar with the SolrJ code, so maybe this isn't actually an issue.  Just wanted to mention it.  I'm going to tinker around with this more tonight to see if I can learn more. ",
            "id": "comment-15059213"
        },
        {
            "date": "2015-12-16T03:18:04+0000",
            "author": "Jason Gerlowski",
            "content": "After a little more attention, I think it'd probably be safer to null-check in constructStreams as well (see above).  That said, I'm not sure if there was a rationale for avoiding this so far. Kevin Risden, was there a reason you hadn't done this in your initial patch?\n\nIn any case, the patch does fix the NPE's exposed by closing the streams in the Streaming tests, so in that respect it looks good to me.\n\nCan someone with more familiarity with this part of the codebase (ideally someone willing to consider merging this) take a look at this patch please ",
            "id": "comment-15059422"
        },
        {
            "date": "2015-12-16T03:36:48+0000",
            "author": "Joel Bernstein",
            "content": "Sure, I should have some time to review this ticket and SOLR-8190 tomorrow. ",
            "id": "comment-15059442"
        },
        {
            "date": "2015-12-16T14:10:59+0000",
            "author": "Kevin Risden",
            "content": "Jason Gerlowski I hadn't looked for other places to do null-checks other than what was found by SOLR-8190. As you said there are probably other places that need hardening. ",
            "id": "comment-15060016"
        },
        {
            "date": "2015-12-16T21:20:40+0000",
            "author": "Joel Bernstein",
            "content": "Ok, this looks fine to me.  ",
            "id": "comment-15060895"
        },
        {
            "date": "2015-12-16T21:41:57+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1720460 from Joel Bernstein in branch 'dev/trunk'\n[ https://svn.apache.org/r1720460 ]\n\nSOLR-8191: Gaurd against CloudSolrStream close method NullPointerException ",
            "id": "comment-15060931"
        },
        {
            "date": "2015-12-16T21:45:33+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1720461 from Joel Bernstein in branch 'dev/trunk'\n[ https://svn.apache.org/r1720461 ]\n\nSOLR-8191: Update CHANGES.txt ",
            "id": "comment-15060943"
        }
    ]
}