{
    "id": "SOLR-8934",
    "title": "Spellchecker collaction should return in popular order",
    "details": {
        "components": [
            "spellchecker"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.5.1",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Minor"
    },
    "description": "From what I understand solr execute queries to determine if the suggest return results.\nhttps://cwiki.apache.org/confluence/display/solr/Spell+Checking#SpellChecking-Thespellcheck.collateParameter\n\nThe spellcheck.collate parameter only returns collations that are guaranteed to result in hits if re-queried, even when applying original fq parameters.\n it would be great if solr will order the collations by numFound, so the collations with more results appear first.\ni.e:\nspellcheck.q = prditive analytiycs\nspellcheck.maxCollations = 5\nspellcheck.count=0\n\nresponse:\n\n<lst name=\"spellcheck\">\n  <lst name=\"suggestions\"/>\n  <bool name=\"correctlySpelled\">false</bool>\n  <lst name=\"collations\">\n    <str name=\"collation\">positive analytic</str>\n    <str name=\"collation\">positive analytics</str>\n    <str name=\"collation\">predictive analytics</str>\n    <str name=\"collation\">primitive analytics</str>\n    <str name=\"collation\">punitive analytic</str>\n  </lst>\n</lst>\n\n\nObviesly that \"predictive analytics\" have more results from \"positive analytic\".",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-05T14:24:07+0000",
            "author": "James Dyer",
            "content": "The collator does not check the queries unless \"spellcheck.maxCollationTries\" is specified.  Also, if you specify \"spellcheck.collateExtendedResults\", it returns the # of hits for each collation.  If returning multiple collations, you can sort them with your client on the # of hits.\n\nThe limitation here is the collate functionality quits once it finds as many collations as you requested, or if it runs out of combinations to try.  But as it is expensive for it to keep running these queries, we don't want to to spend (much) extra time finding the most results.  But you can force it to look for more by requesting more collations returned.\n\nAlso, you need to think about whether or not # of hits is a good predictor of relevance.  Here, the spellchecker is trying the terms that have the closest edit distance from the user's query terms.  So lower hits with fewer edits often will have better relevance than more hits and more edits.\n\nWith all this in mind, do you still see something here that should be done?  What is the bug or new feature you think we need? ",
            "id": "comment-15226346"
        },
        {
            "date": "2016-04-07T08:54:06+0000",
            "author": "Michael Solomon",
            "content": "You are absolutely right!\nI looked on this issue in narrow manner and forgot that solr should serve many and general purposes.\nSort the collations on client by hits works great for me.\nThanks! ",
            "id": "comment-15229937"
        }
    ]
}