{
    "id": "SOLR-11942",
    "title": "need better ref guide docs on join (and grouping) limitations in solr cloud",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "on irc, a user asked about joining in solr cloud and i realized that the \"JoinQParser\" docs don't really clarify what does/doesn't work in cloud.  There is a section on \"Joining Across Collections\" which points out some limitations in cloud mode, and the \"Result Grouping\" page has a brief note that \"a...ll documents in each group must be co-located on the same shard in order for accurate counts to be returned. Document routing via composite keys can be a useful solution in many situations.\"  But there is no similar warning for using the join parser n a single collection.\n\nWe should probably beef up the warning on the \"Result Grouping\" section to give an example of what does/doesn't work, and cross link to that from the \"join\" parser docs? (ie: \"Note that when using multiple shards, the join parser has similar limitations as  the GroupComponent regarding co-located documents|LINK_TO_OTHER_DOC )",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-02-02T23:43:31+0000",
            "content": "Another thought: in general it might be work adding a \"joining and grouping\" type document, giving a high level overview of the concepts/usecases people might have and how to solve them, where we note the general caveats of why \"distributed grouping/joining\" is a hard problem and how things like the paralllel SQL APIs can sometimes be of use in these sitautions\n\n(maybe?) ",
            "author": "Hoss Man",
            "id": "comment-16351069"
        },
        {
            "date": "2018-02-15T18:50:13+0000",
            "content": "in general it might be work adding a \"joining and grouping\" type document\n\nI was recently asked for an overview like this, and had a hard time finding a coherent answer, even from the snippets that already exist. +1 to this. ",
            "author": "Cassandra Targett",
            "id": "comment-16366099"
        }
    ]
}