{
    "id": "SOLR-4995",
    "title": "Implementing a Server Capable of Propagating Requests",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Currently Solr servers are interacting with only one Solr node. There should be an implementation that propagates requests into multiple Solr nodes. For example when Solr is used as SolrCloud sending a LukeRequest should be made to one node at each shard.",
    "attachments": {
        "SOLR-4995.patch": "https://issues.apache.org/jira/secure/attachment/12590645/SOLR-4995.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Furkan KAMACI",
            "id": "comment-13699069",
            "date": "2013-07-03T15:11:19+0000",
            "content": "Initial commit is made. Multi threaded requests and other improvements will come after getting feedbacks of community. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13700297",
            "date": "2013-07-04T18:52:05+0000",
            "content": "Typically this is achieved by modifying the request handler (or SearchComponent) to support distributed requests. See http://wiki.apache.org/solr/WritingDistributedSearchComponents\n\nThis patch just queries a node of each shard and adds all the responses into one response. This is not ideal because:\n\n\tIt doesn't really combine stats in a useful way. A client would still have to go through each individual sub-response and add up the statistics\n\tIt only helps SolrJ (Java) users. On the other hand a distributed handler/component is useful for clients of all languages\n\n\n\nI don't think that this is the right approach. "
        },
        {
            "author": "Furkan KAMACI",
            "id": "comment-13700532",
            "date": "2013-07-05T08:33:48+0000",
            "content": "Hi Shalin;\n\nI will consider your thoughts and apply a new patch. "
        }
    ]
}