{
    "id": "SOLR-10297",
    "title": "Resolve Ref Guide build errors",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The asciidoctor tools used to build the HTML and PDF versions of the Ref Guide validate the pages during the build and throw errors during the build when there are problems. Usually these problems are not fatal, but they do indicate inconsistencies in the content that should be resolved. Almost all of the time they are problems with inconsistent heading levels - a h5 follows a h2 for example.\n\nThese errors should be cleaned up so we only see errors we should worry about going forward.",
    "attachments": {
        "build-errors-HTML-20170315.txt": "https://issues.apache.org/jira/secure/attachment/12858946/build-errors-HTML-20170315.txt",
        "build-errors-PDF-20170315.txt": "https://issues.apache.org/jira/secure/attachment/12858947/build-errors-PDF-20170315.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-15T20:26:03+0000",
            "content": "Attaching two files which show the build errors from recent builds. These are nearly identical in substance, but slightly different in presentation. ",
            "author": "Cassandra Targett",
            "id": "comment-15926920"
        },
        {
            "date": "2017-05-09T22:33:53+0000",
            "content": "After a lot of cleanup work, there are currently only 2 build errors – and only when building the PDF...\n\n\n[asciidoctor:convert] asciidoctor: ERROR: about-this-guide.adoc: line 1: invalid part, must have at least one section (e.g., chapter, appendix, etc.)\n[asciidoctor:convert] asciidoctor: ERROR: solr-glossary.adoc: line 1: invalid part, must have at least one section (e.g., chapter, appendix, etc.)\n\n\n\nThe pages themselves are well formed – the crux of the problem seems to related to where/how they get included in the final PDF.  Notably: asciidoctor will sometimes complain about invalid syntax in included files because of problems that occur in the content that comes before the included file\n\nIn practice the root issue seems to be:\n\n\tsomething about the fact that about-this-guide.adoc is the first child of index.adoc is why we get an error about it – reorder the children so any other file.adoc is the first child in the list and the error will move to that file\n\tsomething about the fact that solr-glossary.adoc is the next (top level) section after further-assistance.adoc is the reason we get an error about it.  reorder the children of index.adoc so that any other file.adoc comes after further-assistance.adoc and you'll get the error about that file instead.\n\n\n\nNote these relevant links i found and some of the details in them that hint at similar problems...\n\nhttps://github.com/asciidoctor/asciidoctor/issues/1704\n\nA missing include file is reported as a syntax error in the next included file\n\nThis is likely due to the unique combination of leveloffset and the secure mode. ... Actually, the leveloffset probably doesn't have anything to do with it in this case (but there are cases when that might be a factor).\n\nhttps://github.com/asciidoctor/asciidoctor-epub3/issues/65\n\nBut the document is well structured, it just uses level offsets on imports?\nFinally, the problem is that the includes must start with a level-0 section. The problem right now is that you are using leveloffset: +1, which pushes it down to level-1 section. Take this away as well as the section titles in index.adoc and it will work. ... The other converters need the chapter sections to be a level-1, so this is the setting I recommend in the header of the spine document. ",
            "author": "Hoss Man",
            "id": "comment-16003676"
        },
        {
            "date": "2017-05-09T23:02:46+0000",
            "content": "It looks like we could resolve these errors just by adding a == header to index.adoc and further-assistance.adoc ala the patch below ... but i'm not sure if the cure is better then the disease?\n\n\ndiff --git a/solr/solr-ref-guide/src/further-assistance.adoc b/solr/solr-ref-guide/src/further-assistance.adoc\nindex 8cbeedc..373a317 100644\n--- a/solr/solr-ref-guide/src/further-assistance.adoc\n+++ b/solr/solr-ref-guide/src/further-assistance.adoc\n@@ -2,6 +2,8 @@\n :page-shortname: further-assistance\n :page-permalink: further-assistance.html\n \n+== Seeking Futher Assistance\n+\n There is a very active user community around Solr and Lucene. The solr-user mailing list, and #solr IRC channel are both great resources for asking questions.\n \n To view the mailing list archives, subscribe to the list, or join the IRC channel, please see https://lucene.apache.org/solr/community.html.\ndiff --git a/solr/solr-ref-guide/src/index.adoc b/solr/solr-ref-guide/src/index.adoc\nindex d1f0a84..d1b8e2a 100644\n--- a/solr/solr-ref-guide/src/index.adoc\n+++ b/solr/solr-ref-guide/src/index.adoc\n@@ -5,6 +5,8 @@\n \n This reference guide describes Apache Solr, the open source solution for search. You can download Apache Solr from the Solr website at http://lucene.apache.org/solr/.\n \n+== Welcome to the Reference Guide for Apache Solr {solr-docs-version}\n+\n This Guide contains the following sections:\n \n *<<getting-started.adoc#getting-started,Getting Started>>*: This section guides you through the installation and setup of Solr.\n\n ",
            "author": "Hoss Man",
            "id": "comment-16003718"
        },
        {
            "date": "2017-05-10T15:41:09+0000",
            "content": "The cause of these errors is from the fact we're using :doctype: book (line 146 in build.xml). \n\nWe could experiment with :doctype: article, which is the default and doesn't have these rules. I did this before, and now that I'm thinking of it I think it causes some really unfortunate page breaks that we can't control.\n\nI dislike the idea of adding an extra header to very short pages just to avoid an error that doesn't actually hurt anything. Yes, it's an error according to the rules of the converter, but it's not a failure, and some future content reworking may make them go away. ",
            "author": "Cassandra Targett",
            "id": "comment-16004873"
        }
    ]
}