{
    "id": "SOLR-37",
    "title": "Add additional configuration options for Highlighting",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As discussed in the mailing list, I've been looking at adding additional configuration options for highlighting. \nI've made quite a few changes to the properties for highlighting:\n\nProperties that can be set on request, or in solrconfig.xml at the top level:\n  highlight (true/false)\n  highlightFields\nProperties that can be set in solrconfig.xml at the top level or per-field\n  formatter (simple/gradient)\n  formatterPre (preTag for simple formatter)\n  formatterPost (postTag for simple formatter)\n  formatterMinFgCl (min foreground colour for gradient formatter)\n  formatterMaxFgCl (max foreground colour for gradient formatter)\n  formatterMinBgCl (min background colour for gradient formatter)\n  formatterMaxBgCl (max background colour for gradient formatter)\n  fragsize (if <=0 use NullFragmenter, otherwise use GapFragmenter with this value)\n\nI've added variables for these values to CommonParams, plus there's a fields Map<String,CommonParams> that is parsed from nested NamedLists (i.e. a lst named \"fields\", with a nested lst for each field).\n\nHere's a sample of how you can mix and match properties in solrconfig.xml:\n\n  <requestHandler name=\"hl\" class=\"solr.StandardRequestHandler\" >\n    <str name=\"formatter\">simple</str>\n    <str name=\"formatterPre\"><i></str>\n    <str name=\"formatterPost\"></i></str>\n    <str name=\"highlightFields\">title,authors,journal</str>\n    <int name=\"fragsize\">0</int>\n    <lst name=\"fields\">\n      <lst name=\"abstract\">\n        <str name=\"formatter\">gradient</str>\n        <str name=\"formatterMinBgCl\">#FFFF99</str>\n        <str name=\"formatterMaxBgCl\">#FF9900</str>\n        <int name=\"fragsize\">30</int>\n        <int name=\"maxSnippets\">2</int>\n      </lst>\n      <lst name=\"authors\">\n        <str name=\"formatterPre\"><strong></str>\n        <str name=\"formatterPost\"></strong></str>\n      </lst>\n    </lst>\n  </requestHandler>\n\nI've created HighlightingUtils to handle most of the parameter parsing, but the hightlighting is still done in SolrPluginUtils and the doStandardHighlighting() method still has the same signature, but the other highlighting methods have had to be changed (because highlighters are now created per highlighted field).\n\nI'm not particularly happy with the code to pull parameters from CommonParams, first checking the field then falling back, e.g.:\n         String pre = (params.fields.containsKey(fieldName) && params.fields.get(fieldName).formatterPre != null) ?\n               params.fields.get(fieldName).formatterPre : \n                  params.formatterPre != null ? params.formatterPre : \"<em>\";\n\nI've removed support for a custom formatter - just choosing between simple/gradient. Probably that's a bad decision, but I wanted an easy way to choose between the standard formatters without having to invent a generic way of supplying arguments for the constructor. Perhaps there should be formatterType=simple/gradient and formatterClass=... which overrides formatterType if set at a lower level - with the formatterClass having to have a zero-args constructor? Note: gradient is actually SpanGradientFormatter.\n\nI'm not sure I properly understand how Fragmenters work, so supplying fragsize to GapFragmenter where >0 (instead of what was a default of 50) may not make sense.",
    "attachments": {
        "patch.diff": "https://issues.apache.org/jira/secure/attachment/12339588/patch.diff",
        "patch": "https://issues.apache.org/jira/secure/attachment/12337303/patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Andrew May",
            "id": "comment-12422669",
            "date": "2006-07-21T15:06:23+0000",
            "content": "Changes to CommonParams, SolrPluginUtils, plus new HighlightingUtils "
        },
        {
            "author": "Andrew May",
            "id": "comment-12430299",
            "date": "2006-08-24T18:07:13+0000",
            "content": "New patch to configure Highlighting using new SolrParams.\n\nParameters:\nhl - turn highlighting on/off\nhl.fl - list of fields to be highlighted, either as a single parameter (e.g. hl.fl=title,keywords) or multiple parameters (hl.fl=title&hl.fl=keywords)\nhl.snippets - maximum number of highlight snippets (default = 1)\nhl.fragsize - fragment size for highlighting, 0 -> NullFragmenter (default = 50)\nhl.formatter - value of either simple or gradient (default = simple)\nhl.simple.pre - simple formatter pre tag (default = <em>)\nhl.simple.post - simple formatter post tag (default = </em>)\nhl.gradient.minFg - gradient formatter min foreground colour\nhl.gradient.maxFg - gradient formatter max foreground colour\nhl.gradient.minBg - gradient formatter min background colour\nhl.gradient.maxBg - gradient formatter max background colour\n\nAll values appart from hl & hl.fl can be specified per field. e.g. f.title.hl.fragsize=0.\n\nAll the highlighting code is now in HighlighingUtils rather than SolrPluginUtils. Seems like I've ended up with one big doHighlighting method that does all the work - not sure that's a good thing, but things ended up this way when I started creating highlighters per field. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12430318",
            "date": "2006-08-24T20:22:17+0000",
            "content": "ping test  (4:24 EDT, 8/24/2006) "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12430345",
            "date": "2006-08-24T21:51:56+0000",
            "content": "Thanks for the patch!\n\nA few comments:\n\n1) The patch uses absolute paths, which makes it difficult to apply.  Please generate patches using 'svn diff > mypatch.diff' at the root level of a solr trunk checkout\n\n2) I don't believe that it is necessary to add the constructors to GrapFragmenter--the existing constructors from SimpleFragmenter are equivalent.\n\n3) The default FRAGSIZE should be 100 to conform to Lucene's Highlighter default (it would be nice if this was exposed so we could use it)\n\n4) Might it be worth providing sensible defaults for the gradient values so users can try hl.formatter=gradient without futher configuration?\n\n5) There are a few constuctions of this form: \n+      String param = getParams(request).getFieldParam(fieldName, SNIPPETS);\n+      //the default of zero should never be used, as SNIPPETS is defined in the defaults\n+      return (param != null) ? Integer.parseInt(param) : 0;\n\nwhere getParams returns a SolrParams instance which already has defaults for this parameter.  Surely providing a default is unnecessary, and shouldn't null also be impossible due to the DefaultSolrParams construction?  Inlining these (in the calling method) to something like\n\nSolrParams p = getParams(request)\nint maxSnippets = Integer.parseInt(p.getFieldParam(fieldName));\n\nwould be cleaner and save some object construction costs.\n\n6) The last time this patch was discussed it was mentioned that there are tradeoffs in using field-specific idf values for highlighting scoring.  One downside is that they must be read. Another is terms are only highlit in fields they are searched in, which may be desirable behaviour, but limits the usefulness of the hl.fl parameter.  I'm not sure what the best approach is.\n\n7) The attached patch contains no tests, and further, though I have not applied the patch due to 1), I'm skeptical that the testsuite passes since the parameter names weren't changed in src/test/o/a/s/HighlighterTest.java.  The latter is easy enough to fix, but new test should be included before this patch is committed.\n\nThanks again for the patch! "
        },
        {
            "author": "Andrew May",
            "id": "comment-12430503",
            "date": "2006-08-25T13:33:02+0000",
            "content": "Mike,\n1) Was using SVN support in Eclipse and it doesn't let you control this - I've installed the command line version now.\n2) If GapFragmenter just has a default constructor it's not possible to pass the fragsize (constructors not inherited)?\n3) My mistake - I think this is a legacy of me originally confusing fragsize and GapFragmenter's increment threshold.\n4) Perhaps - I wasn't sure what sensible defaults were, and I can't seem to get the gradient fragmenter to do anything useful - but I can't see an obvious bug in my code to construct it.\n5) That was me being overly defensive, and I've changed it now. I considered adding methods like getFieldInt(), getFieldBool to SolrParams, so there were field versions of all the non-field methods - but decided against it.\n6) I was wondering whether a hl.exact flag might be useful - if false (the default?) the QueryScorer wouldn't be created with the field/maxTermWeight. I'm not sure there's any point using the gradient formatter unless you supply the field name/maxTermWeight, so that might ignore this setting.\n7) Sorry - will fix and add additional tests.\n\nOne thing I don't like about HighlightingUtils as it stands is the lack of state. When highlighting multiple fields, getParams() is called many times, each time constructing a DefaultSolrParams (although I don't think there's a big overhead to doing this). If we're not specifying the field when creating the QueryScorer then this could be reused for multiple fields. We could possibly re-use the highlighter instance as well. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12430552",
            "date": "2006-08-25T17:44:06+0000",
            "content": "Hi Andrew,\n\n1) 3) 5) 7) thanks!\n2) You're right--I'm head is sometimes too steeped in pythonland.\n4) If no-one is using the gradient formatter, perhaps we shouldn't include it by default?  There may be more intuitive ways of designing this feature if we have the benefit of a real world use case.\n6) \"exact\" could mean many things in the context of highlighting.  Perhaps something like \n\nhl.scoring=simple (default)\nhl.scoring=fieldidf (per-field idf weights) "
        },
        {
            "author": "Andrew May",
            "id": "comment-12430558",
            "date": "2006-08-25T17:59:25+0000",
            "content": "New patch incorporating feedback (hopefully the diff is more usable this time).\n\n\n\tdefault fragsize now 100\n\tremoved redundant defaults when getting fragsize and snippets\n\tfixed tests and added new tests\n\tadded \"Enable Highlighting\" and \"Fields to Highlight\" to the advanced form in the admin pages\n\n\n\nThe other change, which is more complex is to add a new \"hl.exact\" parameter (which defaults to false) which affects how the QueryScorer is created. The logic is now this:\n\nif using gradient formatter\n    new QueryScorer(query, indexReader, fieldName)\nelse if hl.exact=true\n    new QueryScorer(query, fieldName)\nelse\n    new QueryScorer(query)\n\nMy understanding is that the GradientFormatter requires the scorer to be created with IndexReader and field name to work properly, so using a gradient formatter for any field overrides the hl.exact flag.\nI've assumed that it's more efficient to create a QueryScorer that doesn't use an IndexReader in the case of hl.exact=true. If not then that could be rolled in with the gradient formatter case.\nThen the default behaviour is to create a QueryScorer without the field name and have less exact highlighting.\n\nDoes that sound like reasonable behaviour?\n\nAh - looks like I'm overlapping with a comment from Mike. I'm suggesting 'exact' because of how adding the fieldname to the QueryScorer affects searches across multiple fields - basically for what I'm using it for I don't want a value I searched for in the journal field appearing in the highlight for the title field (which was searched with something different) - so I would want hl.exact=true. But you're right - this is probably an overly broad term, and it is all about the scorer.\n\nAs for removing the gradient highlighter - I still don't really know how it's supposed to work, and I can't get it to do anything useful when searching my data, but perhaps that's my configuration error (rather than a coding error in this patch). I'll probably end up using the simple formatter with custom pre and post values. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12430752",
            "date": "2006-08-26T15:51:45+0000",
            "content": "JIRA ping test (11:54 EDT, 8/26/2006) "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12431039",
            "date": "2006-08-28T19:27:29+0000",
            "content": "Does anyone else have comments on the two issues I raised, namely:\n\n1) should we include support for gradient formatting? (My opinion is \"no\", since no-one uses it and Andrew can't get it to work with his data so we have no functionality tests)\n\n2) the \"exact\" parameter.  I'm uncomfortable about the name and the fact that setting a formatter (which feels to the user like a cosmetic setting) can influence core highlighting functionality.\n\nOnce these items are resolved and re-reviewed I am in favour of committing the patch. "
        },
        {
            "author": "Andrew May",
            "id": "comment-12431590",
            "date": "2006-08-30T14:39:33+0000",
            "content": "I've spent a bit of time trying to understand Gradient formatting and how QueryScorer is used. As I didn't see any very good documentation for this (I may have missed it) - I thought I'd share.\n\nIt appears that GradientFormatter colours according to the term's weight within the index - so terms that appear less frequently in the index will be coloured closer to the max foreground/background colour. So, the colour is not related to the specific document or fragment being evaluated and that term will be highlighted the same for the entire results set. If two terms appear with a similar frequency in the index they will have similar colours - and this seems to happen a lot (perhaps because scaling is done between 0 and maxWeight rather than minWeight and maxWeight).\n\nThere's also a fairly serious bug in the colouring that makes a lot of combinations give meaningless results (e.g. minBg=#FF0000, maxBg=#00FF00 will give results coloured #FFFF00) - see GradientFormatter.getColorVal().\n\nIn other words, I now agree with Mike that we should not support Gradient formatting. Perhaps we still want to retain the hl.formatter= parameter in case we have any other values than \"simple\" in the future - and keep hl.simple.pre and hl.simple.post as they are.\n\nAs for the QueryScorer, I think it makes sense to support all three ways it can be construted:\n1) hl.scoring=simple (the default)  - construct with Query only. May have some matches from other terms, but allows you to highlight different fields to the ones searched.\n2) hl.scoring=field - constructed with Query and fieldName. Only highlights terms matched in this field by the query.\n3) hl.scoring=fieldidx - constructed with Query, fieldName and IndexReader. I think the selection of the best fragment(s) will be improved because the terms will be weighted according to their frequency in the index - but this has to be more costly as it calls IndexReader.docFreq for each term.\n\nDoes that sound reasonable? "
        },
        {
            "author": "Andrew May",
            "id": "comment-12431616",
            "date": "2006-08-30T16:24:11+0000",
            "content": "New patch that removes support for gradient formatter, and uses hl.scoring parameter instead of hl.exact to control how the QueryScorer is created. "
        },
        {
            "author": "Andrew May",
            "id": "comment-12431618",
            "date": "2006-08-30T16:27:20+0000",
            "content": "I guess I need to number my patch files as they don't seem to get listed in the order they were added and I can't remove old ones. The new patch appears to be number 3. "
        },
        {
            "author": "Andrew May",
            "id": "comment-12432144",
            "date": "2006-09-01T14:02:58+0000",
            "content": "New patch.diff - removed hl.scoring=simple/field/fieldidx parameter and added hl.requireFieldMatch=true/false.\n\nAlso added two getFieldBool methods to SolrParams - so that field parameters can use the same parseBool method (which also evaluates yes/on to true). "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12432230",
            "date": "2006-09-01T20:21:31+0000",
            "content": "Commited r439428 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589351",
            "date": "2008-04-15T23:56:44+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}