{
    "id": "SOLR-2646",
    "title": "Integrate Solr benchmarking support into the Benchmark module",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As part of my buzzwords Solr pef talk, I did some work to allow some Solr benchmarking with the benchmark module.\n\nI'll attach a patch with the current work I've done soon - there is still a fair amount to clean up and fix - a couple hacks or three - but it's already fairly useful.",
    "attachments": {
        "chart.jpg": "https://issues.apache.org/jira/secure/attachment/12536578/chart.jpg",
        "SOLR-2646.patch": "https://issues.apache.org/jira/secure/attachment/12486938/SOLR-2646.patch",
        "SolrIndexingPerfHistory.pdf": "https://issues.apache.org/jira/secure/attachment/12535662/SolrIndexingPerfHistory.pdf",
        "Dev-SolrBenchmarkModule.pdf": "https://issues.apache.org/jira/secure/attachment/12486939/Dev-SolrBenchmarkModule.pdf"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13067372",
            "date": "2011-07-18T22:58:46+0000",
            "content": "Still some to do here, but here is what I have at the moment. Larger issues that are left are:\n\n\n\tcleanly integrate into the build (hack integration now)\n\n\n\n\n\timprove error handling and reporting so that it's easier to create working algorithms.\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13067374",
            "date": "2011-07-18T23:01:54+0000",
            "content": "Attached is a brief rough guide to getting started writing or running an algorithm. Thanks to Martijn Koster for contributing improvements and additional info for it.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13067377",
            "date": "2011-07-18T23:09:30+0000",
            "content": "Also, as a reminder to myself - the SolrSearchTask is a bit of hack right now - Query#toString police alert  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13067386",
            "date": "2011-07-18T23:20:34+0000",
            "content": "Some of the available settings (top of the alg file) that can be varied per round:\n\nsolr.server=(fully qualified classname)\nsolr.streaming.server.queue.size=(int)\nsolr.streaming.server.threadcount=(int)\n\nsolr.internal.server.xmx=(eg 1000M)\n\nsolr.configs.home=(path to config files to use)\nsolr.schema=(schema.xml filename in solr.configs.home)\nsolr.config(solrconfig.xml filename in solr.configs.home)\n\nsolr.field.mappings=(map benchmark field names to Solr schema names eg doctitle>title,docid>id,docdate>date)\n\n "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13067604",
            "date": "2011-07-19T10:21:53+0000",
            "content": "This is awesome Mark!  We badly need to be able to easily benchmark Solr. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13072037",
            "date": "2011-07-27T21:41:17+0000",
            "content": "New patch - \n\n*A variety of little improvements in error handling and messages. Slightly better handling of starting/stopping solr internally (a lot I'd like to improve still though). \n\n*Also adds the log param to StartSolrServer so that you can use StartSolrServer(log) to pump the Solr logs to the console. Very useful when developing an algorithm and to be sure it's doing what you think it is. \n\n*Also now actually points to the correct configs folder in the internal example algs, and doesn't silently use the example config (or last used) when it cannot find the specified config file. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13206236",
            "date": "2012-02-11T19:25:24+0000",
            "content": "to trunk "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13206990",
            "date": "2012-02-13T17:17:16+0000",
            "content": "What else do you need to get this in... cleaner integration into the build? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13207043",
            "date": "2012-02-13T18:31:20+0000",
            "content": "Yeah - I guess that is my biggest problem - for example, I hack into benchmark module to find the Solr jars - which is why you have to run ant dist first (and it uses the Solr example, so you have to run example).\n\n\n+    \t<!-- used to run solr benchmarks -->\n+\t\t<pathelement path=\"../../solr/dist/apache-solr-solrj-4.0-SNAPSHOT.jar\" />\n+\t\t<fileset dir=\"../../solr/dist/solrj-lib\">\n+\t\t\t<include name=\"**/*.jar\" />\n+\t\t</fileset>    \t\n\n\n\nIt is even hardcoded for 4.0-SNAPSHOT at the moment - that can be wild-carded, but it's still a little nasty.\n\nThere are certainly plenty of other rough edges, but that is the largest hack issue probably. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13409396",
            "date": "2012-07-09T12:46:55+0000",
            "content": "A patch taking things to trunk. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13409399",
            "date": "2012-07-09T12:49:47+0000",
            "content": "I took a little time and tested Solr indexing performance on trunk over about the past year and a half. I also added some numbers from 3.6 for comparison.\n\nThis benchmark tests both a single indexing thread, as well as 4 threads with the concurrent solr server.\n\nI test indexing 10000 wikipedia docs and do 4 runs (serial, concurrent, serial, concurrent). I toss the first 2 runs and record the second 2 runs. I do this once at the end of each month. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13409566",
            "date": "2012-07-09T15:26:59+0000",
            "content": "According to the note at the bottom of SolrIndexingPerfHistory.pdf, it appears trunk is slower than 3.6 – how could that be? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13409577",
            "date": "2012-07-09T15:41:23+0000",
            "content": "Could not tell you. Could be a large variety of things.\n\nThis is a test using the current example configs shipped at each date - which means it's not always apples to apples if default config changes. Analysis could have changed for our default english text. New defaults for features or ease of use may have been enabled.\n\nFor example, I believe the update log is on by default now for durability and realtime GET, etc.\n\nAlso, some code paths have changed to support various new features.\n\nAlso, Lucene is changing underneath us, so we should probably compare to some similar benchmark there (I know Mike publishes quite a few that could be looked at).\n\nIt's not so easy to dig in after the fact with month resolution.\n\nAt some point, it would be nice to have this automated and published as Lucene is - then we could run it nightly.\n\nThere is some work to do to get there though (don't know that ill have time for it in the near future), and we would need a good consistent machine to run it on (I could probably run it at night or something).\n\nI have not attempted to track anything down other than the broad numbers right now.\n\nThis is simply to start a record that can help as we move forward in evaluating how changes impact performance.\n\nObviously the single threaded path has not been affected - so whatever has changed, it's likely mostly around concurrency. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412214",
            "date": "2012-07-11T22:26:25+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13414803",
            "date": "2012-07-15T22:56:37+0000",
            "content": "I've got a fair amount of this automated now. It's still somewhat hackey though.\n\nBecause you need to apply the benchmark patch to get things working, I count on that checkout existing and being patched in a specific location. It drives the benchmark, but talks to a running Solr that is started from a checkout. I use git so that it's really cheap to flip through revs and run benchmarks.\n\nThe main driver is an ugly .sh script - it accepts a few params (name of the chart, where to write result files, location of alg file, date range of checkouts to run the alg against, and the interval to try between days).\n\nFor instance, you might say, run the indexing benchmark over the period of 2012-01-04 to 2012-07-15 and do it once for every 5 days.\n\nThis happens and the output of the benchmarks are dumped into a folder.\n\nThen I have a simple java cmd line app that will process the result folder. It takes a chart name, the location of results folder, and a list of named regexes - each regex pointing to the pertinent data to pull from the results file. The java app pulls out all the data, writes a csv file, and outputs a simple line chart.\n\nI don't know how cleaned up this will get, i won't post any of it for now - but I may get to the point of running some stuff locally automatically and pushing to a webserver with the charts etc, al la Lucene. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13414804",
            "date": "2012-07-15T22:58:16+0000",
            "content": "Attached an example generated chart. Would probably end up embedding that in html. The Lucene stuff uses a javascript charting lib, but I don't really want to deal with javascript - would rather stick to java when I can. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13416176",
            "date": "2012-07-17T13:36:58+0000",
            "content": "Way cool!\n\nIs there any chance that we could report MB/sec to/instead of docs/sec? I suspect that's a more meaningful number for comparisons. Or perhaps just count the bytes sent to Solr and post that as a footnote? Yeah, yeah, yeah, the analysis chain will change things.... but a \"doc\" is an even more variable thing....\n\nActually, I guess that this number could be counted once since the data set doesn't change that rapidly.\n\nFWIW "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13416237",
            "date": "2012-07-17T14:22:06+0000",
            "content": "It's a constant data set that the test runs on - simply a static dump of wikipedia articles (one doc per line file).\n\nEvery checkout the benchmark runs against uses exactly the same wikipedia docs.\n\nYou can currently compare with Lucene using change over time to some degree, since they both indicate indexing speed.\n\nI'm sure that we can figure mb/s the same way the Lucene stuff does - but it might be a hack unless you can do it purely in the benchmark package. My current system just extracts info from benchmark result files - so it can extract the result of any benchmark you can make - if thats a mb/s result, that's no problem. I think perhaps though, the Lucene, python driven stuff might even do some external stuff on it's own? I don't know for sure. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13416261",
            "date": "2012-07-17T14:59:57+0000",
            "content": "Are there strategies to keep the disk cache consistent across runs? Linux has a feature to clear it (poke a 0 somewhere in /proc). "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13416267",
            "date": "2012-07-17T15:04:15+0000",
            "content": "The python script does this on linux:\n\n\necho 3 > /proc/sys/vm/drop_caches\n\n\n\nand this on windows:\n\nfor /R %I in (*) do fsutil file setvaliddata %I %~zI\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13416287",
            "date": "2012-07-17T15:30:24+0000",
            "content": "Are there strategies to keep the disk cache consistent across runs?\n\nI have a warm phase that basically runs a slightly short version of the bench to try and be fair here. I was tossing the first first round (there are 2) and the warm phase so that things were on a more even playing field. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13416288",
            "date": "2012-07-17T15:30:38+0000",
            "content": "The python script does this on linux:\n\nGreat! I'll add this to my sh script. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429856",
            "date": "2012-08-07T03:43:38+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452185",
            "date": "2012-09-10T17:41:57+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13574842",
            "date": "2013-02-08T21:27:20+0000",
            "content": "Draft update to work with Solr 4.1  Will make comments about some of the issues. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13574844",
            "date": "2013-02-08T21:31:50+0000",
            "content": "Issues with latest patch:\n\n\tHaven't checked all tests\n\tThe schema.xml file that gets put into the standard example location is quite a bit different from the normal schema.xml.  I think the test should expect a separate directory structure.\n\tThe default behavior of completely consuming and not showing the Solr output makes it VERY hard to debug.  Conversely, producing all that output might impact the test slightly.  Ideally there'd be a switch to turn it on and off, and some way to integrate it into the make logging.\n\tThis doesn't work with SolrCloud yet.\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13574854",
            "date": "2013-02-08T21:49:01+0000",
            "content": "The schema.xml file that gets put into the standard example location is quite a bit different from the normal schema.xml. I think the test should expect a separate directory structure.\n\n+1\n\nand not showing the Solr output ...  Ideally there'd be a switch to turn it on and off,\n\nI thought there was an option for this for debugging - the start solr server call takes some arg that turns on output if I remember right (as part of the alg file). "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13574927",
            "date": "2013-02-08T22:59:47+0000",
            "content": "Thanks Mark, I'll check the alg.\n\nAny thoughts of getting this beast working with SolrCloud? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13576138",
            "date": "2013-02-11T21:26:15+0000",
            "content": "It depends - for real testing against a real cluster, it's probably just best to use the remote url feature I think. We might just want to build in some round robin action or something. For the internal option, we could run something like the solrcloud.sh script in the cloud-dev scripts to startup the vms just like the single node internal starts the example. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13576143",
            "date": "2013-02-11T21:29:07+0000",
            "content": "Of course, for the simple case, just using the Cloud solrj server gets us the load balancing. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13579575",
            "date": "2013-02-15T23:02:36+0000",
            "content": "Arguments I used / specific test I got running.  If you're running other tests, your mileage may vary \n\nClass: org.apache.lucene.benchmark.byTask.Benchmark\nArgument: /Users/username/solr-lucene-410-bench/lucene/benchmark/conf/solr/internal/streaming-vs-httpcommon.alg\nJVM: -Xmx512M "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13579582",
            "date": "2013-02-15T23:06:54+0000",
            "content": "Two other notes:\n\n\tHard coded file path in the alg file\n  solr-lucene-410-bench/lucene/benchmark/conf/solr/internal/streaming-vs-httpcommon.alg\n\tI only pulled in the first 100 docs\n  (by using the PDF instructions you can make the records line oriented, and use head -101 to get the first hundred records plus the header line)\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13762381",
            "date": "2013-09-09T22:20:51+0000",
            "content": "I've attached a patch that is updated to trunk. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13800030",
            "date": "2013-10-19T23:09:52+0000",
            "content": "Here is a patch that brings this up to date with trunk and hacks in some support for CloudSolrServer.\n\nBecause colons are special and are not working for the solr.zkhost property, I hacked it so that | is replaced with colon, but we should probably add some escaping or something. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14077775",
            "date": "2014-07-29T14:48:09+0000",
            "content": "Here's a patch which brings this in sync with trunk.\n\nI added the classpath of lucene's replicator because it has commons-logging which is required by HttpComponents. I expected that commons-logging (being a transitive dependency) should have been inside the solrj-lib directory but it isn't. \n\nIsn't dist/solrj-lib supposed to have all dependencies of solrj (including transitive ones)? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14077796",
            "date": "2014-07-29T15:04:00+0000",
            "content": "I've got some more local work on this too - probably a few little things, but most useful is proper support for batch indexing.\n\nI'll try and merge the two together if I get a chance. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14077835",
            "date": "2014-07-29T15:37:14+0000",
            "content": "\nI added the classpath of lucene's replicator because it has commons-logging which is required by HttpComponents. I expected that commons-logging (being a transitive dependency) should have been inside the solrj-lib directory but it isn't.\n\nIsn't dist/solrj-lib supposed to have all dependencies of solrj (including transitive ones)?\n\nOnly transitive dependencies that Solrj will use should be included.  \n\nI know very little about logging, but shouldn't jcl-over-slf4j-*.jar be used here?  I think its job is to intercept commons-logging calls and then slf4j will push them through wherever it's configured to go (log4j by default I think). "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14077850",
            "date": "2014-07-29T15:45:24+0000",
            "content": "I've got some more local work on this too - probably a few little things, but most useful is proper support for batch indexing.\n\nThat'd be great. I might have some time on improving this and setup local jobs to run these regularly.\n\nI know very little about logging, but shouldn't jcl-over-slf4j-*.jar be used here? I think its job is to intercept commons-logging calls and then slf4j will push them through wherever it's configured to go (log4j by default I think)\n\nHmm, you might be right. Perhaps the logging is not setup correctly. I'll check again and report back. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14078824",
            "date": "2014-07-30T02:51:34+0000",
            "content": "I know very little about logging, but shouldn't jcl-over-slf4j-*.jar be used here? I think its job is to intercept commons-logging calls and then slf4j will push them through wherever it's configured to go (log4j by default I think).\n\nI don't know if the commons-logging classes are actually used (indirectly) by SolrJ ... but if they are, this is a possibly sticky problem because SolrJ itself uses SLF4J.  Whether to use the commons-logging or jcl-over-slf4j jar depends on which slf4j binding the final application will use.  If the user binds slf4j to jcl with slf4j-jcl, then they need the actual commons-logging jar.  If the user chooses any other binding, jcl-over-slf4j is required.  We can't make that choice for the user, which I think means that the SolrJ documentation must explain these details. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14505616",
            "date": "2015-04-21T19:57:02+0000",
            "content": "Bringing this patch in sync with trunk again.\n\n\n\tThe start and stop solr tasks use the bin/solr scripts\n\tThere are still plenty of references to SolrServer instead of SolrClient which needs to be cleaned up\n\tQuery.toString needs to be removed \n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14517221",
            "date": "2015-04-28T15:38:40+0000",
            "content": "I have a bunch of other improvements, but its in a pretty old checkout (before 4x became 5x). I'll try and merge it up to this sometime soon. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15743636",
            "date": "2016-12-13T00:33:41+0000",
            "content": "Patch to trunk and with the latest changes I could find locally.\n\nIt's still a little rough around the edges, but I'd like to clean up a bit more and commit this. It's harmless and simple and valuable and keeping it current will allow us to use this for more accurately benchmarking changes over time much more easily. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15743971",
            "date": "2016-12-13T03:01:07+0000",
            "content": "So, towards the end of committing soon, here is a new patch that integrates as a new Solr module that doesn't touch the Lucene benchmark module at all.\n\nStill some work to do I'm sure, but the basics are working. "
        },
        {
            "author": "Mikhail Khludnev",
            "id": "comment-15744918",
            "date": "2016-12-13T11:25:06+0000",
            "content": "+1. beside of:\n\n\tthe same package org.apache.lucene.benchmark.byTask.tasks is put to a new module. It's usually fine, but I've remember some discussions about the issues either with javadoc or java 9 modules (my memories are vague here);\n\tit won't work under windows, but either noone need it and/or it's a separate ticket.\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15744968",
            "date": "2016-12-13T11:55:25+0000",
            "content": "I can probably get to a solr package in the next iteration. The lucene package was just simpler out of the gate.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15746388",
            "date": "2016-12-13T21:53:30+0000",
            "content": "This is very close to committable. Precommit seems to be pushed over the edge on memory for src validation with the groovy task though. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15746408",
            "date": "2016-12-13T22:01:30+0000",
            "content": "Found the issue with precommit. I plan to commit sometime tomorrow. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15788487",
            "date": "2016-12-30T22:46:29+0000",
            "content": "I'm mainly waiting on SOLR-9867 to commit this. "
        },
        {
            "author": "Mikhail Khludnev",
            "id": "comment-15996339",
            "date": "2017-05-04T08:24:33+0000",
            "content": "SOLR-9867 is done.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15996763",
            "date": "2017-05-04T14:00:29+0000",
            "content": "Thanks a lot Mikhail Khludnev! I'll get this in soon then. "
        },
        {
            "author": "Mikhail Khludnev",
            "id": "comment-16055355",
            "date": "2017-06-20T08:34:57+0000",
            "content": "Mark Miller, how it goes?  "
        }
    ]
}