{
    "id": "SOLR-10238",
    "title": "Remove LatLonType in 7.0; replaced by LatLonPointSpatialField",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "spatial"
        ],
        "type": "Task",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Won't Fix",
        "status": "Closed"
    },
    "description": "LatLonPointSpatialField is about to land in SOLR-10039.  This field is superior to LatLonType.  In 7.0, lets remove LatLonType and mark it deprecated in 6.x?  Or must this wait yet another release cycle?\n\nFYI RPT fields still have life in them due to their ability to index non-point shapes, handle custom (user coded ) shapes, and heatmaps, and are not limited to a lat-lon coordinate space.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-07T02:23:48+0000",
            "content": "FYI Tomás Fernández Löbbe since you've been working on numerics -> Points in Solr. ",
            "author": "David Smiley",
            "id": "comment-15898617"
        },
        {
            "date": "2017-03-07T03:04:59+0000",
            "content": "I think it would be too soon. AFAIK we try to keep index back compatibility the of one full major version (same as Lucene), so I think we should mark it as deprecated in 6.x and 7.x (maybe also remove it from all example schemas) and remove in 8. ",
            "author": "Tomás Fernández Löbbe",
            "id": "comment-15898652"
        },
        {
            "date": "2017-05-23T18:22:34+0000",
            "content": "I think it would be too soon. AFAIK we try to keep index back compatibility ...\n\nyeah, that's also my concern – people who have built indexes with 6.x should be able to use them in 7.0,which means keeping all the solr FieldType's around.\n\nBut we can/should certainly remove any mention of them from the master ref guide and sample schema (looks like it's still mentioned in example/files and example/example-DIH) ",
            "author": "Hoss Man",
            "id": "comment-16021592"
        },
        {
            "date": "2017-05-23T18:29:18+0000",
            "content": "Marking as won't-fix.  We can outright remove this and other spatial fields I deprecated today in the future for 8.0.\n\nRE example: I was kinda hoping Alexandre Rafalovitch would (eventually) massively slim down our example configs to not even have what aren't being demonstrated in the sample in question.  But we needn't wait for that. ",
            "author": "David Smiley",
            "id": "comment-16021606"
        }
    ]
}