{
    "id": "SOLR-3047",
    "title": "DisMaxQParserPlugin drops my field in the phrase field list (pf) if it uses KeywordTokenizer instead of StandardTokenizer or Whitespace",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Has this got something to do with the minimum clause = 2 part in the code? It drops it without warning - IMO it should error out if the field isn't compatible.\n\nIf it is on purpose - i don't see why. I split with the ngram token filter, so there is def more than 1 clause in the indexed field.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13199076",
            "date": "2012-02-02T18:44:27+0000",
            "content": "I can't make heads of tails of this bug report ... at a minimum we need to see...\n\n\n\twhat the full request params look like for an example request\n\twhat the debugQuery output looks like for an example request (including the echoParams and query parsing info\n\thow the requesthandler in use is configured\n\tthe fieled and filedtype information for every field used by dismax (ie: mentioned in the request params or request handler defaults)\n\n "
        },
        {
            "author": "Antony Stubbs",
            "id": "comment-13199111",
            "date": "2012-02-02T19:12:43+0000",
            "content": "Ok, I'll try to reproduce it in a simple setup. "
        },
        {
            "author": "Antony Stubbs",
            "id": "comment-13199119",
            "date": "2012-02-02T19:17:15+0000",
            "content": "Hoss, is there a way I can send you the example privately? "
        },
        {
            "author": "Antony Stubbs",
            "id": "comment-13199125",
            "date": "2012-02-02T19:21:06+0000",
            "content": "It just seems that if the field tokeniser only produces a single token (as keywordtokenizer produces), it gets silently dropped from phrase list queries (even though multiple tokens are produced by the ngramfilter in the end). If I just change the tokenizer to standard, it works as expected. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13200130",
            "date": "2012-02-03T22:57:13+0000",
            "content": "Hoss, is there a way I can send you the example privately?\n\nI'd rather not\n\nif you can't share the configs you are using, can't you at least add a quick example of something demonstrating your problem to the example schemx.xml and post that?\n\nI just tried this example from Solr 3.5.0 (alphaNameSort uses KeywordTokenizer) and got exactly what i expected...\n\n\nhttp://localhost:8983/solr/select?debugQuery=true&defType=dismax&qf=name&pf=alphaNameSort&q=foo%20bar%20baz\n\n+((DisjunctionMaxQuery((name:foo)) \n   DisjunctionMaxQuery((name:bar)) \n   DisjunctionMaxQuery((name:baz))\n  )~3\n ) \n DisjunctionMaxQuery((alphaNameSort:foobarbaz))\n\n "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15729211",
            "date": "2016-12-07T16:42:28+0000",
            "content": "Marking as Cannot Reproduce since it's old, there aren't any reproducible steps or examples of the problem, and Hoss' investigations show it works as expected. "
        }
    ]
}