{
    "id": "SOLR-5405",
    "title": "Cloud graph view not usable by color-blind users - request small tweak",
    "details": {
        "affect_versions": "4.5",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Currently, the cloud view status is impossible to see easily on the graph screen if you are color blind. (On of my coworkers.)\n\nWould it be possible to put \" (X)\" after the IP of the node where X is [LARDFG] for the states?",
    "attachments": {
        "SOLR-5405-radial.png": "https://issues.apache.org/jira/secure/attachment/12872853/SOLR-5405-radial.png",
        "SOLR-5405-circle-triangleUp-triangleDown-diamond-square-dashedSquare.png": "https://issues.apache.org/jira/secure/attachment/12865421/SOLR-5405-circle-triangleUp-triangleDown-diamond-square-dashedSquare.png",
        "SOLR-5405.patch": "https://issues.apache.org/jira/secure/attachment/12865422/SOLR-5405.patch",
        "SOLR-5405-graph.png": "https://issues.apache.org/jira/secure/attachment/12872854/SOLR-5405-graph.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13809728",
            "date": "2013-10-30T22:56:08+0000",
            "content": "Nathan, if it's literally that easy to make the UI work for color blinds .. definitely doing this \n\nI guess we could use colors which are more different than they are right now, but adding a mark like the one you suggest is fine too.\n\nAny other suggestions? Happy to take them in .. the only thing i know (from hearing) is the typical problem with green/red .. but that's pretty much it, so input on that very much welcome  "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13809762",
            "date": "2013-10-30T23:42:39+0000",
            "content": "I passed inquiry along, and will be sure to submit any other easy tweaks to make it more accessible.  "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13809770",
            "date": "2013-10-30T23:54:09+0000",
            "content": "Response:\n\nI haven't.  However, it's notable that I've come to realize that I tend to just tune out information carried in color.  There are some good resources around (such as http://www.mollietaylor.com/2012/10/color-blindness-and-palette-choice.html and http://colorschemedesigner.com) on how to choose colors/shades in a way that avoids problems for colorblind folks like me.  But I actually like using color in combination with a secondary mechanism (like the X you mentioned) which I think works really well.\n\nJust FYI, my biggest problems are when you have certain color/shade combinations together.  For example, dark green is hard to differentiate from brown and red.  Light green is hard to distinguish from yellow.  And medium green is hard to separate from orange.   \n\n\nOn Wed, Oct 30, 2013 at 4:33 PM, Nathan Neulinger <nneul@neulinger.org> wrote:\n\n    Noticed anyplace else in the UI where colors are being used for information content that isn't otherwise represented?\n\n    – Nathan "
        },
        {
            "author": "Curtis Schneider",
            "id": "comment-15987146",
            "date": "2017-04-27T17:51:24+0000",
            "content": "Hello all,\n\nI'm a Solr user with mild to moderate color blindness, both red-green and blue-yellow.  I can't trust my vision to make use of the Cloud Graph admin page in Solr, I end up asking a co-worker to point out anything that isn't green or using Chrome's Inspect Element tool to read the class names for each of the nodes.  @Nathan: I have not noticed anywhere else in the Admin UI that this is a problem, for me.\n\nA few notes:\n\nThe text for each of the nodes is very fine.  There simply aren't enough pixels for me to be able to determine what color is being displayed.\n\nThe color palette used is low in contrast.  As a fallback I can sometimes use contrast in shades when ability to discern color fails.  I am unable to do this with the color palette used for the Cloud Graph page.\n\nWhat works for one color blind user may not work for another color blind user.  Depending on severity and type of color blindness, a color palette that works for some may be of no benefit to others.\n\nA potential solution:\nShapes\nColor is a valuable tool to quickly display information to users but it doesn't work for everyone.  Adding a second dimension to the key would benefit all users, not just the color blind.  A common solution is to use shapes.  Shape representations for \"Active\", \"Recovering\", \"Down\", \"Recovery Failed\", and \"Gone\" could be filled by Square, Diamond, Triangle, Circle, and \"X\".  This would still allow use of dark fill to identify Leaders.\n\nAdding the text representation of the state after each node IP is another option but may clutter the display in larger Solr clusters.  \nNathan's initial suggestion of using a single letter to represent state sounds awesome.\n\nThanks in advance for any time put toward a resolution,\nCurtis "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15987182",
            "date": "2017-04-27T18:08:09+0000",
            "content": "Curtis Schneider Which version of Solr is that for? The original issue was reported against Solr 4.5. We do not update that version anymore and we have the new implementation of the Admin UI in Solr 6.\n\nCould you please confirm whether the same issue is still happening in 6.  "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-15987201",
            "date": "2017-04-27T18:14:14+0000",
            "content": "Good idea, Curtis Schneider.  I'm not color-blind, but I think it's important for our interface to accommodate those who are.\n\nA little bikeshedding - different shape->status mappings that I think are slightly better:\n\ncircle - Active\nsquare - Recovering\ntriangle (pointing downward) - Down\ndiamond - Recovery Failed\nX - Gone\n\nRationale: Because the current graph uses circles, I think that continuing that shape when everything's OK will be less of a surprise for upgrading users.  An inverted triangle is a natural \"down\" indicator, and a diamond is another \"pointy\" shape ... tying it together with the triangle, which also indicates a problem state. "
        },
        {
            "author": "Curtis Schneider",
            "id": "comment-15987423",
            "date": "2017-04-27T19:45:46+0000",
            "content": "Alexandre Rafalovitch I noticed this on our Solr 4.7 cluster.  After looking at some of the documentation and screenshots for Solr 6.6 this doesn't appear to have been resolved.  The UI for the Cloud Graph page appears relatively unchanged.\n\nShawn Heisey Thanks for the support and suggested shape->status mappings. "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-15987577",
            "date": "2017-04-27T20:19:10+0000",
            "content": "How about\n\n\n\tactive circle (existing behaviour)\n\trecovering triangle-point-up (since hopefully things are on the way back up)\n\tdown triangle-point-down (since things are (on the way) down)\n\trecovery_failed diamond (things are neither up nor down)\n\tinactive square\n\tgone dashed-through square\n\n\n\nor if a picture is worth more than words, I'm attaching a partial screenshot and a cobbled together patch. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-15987669",
            "date": "2017-04-27T21:01:41+0000",
            "content": "Christine Poerschke, I think your shape mappings are overall better than mine, but that visually speaking, the \"X\" is a better shape for \"Gone\".  Making it red sounds like a good idea to me, though it would require finding another color for \"Recovery Failed\".  I've always thought the light grey for \"Gone\" was too hard to see.  Once we have shapes, I think we can do anything we like with the colors.\n\nIn the \"perhaps silly\" department: Use a boxed \"X\" like the one that appears on Family Feud when an incorrect answer is given.\n\nhttp://endlessgames.com/wp-content/uploads/slideshows/family-fued-strikeout-X.png "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15987676",
            "date": "2017-04-27T21:04:31+0000",
            "content": "This was improved somewhat in SOLR-10147 which will be released in 6.6. See this image:\n\nLeaders are bold, inactive strike-through, recovering italic etc. Guess we can still improve with different shapes as well as font style "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-15988549",
            "date": "2017-04-28T09:54:23+0000",
            "content": "... Leaders are bold, inactive strike-through, recovering italic etc. ...\n\nNice detail, thanks Jan! Until you mentioned it I hadn't actually noticed the bold and italic differentiation. Could we perhaps include the information in the legend e.g. Leader (bold) and Recovering (italic)  and Recovery Failed (italic) or something equivalent. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15988822",
            "date": "2017-04-28T13:48:30+0000",
            "content": "Feel free to use this JIRA to add further accessability improvements, like the ones you propose, and/or the different shapes etc  "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-15988945",
            "date": "2017-04-28T14:48:48+0000",
            "content": "If we have highly effective visual cues that don't rely on color, like good shapes and font styles, then I believe we can do just about anything when it comes to the color choices we make, and we can get rid of that terrible light grey.\n\nI hope you aren't perturbed by that, Curtis Schneider.  I very much want you to be comfortable with the interface, but I fear that choosing colors that work for you would make the interface less appealing for others.\n\nWith that in mind, I suggest purple for Recovery Failed and red for Gone.  We could use blue for Recovering – yellow is almost as hard to read as light grey.  I'm ambivalent about orange for Down.  Brown might be a better choice, but I don't actually have a problem with orange. "
        },
        {
            "author": "Curtis Schneider",
            "id": "comment-15989220",
            "date": "2017-04-28T17:48:26+0000",
            "content": "Christine Poerschke I like your suggested shape mappings (especially with the added modification from Shawn) as they feel like they flow from one state to the next.  One minor note, reusing the same shape in a different orientation (and I like your suggested use of triangles) may not work as well for the Cloud Graph (Radial) page.  I consider this a minor note as the radial graph has always appeared (to me) to be about aesthetics, rather than readability.\n\nJan Høydahl Thank you for the image from the upcoming release, I hadn't thought of font formatting.  These changes look awesome, between the contrast in the colors and the added formatting changes this improves accessibility for me, greatly.\n\nShawn Heisey Not at all.  I would mention that the Green->Yellow->Orange->Red color flow seems to be following a stoplight theme. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-15989460",
            "date": "2017-04-28T21:08:19+0000",
            "content": "I did notice the stoplight theme ... but in my opinion yellow is a TERRIBLE color for any web-based text on typical background colors, so I don't think it works very well. "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-16047826",
            "date": "2017-06-13T12:45:57+0000",
            "content": "Found a way to replace the circles with (various) polygons, draft patch and example snapshots attached.\n\n... reusing the same shape in a different orientation (and I like your suggested use of triangles) may not work as well for the Cloud Graph (Radial) page. ...\n\nGood point, so looks like we need alternatives for the triangles and perhaps also a replacement for the square or the diamond? "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-16052117",
            "date": "2017-06-16T16:42:18+0000",
            "content": "Potentially controversial idea, could we remove the radial cloud graph (rather than restrict ourselves to shapes that work for both the regular and the radial cloud graph)? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-16052208",
            "date": "2017-06-16T18:10:02+0000",
            "content": "Christine:\n\nWell, I think it'd be a great t-shirt if we created, say, a 1,600 replica collection and took a screen shot of the radial view \n\nI did see one real use for it though. I actually did have a client with 1,600 replicas and bringing them all up took quite some time. You could see whether the entire cluster was coming up by the color change even if you couldn't read the individual ones, kind of a pie graph. \n\nA widget that was a pie graph showing this information would be just as useful if someone feels ambitious. The OP was about people who have trouble distinguishing certain colors, so we should choose colors carefully for widgets too. Or label the widget. Or even just a summary with counts of nodes in each state.\n\nThat said, improvements to the admin UI of being able to list nodes in various states would serve this narrow purpose better and the color wouldn't matter as much. I think there's some of that in already, but don't remember the status. I'd like to see things like \"all nodes in a collection\" or \"all nodes in the cluster\" that\n> aren't active\n> are down\n> are recovering\n\n\nand the like. The tree view is cumbersome to use for answering those kinds of questions today even if the color/shape issue is addressed. A graph (not radial) view restricted to nodes satisfying the criteria above would actually be very useful.\n\nSo net-net. I have no objection to removing the radial view. It's actually a bit awkward to use for small clusters and I've only ever seen one narrow use for it in larger clusters, a use that could be addressed more usefully by filtering the nodes shown in the graph view or even just listing them. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-16052297",
            "date": "2017-06-16T19:17:26+0000",
            "content": "I've experienced the same thing. On a larger cluster it makes it easier to quickly see cluster health. It would be nice to have some sort of better sortable table or searchable view before we removed it I think. "
        },
        {
            "author": "Christine Poerschke",
            "id": "comment-16568616",
            "date": "2018-08-03T18:49:18+0000",
            "content": "Potentially controversial idea, could we remove the radial cloud graph ...\n\ncross-referencing links:\n\n\tmailing list threads: https://markmail.org/thread/xeb2otvdh7ei2em3 and https://markmail.org/thread/lx4a7waftjp2ino2\n\trecent ticket: SOLR-12620\n\n "
        }
    ]
}