{
    "id": "SOLR-4438",
    "title": "Developer Curb Appeal: Cloud Admin UI: Need legend, and maybe mouse-over",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [
            "4.3"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "It's nice that we display a cloud view showing a graphical representation of the cluster.\n\nHowever, it'd be nice if we included a Legend to explain what the colors mean.\n\nSome reasons the current system might not be as obvious as you'd think:\n\n\tThe colors don't look exactly Green, Yellow, Red, and Gray on some monitors\n\tI'm told that the green=good, red=bad, etc isn't universal in all countries.\n\tSome people can't see the colors.  Of course a color code legend won't be of much help to a color blind person.  Ideally we might also put a textual status in parenthesis to the right of the IP address.\n\n\n\nAdditionally it'd be nice to have some type of mouse-over with a bit more summary info, if known. (although that doesn't help tablet users).\n\nWe could consider changing the click behavior to show the mouse-over dialog box, and then let them click in there to open a new window with that other node's details.\n\nIt would also be nice to indicate which node we're currently on.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13576239",
            "date": "2013-02-12T00:15:37+0000",
            "content": "A legend has already been added for 4.2. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13632783",
            "date": "2013-04-16T12:00:19+0000",
            "content": "The legend Miller's Mark mentioned is SOLR-3915 which is already done, yes \n\nBennett's Mark, this ticket includes a whole lot of things .. can we split them up?\n\n\tThe legend is already done\n\tthe indication on which node you're currently is good idea i think\n\twhat information would you like to see in the summary-box? do we even have more info than we show right now?\n\n "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13633355",
            "date": "2013-04-16T21:01:40+0000",
            "content": "Will come up with specific info list, and then I'll split the bug as well. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13643013",
            "date": "2013-04-26T16:44:57+0000",
            "content": "Breaking out subtask to different bug per Stefan's comment "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13643023",
            "date": "2013-04-26T16:57:37+0000",
            "content": "Split out details for mouse-over node info, per Stefan "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13643111",
            "date": "2013-04-26T18:31:49+0000",
            "content": "Two issues split into new Jira bugs, and linked to bug that fixed legend "
        }
    ]
}