{
    "id": "SOLR-1110",
    "title": "Investigate Sorting on Trie field types with DistributedSearch",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "search"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Need to write tests to determine if Trie sorting will work correctly with DistributedSearch, given the usage of Investigate Sorting on Trie field types with DistributedSearch. If not, we need to figure out how to fix this.\n\nRefer to Uwe Schindler's comment on SOLR-940:\n\n\nOne note to sorting:\nI am not really sure, if sorting works with Solr. The Sortfield returned by TrieUtils.getSortField contains an own parser (new feature in Lucene 2.9). When looking through the solr code, searching for SortField in trunk, I noticed, that QueryComponent has own comparators and FieldCache code (duplicating the Lucene code), and ignoring the parser given in SortField (the parser is not passed to FieldCache.getInts() & Co.).\n\nIf this is the case, it will simply not work.\n\nOK. If distributed search does not work, the problems are bigger: The problem is not the comparator alone, the problem is the FieldCache. The distributed search should fill the values into FieldCache and then let the comparator do the work. Comparing lucenes code with the solr ones shows, that there are some parts of LUCENE-1478 missing. The Comparators use the default parser instead of the one given in SortField.getParser() to parse the values (when retrieving FieldCache.getInts() & Co).\n\nI am not really sure, why Solr needs to duplicate the sorting code from Lucene? Maybe this is no longer needed? In this case, everything would be ok when removed.",
    "attachments": {
        "SOLR-1110.patch": "https://issues.apache.org/jira/secure/attachment/12406531/SOLR-1110.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12703161",
            "date": "2009-04-27T15:10:15+0000",
            "content": "test+fix, all test pass "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12703188",
            "date": "2009-04-27T16:07:09+0000",
            "content": "Committed revision 769040.\n\nThanks Mark! "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775713",
            "date": "2009-11-10T15:52:01+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}