{
    "id": "SOLR-6818",
    "title": "Delegating collector in Analytics API returns not right docNum in collect method",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.2",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Delegating collector in Analytics API returns not right docNum in collect method.\nI have used Analytics API in my solr. I created ResourceAnalyticsCollector which extends DelegatingCollector class. In that class there is collect(int docNum) method. This is the continue of https://issues.apache.org/jira/browse/SOLR-6802 issue. The problem that I found that the docNum value is repeated in collect method of DelegatingCollector.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-04T09:43:52+0000",
            "author": "Alan Woodward",
            "content": "docNum is per-segment.  If you want to get a global value, you need to add this.docBase. ",
            "id": "comment-14234064"
        },
        {
            "date": "2014-12-04T11:23:46+0000",
            "author": "Daulet Kadirbekov",
            "content": "docNum is per-segment. If you want to get a global value, you need to add this.docBase. ",
            "id": "comment-14234134"
        },
        {
            "date": "2014-12-04T14:10:14+0000",
            "author": "Joel Bernstein",
            "content": "Daulet,\n\nYour initial question was answered by Alan. I also took a quick look at your post on stackoverflow:\n\nhttp://stackoverflow.com/questions/27164634/solr-analyticsquery-api-returns-analytics-by-documents-that-dont-match-query\n\nThere are also other problems with the code you posted. You actually want to use the segment level docId to collect the analytics. But you don't want to use the searcher. You'll want to review the API's for the DocValues and FieldCache which allow you to access fields much more efficiently then going through the searcher. \n\n\n\n\n\n\n ",
            "id": "comment-14234219"
        },
        {
            "date": "2014-12-05T09:26:23+0000",
            "author": "Daulet Kadirbekov",
            "content": "Joel,\n\nI have solved this problem with getting document by Document doc = searcher.doc(docNum + this.docBase). It works great, but you are saying that there are better way to get document fields. Could you give example, or link to example of how to get document fields by cache? I have googled it, but didn't found anything. ",
            "id": "comment-14235301"
        }
    ]
}