{
    "id": "SOLR-11287",
    "title": "Sub-shards by SPLITSHARD loses data on restarting SOLR",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "5.5.1",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "We are running SOLR 5.5.1 with 4 nodes (1 shard per node). We are in the process of splitting the 4 shards into 8 shards.\n\nThe SPLITSHARD collections API works great - it does create the sub-shards and activates sub-shards, inactivates the parent shard upon completion. The row count compard with parent shard vs sub-shards are matching. However, the data in sub-shards doesn't seem to be persistent in our case.\n\nA restart of SOLR leaves the sub-shards with 0 documents with their data directory sizes getting reduced from 40+ GB to 71KB.\n\nIf I'm missing any other steps to be followed after SPLITSHARD to make the data in sub-shards persistent, please let me know. Otherwise, I feel this may be a bug in v5.5.1.\n\nNote: I was able to manually set the states of parent to \"active\" and children with 0 documents as \"inactive\" by setting /collections/\n{collection}\n/state.json in zookeeper, to get back the lost data.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-08-25T12:51:00+0000",
            "content": "I figured out when this issue happens, by observing the patterns with a small set of data.\n\nSPLITSHARD issues a soft-commit (with some of the files still not fully written to disk). If I restart SOLR without issuing an explicit <commit />, the index directory is not fully written and the process is killed. During next restart, the incomplete index is set to 0 records and cleaned up.\n\nI think we should update the documentations to let users know that they need to issue a hard <commit /> immediately after a SPLITSHARD operation. ",
            "author": "Vannia Rajan",
            "id": "comment-16141571"
        },
        {
            "date": "2017-08-25T15:39:56+0000",
            "content": "Hmm, SOLR-4997 indicates that this was fixed in Solr 4.4. Do the Solr logs show a commit happening on the sub-shards? If this has crept back in somehow we need to fix it.\n\nCould you try this with the 7x code line by any chance?\n\nAbout the docs: The way the docs are created before the asciidoc changes makes it very hard to change old reference material, and there won't be any fixes for the 5x code line. ",
            "author": "Erick Erickson",
            "id": "comment-16141780"
        },
        {
            "date": "2017-09-05T16:46:28+0000",
            "content": "Closing as duplicate of SOLR-4997, we can reopen if necessary ",
            "author": "Erick Erickson",
            "id": "comment-16153963"
        }
    ]
}