{
    "id": "SOLR-10533",
    "title": "Improve checks for which fields can be returned",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I tried using DocBasedVersionConstraintsProcessorFactory on a field which was defined as :\n\n\n<field name=\"myVersionField\" type=\"long\" indexed=\"false\" stored=\"false\"/>\n\n\n\nThe long fieldType has docValues enabled and since useDocValuesAsStored is true by default in the latest schema I can retrieve this field.\n\nBut when I start Solr with this update processor I get the following error\n\n\n Caused by: field myVersionField must be defined in schema, be stored, and be single valued.\n\n\n\nHere's the following check in the update processor where the error originates from:\n\n\n    if (userVersionField == null || !userVersionField.stored() || userVersionField.multiValued()) {\n      throw new SolrException(SERVER_ERROR,\n          \"field \" + versionField + \" must be defined in schema, be stored, and be single valued.\");\n    }\n\n\n\nWe should improve the condition to also check if the field docValues is true and useDocValuesAsStored is true then don't throw this error.\n\nHoss pointed out in an offline discussion that this issue could be there in other places in the codebase so keep this issue broad and not just tackle DocBasedVersionConstraintsProcessorFactory.",
    "attachments": {
        "SOLR-10533.patch": "https://issues.apache.org/jira/secure/attachment/12892628/SOLR-10533.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-17T14:08:11+0000",
            "content": "Putting up the first rough draft to get it going. \n\nKindly mind, there are no tests are written, nor I have verified I covered every aspect where check on stored() is applicable or field can be returned. there can very well be instances, like that. \n\nAlso I need to make sure, the changes I made, the new check I introduced makes sense there or not too. ",
            "author": "Amrit Sarkar",
            "id": "comment-16207688"
        },
        {
            "date": "2017-10-22T11:39:37+0000",
            "content": "Removed all schema level stored changes as not sure what kind of changes needs to be done at the time of creating Field objects.\n\nKept the relevant ones and writing test cases for the same. ",
            "author": "Amrit Sarkar",
            "id": "comment-16214287"
        },
        {
            "date": "2017-10-22T15:49:41+0000",
            "content": "Added test for CSVResponseWriter. For rest of the test cases, either a new solrconfig.xml or knowledge of the entire component is needed like MLPParser. Varun Thacker you can review it and let me know if we need to add test-cases, it is pretty straightforward.\n\nAlso, I need some time to understand either we need to make the changes in schema package, field and fieldType objects creation and usage. ",
            "author": "Amrit Sarkar",
            "id": "comment-16214358"
        }
    ]
}