{
    "id": "SOLR-7855",
    "title": "OverseerCollectionProcessor: separate general task management from collection message handling",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.4",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "While working on SOLR-7789, I realized it would be easier if I split up the OverseerCollectionProcessor into two parts:\n\n1) General handling of tasks (work queues, etc)\n2) Processing a collection handler request\n\nI haven't decided whether the ConfigSet should have its own processor, i.e. OverseerConfigSetProcessor or reuse at least the thread for the OverseerCollectionProcessor, but in either case this refactoring will be helpful.  That is, if the ConfigSet processing has its own processing, I can reuse the general handling of tasks part.  If the ConfigSet processing reuses the OverseerCollectionProcessing thread, I won't complicate the implementation with ConfigSet operations.",
    "attachments": {
        "SOLR-7855.patch": "https://issues.apache.org/jira/secure/attachment/12748561/SOLR-7855.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-03T23:36:39+0000",
            "author": "Gregory Chanan",
            "content": "Here's a patch.  Review request: https://reviews.apache.org/r/37057/.\n\nSplits up the OverseerCollectionProcessor as follows:\n\n\n\tDefines an interface OverseerMessageHandler for handling messages sent to the overseer queues\n\tOverseerCollectionMessageHandler handles collection related messages (i.e. this is just the message handling code from the old OverseerCollectionProcessor code)\n\tOverseerProcessor is the task management related code from the old OverseerCollectionProcessor\n\tOverseerProcessor.OverseerMessageHandlerSelector is an interface for selecting an OverseerMessageHandler for an incoming message.  This would allows us to handle multiple types of message (e.g. Collection / ConfigSet) with the same OverseerProcessor\n\tOverseerCollectionProcessor is now just an OverseerProcessor with an OverseerMessageHandlerSelector that always selects an OverseerCollectionMessageHandler for processing.\n\n\n\nOne complication is with prioritizeOverseerNodes, which doesn't really fit into this new model or the existing model (it doesn't really have anything to do directly with collections AFAICT, though the CollectionProcessor handles messages about it).  This should probably be moved somewhere else and is a pain because both the OverseerProcessor (before running the task loop) and the CollectionMessageHandler (to respond to ADDROLE ops) call it.  For now I moved the code to an OverseerNodePrioritizer that is passed into both those objects, though I'm open for suggestions there.\n\nOtherwise, just some renaming of imports from OverseerCollectionProcessor to OverseerCollectionMessageHandler.\n\nI was originally going to put all the new classes in the cloud.overseer package but there are some package-level info that is needed and for some reason, all the overseer related code isn't there.  I'm okay with moving everything there if that's what we want to do.\n\nThis patch should have no effect on end users. ",
            "id": "comment-14652791"
        },
        {
            "date": "2015-08-04T02:34:05+0000",
            "author": "Gregory Chanan",
            "content": "v2 of the patch, only minor changes mainly around renaming imports for tests. ",
            "id": "comment-14652973"
        },
        {
            "date": "2015-08-04T16:01:50+0000",
            "author": "Mark Miller",
            "content": "+1, looks good to me.\n\nMinor suggestions:\n\nAssign.java - remove unused imports rather than refactor\nOverseerProcessor - new file, remove unused imports\nOvrseerCollectionMessageHandler -new file, remove unused imports\n\nOverseeerMessageHandlerSelector - add light class doc\nOverseerCollectionProcessor - add light class doc\nOverseerProcessor - add light class doc ",
            "id": "comment-14653857"
        },
        {
            "date": "2015-08-04T16:22:23+0000",
            "author": "Mark Miller",
            "content": "(it doesn't really have anything to do directly with collections AFAICT, though the CollectionProcessor handles messages about it). \n\nSeems like someone was lazy when they added it. Don't know what to tell you now. At least it's more isolated with this patch.\n\npackage-level info \n\nWe can open that up and add internal comment notes or something if you think that makes sense. A lot of this is probably fairly arbitrary when compared to the rest of the code.\n\nA lot of cloud code has already kind of cluttered up random packages as it was added for various easy at the time reasons - moving towards something nicer makes sense to me. ",
            "id": "comment-14653905"
        },
        {
            "date": "2015-08-04T22:09:39+0000",
            "author": "Gregory Chanan",
            "content": "Thanks for the feedback Mark.\n\nA lot of cloud code has already kind of cluttered up random packages as it was added for various easy at the time reasons - moving towards something nicer makes sense to me.\n\nI think the question is whether we move all the overseer related code to the cloud.overseer package or not.  Now seemed like a good time because we are moving around a bunch of code anyway (which complicates the history to a certain extent).  So if we can do it at one time, that's ideal.  I'll investigate how feasible that is. ",
            "id": "comment-14654439"
        },
        {
            "date": "2015-08-04T23:47:11+0000",
            "author": "Mark Miller",
            "content": "I think the question is whether we move all the overseer related code to the cloud.overseer package or not. \n\nI think it goes without saying this is how it should be. We have a bunch of Overseer* classes in a cloud package instead of an existing cloud.overseer package.\n\nTo be more specific on my complaint (a lot of which I'm am the cause of), a bunch of classes are jammed in the core and cloud packages that could surely be broken up into packages in a more useful fashion. The CollectionsOverseerProcesser is just one example where little thought was used. Seems like a good thing to fix this in this case. ",
            "id": "comment-14654542"
        },
        {
            "date": "2015-08-04T23:51:27+0000",
            "author": "Gregory Chanan",
            "content": "I think it goes without saying this is how it should be\n\nI should have said the question is \"for this patch\" – I agree with how things should be. ",
            "id": "comment-14654545"
        },
        {
            "date": "2015-08-05T00:33:28+0000",
            "author": "Mark Miller",
            "content": "Then why not just move it since the patch adds even more Overseer* classes in an odd spot?\n\nEither way, but seems like a gimme to me. ",
            "id": "comment-14654589"
        },
        {
            "date": "2015-08-05T01:29:54+0000",
            "author": "Mark Miller",
            "content": "Actually, skip it. I'll make another issue and move all the overseer classes to the proper package. ",
            "id": "comment-14654648"
        },
        {
            "date": "2015-08-06T01:17:20+0000",
            "author": "Gregory Chanan",
            "content": "Here's a version with Mark's comments addressed and rebased to trunk (there were some changes to OverseerCollectionProcessor).  I'll commit this soon unless I hear objections.\n\nI spent some time moving the packages, but I got stuck at the ZkController.  Let's move that discussion to the linked jira. ",
            "id": "comment-14659300"
        },
        {
            "date": "2015-08-06T06:07:34+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1694406 from gchanan@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1694406 ]\n\nSOLR-7855: OverseerCollectionProcessor: separate general task management from collection message handling ",
            "id": "comment-14659545"
        },
        {
            "date": "2015-08-06T06:08:15+0000",
            "author": "Gregory Chanan",
            "content": "Committed to trunk.  I tried to merge to branch_5x, but SOLR-7766 not being there causes a bunch of conflicts.  Going to wait until that is committed before proceeding. ",
            "id": "comment-14659546"
        },
        {
            "date": "2015-08-08T19:00:36+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Gregory Chanan, SOLR-7766 is now done, any plans to commit this soon to branch_5x? Trying to avoid conflicts with SOLR-7859.. ",
            "id": "comment-14663117"
        },
        {
            "date": "2015-08-10T04:03:17+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1694952 from gchanan@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1694952 ]\n\nSOLR-7855: OverseerCollectionProcessor: separate general task management from collection message handling ",
            "id": "comment-14679531"
        },
        {
            "date": "2015-08-10T04:05:17+0000",
            "author": "Gregory Chanan",
            "content": "Committed to trunk and 5.4. ",
            "id": "comment-14679533"
        }
    ]
}