{
    "id": "SOLR-1718",
    "title": "Carriage return should submit query admin form",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Hitting the carriage return on the keyboard should submit the search query on the admin front screen.",
    "attachments": {
        "SOLR-1718_default_search_screen.patch": "https://issues.apache.org/jira/secure/attachment/12471802/SOLR-1718_default_search_screen.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12800040",
            "date": "2010-01-14T00:31:32+0000",
            "content": "presumably you mean when the search text area is in focus (if someone isn't using a mouse and selects a link as the currently active screen element, then hitting return should open that link per the conventions of the browser)\n\nAdding something to make the form work like this seems unnecessary ... particularly since it prevents people from including newlines in their input ...  which can actually matter depending on the query parser/analyzer you are using – not to mention i like using newlines when submitting complex queries just to improve readability. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12800090",
            "date": "2010-01-14T02:46:11+0000",
            "content": "I think you're point about longer queries makes sense... but then perhaps make the \"full interface\" form work in that way, (given a larger text box), and leave the front admin page for quick queries. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12805190",
            "date": "2010-01-26T20:40:05+0000",
            "content": "I don't understand what you mean.  both forms use a <textarea>, why should the behavior of one textarea be different from the behavior of the other (and every other html textarea on the web) ? "
        },
        {
            "author": "David Smiley",
            "id": "comment-12805219",
            "date": "2010-01-26T21:42:47+0000",
            "content": "Consider the JIRA interface we are using to comment on this issue.  At the top-right of the screen is a \"QUICK SEARCH:\" box.  It doesn't even have a submit button, it just works with hitting the return key. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12828842",
            "date": "2010-02-02T23:46:03+0000",
            "content": "Consider the JIRA interface we are using to comment on this issue. \n\nSure, but that's an <input type=\"text\" />, not a <textarea /> ... the expected semantics are completely different.  With a <input type=\"text\" /> box the browser already takes care of submitting the form if you hit Enter (and FWIW: most browsers i know of also submit forms if you use \"Shift-Enter\" in a <textarea />)\n\nIt sounds like what you are really suggesting is that we change the /admin/index.jsp form to use a <input type=\"text\" /> instead of a <textarea /> for the \"q\" param, and not that we add special (javascript) logic to the form to submit if someone presses Enter inside the existing <textarea />  ... which i have a lot less objection to then going out of our way to violate standard form convention. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12829082",
            "date": "2010-02-03T14:20:42+0000",
            "content": "It sounds like what you are really suggesting is that we change the /admin/index.jsp form to use a <input type=\"text\" /> instead of a <textarea /> for the \"q\" param, and not that we add special (javascript) logic to the form to submit if someone presses Enter inside the existing <textarea /> ... which i have a lot less objection to then going out of our way to violate standard form convention.\n\nYes. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12998703",
            "date": "2011-02-24T06:32:10+0000",
            "content": "The attached patch changes the input type of the query on the front screen to be \"text\" instead of \"textarea\".  I left the full-interface alone; perhaps that's more contentious.  \n\nAlso, I changed the example solr config to make the defaultSearch \"*:*\" instead of \"solr\".  FYI other solrconfig.xml's already have this like example-DIH/solr/tika/conf/solrconfig.xml.   "
        }
    ]
}