{
    "id": "SOLR-563",
    "title": "Contrib area for Solr",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Add a contrib area for Solr and modify existing build.xml to build, package and distribute contrib projects also.",
    "attachments": {
        "SOLR-563.patch": "https://issues.apache.org/jira/secure/attachment/12381498/SOLR-563.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12594551",
            "date": "2008-05-06T11:33:04+0000",
            "content": "An initial attempt to modify the build process to include contrib projects also.\n\n\n\tThe common elements of build.xml that can be re-used by contrib build files are extracted out into a common-build.xml\n\tThe targets for clean, dist, package, javadoc have been modified to execute corresponding targets from contrib build files.\n\tThe dist-war target has been changed to include the contents of build/web when building the war file. This enables the contrib to add themselves into the Solr war file.\n\n\n\nThe changes are modeled after Lucene's contrib builds. However, I have not created a contrib-build.xml which Lucene uses. As we have more contribs, we can do that.\n\nA few missing things are:\n\n\tJavadocs for contribs are not included in the nightly builds\n\tClover integration has not been touched\n\tProbably many more that I missed \n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12598814",
            "date": "2008-05-21T22:10:13+0000",
            "content": "per comment on the mailing list "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12605123",
            "date": "2008-06-15T03:41:04+0000",
            "content": "Shalin, I think I saw you mentioning you'll be working on this soon.  Should I wait for your changes then, or does it make sense to commit what you've got so far (haven't looked at the patch yet)?  Ah, yes, I remember, you said you'd add Maven pom stuff.  I'll wait. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12605256",
            "date": "2008-06-16T10:52:42+0000",
            "content": "Otis, we can work on the maven issue separately. I've tested the current patch both with and without the DataImportHandler contrib patches and it works fine. At the very least, it doesn't break any of the existing functionality. So, we should be ok to commit this.\n\nWe can work on the maven issue separately as part of SOLR-586 once this gets committed. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12607468",
            "date": "2008-06-24T04:50:15+0000",
            "content": "Thanks!\n\nsvn ci CHANGES.txt build.xml common-build.xml\nSending        CHANGES.txt\nSending        build.xml\nAdding         common-build.xml\nTransmitting file data ...\nCommitted revision 671021. "
        }
    ]
}