{
    "id": "SOLR-5994",
    "title": "Add Jetty configuration to serve JavaDocs",
    "details": {
        "affect_versions": "4.7",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI",
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It's possible to add another context file for Jetty that will serve Javadocs from the server.\n\nThis avoids some Javascript issues, makes the documentation more visible, and opens the door for better integration in the future.",
    "attachments": {
        "javadoc-jetty-context.xml": "https://issues.apache.org/jira/secure/attachment/12640756/javadoc-jetty-context.xml",
        "SOLR-5994.patch": "https://issues.apache.org/jira/secure/attachment/12640807/SOLR-5994.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13973679",
            "date": "2014-04-18T01:28:59+0000",
            "content": "The context file to make Jetty serve static content from Javadoc directory. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13973687",
            "date": "2014-04-18T01:38:02+0000",
            "content": "This avoids some Javascript issues\n\nLike what?\n\nmakes the documentation more visible\n\nLinking to it from the Admin UI would be great; otherwise it isn't \"visible\" – it's hidden.  While we're at it; why don't we link to the latest Ref Guide?  It's an actual ASF product after all. "
        },
        {
            "author": "Steve Davids",
            "id": "comment-13973693",
            "date": "2014-04-18T01:45:10+0000",
            "content": "The link on the Admin UI is great in theory only in the context of users pulling up Solr from the \"solr examples\" distribution. Out in production environments it would be extremely odd that users will be pushing out the javadocs with the rest of their configuration, thus resulting in an aggravating 404 page. I believe Jetty will show the various contexts when hitting the root ie http://localhost:8080 – this would then show you links for /javadoc & /solr which would probably be sufficient. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13973696",
            "date": "2014-04-18T01:55:59+0000",
            "content": "Javascript issues: I don't have specific reference, but it was something about Javascript not loading properly when using local filesystem. May have been fixed already. In any case, this is an enhancement, not bug fix, so a less relevant part of conversation.\n\nAdmin link: Jetty will show the contexts when hitting root. So, that could be minimal setup.\n\nI agree on not expecting Javadoc in production. For example distribution, it might be possible to use those admin-extra files to add the links for the Javadoc (and online reference guide). Unless the various re-distributions keep the example files but not Javadoc. But I don't know if those re-distributions (e.g. Bitname) already break other expectations too. \n\nIf it were possible to integrate directly, a nice place to do the link to Javadocs would be in something like an Analysis page and in Schema Browser. Then, it becomes really important that the Javadoc is on the save server. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13974027",
            "date": "2014-04-18T12:55:43+0000",
            "content": "how about this? \n\nthought first about adding another link, but figured that \"Documentation\" pointing to the homepage is perhaps not the best idea anyway?\n\nat the initial load of the UI, a few lines javascript are checking if /javadoc/ is available on the same machine, if not, the link gets changed to the published javadocs on l.a.o "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13974097",
            "date": "2014-04-18T13:56:13+0000",
            "content": "i vaguely remembered another issue which aimed to change the default jetty page - i'm linking those two, just in case, so that nothing gets lost "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13975477",
            "date": "2014-04-21T08:03:30+0000",
            "content": "Is that the Documentation link in the footer of the page? I am afraid to say it is not visible at all. Do we know if anybody clicks on it (whoever has Google Analytics access might).\n\nMaybe linking to it from the root context (e.g. as a \"Welcome to Solr\") or adding it as an example admin-extra would be a bit more visible without causing any production issues.\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13975492",
            "date": "2014-04-21T09:15:24+0000",
            "content": "Was only a first thought, if we put it somewhere else .. i'm fine w/ it. didn't think it was important enough to be placed in the navigation bar on the left.\n\nsince quite a few people might directly access the UI, they would be skipping the root context. but in case we're setting up our own entry page there, we could integrate it - don't know if/how we could check if another context is active, but i guess this should be double.\n\nadmin-extra works on a core-level, not sure if that is a proper place to be for such a documentation? maybe in regards to what David said, we could add another block at the starting page, below 'Versions' to put some documentation links? "
        },
        {
            "author": "Steve Davids",
            "id": "comment-13976367",
            "date": "2014-04-22T04:32:58+0000",
            "content": "It feels somewhat odd to make a head request to see if the local javadoc is available, then if it isn't swap it out with the javadocs on Apache's website - I am sure if someone had firebug open there would be a few question marks going through their mind watching the traffic. I do like the idea of providing the link in the admin-extra (or something similar jetty context page?) that can be easily thrown away/overwritten when it actually comes to your production deployment. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14359682",
            "date": "2015-03-13T00:23:32+0000",
            "content": "I think this issue is dead with Jetty becoming implementation detail, SOLR-7240 and thinking behind LUCENE-6257.\n\nSo, we can close it as WillNotFix. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14359683",
            "date": "2015-03-13T00:23:56+0000",
            "content": "No longer relevant. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14361455",
            "date": "2015-03-14T01:15:33+0000",
            "content": "I like the idea of javadocs being available from within Solr itself, possibly as part of the admin UI.  If that happens, From what I can tell the apache-hosted javadocs for Lucene and Solr are NOT searchable, so it would be really cool if Solr could index them and provide a search box.\n\nRealizing that we are likely to remove javadocs from the primary download, it would only be something that becomes available once the javadocs are downloaded into the correct location.  Looking forward to a time when we might have a plugin architecture that automatically downloads and installs plugins, javadocs could be one of those plugins. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14362486",
            "date": "2015-03-15T18:30:24+0000",
            "content": "Yes, one of the project ideas I have is to make a downloadable collection that includes version specific always-compressed javadocs that are better than what is already available, have a full-blown Solr search index and so on.\n\nPart of the technology for this has already been tested for http://www.solr-start.com/javadoc/solr-lucene/index.html (notice the search box....), but it needs to become downloadable and possibly take advantage of recent Velocity improvements in Solr for the interface design. "
        }
    ]
}