{
    "id": "SOLR-2207",
    "title": "Add paging capabilities to Result Grouping functionality",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Would be great to have the following:\n\n\tPaging of docs within a group via start and offset parameters such that one can drill down into a group\n\tWhile I know we can't return a total count of all groups, it would be nice to know if there are more groups.  This could simply be done by asking for 1 more group than requested by the user.  If that group is non-empty, then set a flag indicating there are more groups.  Then, start and offset could also be applied to allow paging down the groups.  We should also think about how we can optimize this so that we can page very deep into the results without needing to increase the PQ size.",
    "attachments": {
        "SOLR-2207.patch": "https://issues.apache.org/jira/secure/attachment/12458494/SOLR-2207.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12926655",
            "date": "2010-10-30T23:00:08+0000",
            "content": "Here's a patch that implements paging of both groups and docs in each group.\n\nstart/rows for groups\ngroup.offset/group.limit for docs within a group "
        },
        {
            "author": "Scott Kister",
            "id": "comment-12928890",
            "date": "2010-11-06T00:11:55+0000",
            "content": "When I try the patch, my filter query no longer works.\n\nFor example, this returns the correct results, documents with source_id = 1\nGET 'http://localhost:5000/solr/select?q=:&group=false&group.field=collapse_id&fq=source_id:1&rows=2&indent=true&fl=source_id'\n\nHowever, if I set group=true, the results no longer contain documents with source_id:1\nGET 'http://localhost:5000/solr/select?q=:&group=true&group.field=collapse_id&fq=source_id:1&rows=2&indent=true&fl=source_id'\n{\n  \"responseHeader\":\n{\n    \"status\":0,\n    \"QTime\":446}\n,\n  \"grouped\":{\n    \"collapse_id\":{\n      \"matches\":7299136,\n      \"groups\":[{\n          \"groupValue\":-315163990,\n          \"doclist\":{\"numFound\":154,\"start\":0,\"docs\":[\n              \n{\n                \"source_id\":-1}\n]\n          }},\n        {\n          \"groupValue\":-439578260,\n          \"doclist\":{\"numFound\":75,\"start\":0,\"docs\":[\n              \n{\n                \"source_id\":-1}\n]\n          }}]}}}\n\nI also tried the same query against an older build of solr (Sep 24 2010), and in that case the second query did return the correct results. The solr build that is not working is the Nov 4 2010 build. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12928892",
            "date": "2010-11-06T00:21:32+0000",
            "content": "When I try the patch, my filter query no longer works. \n\nConfirmed... filter queries no longer impact grouping results.\nIt must have been the latest refactor - I'll look into it (and add a test with filtering) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12928902",
            "date": "2010-11-06T00:41:57+0000",
            "content": "OK, I just checked in a patch for this.  I'll add a test later. "
        },
        {
            "author": "Tanguy Moal",
            "id": "comment-12987641",
            "date": "2011-01-27T16:47:32+0000",
            "content": "Hello Yonik,\n\nFirst, thank you for this patch, that is interesting.\n\nHowever I am not interested in paginating within a group, but in knowing where will the overall pagination stop.\n\nI don't know if I'm doing things right, but here is my issue : \nI have some kind of a signature that I store in a field and then use it to collapse search results within groups. Some kind of duplicate content filtering.\n\nI can't find a clean way to obtain the total number of groups for a given query. The only way to do that from my understanding, is to ask solr for faceting on the field holding each document's signature, with facet.limit = -1, and then count the number of distinct signature for the given query. I finally use very simple arithmetic (matches - count(signature facets)) to know the total number of groups .\nUsing this, I could finally know where to stop pagination of my results set. Obviously, that is very suboptimal.\n\nThere must be a cleaner way to do so, right ?\n\nAny help appreciated =D "
        }
    ]
}