{
    "id": "SOLR-6695",
    "title": "Change in solrconfig.xml for maxBooleanClauses in SolrCloud is not recognized",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.9,                                            4.10,                                            4.10.2",
        "status": "Resolved",
        "resolution": "Invalid",
        "priority": "Minor"
    },
    "description": "Under Solr 4.10.2 in solrcloud configuration, if I upload a change to solrconfig.xml to zookeeper that raises maxBooleanClauses from 1024 to 2048 and then reload the collection, the cores do not recongnize a new value for maxBooleanClauses unlike other changes to schema.xml and solrconfig.xml. I have to bounce Solr on each node before queries will honor the new value for maxBooleanClauses. This seems like unintentional behavior. I should be able to make any change to schema.xml and solrconfig.xml, then upload those to zookeeper and have each node in the cluster instantly honor all new values after a core/collection reload.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-11-05T06:46:14+0000",
            "author": "Shawn Heisey",
            "content": "This is caused by the code in SolrCore#booleanQueryMaxClauseCount.  In the patch that I am building to eliminate the maxBooleanClauses limit for SOLR-4586, I have completely removed this method. ",
            "id": "comment-14197686"
        },
        {
            "date": "2018-12-06T18:03:36+0000",
            "author": "Erick Erickson",
            "content": "There has never been an automatic reload of the collections based on manually uploading changed configurations.\n\nYou can reload the collection with a single command though.\n\nThis is orthogonal to eliminating the maxBooleanClauses in the first place.\n\n \n\nRan across this when looking for something else, closing it seems in order. ",
            "id": "comment-16711801"
        }
    ]
}