{
    "id": "SOLR-4943",
    "title": "Add a new info admin handler.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Currently, you have to specify a core to get system information for a variety of request handlers - properties, logging, thread dump, system, etc.\n\nThese should be available at a system location and not core specific location.",
    "attachments": {
        "SOLR-4943.patch": "https://issues.apache.org/jira/secure/attachment/12588862/SOLR-4943.patch",
        "SOLR-4943-3__hoss_variant.patch": "https://issues.apache.org/jira/secure/attachment/12589782/SOLR-4943-3__hoss_variant.patch",
        "SOLR-4943-3.patch": "https://issues.apache.org/jira/secure/attachment/12589107/SOLR-4943-3.patch",
        "SOLR-4943-2.patch": "https://issues.apache.org/jira/secure/attachment/12589084/SOLR-4943-2.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13689362",
            "date": "2013-06-20T16:06:39+0000",
            "content": "I've related this to SOLR-4220 - and perhaps it ends up being a dupe - I'd like to keep this separate for the moment though - that issue has some ambitious ideas in it. This issue has a working hack patch now. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13689366",
            "date": "2013-06-20T16:09:45+0000",
            "content": "This patch adds a new set of non core specific urls you can hit:\n\nlocalhost:8983/solr/admin/info/properties\nlocalhost:8983/solr/admin/info/threads\nlocalhost:8983/solr/admin/info/system\nlocalhost:8983/solr/admin/info/logging\n\nIt's a quick hack first patch. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13690379",
            "date": "2013-06-21T15:22:43+0000",
            "content": "This patch incorporates a hack for SOLR-3633.\n\nYou can start up the admin UI with no cores and most of it works.\n\nI'm hoping @steffkes can help me clean it up a bit. It's really just a quick hack to make things work against the new admin info handlers. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13690479",
            "date": "2013-06-21T17:07:26+0000",
            "content": "New Patch:\n\n\n\tfixes logging admin info handler - it expected a core and needed support to be init'd with a corecontainer\n\n "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13690573",
            "date": "2013-06-21T18:34:54+0000",
            "content": "Can we remove the constructors that don't take CoreContainer objects?  Particularly for the InfoHandler, which won't work at all without one. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13690586",
            "date": "2013-06-21T18:45:38+0000",
            "content": "Can we remove the constructors that don't take CoreContainer objects?\n\nNo, this issue doesn't move them, so they are all available under a single core as well - I think if we want to deprecate/remove those, it can be another issue - I don't have an issue with still offering them though - especially through 4X, but even in 5X is fine by me.\n\nParticularly for the InfoHandler,\n\nYeah, that's just copy past from the CoreAdminHandler - I'd have to look at why it has both constructors, but it seems likely we can just remove it from the InfoHandler. "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13691228",
            "date": "2013-06-22T19:39:10+0000",
            "content": "Sorry, I didn't mean remove the URLs with the cores on them, I meant the constructor functions.  The URLs are all intercepted by SolrDispatchFilter and passed to the handlers on CoreContainer anyway, and that's fine.\n\nSo for example InfoHandler has a no-argument constructor, that sets this.cc to null.  If you use this constructor, you can never get useful information out of the InfoHandler - it will always throw a SolrException.  So it seems a bit pointless to have this constructor at all.\n\nAlso, some of these probably don't need to take CoreContainers at all.  SystemInfoHandler just uses it to determine if it's Zk-aware or not, which it could do as easily with a boolean passed to its constructor.  LoggingHandler could take a LogWatcher rather than a CoreContainer.  Makes it easier to test things, for a start.\n\nOIC, looking at it more closely, they need the no-arg constructors because they could be defined in solrconfig.xml as request handlers, and need to go through the normal construct/init/inform lifecycle.  So yes, we should probably open another issue to deprecate defining the handlers that are container-wide in individual core configs. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13691230",
            "date": "2013-06-22T19:42:36+0000",
            "content": "Sorry, I didn't mean remove the URLs with the cores on them, I meant the constructor functions. \n\nYes, I know, but the two are very related \n\nSo for example InfoHandler has a no-argument constructor, that sets this.cc to null.\n\nRight, like I said, that's a copy paste from the CoreAdmin class - it can likely go.\n\nbecause they could be defined in solrconfig.xml as request handlers, and need to go through the normal construct/init/inform lifecycle.\n\nExactly. This issue is not about removing the per core admin info - it's just about adding that info at the system level so that the UI can be reasonable when no SolrCores are defined. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13693468",
            "date": "2013-06-25T22:53:10+0000",
            "content": "I'm -0 on adding this new special \"/admin/info\" path ... CoreAdminHandler's STATUS call seemed like a good place to return all of this info logic form, and had the added benefit of already being a \"special\" handler with special semantics and a solr.xml configurable path – hence the idea i floated in SOLR-4220.  \n\n(I know that between the collection admin paths and the restlet REST API paths we've already moved into the point of there being \"special\" paths that the user can't change in configuration – i'd just really like to avoid adding any more ... but I'm not going to fight hard for it.)\n\nOther then that, my concerns when looking at the patch...\n\n\n\tHaving InfoHandler explicitly wrap instances of the existing ThreadDumpHandler, PropertiesRequestHandler, LoggingHandler, and SystemInfoHandler scares me (because of the \"is CoreContainer null? is SolrCore null?\" situation) and seems overly complicated ... wouldn't it be just as easy to refactor the meat of these classes into static methods (or helper objects) that don't know about SolrQueryRequest and take in only hte specific item they need (CoreContainer in SystemInfoHandler's case, and LowWatcher in LoggingHandler's case, etc..) and then both InfoHandler and the original handlers could call/instantiate those helpers?\n\teither way, we need some tests of this new InfoHandler (otherwise i guarantee you someone down the road is going to add some code to one of these wrapped handlers that is going to cause an NPE because it assumes it has access to a SolrCore and it won't be caught until someone notices it in the UI)\n\t\n\t\twe also need more javadocs on all of the affected handlers noting the two differnet usage patterns.\n\t\n\t\n\twhy is there a change to SolrIndexSearcher in this patch?  ... it smells fishy ... is this a distinct bug that was discovered as part of your work on hte patch that should be fixed & release noted in a dedicated issue?\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13693510",
            "date": "2013-06-25T23:51:08+0000",
            "content": "there being \"special\" paths that the user can't change in configuration – i'd just really like to avoid adding any more \n\nI much prefer this - being able to count on these types of urls is very useful! I hate that the core admin handler url is configurable and in fact it breaks solrcloud if you configure it.\n\nCoreAdminHandler's STATUS call seemed like a good place to return\n\nPersonally, I don't like the idea of jamming these into the status call. I think they have a good structure now - they just should not be at the core level, but at the system level.\n\nbecause of the \"is CoreContainer null? is SolrCore null?\" situation) and seems overly complicated \n\nI think it's fairly simple atm - if it's bothersome, I'd prefer we just remove them at the core level for 5.0 rather than try and refactor it to be very slightly simpler code. \n\neither way, we need some tests \n\nYes of course we need tests.\n\nwhy is there a change to SolrIndexSearcher in this patch?\n\nIt's just an unrelated thing that got caught up in the patch. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13694165",
            "date": "2013-06-26T19:02:04+0000",
            "content": "I much prefer this ...\n\nI know, agree to disagree\n\nI think it's fairly simple atm\n\nComplex probably wasn't the right word .. the code is simple, but it left the door open very side for someone to introduce bugs in the future for one code path or the other.\n\nTake a look at this SOLR-4943-3__hoss_variant.patch i'm attaching – to me this is just as simple and easy to understand as what you had, but makes it a lot harder for someone down the road to break it w/o getting an obvious compile failure because the static methods limit what the code has access to (and if they change the signature of hte static method, then they'll get a compile error in InfoHandler and realize why the code is written the way it is.\n\nif it's bothersome, I'd prefer we just remove them at the core level for 5.0 rather than try and refactor it to be very slightly simpler code. \n\n+1 ... starting with my SOLR-4943-3__hoss_variant.patch it would be trivial to move those static methods into InfoHandler ... they could still be called from the existing handlers, but those handlers would be marked deprecated. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13699041",
            "date": "2013-07-03T14:52:58+0000",
            "content": "Take a look at this\n\nThat's fine with me. I'll incorporate it into my patch. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13699050",
            "date": "2013-07-03T14:58:15+0000",
            "content": "Hmm, on a quick look, it looks like your missing the reason things are as they are...you cannot get the core container from the request core in this case - there is no core. Your patch will just cause NPE's when you hit the system wide urls. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13699085",
            "date": "2013-07-03T15:32:44+0000",
            "content": "New patch with some testing. Takes out the UI changes - @steffkes has said he will flesh out that part of the patch and commit it after I put in the back end changes. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13699145",
            "date": "2013-07-03T16:28:36+0000",
            "content": "Adds another test to hit the SolrDispatchFilter path. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13703342",
            "date": "2013-07-09T14:51:25+0000",
            "content": "Okay, I'm about ready to put this in so that the UI half can be finished... "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13704875",
            "date": "2013-07-10T18:28:01+0000",
            "content": "Commit 1501898 from Mark Miller\n[ https://svn.apache.org/r1501898 ]\n\nSOLR-4943: Add a new system wide info admin handler that exposes the system info that could previously only be retrieved using a SolrCore. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13704884",
            "date": "2013-07-10T18:33:59+0000",
            "content": "Commit 1501899 from Mark Miller\n[ https://svn.apache.org/r1501899 ]\n\nSOLR-4943: Add a new system wide info admin handler that exposes the system info that could previously only be retrieved using a SolrCore. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13704887",
            "date": "2013-07-10T18:34:48+0000",
            "content": "Committed - not in 4.4 so we have time to tweak it if necessary. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13743380",
            "date": "2013-08-18T21:07:49+0000",
            "content": "I see that this issue is marked as \"Resolved\", but... I don't see either a wiki page or a new refguide page, even a simple placeholder, or any other hint of documentation to come for this new feature. "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787119",
            "date": "2013-10-05T10:19:19+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}