{
    "id": "SOLR-8384",
    "title": "Windows Start Script when Changing SOLR_SERVER_DIR via -d option",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Trivial"
    },
    "description": "bin\\solr.cmd Requires change of environment variables used in the \" REM now wait to see Solr come online ...\" command.  Currently this call uses DEFAULT_SERVER_DIR which is no longer correct when starting SOLR with a different server directory using the -d command option.\n\nReplace DEFAULT_SERVER_DIR with SOLR_SERVER_DIR so that the proper libraries are able to be found when checking that SOLR started.\n\nThere may be other uses in the script where this issue is present when starting SOLR from a different directory other than 'server'.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-31T13:51:34+0000",
            "author": "Jan Høydahl",
            "content": "As I can see that command is correct, it only uses DEFAULT_SERVER_DIR to find the SolrCLI tool, which is then looking for a running Solr over HTTP.\nPlease detail exactly what caused you problems? Did you delete the solr/server directory so the binary could not be found? ",
            "id": "comment-15622201"
        },
        {
            "date": "2016-10-31T15:08:30+0000",
            "author": "Jeremy Anderson",
            "content": "It's been a while since I was messing with this.  Essentially I believe I had all the binaries in a different path and was starting SOLR.cmd with the -d command option to direct it to that directory.  (I may have been doing this so that I could package SOLR into a different Jetty instance for a prod style deploy) SOLR starts up fine, however the secondary checks performed assume those binaries reside in the Default path which they no longer did.  By changing them to use the proper new path of SOLR_SERVER_DIR (set by the -d option if I recall) everything ran fine and as expected.\n\nTake a look at :set_server_dir which is what is called when starting with the -d option.  Here is where SOLR_SERVER_DIR is set. It may be best to also change the value of DEFAULT_SERVER_DIR here as well.\n ",
            "id": "comment-15622416"
        },
        {
            "date": "2016-10-31T20:40:29+0000",
            "author": "Jan Høydahl",
            "content": "I can agree with you. Looks like the -d option is designed to work even if the solr/server dir is missing completely, which is not the case for neither bin/solr or bin/solr.cmd currently. bin/solr uses DEFAULT_SERVER_DIR for the run_tool stuff. ",
            "id": "comment-15623355"
        }
    ]
}