{
    "id": "SOLR-9070",
    "title": "how to range search on the field which contains multiple decimal point (eg: 2.5.0.4)",
    "details": {
        "components": [
            "search"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "Hi,\n\nI have issue in my server. As I stated in the subject I want to do range search query on the field (eg: filed name is “version”) which contains value like (2.5.0.1, 2.5.0.4 and 2.5.0.10 etc).\n\nWhen I do range search on the “version” field with criteria [* TO 2.5.0.5], it gave me all the value like (2.5.0.1, 2.5.0.10, 2.5.0.4). But this is wrong result. Since I was expecting only 2.5.0.1 and 2.5.0.4. \nBut it include 2.5.0.10 with the results. I googled and found that solr does lexical sorting. But I want numerical sorting. I declared the field type as string in schema.xml.\n\nI did the following solution but nothing worked. \n•\tConverted the field type to number. But it gave me “NumberFormatException”.  Because java does not allow multiple decimal point.\n•\tI added left pad 0 with the value while adding document in solr. But no luck\n\nCan you please give me good solution to come out of the issue?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-05-05T18:12:16+0000",
            "author": "David Smiley",
            "content": "The solution is to left-pad with 0's.  You said you did that... but did you leave the field type as a string?  That should definitely work.  Next time for something like this, I suggest using the solr-user mailing list to ask how to do something.\n\nI think I'll just close this issue as \"not a problem\".  I started by changing the issue to an improvement request but realistically I don't see it happening.  Of course if someone goes ahead and does it then great. ",
            "id": "comment-15272756"
        }
    ]
}