{
    "id": "SOLR-8714",
    "title": "Implement translation contrib package for LanguageTranslationUpdateProcessor's",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "6.2"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "A while back over in Tika we implemented the Translator interface. This now provides a number of implementations. \nThis issue will provide a  translation contrib package offering a LanguageTranslationUpdateProcessor.\nThe new processor will probably utilize the existing Solr Language Identifier and would enable a document to be translated based upon a user defined mapping. The LanguageTranslatorUpdateProcessor's should be pluggable and would be placed in an UpdateChain the same as the LanguageIdentifierUpdateProcessor's\nIt is my intent to also provide a wiki page which can be referenced and maintained in conjunction with the code.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-26T07:52:26+0000",
            "author": "Tommaso Teofili",
            "content": "cool stuff Lewis John McGibbney, I am very interested in providing such an integration. Do you already have any existing code / patch  ? Otherwise I can start working on this myself. ",
            "id": "comment-15212868"
        },
        {
            "date": "2016-03-26T08:35:39+0000",
            "author": "Lewis John McGibbney",
            "content": "Hi Tommaso Teofili I started a patch which I thought was sound. The blocker right now is SOLR-8716\nIf we can do the upgrade on Tika then this issue (with Joshua for example backing statistical machine translation via the language packs we've been generating) then this issue is IMHO a game changer for the way that Web crawlers harvest and make data available, useful and ultimately meaningful to us all. If we can get Solr doing statistical machine translation at indexing time then this is a game changer (of course others are doing it, but for the open source Apache Solr it would be excellent).  ",
            "id": "comment-15212885"
        },
        {
            "date": "2016-03-26T13:38:40+0000",
            "author": "Tommaso Teofili",
            "content": "The blocker right now is SOLR-8716\n\nit looks like Uwe is on it, so if you are able to provide an updated patch which upgrades also the (transitive) Tika dependencies used by Lucene/Solr I think we should be set. If you do not have enough time, maybe I can help there.\n\nthis issue is IMHO a game changer for the way that Web crawlers harvest and make data available\n\n+1, I think this would be very valuable. ",
            "id": "comment-15213028"
        }
    ]
}