{
    "id": "SOLR-3505",
    "title": "Detect and report when the limit for maximum number of documents in a single index is exceeded",
    "details": {
        "affect_versions": "3.6",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "SOLR-3504 documents the limit for maximum number of documents in a single index, but it is highly desirable to have Solr detect when this limit is reached and provide a sensible response for the user.\n\nI am not sure of the implementation details, but generally each of the \"update\" handlers would return an HTTP 400 status code. The reason phrase should be something like \"Exceeded maximum number of documents in a single index - 2,147,483,647\".\n\nIt is not clear whether Solr itself should check the limit defensively, or simply let Lucene throw the proposed MaxDocumentException and then catch it and return the desired 400 response. It is also not clear if that processing can be centralized or if calls to some new utility method would need to be sprinkled in various places in Solr. Add also it may or may not be necessary for update processors to either ignore or watch for this exception.\n\nThere may be implications for SolrCloud, so that a reasonably useful response gets back to both the original poster code as well as the Solr admin.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13288277",
            "date": "2012-06-03T22:49:07+0000",
            "content": "Similar to LUCENE-4105, it would greatly simplify testing to have a mechanism for arbitrarily bumping the next document number to a value like Integer.MAX_VALUE - k so that the limit can be hit by adding only a small number of documents.\n\nAlthough it might be necessary to add a handler-level request query parameter to set the document number, it may be sufficient for to have unit tests that reach in directly to the IndexWriter that Solr is using to set the document number.\n\nBut since it might be nice to be able to manually test (okay, scripted test) this feature with a full-blown multi-machine cloud cluster, an explicit request parameter might be more desirable. Maybe something like &_docNumber_=2147483630.\n "
        }
    ]
}