{
    "id": "SOLR-7032",
    "title": "Clean up test remnants of old-style solr.xml",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.1",
            "6.0"
        ],
        "affect_versions": "5.1,                                            6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "After Alan's heroic work with pulling out support of old-style solr.xml, there are still a few mentions in some of the test code and a couple of places where solr.xml is synthesized inline found just by grepping on \n\"<cores\".\n\nThe code itself will throw an error when processing solr.xml if there are <cores> or <core> tags, so there's no reason to try to get this patch in to 5.0.",
    "attachments": {
        "SOLR-7032.patch": "https://issues.apache.org/jira/secure/attachment/12694438/SOLR-7032.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-01-25T19:09:59+0000",
            "author": "Erick Erickson",
            "content": "Preliminary patch, all tests pass but I need to look this over a bit. The bits I want to check over are some map-reduce changes and the test files for old-solr-example and solr-multicore.xml that I removed. ",
            "id": "comment-14291226"
        },
        {
            "date": "2015-01-25T20:09:59+0000",
            "author": "Alan Woodward",
            "content": "Bah, I thought I'd expunged all trace of this.  They're not tripping any test failures, which suggests that they're completely unused and we can safely rip them out.\n\nIt looks as though there's going to be a respin for 5.0, so I think it's worth getting this in. ",
            "id": "comment-14291246"
        },
        {
            "date": "2015-01-25T20:44:28+0000",
            "author": "Erick Erickson",
            "content": "ba: Bah, I thought I'd expunged all trace of this\n\nYou did a boatload of work, this is entirely minor.....\n\nbq: They're not tripping any test failures, which suggests that they're completely unused and we can safely rip them out\n\nYeah, which leads me to some questions about our test harness, why does the mr test that synthesizes solr.xml code not die in 5.0? Probably doesn't go down the same parsing path maybe? Same with the multicore bits I took out.\n\nbq: It looks as though there's going to be a respin for 5.0, so I think it's worth getting this in.\n\nEasy enough to do, but leaving them in 5.0 isn't doing any harm either. I don't have strong feelings one way or the other, it'd be nice not to have even these remnants in to make 5.0 clean, but is that aesthetic worth the (minimal I admit) risk? Anyone else want to weigh in? ",
            "id": "comment-14291264"
        },
        {
            "date": "2015-02-19T04:11:13+0000",
            "author": "Erick Erickson",
            "content": "Final patch with CHANGES.txt entry. ",
            "id": "comment-14326964"
        },
        {
            "date": "2015-02-19T04:14:21+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1660790 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1660790 ]\n\nSOLR-7032: Clean up tests remnanat of old-style solr.xml ",
            "id": "comment-14326967"
        },
        {
            "date": "2015-02-19T05:46:40+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1660796 from Erick Erickson in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1660796 ]\n\nSOLR-7032: Clean up tests remnanat of old-style solr.xml ",
            "id": "comment-14327021"
        },
        {
            "date": "2015-04-15T00:30:26+0000",
            "author": "Timothy Potter",
            "content": "Bulk close after 5.1 release ",
            "id": "comment-14495287"
        }
    ]
}