{
    "id": "SOLR-1870",
    "title": "Binary Update Request (javabin) fails when the field type of a multivalued SolrInputDocument field is a Set (or any type that is identified as an instance of iterable)",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4.1",
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "clients - java",
            "update"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When the field type of a field in a SolrInputDocument is a Collection based on the Set interface, the JavaBinUpdate request fails. It works when sending the document data over XML.",
    "attachments": {
        "SOLR-1870.patch": "https://issues.apache.org/jira/secure/attachment/12444999/SOLR-1870.patch",
        "SOLR-1870-test.patch": "https://issues.apache.org/jira/secure/attachment/12444985/SOLR-1870-test.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12869357",
            "date": "2010-05-19T21:33:48+0000",
            "content": "Moving Prasanna's original stack trace and verbose details into comment and reformatting...\n\n\n\nI encountered this error when updating my indexer to write documents in the binary format. I initially got a ClassCastException and after digging into it found the likely cause for it.\n\nThe following piece of code added to 'public void simple() throws IOException' method in TestUpdateRequestCodec.java illustrates the error.\n\n\ndoc = new SolrInputDocument(); \nCollection<String> foobar = new HashSet<String>();\nfoobar.add(\"baz1\");\nfoobar.add(\"baz2\");    \ndoc.addField(\"foobar\",foobar);\nupdateRequest.add(doc);\n\n\n\n The test fails for any Collection derived from the Set interface but will work if the Collection is a List / Array or other types. The stack trace is as follows:\n\n\n java.lang.ClassCastException: java.lang.String\n\tat org.apache.solr.client.solrj.request.JavaBinUpdateRequestCodec$2.readIterator(JavaBinUpdateRequestCodec.java:121)\n\tat org.apache.solr.common.util.JavaBinCodec.readVal(JavaBinCodec.java:210)\n\tat org.apache.solr.client.solrj.request.JavaBinUpdateRequestCodec$2.readNamedList(JavaBinUpdateRequestCodec.java:107)\n\tat org.apache.solr.common.util.JavaBinCodec.readVal(JavaBinCodec.java:175)\n\tat org.apache.solr.common.util.JavaBinCodec.readArray(JavaBinCodec.java:405)\n\tat org.apache.solr.common.util.JavaBinCodec.readVal(JavaBinCodec.java:171)\n\tat org.apache.solr.client.solrj.request.JavaBinUpdateRequestCodec$2.readIterator(JavaBinUpdateRequestCodec.java:119)\n\tat org.apache.solr.common.util.JavaBinCodec.readVal(JavaBinCodec.java:210)\n\tat org.apache.solr.client.solrj.request.JavaBinUpdateRequestCodec$2.readNamedList(JavaBinUpdateRequestCodec.java:107)\n\tat org.apache.solr.common.util.JavaBinCodec.readVal(JavaBinCodec.java:175)\n\tat org.apache.solr.common.util.JavaBinCodec.unmarshal(JavaBinCodec.java:101)\n\tat org.apache.solr.client.solrj.request.JavaBinUpdateRequestCodec.unmarshal(JavaBinUpdateRequestCodec.java:126)\n\tat org.apache.solr.client.solrj.request.TestUpdateRequestCodec.simple(TestUpdateRequestCodec.java:82)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)\n\tat org.junit.internal.runners.TestMethodRunner.executeMethodBody(TestMethodRunner.java:99)\n\tat org.junit.internal.runners.TestMethodRunner.runUnprotected(TestMethodRunner.java:81)\n\tat org.junit.internal.runners.BeforeAndAfterRunner.runProtected(BeforeAndAfterRunner.java:34)\n\tat org.junit.internal.runners.TestMethodRunner.runMethod(TestMethodRunner.java:75)\n\tat org.junit.internal.runners.TestMethodRunner.run(TestMethodRunner.java:45)\n\tat org.junit.internal.runners.TestClassMethodsRunner.invokeTestMethod(TestClassMethodsRunner.java:66)\n\tat org.junit.internal.runners.TestClassMethodsRunner.run(TestClassMethodsRunner.java:35)\n\tat org.junit.internal.runners.TestClassRunner$1.runUnprotected(TestClassRunner.java:42)\n\tat org.junit.internal.runners.BeforeAndAfterRunner.runProtected(BeforeAndAfterRunner.java:34)\n\tat org.junit.internal.runners.TestClassRunner.run(TestClassRunner.java:52)\n\tat com.intellij.rt.junit4.Junit4ClassSuite.run(Junit4ClassSuite.java:99)\n\tat com.intellij.rt.execution.junit.JUnitStarter.main(JUnitStarter.java:40)\n\n\n\n The error most likely is in the way javabin codec encodes Sets. In the public boolean writeKnownType(Object val) method in JavaBinCodec.java, a Set is recognized as an instance of iterable and the writeIterator method is called. \n\n I briefly looked at the writeIterator and readIterator methods and was unable to pinpoint the error. I also looked at the javabin encoded byte stream (not exactly a good way to debug..) and it did not look like it was right. \n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12869358",
            "date": "2010-05-19T21:34:37+0000",
            "content": "patch based on Prasanna's comment which illustrates the bug ... still investigating. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12869372",
            "date": "2010-05-19T21:58:32+0000",
            "content": "Tracing through this code, i don't think the bug is happening when the stream is being written ... writeIterator is fairly straightforward.\n\nWhat makes no sense to me is that in JavaBinUpdateRequestCodec, the unmarshall function declares an anonymous subclass of JavaBinCodec where the readIterator has a hardcoded assumption that every object it encounters in an \"ITERATOR\" sequence will be a List<NamedList> which it can then convert into a SolrInputDocument.\n\nbased on the stack trace, these seems like an abuse of the codec format – it knows that at the \"top level\" there will be an Iterator of docs, so it overwrites that method in this way, ignorant of the possibility that there might be other purposes for an Iterator in the stream (like a Set of values for a field)\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12869400",
            "date": "2010-05-19T23:09:32+0000",
            "content": "Based largely on guessing what it was that this Update codec was trying to do, i created this patch – it's based on the theory that the \"outermost\" Iterator is expected to be the stream of documents, and any other Iterator should be parsed in the same way as the superclass.  It uses a simple boolean to keep track of whether or not the \"first\" (ie: outermost) Iterator has been encountered yet (which is only feasible because it's an anonymous inner class used for only one stream)\n\nThis patch causes all tests to pass – but that doesn't necessarily convince me that it's correct – i would definitely appreciate it if someone who has actually looked at the update codec code prior to today would review this.\n\n(Note: i did have to modify the document equality assertions to understand that since we will never have a Set in an unmarshaled doc it needs to convert the corrisponding Collection to a set in order for assertEquals to do a non-ordered comparison) "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12871001",
            "date": "2010-05-25T05:34:33+0000",
            "content": "\"top level\" there will be an Iterator of docs, so it overwrites that method in this way, ignorant of the possibility that there might be other purposes for an Iterator in the stream (like a Set of values for a field)\n\nIterator was created as a special type in javabin codec so that items can be streamed. Any collection should have been written as a List of specific size. When unmarshalled , the items always come out as a List unless we override the readIterator.\n.I guess that  a better fix would be to write Collection as List I shall give a patch "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12871006",
            "date": "2010-05-25T05:45:05+0000",
            "content": "fixing JavabinCodec to write collection as array "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12871231",
            "date": "2010-05-25T16:19:50+0000",
            "content": "Iterator was created as a special type in javabin codec so that items can be streamed. Any collection should have been written as a List of specific size.\n\nI'm confused ... if Iterator support was only ever ment to be \"special\" for streaming items, then why did writeKnownType have support for Iterator?  and why did JavaBinUpdateRequestCodec override the default behavior of readIterator to treat it special?\n\nAs far as your patch goes: instead of adding a new \"if (val instanceof Collection)\" test to writeKnownType, shouldn't you replace the existing \"instanceof List\" with \"instanceof Collection\" ?\n\nI'm still not understanding all of this, but it also seems like both patches would be a good idea – your change ensures that all Collections are serialized as an Array, but it still leaves open the possibility of a bug if someone tries to use the codec to stream something which is not a Collection but is Iterable.  perhaps that was not originally ment ot be supported, but is there any harm in it?  is the special case behavior for Iterators for streaming used in a way besides the \"top level\" docs iterator that i mentioned? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874919",
            "date": "2010-06-03T02:38:45+0000",
            "content": "Noble: the newly updated SOLR-1870-test.patch demonstrates the concern i have for your fix: if the JavaBinCodec has support for Iterator and Iterable, but the JavaBinUpdateRequestCodec makes assumptions about Iterators only being used for streaming docs, then if people add Field values containing Custom objects that implement Iterable but are not actually Collection then the JavaBinUpdateRequestCodec will marshal them correctly, but it will have a ClassCastException when unmarshaling them – ditto for people who want to add lazy Iterators as field values.\n\nI don't disagree that making JavaBinCodec support Collection is a good idea in general, but it doesn't fix the root problem – i think we need both changes.\n\nThe latest SOLR-1870.patch incorporates both my suggested fix for JavaBinUpdateRequestCodec, as well as your change to JavaBinCodec (with my suggested tweak of replacing List with Collection in the if tree), and all of the tests i've previously posted (ie: SOLR-1870-test.patch is for illustrative purposes only, it's not needed)\n\nwhat do you think? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12874920",
            "date": "2010-06-03T02:39:40+0000",
            "content": "we should try to get this into 1.4.1 if we can get consensus on the fix. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12874957",
            "date": "2010-06-03T05:18:09+0000",
            "content": "Hoss , the fix is good. Treating all collections as type ARR instead of just collection. \nMoreover we do not need to support Iterable.\n+1 "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12875104",
            "date": "2010-06-03T13:34:08+0000",
            "content": "concerning the \"seenOuterMostDocIterator\", \nIs it the case that there can be only one DocList in the update request? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12875202",
            "date": "2010-06-03T17:28:51+0000",
            "content": "concerning the \"seenOuterMostDocIterator\", Is it the case that there can be only one DocList in the update request? \n\nMy reading of JavaBinUpdateRequestCodec is yes, there is only one list.  the marshal method takes in an updateRequest, and then writes all the documents in that updateRequest as a single Iterator to the output stream using a custom javaBinCodec that treats the doclist special – but it doesn't change anything about any other iteratros or iterables that may be field values in the DocList, so JavaBinCodec.marshal happily writes then out successfully.\n\nI'll i've done is update JavaBinUpdateRequestCodec.unmarshal so it only applies it's special logic to this one special top-level iterator – and will now delegate to JavaBinCodec.unmarshal for any other Iterators or Iterables.\n\nEven if the same InputStream/OutputStream is reused for multiple updateRequest objects using multiple marshal/unmarshal calls (something i don't think is supported in the calling code, the \"seenOuterMostDocIterator\" is an instance variable inside the unmarshal method, so it will be reset for each call.\n\nHoss , the fix is good. Treating all collections as type ARR instead of just collection.\nMoreover we do not need to support Iterable.\n+1\n\nI'm confused – it seems like you are in favor of my patch, but you also say we do not need to support Iterable  ... Iterable (and Iterator) are already supported by the marshalling method w/o any errors or warnings, i didn't add that, all i did was make sure Iterable (and Iterator) would be supported on the unmarshalling side as well.\n\nIf it was never intended for the JavaBinCodec to support Iterator/Iterable except in the special case \"streaming\" situations like what JavaBinUpdateRequestCodec does then that's fine, but in that case we should change JavaBinCodec so it errors during marshalling – the client shouldn't be able to successfully serialize some data if the server is then going to complain that it's an incorrect format. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12875723",
            "date": "2010-06-04T19:35:46+0000",
            "content": "I'm confused - it seems like you are in favor of my patch, but you also say we do not need to support Iterable ...\n\nOh I misread our patch and  thought you removed support for Iterable . \n\nIn the encoded form there is only iterator/arr. So client does not send any unsupported type.  for instance Set is an unsupported type in the encoded form but is supported by the library (It is lossy encoding) \n\nanyway your patch  is fine.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12877818",
            "date": "2010-06-11T14:15:59+0000",
            "content": "This is marked 1.4.1 - someone want to finish it off? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12878289",
            "date": "2010-06-12T17:26:52+0000",
            "content": "The latest patch by Hoss can be committed. I can do it if Hoss does not wish to add anything more "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12878337",
            "date": "2010-06-13T01:42:12+0000",
            "content": "I just reviewed this - seems fine to me. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12878457",
            "date": "2010-06-14T01:24:09+0000",
            "content": "Committed revision 954336.  ... trunk\n\nCommitted revision 954338.  ... 3x branch\n\nCommitted revision 954340.   ... 1.4 branch "
        }
    ]
}