{
    "id": "SOLR-2687",
    "title": "Add new Solr book 'Apache Solr 3.1 Cookbook' to selection of Solr books and news.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Find below the news of the new Solr book. I can provide an image when prompted. Below is a news item and I've included the URL for the new book. The text is as follows:\n\n\nRafał Kuć is proud to introduce a new book on Solr, \"Apache Solr 3.1 Cookbook\" from Packt Publishing.\n\nThe Solr 3.1 Cookbook will make your everyday work easier by using real-life examples that show you how to deal with the most common problems that can arise while using the Apache Solr search engine. \n\nThis cookbook will show you how to get the most out of your search engine. Each chapter covers a different aspect of working with Solr from analyzing your text data through querying, performance improvement, and developing your own modules. The practical recipes will help you to quickly solve common problems with data analysis, show you how to use faceting to collect data and to speed up the performance of Solr. You will learn about functionalities that most newbies are unaware of, such as sorting results by a function value, highlighting matched words, and computing statistics to make your work with Solr easy and stress free.\n\nClick here to read more about the Apache Solr 3.1 Cookbook. (http://www.packtpub.com/solr-3-1-enterprise-search-server-cookbook/book)",
    "attachments": {
        "solr_31_cookbook.jpg": "https://issues.apache.org/jira/secure/attachment/12489622/solr_31_cookbook.jpg",
        "solr-2687.patch": "https://issues.apache.org/jira/secure/attachment/12489623/solr-2687.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Rafał Kuć",
            "id": "comment-13080569",
            "date": "2011-08-07T11:39:41+0000",
            "content": "I've attached the files to change the site. Could someone please review and apply the patch ?\n\nBtw. the solr_31_cookbook.jpg goes to solr\\site-src\\src\\documentation\\content\\xdocs\\images\\solr_31_cookbook.jpg "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13094838",
            "date": "2011-08-31T19:51:40+0000",
            "content": "Ok, this is committed, thanks for the contrib! "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13094985",
            "date": "2011-08-31T23:17:59+0000",
            "content": "Verified that change propagated to site "
        }
    ]
}