{
    "id": "SOLR-7251",
    "title": "In legacyCloud=false, If a create collection fails, information about that collection should not be persisted in ZK",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.0",
        "status": "Closed",
        "resolution": "Not A Problem",
        "priority": "Blocker"
    },
    "description": "In legacyCloud=false mode, if a CREATE collection fails ( bad config or something ) information about that collection will still be written out to the state.json file.\n\nWhen you try re-creating it says that the collection already exists.\n\nCREATE collection should no write the collection information to state.json unless the creation succeeds. This is what happens when no legacyCloud is not set to false.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-18T18:52:55+0000",
            "author": "Mark Miller",
            "content": "I think that has fluttered between fixed and broken once or twice. Probably the test for it only runs with legacyCloud=true or there is no great test for it yet.\n\nThere is also some complications around the preregister thing that used to be around - I'd have to refresh on that code.\n\nEither way, we should fix this - either for the 4.x line or in case zk=truth stuff isnt turned on by default before the next point release. ",
            "id": "comment-14367664"
        },
        {
            "date": "2017-06-05T01:47:58+0000",
            "author": "Varun Thacker",
            "content": "Marking this as a blocker as well as we are working towards  SOLR-8256 for 7.0 as well ",
            "id": "comment-16036456"
        },
        {
            "date": "2017-06-06T02:28:32+0000",
            "author": "Cao Manh Dat",
            "content": "Varun Thacker By looking at currently CreateCollectionCmd, if there are failures when create collection, we will clean up by using DeleteCollectionCmd. So should we close this ticket as fixed? ",
            "id": "comment-16038006"
        },
        {
            "date": "2017-06-06T17:19:20+0000",
            "author": "Varun Thacker",
            "content": "Hi Dat,\n\nLooks like this was fixed as part of SOLR-8983 . I verified it manually as well. So closing out the issue. ",
            "id": "comment-16039286"
        }
    ]
}