{
    "id": "SOLR-4714",
    "title": "Solr server request handler failed",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "When sending a search request via HttpClient post method,solr server fails to parse the query and prints error \"HttpParser full....\".\n\nThe search request was for retrieving 600 entity details ,q:(ent1 ent2 ent3 ... ent600)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13634344",
            "date": "2013-04-17T19:40:10+0000",
            "content": "There's really not enough detail here to indicate a Solr problem.\n\nIt sounds like you are exceeding the limits allowed according to your Servlet Containers settings – either for the POST body, or for the URL.\n\ngoogle searchers for \"HttpParser Full\" suggest that this error is coming from jetty related to how long the request URL is – you mentioned you were doing an HTTP POST, but w/o any specific code, i suspect that you are still including your query as URL params when doing that POST.\n\nIf you are still having problems, please send an email with more details (ie: servlet container used, example of your request code, details of th server respnose, details of the log messages recorded, etc...) to the solr-user@lucene mailing list.  There is no need to re-open this bug unless someone confirms there is a particular problem with solr. "
        },
        {
            "author": "Solr Node",
            "id": "comment-13637531",
            "date": "2013-04-21T10:49:33+0000",
            "content": "You are correct, i also found the same details after spending few hours on net, and i resolved the issue as well.Off course it was not a problem with solr but jetty, exception logs were so unclear to identify the culprit. I am using jetty 8, and by increasing the requestBufferSize value in jetty.xml it worked. "
        }
    ]
}