{
    "id": "SOLR-12436",
    "title": "Can\"t delete BLOB element in SolrCloud",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Hello,\n\nThe documentation said on the BLOB API page:\n\"Deletes can be performed with standard REST delete commands.\" \n\nSo, I have test to delete a blob file version but thise commands do not working:\n\n\ncurl -X \"DELETE\" http://srv-formation-solr3:8983/solr/.system/blob/CityaUpdateProcessorJar/14\n\n\n\nThis command return just the file informations:\n\n{\n  \"responseHeader\":{\n    \"zkConnected\":true,\n    \"status\":0,\n    \"QTime\":1},\n  \"response\":{\"numFound\":1,\"start\":0,\"docs\":[\n      {\n        \"id\":\"CityaUpdateProcessorJar/14\",\n        \"md5\":\"45aeda5a01607fb668cec26a45cac9e6\",\n        \"blobName\":\"CityaUpdateProcessorJar\",\n        \"version\":14,\n        \"timestamp\":\"2018-05-30T12:59:40.419Z\",\n        \"size\":22483}]\n  }}\n\n\n\nSo, I have test to delete directly on the Solr interface with the query page XML:\n\n<delete><query>id:CityaUpdateProcessorJar/14</query></delete>\n\n\n\nAnd not working.\n\nThanks for your help,\nMaxence",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-01T11:57:38+0000",
            "content": "\n<delete><query>*:*</query></delete>\n\n\nHave working but 15 minuts to work. CURL DELETE do not work. ",
            "author": "Maxence SAUNIER",
            "id": "comment-16497891"
        },
        {
            "date": "2018-06-24T17:29:22+0000",
            "content": "Have working but 15 minuts to work\n\nIn this respect, the .system collection is like any other Solr index.  If it takes 15 minutes for a change to the index to become visible, that sounds like there's an issue with commits – in that the commit is not happening right away and it gets triggered in some other way 15 minutes later.\n\nI've just located and looked at the solrconfig.xml file that gets used by the .system collection in the master branch, and I have the following things to say about it:\n\n\n\tautoCommit has openSearcher set to true, but the config is <maxDocs>1</maxDocs>\n\t\n\t\tdeletes probably do not count towards maxDocs.\n\t\tI'm really wondering what is resulting in the commit 15 minutes later, because I do not see anything in the config that would cause it.\n\t\tIMHO, the autoCommit should use maxTime of 1000 instead of maxDocs.  I would not normally advocate such a short maxTime, but the config has no caches, so commits should be really fast.\n\t\n\t\n\tThe max blob size in the config defaults to 5 MB.  There are contrib jars included with Solr that are larger than this.  The size is configurable with a system property, but I think the default should accommodate any jar that Solr comes with and most jars a user would add, so I'd set it to 20MB.\n\tI think I've seen mention of warning messages resulting from the use of LATEST in luceneMatchVersion.  Using LATEST does mean that we don't have to update it with each release, but users might get worried about seeing the resulting log message.  I personally would rather list a specific version, even if updating it does get missed on a release.  I doubt that having an old version there would matter much.\n\tI don't think the updateLog directory should be configurable with a system property.  It should use the default.  I think it's somewhat dangerous to have this configurable in ANY core, but for this particular one, it should definitely not be something the user can influence.\n\tIf StandardDirectoryFactory uses mmap, then I have nothing to say about that.  If it doesn't, then I would probably use MMapDirectoryFactory.  There's definitely no reason to use the NRT factory.\n\n\n\nThis is the solrconfig.xml file in master for the .system collection:\n\n\n<?xml version=\"1.0\" ?>\n<config>\n  <luceneMatchVersion>LATEST</luceneMatchVersion>\n  <directoryFactory name=\"DirectoryFactory\" class=\"${solr.directoryFactory:solr.StandardDirectoryFactory}\"/>\n  <updateHandler class=\"solr.DirectUpdateHandler2\">\n    <updateLog>\n      <str name=\"dir\">${solr.ulog.dir:}</str>\n    </updateLog>\n    <autoCommit>\n      <maxDocs>1</maxDocs>\n      <openSearcher>true</openSearcher>\n    </autoCommit></updateHandler>\n  <requestHandler name=\"/select\" class=\"solr.SearchHandler\" default=\"true\" />\n  <requestHandler name=\"/blob\" class=\"solr.BlobHandler\">\n    <lst name=\"invariants\">\n      <str name=\"maxSize\">${blob.max.size.mb:5}</str>\n    </lst>\n  </requestHandler>\n</config>\n\n ",
            "author": "Shawn Heisey",
            "id": "comment-16521556"
        }
    ]
}