{
    "id": "SOLR-5590",
    "title": "SolrJ is still on httpcomponents/httpclient version 4.2.x, which has some problems",
    "details": {
        "affect_versions": "4.5.1",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SolrJ depends on HttpClient 4.2.x right now, but HttpClient 4.2.x has issues that the ManifoldCF team encountered with handling of form data encoding - issues which are addressed in HttpClient 4.3.x.  We developed a local patch, but Solr will eventually need to go to the new client.  (ManifoldCF would plan to follow shortly thereafter).\n\nI tried to get Oleg (PMC chair of HttpComponents) to agree to port the fixed code to the 4.2.x stream but he did not want to do that.  So I believe that that avenue is closed.\n\nSee CONNECTORS-623 for a detailed description of the problem.",
    "attachments": {
        "SOLR-5590.patch": "https://issues.apache.org/jira/secure/attachment/12621076/SOLR-5590.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Karl Wright",
            "id": "comment-13860205",
            "date": "2014-01-02T13:33:32+0000",
            "content": "Updating the httpclient version in the ivy versions file does not break compilation, at least on the 4x branch.  Running all tests now. "
        },
        {
            "author": "Karl Wright",
            "id": "comment-13860223",
            "date": "2014-01-02T14:15:39+0000",
            "content": "Tests pass too.  Since they include a fair number of solr cloud tests, I believe this means it is probably safe to commit the update to the latest httpclient.  Will attach a patch.\n "
        },
        {
            "author": "Karl Wright",
            "id": "comment-13860225",
            "date": "2014-01-02T14:17:28+0000",
            "content": "Patch that updates to the latest httpclient.\n\nNote that this does NOT yet include any changes needed to specify UTF-8 encoding for multipart form elements; looking into how that is done now. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13860252",
            "date": "2014-01-02T15:14:07+0000",
            "content": "I checked the committer list for the project, and Karl Wright didn't show up there.  I'm willing to work with Karl and get this change committed.  I need a few hours before I can work on it, so if someone else has the time right now, feel free to take over.\n\nAnother potential reason for someone else to take over, unless Karl already knows what to do:  This change definitely means that SolrJ is using deprecated classes.  I'd like to eliminate the deprecated classes, but that might require a completely new issue.  I already tried once to use the new Builder classes in my own SolrJ code, but found that SolrJ didn't like it for some reason. "
        },
        {
            "author": "Karl Wright",
            "id": "comment-13860270",
            "date": "2014-01-02T15:35:27+0000",
            "content": "Hi Shawn,\n\nCorrect, I am not a committer for Solr, but I am involved in a downstream project (ManifoldCF) that has a Solr integration via SolrJ, so I have an interest in getting this stuff working.\n\nMy suggestion, for now, is to create a separate ticket to work on the use of deprecated httpclient classes, but do this as a later step.  For now, though, it would be great to just list them.  I'll likely have a similar situation to deal with in ManifoldCF. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13860282",
            "date": "2014-01-02T16:03:38+0000",
            "content": "Thanks Karl! We should do this for 4.7. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13860584",
            "date": "2014-01-02T18:43:25+0000",
            "content": "Mark Miller, I take your comment to mean that this should not be backported to 4.6.1.  I'm OK with that - httpclient is a pretty important component.  The change seems pretty harmless, but users are a creative bunch, if there's even a remote chance for something to go wrong, someone will find it! "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13861152",
            "date": "2014-01-03T03:13:17+0000",
            "content": "Tests and precommit passed on trunk.  Committing there.  Will merge to 4x and verify. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13861154",
            "date": "2014-01-03T03:14:33+0000",
            "content": "Commit 1555004 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1555004 ]\n\nSOLR-5590: Upgrade HttpClient/HttpComponents to 4.3.x. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13861288",
            "date": "2014-01-03T07:26:39+0000",
            "content": "It only took a couple of test runs on trunk to get the tests to pass, but I had to run it a bunch of times on branch_4x.  It was a semi-repeatable failure that you can see with the following commandline (tested on Linux):\n\nant test Dtestcase=CollectionsAPIDistributedZkTest -Dtests.method=testDistribSearch\n\nThe same failure happens on a clean 4x checkout with similar frequency, so I don't think this change has caused any new problems.  The precommit passed on the first try.  I'll go ahead and commit. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13861291",
            "date": "2014-01-03T07:28:19+0000",
            "content": "Commit 1555022 from Shawn Heisey in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1555022 ]\n\nSOLR-5590: Upgrade HttpClient/HttpComponents to 4.3.x. (merge trunk r1555004) "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13861594",
            "date": "2014-01-03T15:25:43+0000",
            "content": "Thank you for the patch, Karl! "
        },
        {
            "author": "Karl Wright",
            "id": "comment-13861598",
            "date": "2014-01-03T15:28:49+0000",
            "content": "You're welcome. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13862592",
            "date": "2014-01-05T16:47:08+0000",
            "content": "It was a semi-repeatable failure\n\nShawn Heisey, can you open a JIRA issue for that if there is not one? Or point to a failed jenkins run for that? Anything someone sees too often locally, I'm happy to help harden.  "
        }
    ]
}