{
    "id": "SOLR-11875",
    "title": "merge SolrConfigXml wiki into Solr Reference Guide",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation",
            "website"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The default and example solrconfig.xml currently point to the https://wiki.apache.org/solr/SolrConfigXml page, might we change that perhaps to point into the Solr Reference Guide (and merge content from the wiki into the ref guide where appropriate)?\n\n\n<!--\n      For more details about configurations options that may appear in\n-     this file, see http://wiki.apache.org/solr/SolrConfigXml.\n+     this file, see https://lucene.apache.org/solr/guide/7_x/configuring-solrconfig-xml.html.\n-->\n\n\n\nImplementation detail: the 7_x in the above would need to be an actual 7_3 etc. version in each release.",
    "attachments": {
        "SOLR-11875.patch": "https://issues.apache.org/jira/secure/attachment/12906864/SOLR-11875.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-07-31T18:48:45+0000",
            "content": "The obstacle here is the need to change the version dynamically, which is the same problem discussed in SOLR-11143, but in that case we were talking only about the v2 API spec files.\n\nThat issue stemmed from SOLR-10848, where I added new Ref Guide links to the specs without defining a version at all (they will always redirect to the latest version). We sort of really had to then, though, the old Ref Guide was broken and a redirect to the new location wasn't in place yet.\n\nThe links changed with the patch are really generic - they all go to the parent page of a larger section that has child pages for the various sections of a solrconfig.xml file. There is little about the page we're pointing them at that will change release-to-release. It's the info they get after that point that could be incorrect for them.\n\nIt's for sure wrong to point users at the wrong version, but it's also wrong to continue to point them at a Solr Wiki page that hasn't really been updated since 2013 (except for 2 tiny edits in 2016). Which is worse? If we can't solve SOLR-11143 yet, then wouldn't it be better to at least get users to a place where they might be able to find the docs for their version? ",
            "author": "Cassandra Targett",
            "id": "comment-16564185"
        },
        {
            "date": "2018-08-10T16:16:39+0000",
            "content": "Hmm, yeah, indeed it seems http://wiki.apache.org/solr/SolrConfigXml is not unique i.e. other wiki.apache.org/solr pages are also mentioned in the release files. I wonder if it would be possible to somehow 'sign-post' from all-or-most solr wiki pages towards the Solr Reference Guide? ",
            "author": "Christine Poerschke",
            "id": "comment-16576507"
        }
    ]
}