{
    "id": "SOLR-9462",
    "title": "Report aggregated cache stats for all cores on a Solr node",
    "details": {
        "components": [
            "JMX"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.2",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Solr caches are major memory consumers and Solr cache metrics are critical in memory tuning. However in current implementation, only cache metrics for individual collection is available. To get the same metrics for a collection alias, which may cover tens collections, the only way is to aggregate metrics from each collection for the collection alias manually or using an external tool.\n\nThe JIRA is to provide cache metrics for a collection alias to simplify the memory tuning for collection alias.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-06T18:24:02+0000",
            "author": "Michael Sun",
            "content": "One idea is to create a type of 'virtual cache' as a subclass of SolrCache. A collection alias has virtual caches which doesn't do caching but provides aggregated stats for caches used in SolrIndexSearcher represented by the collection alias.\n\nOne question: how to find out SolrIndexSearcher instances using collection name? It's necessary because in Aliases instance, there is only the name of collections for a collection alias.  ",
            "id": "comment-15468125"
        },
        {
            "date": "2016-12-12T20:22:27+0000",
            "author": "Mark Miller",
            "content": "We don't actually do per collection now - we do per SolrCore. See https://issues.apache.org/jira/browse/SOLR-9858 and https://issues.apache.org/jira/browse/SOLR-4735 for related discussion. ",
            "id": "comment-15743036"
        },
        {
            "date": "2016-12-14T23:31:38+0000",
            "author": "Michael Sun",
            "content": "Ah, I see. There is no cache stats for collection in current implementation. Therefore it can be hard to get cache stats for collection alias.\n\nI think what is useful is to report aggregated cache stats for all cores in one Solr node. For Solr installation with multiple cores, particularly with 10+ cores, it's time consuming to go over each core to get stats from UI. Therefore aggregated stats can help.\n\nAlso rename the JIRA title to reflect the idea. ",
            "id": "comment-15749831"
        }
    ]
}