{
    "id": "SOLR-6055",
    "title": "TestMiniSolrCloudCluster has data dir in test's CWD",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "While investigating one of the test failures created when tightening test permissions to restrict write access to CWD (see LUCENE-5650), I've found TestMiniSolrCloudCluster is attemping to write transaction logs to $CWD/data/tlog.\n\nI've traced this down to two things which are happening:\n\n\tThe test uses RAMDirectoryFactory, which always returns true for isAbsolute.  This causes the directory factory to not adjust the default relative to bring it under the instance dir.\n\tThe UpdateLog creates its tlog file with the relative data dir.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan Ernst",
            "id": "comment-13994145",
            "date": "2014-05-10T05:18:39+0000",
            "content": "I think the real problem is the transaction log uses the dataDir, which is supposedly controlled by the directory factory.  Either the transaction log needs its own dir, or we should always make sure dataDir is an absolute path in the local filesystem. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13994193",
            "date": "2014-05-10T08:46:38+0000",
            "content": "I don't know how to fix it either, sadly. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13998335",
            "date": "2014-05-15T00:49:33+0000",
            "content": "The transaction log does have it's own dir as far as I remember - it just defaults to being relative to the data dir I think.\n\nSeems to me the likely right thing to do is simply throw an init exception when the transaction log doesn't have it's own full path and an ephemeral directory factory is used. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13998339",
            "date": "2014-05-15T00:52:20+0000",
            "content": "right thing to do i\n\nOr at least the easy thing to do. It may make sense to look at other options for the isAbsolute impl for an ephemeral dir factory. "
        },
        {
            "author": "Ryan Ernst",
            "id": "comment-13999523",
            "date": "2014-05-16T01:47:44+0000",
            "content": "I successfully fixed this by adding a separate ulogDir to SolrCore, and then making sure this is absolute in the local filesystem (not using directory factory).  See LUCENE-5650.  I can put it into a separate patch if you think it is important, it was just easier to verify on that other issue, and also required a change to the base temp dir to be absolute. "
        },
        {
            "author": "Ryan Ernst",
            "id": "comment-14003447",
            "date": "2014-05-20T15:31:26+0000",
            "content": "Rolling back into LUCENE-5650. "
        }
    ]
}