{
    "id": "SOLR-9797",
    "title": "Admin UI not opening/working",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.3",
        "status": "Resolved",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "Just to give a background, currently I am working on an application in which I am using SOLR 5.10 to implement search. As part of the requirement, I was trying to implement LTR but could not apply the patch and as per the directions given to me in the ticket https://issues.apache.org/jira/browse/SOLR-8542, I am upgrading my SOLR version to 6.x.\n\nI have done setting up the SOLR 6.3 as how I did the setup of SOLR 5.10 in Eclipse + Apache Tomcat. When I start the server for SOLR 6.3, I see the server is starting properly with collections however I am getting \"HTTP Status 403 - Access to the requested resource has been denied\" instead of the SOLR admin console (Attaching the screen shot for your reference). \nBut the same works for SOLR 5.10.\n\nCould you help me providing your suggestion to resolve this and make it work? Do I need to make a configuration changes?",
    "attachments": {
        "Screen Shot 2016-11-24 at 12.53.29 PM.png": "https://issues.apache.org/jira/secure/attachment/12840383/Screen%20Shot%202016-11-24%20at%2012.53.29%20PM.png",
        "Screen Shot 2016-11-24 at 12.37.25 PM.png": "https://issues.apache.org/jira/secure/attachment/12840382/Screen%20Shot%202016-11-24%20at%2012.37.25%20PM.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-11-24T08:10:38+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Tomcat is no longer supported as a host for Solr. Only the black-box setup it ships with is now possible. Internally, it is Jetty, but that may go away at some point as well. ",
            "id": "comment-15692594"
        },
        {
            "date": "2016-11-24T11:12:20+0000",
            "author": "adeppa",
            "content": "Thanks for the information ,please help me how to setup source and run through the eclipse using jetty. if have any document please share with me \n\nThanks  ",
            "id": "comment-15692995"
        },
        {
            "date": "2016-11-24T11:47:45+0000",
            "author": "Alexandre Rafalovitch",
            "content": "The ant command has eclipse target when you download the source. I would start from that. I haven't done that myself though, so not sure how far it gets you. ",
            "id": "comment-15693064"
        },
        {
            "date": "2016-11-24T13:13:23+0000",
            "author": "adeppa",
            "content": "sorry i done that command and imported into eclipse and i want run along with admin UI ,please let me know any another way for this \n\nThanks  ",
            "id": "comment-15693264"
        },
        {
            "date": "2016-11-24T13:20:07+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I think you may find better answers at the mailing list, perhaps people experienced with her. There is no specific bug to fix here.\n\nI would recommend doing a very specific email with version of Solr, exact steps you've done, what you expected to see and what you actually see. That way people know where you stuck. ",
            "id": "comment-15693278"
        },
        {
            "date": "2016-11-24T15:54:25+0000",
            "author": "Erick Erickson",
            "content": "This discussion is more appropriate for the user's list, If it's determined that there are code issues we should open a new JIRA. ",
            "id": "comment-15693594"
        }
    ]
}