{
    "id": "SOLR-2573",
    "title": "Standard handler assumed as default in test breaks subclassing tests",
    "details": {
        "affect_versions": "3.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "'standard' is still specified as default qtype in TestHarness and SolrTestCaseJ4, which makes tests that rely on the default fail.",
    "attachments": {
        "SOLR-2573.patch": "https://issues.apache.org/jira/secure/attachment/12481242/SOLR-2573.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Gabriele Kahlout",
            "id": "comment-13042821",
            "date": "2011-06-02T15:21:48+0000",
            "content": "Replaces qtype in affected test classes with StringUtils.EMPTY. Tested on own subclassing test (should probably have also added a test Solr case that indeed depends on the test value =( )  "
        },
        {
            "author": "Gabriele Kahlout",
            "id": "comment-13064444",
            "date": "2011-07-13T09:09:24+0000",
            "content": "some test classes may have to be adjusted too? (I don't know how they currently work).\n\npublic class AlternateDirectoryTest extends SolrTestCaseJ4 {\n  @BeforeClass\n  public static void beforeClass() throws Exception {\n    initCore(\"solrconfig-altdirectory.xml\", \"schema.xml\");\n  }\n\n  /**\n   * Simple test to ensure that alternate IndexReaderFactory is being used.\n   * \n   * @throws Exception\n   */\n  @Test\n  public void testAltDirectoryUsed() throws Exception {\n    assertQ(req(\"q\",\"*:*\",\"qt\",\"standard\")); //STANDARD DOESN'T EXIST ANYMORE\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13066169",
            "date": "2011-07-15T20:16:38+0000",
            "content": "\n\nI don't think we should make this change\n\nIt's true that applying this patch would allow tests that want to use the default handler to work w/o explicitly asking for that handler, but it would break all existing tests for users who have test configs with a requestHandler defined named \"standard\" (which is not the default).  \n\nUsers who want to specify a differnet default handler name in their tests can continue to do what they have always done:\n\n\texplicitly set lrf.qtype=\"\" in the setup of their test class\n\tspecify a \"qt\"=\"\" param when making a call to lrf.makeRequest() or req() in the test methods\n\n\n\nsome test classes may have to be adjusted too? (I don't know how they currently work).\n...\nassertQ(req(\"q\",\":\",\"qt\",\"standard\")); //STANDARD DOESN'T EXIST ANYMORE\n\nwhile we no longer suggest/recommend naming a requestHandler \"standard\" in the example solrconfig.xml file, requestHandler's named \"standard\" do in fact exist in many of the test configs\n\n\nThere are definitely improvements that can/should be made to the TestHarness and the LocalRequestFactory (neither of which have really kept up with all the changes in Solr over the years) but those improvements should be in the direction of changing the APIs and eliminating the extra layer of \"defaults\" in those classes that already exist in the SolrCore – as long as we have those test apis/defaults, the defaults need to remain the same for back compat. "
        }
    ]
}