{
    "id": "SOLR-2178",
    "title": "Use the Velocity UI as the default tutorial example",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The /browse example in solr/example is much nicer to look at and work with, we should convert the tutorial over to use it so as to present a nicer view of Solr's capabilities.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-12922961",
            "date": "2010-10-20T13:46:13+0000",
            "content": "I've been adding a few things to the /browse capability that showcase more of Solr's capabilities (all the different facets, examples of function queries, etc.)  I think if we can showcase more of these things in a nice UI, the tutorial will be more compelling.  I also think we should make /browse the landing page for http://.../solr instead of that empty looking page that points to the admin that is there now (assuming we add links to the Admin on /browse) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12922971",
            "date": "2010-10-20T14:02:34+0000",
            "content": "Yeah, I've been meaning to mention that we should add /browse to the tutorial somehow.\nMaking it the landing page seems a good idea too (should it have an admin link?)\n\nNot sure about your wording of \"convert the tutorial over\" though - a demonstration of the lowest level basics remains very important.  We also want to continue to avoid putting everything into the tutorial too - its there to give people some grounding to understand the rest of the solr documentation, to let them quickly feel successful, and to give them an idea of what's possible. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12922976",
            "date": "2010-10-20T14:16:48+0000",
            "content": "Yeah, \"convert\" is too strong of a word.  I think what we want is more of a progression.  Start off with the UI so that people aren't overwhelmed by XML and then peel back the layers to the deeper stuff. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12923503",
            "date": "2010-10-21T16:33:41+0000",
            "content": "Just checked in some more changes along this line:\n\n\n\tAdded \"toggleable\" tooltips (click the \"enable annotation\" link at the bottom) so that when you hover over the facet headings, the boost by price check box, etc. you will get a tooltip describing what it does.\n\tAdded a link to the Solr admin\n\tCalled out the various facet types more explicitly.\n\n "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12923628",
            "date": "2010-10-21T20:51:56+0000",
            "content": "Committed support for spatial filtering (and map display), more like this, also switched the default defType to edismax. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12923931",
            "date": "2010-10-22T17:34:13+0000",
            "content": "I also think we should make /browse the landing page for http://.../solr\n\nI don't think that's possible.\n\n\"http://localhost:8983/solr\" is a simple page that redirects you to each of the cores – in a single core setting it has one link to hte admin page, but in a multi-core setup it links to the admin page for each core.\n\nIt can't really use the VelocityWriter because it doesn't have a SolrCore to work with. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12925137",
            "date": "2010-10-26T21:01:23+0000",
            "content": "Hooked in Clustering example, if -Dsolr.clustering.enabled=true.  Otherwise, it shows a message saying to add that parameter.\n\nCommitted revision 1027743. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412160",
            "date": "2012-07-11T22:26:12+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13422194",
            "date": "2012-07-25T12:25:49+0000",
            "content": "Is this relevant as long as Velocity is a contrib?\n\nBut how about the new fancy Admin GUI detecting whether \"/browse\" exists, and if it does, add a link to it? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13422199",
            "date": "2012-07-25T12:33:40+0000",
            "content": "Is this relevant as long as Velocity is a contrib?\n\nDo we highlight Solr Cell or DIH in the tutorial?   (sorry, not looking at the latest at the moment)  Same argument there.\n\nBut how about the new fancy Admin GUI detecting whether \"/browse\" exists, and if it does, add a link to it?\n\nnah.... let's not do that.  The built-in stuff shouldn't look for specific contribs like this.\n\nPerhaps the tutorial itself should be built into the Solr \"example\" configuration rather than external, that way it's all internally consistent with the configuration that it is leveraging. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13422749",
            "date": "2012-07-26T00:04:50+0000",
            "content": "nah.... let's not do that. The built-in stuff shouldn't look for specific contribs like this.\n\nI agree that it shouldn't, but the GUI shows DIH stuff, which is also a contrib. Since Solritas is distributed with Solr, and highly useful, perhaps such a hardcoding is not that bad afterall. A less intrusive alternative is to provide a link in admin-extra.html \n\n<a href=\"collection1/browse\">Solritas demo GUI</a>\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429797",
            "date": "2012-08-07T03:43:08+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452220",
            "date": "2012-09-10T17:41:58+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717325",
            "date": "2013-07-23T18:47:52+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971369",
            "date": "2014-04-16T12:57:54+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}