{
    "id": "SOLR-7133",
    "title": "Solr is required to be restarted after updating with flume",
    "details": {
        "components": [
            "Data-driven Schema"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.3",
        "status": "Closed",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "After updating Solr with Flume the Solr is required to be restarted before the updates get listed with /select query. Shouldn't the updates get listed with /select query without restarting Solr as with updating from the Solr Admin Console?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-20T23:25:08+0000",
            "author": "Shawn Heisey",
            "content": "This should have been brought up on the mailing list first, rather than going into the bug tracker.\n\nIf flume is not sending a commit (and Solr is not configured with relevant autoCommit and/or autoSoftCommit settings), then any updates that have been done will not be visible.  Very likely flume has a way to send the commit, but I have no experience with it, so I do not know where.\n\nhttp://lucidworks.com/blog/understanding-transaction-logs-softcommit-and-commit-in-sorlcloud/\n\nThat article title says \"SolrCloud\" but the concepts are applicable to Solr in general.\n\nWhat I've found to be good autoCommit settings are: 1) autoCommit with a maxTime of five to fifteen minutes and openSearcher set to false.  2) autoSoftCommit with a maxTime that represents the most time you can stand to wait for new documents to show up.  I personally would not configure autoSoftCommit with an interval shorter than one minute.\n\nmaxTime is in milliseconds, so five minutes is 300000. ",
            "id": "comment-14329740"
        },
        {
            "date": "2015-02-20T23:25:52+0000",
            "author": "Shawn Heisey",
            "content": "In the unlikely event that this does turn out to be a bug, the issue can be re-opened. ",
            "id": "comment-14329745"
        },
        {
            "date": "2015-02-21T01:55:14+0000",
            "author": "DeepakVohra",
            "content": "Flume does have configuration settings for transaction commit.\n\n\"batchDurationMillis 1000 The maximum duration per flume transaction (ms). The transaction commits after this duration or when batchSize is exceeded, whichever comes first. \n\nbatchSize 1000 The maximum number of events to take per flume transaction. \"\n\nBut the batchDurationMillis is only 1000 ms. \n\nAlso the output on Solr server indicates a hard commit. The Solr server output is as follows.\n\n\"Hard AutoCommit: if uncommited for 15000ms; \nSoft AutoCommit: disabled\n\nINFO  org.apache.solr.update.UpdateHandler    start commit\n{,optimize=false,openSearcher=false,waitSearcher=true,expungeDeletes=false,softCommit=false,prepareCommit=false}\n\nSolrDeletionPolicy.onCommit: commits: num=2\n\tcommit{dir=NRTCachingDirectory(NIOFSDirectory@/flume/solr-4.10.3/example/solr/collection1/data/index\n\nend_commit_flush\"\n\nBut, still the /select query in the Solr Admin Console does not list the updates till the Solr server is restarted. ",
            "id": "comment-14329912"
        },
        {
            "date": "2015-02-21T02:06:59+0000",
            "author": "Shawn Heisey",
            "content": "INFO  org.apache.solr.update.UpdateHandler    start commit{,optimize=false,openSearcher=false,waitSearcher=true,expungeDeletes=false,softCommit=false,prepareCommit=false}\n\nNotice in that log line that it says \"openSearcher=false\" ?  A new searcher has not been opened, so the original searcher will be used for searches, and it is not aware of the new segments created by the updates and the commit.  Adding autoSoftCommit to the config as well as autoCommit should solve this problem, but if you want all of the updates in a particular batch to be done before the changes are visible, then it might not be the right thing to do.\n\nI bet that your autoCommit setting which has a maxTime of 15000 also has openSearcher set to false.  With this config, you will never see your new documents unless your update process sends an explicit commit with openSearcher=true, or you restart Solr.\n\nI don't know what to say about the flume batchDurationMillis setting.  You will need to find a support venue for flume.\n\nhttp://flume.apache.org/mailinglists.html\n\nIf you want to continue this discussion about Solr, please use the mailing list or IRC.  This issue tracker is not the correct place.\n\nhttp://lucene.apache.org/solr/resources.html#community ",
            "id": "comment-14329918"
        },
        {
            "date": "2015-02-21T16:01:07+0000",
            "author": "DeepakVohra",
            "content": "The issue may be closed. \n\nBut as a feature suggestion the default value of openSearcher should be true. \nWhat is the purpose of setting openSearcher=false? ",
            "id": "comment-14330328"
        },
        {
            "date": "2015-02-22T01:30:28+0000",
            "author": "Shawn Heisey",
            "content": "The default value of openSearcher on a hard commit is already true.  In order to make it false, it must be explicitly set to false.  This default was established so that people who were used to the way that Solr 1.x and 3.x (which did not have the openSearcher parameter) behaved on a commit would not suddenly have new behavior when they performed the same action on Solr 4.x.  Soft commits and the transaction log are new features in 4.x.  Those new features required the addition of the openSearcher feature.\n\nThe openSearcher value controls whether or not a new searcher will be opened when the commit finishes – whether any changes to the index will be visible or not.  Did you read the URL about understanding transaction logs, hard commits, and soft commits?  That article discusses openSearcher.\n\nhttp://lucidworks.com/blog/understanding-transaction-logs-softcommit-and-commit-in-sorlcloud/\nhttps://issues.apache.org/jira/browse/SOLR-3069 ",
            "id": "comment-14331981"
        },
        {
            "date": "2015-02-22T16:20:11+0000",
            "author": "DeepakVohra",
            "content": "In which Solr version is openSearcher true? Solr 4.10.3 has the following setting in solrconfig.xml.\n\n<autoCommit> \n       <maxTime>${solr.autoCommit.maxTime:15000}</maxTime> \n       <openSearcher>false</openSearcher> \n     </autoCommit> ",
            "id": "comment-14332248"
        },
        {
            "date": "2015-02-22T18:24:55+0000",
            "author": "Shawn Heisey",
            "content": "That's an example config – specifically for autoCommit.  Solr itself defaults to openSearcher=true when you send a commit to the update handler, or if you do not specify openSearcher on the autoCommit config.\n\nSince 4.0, we strongly recommend using openSearcher=false with autoCommit.  The idea behind that recommendation is that Solr will automatically do commits that start new transaction logs but it will not automatically make new documents visible.  There are other mechanisms for document visibility.\n\nIf you want to automatically do commits for document visibility, you have two choices: use autoSoftCommit, or use the commitWithin parameter on your update requests.  You always have the option of making your application entirely responsible for document visibility by sending manual soft commits.  It can do hard commits too, but if you have autoCommit, there's no reason to do the more expensive hard commits.\n\nBecause this is not a bug and I've covered all the important discussion points about commits, I will offer no more advice here.  Use the mailing list or the IRC channel.  I am present on both. ",
            "id": "comment-14332279"
        }
    ]
}