{
    "id": "SOLR-12931",
    "title": "Move Solr's ExitableDirectoryReader test to it's own package",
    "details": {
        "type": "Test",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Major",
        "resolution": "Unresolved",
        "affect_versions": "None"
    },
    "description": "",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16664371",
            "content": "Context to the quesion : I started looking at SOLR-12906 and DelayingSearchComponent caught my eye as it was under the ( org.apache.solr.search ) package. After spending a couple of minutes I figured this has to do with tests around ExitableDirectoryReader\n\nLet's use ExitableDirectoryReader as the feature in context that we wanted to test - We wrote a test for single core and then a cloud test. I think this is a typical pattern where the single core test can be more exhaustive, but we want to write a cloud test to make sure it works in the distributed case as well\n\nBoth are integration tests.\n\nDelayingSearchComponent is the helper class and in the ( org.apache.solr.search ) package\n CloudExitableDirectoryReaderTest is the test that uses this and is in the ( org.apache.solr.cloud ) package\n ExitableDirectoryReaderTest is the single core test for this in the ( org.apache.solr.core ) package\n\nProposing that we move these three classes to it's own package as a first pass.\n When we make a clear distinction of mock vs integration tests we could move this package under integration ",
            "author": "Varun Thacker",
            "date": "2018-10-25T22:40:35+0000"
        },
        {
            "id": "comment-16664383",
            "content": "I'm not sure if we should move this test to it's own package. What else do you see becoming a part of the package in the longer run?\n\nJust trying to see what I'm missing here  ",
            "author": "Anshum Gupta",
            "date": "2018-10-25T22:50:16+0000"
        },
        {
            "id": "comment-16664399",
            "content": "Nothing else would be added in the future , but it helps new devs understand where a feature test lies ?\n\nToday the same feature's test is spread across three packages.\n\nDo you think isolating packges for dedicated features is a bad idea? Overkill? ",
            "author": "Varun Thacker",
            "date": "2018-10-25T23:03:38+0000"
        },
        {
            "id": "comment-16664405",
            "content": "It might confuse users in terms of too  many packages to look at and figure out where things are. I would like to consolidate them but not in their own package, that possibly then gets split into unit vs integration tests. ",
            "author": "Anshum Gupta",
            "date": "2018-10-25T23:12:22+0000"
        },
        {
            "id": "comment-16664477",
            "content": "Fair enough.  Move all 3 classes to - org.apache.solr.search ? ",
            "author": "Varun Thacker",
            "date": "2018-10-26T00:49:35+0000"
        },
        {
            "id": "comment-16677203",
            "content": "+1 on putting them in the same place. Things are often weirdly spread out and it can be hard to know what exists. ",
            "author": "Mark Miller",
            "date": "2018-11-06T19:22:34+0000"
        }
    ]
}