{
    "id": "SOLR-5755",
    "title": "Document the new 'migrate' collection API",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7"
        ],
        "components": [
            "documentation",
            "SolrCloud"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Document the new 'migrate' collection API in the Solr reference guide.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13911803",
            "date": "2014-02-25T18:02:27+0000",
            "content": "Here's what I have so far:\n\nMigrating documents to their own collection:\n\n/admin/collections?action=MIGRATE&collection=name&split.key=key1!&target.collection=target_collection&forward.timeout=60\n\nThe MIGRATE command is used to migrate all documents having the given routing key to another collection. The source collection will continue to have the same data as-is but it will start re-routing write requests to the target collection for the number of seconds specified by the forward.timeout parameter. It is the responsibility of the user to switch to the target collection for reads and writes after the ‘migrate’ command completes.\n\nThe routing key specified by the ‘split.key’ parameter may span multiple shards on both the source and the target collections. The migration is performed shard-by-shard in a single thread. One or more temporary collections may be created by this command during the ‘migrate’ process but they are cleaned up at the end automatically.\n\nThis is a synchronous operation and therefore keeping a large read timeout on the invocation is advised. The request may still timeout due to inherent limitations of the Collection APIs but that doesn’t necessarily mean that the operation has failed. Users should check logs, cluster state, source and target collections before invoking the operation again.\n\nThis command works only with collections having the compositeId router. The target collection must not be receiving any writes during the time the migrate command is running otherwise they some writes may be lost.\n\nPlease note that the migrate API does not perform any deduplication on the documents so if the target collection contains documents with the same uniqueKey as the documents being migrated then the target collection will end up with duplicate documents.\n\nList of parameters and defaults "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13912200",
            "date": "2014-02-25T22:54:30+0000",
            "content": "shalin: it seems like you posted the text here, and then also updated the ref guide already...\n\nhttps://cwiki.apache.org/confluence/pages/diffpagesbyversion.action?pageId=32604284&selectedPageVersions=46&selectedPageVersions=43\n\n\n...is there any reason why this issue isn't resolved? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13912529",
            "date": "2014-02-26T05:13:54+0000",
            "content": "No reason, Hoss. Just forgot to resolve it here. Thanks for the reminder. "
        }
    ]
}