{
    "id": "SOLR-1410",
    "title": "remove deprecated custom encoding support in russian/greek analysis",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In this case, analyzers have strange encoding support and it has been deprecated in lucene.\n\nFor example someone using CP1251 in the russian analyzer is simply storing Ж as 0xC6, its being represented as Æ\n\nLUCENE-1793: Deprecate the custom encoding support in the Greek and Russian\n    Analyzers. If you need to index text in these encodings, please use Java's\n    character set conversion facilities (InputStreamReader, etc) during I/O, \n    so that Lucene can analyze this text as Unicode instead.\n\nI noticed in solr, the factories for these tokenstreams allow these configuration options, which are deprecated in 2.9 to be removed in 3.0\n\nLet me know the policy (how do you deprecate a config option in solr exactly, log a warning, etc?) and I'd be happy to create a patch.",
    "attachments": {
        "SOLR-1410.patch": "https://issues.apache.org/jira/secure/attachment/12418576/SOLR-1410.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12751177",
            "date": "2009-09-03T21:35:13+0000",
            "content": "I don't think we've ever really had a situation like this ...logging a warning seems like the right course of action for now ... then once the functionality is removed, we can change the factory to fail on init if it sees the option is still set in the schema.xml "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12751180",
            "date": "2009-09-03T21:41:17+0000",
            "content": "thanks, I will work on a patch later that logs a warning if you try to use a configuration option for anything but Unicode for these two analyzers! "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12751274",
            "date": "2009-09-04T02:44:54+0000",
            "content": "for russian and greek analysis factories, warn users if they try to use the deprecated charset parameter. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12751374",
            "date": "2009-09-04T09:02:39+0000",
            "content": "I don't think we've ever really had a situation like this ...logging a warning seems like the right course of action for now ... \n\nWe actually have done this in DataImportHandler in relation to the syntax for evaluators. Logging a warning is the right way to go. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12752868",
            "date": "2009-09-09T02:19:59+0000",
            "content": "are there any issues with this... care if i set version 1.4?\n\nreally hoping to remove these pseudo-charsets after the lucene 2.9 release  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12752890",
            "date": "2009-09-09T03:58:42+0000",
            "content": "Committed revision 812760.\n\nthanks robert "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12761309",
            "date": "2009-10-01T19:31:12+0000",
            "content": "Hi, I just removed these deprecations for Lucene 3.0 (which does not affect 1.4)\n\nHowever, in doing so I noticed that with the custom charset removed, RussianLowerCaseFilter is really exactly the same as LowerCaseFilter.\nI've marked this RussianLowerCaseFilter as deprecated to be removed in Lucene 3.1\n\nWill there be a Solr release based on Lucene 3.0, or will 1.5 be based on 3.1? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12761481",
            "date": "2009-10-02T05:54:17+0000",
            "content": "Will there be a Solr release based on Lucene 3.0, or will 1.5 be based on 3.1?\n\nI guess it is too early to say. But Solr releases do take time so if I had to guess it is likely that 1.5 will go out with Lucene 3.1 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12761593",
            "date": "2009-10-02T14:29:03+0000",
            "content": "ok, I guess anyway this isn't an issue. \nif 1.5 goes out with 3.1, RussianLowerCaseFilterFactory can be implemented with LowerCaseFilter, but marked deprecated to be removed in 1.6 "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775865",
            "date": "2009-11-10T15:52:14+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}