{
    "id": "SOLR-2634",
    "title": "Publish nightly snapshots, please",
    "details": {
        "affect_versions": "3.4,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "Build"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "If you added 'mvn deploy' to the jenkins job, the nightly snapshots would push to repository.apache.org as snapshots, where maven could get them without having to manually download and deploy them. Please?",
    "attachments": {
        "SOLR-2634.patch": "https://issues.apache.org/jira/secure/attachment/12485592/SOLR-2634.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13059959",
            "date": "2011-07-05T15:38:26+0000",
            "content": "do most apache projects that use java do this?\n\ni don't use/care about maven, but we've gotten very hostile emails/jira from people in the past syaing that we are advertising/linking to the nightly build artifacts too prominently, and others still saying that we shouldn't even offer any links to download nightly artifacts - i can't imagine that folks thinking a download link is too much would be very happy about us putting nightly builds in a public maven repo where people can use it w/o even needing to search for a link. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13059966",
            "date": "2011-07-05T15:47:04+0000",
            "content": "Some project do, some don't. \n\nI am currently debugging a maven incompatibility between jenkins-as-a-maven-repo some of maven itself. Pushing to nexus snapshots is a workaround.\n\nThe hostility presumably comes from people who think that someone will misunderstand this to be a 'real apache release'. I personally don't see a problem with a relatively prominent link so long as the not-a-release status is clear, but far be it from me to push you into the line of fire. If you added 'deploy' to the jenkins job, you'd solve my immediate problem without prejudice to the publicity question. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13059968",
            "date": "2011-07-05T15:50:45+0000",
            "content": "I am currently debugging a maven incompatibility between jenkins-as-a-maven-repo some of maven itself. Pushing to nexus snapshots is a workaround.\n\nBenson, does this mean that you know about the nightly maven snapshots available from Jenkins?  If not: http://wiki.apache.org/lucene-java/HowNightlyBuildsAreMade "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13059973",
            "date": "2011-07-05T16:02:06+0000",
            "content": "Yes I do. When you ask the wagon-maven-plugin to look at those, it explodes, due to a nested gnarly mess which I am currently working on. Pushing to repository.apache.org would circumvent that, since it might take some doing to get this bug fixed and the fix released. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13059979",
            "date": "2011-07-05T16:12:04+0000",
            "content": "I'll look into publishing on repository.apache.org. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13060012",
            "date": "2011-07-05T17:16:12+0000",
            "content": "If you added 'deploy' to the jenkins job, you'd solve my immediate problem without prejudice to the publicity question.\n\nmy concern is that if people feel like advertising nightly build download links (with big disclaimers about unreleased code next to them) is too dangerous,  then pushing those same nightly build artifacts to a public repo where folks can use them w/o ever reading those disclaimers seems much worse.  "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13060028",
            "date": "2011-07-05T17:34:15+0000",
            "content": "the 'snapshot' repo at repository.apache.org stores, only, non-releases. Releases go into the 'release' repo. So no sane person has any business complaining about this unless they want to campaign to turn off that repo altogether. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13060032",
            "date": "2011-07-05T17:44:22+0000",
            "content": "Lucene/Solr's maven artifacts are built by Ant and then published with corresponding POMs.  maven-release-plugin is not involved in the process; instead, Maven Ant Tasks's <artifact:deploy> task is used to populate a local repository with the Ant-built artifacts.  This is the method used to generate the Jenkins-hosted Maven snapshot artifacts.\n\nI looked at the Apache Guide to Publishing Maven Artifacts.  Snapshots are mentioned, but it appears that it's not possible to go through the process of setting up to deploy snapshots without also locking the project into deploying releases in the same way.  I don't want to rock the boat where Maven artifact releases are concerned, given that what we currently have works: we just scp the Maven Ant Tasks-built local repo to the ibiblio rsync repo on people.apache.org, and it automatically gets uploaded to central at least once a day.\n\nIf I'm reading the Apache Jar Repositories FAQ properly, there is an equivalent spot on people.apache.org for snapshots.  I'd be willing to set up a cron job under my account on people.apache. org to download the nightly snapshots produced by Jenkins and put them under /www/people.apache.org/repo/m2-snapshot-repository/.  There are already some ancient Lucene snapshot artifacts there.\n\nBenson, do you think this would work for you? "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13060040",
            "date": "2011-07-05T17:53:17+0000",
            "content": "Steve,\n\nYes, a plain old HTML repo would work. However, I also think that the ant tasks could be asked nicely to push to snapshots.apache.org. If you send me the svn coordinates of the ant file you're using, I'll see if I have a useful suggestion to offer tonight.\n\n--benson "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13060053",
            "date": "2011-07-05T18:25:05+0000",
            "content": "anything wrong with just adding the nightly repo to your pom.xml?\n\n\n   <repository>\n     <id>lucene-jenkins-trunk</id>\n     <name>Lucene jenkins trunk</name>\n     <url>https://builds.apache.org/job/Lucene-Solr-Maven-trunk/lastSuccessfulBuild/artifact/maven_artifacts</url>\n     <layout>default</layout>\n     <snapshots>\n       <enabled>true</enabled>\n     </snapshots>\n   </repository>\n\n\n\nadding to the apache snapshot repo could be OK, but I kind of like that this one does not include other apache products\n\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13060054",
            "date": "2011-07-05T18:26:07+0000",
            "content": "I also think that the ant tasks could be asked nicely to push to snapshots.apache.org.\n\nBenson, you sidestepped my argument against this - can you look at the guide and let me know if you disagree with my assessment about Lucene/Solr releases?  Because I personally don't plan on changing the release process just so you can work around a Maven problem with the Jenkins nightly artifacts.\n\nAnother argument against this is that a private SSH key is required to perform the deploy to a non-local repo.  Any ideas on protecting one of those on builds.apache.org, but still making it available to Jenkins?\n\nAre you familiar with how this is done with other projects?\n\nIf you send me the svn coordinates of the ant file you're using, I'll see if I have a useful suggestion to offer tonight.\n\nLucene and Solr have separate implemetations that look very similar.\n\nLucene's version is in the generate-maven-artifacts target in build.xml and the m2-deploy macro in common-build.xml under this directory: http://svn.apache.org/repos/asf/lucene/dev/branches/branch_3x/lucene/\n\nSolr's version is in the same target/macro/file names under http://svn.apache.org/repos/asf/lucene/dev/branches/branch_3x/solr/. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13060057",
            "date": "2011-07-05T18:31:38+0000",
            "content": "I am guilty as charged of ducking. Give me some time to do a decent job of thinking about it and stop shooting from the hip at you. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13060127",
            "date": "2011-07-05T21:03:07+0000",
            "content": "That page about jars is obsolete, I'll do something about it. \n\nHere's the actual state of affairs. repository.apache.org is a copy of Sonatype Nexus. No SCP is involved. You do need a maven settings.xml with credentials (user name and password). All committers have access to push to it. You should already be talking to this in some wise to push actual releases into here.\n\nWhat I'm trying to do is replicate this stuff into my private repo, which does not work with the jenkins concoction, but I may yet make it work.\n\nWhat i can offer is a patch that adds a whole-nother ant target to push the snapshot repo on Nexus. No interaction at all with the rest of what you do. This would align solr with the rest of the Apache universe for snapshots. \n\nI'm not claiming that this is giantly important. I'll cook the patch, and you can decide what to do with it, and I promise not to be squeaky either way.\n\n\n "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13060129",
            "date": "2011-07-05T21:04:26+0000",
            "content": "Olivier just pointed me at a potentially quicker shortcut here, but I don't know for sure that it's going to help us here.\n\n---------- Forwarded message ----------\nFrom: Olivier Lamy <olamy@apache.org>\nDate: Tue, Jul 5, 2011 at 3:43 PM\nSubject: Re: Fun with Jenkins as a repo\nTo: Maven Developers List <dev@maven.apache.org>\n\n\nMaybe Out of Maven Topic : This place in Jenkins is not designed to\nserve as Maven repository.\nHave a look at this plugin :\nhttps://wiki.jenkins-ci.org/display/JENKINS/Jenkins+Maven+Repository+Server\n\n\n "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13061317",
            "date": "2011-07-07T13:54:55+0000",
            "content": "Very simple patch that enables deployment, optionally, to nexus. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13061318",
            "date": "2011-07-07T13:55:30+0000",
            "content": "Very small patch that allows nexus deployment. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13061325",
            "date": "2011-07-07T13:59:52+0000",
            "content": "So, if you apply the patch, folks like me can trivially deliver snapshots to repo managers that use password authentication.\n\nYou can deliver to the Apache snapshot repo by changing your jenkins job to look like:\n\nant generate-maven-artifacts -Dm2.repository.url=https://repository.apache.org/content/repositories/snapshots/ -Dm2.repository.username=\"whoever\" -Dm2.repository.password=\"whatever\"\n\nThere is some scheme on the jenkins instance for these credentials, I can research it for you.\n\nMy elders and betters at dev@maven.apache.org tell me that the thing that you have is really not a good idea from either a Jenkins or a Maven standpoint. Following my recipe here will change nothing about the publicity/policy issues, it will retain some old snapshots which might be useful, and it will generally work better. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13061342",
            "date": "2011-07-07T14:28:50+0000",
            "content": "There is some scheme on the jenkins instance for these credentials, I can research it for you.\n\nPlease do.\n\nMy elders and betters at dev@maven.apache.org tell me that the thing that you have is really not a good idea from either a Jenkins or a Maven standpoint.\n\n\"The thing that you have\"?  Have you rigged a device that can spy my goiter through the tubes of the interweb?  Quiet acceptance of my elders' and betters' judgments is a virtue that I, sadly, lack; you have my admiration.  A pointer to the mailing list discussion(s) to which you appear to be referring would be helpful. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13061382",
            "date": "2011-07-07T15:11:32+0000",
            "content": "So, if you apply the patch, folks like me can trivially deliver snapshots to repo managers that use password authentication.\n\nI agree, this is a good addition.  This version of your patch adds password auth in two more places where it's required.\n\nI tested that the additions do no harm to the local-repo use case for ant generate-maven-artifacts.  \n\nI'll commit shortly. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13061389",
            "date": "2011-07-07T15:26:57+0000",
            "content": "Benson, I committed your patch to trunk in r1143878 and branch_3x in r1143882.\n "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13061408",
            "date": "2011-07-07T16:14:18+0000",
            "content": "Thank you. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106492",
            "date": "2011-09-16T14:51:19+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13217006",
            "date": "2012-02-27T02:50:09+0000",
            "content": "Infra has fixed this for you. https://issues.apache.org/jira/browse/INFRA-4496.. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13221611",
            "date": "2012-03-03T15:30:32+0000",
            "content": "Hi Benson,\n\nUnder LUCENE-3825 I committed a change to the way generate-maven-artifacts does authentication: instead of specifying username/password through system properties m2.repository.username and m2.repository.password (the behavior enabled by your patch on this issue), ~/.m2/settings.xml contains the username/password pair for the server identified by new system property m2.repository.id.\n\nFor example, to deploy to the Apache snapshot repository (after adding a <server> section to my settings.xml):\n\n\nant -Dm2.repository.id=apache.snapshots.https -Dm2.repository.url=https://repository.apache.org/content/repositories/snapshots generate-maven-artifacts\n\n\n\nNote that Maven Ant Tasks appears to not be able to handle encrypted passwords in settings.xml: http://jira.codehaus.org/browse/MANTTASKS-177. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13221924",
            "date": "2012-03-04T16:01:34+0000",
            "content": "Fixed by LUCENE-3825 "
        }
    ]
}