{
    "id": "SOLR-1894",
    "title": "Solr Itas sample app does not work on multicore",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "Response Writers"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The SolrItas sample app does not support multicore - it hard-codes the Solr URL to the default.\n[comment about security removed - this issue is solely about fixing Itas to work natively on multicore]",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-12861626",
            "date": "2010-04-28T00:13:31+0000",
            "content": "How is use of /admin/file a security hole?  Solr's admin uses it for serving up schema.xml and solrconfig.xml, for example.  \n\nAs for multicore, indeed the URLs linked in the example are specific to the way it is deployed.  I'm all ears to hearing how it should be done better and more generically.  Maybe entirely relative URLs, I suppose, would be the way to go? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12861652",
            "date": "2010-04-28T02:31:26+0000",
            "content": "/admin/file can fetch a DataImportHandler file which has login credentials somewhere...\nSolr has tons of security holes.\n\nI changed '/solr/itas' to just 'itas' in browse.vm and VM_global_library.vm. .\n(Also, the example in the wiki page had the file type as text/xml and it should be text/html. I just fixed that.)\nNow it works in a multicore setup.\n\nThis was in the trunk, I don't know what happens in Solr 1.4. Nor have I tried it on the default core.\n\nCheers! "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-12861800",
            "date": "2010-04-28T13:21:15+0000",
            "content": "I made full paths by adding in the core name which is in the request:\n\n#macro(url_for_home)\n  /solr/$request.core.name/itas\n#end\n\n "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12861802",
            "date": "2010-04-28T13:33:33+0000",
            "content": "Let's take security out of this issue though, Lance.  The  ShowFileRequestHandler has a facility to hide files, and the data import handler configuration can use system/JNDI properties for usernames/passwords - so that mischief is managed for those that wanna lock it down further, beyond simply blocking outside ports from hitting Solr, only application servers.\n\nBut again, security isn't part of this issue of making Solritas robust enough out of the box for multicore paths.\n\nThanks, Eric for that general purpose example. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12880177",
            "date": "2010-06-18T12:31:15+0000",
            "content": "Using the core name dynamically, the example Solritas templates now are automatically multicore savvy.   I tested this by copying the example single core config to a new core under example/multicore, adjusting solr.xml for a new core, and trying the /browse handler.  All worked as expected with no template changes at all. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12889142",
            "date": "2010-07-16T12:01:50+0000",
            "content": "I think it makes sense to merge this bugfix to 3.x also. will put a combined merge patch on SOLR-1957 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12889206",
            "date": "2010-07-16T15:11:55+0000",
            "content": "merged to 3x (revision: r964820) "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013098",
            "date": "2011-03-30T15:45:32+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}