{
    "id": "SOLR-10649",
    "title": "Document new metrics config changes",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation",
            "metrics"
        ],
        "type": "Task",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "7.0",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "SOLR-10262 made several improvements to the configuration of metrics in Solr.\n\nInternally, the <metrics> configuration section of solr.xml is now represented as MetricsConfig class, which makes it easier to add new properties there.\n\nA new section <solr><metrics><suppliers> has been added to solr.xml, which allows users to define what implementations of metrics they want to use as well as to configure their parameters. This is useful eg. when selecting what kind of reservoir to use for histograms and timers, or to change the reference clock type, or for providing any other configuration parameters for custom implementations of metrics.\n\nThe <suppliers> section specifies implementations and configurations of metric suppliers, ie. classes responsible for creating instances of metrics. There are default implementations provided for all types of metrics, and they are used if no class attribute is specified, or an invalid one. Custom suppliers must implement MetricSupplier<T> interface and have a zero-args constructor. Bean setter methods will be used for applying values from their plugin configuration, alternatively they may also implement PluginInfoInitialized. These rules also apply to any other custom classes loaded in the metrics config, eg. custom Reservoir implementations.\n\nEach configuration element in the <suppliers> section follows a general plugin configuration format, ie. it may optionally contain \"name\" and \"class\" attributes and contain sub-elements that define typed configuration parameters. As mentioned above, if the \"class\" attribute is missing or invalid (the class can't be loaded or it doesn't implement the right interface) a default implementation will be used. If an element is missing then default configuration will be used.\n\nThe following elements are supported in this section:\n\n\t<counter> - this element defines the implementation and configuration of a Counter supplier. The default implementation doesn't support any configuration.\n\t<meter> - implementation and configuration of a Meter supplier. The default implementation supports one optional config parameter:\n\t\n\t\t<str name=\"clock\"> - type of clock to use for calculating EWMA rates; supported values are \"user\" (default, which uses System.nanoTime()) and \"cpu\" (which uses current thread's CPU time).\n\t\n\t\n\t<histogram> - implementation and configuration of a Histogram supplier. In addition to the clock parameter the following parameters are supported by the default supplier implementation:\n\t\n\t\t<str name=\"reservoir\"> - a fully-qualified class name of implementation of Reservoir to use. Default value is com.codahale.metrics.ExponentiallyDecayingReservoir. Note: all implementations of Reservoir that ship with the metrics library are supported, even though they don't follow the custom class rules listed above. The following config parameters can be used with these implementations:\n\t\t\n\t\t\tsize - (int, default is 1028) reservoir size.\n\t\t\talpha - (double, default is 0.015) decay parameter for ExponentiallyDecayingReservoir.\n\t\t\twindow - (long, default is 300) window size parameter for SlidingTimeWindowReservoir, in seconds. 300 seconds = 5 minutes, which more or less fits the default bias of ExponentiallyDecayingReservoir.\n\t\t\n\t\t\n\t\n\t\n\t<timer> - implementation and configuration of a Timer supplier. Default implementation supports configuration parameters related to clock and reservoir, as specified above.\n\n\n\nExample section of solr.xml. The default Meter supplier is used with non-default clock, and the default Timer supplier is used but with a non-default reservoir configuration:\n\n<solr>\n <metrics>\n  <suppliers>\n    <meter>\n      <str name=\"clock\">cpu</str>\n    </meter>\n    <timer>\n      <str name=\"reservoir\">com.codahale.metrics.SlidingTimeWindowReservoir</str>\n      <long name=\"window\">600</long>\n    </timer>\n   </suppliers>\n  </metrics>\n</solr>",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-02T19:52:30+0000",
            "content": "Commit 9e99a23f31b8d3508526ea473b944beb13303334 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9e99a23 ]\n\nSOLR-10509, SOLR-10649: add docs for new metric features; add <metrics> to solr.xml docs ",
            "author": "ASF subversion and git services",
            "id": "comment-16035312"
        },
        {
            "date": "2017-06-02T19:55:30+0000",
            "content": "Added docs to master for 7.0. ",
            "author": "Cassandra Targett",
            "id": "comment-16035320"
        }
    ]
}