{
    "id": "SOLR-8839",
    "title": "Angular admin/segments display: display of deleted docs not proportional",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "7.5",
            "master (8.0)"
        ],
        "affect_versions": "5.4.1",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "In the /segments portion of the admin site, the segments are displayed as a bar graph with the size of each bar proportional to the logarithm of the segment size.\nWithin each bar the number of deleted documents is shown as a dark-gray portion at the end.\nBefore the angular version, the size of this part was directly proportional to the number of deleted documents with respect to the total number of documents in the segment\nIn the angular version, the dark-gray portion is way too large.\n\nIn the previous version, the result was odd as well since it displayed a proportional percentage within in a logarithmic graph.\n\nI'll add a PR shortly that changes the calculation so the dark-gray part looks approximately proportional to the size the segment would shrink if optimized.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-14T10:40:50+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user LucVL opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/20\n\n    SOLR-8839: Angular admin/segments display: display of deleted docs no…\n\n    …t proportional\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/LucVL/lucene-solr solr-8839\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/20.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #20\n\n\ncommit c187ffaca74ba6d95f70fd85569879c034b66617\nAuthor: Luc Vanlerberghe <luc.vanlerberghe@bvdinfo.com>\nDate:   2016-03-14T10:38:56Z\n\n    SOLR-8839: Angular admin/segments display: display of deleted docs not proportional\n\n ",
            "id": "comment-15193079"
        },
        {
            "date": "2018-04-05T15:53:15+0000",
            "author": "Erick Erickson",
            "content": "This one was annoying me while working on LUCENE-7976 so I've got a fix for it in that JIRA. ",
            "id": "comment-16427150"
        },
        {
            "date": "2018-06-16T15:07:14+0000",
            "author": "Erick Erickson",
            "content": "Fixed when working on LUCENE-7976 ",
            "id": "comment-16514810"
        }
    ]
}