{
    "id": "SOLR-3597",
    "title": "seems like a lot of wasted whitespace at the top of the admin screens",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "because of how the UI is laid out, the solr logo is all by itself above the main table, leaving a lot of whitespace to the right of the solr logo.\n\nthis seems like a waste that should be easily curable?",
    "attachments": {
        "error-divs-overlap.png": "https://issues.apache.org/jira/secure/attachment/12543224/error-divs-overlap.png",
        "SOLR-3597.patch": "https://issues.apache.org/jira/secure/attachment/12537981/SOLR-3597.patch",
        "SOLR-3597-hack.patch": "https://issues.apache.org/jira/secure/attachment/12535313/SOLR-3597-hack.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13407686",
            "date": "2012-07-06T04:06:31+0000",
            "content": "here is a very hackish patch i reverse engineered using the DOM Inspector in firefox.\n\nmost likely this patch shouldn't be used as is w/o other CSS changes or what not – in particularly i just kind of left the <p id=\"environment\"> </p> paragraph sitting there above the \"main\" box, and i supsect that if we are going to move the logo like this, that para tag should move somewhere else ... which would then raise questions about wether the \"wrapper\" div is still needed, which i'm sure affects css, etc...\n\nthe point is i'm posting it wo you can see the end result i'm advocating for, not because i think this is the right way to get that end result\n\n(tangent: it's not really clear to me what that \"environment\" para is for.  i see javascript that either populates it or kills it depending on what it finds in the command line args, but it's not really clear to my why those specific args are special ... is this doc'ed anywhere? .. even just an HTML/javascript comment explaining  what the deal is would be helpful) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13407731",
            "date": "2012-07-06T06:14:01+0000",
            "content": "(tangent: it's not really clear to me what that \"environment\" para is for. i see javascript that either populates it or kills it depending on what it finds in the command line args, but it's not really clear to my why those specific args are special ... is this doc'ed anywhere? .. even just an HTML/javascript comment explaining what the deal is would be helpful)\n\nthis was suggested in the early days of the new UI, here: http://www.lucidimagination.com/search/document/5fb42ac7b35091a2 - but you're right, it's not clearly documented somewhere else. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13407736",
            "date": "2012-07-06T06:22:34+0000",
            "content": "I really like this change! No idea why the header was left untouched while other things also changed .. but this looks really good (at least for me).\n\n.. and i supsect that if we are going to move the logo like this, that para tag should move somewhere else ...\n\nplayed around with the structure, what may fit is: moving the complete header block inside the menu-wrapper. with the current stylesheet the environment box is moved to the top, but disabling the position-definition in css would help. then we would have (see the following as a screen mock):\n\n\n[logo]\n[enviroment]\n[navigation]\n\n\nin that case the navigation will move a bit down, but that should be okay.\n\nmost likely this patch shouldn't be used as is w/o other CSS changes or what not \n\ni'll try to have a look at the weekend (beside finishing a few other patches ;o) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412150",
            "date": "2012-07-11T22:26:10+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13422998",
            "date": "2012-07-26T10:12:14+0000",
            "content": "another approach for solving this problem. moving the header-element into the menu causes problems if we are showing an error-screen because therefore all \"-wrapper\" elements are removed. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429853",
            "date": "2012-08-07T03:43:37+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445626",
            "date": "2012-08-31T04:04:25+0000",
            "content": "steffkes: your patch looks great o nthe normal screens, but the one thing i noticed is that on the \"you have no cores\" error screen, if the reason you have no cores is because of a core init failure, then the failure overlaps with the logo (see attached image) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13447516",
            "date": "2012-09-04T06:56:03+0000",
            "content": "Right, didn't notice that .. updated Patch attached "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13448363",
            "date": "2012-09-05T01:04:11+0000",
            "content": "Awe-some.\n\ncommit! commit! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13449503",
            "date": "2012-09-06T07:53:13+0000",
            "content": "Done \n\nCommitted revision 1381494. trunk\nCommitted revision 1381501. 4x "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610911",
            "date": "2013-03-22T16:43:45+0000",
            "content": "[branch_4x commit] Stefan Matheis\nhttp://svn.apache.org/viewvc?view=revision&revision=1381501\n\nSOLR-3597: admin ui using less whitespace at the top "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653686",
            "date": "2013-05-10T10:32:39+0000",
            "content": "Closed after release. "
        }
    ]
}