{
    "id": "SOLR-6254",
    "title": "Failing tests due to timeouts caused by SSL depleting random entropy on Jenkins",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Tests"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Tests using SSL can block on Jenkins when random entropy is depleted, causing timeouts that trigger test failures.\n\nI found some info about /dev/random problems on FreeBSD here: https://wiki.freebsd.org/201308DevSummit/Security/DevRandom, which lead me to /etc/rc.d/iinitrandom, which gets around the limited entropy by cat'ing a bunch of shit to /dev/random:\n\n\n( ps -fauxww; sysctl -a; date; df -ib; dmesg; ps -fauxww ) \\\n      | dd of=/dev/random bs=8k 2>/dev/null\ncat /bin/ls | dd of=/dev/random bs=8k 2>/dev/null\n\n\n\nI think we should try the same strategy in a crontab every X minutes, to see if that addresses the test failures.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-14065369",
            "date": "2014-07-17T18:57:12+0000",
            "content": "This is essentially a dupe of https://issues.apache.org/jira/browse/SOLR-5776, though that doesn't have an updated title. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14065370",
            "date": "2014-07-17T18:58:04+0000",
            "content": "I think we should try the same strategy in a crontab every X minutes, to see if that addresses the test failures.\n\nI think it's fine as a short term workaround, but not a great solution. We probably should just disable SSL unless we can address it in a portable way. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14065409",
            "date": "2014-07-17T19:24:31+0000",
            "content": "This is essentially a dupe of https://issues.apache.org/jira/browse/SOLR-5776, though that doesn't have an updated title.\n\nThanks Mark, I knew I'd seen you discuss this somewhere, but my search-fu failed me. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14065437",
            "date": "2014-07-17T19:42:03+0000",
            "content": "We probably should just disable SSL unless we can address it in a portable way.\n\nI did this for the test I recently committed on SOLR-6137 (TestCloudSchemaless), but I suppose you mean disabling SSL everywhere. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14065530",
            "date": "2014-07-17T20:55:22+0000",
            "content": "Yeah, I have been doing it one by one, but it's pretty unfriendly to people developing new tests and are not familiar with the issue, so perhaps it's just better to universally disable until we can address it. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-14065561",
            "date": "2014-07-17T21:15:54+0000",
            "content": "Is it really that, Steve? It would seem very odd to have ssl connections just stall like that – think of any web server or something... how does it work there?\n\nAnyway, my impression from debugging hangs related to sockets was that freebsd's port of openjdk is not thoroughly tested (that accept issue would have been caught by regular openjdk tests I think). Now I'm left in doubt when I see an issue pop up on jenkins – is this our bug or openjdk's? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14065631",
            "date": "2014-07-17T21:54:26+0000",
            "content": "Is it really that, Steve? It would seem very odd to have ssl connections just stall like that – think of any web server or something... how does it work there?\n\nI don't know - see SOLR-5776 for more info about SSL-related test failures on Jenkins.\n\nAll of the recent TestCloudSchemaless failures on Jenkins were stuck reading SSL sockets, so if it's not entropy depletion, it's something related to SSL sockets.  (We'll see in a day or two if TestCloudSchemaless stops failing regularly; I added the @SuppressSSL annotation to it.)\n\nMore FreeBSD-specific entropy info:\n\n\n\tFreeBSD's /dev/urandom is symlinked to /dev/random:\n\n\nsarowe@lucene[867]$ ls -ld /dev/random /dev/urandom\ncrw-rw-rw-  1 root  wheel    0,  13 Jul 17 18:38 /dev/random\nlrwxr-xr-x  1 root  wheel         6 Jun 18 23:22 /dev/urandom -> random\n\n\n\tFreeBSD's /dev/random blocks when there is insufficient entropy; from http://www.freebsd.org/cgi/man.cgi?format=html&query=random(4):\n\n\nThe kern.random.sys.seeded\tvariable indicates whether or not the random\ndevice is in an acceptably\tsecure state as\ta result of reseeding.\tIf set\nto\t0, the device will block (on read) until the next reseed (which\tcan be\nfrom an explicit write, or\tas a result of entropy harvesting).  A reseed\nwill set the value\tto 1 (non-blocking).\n\nand from https://wiki.freebsd.org/201308DevSummit/Security/DevRandom:\n\nHow /dev/random works today: The primary source of randomness is the Yarrow PRNG.\n[...]\nYarrow [...] need[s] to accumulate a certain amount of entropy before [it] can start generating random numbers. Until that happens, reads from /dev/random will block.\n\nMore info about randomness sources at https://wiki.freebsd.org/201308DevSummit/Security/DevRandom.\n\n "
        }
    ]
}