{
    "id": "SOLR-6441",
    "title": "MoreLikeThis support for stopwords as in Lucene",
    "details": {
        "affect_versions": "4.10",
        "status": "Closed",
        "fix_versions": [
            "4.10.1",
            "5.0"
        ],
        "components": [
            "MoreLikeThis"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Done"
    },
    "description": "In the Lucene implementation of MoreLikeThis, it's possible to add a list of stopwords which are considered \"uninteresting\" and are ignored.\nIt would be a great addition to the MoreLikeThisHandler to be able to specify a list of stopwords.",
    "attachments": {
        "SOLR-6441.patch": "https://issues.apache.org/jira/secure/attachment/12667935/SOLR-6441.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-14123208",
            "date": "2014-09-05T17:35:04+0000",
            "content": "You can emulate the Lucene behavior by not indexing the \"uninteresting\" terms in the first place, by using StopFilterFactory on the field types associated with the fields you're using for MLT. "
        },
        {
            "author": "Ramana",
            "id": "comment-14123261",
            "date": "2014-09-05T17:58:02+0000",
            "content": "Jeroen ,\nIf we want to have this functionality in  MoreLikeThisHandler, Then we can have all known stopwords in a file and MoreLikeThisHandler will refer this file to ignore the stop words. Please let us know your thoughts. "
        },
        {
            "author": "Jeroen Steggink",
            "id": "comment-14125431",
            "date": "2014-09-08T11:56:14+0000",
            "content": "Hi Ramana,\n\nThat's exactly what I was thinking of. Thanks!\n\nCheers,\nJeroen "
        },
        {
            "author": "Ramana",
            "id": "comment-14129581",
            "date": "2014-09-11T03:41:01+0000",
            "content": "Attached is the path. Now, MoreLikeThisHandler implements SolrCoreAware interface and in the inform method, loading the existing stopwords_en file and converting to set of stopwords. For each mlt request, setting the stopwords to Lucene \"MoreLikeThis\" API. With this, In the \"addTermFrequencies\" method of \"MoreLikeThis\" all the stop words will be ignored while building the termFreqMap. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14134285",
            "date": "2014-09-15T18:39:44+0000",
            "content": "Ramana, your patch changes the MLT Handler to always use the stopword list in lang/stopwords_en.txt, but that won't work a) for people who don't want to use any stopwords with the MLT handler; or b) for those who want to use a different stopword list; or c) for those who don't include the lang/ directory in their configset.\n\nThis needs to be configurable in the handler, and the default should be to not load stopwords at all.\n\nAlso, before this can be committed, there needs to be tests demonstrating that the new functionality works. "
        },
        {
            "author": "Jeroen Steggink",
            "id": "comment-14135220",
            "date": "2014-09-16T09:58:24+0000",
            "content": "Hi Steve, I have the exact same remarks. Thanks for the basic patch though Ramana. I have already changed the functionality like Steve describes and I'm working on a test right now. Patches should be ready in a couple of days. "
        },
        {
            "author": "Jeroen Steggink",
            "id": "comment-14138844",
            "date": "2014-09-18T12:01:36+0000",
            "content": "I have posted a new patch according to the remarks Steve posted. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-14151039",
            "date": "2014-09-28T09:03:55+0000",
            "content": "Bulk close for Lucene/Solr 4.10.1 release "
        },
        {
            "author": "Goran Miskovic",
            "id": "comment-16069770",
            "date": "2017-06-30T09:26:29+0000",
            "content": "Hi Michael McCandless\n\nIt appears that Jeroen Steggink patch was not merged although the resolution was set to done and you closed the ticket.\n\nCould you provide more information, please?\n\nThanks,\nGoran "
        }
    ]
}