{
    "id": "SOLR-7894",
    "title": "Solr Forgets Core Setup And Throws Fake Errors Each Time It Starts",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Major"
    },
    "description": "I have two Solr cores that I need to use. Their folders are already set up with appropriate permissions in the /solr subdirectory I'm using. Nevertheless, each time I start and stop Solr, the following ridiculous dance has to take place:\n\n1. I go to the web interface on port 8983.\n2. No cores are listed. I press the Add Core button.\n3. I type in the name of the first of the two cores I want to re-add that was just there when the process was running previously in the \"name\" and \"instanceDir\" fields. I leave the other fields with their default values.\n4. I press the blue \"Add Core\" button.\n5. I get the following red error message: \"Error CREATEing SolrCore '[core name]': Could not create a new core in /home/solr/server/solr/[core name]/as another core is already defined there\".\n6. I press the gray \"Cancel\" button.\n7. I click \"Java Properties\" on the left side, or some other link in the administrative interface, just to get off the cores page.\n8. I go back to the cores page.\n9. The core is listed and is working fine.\n\nThis is absurd.\n\nFor one thing, I shouldn't have to do anything. Either by scanning the directory for the annoying-as-hell XML configuration files or some other method, it should remember the cores that were just there. But even assuming that's impossible for some reason (which it's not), I should not be getting a technically true but practically useless and misleading error message that suggests that adding the core didn't work when in fact it did.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-07T05:01:04+0000",
            "author": "Erick Erickson",
            "content": "Please bring this kind of thing up on the user's list rather than raise JIRAs to be sure you're not simply misunderstanding things. If it's a real problem in Solr, then raise a JIRA.\n\nProbably in this case you have no \"core.properties\" file. Which is mandatory for Solr finding a core. ",
            "id": "comment-14661322"
        },
        {
            "date": "2015-08-07T05:17:36+0000",
            "author": "Aaron Greenspan",
            "content": "How would I know that I am missing a core.properties file? Why isn't one generated automatically if it's required for what most people would consider normal function? And if the required file is missing, why doesn't the log indicate as such?\n\nI do not believe I am \"misunderstanding things\"--I'm an experienced server admin and developer and I've used all kinds of software packages for a long time. Blaming users for programming issues is not a good way to yield a quality product, and I do not consider this problem \"resolved\". ",
            "id": "comment-14661337"
        },
        {
            "date": "2015-08-07T05:24:29+0000",
            "author": "Shawn Heisey",
            "content": "At the moment you use the \"Add Core\" button, the core.properties file must NOT exist.  Adding the core will create that file.  I think that these facts are not well-documented.\n\nThe core.properties file is how the core is re-discovered when Solr is restarted.\n\nhttps://wiki.apache.org/solr/Solr.xml%204.4%20and%20beyond ",
            "id": "comment-14661346"
        }
    ]
}