{
    "id": "SOLR-565",
    "title": "Component to abstract shards from clients",
    "details": {
        "affect_versions": "1.3",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "A component that will remove the need for calling clients to provide the shards parameter for\na distributed search. \nAs systems grow, it's better to manage shards with in solr, rather than managing each client.",
    "attachments": {
        "SOLR-565.patch": "https://issues.apache.org/jira/secure/attachment/12386970/SOLR-565.patch",
        "distributor_component.patch": "https://issues.apache.org/jira/secure/attachment/12381559/distributor_component.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "patrick o'leary",
            "id": "comment-12594783",
            "date": "2008-05-07T05:31:34+0000",
            "content": "Attaching patch for a DistributorComponent\nProvides the ability to load shard urls from a topologyFile, and add parameters to the outgoing url\nRequires configuration in solr/conf/solrconfig.xml\nGet's activated by adding distributed=true to search query.\nStill accepts shards= parameter as an override.\n\nConfiguration:\n\n  <searchComponent name=\"distributor\"     class=\"org.apache.solr.handler.component.DistributorComponent\" >\n    <str name=\"topologyFile\">shards.txt</str>\n    <arr name=\"addParams\">\n      <str>shards.qt=geo</str>\n    </arr>\n  </searchComponent>\n\n  <requestHandler name=\"/search\" class=\"org.apache.solr.handler.component.SearchHandler\">\n    <lst name=\"defaults\"> \n      <str name=\"echoParams\">explicit</str>\n    </lst>\n    \n    <arr name=\"components\">\n      <str>distributor</str>\n      <str>query</str>\n      <str>facet</str>\n      <str>mlt</str>\n      <str>highlight</str>\n      <str>debug</str>\n    </arr>\n\n  </requestHandler>\n\n\n\n\nshards.txt file by default will exist in solr/conf directory and is line delimited containing\nhost_1:port/solr_path\nhost_2:port/solr_path\netc..\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12594982",
            "date": "2008-05-07T17:59:49+0000",
            "content": "Maybe i'm missing something, but how is this differnet then just setting \"default\" or \"invariant\" values for the shards param? "
        },
        {
            "author": "patrick o'leary",
            "id": "comment-12594988",
            "date": "2008-05-07T18:19:03+0000",
            "content": "There are 2 main differences\n1) This provides optional enabling using distributed=true, \n     where as setting defaults requires a client sending shards=\"\" to disable.\n\n2) Also allows you to keep your infrastructure topology out side of application configuration.\n    There is a load method which also examines the time stamp on the topology file and reloads if a newer one exists.\n     Saving you from having to restart the host to change your back end shards.\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12598066",
            "date": "2008-05-19T19:53:38+0000",
            "content": "If the shards file is an XML file, we can add parameters per shard.\n "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12598068",
            "date": "2008-05-19T19:55:50+0000",
            "content": "This would be easier to administer if, instead of a master file, there is a directory with one file or directory per shard. We can just add and remove the individual files without editing the master file.   "
        },
        {
            "author": "patrick o'leary",
            "id": "comment-12598071",
            "date": "2008-05-19T20:08:23+0000",
            "content": "I think I see where your going, so if you wanted to do a distributed search, and have different parameters passed to different shards. \nYou'd store the configurations separately.\nAdd or remove files as if you were turning on / off services you were searching upon with no down time.\n\nIt's possible, would require a slight change to the SearchHandler, and ShardRequest.java, but it seems possible and pretty useful. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12598473",
            "date": "2008-05-20T21:14:53+0000",
            "content": "Another item to consider:\n\nSome times you want to control which shards participate in any given query.  This is an important optimization for large scale deployments that need to quickly subset what is queried so that they do not waste CPU of irrelevant shards.   "
        },
        {
            "author": "patrick o'leary",
            "id": "comment-12598495",
            "date": "2008-05-20T21:50:50+0000",
            "content": "That's a different aspect, where you either have a map reduce / ontology / hash based system to focus you queries to certain farms\nof servers. \n\nThis component could act as an example of how to accomplish that, but there are so many possible implementations that it's not\nprobable to provide a scope for it. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12598499",
            "date": "2008-05-20T21:58:15+0000",
            "content": "I agree.  Let's get this in and then worry about getting fancy.  This should go in 1.3 and I'll take it if nobody else does. "
        },
        {
            "author": "Jayson Minard",
            "id": "comment-12598506",
            "date": "2008-05-20T22:17:30+0000",
            "content": "Selecting shards by sets is not overly fancy.  You basically allow shards to be specified by location, then you allow shard sets to be specified including those sets.  You reference the set (by default there is an \"All\" set) during the query and you are off to the races.\n\nShard selection by sets covers a lot of ground in terms of bringing in more use cases without adding that much more complexity.  Really, not much complexity, just a bit more code.\n "
        },
        {
            "author": "patrick o'leary",
            "id": "comment-12598664",
            "date": "2008-05-21T14:34:34+0000",
            "content": "There's one change I was going to add to this today which was a copy parameter, I'll add that and look at some of the ideas here.\nHere's what I suggest.\n1) Add the change I've got, just to have a base line to work from.\n2) Add changes into ShardRequest and SearchHandler (Maybe even response builder) and this patch to handle essentially \"named nodes\" ?\n\n\twith parameters\n3) Add an optional interface to provide intelligent query routing\n\tIf not null, pass the response builder to the query routing class, and it should pass a list of named nodes back that can be used\n   for the request. \n\n\n\nBefore anyone asks, I do no believe that this component should be responsible for reformatting the query for each of the named nodes (which is open for renaming if someone has something cooler to call it), the individual nodes should be capable of taking user / client input and restructuring it to suit it own needs.\n "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12605122",
            "date": "2008-06-15T03:39:00+0000",
            "content": "Patrick, this JIRA issue is on the top of my list (literally, physically in JIRA) of JIRA issues assigned to me, so I can:\n\n\n\tcommit your current patch, or\n\twait for your changes to add config mechanism Lance suggested\n\twait for your changes to allow named sets that Jason suggested\n\n\n\nIf you are close with 2 or 3 above, I'll wait. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12612642",
            "date": "2008-07-10T21:04:01+0000",
            "content": "DistributedSearch was designed such that a custom component could be developed that set \"shards\" dynamically based on it's topology knowledge.  If the main point of this patch is to move \"shards\" from solrconfig.xml to a separate file, I'm not sure it's worth it.... that could perhaps be done with  an XML entity.\n\nIf there are separate changes to Distributed Search or ResponseBuilder  that will make it easier to write a component to do this, then we should consider those changes separately. "
        },
        {
            "author": "patrick o'leary",
            "id": "comment-12613370",
            "date": "2008-07-14T16:55:13+0000",
            "content": "Been tied up with work recently\nThe objective of this is to move shards away from a client implementation, with the nature of solr\nI would expect engineer resources to be used for solrconfig.xml updates, but operational updates to\noccur externally to this, hence hosting topology externally to the solrconfig.\n\nThe distributor component should end up providing 3 main parts, that don't really fit into the xml config.\n\n1. Component with the ability to enable shard-ing based upon a distributed=true parameter from a preset topology.\n1.1 Overridden if isShard=true is passed. (thus local disk only)\n\n2. a configurable plugin to allow loading of custom topologies, e.g. mysql, ec2-describe-instances, zoneedit-watch etc.\n2.1. defaulting to use a standard file loader, which checks file mod time stamp for reload.\n\n3. provide a configurable plugin for query routing, if users wish to apply taxonomies or\n    other query identification methods, they can do so and direct requests to appropriate shards.\n\nI don't think this really is needed as part of solr's core, and if anything could be a contrib. "
        },
        {
            "author": "Jeremy Hinegardner",
            "id": "comment-12617258",
            "date": "2008-07-27T08:43:26+0000",
            "content": "I was testing out this patch, and found a couple of bugs.\n\n1) if the topologyFile is given with an absolute path in solrconfig.xml it will never be loaded\n2) on the remote chance that there is an error while loading the topology file, the existing topology could become corrupted\n\nI may be able to assist futher with this patch as my installation is going to be using it. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12643444",
            "date": "2008-10-29T09:08:26+0000",
            "content": "It seems less useful if I assign 1 url for one shard . No a lot more useful than what it is now.This actually imposes the user to use a loadbalancer\n\nIdeally the shards.properties can have something like this\n\n#comma separated values per host\nshard1=host1:port/solr,host2:port/solr\nshard2=host3:port/solr,host4:port/solr\nshard3=host5:port/solr,host6:port/solr\n\n\n\nThe distributed search should internally do a round-robin between each host for a shard\n\n\n\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12674124",
            "date": "2009-02-17T07:29:27+0000",
            "content": "Marked for 1.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872496",
            "date": "2010-05-27T22:06:34+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043633",
            "date": "2011-06-03T16:46:13+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106247",
            "date": "2011-09-16T14:50:14+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234718",
            "date": "2012-03-21T18:08:59+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717243",
            "date": "2013-07-23T18:47:35+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971071",
            "date": "2014-04-16T12:57:04+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}