{
    "id": "SOLR-2555",
    "title": "Always incorrectly spelled with onlyMorePopular enabled",
    "details": {
        "affect_versions": "3.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "The spellcheck component will always mark the term(s) as incorrectly spelled when onlyMorePopular=true, regardless of the term being actually spelled correctly.\n\nThe onlyMorePopular setting can produce collations while the term(s) are correctly spelled. This is fine behaviour. The problem is that is also marks the term(s) as incorrectly spelled when they're actually in the spellcheck index.\n\nSee also this thread:\nhttp://lucene.472066.n3.nabble.com/correctlySpelled-and-onlyMorePopular-in-3-1-td2975773.html#a2984201",
    "attachments": {
        "SOLR-2555.patch": "https://issues.apache.org/jira/secure/attachment/12776119/SOLR-2555.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Dawid Weiss",
            "id": "comment-13041293",
            "date": "2011-05-30T21:06:24+0000",
            "content": "Can you be more specific as to which suggester is actually used (jaspell, tst or fst)? FSTLookup does have an option to always check for exact matches, so if something exists in the index (is a valid spelling), it will be returned as the first suggestion, followed by other matches (when an exact match is a prefix of other matches, suggestions can still be returned). "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13041298",
            "date": "2011-05-30T21:21:26+0000",
            "content": "It's not the suggester we use but the plain old spellcheck component. As far is i remember (checked last week) suggester doesn't return a correctlySpelled parameter. Spellchecker also doesn't take a LookupImpl parameter (according to the wiki). It's an IndexBasedSpellchecker. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13041474",
            "date": "2011-05-31T07:53:00+0000",
            "content": "Oh, ok - thanks. I personally find the terminology used in Solr/ Lucene a bit confusing – spellchecking and autosuggest are closely related, but they do come in various flavors:\n\n\tspell checking (correcting a possible typo); usually matches nothing or close to nothing in the index and has a single high-matching corresponding suggestion,\n\tprefix completion (simple scenario of unfinished word/phrase),\n\tother kind of completion (for example phrase match based on the current partially typed-in term and its left context).\n\n\n\nThese are closely related and I wonder if there could be a distinction in the returned result so that the end application can distinguish which one is which (to present them in different ways in the suggestion list perhaps?). "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106318",
            "date": "2011-09-16T14:50:33+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237050",
            "date": "2012-03-23T20:31:34+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412213",
            "date": "2012-07-11T22:26:25+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429872",
            "date": "2012-08-07T03:43:51+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451051",
            "date": "2012-09-07T22:11:55+0000",
            "content": "removing fixVersion=4.0 since there is no evidence that anyone is currently working on this issue.  (this can certainly be revisited if volunteers step forward) "
        },
        {
            "author": "James Dyer",
            "id": "comment-15045181",
            "date": "2015-12-07T16:21:39+0000",
            "content": "The attached patch contains what would be a failing unit test.  However, this test passes.  It searches for \"thus\", which is in the index.  The \"onlyMorePopular\" flag causes it to correct it to \"this\", which has tf=2 vs tf=1 for \"thus\".  The correctlySpelled flag return \"true\", as expected.\n\nThis issue likely was fixed with SOLR-2585. "
        },
        {
            "author": "James Dyer",
            "id": "comment-15045183",
            "date": "2015-12-07T16:22:42+0000",
            "content": "Please re-open this with a failing unit test if this indeed is still a problem. "
        }
    ]
}