{
    "id": "SOLR-8346",
    "title": "Upgrade Zookeeper to version 3.5.x",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Investigate upgrading ZooKeeper to 3.5.x, once released. Primary motivation for this is SSL support. Currently a 3.5.4-beta is released (2018-05-17).",
    "attachments": {
        "SOLR_8346.patch": "https://issues.apache.org/jira/secure/attachment/12774562/SOLR_8346.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-26T21:11:59+0000",
            "author": "Upayavira",
            "content": "5.3.0+ also gives us dynamic clusters, meaning we can add/remove ZK nodes on the fly which seems very useful:\n\n   https://zookeeper.apache.org/doc/trunk/zookeeperReconfig.html ",
            "id": "comment-15029250"
        },
        {
            "date": "2015-11-26T22:37:17+0000",
            "author": "Jan Høydahl",
            "content": "3.5.x is not a drop-in upgrade. Probably because we in SolrZkServer have some ZK private copy-pasted code. I managed to make SolrZkServer compile against 3.5.1, but then there is ZkTestServer as well.. ",
            "id": "comment-15029300"
        },
        {
            "date": "2015-11-26T22:44:14+0000",
            "author": "Jan Høydahl",
            "content": "Partial patch based on 3.5.1-alpha, with a rough fix for SolrZkServer, but still no compiling ZkTestServer. ",
            "id": "comment-15029307"
        },
        {
            "date": "2017-03-03T18:40:36+0000",
            "author": "Frank Kelly",
            "content": "There are a number of DNS issues fixed since 3.4.8 apparently that would be really awesome for our Production Solr Clusters\n\nhttps://issues.apache.org/jira/browse/ZOOKEEPER-1576 fixed in 3.5.0\nhttps://issues.apache.org/jira/browse/ZOOKEEPER-2171 fixed in 3.5.1 (dupe of https://issues.apache.org/jira/browse/ZOOKEEPER-2367) ",
            "id": "comment-15894832"
        },
        {
            "date": "2018-03-19T14:07:02+0000",
            "author": "Jan Høydahl",
            "content": "There seems to be some movement in the ZooKeeper camp towards a 3.5.4 release, although slowly. Do you guys want to wait for a stable release before starting the upgrade on the Solr side, or should we cut a feature branch for it right now off from master, setup some Jenkins on it and mature the whole ting to be ready? ",
            "id": "comment-16404867"
        },
        {
            "date": "2018-09-01T14:30:32+0000",
            "author": "Shawn Heisey",
            "content": "Jan Høydahl I don't know that this change is big enough to need a separate branch.  Whoever is planning to do the work should give the current 3.5 beta a spin and see whether code changes are required in order to achieve their goals and keep ZK functionality working.  If they are, they can keep those changes in a local repository (or a patch uploaded here) and then complete the change once the stable version is released. ",
            "id": "comment-16599645"
        },
        {
            "date": "2018-09-01T14:33:08+0000",
            "author": "Shawn Heisey",
            "content": "And just as I clicked \"Add\" I read closer and saw that you were thinking of Jenkins testing.  That probably DOES require a branch.  Some Jenkins testing would be a good idea, since ZK is a VERY slow-moving beast.\n\nWhich sends me on a tangent ... I wonder if maybe we can come up with annotations for tests that designate them as \"Cloud\" tests or \"ZK\" tests, so we can send a commandline option to ant that will signal it to only run those tests. ",
            "id": "comment-16599647"
        }
    ]
}