{
    "id": "SOLR-2943",
    "title": "DIHCacheWriter & DIHCacheProcessor (entity processor)",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "This is a spin-off of SOLR-2382.\n\nCurrently DIH requires users to retrieve, join and index all data for a full or delta update in one big step.  This issue is to allow us to break this into individual steps.  The idea is to have multiple \"data-config.xml\" files, some of which retrieve and cache data while others join and index data.  \n\nThis is useful when Solr Records are a conglomeration of several data sources.  With this feature, each data source can be retrieved and cached separately.  Once all data sources have been retrieved, they can be joined and indexed in a final step.  When doing a delta update, only the data sources that change need to have their caches updated (or frequently-changing data can remain un-cached while caching the more static data).  This is particularly useful in light of the fact that Lucene/Solr cannot do a true \"update\" operation.  DIH Caches also provide a handy way to archive source data for which there is no stable system-of-record.\n\nImplementation Details:\n\n\n\tThe DIHCacheWriter allows us to write the final (root entity) DIH output to a DIHCache rather than to Solr.  Caches can be created from scratch (\"full-update\") or existing caches can be modified (\"delta-update\").\n\n\n\n\n\tThe DIHCacheProcessor is an Entity Processor that reads a DIHCache.  This Entity Processor can be used for both Root Entities and Child Entities.  Cached data can be read back, joined to other Entities and indexed.\n\n\n\n\n\tBoth DIHCacheWriter and DIHCacheProcessor support partitioning.  DIHCacheWriter can write to a partitioned cache while DIHCacheProcessor can read back a particular partition.  This can be handy when indexing to multiple shards.\n\n\n\n\n\tThis patch is 100% stand-alone from the rest of DIH, so while users can patch and rebuild the DIH .jar file to include these classes, it is unnecessary.  To use this functionality, simply include the code here in the classpath. (ex: in SOLR_HOME/lib)\n\n\n\n\n\tIn addition to this patch, a persistent cache implementation is required.\n\tSee SOLR-2948 for a DIH Cache Implementation built on Lucene (no additional dependencies).\n\tSee SOLR-2613 for a DIH Cache Implementation backed with BDB-JE (we use this in Production).\n\tOther Cache Implementations (hopefully) will be developed in the future and become available for general use.\n\n\n\n\n\tThis patch includes extensive unit tests.  A MockDIHCache that supports persistence and delta updates facilitates the tests.  Do not attempt to use MockDIHCache for anything other than testing or as a reference for developing your own DIHCache implementations.",
    "attachments": {
        "SOLR-2943.patch": "https://issues.apache.org/jira/secure/attachment/12505925/SOLR-2943.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "James Dyer",
            "id": "comment-13162944",
            "date": "2011-12-05T18:51:23+0000",
            "content": "updated patch.  fixes a parameter-naming bug. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13631962",
            "date": "2013-04-15T18:15:30+0000",
            "content": "updated patch for Trunk. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717416",
            "date": "2013-07-23T18:48:11+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Manjunath",
            "id": "comment-13908084",
            "date": "2014-02-21T08:11:11+0000",
            "content": "Nice feature to have . Waiting to use it  "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971317",
            "date": "2014-04-16T12:57:45+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}