{
    "id": "SOLR-10705",
    "title": "Upgrade Velocity's version of jquery from 1.7.2 to 2.1.3",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "contrib - Velocity"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "...in order to avoid shipping both versions. This requires selecting another autocomplete plugin, since the one in use https://github.com/agarzola/jQueryAutocompletePlugin is abandoned",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-08T12:19:46+0000",
            "content": "Erik Hatcher any thoughts? ",
            "author": "Jan Høydahl",
            "id": "comment-16573133"
        },
        {
            "date": "2018-08-08T15:17:25+0000",
            "content": "Velocity 2.0 was released about a year ago, would upgrading make sense? I have no idea if/whether it uses jquery or, if so, what version though.\n\nI suppose the other question I have is whether we should continue to ship velocity or deprecate/remove it? I have no strong feelings either way but thought the question worth asking. It used to be about the only way to get something up and running quickly, but that's changed over the last 10 years. ",
            "author": "Erick Erickson",
            "id": "comment-16573356"
        },
        {
            "date": "2018-08-08T15:51:17+0000",
            "content": "https://select2.org/ is a popular autocomplete element that uses JQuery and has MIT license.\n\n \n\nI am +0 on removing Velocity as I feel Velocity project no longer has sufficient community. On the other hand, the Solr example using it demonstrates something we do not really explain/demonstrate in other ways (plugin-style resources loading, etc). For a while I thought we should migrate to https://www.thymeleaf.org/ but I am no longer sure the server-side in-Solr framework is the right approach. ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-16573413"
        },
        {
            "date": "2018-08-08T15:59:48+0000",
            "content": "Velocity and jquery are tangential, unrelated technologies.  (jquery for ajax requests, velocity for server-side templating/response writing)\n\n+1 to jquery upgrade (and velocity for that matter, though that might have some API changes that need to be made?) ",
            "author": "Erik Hatcher",
            "id": "comment-16573420"
        },
        {
            "date": "2018-08-08T19:12:01+0000",
            "content": "It would be fantastic to be able to include a lightweight HTML5 SPA search UI example with Solr that could replace the Velocity example and serve as a quick way to build search demos for our users. Once we have that in place we can throw away Velocity.\n\nHave anyone tried SolrKit (https://github.com/garysieling/solrkit)? MIT licensed, React, responsive etc, similar to SearchKit. Or have anyone heard more about LucidWork's plan to release an open version of TwigKit? ",
            "author": "Jan Høydahl",
            "id": "comment-16573727"
        },
        {
            "date": "2018-08-08T23:11:44+0000",
            "content": "throw away Velocity?   It's a perfectly useful response writer unto itself.   But I realize that \"velocity\" gets conflated with jquery and folks think of it only as /browse.    So maybe what is meant is that the /browse as a UI is probably what you desire to replace with something more modern.    ",
            "author": "Erik Hatcher",
            "id": "comment-16574018"
        },
        {
            "date": "2018-08-09T07:36:31+0000",
            "content": "throw away Velocity? \nYea, I guess velocity is useful as a general templating, but the /browse example could be replaced with a more modern approach   ",
            "author": "Jan Høydahl",
            "id": "comment-16574415"
        }
    ]
}