{
    "id": "SOLR-1743",
    "title": "error reporting is rendering \"404 missing core name in path\" for all type of errors",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "1.5"
        ],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "despite the error in schema syntax or any other type of error you will always get:\n\n\"404 missing core name in path\" communicate.\n\n\ncheers,\n/Marcin",
    "attachments": {
        "SOLR-1743.restore14behavior.patch": "https://issues.apache.org/jira/secure/attachment/12438533/SOLR-1743.restore14behavior.patch",
        "SOLR-1743.patch": "https://issues.apache.org/jira/secure/attachment/12435004/SOLR-1743.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12829747",
            "date": "2010-02-04T20:06:17+0000",
            "content": "We definitely shouldn't be generating a \"missing core name in path\" for situations like missconfiguration in a single core setup.\n\nIn the trunk, things like attempting to load a RequestHandler class that can't be found correctly result in a \"Severe errors in solr configuration.\" type message in the browser, which then shows the stack trace of the problem.\n\nHowever: something as simple as a typoe like this...\n\n\nIndex: example/solr/conf/schema.xml\n===================================================================\n--- example/solr/conf/schema.xml        (revision 906596)\n+++ example/solr/conf/schema.xml        (working copy)\n@@ -456,7 +456,7 @@\n        when adding a document.\n    -->\n \n-   <field name=\"id\" type=\"string\" indexed=\"true\" stored=\"true\" required=\"true\" /> \n+   <field name=\"id\" type=\"asdfasdf\" indexed=\"true\" stored=\"true\" required=\"true\" /> \n    <field name=\"sku\" type=\"textTight\" indexed=\"true\" stored=\"true\" omitNorms=\"true\"/>\n    <field name=\"name\" type=\"textgen\" indexed=\"true\" stored=\"true\"/>\n    <field name=\"alphaNameSort\" type=\"alphaOnlySort\" indexed=\"true\" stored=\"false\"/>\n\n\n\n...results in http://localhost:8983/solr/admin/ generating the \"missing core name in path\" error described, with no other context.\n\nIn Solr 1.4, this same type of error would have generated a \"Severe errors in solr configuration.\" type message (w/ stack trace) so this definitely seems like a new bug in IndexSchema config error handling introduced in the trunk since Solr 1.4 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12829793",
            "date": "2010-02-04T21:26:10+0000",
            "content": "I think this was always a bug with MultiCore and single core worked. Now that we always run in \"multicore mode\", its just more prominent. I think. Anyway, I see whats going wrong and I'll take a whack at a fix. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12829828",
            "date": "2010-02-04T22:40:41+0000",
            "content": "... I'll take a whack at a fix.\n\nHeh - perhaps I will. Annoyingly, its going to take some thought. The old machinery counts on an exception while building the core bubbling up to the dispatchfilter init method - but the corecontainer swallows such exceptions, as we try and run other cores even if one is whacked. Anyway, this error reporting will have to be done in a completely different way to properly work with multicore. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12830271",
            "date": "2010-02-05T20:17:59+0000",
            "content": "Not quite as bad as I thought - I guess this is setup to work right with multicore. Wasn't seeing the full picture.\n\nThe reason we don't see the error is because the core doesn't load, and abortOnConfigurationError never gets set to true. We don't handle that setting correctly with MultiCore - we check it by iterating through all of the cores that loaded - but a core with a config erorr wouldn't have loaded ... so abortOnConfigError gets read as false when it should be true.\n\nSo we can fix that, but if you don't want to abortOnConfiguration error, your still going to see this confusing message, so we should prob improve on that as well. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12830274",
            "date": "2010-02-05T20:25:37+0000",
            "content": "Fixes the \"at least one core has abortOnConfigError = true\" case.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12839948",
            "date": "2010-03-02T01:10:53+0000",
            "content": "Mark: i'm confused by your comments/patch\n\nI applied your patch allong with the schema.xml \"typo\" patch i posted above to Solr trunk (r917814) and still got \"missing core name in path\" when hitting http://localhost:8983/solr/admin/\n\nI thought that since example/solr/conf/solrconfig.xml uses <abortOnConfigurationError>${solr.abortOnConfigurationError:true}</abortOnConfigurationError> it would fall into the situation you described as being fixed?\n\n(Did you maybe attach a different version of the patch then you ment to?) "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12839955",
            "date": "2010-03-02T01:41:57+0000",
            "content": "Well its no surprise that I'm confusing...\n\nBut I swear I tested that stupid patch - and yet .. I must not have ...\n\nHere is a patch updated to trunk and with the correct fix.\n\nWas still looking at the abortOnConfig setting in the wrong place - if the schema couldn't load, an exception still caused the setting check to be skipped -\nso setting check has to go in the createCore call, right after the config object is created.\n\nSwear I'm looking at the darn exception at http://localhost:8983/solr/admin/ right now.\n\nLike I said, this is not a full fix to the issue, but it least puts us back where we were with single core, and solves half the multi core problem. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12839978",
            "date": "2010-03-02T02:31:35+0000",
            "content": "Here is a quick attempt at solving most of the rest of this.\n\nThe idea is:\n\nreporting that the mutlicore core name is missing on the http://localhost:8983/solr/admin/ page is now not always correct when SolrCore is not put into the request.\nSometimes this means an error in one of the cores - though with the previous part of this patch you only run into this issue when abortOnConfigError is false.\n\nBut anyway, what this does is: if there is no default core specified, the old error is shown - you are missing the corename.\n\nIf there is a default core specified (and there is by default these days - collection1), and that core couldn't load, all of the errors found while loading cores are printed to the page:\n\nHTTP ERROR: 404\n\nSevere errors in solr configuration.\n\nCheck your log files for more detailed information on what may be wrong.\n\nThe following are the errors registered by the cores you tried to load:\n\nCould prob be a better message even.\n\nStill, if you try and go to the full url of  a core that couldn't load, you will get page not found - because the core will have never loaded. Would be nice to see the error there too, but this is as far as I go at the moment.\n\nThis patch also removes a System.out in the last patch and fixes a bug in reading the defaultCoreName from solr.xml - it was looking for it at /solr when it should have been looking at /solr/cores.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12840014",
            "date": "2010-03-02T05:04:48+0000",
            "content": "No worries dude .. i don't really even understand how it worked before, let alone with your patch.\n\nYour latest version deals with my typo in schema.xml example, but when testing out some other use cases it looks like the default assumption was that abortOnConfigurationError=true unless the solrconfig.xml can be parsed cleanly and sets it to false ... which means that in 1.4 a single core malformed solrconfig.xml (ie: garbage in the prolog) would generate a good error message – and with your latest patch it still generates the \"missind core name\" error.\n\nIt seems like in order to preserve we need to use tertiary state for the CoreContainer.abortOnConfigurationError ... null assumes true until at least one solrocnfig.xml is parsed cleanly, then false unless at least one config sets it to true.\n\nI'm also wondering if your patch breaks the purpose of CoreContainer.Initializer.setAbortOnConfigurationError ... i think the idea there was that prior to initializing the CoreContainer, Embedded Solr users could call that method to force abortOnConfigurationError even if it wasn't set in any of hte solrconfig.xml files. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12840019",
            "date": "2010-03-02T05:24:28+0000",
            "content": "Ok, here's my attempt at making sense of this.\n\nAs far as i can tell this restores all of the useful behavior that SOlr 1.4 had with abortOnConfirurationError in single core mode ... some quick multicore testing makes me think it's improved the error reporting in some situations there as well, but i'm sure i haven't tried all of the edge cases – it may have broken something. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12840021",
            "date": "2010-03-02T05:39:18+0000",
            "content": "Grrrr... ignore that last patch, it changes the default behavior to be like abortOnConfigurationError=true for multicores even if no core ever asked for it ... which would be bad (in 1.4 those cores will all still load, but with this patch they won't)\n\nStill thinking about it.... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12840034",
            "date": "2010-03-02T06:43:53+0000",
            "content": "I think i give up.\n\nFirst off: sorry mark, this comment was way off base...\n\nI'm also wondering if your patch breaks the purpose of CoreContainer.Initializer.setAbortOnConfigurationError \n\n...digging through the history i realized that this is how Initializer has always worked: you can set the default behavior for \"legacy\" single core mode, but whenever it sees a solr.xml file it overwrites that default value with \"false\"\n\nThis is fundamentally what's bitch slapping me at the moment ... the attached patch tries to mimic the historical behavior, and i think i saw it work (but i'm kinda cross-eeyed right now so i can honestly say you shouldn't take my word for it – i wouldn't) but it doesn't really address the fact that since the example now contains a solr.xml, anybody who starts with the Solr 1.5 example and makes a typo in their solrconfig.xml so that it's not well formed won't get a useful error message in the browser like they would in Solr 1.4\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12840045",
            "date": "2010-03-02T07:07:09+0000",
            "content": "Okay now i'm just going to rant...\n\nabortOnConfigurationError feels like it's just devolved into nonsense at this point .. the orriginal purpose was to let people configure wether they wanted to solr to try to keep running even if something like a request handler couldn't be loaded – set it to true and solr wouldn't start up and the admin screen would tell you why, set it to false and solr would work, but requests for that request handler would fail\n\nonce we added multicore support, the usage of abortOnConfigurationError just stoped making sense ... if your solr.xml refers to just core1, and core1's solrconfig.xml sets it to \"false\" and has a request handler that can't be llooaded things keep working – but if you also have a core2 whose solrconfig.xml sets it to \"true\" then the whole server won't start up ... that's just silly.\n\nMaybe it's just time to rethink the whole damn thing...\n\n\tdeprecate the SolrConfig.SEVERE_ERRORS singleton - make SolrCore start keeping a personal list of exceptions it was able to get past (ie: a plugin it couldn't load)\n\tEliminate Initializer.isAbortOnConfigurationError - instead make each SolreCore keep track of that itself\n\tif initializing a core throws an exception (either from parsing the config, or from instantiating the SolrCore or IndexSchema) CoreContainer should keep track of that exception as being specific to that core name (Map<String,Exception>)\n\t\n\t\tremoving a core, or recreating a core with the same name should clear any corresponding entry from this map\n\t\n\t\n\twhen SolrDispatchFilter processes a path, it should generate a useful error message in either case:\n\t\n\t\tCoreContainer says it has an init exception for the core name that corresponds to that path\n\t\tthe SolrCore exists; has sAbortOnConfigurationError()=true; and has a non-empty list of exceptions\n\t\n\t\n\n\n\n\n...thoughts? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12840177",
            "date": "2010-03-02T14:27:58+0000",
            "content": "Hoss - I've got to digest and respond to this more fully later, but:\n\nYes, I def agree the best solution is something entirely different. I agree that the current, historical based stuff is just not right for multicore. What I've tried to do is just hack things back closer to what they were, but a real solution would be to start from scratch and handle things better -\n\nSounds like you have an idea for that, and I'll dig into your explanation when I get a chance and perhaps off some feedback. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12843227",
            "date": "2010-03-09T18:33:46+0000",
            "content": "Okay, I sat down and thought about what we should do before really reading through your suggestion - and I came up with practically the exact same thing - so I think this is what we should attempt. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12843355",
            "date": "2010-03-09T23:19:12+0000",
            "content": "So from what I can see - the immediate problem here is that places that would like to register an error do not have access to the core name - eg schema, solrconfig "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12843373",
            "date": "2010-03-10T00:10:24+0000",
            "content": "Okay, I sat down and thought about what we should do before really reading through your suggestion - and I came up with practically the exact same thing - so I think this is what we should attempt.\n\nI know i brought it up here in the issue comments, but I think we should probably track this type of change in a separate issue as an \"Improvement\"\n\nfor the scope of this issue, let's start by getting a simpler patch commited that at least restores the behavior from 1.4 – w/solr.xml you always get \"missing core name\" on config error, w/o solr.xml you get good error messages even if solrconfig.xml can't be parsed.  It won't help new users in who start with the current example from the trunk (since it has a solr.xml) but it will get things back to where they were for existing users who try upgrading.\n\nAs i recall one of the patches already posted does this just fine (i just can't remember which one) so that part should be fairly straight forward. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12844210",
            "date": "2010-03-11T20:02:30+0000",
            "content": "Ok, I've been doing some more testing...\n\nFirst off: a lot of my early comments on this issue were inaccurate – in some cases I was trying to test the behavior of trunk using a \"single core\" example with some errors in the solrconfig.xml, but i was using the \"example/solr\" dir on the trunk, and i completly forgot that it has a solr.xml file in it now.\n\nFrom what i can tell, the only real difference between the behavior of trunk, and the behavior of Solr 1.4 is that: in 1.4 when using legacy single core mode (ie: no solr.xml) you would get good error messages if an low level error happened that completely prevented the core from loading (ie: schema init problem, or xml parsing problem with solrconfig.xml)  This is because the default behavior of abortOnConfigurationError was \"true\" for legacy single core mode, and that boolean drives SolrDispatchFilter's decision about what type of error message to display.\n\nThe latest attached patch (SOLR-1743.restore14behavior.patch) should get us back to the error reporting behavior of Solr 1.4 – i think we should go ahead and commit this to the trunk as a temporary fix for the current bug, while we flesh out improvements to the entire concept of abortOnConfigurationError in another issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12844227",
            "date": "2010-03-11T20:43:59+0000",
            "content": "This looks good to me as a first step - tested with both config and schema errors.\n\nWould be nice if single core with the solr.xml also worked, but no biggie - we can fix with the rest of multi-core.\n\nNote for no good reason what so ever, \n\nWell, I think it was supposed to work (even though the whole idea is kind of broken anway), cause it attempted to, so reason is prob a bug ... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12846040",
            "date": "2010-03-16T18:03:35+0000",
            "content": "Committed revision 923909.\n\nNOTE: since this bug was introduced after 1.4, and since i expect it to get superceeded by SOLR-1817 prior to the next release, I didn't bother with a CHANGES.txt entry "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12846043",
            "date": "2010-03-16T18:04:57+0000",
            "content": "SOLR-1817 is where we are tracking the \"improvement\" of better error reporting in multi-core initialization.\n\n(the only reason i even bothered commiting this patch is so people testing out trunk could get the same behavior as 1.4 w/o waiting on SOLR-1817) "
        }
    ]
}