{
    "id": "SOLR-11855",
    "title": "known field's empty value can vanish via add-unknown-fields-to-the-schema updateRequestProcessorChain",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "known field's empty value can vanish via add-unknown-fields-to-the-schema updateRequestProcessorChain\n\nThis appears to be due to the \"remove-blank\" processor in the \"add-unknown-fields-to-the-schema\" process chain i.e. remove-blank applies to known as well as unknown fields (and when field guessing is disabled then remove-blank logic also stops).\n\nTechnically there's nothing broken here but I'm wondering if remove-blank might be removed (no pun intended) from the _default configuration or if the \n\nWARNING: Using _default configset. Data driven schema functionality is enabled by default, which is NOT RECOMMENDED for production use.\n\nTo turn it off:            \ncurl http://localhost:8983/solr/collectionA/config -d '{\"set-user-property\": {\"update.autoCreateFields\":\"false\"}}'\n\n\nwording might be revised somehow to better account for the remove-blank functionality?",
    "attachments": {
        "SOLR-11855.patch": "https://issues.apache.org/jira/secure/attachment/12906125/SOLR-11855.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-01-15T15:26:31+0000",
            "content": "We encountered a puzzling scenario as follows:\n\n\tcreate a new collection using the _default configset,\n\tadd a string field and make it a required field ...\n\t... but otherwise (unwittingly) continue in schemaless mode.\n\tAdd a document that has the required field,\n\tadd another document that has a single blank space for the required field,\n\tadd a third document that has an empty string for the required field.\n\n\n\nThe third document unexpectedly fails to be indexed with a \"missing required field\" error.\n\nIf next then we\n\n\tdecide that the new field is not required after all, and we\n\tindex the third document again then this time it indexes successfully but the 'empty string' value for the field is discarded i.e. the document has no value for that field.\n\n\n\nLastly, disabling field guessing as per https://lucene.apache.org/solr/guide/7_2/schemaless-mode.html#disabling-automatic-field-guessing solves the issue i.e. the third document is indexed successfully with an empty string as the required field value.\n\n\n\nAttached patch contains a script to reproduce and demonstrate the scenario:\n\ncd solr\nant dist server\n./run-demo.sh collectionA\n./run-demo.sh collectionC\n./run-demo.sh collectionB\n\n ",
            "author": "Christine Poerschke",
            "id": "comment-16326341"
        }
    ]
}