{
    "id": "SOLR-4433",
    "title": "Developer Curb Appeal: automatically cleanup, or at least offer to cleanup, any docs from template index directory",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "When setting up SolrCloud, we have the admin make a copy of example directory into the shard template.\n\nBut we issue the warning \"Make sure there are no documents present\"\n\nDoc reference:\nhttp://lucidworks.lucidimagination.com/display/solr/Getting+Started+with+SolrCloud\nRed box: \"...  On the other hand, make sure also that there are no documents in the example directory before making copies.\"\n\nWe don't say what happens if the data directory is not empty?  If this is really bad, then I'm not sure if we should just automatically nuke it, or prompt them, or give a warning and exit, or maybe a command line switch, OR maybe just move it out of the way, maybe renaming it to something with a \".NON-CLOUD-INDEX\".\n\nThere should be an opportunity to do this.  When SolrCloud initializes a new shard node, I believe it knows that this is the first time (based on whether ZooKeeper has persisted this node's shard assignment, etc.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13717138",
            "date": "2013-07-23T18:47:14+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971286",
            "date": "2014-04-16T12:57:40+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-15487763",
            "date": "2016-09-13T17:01:57+0000",
            "content": "We now (Solr 5+) ask users just getting started with SolrCloud to use the bin/solr script and the cloud example. That loads a config from a configset template and takes care of the problem described in this issue. "
        }
    ]
}