{
    "id": "SOLR-4236",
    "title": "Commit issue: Can't search while add commit=true in the call URL about insert index",
    "details": {
        "affect_versions": "4.0-BETA,                                            4.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "I setup three instances for solr cloud for one same collection and shards, the cloud is one instance is shard leader and the others are replicate.\nSend the index request to one instance, the URL example like this.\ncurl \"http://localhost:7002/solr/update?commit=true\" -H \"Content-Type: text/xml\" --data-binary '<add><doc><field name=\"id\">test</field></doc></add>'\n\nIf send the request to the leader server, only the leader server can search this index, the replicate can't search. I close the autoSoftCommit. \n\nIf request send to the replicate server, all servers can't search this index.\n\nThe major problem:\nSolrCmdDistributor\ndistribAdd method will batch some requests in the cache.\n\nDistributedUpdateProcessor class method processCommit will trigger the send the distribute request after the send commit request. \n\nIf send the testing index's request to replicate server, replicate server will dispatch the request to leader server. But in this case, commit command will send to the other server before actually index request. The index can be searched only wait the softCommit or the other commit command coming.\n\nA litter confuse: Why commit command don't need the leader server send to duplicate server? Only receive request server send the commit to full shards server?\nIt look like solr doesn't implement the transaction logic.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13539987",
            "date": "2012-12-27T15:36:25+0000",
            "content": "Hey Raintung, I have not had a chance to fully understand this yet, but is this issue a dupe of SOLR-3933? "
        },
        {
            "author": "Cao Manh Dat",
            "id": "comment-15522460",
            "date": "2016-09-26T08:32:53+0000",
            "content": "This issue can be closed because It cannot be reprocedured in the lastest version of Solr. "
        }
    ]
}