{
    "id": "SOLR-10830",
    "title": "Solr needs to enforce that _root_ field has the same fieldType as the uniqueKey field",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "it's pretty important for correct childDocument behavior that the _root_ field have the same <fieldType/> as the uniqueKey field – but nothing seems to enforce that.\n\n(I realized this while working on SOLR-10807 where i was forcing all fields to be Points based except for the uniqueKey field and got some weird errors in PeerSync that only related to replacing child documents – because the schema.xml has a TrieIntField based \"id\" field, but _root_ was using IntPointField – but the same problem could affect any schema if folks change the id from string to long, or int to string, and don't make the corrisponding change to the definition of _root_)",
    "attachments": {
        "SOLR-10830.patch": "https://issues.apache.org/jira/secure/attachment/12872165/SOLR-10830.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-08T22:48:07+0000",
            "content": "straight forward patch with tests ",
            "author": "Hoss Man",
            "id": "comment-16043567"
        },
        {
            "date": "2017-06-09T07:36:13+0000",
            "content": "seems good ",
            "author": "Mikhail Khludnev",
            "id": "comment-16044089"
        },
        {
            "date": "2017-06-09T22:10:52+0000",
            "content": "thanks Mikhail Khludnev, unfortunately there's a problem...\n\nWhen i wrote that quick patch yesterday, i didn't bother trying to run all tests because I took it as a given that we probably had a bunch of test schemas with copy/pasted field definitions that violated this but weren't problematic because they didn't actaully use child docs.\n\nWhen i went to run test today to move forward with this issue, I realized that in addition to schemas with explicit _root_ fields, i was also seeing failures from tests that used \"*\" dynamicFields that were matching _root_.  Since it's probably more common for folks to have something like <dynamicField name=\"*\" type=\"text\" /> in their schemas then it is that folks are using childDocs, i don't really think we should fail on startup in those cases.\n\nSo the update patch tweaks the logic so that hard failure on IndexSchema init is only if _root_ is explicitly defined.  Later, in AddUpdateCommand.flatten, I added a stricter check to fail updates that involve child docs unless the _root_ field type matches.  I also added a test for this situation, and updated any existing schema files that were problematic.\n\nWDYT? ",
            "author": "Hoss Man",
            "id": "comment-16045111"
        },
        {
            "date": "2017-06-10T21:41:36+0000",
            "content": "Hoss Man, it makes sense.  ",
            "author": "Mikhail Khludnev",
            "id": "comment-16045711"
        },
        {
            "date": "2017-06-13T17:17:40+0000",
            "content": "Commit 6396cb759f8c799f381b0730636fa412761030ce in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6396cb7 ]\n\nSOLR-10830: Solr now correctly enforces that the 'root' field has the same fieldType as the uniqueKey field ",
            "author": "ASF subversion and git services",
            "id": "comment-16048125"
        },
        {
            "date": "2017-06-13T17:23:51+0000",
            "content": "NOTE: even though this is a \"bug fix\" i've made the choice to only commit it to master and not backport...\n\n\n\tif folks are using child docs with 6.x and their schema has a mismatch they have probably already noticed\n\tif folks are not using child docs with 6.x, they may still have a schema missmatch they don't care about (ie: at some point htye changed the \"id\" definition from the sample configs but didn't change _root_) so i don't wnat to suddenly break things for them in a bug fix release.\n\n\n\nI am -0 on anyone else making the choose to backport ... but I don't plan on doing it. ",
            "author": "Hoss Man",
            "id": "comment-16048133"
        },
        {
            "date": "2017-06-13T19:45:06+0000",
            "content": "Commit 5835dcb3476b7355130e2eea2c485898232c56d0 in lucene-solr's branch refs/heads/branch_6x from Tomás Fernández Löbbe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5835dcb ]\n\nSOLR-10833: Better exception handling of queries in numeric fields\n\nCherry picked 6396cb759f8c799f381b0730636fa412761030ce from master and manually removed code related to SOLR-10830 ",
            "author": "ASF subversion and git services",
            "id": "comment-16048305"
        }
    ]
}