{
    "id": "SOLR-2085",
    "title": "SolrJ fails with a NullPointerException when the order of result components changes",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When using a custom search component in Solr I noticed that the order of the \"params\", \"response\" and \"facet_counts\" fields in the response changed. Normally the \"response\" field is included before the \"facet_counts\" field, but in my result it first returned \"facet_counts\" and then \"response\". This is of course a valid and semantically identical result object, but it causes SolrJ to fail with a NullPointerException.\n\nThe reason for this NPE is that SolrJ in org.apache.solr.client.solrj.response.QueryResponse.setResponse(NamedList<Object> res) uses a loop through the response components and right after encountering \"facet_counts\" calls extractFacetInfo( _facetInfo ). That method uses _results which is null if the \"response\" component has not been encountered yet. (It is handled and set a few lines above the call to extractFacetInfo).\n\nThe solution is to move the call to extractFacetInfo() on line 99 out of the for-loop. Please see the attached simple patch for the solution.\n\nI have also checked the three other initialization calls that are made directly after encountering a result (extractDebugInfo, extractHighlightingInfo and extractSpellCheckInfo), the problem does not apply to those because the methods don't access global fields that need to be initialized.\n\nNote: It would be great if this could be applied to a maintenance release as it saves people from running a custom build to be able to use complex search components with SolrJ.",
    "attachments": {
        "SOLR-2085-QueryResponse.patch": "https://issues.apache.org/jira/secure/attachment/12452924/SOLR-2085-QueryResponse.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12987858",
            "date": "2011-01-28T00:46:03+0000",
            "content": "Thanks for the patch Tomas.\n\nBy the looks of it, someone already fixed the NPE, but the code would still behave differently depending on the output order – i've added your patch along with a note about why delayed execution is important.\n\nCommitted revision 1064386. - trunk\nCommitted revision 1064390. - 3x "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013030",
            "date": "2011-03-30T15:45:21+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}