{
    "id": "SOLR-4439",
    "title": "Developer Curb Appeal: Cloud Admin UI: when done visiting other nodes, provide additional links to ...",
    "details": {
        "affect_versions": "4.1",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "We have a nice UI in SolrCloud that shows the cluster's nodes graphically.\n\nWhen you click on one of those nodes, you're taken to that nodes main page.\n\nWe should put some links on that page instead of \"stranding\" you there:\n\n\tLink to go back to cloud diagram on the node you started on.\n\tLink to go to the cloud diagram on the current node you're now on.\n\n\n\n(this is in addition to fixing the Back Button issue, logged in a separate bug report)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13632788",
            "date": "2013-04-16T12:12:48+0000",
            "content": "Link to go back to cloud diagram on the node you started on.\nI'm not sure, how we should do this? i mean, you're following a typical link, so we may be able to get the referrer (the url you're coming from) .. but that could be everything. a link from the tutorial, a intranet, webmail .. and we have no way to check if it's part of your cloud .. we don't even know, if it's a solr instance at all?\n\nLink to go to the cloud diagram on the current node you're now on.\nWhat about directly linking you to the cloud-diagram when you click on a node? in relation to the \"highlight the current node\"-idea from another of your issues .. that might get you near where you like to be? "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13643184",
            "date": "2013-04-26T19:54:43+0000",
            "content": "You raise good points.\n\nThe motive/use-case:  (which might help generate additional ideas)\nI want to visit a bunch of nodes in my cluster in rapid succession.\nWith the current model, each \"hop\" would take 2 clicks:\n1: Click on Cloud\n2: Click on the next node\n\nIn the old days I might have suggested frames, where the cloud diagram stays in one pane, and then each node that I visit refreshes another pane.  Frames seem highly deprecated now.  Also, there'd be some question about whether the cluster-diagram is updated by the original machine (in which case you'd have to re-highlight the new \"current node\"), OR re-render the cloud diagram each time by the new machine (which then means you really didn't need frames but just divs)\n\nOf course this use-case might be somewhat mitigated if SOLR-4770 were implemented, so I could quickly get critical info about each node without actually visiting it.\n\nI'm not sure what the \"right\" answer is.  Happy to hear your thoughts Stefan. "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13643198",
            "date": "2013-04-26T20:08:16+0000",
            "content": "Oh, turns out SOLR-4770 may not be feasible, so this use case's motive is renewed. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717343",
            "date": "2013-07-23T18:47:55+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971329",
            "date": "2014-04-16T12:57:47+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}