{
    "id": "SOLR-2044",
    "title": "Replication ping page for use with Amazon EC2 and Multiple Cores",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "When hosting SOLR at Amazon there is an issue with load balancing and replication. This is especially useful when you are using multiple slaves behind\nthe load balancer and a MASTER SOLR box. The Load Balancer at Amazon has no way of knowing that each SLAVE has data from the MASTER replicated. As soon as the instance starts, \nAmazon starts sending requests to the Slaves. You need to have the Slave running in order to get the files from the Master.\n\nThe solution is to add a ping.jsp page that Amazon hits on the Slave Tomcat/Jetty instances. The ping.jsp checks all cores to make sure they all have data, otherwise it returns a non-200 values which signals Amazon\nto not send requests to the Slaves.\n\nPut this into your solr.war file as /admin/replication/ping.jsp",
    "attachments": {
        "ping.jsp": "https://issues.apache.org/jira/secure/attachment/12451988/ping.jsp"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Bill Bell",
            "id": "comment-12898065",
            "date": "2010-08-13T03:48:49+0000",
            "content": "1.4.x file to ad to solr.war  "
        },
        {
            "author": "Peter Wolanin",
            "id": "comment-12919440",
            "date": "2010-10-09T00:27:00+0000",
            "content": "\nThere is already a \"health check\" functionality - seems like this might be combined?  Or instead you might have an external script which does this same check and sets or removes the health check file?\n "
        },
        {
            "author": "Bill Bell",
            "id": "comment-12919442",
            "date": "2010-10-09T00:40:44+0000",
            "content": "True it could be combined with a parameter like \"?replication=true\" to indicate that the ping returns true if replication has completed.\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043713",
            "date": "2011-06-03T16:46:41+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106398",
            "date": "2011-09-16T14:50:54+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237053",
            "date": "2012-03-23T20:31:34+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13294763",
            "date": "2012-06-14T01:42:24+0000",
            "content": "Removing fix version since this issue hasn't gotten much attention lately and doesn't appear to be a priority for anyone for 4.0.  \n\nAs always: if someone wants to take on this work they are welcome to do so at any time and the target release can be revisited\n\n—\n\nIn particular, JSP support has been removed from solr – largely to ensure that the data available in the Admin UI is always available via handlers – so the patch would need to be reworked into handler code of some kind.\n\nMy suggestion would be to add this logic directly into the ReplicationHandler as an option that causes a failure if the indexversion is \"0\". "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16067392",
            "date": "2017-06-28T22:47:01+0000",
            "content": "Closing ancient issue which is obsolete now that you'd most probably run SolrCloud in the cloud. "
        }
    ]
}