{
    "id": "SOLR-12994",
    "title": "search engine for my site just as page title lookup in solr reference.",
    "details": {
        "type": "Task",
        "status": "Resolved",
        "labels": "",
        "fix_versions": [],
        "components": [
            "JSON Request API",
            "search",
            "SolrCloud"
        ],
        "priority": "Major",
        "resolution": "Invalid",
        "affect_versions": "7.5"
    },
    "description": "I need to create a search engine for my site which has many different insights with descriptions in it. It should be something like the search box provided by solr in the reference website. I need some help to guide me through the different steps. I don't understand how it is woking because i have uploaded some json docs to my core and performed a query, but i am not getting any results. \n\n \n\nThis is the link i was talking about-- https://lucene.apache.org/solr/guide/7_2/about-this-guide.html",
    "attachments": {
        "Screenshot 2018-11-16 at 5.56.12 PM.png": "https://issues.apache.org/jira/secure/attachment/12948492/Screenshot%202018-11-16%20at%205.56.12%20PM.png"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16692224",
            "content": "This doesn't need to be a private issue, those are reserved for security vulnerabilities while the Lucene/Solr PMC figures out how to address those types of issues in Lucene and Solr.\n\nHowever, the question does not report a bug with Solr itself, so the question is better suited for the solr-user mailing list. You can find information about subscribing here: https://lucene.apache.org/solr/community.html#mailing-lists-irc.\n\nAs a short answer, however, that is not a search box as you are thinking of it. That is a page title lookup that finds matching keywords in a JSON file that's built when the Ref Guide's static HTML pages are built. It requires Jekyll and Liquid templates to duplicate it, but the source code is available in Solr's source: https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=tree;f=solr/solr-ref-guide;hb=refs/heads/master.\n\nHowever, I think you will be better served by asking other Solr users how they have integrated search into their sites by emailing your question to the solr-user mailing list. ",
            "author": "Cassandra Targett",
            "date": "2018-11-19T20:32:45+0000"
        }
    ]
}