{
    "id": "SOLR-979",
    "title": "add ability to specify multiple values for a Key in a Script transformer",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "In writing my DIH configuration for my Knowledge base code I ran across a need to have a script transformer create multiple values for a single schema field, and the Map object does not allow this (unless I can put an array as the value for that key).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12666637",
            "date": "2009-01-23T18:25:13+0000",
            "content": "Edward, multiple values can be specified as a Java Collection object. So basically you need to create List of your values and add them for to the map for your field. I'm sure there is a way to do that with scripts, I just don't know how. Perhaps the javascript list is converted automatically to Java List by Rhino (the default javascript engine in JDK6)? "
        },
        {
            "author": "Edward Rudd",
            "id": "comment-12666736",
            "date": "2009-01-23T22:08:40+0000",
            "content": "Well I did a quick test of adding a JS array to the Map and it came back as the string representation of the Rhino array Java class. (ie.. not mapped to a java collection)..   \n\nI'll have to hunt and read through the documentation for JDK 1.6's JS component to figure out even how to create a collection within the JS..  Or add a check in DIH to iterate through the JS array object as well.\n\nI'll have more time to play w/ this on monday and see what I find out. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12666861",
            "date": "2009-01-24T08:57:21+0000",
            "content": "you can put only a valid java collection in the map\n\ntry this\n\nvar arr = new java.util.ArrayList();\narr.add('hello');\narr.add('world');\nrow.put('terms',arr);\n\n\nHTH "
        },
        {
            "author": "Edward Rudd",
            "id": "comment-12668108",
            "date": "2009-01-28T18:47:28+0000",
            "content": "using new java.util.ArrayList() worked.. Thanks..  \n\nI'm going to update the WIKI page to add some more explanation and examples on the ScriptTransformer "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12668131",
            "date": "2009-01-28T19:57:53+0000",
            "content": "Edward, many thanks for updating the wiki with the instructions "
        }
    ]
}