{
    "id": "SOLR-7997",
    "title": "Add new Solr book 'Scaling Big Data with Hadoop and Solr' to resources",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Hrishikesh Vijay Karambelkar is proud to finally announce the book Scaling Big Data with Hadoop and Solr - Second Edition by Packt Publishing. This book will help the readers understand, design, build, and optimize their big data search engine with Hadoop and Apache Solr.\nScaling Big Data with Hadoop and Solr - Second Edition is aimed at developers, designers, and architects who would like to build big data enterprise search solutions for their customers or organizations. It explores the different approaches to making Solr work on big data ecosystems apart from Apache Hadoop.\nA practical guide that covers interesting, real-life cases for big data search along with sample code chaperones the readers to improve search performance while working with big data.\n\nClick to read more about Scaling Big Data with Hadoop and Solr - Second Edition: https://www.packtpub.com/big-data-and-business-intelligence/scaling-big-data-hadoop-and-solr-second-edition",
    "attachments": {
        "3396OS_Scaling Big Data with Hadoop and Solr - Second Edition.jpg": "https://issues.apache.org/jira/secure/attachment/12753497/3396OS_Scaling%20Big%20Data%20with%20Hadoop%20and%20Solr%20-%20Second%20Edition.jpg",
        "solr-7997.patch": "https://issues.apache.org/jira/secure/attachment/12766261/solr-7997.patch",
        "book_scaling_big_data_hadoop_solr_II.jpg": "https://issues.apache.org/jira/secure/attachment/12766327/book_scaling_big_data_hadoop_solr_II.jpg"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-10-13T04:51:49+0000",
            "author": "Hrishikesh Karambelkar",
            "content": "Patch for Solr-7997 ",
            "id": "comment-14954385"
        },
        {
            "date": "2015-10-13T04:52:12+0000",
            "author": "Hrishikesh Karambelkar",
            "content": "I've attached the files to change the site. Could someone please review and apply the patch ? ",
            "id": "comment-14954387"
        },
        {
            "date": "2015-10-13T13:18:41+0000",
            "author": "Steve Rowe",
            "content": "Attaching the book cover image scaled down to 150px width (the one previously attached here is much larger), and also an updated patch:\n\n\n\tAdded the new book cover to the set of six book covers on the front page of the Solr site, displacing the oldest book \"Einführung in Apache Solr\".\n\tRenamed book title anchor to include \"-II\" suffix to indicate that it's the second edition (using the same style as the book image name).\n\tFixed book cover anchor to remove the extra empty-tag-syntax slash: <a href=\"...\" /></a> -> <a href=\"...\"></a> - this was a problem on all the books, not just the new one, so I fixed them all.  (I'm guessing that people initially assumed that XML-style empty tag syntax <a/> would work, but when it didn't, they added the closing </a> tag but left the empty-tag-syntax slashhh in place since HTML browsers apparently are parsing leniently.)\n\n\n\nThe new book was published on 2015-04-27, so it's already properly positioned between \"Apache Solr Enterprise Search Server 3ed\" (published 2015-05-26) and \"Apache Solr Search Patterns\" (published 2015-04-26).\n\nCommitting and publishing shortly. ",
            "id": "comment-14954911"
        },
        {
            "date": "2015-10-13T13:20:25+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1708386 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1708386 ]\n\nSOLR-7997: Add new Solr book 'Scaling Big Data with Hadoop and Solr, Second Edition' to the Solr website ",
            "id": "comment-14954914"
        },
        {
            "date": "2015-10-13T13:25:27+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1708388 from Steve Rowe in branch 'cms/trunk'\n[ https://svn.apache.org/r1708388 ]\n\nSOLR-7997: remove extra space in link to author site, causing it to be broken ",
            "id": "comment-14954923"
        },
        {
            "date": "2015-10-13T13:30:01+0000",
            "author": "Steve Rowe",
            "content": "Committed and published. ",
            "id": "comment-14954929"
        }
    ]
}