{
    "id": "SOLR-4241",
    "title": "Add object to SolrJ for interpreting DIH status",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Objects exist in SolrJ for easy interpretation of special handlers - SolrPing/SolrPingResponse is a prime example.  I believe it would be a good idea to add similar capabilities for easily interpreting DIH status.\n\nThe only sticky point I can see is the fact that the dataimport handler is a contrib module.  This might mean that this new capability would have to be separated into a small jar file in a solrj contrib section.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13636793",
            "date": "2013-04-19T19:48:03+0000",
            "content": "This is something I would like to work on, but won't object if someone else wants to take over.  I can think of two questions to answer:\n\n1) Whether to wait until the DIH response is more consistent and machine-readable, or to forge ahead with this issue with the existing DIH response.\n\n2) I don't think there is such a thing as solrj contrib.  The DIH module is contrib, so it probably doesn't make sense to make this module part of solrj core.  How should I package this object?  Would there be any visibility problems if it is part of the main dataimport module?\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717182",
            "date": "2013-07-23T18:47:23+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971189",
            "date": "2014-04-16T12:57:24+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}