{
    "id": "SOLR-8354",
    "title": "RecoveryStrategy retry timing is innaccurate",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "At the end of RecoveryStrategy::doRecovery there is a retry segment, with a comment that suggests the code will // start at 1 sec and work up to a min. The code will actually start at 10 seconds, and work up to 5 minutes. Additionally, the log statement incorrectly reports how long the next wait will be. Either the comment and log should be corrected or the logic adjusted.",
    "attachments": {
        "SOLR-8354.patch": "https://issues.apache.org/jira/secure/attachment/12774899/SOLR-8354.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-30T22:41:29+0000",
            "author": "Mike Drob",
            "content": "Patch attached that changes the sleep to match what is in the comment. ",
            "id": "comment-15032633"
        },
        {
            "date": "2015-11-30T23:57:21+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Should we not, instead, change the comment to reflect what current behavior is? If the existing timeouts are working well, I don't think we should change the behavior without a real reason. ",
            "id": "comment-15032748"
        },
        {
            "date": "2015-12-01T00:06:30+0000",
            "author": "Mike Drob",
            "content": "Looks like this was originally added by Mark Miller - https://github.com/apache/lucene-solr/commit/9cb587e216283275ddcd8161a6306daf7b924cfc with the comment and the logic coming in at the same time. Shalin Shekhar Mangar later changed the 600 to 60.\n\nDo you guys know what the intent here is? Happy to adjust the comment and logging instead of the logic, depending on which one can be considered the source of truth. ",
            "id": "comment-15032759"
        },
        {
            "date": "2015-12-01T00:21:23+0000",
            "author": "Mark Miller",
            "content": "Auto complete for names not working on my phone.  Ram had a good point about simplifying these retries and not backing off at all. Instead just rely every N seconds or something.  ",
            "id": "comment-15032778"
        },
        {
            "date": "2015-12-01T01:07:46+0000",
            "author": "Mark Miller",
            "content": "The problem with the retry back off is that it doesnt work so well. Eventually it's taking too long between tries for something that should be fairly cheap to attempt and fail.  ",
            "id": "comment-15032837"
        },
        {
            "date": "2015-12-01T12:06:58+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Yeah, just complicates things and leads to unexpected delays if our assumptions on the root cause of the failure was wrong. I do favour a simple retry delay.. ",
            "id": "comment-15033577"
        },
        {
            "date": "2015-12-01T16:18:40+0000",
            "author": "Mike Drob",
            "content": "So we can drop the exponential, and wait ~2 sec between each retry? I have mixed feelings about hard-coding that, especially since I kind of arbitrarily chose 2 seconds here. Could make it configurable, though. ",
            "id": "comment-15033974"
        },
        {
            "date": "2016-06-08T10:46:17+0000",
            "author": "Christine Poerschke",
            "content": "SOLR-9045 would be related if we decide to make something configurable here. ",
            "id": "comment-15320372"
        }
    ]
}