{
    "id": "SOLR-1374",
    "title": "When a test fails, display the test file in the console via ant junit",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "3.2"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "When a test fails, it would be great if the junit test output file were displayed in the terminal.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12757668",
            "date": "2009-09-19T15:33:20+0000",
            "content": "I agree - not the whole test file though.... just the error part if possible.\n\nRelated - what's the reason that we use XML formatting for junit output?  Is it for hudson or something?  It's more difficult to read by hand.  Last I checked, it also causes all output to be buffered before it's comverted to XML in one shot - in the past this has lead to out-of-memory errors when running junit based stress tests from the command line. "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-12758281",
            "date": "2009-09-22T16:05:17+0000",
            "content": "I was thinking the list of test files and their paths, like ant does\nafter building a war or jar.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12759943",
            "date": "2009-09-26T20:06:34+0000",
            "content": "Related - what's the reason that we use XML formatting for junit output?\n\nhudson, as well as \"ant test-reports\" \n\nit would be pretty trivial to rplace the formatter name (\"xml\") with a property so you could change it at run time ... or we could.  We can also declare as many formatters as you want in the <junit> task, each with differnet options, and then mark them as \"if\" or \"unless\" certain properties (the \"brief\" formatter is already declared that way)\n\nYou just have to pick what you want.\n\nI was thinking the list of test files and their paths\n\nIt sounds like you just want to see the output of... \n\ngrep -rL 'errors=\"0\" failures=\"0\"' build/test-results\n\n\n...but i'm not really clear on what you'd want to do with that info, so maybe i'm missing something. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872567",
            "date": "2010-05-27T22:08:00+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-12985999",
            "date": "2011-01-24T21:12:18+0000",
            "content": "Sorry if this spam's things, however it's unlikely that I'll work on these. "
        }
    ]
}