{
    "id": "SOLR-5965",
    "title": "Solr Reference Guide: Investigate shortcut links to automatically version javadoc links",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.8"
        ],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Confluence has a feature called \"Shortcut links\", that allow link prefixes (or infixes or suffixes) to be specified in short form.\n\nI think this feature could be used to version javadoc links so that we have two shortcuts, one for the latest Solr javadocs and another for the latest Lucene javadocs, and then all javadoc links are specified relative to these shortcuts.\n\nSee https://confluence.atlassian.com/display/CONF50/Configuring+Shortcut+Links.\n\nTwo problems, both minor I think:\n\n\n\tCreating and maintaining shortcut links requires Confluence Admin privileges, but Apache Infrastructure has taken these away from just about everybody.  When I last chatted on #asfinfra with gmcdonald (who took away the privileges), though, he was okay with giving this back Confluence Admin privileges if we found that it was necessary.\n\tThere is an open bug with editing shortcut-form links - it doesn't work - you have to remove them and then re-add them: https://jira.atlassian.com/browse/CONF-24812",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13961195",
            "date": "2014-04-05T18:24:47+0000",
            "content": "Actually, this applies to all versioned documentation, including Changes.html and the Solr tutorial, not just the javadocs. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13969558",
            "date": "2014-04-15T13:56:25+0000",
            "content": "I added 2 shortcut links as a first step:\n\n\tlucenereleasedocs -> http://lucene.apache.org/core/4_7_0/\n\tsolrreleasedocs -> http://lucene.apache.org/solr/4_7_0/\n\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13969560",
            "date": "2014-04-15T13:57:22+0000",
            "content": "I can confirm, that editing does not work. It is a pain to remve and readd them. You have to be careful to not change the link \"key\", otherwise all links suddenly no longer work. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13969614",
            "date": "2014-04-15T15:22:07+0000",
            "content": "Thanks Uwe Schindler.  I'll modify all versioned links (mostly javadocs) to use those shortcut links, and also ask Infra about restoring confluence admin privileges to more Lucene PMC members. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13969869",
            "date": "2014-04-15T18:33:41+0000",
            "content": "I talked to pctony, gmcdonald and joes4 on the #asfinfra IRC channel – TL;DR: they don't want to give out confluence admin karma for this one feature; Uwe Schindler will remain a member of confluence-admins group; gmcdonald is willing to help us maintain the Solr Ref Guide shortcut links once per release, via an INFRA JIRA ticket; and joes4 says we can get versioned links and PDF exports by switching Solr Reference Guide hosting from Confluence to the Apache CMS.\n\n\n<sarowe> gmcdonald: I have a question about Confluence admin privileges - for the\n         Solr Reference Guide, we want to use shortcut links, which require \n         confluence admin to create and maintain - see \n         https://issues.apache.org/jira/browse/SOLR-5965 for more details \n<sarowe> gmcdonald: Uwe Schindler, the Lucene PMC chair, currently is a member\n         of confluence-admins (sp?) group, and so has the power to add others to that\n         group.  Would you be okay with him adding Lucene PMC members to that\n         group: myself and Chris Hostetter initially (and also adding/subtracting as\n         needed)?\n<pctony> sarowe: no\n<pctony> sarowe: that group was culled recently.\n<sarowe> pctony: i know\n<pctony> we really do not like features that mean you need to be a system wide admin\n<sarowe> pctony: by gmcdonald, who told me on March 25 on this channel \"if you feel\n         you need it back, happy to do so, but try space admin rights first\"\n<pctony> i might be more inclined to ask the PMC to stop using said feature\n<sarowe> pctony: thanks, but we want to *start* using this feature to make maintainance\n         tractable - we have a lot of links that we want to version\n<pctony> sarowe: bah\n<pctony> gmcdonald: we need to chat about this ^^\n[...]\n<gmcdonald> sarowe: hi\n<sarowe> hi gmcdonald\n<gmcdonald> sorry was outside\n<sarowe> np\n<gmcdonald> so example of links please ?\n<sarowe> versioned javadocs links\n<sarowe> per-release\n<sarowe> we release the solr ref guide in tandem with solr releases\n<sarowe> and want to have the right javadoc link for them\n<sarowe> *goes to find an example javadoc link*\n<gmcdonald> boggles the mind a global admin is needed for that\n<sarowe> yes, it does\n<sarowe> this should be possible per-space\n<gmcdonald> you are a space admin right?\n<sarowe> gmcdonald: http://lucene.apache.org/solr/4_7_2/solr-core/org/apache/solr/schema/BinaryField.html\n<sarowe> yes, I am a space admin\n<sarowe> gmcdonald: the \"4_7_2\" part changes with each release, and the Solr\n         Reference Guide is release with each minor release - we want to point to\n         the correct versioned javadocs (and other versioned content)\n<gmcdonald> sarowe: ever though of using 'current' ￼\n<sarowe> yes, but users of older version of exported PDFs (which we distribute via\n         the apache mirrors) would point to newer stuff than they should\n<pctony> sarowe: do what httpd do\n<pctony> make /current a symlink to /$latest-version\n<joes4> why not use the cms extpaths.txt support for this\n<sarowe> pctony: see my response about exported pdfs above\n<sarowe> joes4: if you're talking to me, then the answer is we already do use extpaths.txt\n         for versioned content\n<joes4> then what do you need the wiki for again?\n<sarowe> joes4: the versioned content managed via extpaths.txt is javadocs; the versioned\n         content managed by releasing PDF exports from Confluence is a user guide - does\n         that answer your question?\n<joes4> so the pdf's link to the website?\n<sarowe> joes4: yes\n<joes4> i still don't see a problem with versioning things properly. don't you want the\n         version numbers to match up?\n<sarowe> joes4: yes! that's exactly what I'm after.  Confluence shortcut links make\n         maintenance of links much more tractable - change a version number in the\n         shortcut link and boom, they're all pointing to the correctly versioned location\n<joes4> you can do that with the cms too if you want\n<joes4> see the thrift site for examples\n<sarowe> joes4: can you say more words about how that would work to link from\n         a per-release exported PDF from Confluence?\n<joes4> i'm saying you could manage the pdf stuff from the cms instead of confluence\n<joes4> whatever features that keep you using confluence are emulatable with the cms\n<sarowe> joes4: Um, okay, I don't think that's going to happen short or even\n         medium term - the effort involved would be fairly large, and the benefit fairly small\n<gmcdonald> they use confluence to produce the pdfs in the 1st place I expect\n<joes4> and the good news is that there are some conversion utilities for that\n<joes4> well for us it avoids this whole admin karma discussion that you want to have\n<joes4> given the choice between supporting your use case for admin karma and\n         asking you to migrate to a better system, all we can do is ask\n<gmcdonald> sarowe: I'd be happy in this instance to provide the links for you if you\n         raise a infdra ticket at release time\n<sarowe> gmcdonald: Uwe Schindler, the Lucene PMC chair, currently is a member of\n         the confluence-admins group, and has already created the two shortcut links we\n         want - my questions here are about future maintenance, since you may throw him\n         off with zero notice (see recent history for an example)\n<gmcdonald> sarowe: no I left him in on purpose, having done some confluence admin\n         work , like plugin stuf etc, so he wont be leaving that group\n<sarowe> gmcdonald: oh, okay, that's useful info\n<sarowe> gmdonald: and thanks for the offer to maintain the shortcut links for us, if it\n         comes to that\n<sarowe> gmcdonald: ^\n<gmcdonald> np, happy to\n\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13971799",
            "date": "2014-04-16T18:47:24+0000",
            "content": "I modified all versioned javadoc (& other doc) links in the ref guide to use the shortcut links Uwe created.\n\nI modified the internal ref guide documentation in two places to describe how to use and maintain shortcut links.  "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13982612",
            "date": "2014-04-27T23:25:57+0000",
            "content": "Close issue after release of 4.8.0 "
        }
    ]
}