{
    "id": "SOLR-8567",
    "title": "SOLR-839 broke the Maven build (trunk, 5.5)",
    "details": {
        "components": [
            "Build"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.5",
            "6.0"
        ],
        "affect_versions": "5.5,                                            6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "SOLR-839 adds a new code dependency between the Solr test code and the Lucene test code.  ant handles this with some updates to the common-build.xml (included in SOLR-839) but the maven build mechanism needs updates to the pom.xml.template with an equivalent change.",
    "attachments": {
        "SOLR-8567.patch": "https://issues.apache.org/jira/secure/attachment/12783091/SOLR-8567.patch",
        "SOLR-8567_test-jar_approach.patch": "https://issues.apache.org/jira/secure/attachment/12783407/SOLR-8567_test-jar_approach.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-19T12:14:48+0000",
            "author": "Daniel Collins",
            "content": "This is a dump of a git patch, but should be good enough to let you apply it to trunk and 5.5. ",
            "id": "comment-15106646"
        },
        {
            "date": "2016-01-19T13:32:15+0000",
            "author": "Christine Poerschke",
            "content": "Thanks for reporting this and providing a patch. I am not (yet) locally set up for and familiar with Maven builds, so it may take me a little while to take care of this as a follow-on to SOLR-839. (If in the meantime anyone else is already set up and more familiar, feel free to grab this ticket from me.) ",
            "id": "comment-15106704"
        },
        {
            "date": "2016-01-19T17:56:21+0000",
            "author": "Erick Erickson",
            "content": "Last I knew, the Maven version is not \"officially\" supported, it's there as a convenience so I don't think backporting to 5.4 is strictly necessary.\n\nLet's backport it anyway to 5.4 so it would be included in any re-spin, but in and of itself it's not going to justify a respin of 5.4, especially with the Git stuff happening (tentatively) this weekend IMO. ",
            "id": "comment-15107078"
        },
        {
            "date": "2016-01-19T18:06:31+0000",
            "author": "Daniel Collins",
            "content": "Erick Erickson The references to 5.4 were my bad, I'm back-porting to our internal 5.4.x branch which was what confused me, so apologies for that.  I've updated my comment now to correct that.\n\nThe only versions that are broken are 5.5 and trunk, so only \"unreleased\" branches.\n\nI wonder if anyone (else) used the Maven build process, wasn't sure of its status, but I figured it wasn't really used much.  For any projects which are dependent on Lucene (e.g. Luwak), maven seems to be a more convenient build mechanism, so we do make use of it, but I don't know who else does! ",
            "id": "comment-15107099"
        },
        {
            "date": "2016-01-19T18:19:59+0000",
            "author": "Erick Erickson",
            "content": "NP. And yes, others do use the Maven build process but AFAIK, it's not exercised nearly as much as the ant version, so it lags at times. ",
            "id": "comment-15107124"
        },
        {
            "date": "2016-01-20T20:20:45+0000",
            "author": "Steve Rowe",
            "content": "I looked at the patch on this issue, and I don't think adding the queryparser module's test .class files to the test phase classpath via a testResource is the way to go.\n\nMaven has a standard mechanism for this, which is used elsewhere in the build (e.g. the dih-extras module has a test dependency on the dih module's tests): maven-jar-plugin:test-jar will generate a jar of test classes on the producer module side, and then the consumer module depends on this jar via a test-scope dependency of type test-jar.\n\nI'll work up a patch. ",
            "id": "comment-15109324"
        },
        {
            "date": "2016-01-20T20:31:49+0000",
            "author": "Steve Rowe",
            "content": "Patch that fixes solr-core test compilation for me.\n\nRunning all tests now. ",
            "id": "comment-15109340"
        },
        {
            "date": "2016-01-21T05:32:07+0000",
            "author": "Steve Rowe",
            "content": "\nPatch that fixes solr-core test compilation for me.\n\nRunning all tests now.\n\nAll tests pass with the exception of a couple that are not related.\n\nCommitting shortly. ",
            "id": "comment-15110084"
        },
        {
            "date": "2016-01-21T05:33:54+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1725866 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1725866 ]\n\nSOLR-8567: Maven build: Add solr-core test dependency on the lucene queryparser test-jar, required for SOLR-839 ",
            "id": "comment-15110085"
        },
        {
            "date": "2016-01-21T05:42:46+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1725868 from Steve Rowe in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1725868 ]\n\nSOLR-8567: Maven build: Add solr-core test dependency on the lucene queryparser test-jar, required for SOLR-839 (merged trunk r1725866) ",
            "id": "comment-15110100"
        },
        {
            "date": "2016-01-21T05:43:26+0000",
            "author": "Steve Rowe",
            "content": "Committed to trunk and branch_5x. ",
            "id": "comment-15110102"
        }
    ]
}