{
    "id": "SOLR-7074",
    "title": "Simple script to start external Zookeeper",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "When starting Zookeeper for SolrCloud, we have two choices, bin/solr -c (without -z) and run Zookeeper embedded. Whilst this works, it is suggestive of bad practice, something you will have to unlearn later.\n\nThe second option is to download Zookeeper, and install it manually. This isn't hugely hard, but it is quite manual. However, try it on Windows, and you'll find the Windows start script for Zookeeper is extremely thin (no start/stop options, etc).\n\nSolr contains everything needed to start Zookeeper. Why not have a bin/zk script that can start it for us. Thus, first time user instructions for ZolrCloud could be:\n\nbin/zk start\nbin/zk uploadconf examples/techproducts/conf\nbin/solr start -c -Z\n\n-Z here hypothetically says \"look in the standard place, localhost:2181, for Zookeeper\".\n\nor even:\n\nbin/zk start -config=examples/techproducts/conf\nbin/ssolr start -Z\n\nThis should support both Windows and Unix.\n\nbin/zk would support all the functionality of the current zkCli scripts as well as being able to start/stop zookeeper.\n\nThis would make initial experience of using Solr a lot simpler, in my view, which would be a good thing.\n\nNot only that, deploying Zookeeper in production, for Solr, need only be push a Solr app dir to the server, then run bin/zk start, reducing the complexity of installation.\n\nThoughts? If this seems like a good idea, and don't share valid objections, I'm prepared to make it happen.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-26T00:54:11+0000",
            "author": "Jan Høydahl",
            "content": "I like this idea. ZK is not officially supported in production for Windows, so we'll likely not get much traction within the ZK project to fix the Win start script. And perhaps Solr's usage of ZK is so basic that using the embedded ZK is more than good enough, with decent defaults.\n\nHow about simplifying the configuration of a ZK ensemble as well? To start node 1 in an ensemble, issue bin/zk start -id 1, which would automatically configure ZK with a myid file and decent zoo.cfg defaults, taking server host/port from ZK_HOST in solr.in.sh, or from a -z param. ",
            "id": "comment-14641814"
        },
        {
            "date": "2015-12-09T10:32:21+0000",
            "author": "Jan Høydahl",
            "content": "See comments in SOLR-8378. Suggest to let bin/zk only manage start/stop/status of ZK while bin/solr zk <command> <args> will do solr-specific zk operations... ",
            "id": "comment-15048448"
        },
        {
            "date": "2015-12-09T18:23:40+0000",
            "author": "Mark Miller",
            "content": "And perhaps Solr's usage of ZK is so basic that using the embedded ZK is more than good enough, with decent defaults.\n\nEmbedded comes with a lot of limitations. Unless you are toying around, simply makes no sense to use it. With some of the new dynamic cluster stuff newer ZK versions have, it could probably be improved, but even if it was, I still think anyone serious is going to want to run ZK as a separate service.\n\nI'm prepared to make it happen.\n\n+1, would be nice to not have to go dig up the right version and what not. ",
            "id": "comment-15049121"
        }
    ]
}