{
    "id": "SOLR-1088",
    "title": "newSearcher(String name, boolean readOnly) is broken",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Noted on the mailing list while investigating something semi-related, the method SolrCore.newSearcher(String name, boolean readOnly) doesn't work as advertised (the readOnly option is completely ignored)\n\nthe method isn't used anywhere in Solr (that i could find) but it might be used by clients ... we should deal with this in some way prior to the 1.4 release (either fix; fix & deprecate; or document problem and deprecate)\n\nhttp://www.nabble.com/Re%3A-Lucene-sync-bottleneck--p22237748.html",
    "attachments": {
        "SOLR-1088.patch": "https://issues.apache.org/jira/secure/attachment/12406535/SOLR-1088.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12702171",
            "date": "2009-04-24T00:14:20+0000",
            "content": "I think I added that method with the readonly patch - I figured it was a good idea to allow a searcher of either type (you get a non readonly otherwise). I don't know why it was commented out though (there really should be a comment about that included). We should drop it or fix it for sure. I think it makes sense to keep, and I'd just fix it, but I don't know why it was commented out to begin with so... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12705191",
            "date": "2009-05-02T00:10:49+0000",
            "content": "do what you think is best Mark "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12705308",
            "date": "2009-05-02T16:05:07+0000",
            "content": "I was leaning towards keeping it, because its no real overhead and why not have the option. Looking further though, even newSearcher(String name) is only used internally by DirectUpdateHandler, which is deprecated. I guess I would vote to just pull it before it becomes part of a release. If a use case comes up, its easy enough to add in the future.\n\nHaving said that, I wouldn't argue if anyone thought it was better to keep it and fix - the above patch does fix it. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775699",
            "date": "2009-11-10T15:52:00+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}