{
    "id": "SOLR-4026",
    "title": "Create a custom schema with creating collection",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Wish",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "It seems like we can not create custom schema for different collection,\n\nif we can  add schema configuration parameters to url of creating collection, that's better.\n\nthanks.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13488645",
            "date": "2012-11-01T12:39:27+0000",
            "content": "I don't quite understand what you mean here. Are you talking about the CREATE action on cores admin? And by \"add schema configuration parameters to the URL\", do you mean modify an existing schema somehow or stream up one you have locally?\n\nI can see where streaming up your local schema.xml (that you'd customized) would be useful, but..... to have a complete solution that would allow you to completely create a new instance without having already having at least a <newcollection>/conf directory in place, you'd also have to provide a way to put all the other conf files that you needed up on your server. Stopwords, solrconfig.xml, mapping files, synonyms, even, admin_extra.html.\n\nThis problem seems like something that would be very awkward to solve in Solr via a URL, it seems like an infrastructure that needed to do something like this would be better off scripting putting the conf directory \"the right place\" then using CREATE as it stands now.... "
        },
        {
            "author": "milesli",
            "id": "comment-13489204",
            "date": "2012-11-02T02:17:05+0000",
            "content": "1  Not modify an existing schema,  but rather put a new schema. \n\nfor example:\n\n   POST:\n   http://127.0.0.1:8983/solr/admin/collections?action=CREATE&name=new_collection&numShards=3&numReplicas=2\n\n   POST data:\n{\n\"mapping\":{\n    \"properties\":{\n        \"address\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"age\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"branch\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"company\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"interest\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"mail\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"name\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"oid\":\n{\n            \"type\":\"string\"\n        }\n,\n        \"ts\":\n{\n            \"type\":\"string\"\n        }\n    }\n }\n}\n\nwe can also put other configurations(Stopwords;solrconfig.xml ... ) into post data.\n\n\n2  Now , we want to create collection that have different schema from the others.\n    so what can i do?\n\n3  In a production environment , i am not sure that we are really allowed to log on the machine and upload configuration files or modify schema file.\n\n\n\n\n "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14341656",
            "date": "2015-02-28T17:07:19+0000",
            "content": "This has been major focus in latest 4.x and 5.0 version of Solr. Specifically REST APIs and configsets.\n\nI think it is safe to close this issue. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-14341854",
            "date": "2015-03-01T00:34:51+0000",
            "content": "milesli, some of the functionality you want is currently available.  There are managed APIs for adding fields to the schema, editing stopwords, and editing synonyms.\n\nhttps://cwiki.apache.org/confluence/display/solr/Schema+API\nhttps://cwiki.apache.org/confluence/display/solr/Managed+Resources\n\nOnce Solr is a standalone app that has complete control of the network and HTTP layers, full configuration management will be possible to implement securely.  That will be one of the things that gets looked at first. "
        }
    ]
}