{
    "id": "SOLR-3601",
    "title": "Reconsider Google Guava dependency",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Google Guava is a cool Java library with lots of useful stuff in it.  But note that the old version r05 that we have is 935kb in size and FWIW the latest v12 is 1.8MB.  Despite its usefulness, Solr (core) is not actually using it aside for a trivial case in org.apache.solr.logging.jul to get a string from a Throwable.  And I'm using it in my uncommitted patch for Solr adapters to the Lucene module.  The Clustering contrib module definitely needs it.  This dependency to Solr core seems half-hearted and I suspect it may have been inadvertent during improvements to the Clustering contrib module at some point.\n\nShall we get rid of this dependency to Solr core, and push it back to the contrib module?  I like Guava, I want to use it in my work, but the reality is that Solr core doesn't even touch 1% of it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13412134",
            "date": "2012-07-11T22:26:07+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429821",
            "date": "2012-08-07T03:43:19+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451151",
            "date": "2012-09-07T23:57:55+0000",
            "content": "removing fixVersion=4.0 because there is no patch, no assignee, and no evidence that anyone is currently working on this issue. (this can certainly be revisited if volunteers step forward)\n\nassigning to myself to look into later, anyone with an itch to deal with this should not hesitate to take it from me "
        },
        {
            "author": "David Smiley",
            "id": "comment-13505622",
            "date": "2012-11-28T16:28:17+0000",
            "content": "Marking as Won't Fix, as Guava successfully made it into 4.0 for better or worse, and so that about settles it. "
        }
    ]
}