{
    "id": "SOLR-6520",
    "title": "Documentation web page is missing link to live Solr Reference Guide",
    "details": {
        "affect_versions": "4.10",
        "status": "Open",
        "fix_versions": [
            "7.6",
            "master (8.0)"
        ],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The official document page for Solr is missing the link to the live Solr Reference Guide. Only the link to PDF is there. In fact, one has to go to the WIKI, it seems to find the link. \n\nIt is also not linked from the release-specific documentation page either.\n\nThis means the search engines do not easily discover the new content and it does not show up in searches for when people look for information. It also means people may hesitate to look at it, if they have to download the whole PDF first.",
    "attachments": {
        "SOLR-6520.patch": "https://issues.apache.org/jira/secure/attachment/12913912/SOLR-6520.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-14134098",
            "date": "2014-09-15T16:41:35+0000",
            "content": "The official document page for Solr is missing the link to the live Solr Reference Guide. \n\nthis is intentional - the live guide refers to unreleased content, and we want to minimize confusion (we already occasionally get people posting comments on pages saying \"that's not how it works in the current version of solr\" when the docs have been updated to reflect the soon-to-be-released version.\n\nIt is also not linked from the release-specific documentation page either.\n\nNor should it be? ... if someone is looking at a historical link to something like \"https://lucene.apache.org/solr/4_5_0/index.html\" because that's the version of solr they are running it would be a really bad idea of that linked them to the current live copy of the ref guide that had all sorts of info about features/syntax that don't exist in their version.\n\nfiguring out a good way to link to the ref guide download link for those pages would certainly be a good idea though - specially since those pages are in the solr release itself.  but the problem is the ref guide is frequently not available for a week or so after the official release (due to final editing).  so the best ew can probably do is a generic link to the main documentation page. (https://lucene.apache.org/solr/documentation.html)\n\nThis means the search engines do not easily discover the new content and it does not show up in searches for when people look for information. It also means people may hesitate to look at it, if they have to download the whole PDF first.\n\nboth valid concerns we should try to address... but i'm not sure how best to deal with them in a way that doesn't confuse/misslead users.\n\n "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14134139",
            "date": "2014-09-15T17:12:41+0000",
            "content": "I could argue about this, except you are linking to the WIKI from those same pages already. So, all you are doing, is giving a preferential treatment to WIKI instead. And, if the users do - somehow - manage to find the reference guide from the Google search, the problem you described has not gone away.\n\nSo, I would still say, link to the reference guide wherever you have a wiki link right now and mention the future-looking status in brackets. Link to the PDF for the active version next to it, to make it easier for the people on the old version.\n\nI thought the current state was due to somebody missing the obvious. Now, it looks like a case of premature DE-optimization.  "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-14140706",
            "date": "2014-09-19T15:09:36+0000",
            "content": "I've been heads down on another project and am just catching up with this today...\n\nyou are linking to the WIKI from those same pages already\n\nA couple of points of explanation about that: First, those are frequently a legacy thing from when the ref guide was not part of the Solr/Lucene project.\n\nSecond, the wiki needs to be updated page-by-page to reflect the status of the ref guide as the official documentation for Solr. That's been a year+ -long TODO that we all want but no one has yet had a lot of time for. The thought is that the wiki will become a place where people can add tips & tricks, etc. - stuff that's not \"documentation\" per se, but still really valuable. When that happens, the links to the wiki make a lot more sense - with some changed wording - and why it's not a huge priority to systematically remove them today.\n\nlink to the reference guide wherever you have a wiki link right now and mention the future-looking status in brackets.\n\nI'm not following exactly - could you give me an example of what you mean? "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14140818",
            "date": "2014-09-19T16:22:40+0000",
            "content": "I do not want to confuse two issues: the current status of WIKI vs. the Reference Guide and the fact that people - right now - are not finding the Reference Guide. I do know of the year-long TODO and participated in some of the discussions on the mailing list.\n\nAll I am saying is that Reference Guide is great, yet is not discoverable easily. Which is a shame and disservice to the community after so much work was and is put into that. So, I am proposing an easy solution in the meanwhile, while the WIKI issue is being sorted out.\n\nI think it is important to separate us - people who have worked with Solr for a while - and new Solr users. They will not know or want to know the legacy history. They just want to be pointed to the most up-to-date information. The rest is our internal ongoing work.\n\nAs to the proposed link, it could be just:\n\n<URL>(Solr Reference Guide), Note: the live version of the Guide reflects latest version of Solr. Versions of the guide reflecting released versions of Solr are available as a  <URL>(PDF version).\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14140843",
            "date": "2014-09-19T16:42:19+0000",
            "content": "I could argue about this, except you are linking to the WIKI from those same pages already. So, all you are doing, is giving a preferential treatment to WIKI instead. \n\nyeah .. from the stand point of \"live links\" you're right ... i'm convinced we should link to it ... but not convinced itshould be as front and center as what you proposed.  The primary link for users should be to the released copy.\n\nWhat do you think about adding this paragraph at the end of the existing \"The Apache Solr Reference Guide\" section of documentation.html? ...\n\n\nComments & suggestions for improving this documentation can be made on the \n[live editing version of the documentation](https://cwiki.apache.org/confluence/display/SOLR/) \nwhich is a browsable Confluence Space that always reflects the content intended for the _next_ \nrelease of the Reference Guide.\n\n "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-14141267",
            "date": "2014-09-19T20:48:09+0000",
            "content": "I'd skip the Confluence bit (TMI), but the rest looks fine. Frankly, as the next step I care that we put something in front of both users and Google. If that works - great. If not, we can improve later. \n\nWould be nice though if the Confluence space had Google or other analytics enabled. Could make for a fun little project to figure out what people are actually looking for and whether they are finding it. Currently, there is no feedback loop at all on the usefulness of documentation. We know it is overall, but it's a lousy granularity to be satisfied with. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15540967",
            "date": "2016-10-02T20:51:09+0000",
            "content": "Once we get the new online versioned asciidoc refGuide, we can start linking to a specific online version! "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16394351",
            "date": "2018-03-10T22:41:29+0000",
            "content": "Download page now links to online guide.\n\nBut the release-specific page, e.g. https://lucene.apache.org/solr/7_2_0/index.html still lists the legacy Wiki as the main reference documentation. This should be replaced by a link to the online aersion-speific ref guide, i.e. https://lucene.apache.org/solr/guide/7_2/  "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16394355",
            "date": "2018-03-10T22:56:09+0000",
            "content": "Attaching a patch that replaces old Wiki link with (version specific) RefGuide link. Also refreshed the textual description by copying what we use in the release note and upgraded the language to better match recent events such as JSON replacing HTTP/XML etc.\n\nAlexandre Rafalovitch you may want to push this in time for 7.3? "
        }
    ]
}