{
    "id": "SOLR-9601",
    "title": "DIH: Radicially simplify Tika example to only show relevant configuration",
    "details": {
        "components": [
            "contrib - DataImportHandler",
            "(1)",
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.6",
            "7.0"
        ],
        "affect_versions": "7.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Solr DIH examples are legacy examples to show how DIH work. However, they include full configurations that may obscure teaching points. This is no longer needed as we have 3 full-blown examples in the configsets. \n\nSpecifically for Tika, the field types definitions were at some point simplified to have less support files in the configuration directory. This, however, means that we now have field definitions that have same names as other examples, but different definitions. \n\nImportantly, Tika does not use most (any?) of those modified definitions. They are there just for completeness. Similarly, the solrconfig.xml includes extract handler even though we are demonstrating a different path of using Tika. Somebody grepping through config files may get confused about what configuration aspects contributes to what experience.\n\nI am planning to significantly simplify configuration and schema of Tika example to *only* show DIH Tika extraction path. It will end-up a very short and focused example.",
    "attachments": {
        "tika2_20170316.tgz": "https://issues.apache.org/jira/secure/attachment/12859212/tika2_20170316.tgz",
        "tika2_20170308.tgz": "https://issues.apache.org/jira/secure/attachment/12856934/tika2_20170308.tgz"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-07T05:33:33+0000",
            "author": "David Smiley",
            "content": "+1 and to all the /example configs for that matter – same principle.  Keep the relevant parts that are to be exercised; no kitchen sinks that needs to be maintained. ",
            "id": "comment-15898778"
        },
        {
            "date": "2017-03-09T03:55:48+0000",
            "author": "Alexandre Rafalovitch",
            "content": "It is a little hard to generate a readable DIFF between the original Tika example and one I created. So, for ease of testing, I just created it as a separate tika2 core that can be dropped next to the other DIH cores.\n\nI removed all of the unused gunk, so the remaining files are tiny. I wish I could remove the infoStream section, but the default is false and I am not sure I should.\n\nI've also added a prototype-oriented demo of wildcard, renamed and simplified text field definition and did other minor cleanup in what is left.\n\nI am not sure if I need to worry about docValues here. \n\nAlso, I have commented out uniqueKey section, but the corresponding id field definition is missing. But it was missing in the original example too, so I am not sure it is worth adding in the commented out section. \n\nThis is a big change (even if with tiny results files), so I would appreciate people commenting on it before I actually commit it. ",
            "id": "comment-15902441"
        },
        {
            "date": "2017-03-13T15:56:13+0000",
            "author": "David Smiley",
            "content": "I took a look but I admit I haven't actually used it.  \n\n\tI think you should remove the infoStream part; this is all about being minimalist.\n\tI think you should add a comment to solrconfig.xml like\n<!-- MINIMALIST CONFIG JUST TO SHOW DIH. Real configs aren't so minimal.  -->\n\tI agree not to worry about docValues; keep it simple and focused.\n\tI think you should declare the uniqueKey.\n\n ",
            "id": "comment-15907720"
        },
        {
            "date": "2017-03-13T16:14:46+0000",
            "author": "Alexandre Rafalovitch",
            "content": "The original example did not have a uniqueKey. And I don't think the PDF document provided one, though I could map a field (e.g. fileName) to it. ",
            "id": "comment-15907749"
        },
        {
            "date": "2017-03-13T16:39:12+0000",
            "author": "David Smiley",
            "content": "Ok; unless there would be some problem in declaring a uniqueKey (i.e. some tutorial it would break?) then I think it should now have one regardless.  The fact that Solr supports a schema without a uniqueKey is sometimes useful but it's generally not recommended. ",
            "id": "comment-15907786"
        },
        {
            "date": "2017-03-15T22:39:05+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Turns out to be there is a problem with having - and populating - a uniqueKey. Tika extract does not give us a meaningful key. The nearest one is resourceName but it is not made available when parsing through DIH, as - I suspect - we abstract the filesystem too well.\n\nI could rename title into id and change type to string but that's a bit too far bending over I think. I could I guess map it to id and copyField to title. Would that be reasonable?\n\nOk on removing infoStream, though we have a logging setting that uses it for all examples globally; but I could add a comment in that file I guess.\n\nsolrconfig.xml already has a long comment about the example being minimalistic. ",
            "id": "comment-15927116"
        },
        {
            "date": "2017-03-16T03:35:35+0000",
            "author": "David Smiley",
            "content": "I see. In that case, I suggest adding a comment in schema.xml mentioning why we didn't bother defining a uniqueKey.\n\nThanks for doing this cleanup. ",
            "id": "comment-15927417"
        },
        {
            "date": "2017-03-17T01:08:58+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Another version. I made TikaEntityParser an inner entity of FileListEntityProcessor, so the file name is now exposed as part of outer entity.\n\nThis allowed me to demonstrate rootEntity, another processor type as well as provide uniqueKey.\n\nI also commented out the dynamicField *. If it gets uncommented, a couple extra fields will show from the FileListEntityProcessor, so there is a nice hidden reward for curiosity....\n\nThis should be ready to go with some formatting cleanup (4 spaces offset? whitespace before closing xml tags? anything else?).\n\nAny final comments? ",
            "id": "comment-15929274"
        },
        {
            "date": "2017-04-01T23:07:52+0000",
            "author": "ASF subversion and git services",
            "content": "Commit b02626de5071c543eb6e8deea450266218238c9e in lucene-solr's branch refs/heads/master from Alexandre Rafalovitch\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b02626d ]\n\nSOLR-9601: DIH Tika example is now minimal\nOnly keep definitions and files required to show Tika-extraction in DIH ",
            "id": "comment-15952454"
        },
        {
            "date": "2017-04-01T23:13:39+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 812b0eebf3d50a141b952af27bbf7c225df5072d in lucene-solr's branch refs/heads/branch_6x from Alexandre Rafalovitch\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=812b0ee ]\n\nSOLR-9601: DIH Tika example is now minimal.\nOnly keep definitions and files required to show Tika-extraction in DIH ",
            "id": "comment-15952457"
        },
        {
            "date": "2017-04-02T21:00:09+0000",
            "author": "Varun Thacker",
            "content": "Looks so much better now! Thanks Alexandre!\n ",
            "id": "comment-15952853"
        },
        {
            "date": "2017-05-23T20:54:57+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 2319d69fd3d5b67729f31b5796cc1eb68220b664 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2319d69 ]\n\nRef Guide: update DIH docs for SOLR-7383; SOLR-9601; plus major surgery on page layout ",
            "id": "comment-16021841"
        },
        {
            "date": "2017-05-23T20:55:49+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 2d054965a5c5313a486540c79ef29b0dbf05bc70 in lucene-solr's branch refs/heads/branch_6x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2d05496 ]\n\nRef Guide: update DIH docs for SOLR-7383; SOLR-9601; plus major surgery on page layout ",
            "id": "comment-16021843"
        },
        {
            "date": "2017-05-23T20:56:23+0000",
            "author": "ASF subversion and git services",
            "content": "Commit fd8ac5b959f26c8a979752c9bf61bb8a545b2e3a in lucene-solr's branch refs/heads/branch_6_6 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=fd8ac5b ]\n\nRef Guide: update DIH docs for SOLR-7383; SOLR-9601; plus major surgery on page layout ",
            "id": "comment-16021846"
        }
    ]
}