{
    "id": "SOLR-11723",
    "title": "Solr6.6- Full Import or Delta Import are not responding, showing idle status always for all cores suddenly",
    "details": {
        "labels": "",
        "priority": "Blocker",
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.6",
        "resolution": "Incomplete",
        "status": "Closed"
    },
    "description": "Suddenly not importing data into solr. The full-import or delta-import or reload-config commands not responding and showing idle status after hitting full import or delta import commands from url.  But i am able to run the queryies using query handler. There are already 9 cores are running succesfully. It started this issue, when i created new 10th core. Moreover all cores in my solr instance got same issue. I haven't seen any error in admin console logging section or in solr server logs.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-12-05T16:57:30+0000",
            "content": "Please raise this question on the user's list at solr-user@lucene.apache.org, see: (http://lucene.apache.org/solr/community.html#mailing-lists-irc) there are a lot more people watching that list who may be able to help. \n\nWhen you do you need to include your DIH configs and exactly what you did when you added the 10th core. Plus any relevant information you saw when you looked at your Solr logs, and any steps you've taken to try to understand the problem, for instance backing out your most recent changes to see if they were the culprit.\n\nIf it's determined that this really is a code issue in Solr and not a configuration/usage problem, we can raise a new JIRA or reopen this one.\n\nGiven what you've described so far it's highly likely there's a configuration issue rather than a Solr bug.  ",
            "author": "Erick Erickson",
            "id": "comment-16278855"
        }
    ]
}