{
    "id": "SOLR-3786",
    "title": "upload log without a version causes updates to silently fail.",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "update"
        ],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Same as the following bug that should have been resolved in 4.0 beta.. however i just loaded a fresh copy of 4.0 beta and the bug is still there.\n\nhttps://issues.apache.org/jira/browse/SOLR-3746",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13447998",
            "date": "2012-09-04T19:48:11+0000",
            "content": "SOLR-3746 was not labeld fixed in 4.0-beta, it was fixed in svn after the beta was released, and is marked \"Fix Version: 4.0\" (ie: the 4.0 final release will include the fix) "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13448001",
            "date": "2012-09-04T19:58:56+0000",
            "content": "That bug fix missed 4.0-BETA by 11 days. The fix was committed on 8/21, but 4.0-BETA was made on 8/10. "
        },
        {
            "author": "Dan Foley",
            "id": "comment-13448026",
            "date": "2012-09-04T20:35:55+0000",
            "content": "I think it should at least be in the BETA read me. It's a huge unknown when you install BETA and your previous schema didn't have a version. You have no idea why everything is failing. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13448069",
            "date": "2012-09-04T21:16:39+0000",
            "content": "The need to add the version field to existing 3.x schema.xml should definitely be added to the \"Upgrading from Solr 3.6-dev\" section of Solr's CHANGES.txt. The new schema field appeared when the solrcloud branch was merged into trunk back on January 25th.\n\nAnd the Solr 4.0 wiki should mention it in the errata as well:\nhttps://wiki.apache.org/solr/Solr4.0 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13448145",
            "date": "2012-09-04T22:53:14+0000",
            "content": "1) the README.txt file included in the BETA is static – we can't retroactively change a release\n\n2) Any user who upgrades to the ALPHA or BETA (or final) with their existing 3.x configs will not be affected by this bug, because any pre-4 configs wouldn't have had updateLog in them – so it does not make sense to mention this in \"Upgrading from 3.6\"  (if users try to combine an existing schema.xml with the new example solrconfig.xml, then all bets are off that anything will work – i'm pretty sure that's been a recipe for disaster in every version of solr i can think of, because the examl solrconfig.xml has also refered to the fields in the example schema, and those change with each release.)\n\nany user who upgrades to ALPHA or BETA and uses the new example configs would not be affected by this bug, because they have _version_\\ in them.\n\n3) the wiki is a wiki, if you'd like to add  an errata for the 4.0-ALPHA/BETA releases and put this in it you are welcome to do so – but frankly i don't think it makes sense to even have errata sections for those releases since they are ALPHA/BETA.  4.0-final is a diff story. "
        }
    ]
}