{
    "id": "SOLR-7848",
    "title": "Strictly enforce charFilter/tokenizer/filter order in fieldType definitions",
    "details": {
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Currently you can define a fieldType with the components specified backwards:\n\n\n    <fieldType name=\"icu_test\" class=\"solr.TextField\">\n      <analyzer> \n        <filter class=\"solr.LowercaseFilterFactory\"/>\n        <tokenizer class=\"solr.ICUTokenizerFactory\"/>\n        <charFilter class=\"solr.HTMLStripCharFilterFactory\"/>\n      </analyzer>\n    </fieldType>\n\n\n\nThis will work (just tested in 5.2.1), but it will work in exactly the opposite order that it is defined.\n\nThe moinmoin wiki page for Analyzers, Tokenizers, and TokenFilters, in the section for HTMLStripCharFilterFactory, states that charFilter definitions must come before the tokenizer.  This bit of documentation is wrong.\n\nThe easiest fix would be to correct the wiki page, but if the order in the config can be detected, we could emit a warning in 5.x when the order is wrong and fail to start the core in 6.0.\n\nWhen I was first building my schema, back in the 1.4 days, I was thoroughly confused and caught off guard when I tried to use PatternReplaceCharFilterFactory.  I found that it was being executed before tokenization, even though I had defined it AFTER.  I did eventually figure out my mistake and switched to PatternReplaceFilterFactory.  If the incorrect order had been enforced, or caused a warning in the log, I would have figured it out a lot sooner.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-29T14:27:15+0000",
            "author": "Steve Rowe",
            "content": "+1, accepting out of order field type definitions is a misfeature.  ",
            "id": "comment-14646116"
        }
    ]
}