{
    "id": "SOLR-2399",
    "title": "Solr Admin Interface, reworked",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The idea was to create a new, fresh (and hopefully clean) Solr Admin Interface. [Based on this ML-Thread]\n\nFeatures:\n\n\tDashboard\n\tQuery-Form\n\tPlugins\n\tAnalysis (SOLR-2476, SOLR-2400)\n\tSchema-Browser\n\tDataimport (SOLR-2482)\n\tCore-Admin\n\tReplication\n\tZookeeper\n\tLogging (SOLR-2459)\n\t\n\t\tStub (using static data)\n\t\n\t\n\n\n\nNewly created Wiki-Page: http://wiki.apache.org/solr/ReworkedSolrAdminGUI\n\nI've quickly created a Github-Repository (Just for me, to keep track of the changes)\n» https://github.com/steffkes/solr-admin",
    "attachments": {
        "SOLR-2399-110606.patch": "https://issues.apache.org/jira/secure/attachment/12481617/SOLR-2399-110606.patch",
        "SOLR-2399-fluid-width.patch": "https://issues.apache.org/jira/secure/attachment/12481513/SOLR-2399-fluid-width.patch",
        "SOLR-2399-110603-2.patch": "https://issues.apache.org/jira/secure/attachment/12481398/SOLR-2399-110603-2.patch",
        "SOLR-2399-110622.patch": "https://issues.apache.org/jira/secure/attachment/12483410/SOLR-2399-110622.patch",
        "SOLR-2399-110721.patch": "https://issues.apache.org/jira/secure/attachment/12487287/SOLR-2399-110721.patch",
        "SOLR-2399-110702.patch": "https://issues.apache.org/jira/secure/attachment/12484960/SOLR-2399-110702.patch",
        "SOLR-2399.patch": "https://issues.apache.org/jira/secure/attachment/12478097/SOLR-2399.patch",
        "SOLR-2399-110603.patch": "https://issues.apache.org/jira/secure/attachment/12481379/SOLR-2399-110603.patch",
        "SOLR-2399-wip-notice.patch": "https://issues.apache.org/jira/secure/attachment/12480565/SOLR-2399-wip-notice.patch",
        "SOLR-2399-sorting-fields.patch": "https://issues.apache.org/jira/secure/attachment/12481600/SOLR-2399-sorting-fields.patch",
        "SOLR-2399-analysis-stopwords.patch": "https://issues.apache.org/jira/secure/attachment/12481599/SOLR-2399-analysis-stopwords.patch",
        "SOLR-2399-admin-interface.patch": "https://issues.apache.org/jira/secure/attachment/12480547/SOLR-2399-admin-interface.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-13002159",
            "date": "2011-03-03T19:31:42+0000",
            "content": "Any thoughts on implementing with velocity templates?\n\nI don't want to slow this down since any effort is great!  but long term, it would be great to drop JSP completly "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13002182",
            "date": "2011-03-03T20:16:12+0000",
            "content": "Ryan, actually not - but that is only based on the fact, that i've never worked with them. \n\n// -Edit\n\nAfter having a first look, i'm not really sure what/how that should help? the index.jsp is needed to gather Information about Cores [using org.apache.solr.core.CoreContainer] .. and i (just) don't see, if (and if so, how) it is possible to pass that information to the Velocity-Thingy.\n\nIf that could be done .. no point about dropping that index.jsp out of order  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13002310",
            "date": "2011-03-03T23:15:22+0000",
            "content": "the index.jsp is needed to gather Information about Cores [using org.apache.solr.core.CoreContainer]\n\nThis is where the core admin handler should be useful – you can use it to get a list of cores and their statuses.  In the example solr.xml (and by default if no solr.xml exists) it's available at \"/admin/cores\" but that can be changed – for now your JSP should be able to ask the CoreContainer for it using getAdminPath()  \n\n(If it would be useful, we could also add a simple bit of info to the SystemInfoRequestHandler ((/corename/admin/system) output to let the UI (and external clients) know what path (if any) they can use to access the CoreAdminHandler if all they have is the URL for a single core.)\n\nI don't want to slow this down since any effort is great! but long term, it would be great to drop JSP completly\n\ni agree it would be nice to show off using the velocity writer to style handler responses in the admin ui, but i think that the general approach of using a jsp (or servlet) as the master controller for creating a base HTML page that then uses javascript to query all of the individual handler APIs makes a lot of sense – if for no other reason then that i don't think the velocity writer could really be used on the output of the CoreAdminHandler (can it? .. what context would it load the templates form?)\n\nUltimately the problem we're always going to run into is that people can customize the paths of things in their configs - not just CoreAdminHandler but even all of hte various core specific admin handlers.  \n\nI don't think that's something we really have to be worried about right now (the existing admin UI certainly doesn't) but using a simple servlet/index.jsp gives us the ability to at least start with a direct java call to answer the question: \"what is the url of the coreadmin handler?\" and then from there everything can be dynamicly driven.\n\nIf the logic in the JSP is simple enough, and the real work is done in the javascript, then porting that JSP to velocity should ultimately be pretty straight forward (if there is a strong desire)\n\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13002381",
            "date": "2011-03-04T01:13:43+0000",
            "content": "If the logic in the JSP is simple enough, and the real work is done in the javascript, then porting that JSP to velocity should ultimately be pretty straight forward (if there is a strong desire)\n\nYes, if anyone is willing to give the admin pages some much needed design love, I really don't want anythign to slow that down.  In the future, if there is interest, it would be great to do this w/o JSP, the details of how will take some work. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13002560",
            "date": "2011-03-04T12:16:32+0000",
            "content": "the index.jsp is needed to gather Information about Cores [using org.apache.solr.core.CoreContainer]\n\nThis is where the core admin handler should be useful – you can use it to get a list of cores and their statuses. In the example solr.xml (and by default if no solr.xml exists) it's available at \"/admin/cores\" but that can be changed – for now your JSP should be able to ask the CoreContainer for it using getAdminPath()\n\nYes, will integrate this at the weekend - thanks for the pointer Hoss!\n\nHaving another look at the admin/index.jsp, request.getContextPath() (to get the base-path) should be replaceable w/ variables from the javascript (window or document) environment.\n\nAfter refactoring that, we'll only need the index.jsp for accessing the admin-cores path  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13004127",
            "date": "2011-03-08T18:37:54+0000",
            "content": "Short Update, mainly Things that Jan mentioned on the Mailinglist:\n\nMove the links on top to bottom, reserving the top for navigation.\ndone\n\nThe \"send email\" could be changed to \"Community forum\" and instead of linking to solr-user@lucene.apache.org, link to http://wiki.apache.org/solr/UsingMailingLists\ndone\n\nAdd a link to IRC chat. http://webchat.freenode.net/?channels=#solr That would surely increase the activity on the channel \ndone\n\nInclude a Dev/Test/Prod indication:\nIt is common to have three different environments, one for test, one for development and one live production. It happens now and then that you do the wrong action on the wrong server  so a visual clue as to which environemnt you're in is very useful.\nI propose a simple solid bar on the very top which is RED for prod, YELLOW for test and GREEN for dev. Would it be possible to read a Java system property -Dsolr.environment=dev and based on that set the color of such a top-bar?\nalso done - and yes, reading commandline-args is possible =) currently, the interface will check solr.environment and display it's value at the upper right corner. additionally, if the value starts with dev|test|prod the box gets some color-highlight\n\nFew Minutes ago, pushed the last Update to my GitHub-Repo which includes a (very) basic Tree-View for Zookeeper-Data. and also yes .. that (re-)introduced zookeeper.jsp, which is use for generating json-structured zk-tree-data - based on the existing one, just rearranged a few things "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13004221",
            "date": "2011-03-08T21:22:27+0000",
            "content": "Cool! I tested. Got a box for environment, but no color.\n\nI copied your code into admin/ in my solr.war - but it seems that your intention is for it to live in /solr-admin for the moment, is that right?\n\nI see that you store the state in the URL, but when reloading page, the left menu is not expanded. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13004440",
            "date": "2011-03-09T09:41:02+0000",
            "content": "Cool! I tested. Got a box for environment, but no color.\nFine :> Related to the missing color, what was your solr.environment param? perhaps the used regexp is buggy\n\nI copied your code into admin/ in my solr.war - but it seems that your intention is for it to live in /solr-admin for the moment, is that right?\nNot really intention, it's just to have also access to the existing /admin pages, while developing the new interface  finally all paths (where possible) should be relative, so that it doesn't matter if it's admin, solr-admin or something else\n\nI see that you store the state in the URL, but when reloading page, the left menu is not expanded.\nYes, that's actually buggy .. don't know exactly why - but will fix that, ofc "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13004531",
            "date": "2011-03-09T13:13:36+0000",
            "content": "Tried with -Dsolr.environment=dev and also test and prod. The box shows up, but no color. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13004828",
            "date": "2011-03-09T22:11:21+0000",
            "content": "Thanks Jan for testing - after modifying the regex which was used to detect the environment, it's now working correctly [github commit] "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13005000",
            "date": "2011-03-10T09:08:29+0000",
            "content": "RED for prod, YELLOW for test and GREEN for dev.\nAbout 5% of men are dichromats: they have red/green color-blindness.Thus, production and dev will look the same (:\nI would reserve red for actual problem indicators.Maybe locked and unlocked icons? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13005301",
            "date": "2011-03-10T20:08:20+0000",
            "content": "Lance, thanks for that notice & yes, perhaps we'll need some icon for that. actually there is  which should be interpreted as \"box/stage/server\" ;o\nBut, if anyone has suggestions, maybe from the fugue icon-set, i'm happy to change them to something more useful! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13005306",
            "date": "2011-03-10T20:11:16+0000",
            "content": "Jan,\n\nI see that you store the state in the URL, but when reloading page, the left menu is not expanded.\nYes, that's actually buggy .. don't know exactly why - but will fix that, ofc\n\nit's fixed now – refactored the way of loading core-/system-data, should load now a little bit quicker and need less http-requests for gathering needed informations "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13005335",
            "date": "2011-03-10T21:11:14+0000",
            "content": "Again from Jan's List\n\nShould there also be a tab above all cores, with host-wide stuff?\n\n\tSolr version\n\tHost name, port\n\tSolr HOME path\n\tZookeeper info and link\n\n\n\ncomitted today - not completly happy with the layout of the dashboard, but hopefully okay for now :] \nCoreAdmin is actually missing, yet not really an good idea how (and where) to integrate that, will see. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13005398",
            "date": "2011-03-10T23:34:21+0000",
            "content": "@Lance: IMHO we design for 95% of the users, not 5%. Keep it simple - RED-YELLOW-GREEN with the addition of a symbol for those 5%. They can even hack the CSS if they like a special color for production. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13006051",
            "date": "2011-03-12T15:02:46+0000",
            "content": "Additional point from Jan's list:\n\nImprove the admin-extra.html concept:\nToday, if the file admin-extra.html exists it will be included near top of current admin GUI. This can be useful, but in this new design, it perhaps makes more sense to include the admin-extra.html contents in a widget box on each core. Then each organization can customize and put links to their internal issue trackers etc..\n\nI've integrated an additional box on the dashboard (will check for an admin-extra.html file) and the possibility to include additional menu-items (will check for an admin-extra.menu-top.html and admin-extra.menu-bottom.html file).\n\nit's both related to a specific core - is there a need for an additional navigation/box for host-wide stuff? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13006093",
            "date": "2011-03-12T21:37:38+0000",
            "content": "Another item from Jan's list\n\nIn the \"System\" tab for each core, it would be great to show a number of key info:\n\n\t# docs\n\tSize of index (Mb)\n\tLast add/delete timestamp\n\tOptimized status (with a button to optimize now)\n\n\n\nit's integrated on the dashboard.\n\nWhat actually is not possible, is to display the index-size - that's actually only avaible from ReplicationHandler, right? :/\n\none question on Luke's Data: \"hasDeletions\" says that the Index could/should be optimized, so makes sense to integrate an button there with \"commit now\"? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13006096",
            "date": "2011-03-12T21:47:57+0000",
            "content": "Last item for today\n\nOn the \"Query\" tab for each core:\n\n\tAdd an input box for \"query type\", setting the \"qt\" param\n\tAdding a some links below the input boxes, expanding by JavaScript:\n\t\n\t\tdismax params\n\t\tspatial params\n\t\tspellcheck params\n\t\tfaceting params\n\t\n\t\n\n\n\nintegrated too - when there is a field missing, please let me know, not sure especially on the spatial-options. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13007691",
            "date": "2011-03-16T21:06:33+0000",
            "content": "A bigger step compared with those one we had yet, we are talking about the Schema-Browser :>\n\n\n\tThe current one (screenshot) needs much space (especially for the navigation)\n\tThe new one (screenshot) tries to put the focus more on details & information\n\tThe new Field/Dynamic Field/Type-Selection (screenshot) is diplayed in a simple Dropdown, which offers Keyboard-Navigation for Quick-Access\n\tThe list of \"relations\" (screenshot) depends  on the selected F/DF/T\n\n\n\nJust to say:\n\n\tCopyField's are also displayed in the area below the Selection, if defined.\n\tEvery F/DF/T is clickable, linked with his Detail-Page\n\n\n\n(Explicit) Questions for the Community:\n\n\tTopTerms are actually limited to 50, is that enough? Or is there a need to browse all TopTerms?\n\tAnalyzers-Detail, hide it for default - with a Toggle-Button (like it is actually)?\n\tAnalyzers-Detail, Presentation okay - or needs to much space?\n\tF/DF/T-Selection, actually there is no possibilty to filter (like f.e. in iTunes; additional field, start typing and the list is restricted) - would that help for those of us, that have a lot of fields?\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13007816",
            "date": "2011-03-17T05:10:49+0000",
            "content": "screenshots look good!\n\nTopTerms are actually limited to 50, is that enough? Or is there a need to browse all TopTerms?\n\nI think this is mostly a UI/speed issue – displaying more then 50 terms is good if the UI works well.\n\nAnalyzers-Detail, hide it for default - with a Toggle-Button (like it is actually)?\n\nI like the looks of your screenshot – looks awesome.  Have not tried the patch, but things I would wish for:\n\n\teasy link from field/fieldtype to analysis.jsp, maybe expandable input form?\n\tclick on 'stopwords.txt' to view it\n\n\n\n\nAnalyzers-Detail, Presentation okay - or needs to much space?\n\nI like it.\n\n\n\nF/DF/T-Selection, actually there is no possibilty to filter\n\ntyping to restrict would be great.  if possible, good to clearly display how many are hidden, and easily click to remove them (with itunes i often forget that something is in the search box, but i am kinda slow sometimes)\n\n\nlooking good!\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13007824",
            "date": "2011-03-17T05:43:44+0000",
            "content": "Hey Stefan,\n\nI had seen this issue in passing, but had not yet taken a closer look...\n\nFantastic stuff! I think this is a sorely needed face lift, and your screen shots look like a brilliant upgrade. Really nice to see some effort put into this area of Solr. "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13007832",
            "date": "2011-03-17T06:05:03+0000",
            "content": "Here are things I need / or bothering me:\n\n1. Core management - reload and swapping is critical\n2. Replication - Ability to click a button for backup\n3. Change analysis.jsp to allow someone to select pipeline components to try in real time on the data\n4. Ability to password protect the whole GUI without limiting access to update handlers\n5. Ability to edit stopwords.txt, protwords.txt and synonyms and reload.\n6. Ability to click to see the solr.log from Admin\n7. Ability to click to commit, and click to optimize an index\n8. Ability to edit the dataimport.xml file and save it\n9. Fix the dataimport.jsp to fix the scrolling when looking at the xml file - it does not work right. If you made the window bigger the right side is static.\n10. Make DIH (if enabled) an option on the Admin screen (clickable)\n11. I am not a huge fan of editing the schema or solrconfig files, but I would like it easy to navigate the file properties (it is hard to view)\n12. Button to restart/recycle SOLR from the GUI\n13. Show list of slaves on the replication screen and when they last requested the files "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13010318",
            "date": "2011-03-23T19:50:18+0000",
            "content": "Ryan: ty, will take your points on my list - pretty sure, that it should be possible to integrate them\nMark: ty! \n\nFor today, it's about Logging. Talked about that with Hoss on #solr the last days, so already changed a few things .. on the way, but not finished: http://files.mathe.is/solr-admin/07_logging.png\n\nActually thinking about the following points:\n\n\tTree Structure good way to solve it?\n\tDo we need the possibitly to collapse/expand the three/the childrens? The List could be longer (the screenshot is cropped, just for layout reasons) especially while using SolrCloud which adds about 30 Loggers\n\tIn the current er .. \"Interface\" you are able to see that the row you're looking at has a level set and in the end (at the right) which is the effective level - for me, that does not matter. if a row/logger, has level-x - that's enough to know. don't need to see if this level is set or inherited.\n\tjust a quick idea: if you change f.e. org.apache.solr then the interface will automatically update all childrens in realtime, affects all nested/sub loggers w/o a assigned level.\n\n\n\nThoughts on these points? anyone? :>\n\nShort Note: i moved Logging to a global level, because it's not configurable on a per-core basis.\n\n\n\tEdit\n\n\n\nWhat i forgot to mention .. actually it's based on a static logging.json-file but will try to change the LogLevelSection Servlet so that it outputs the needed json-structure "
        },
        {
            "author": "Upayavira",
            "id": "comment-13010659",
            "date": "2011-03-24T13:20:51+0000",
            "content": "Your code assumes multicore. If you run it on a single core host, it attempts to load the core admin handler from /solrnull?wt=json, which clearly doesn't make sense!\n\nYou can identify whether you are multicore or not, by testing app.config.core_admin_path == \"null\". I've managed to get it working, but had to 'fake' an HTTP request to the CoreAdmin (there's no equivalent in single-core solr that I know of). I'll keep hacking and see if I can offer a patch that is a bit more elegant.\n\nUpayavira "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13010674",
            "date": "2011-03-24T13:47:28+0000",
            "content": "Upayavira, thanks for pointing that out! the plan was to check automatically if you're running an single- or multicore installation, seemed that is was broken somewhere along the road :/\n\nFor your possible patch: CoreAdmin is available even for SingleCore Mode, at least in 3.x - i thought i checked this also for 1.4; but will have a look again on that\n\n\n\tEdit: Just checked my Code .. would be interesting to know, what your Solr-Installation returns here: https://github.com/steffkes/solr-admin/blob/master/index.jsp#L22 ?\n\n\n\nStefan "
        },
        {
            "author": "Upayavira",
            "id": "comment-13010764",
            "date": "2011-03-24T16:53:55+0000",
            "content": "It returns null. Which, the JSP treats as a string, so core_admin_path becomes \"null\". So, you can easily detect single-core that way. \n\nYou need quite different code paths for the two scenarios, as for single core you don't need to do an HTTP request to the core_admin. I'm half-way through an improved version (without a fake HTTP request). I'll see if I can work out how to use github to share it.\n\nUpayavira\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13010831",
            "date": "2011-03-24T18:41:32+0000",
            "content": "Upayavira, take whatever way you like for the patch - github fork/pull-request, comment here or just send me an email \n\nrelated to the Fact, that solr running in singlecore mode shold have no CoreAdmin .. i just checked out Revision 1085057 from branch_3x and trunk – the returned both \"/admin/cores\" for cores.getAdminPath() while started with a simple java -jar start.jar. Which Version/Configuration is doing something different?\n\nStefan "
        },
        {
            "author": "Upayavira",
            "id": "comment-13010836",
            "date": "2011-03-24T18:46:28+0000",
            "content": "Now that there are 3.1 releases around, I'll try it with 3.1 and see what I get, as that is where this code will end up.\n\nUpayavira "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13010861",
            "date": "2011-03-24T19:24:28+0000",
            "content": "It will work like expected for everything >= 3.x - Just checked out the 1.3 und 1.4 branches and verified that getAdminPath returns 'null' there ;o\n\nSo, will wait for your patch – and in the meantime, i'll check how the new admin ui will work with the old releases\n\nStefan "
        },
        {
            "author": "Upayavira",
            "id": "comment-13010886",
            "date": "2011-03-24T20:08:40+0000",
            "content": "There's no need to test it with old releases. If this code is destined to be a part of Solr, it'd be released with the latest code, so that is the code it needs to work with.\n\nUpayavira "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13010909",
            "date": "2011-03-24T20:44:57+0000",
            "content": "But if we could support the older versions w/o problems, why not? if you don't want to continue w/ the patch - it's ofc okay, but i'll continue checking the new ui for 1.3/1.4 versions and bring the features back to work \n\nStefan "
        },
        {
            "author": "Upayavira",
            "id": "comment-13011205",
            "date": "2011-03-25T14:01:43+0000",
            "content": "To give folks an incentive to upgrade? \n\nI've found another issue. The 3.x branch does not have jvm/memory/raw in response to /solr/admin/system?wt=json. I've made a (crude but working) patch, which I've put here:\n\nhttps://github.com/upayavira/solr-admin/commit/6abc78fe6f15d79bd8d566282d4ee8e5af4cb27d\n\nLet me know if you can work with this ( me=git newbie )\n\nUpayavira "
        },
        {
            "author": "Upayavira",
            "id": "comment-13011208",
            "date": "2011-03-25T14:05:44+0000",
            "content": "Hah, I see you've fixed this already. But I deal with KB and GB too  "
        },
        {
            "author": "Upayavira",
            "id": "comment-13012502",
            "date": "2011-03-29T14:24:58+0000",
            "content": "It seems to me that the first task here is to reach a feature-for-feature replacement for the existing UI. I'd like to help if I can. I've gone through the two UIs, and here's the stuff I note as missing/incomplete:\n\n\n\t\"current time\" is not shown\n\tcwd not working\n\tping adds the ping duration to the link. Add \"ms\" to make it clearer what this is\n\tthere's no \"debug explain others\" option on the advanced query page\n\tit would be good to add mouseover tooltips to fields, eg. fq, wt, etc\n\toutput type (wt) is missing from query page\n\tthread dump is missing: http://localhost:8983/solr/admin/threaddump.jsp\n\tJava properties are JVM specific, not core specific, so should be on the dashboard\n\tDistribution page is missing: http://localhost:8983/solr/admin/distributiondump.jsp\n\n\n\nUpayavira "
        },
        {
            "author": "Upayavira",
            "id": "comment-13012806",
            "date": "2011-03-30T01:26:31+0000",
            "content": "I've updated my github repo with an implementation of thread dumps. Could look nicer, but it works well. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13012926",
            "date": "2011-03-30T12:19:04+0000",
            "content": "Sorry, hit the assign button by mistake.... "
        },
        {
            "author": "Upayavira",
            "id": "comment-13013971",
            "date": "2011-03-31T13:31:07+0000",
            "content": "https://github.com/upayavira/solr-admin/commit/a96d7b8bc63cb5ae6125c0a2c91302f553782ef2\n\n\n\tadded current time (note, it is the time the overall page was loaded, not \"now\").\n\tfixed cwd. I've added 'ms' to ping and made it stand out more.\n\tfixed threaddump to make it work multicore\n\tmoved java properties to global level\n\tremoved replication link - info is already on dashboard\n\n\n\nIMO this is now ready for testing - folks, please try it on your browsers (I've seen it work on Firefox/Chrome on Linux and Firefox on Mac). Anyone able to try it on IE? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13016500",
            "date": "2011-04-06T20:02:19+0000",
            "content": "So, long time silence .. \n\nI've updated my github repo with a few things .. fixes and also a new threaddump-list, which was originally created by Upayavira, thanks!\n\nAlso started a new Wiki-Page http://wiki.apache.org/solr/ReworkedSolrAdminGUI - i'm not really good at marketing, so the Page is really basic and everybody is invited to update it.\n\nAs Upayavira stated last Tuesday there are still a few Things missing, compared to the current Admin-UI .. but i'd like to now: Which are the Features that you will need to give the reworked UI a try? One of the listed features? Or, will it be easier, if the Code would work from /solr/admin?\n\nPlease let me know – Feedback is really appreciated  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13021273",
            "date": "2011-04-18T21:24:29+0000",
            "content": "OK, I've finally figured out Git enough (another newbie with Git). First of all, I'm really glad you're taking this on, it'll be a vast improvement. If you only knew how poor my page design ability is, you'd understand why I'm so glad someone else is doing this...\n\nOne thing I noticed on a cursory look. The analysis page with the red/yellow is really jarring to people \"of a certain age\" like me. Can you tone the background colors waaaay down to a soft pastel? I'm talking the palest yellow and red (or blue?) you can still see.\n\nAnd when I type long strings to be analyzed, the display for each part (index/query) runs all over. I don't know what the right fix is, possibly a slider for each side (if it's not too hard)?\n\nLove the drop-down on that page!\n\nOn the \"schema browser\" page, selecting a type from the drop-down shows nothing.\n\nI'm not quite sure what request caused the following to pop out in my log, but here's the partial stack trace:\n\n\nApr 18, 2011 5:17:32 PM org.apache.solr.core.SolrCore execute\nINFO: [] webapp=/solr path=/admin/file/ params=\n{file=admin-extra.menu-bottom.html}\n status=400 QTime=4\nApr 18, 2011 5:17:32 PM org.apache.solr.common.SolrException log\nSEVERE: org.apache.solr.common.SolrException: Can not find: admin-extra.menu-top.html [C:\\apache-trunk\\solr\\example\\solr\n\\.\\conf\\admin-extra.menu-top.html]\n        at org.apache.solr.handler.admin.ShowFileRequestHandler.handleRequestBody(ShowFileRequestHandler.java:152)\n        at org.apache.solr.handler.RequestHandlerBase.handleRequest(RequestHandlerBase.java:129)\n        at org.apache.solr.core.SolrCore.execute(SolrCore.java:1290)\n        at org.apache.solr.servlet.SolrDispatchFilter.execute(SolrDispatchFilter.java:353)\n        at org.apache.solr.servlet.SolrDispatchFilter.doFilter(SolrDispatchFilter.java:248)\n        at org.mortbay.jetty.servlet.ServletHandler$CachedChain.doFilter(ServletHandler.java:1212)\n\nI may get some more time to look later this evening. Is there anything useful I can do?\n\nBest\nErick "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13021444",
            "date": "2011-04-19T07:27:06+0000",
            "content": "Erick,\n\nI may get some more time to look later this evening. Is there anything useful I can do?\nThat was already helpful – thank you  I'd just say: continue using it .. and just let us know, where you found something that could/should be changed, from your perspective.\n\nOK, I've finally figured out Git enough (another newbie with Git)\nAh, never thought about that .. would it be easier to use an svn-repository instead of git? may that be a (or at least, the) reason, that only a few people will have a look at it?\n\nOne thing I noticed on a cursory look. The analysis page with the red/yellow is really jarring to people \"of a certain age\" like me. Can you tone the background colors waaaay down to a soft pastel? I'm talking the palest yellow and red (or blue?) you can still see.\noh, i think you found the poorest page we actually have ;o of course that would be fixed from a layout-view, and there are still features missing. i'm still not sure, if a two-column layout would work for most cases - because like you actually realized, with longer strings .. there is not enough space :/ Vertical Scrolling is not useful in this scenario. perhaps we should try to rearrange the analysis-output a little bit\n\nOn the \"schema browser\" page, selecting a type from the drop-down shows nothing.\nyes, the schema browser currently works only for fields, and neihter dynamic-fields nor types - will add this over the weekend :> but just to be sure, your address-bar changed after selecting a new option from the drop-down, right?\n\nI'm not quite sure what request caused the following to pop out in my log, but here's the partial stack trace:\n\nApr 18, 2011 5:17:32 PM org.apache.solr.core.SolrCore execute\nINFO: [] webapp=/solr path=/admin/file/ params={file=admin-extra.menu-bottom.html} status=400 QTime=4\n\nThat's a new \"feature\" :] where you could easily extend the menu on the left side of the ui, like i mentioned in this comment (12/Mrz/11 15:02)\n\nAnd, just to say it again: using it, will give us input what is important for yo. so continue there, and let uns know what you think. no difference if it's a non-working thing or a almost-working thing that should be changed or just a new idea that you have while working with it! \n\nStefan "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13021550",
            "date": "2011-04-19T12:18:21+0000",
            "content": "Schema browser page: Yep, after selecting the \"geohash\" type the URL changed to: http://localhost:8983/solr/admin/#/singlecore/schema-browser/type/geohash\n\nAnalysis page: I was thinking of two horizontal scrollbars, one for each pane, not vertical ones. But I have no idea how hard that would be, if it's more than 15 minutes I'd probably defer it. I suspect 95% of the usefulness of that page can be had with two or three words anyway.... Or maybe just a single slider that moved both panes? Because the two-column layout actually nicely brings attention to the fact that index and query time analysis are not necessarily the same, a point that often escapes folks just starting.\n\nAbout Git. It's perfectly reasonable to attach patches to this JIRA that are \"working copies\" and not intended to be committed. I'm not sure how a Git patch plays with SVN. If you want I'll be happy to try out any GIT-generated patch files on my system, we can do that offline. \n\nWhat IDE are you using? I usually just cheat and have Idea create patches for me, it \"just works\" and I haven't had to fiddle with it. I think that IntelliJ reasonably happily works with both VCSs, but can't say that's true from experience. I'm pretty sure Eclipse has the same capabilities...\n\nErick "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13021563",
            "date": "2011-04-19T12:47:15+0000",
            "content": "Git and svn patches do not go well together. There are hairy scripts to work around that somehow, but I think for this issue, the easiest way to create a patch is the manual way:\n\nsvn co <path-to-lucene-trunk> lucene-trunk\ncd lucene-trunk\nunzip <new-admin-stuff-from-git>\nsvn patch > SOLR-2399.patch\n\n "
        },
        {
            "author": "Upayavira",
            "id": "comment-13022143",
            "date": "2011-04-20T14:08:52+0000",
            "content": "Patching/etc really aren't much of an issue with this ticket. It is mostly a completely new tree of files. It may be a question of merging two directory trees (the new code relying on the output of one or two old jsp files) but there's not a great deal more than that to it.\n\nGit in this scenario is simply a useful tool for collaboration before the code gets anywhere near SVN.\n\nUpayavira  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13024612",
            "date": "2011-04-24T10:56:49+0000",
            "content": "So, it's weekend .. time to work on the analysis page – what else ;o\n\nAnalysis page: I was thinking of two horizontal scrollbars, one for each pane, not vertical ones. But I have no idea how hard that would be, if it's more than 15 minutes I'd probably defer it. I suspect 95% of the usefulness of that page can be had with two or three words anyway.... Or maybe just a single slider that moved both panes? Because the two-column layout actually nicely brings attention to the fact that index and query time analysis are not necessarily the same, a point that often escapes folks just starting.\n\ni've tried a few things, i think it's okay, no?\nnormal: current vs. new, verbose: current vs. new\n\njust to note: \"verbose output\" requires no page-reload, all needed information is already fetched in this state. if longer strings are used, the two columns will move among themselves. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13024646",
            "date": "2011-04-24T16:08:43+0000",
            "content": "Stefan... this is looking great!\n\nA couple things to note:\n\n\tseeing the parameters to each Tokenizer/Filer is pretty important.  The \n{splitOnCaseChange=1,... }\n\tMaybe tooltips for P -> Position Offset, T -> Type, T -> Term etc?\n\tWith tooltips, it would be pretty nice to show full information when you hover over an element the normal view.\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13024648",
            "date": "2011-04-24T16:22:01+0000",
            "content": "Thanks Ryan,\n\nseeing the parameters to each Tokenizer/Filer is pretty important. The {splitOnCaseChange=1,... }\nFieldAnalysisRequestHandler seems to be a little bit shy – it's not included in it's ouput, will fill another ticket for this.\n\nMaybe tooltips for P -> Position Offset, T -> Type, T -> Term etc?\nnormally, they shoud be there? i've used a the html-element <abbr> with title-Attribute, which should work in every current Browser - even IE6 ;D Which one did you use? or just from looking at the screenshots? then yes, there is nothing like this shown :>\n\nWith tooltips, it would be pretty nice to show full information when you hover over an element the normal view.\nhm yes .. played around w/ that .. the main 'problem' is, that the full text (f.e. \"Position\") is really long and takes much space. but will see, if i could cut off the description a little bit, so that there is more that one character .. something like Pos for Position, Text, Type & Range for Start, End perhaps?  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13024654",
            "date": "2011-04-24T16:36:17+0000",
            "content": "will fill another ticket for this.\n\nAhh yes – i think there may already be one\n\n\nor just from looking at the screenshots?\n\njust looking at screenshots!\n\n\nis really long and takes much space\n\nI was thinking a tooltip that loads a div and takes the space to make a full display... not the built in hover text stuff.   Just a wish\n\n\nanyway, looking great.\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13024665",
            "date": "2011-04-24T18:47:37+0000",
            "content": "In general, the screenshots look fine, but:\n\nPlease list all attributes (even if you think that they are unimportant). For debugging/understanding TokenStreams this is veeeeery important. E.g. new Japanese TokenStreams have most information of the analysis steps in the attributes not the token text alone: Since Lucene 2.9, lots of analyzers add many more attributes to tokens that are required to display if you want to understand what the streams are doing (please look at the current analysis.jsp output). So please also display the full class name of all attributes at least as hover and also the raw tokens, if the RequestHandler returns them.\n\nThe current output is now useless for advanced debugging. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13024666",
            "date": "2011-04-24T18:51:01+0000",
            "content": "To understand what I mean, look at the screenshot here:\nhttps://code.google.com/p/lucene-gosen/\n\nAll this information is returned by FieldAnalysisRequestHandler. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13024672",
            "date": "2011-04-24T20:35:34+0000",
            "content": "The current output is now useless for advanced debugging.\nGood to know .. so, i'll drop the current state, because it's not that flexible as needed - ty Uwe.\n\nTo understand what I mean, look at the screenshot here: https://code.google.com/p/lucene-gosen/\nI'll have a detailed look (already found some japanse strings in the tests ..), and see how we could integrate this. it's a huge bunch of information, really much more then i've ever seen on any analysis-page ;o "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13024778",
            "date": "2011-04-25T12:08:44+0000",
            "content": "Stefan:\n\nIs this up on your Git repo? Git really isn't that hard, I'll be glad to bring it down and see it in real life.....\n\nErick "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13024782",
            "date": "2011-04-25T12:30:26+0000",
            "content": "erick, check: https://github.com/steffkes/solr-admin "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13024895",
            "date": "2011-04-25T18:18:22+0000",
            "content": ". Is this up on your Git repo? Git really isn't that hard, I'll be glad to bring it down and see it in real life.....\nYes Erick  Normally i'm working on things .. commit & push them to my github repo and post a comment here afterwards. So you should find everything i'm talking about there "
        },
        {
            "author": "Upayavira",
            "id": "comment-13026256",
            "date": "2011-04-28T11:16:07+0000",
            "content": "I've just seen the admin console fail on IE9, with and without compatability mode. Basically, the menu box showed up, but nothing on the right hand box, and no \"loading\" message, when running on Solr 3.1. The same system worked nicely on Firefox Windows, Firefox Mac, etc. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13027306",
            "date": "2011-04-30T09:17:56+0000",
            "content": "So, made a bit progress on another Topic – the Dataimport Screen.\n\nThe Ideas behind:\n\n\tMake it clear, that the config could not be edited in this screen. So by default it's hidden, could be toggled and has Syntax-Highlighting (as seen in the screen)\n\tUpdate the (Progress-)Status in Screen, while a Import is Running (actually, the interval is 2s)\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13027307",
            "date": "2011-04-30T09:24:19+0000",
            "content": "Upayavira, yes that's right .. i'm developing on Win7 with FF3. The Interface should work in Chrome, maybe also in Safari / Opera. Bugfixing – especially for IE – will come later  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13027846",
            "date": "2011-05-02T21:05:26+0000",
            "content": "Just because i had a quick Idea for it this morning – the Core-Admin Screen.\n\n\"Add Core\" will open an additional Layer within a Form where you could type all required informations. Actually the Functionality for the Buttons is missing, will be added tomorrow "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13027850",
            "date": "2011-05-02T21:14:18+0000",
            "content": "Thanks for doing all this, Stefan!\n\nI looked at the Analysis screenshot and found it a bit hard to \"eyeball\" quickly because the whole things feels very pale, which makes it hard for an eye to quickly jump from tokenizer, to token filter, to next token filter, etc.  It's also not immediately obvious what left side vs. right side are, so maybe a more visible \"Index-time Analysis\" and \"Query-time Analysis\" may help. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13027878",
            "date": "2011-05-02T22:13:27+0000",
            "content": "Stefan – this stuff is looking great!  Would you mind uploading a snapshot of your repo to this issue?  I would like to start a branch in the apache repo, but we need to have the proper Apache release boxes ticked (part of the process when you upload a patch) "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13028011",
            "date": "2011-05-03T03:55:20+0000",
            "content": "A few more comments....  \n\nRather then use: java-properties.jsp \ncan the JS hit:\nhttp://localhost:8983/solr/admin/properties \nor\nhttp://localhost:8983/solr/admin/properties?wt=json\n\nI like the landing dashboard you have, but it would be nice to have an big (optional) link to:\nhttp://localhost:8983/solr/browse\nso that people starting with solr can see solr in action easily\n\nlooking good!\n\n\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13028402",
            "date": "2011-05-03T20:17:42+0000",
            "content": "Thanks for doing all this, Stefan!\nI'm happy to contribute \n\nI looked at the Analysis screenshot and found it a bit hard to \"eyeball\" quickly because the whole things feels very pale, which makes it hard for an eye to quickly jump from tokenizer, to token filter, to next token filter, etc. It's also not immediately obvious what left side vs. right side are, so maybe a more visible \"Index-time Analysis\" and \"Query-time Analysis\" may help.\nThanks for the Feedback, really appreciated. Tried to Focus on the Text .. maybe there is too much \"gray\" around, yes :/ \nMaybe a vertical divider (from top to bottom) would help to realize the index vs. query thingy? more whitespace between both columns perhaps? What was the Text you've used for analysis? (Just to get a feeling, how your page looks like :>) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13028406",
            "date": "2011-05-03T20:22:28+0000",
            "content": "Rather then use: java-properties.jsp\ncan the JS hit: http://localhost:8983/solr/admin/properties\nHa, nice – already integrated, dropped out the .jsp. But noticed the the line.seperator is not 'encoded', already started an ticket for this: SOLR-2490\n\nI like the landing dashboard you have, but it would be nice to have an big (optional) link to: \nhttp://localhost:8983/solr/browse\nso that people starting with solr can see solr in action easily\nHmm, would be useful too have another \"admin-extra.html\" File also for the global Dashboard, not only on Core-Level? We could point to the Velocity-Thingy but default, and everybody is able to extend this for his own needs. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13028417",
            "date": "2011-05-03T20:45:47+0000",
            "content": "Stefan - I only looked at the screenshot you provided..... and now I can't find the link, I thought it was in this issue. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13028419",
            "date": "2011-05-03T20:48:31+0000",
            "content": "Stefan - I only looked at the screenshot you provided..... and now I can't find the link, I thought it was in this issue.\nAh okay, thought you've already played around. Here is the screen again: http://files.mathe.is/solr-admin/04_analysis.png "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13028429",
            "date": "2011-05-03T21:13:04+0000",
            "content": "Right, so if you look at the names of tokenizers and filters there, they are super light, almost like the background.  I think making them stand out more would be better - darker font, bolder... "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13028439",
            "date": "2011-05-03T21:28:31+0000",
            "content": "Right, so if you look at the names of tokenizers and filters there, they are super light, almost like the background. I think making them stand out more would be better - darker font, bolder...\nCorrect - just used on another monitor .. depends heavily on the settings, brightness/contrast – will put that screen back on the todo-list and try a few things. will let you know if it's done :>\n\nAdditional Thoughts Otis? Does not matter if they are related to existing Screens or other Features! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13033576",
            "date": "2011-05-14T16:38:11+0000",
            "content": "Used this rainy Saturday to complete the Replication Page\n\nThe possible Actions depend on Master/Slave-Configuration. The Iterations-List contains all Dates, per default only the latest ones [successful & failed] are displayed. Yellow Background (in the Index-Section) indicates a difference between the Slave- and the Master-Data.\n\nShort Screencast to see how the progress-bar will look while replicating (WIP-State two days ago): http://screencast.com/t/W1JcBaHO42C "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13033579",
            "date": "2011-05-14T16:43:15+0000",
            "content": "Short Installation Guidance, for those who are interested  \n\n\nsvn co https://svn.apache.org/repos/asf/lucene/dev/trunk/ apache-solr-trunk\ncd apache-solr-trunk/solr/src/webapp/web\nrm -rf admin index.jsp\ngit clone git://github.com/steffkes/solr-admin.git\nmv solr-admin/* ./\nrm -rf solr-admin\ncd ../../../\nant example\n\n\nIf there is no git client on your system, use https://github.com/steffkes/solr-admin/tarball/master "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13033839",
            "date": "2011-05-15T23:51:25+0000",
            "content": "bq Used this rainy Saturday to complete the Replication Page\n\nLooking good! "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13039536",
            "date": "2011-05-26T06:45:40+0000",
            "content": "hey stefan,\n\nI need to tell you this is great stuff here. It seems like you are working on this for a while and you are making great progress. Yet, it seems like you are at the point where we should move forward and see how we can land this on lucene trunk. Can you quickly wrap up what is missing here so we can get it ready for commit? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13039549",
            "date": "2011-05-26T07:16:05+0000",
            "content": "I agree Simon. Just looking at the screenshots, the improvement is so significant here: let's figure out some way to get this in and go iteratively from here?\n\nIf there are concerns about any particulars maybe as a workaround in the worst case we could temporarily keep a 'old admin UI' link or something, so that you can always do what you did before but with the new UI as a default? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13039723",
            "date": "2011-05-26T14:42:26+0000",
            "content": "Stuff is looking great stefan.\n\nRight now the big issues I see are:\n\n\tit works best in chrome.  FF has some errors, and i have not even tried IE\n\tlogging page is mostly a stub\n\n\n\nI took your templates and added a header that points to this issue.  \n\nI would like to commit soon (today) and iterate from there "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13039725",
            "date": "2011-05-26T14:49:08+0000",
            "content": "to be clear, i think we should keep the old interface around until the kinks are worked out with this one. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13039734",
            "date": "2011-05-26T15:17:15+0000",
            "content": "Thanks Ryan,\n\nit works best in chrome. FF has some errors, and i have not even tried IE\nJust wondering that something works in Chrome and not in FF? \n\nlogging page is mostly a stub\nnot only \"mostly\" :/ the data is completely static - the updating-part has to be done, planned for next week – SOLR-2459 is already created for this\n\nI took your templates and added a header that points to this issue. \nAh okay, i've done a basic notice today in the morning, and updated this notice right know with your text. Just that people are getting this information instead of overlooking it (comparison screenshot) so perhaps we could use this one instead of the plain-text thingy? ;>\n\nI would like to commit soon (today) and iterate from there\nYes, of course – fine \n\nto be clear, i think we should keep the old interface around until the kinks are worked out with this one.\nYes, at least to ensure that typical \"hey, to to analysis.jsp\"-Links from various Tutorials are still working. Will have a look on that, when the features are done – maybe we could change the configuration of jetty, to redirect the users .. later "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13039768",
            "date": "2011-05-26T16:34:24+0000",
            "content": "just added this stuff to trunk.\n\nThanks stefan!\n\nKeep the patches coming, and I will get them in as fast as possible "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13039839",
            "date": "2011-05-26T18:04:33+0000",
            "content": "Realized that my work-in-progress commits (and the related instrouctions to integrate them) were confusing. Attached patch will fix this "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13039850",
            "date": "2011-05-26T18:20:53+0000",
            "content": "thanks stefan, i added that patch.\n\nre FF problems...  when I look at:\nhttp://localhost:8983/solr/#/singlecore/analysis\n\nI see:\nuncaught exception: Syntax error, unrecognized expression: [value=fieldname=text]\nin firebug\n\nalso, the spinner next to the field name drop down does not stop spinning.\n\nAlso, the schema-browser is not showing up as expected (also in Chrome) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13039858",
            "date": "2011-05-26T18:37:59+0000",
            "content": "uncaught exception: Syntax error, unrecognized expression: [value=fieldname=text]\nYes, FF (seemed to be Version 4, works for 3.x) changed the behaviour of Javascript-Selectors. Already fixed the Handling for the Analysis-Page and the Schema-Browser-Page.\n\nalso, the spinner next to the field name drop down does not stop spinning.\nsame problem as above, javascript stopped working at the exception and does not remove the spinner-icon (read: also fixed)\n\nAlso, the schema-browser is not showing up as expected (also in Chrome)\nChecked that, the Terms-Table is not displayed correctly, needs to much space, but the intro-page of the schema-browser comes up .. also selecting a field (either from the dropdown, or the information on the right hand side) works for me, not for you Ryan? "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13039869",
            "date": "2011-05-26T19:17:01+0000",
            "content": "Ryan thanks for committing this. I think you should add a CHANGES.TXT entry to honor Stefans contribution, this is a huge change and a good one too. Once we close this make sure you add it.\n\nsimon "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13039877",
            "date": "2011-05-26T19:32:26+0000",
            "content": "I plan to add the CHANGES.TXT when the basic pluming is all in place and can resolve this issue.  We can then add new JIRA issues to improve the various parts.\n\nHUGE thanks to Stefan – a nice looking admin UI makes solr feel like it was built this century. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13039897",
            "date": "2011-05-26T20:12:46+0000",
            "content": "I've been concentrating on getting 3.1 into production, so I haven't tried this out, only seen the screenshot and read the discussion.\n\nTwo questions:  a) Is this suitable for inclusion in 3.2? b) Can the XML display code be made smart enough to deal with xinclude?  My solrconfig.xml file is mostly made up of xincludes.  If there's no good way to expand them inline, just making it possible to click on them to see the included file would be awesome. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13039906",
            "date": "2011-05-26T20:29:24+0000",
            "content": "Shawn,\n\na) Is this suitable for inclusion in 3.2?\nHonestly, i don't know if all is working right now. The main parts should do, but it is possible that there are changes made from 3.x to 4.x. First i'd like to finish the Features for trunk, afterwards we'll see – but of course i'd happy if you'd give it a try. Just clone (or download the tarball) from https://github.com/steffkes/solr-admin\n\nb) Can the XML display code be made smart enough to deal with xinclude? My solrconfig.xml file is mostly made up of xincludes. If there's no good way to expand them inline, just making it possible to click on them to see the included file would be awesome.\nActually it's just rendered through the Browser's XML-Capabilities, so no chance to inline other files. But if you could attach your solr-config (including all related files), i'll have a look and see what's possible. Perhaps we could render the XML-Files with javascript on the client-side, like it's already done for the dataimport-config \n\nStefan  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13042202",
            "date": "2011-06-01T14:41:17+0000",
            "content": "Shawn,\n\nb) Can the XML display code be made smart enough to deal with xinclude? My solrconfig.xml file is mostly made up of xincludes. If there's no good way to expand them inline, just making it possible to click on them to see the included file would be awesome.\nThanks for your Config-Files. I'd say it's possible – but not while using an absolute path to reference the file you want to include. The ShowFileRequestHandler works only for files in SOLR's conf/-Directory and (additionally) requires an relative path for the file=-Parameter!\n\nI'll try to create an quick Prototyp, so that we can have a look next Week. \n\nStefan "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13043910",
            "date": "2011-06-03T17:53:49+0000",
            "content": "Attached Patch (based on Rev 1131117/simonw) includes all changes which have been made since Rev 1127987/ryan.  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13043971",
            "date": "2011-06-03T18:58:45+0000",
            "content": "added that patch in revision: 1131137\n\nStefan – can you make sure it came in OK?\n\nstuff is looking great!\n\nIn a quick check in FF, the issues i noticed are:\n\n\tOn replication page when replication is not configured, it spins forever\n\tschema browser has a funny character to the right of \"Please Select\"\n\tsometimes the schema-browser page does not load when i click on it – perhaps because it has a '-' in the name?\n\n\n\nthanks Stefan! "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13043978",
            "date": "2011-06-03T19:07:21+0000",
            "content": "Another small thing:\n\n\ton the analysis page.  When you select 'Verbose Output' can it keep that setting for a subsequent call?\n\n\n\nWhat do you think about trying full width layout rather then the fixed 800px? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13043994",
            "date": "2011-06-03T19:43:04+0000",
            "content": "Stefan – can you make sure it came in OK?\nYes, all fine. Just realized that the dashboard was broken through my refactoring yesterday - fixed that.\n\nOn replication page when replication is not configured, it spins forever\nCorrect, also fixed. Works now the same way as Dataimport does; shows a basic \"not defined\" error. Will see if we could disable those menu-items already at the beginning. actually the problem is, that this data is only fetched on the dashboard .. so if the user uses another page to enter the admin, it's missing :/\n\nschema browser has a funny character to the right of \"Please Select\"\nGood to know, it's a Ellipsis-Character there .. indicating that the Page is not UTF-8 ;o it's on the list\n\nsometimes the schema-browser page does not load when i click on it – perhaps because it has a '-' in the name?\nNormally the dash should not be a problem .. other pages have also one. perhaps it's not clear that the user have to select one entry from the shown dropdown? it's starting with this screen and after selecting 'id' from the dropdown it's like this screen - not for you ryan?\n\nMentioned Bugs fixed with attached Patch (based on Rev 1131152/mikemccand) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13043999",
            "date": "2011-06-03T19:48:42+0000",
            "content": "on the analysis page. When you select 'Verbose Output' can it keep that setting for a subsequent call?\nGood idea, added to the list. Otis's suggestions are already there, will try to integrate that on the next work-part for the analysis page.\n\nWhat do you think about trying full width layout rather then the fixed 800px?\nThat was already mentioned this week on the IRC-Channel – will try to use relative units so that it will hopefully scale on your screen, perhaps we have to restrict the max-width for the really big screens. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13044008",
            "date": "2011-06-03T20:07:02+0000",
            "content": "just added your changes.\n\nAbout the schema-browser page not loading...  I am not talking about the schema-browser tab not loading at all.  The minimum steps to reproduce on my windows FF 4.0.1:\n\n\tload: http://localhost:8983/solr/#/singlecore/analysis\n\tclick on 'Schema Browser' – it loads the page\n\tclick on 'Analysis' – it loads the Analysis page\n\tclick on 'Schema Browser' – the page says looking at the analysis page, but URL says schema-browser\n\n\n\nare you seeing the same thing? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13044012",
            "date": "2011-06-03T20:14:58+0000",
            "content": "just added your changes.\nty, works\n\nare you seeing the same thing?\noh, indeed. ty for pointing this out. never worked on the schema-browser and changed the page :/ perhaps it's a quick fix, otherwise \"it's on the list\" =) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13044063",
            "date": "2011-06-03T21:18:32+0000",
            "content": "Shawn,\n\nb) Can the XML display code be made smart enough to deal with xinclude? My solrconfig.xml file is mostly made up of xincludes. If there's no good way to expand them inline, just making it possible to click on them to see the included file would be awesome.\n\nI'll try to create an quick Prototyp, so that we can have a look next Week.\n\nHere we go: http://files.mathe.is/solr-admin/xinclude/ (tested on Win/FF, should also work on Chrome) – it's really basic for the first step, no highlight, no loading-indicator or things like that. Wait for the solrconfig.xml File being loaded, and then hit the green T between Line-Number and the content; that will load the referenced file and display it below the selected row/line.\n\nSomething a User (read: you ;>) could work with?\n\nStefan "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13044588",
            "date": "2011-06-05T17:53:25+0000",
            "content": "Attached Patch changes UI from fixed to fluid width. works not perfectly for every resolution, so please try it out. Have a look at Pages where the content has two Columns (Schema-Browser, Dataimport, Query-Form) "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13044600",
            "date": "2011-06-05T18:37:00+0000",
            "content": "added in in revision: 1132475\n\nThis looks great!\n\nDo you think the footer might look better left justified?\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13044606",
            "date": "2011-06-05T19:07:15+0000",
            "content": "also, it might be nice to put in a min-width – so that when you make the window small, it forces a scrollbar.\n\nOn the maximum size, i think things look good "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13044634",
            "date": "2011-06-05T22:11:18+0000",
            "content": "The Chrome issues will go away if you install the XMLTree extension here: https://chrome.google.com/webstore/search?q=xmltree\n\nNOTE: XML Viewer doesn't help with this problem. I only really ran into this because I have a freshly-formatted machine, I suspect lots of chrome users have already installed this or something similar. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13044648",
            "date": "2011-06-05T23:35:18+0000",
            "content": "This one is odd, adding stopwords seems to break analysis...\n\nI put this in both the index and query time boxes on the \"analyze\" page:\n\nThis is a test of the early warning system\n\nI added these to the stopwords.txt file\nan\nthe\nthis\na\nis\n\nand tried to analyze the field \"text\". Nothing shows up. If I remove the stopwords from stopwords.txt it works fine.\n\nNo errors appear in the log file. The old admin gives results though...\n\nBTW, this whole effort is a long-needed makeover, I'm glad you've taken it on. Can I do something other than complain?\n\nOh, for the drop-down for choosing fields or types, would it be possible to order them alphabetically like the schema browser?\n\nErick "
        },
        {
            "author": "Joan Codina",
            "id": "comment-13044895",
            "date": "2011-06-06T14:56:52+0000",
            "content": "I did some changes to the current version of the Schema-Browser, some time ago.. you can find it in this issue #SOLR-2440. \nIt has some features that I found interesting:\nA: Drill down, so you can select a word in the list of most common words and perform a query.\nB. Select the list of fields to be the output of the query.\n\napart from sorting and showing the field names in alphabetical order and not capitalised. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13045008",
            "date": "2011-06-06T18:30:13+0000",
            "content": "Erick,\n\nThis one is odd, adding stopwords seems to break analysis...\n\nHm, did not handle removed tokens correctly. Patch attached\n\nOh, for the drop-down for choosing fields or types, would it be possible to order them alphabetically like the schema browser?\n\nYes, Patch attached too.\n\nBTW, this whole effort is a long-needed makeover, I'm glad you've taken it on. Can I do something other than complain?\n\nThanks  For me, it's just fine .. continue using the interface, as you normally would use it. We need just more feedback, other usecases, other schema-/field-definitions, ... – to see where things are not working as expected! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13045017",
            "date": "2011-06-06T18:35:39+0000",
            "content": "Joan,\n\nA: Drill down, so you can select a word in the list of most common words and perform a query.\nAdded to the list, will extend the Query-Form so that's possible to predefine Field-Values\n\nB. Select the list of fields to be the output of the query.\nRegarding your patch, that's directly related, right? Selected Field will be used for the query and is the only listed field for the fl= param. Never though about that, thanks - will add this also.\n\napart from sorting and showing the field names in alphabetical order and not capitalised.\nthats the current state, the values are just taken from the /admin/luke-Handler "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13045019",
            "date": "2011-06-06T18:38:19+0000",
            "content": "check revision: 1132724 "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13045071",
            "date": "2011-06-06T20:26:00+0000",
            "content": "check revision: 1132724\nYes, works.\n\n\n\nAttached Patch fixes a few smaller Things:\n\n\n\tRyan: schema browser has a funny character to the right of \"Please Select\"\n\n\n\n\n\tRyan: sometimes the schema-browser page does not load when i click on it – perhaps because it has a '-' in the name?\n\n\n\n\n\tAlso on the Schema/Config Page, i've replaced the iframe – which just shows the raw xml files – through the javascript highlighter (already used for dataimport-config), so will now work also in chrome (w/o extensions). still missing the xinclude-feature – feedback anyone?\n\n\n\n\n\tNew Style for 'Ping' in Navigation, if the /admin/ping handler is not available - like in example + multicore-mode.\n\n\n\n\n\tCore-Admin is now also fluid-width aware\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13045094",
            "date": "2011-06-06T20:58:45+0000",
            "content": "trying to apply this patch, i get:\n\"the chunk size did not match the number of added /removed lines!\"\n\nany ideas?     Did you make this patch differently then before? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13045147",
            "date": "2011-06-06T21:44:56+0000",
            "content": "any ideas? Did you make this patch differently then before?\nhm, not really :/ same commands as the patches before. applying it locally, works as expected:\n\n\n$ patch -p0 < SOLR-2399-110606.patch\npatching file solr/src/webapp/web/tpl/schema-browser.html\npatching file solr/src/webapp/web/tpl/dataimport.html\npatching file solr/src/webapp/web/tpl/cores.html\npatching file solr/src/webapp/web/css/screen.css\npatching file solr/src/webapp/web/css/syntax.css\npatching file solr/src/webapp/web/js/script.js\n\n\nwill have a look on this tomorrow, sorry ryan "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13045192",
            "date": "2011-06-06T22:54:53+0000",
            "content": "Ok, i tried on linux and it applied OK.  TortiseSVN sometimes barfs when it shouldnt.\n\ncommitted in revision: 1132826 "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13045194",
            "date": "2011-06-06T22:59:51+0000",
            "content": "few minor comments...\n\n\n\ton http://localhost:8983/solr/#/singlecore/schema-browser/field/text in the \"Top 10/405 Terms:\" with the more/less links.  I'm not sure adding 10 at a time is really useful.  I would rather click 'more' and get all 50, and have 'less' just go back to 10.\n\n\n\n\n\tNavigation to Schema Browser works great – thanks\n\n\n\nagain, this is great stuff.  thanks! "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13045683",
            "date": "2011-06-07T22:35:50+0000",
            "content": "The xinclude stuff looks pretty cool!  A suggestion on it: shade the background of the entire expanded section, so it stands out better.  Thanks for including this! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13047950",
            "date": "2011-06-11T17:04:35+0000",
            "content": "SOLR-2400 is now solved, we can now upgrade the analysis functionality. I only want to strongly suggest:\n\n\n\tshow all attributes listed in the JSON/XML file, also rawBytes, KeywordAttribute,... Simply iterate over all JSON nodes and print them out\n\tdon't use 1-letter title (\"T\") for the first column, simply show here the attribute name (with everything before # removed). As hover text use the full attribute name including # and class name (if available).\n\ta special case should maybe only be done for start and endOffset, they could be combined in one line.\n\n\n\nI wanted to hack this, but my JavaScript knowledge is limited. I have one security issue found (XSS), see below.\n\nI had to debug some TokenStreams today and had to switch to the old analysis.jsp to do it, the new interface is not very helpful for complex attributes like japanese ones. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13047952",
            "date": "2011-06-11T17:11:53+0000",
            "content": "The GUI contains some security relevant problems (may be used for XSS):\n\nIt never escapes any text from solr when building HTML using strings, e.g. \"<td>\" + somethingEntered + \"</td>\"\nYou should use the HTML escaping method possibly provided by jQuery or insert the object manually into dom, instead of formatting then HTML source code. "
        },
        {
            "author": "noah",
            "id": "comment-13050784",
            "date": "2011-06-16T22:54:28+0000",
            "content": "The admin interface doesn't load in Safari 5 due to the use of variables and properties named 'class'.\nSimple patch available here: https://gist.github.com/1030496 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13050790",
            "date": "2011-06-16T23:08:56+0000",
            "content": "Stefan:\n\nMinor nit. If you refresh the stats page, everything shows up collapsed. Is it possible to show the same view as it was when the refresh was hit? The use-case here is that I wanted to watch how many documents were in the index as a job was running, so I wanted the \"search\" node expanded just as it was when I hit refresh...\n\nReally minor nit, though. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13051480",
            "date": "2011-06-18T08:56:47+0000",
            "content": "Shawn:\nOf course, it's just a quick prototype to demonstrate the functionality. The Layout will change if it's integrated \n\nUwe:\nThanks for the Changes! Yes, the Analysis-Page has a few things that needs to be changed - mainly regarding layout/arrangement, but also functionality. Will see if i can finish working on that next Week. \n\nnoah:\nThanks, it's integrated .. id as property works w/o problems? The Layout on Safari looks good, compared to the provided Screenshots?\n\nErick:\nthat was a quick change :> every entry has now it's own url .. so after reloading the page, the view will be the same as before. "
        },
        {
            "author": "Young Kim",
            "id": "comment-13052268",
            "date": "2011-06-20T23:03:15+0000",
            "content": "Out of curiosity, does is this compatible with 3.2.0 or just 4.0? I've followed the instructions (with 3.2.0 of course), and I keep on hitting a build failed. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13052273",
            "date": "2011-06-20T23:14:28+0000",
            "content": "right now this only works with 4.0\n\nOnce all the kinks are worked out – and the things it depends on are ported to 3.x, this will likely also get ported to 3.x "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13053017",
            "date": "2011-06-22T03:18:44+0000",
            "content": "On the 'java-properties' page, is the UI assuming ':' is the path seperator?  On windows (where the path seperator is ';') the display looks like:\n\n    C\n    \\java\\jdk1.6.0_25\\jre\\lib\\resources.jar;C\n    \\java\\jdk1.6.0_25\\jre\\lib\\rt.jar;C\n    \\java\\jdk1.6.0_25\\jre\\lib\\sunrsasign.jar;C\n    \\java\\jdk1.6.0_25\\jre\\lib\\jsse.jar;C\n    \\java\\jdk1.6.0_25\\jre\\lib\\jce.jar;C\n    \\java\\jdk1.6.0_25\\jre\\lib\\charsets.jar;C\n    \\java\\jdk1.6.0_25\\jre\\lib\\modules\\jdk.boot.jar;C\n    \\java\\jdk1.6.0_25\\jre\\classes\n\n\n\nCan this use the value of path.seperator to split?\n\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13053021",
            "date": "2011-06-22T03:31:30+0000",
            "content": "Should the Ping query append a random number so that it avoids HTTP cache?  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13053026",
            "date": "2011-06-22T03:46:41+0000",
            "content": "Something for the wishlist... on the threads page, it would be great to have a button to expand (and collapse?) all the stack traces.  Its hard to figure out which thread is doing what just from the title. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13053078",
            "date": "2011-06-22T06:56:03+0000",
            "content": "Okay, there we go :>\n\nOn the 'java-properties' page, is the UI assuming ':' is the path seperator?\nCan this use the value of path.seperator to split?\nYes & Yes - Done [commit]\n\nShould the Ping query append a random number so that it avoids HTTP cache? \nGood Idea! - Done [commit]\n\n\nSomething for the wishlist... on the threads page, it would be great to have a button to expand (and collapse?) all the stack traces. Its hard to figure out which thread is doing what just from the title.\nI've added an Button at the Top and the Bottom of the Table to show/hide all of them w/ one click [commit]\n\n\n\nAttached Patch contains all git-changes since our last SVN-Commit. Could you also include those images Ryan? They will not go into the SVN-Diff because of their binary type :/ \n\n\thttps://github.com/steffkes/solr-admin/raw/master/img/ico/toolbox.png\n\thttps://github.com/steffkes/solr-admin/raw/master/img/ico/zone.png\n\thttps://github.com/steffkes/solr-admin/raw/master/img/ico/system-monitor--exclamation.png\n\n\n\nThanks!  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13053097",
            "date": "2011-06-22T07:33:35+0000",
            "content": "Thanks Stefan.  Added in #1138323 "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13053110",
            "date": "2011-06-22T07:55:12+0000",
            "content": "in #1138328, I added a min-width value – this should keep things from looking rediculous when it gets really small "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13054634",
            "date": "2011-06-24T19:15:50+0000",
            "content": "Young,\n\n..., and I keep on hitting a build failed.\nWhy did your build fail? Like Ryan already said, the UI is for trunk .. but the code should still build even on 3.x branches?\n\nStefan "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13058844",
            "date": "2011-07-01T22:45:46+0000",
            "content": "So, after a few hours hacking .. it's hopefully a step into the right direction for the Analysis-Page! :>\n\nPlease, have a look and let me know, what you're thinking. I've changed various things:\n\n\tVertical Separation should be more clear now (Index- vs. Query-Time)\n\tFilter- & Tokenizer-Names are placed on the left Side (so it should be easier to follow each token through all the steps, Full Name on MouseOver)\n\tProperty-Names are not longer abbreviated\n\tAll Properties (except match and positionHistory) are displayed\n\tIf the Property-Name contains a #-Sign, only the latter part is displayed (Full Name on MouseOver)\n\n\n\nUwe, maybe you could give it a try w/ lucene-gosen? These are the required changes (since the last svn-commit).\n\n\n\n\n \nVersion 1980\nFirst Try\nCurrent Page\n\n\nNormal\nScreenshot\nScreenshot\nScreenshot\n\n\nVerbose\nScreenshot\nScreenshot\nScreenshot\n\n\n\n\n\nStefan "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13058865",
            "date": "2011-07-01T23:33:29+0000",
            "content": "First Feedback from #solr:\n\n<hossman_> in the new ones, it's easy to overlook that \"sonic\" and \"viewsonic\" are at the same position\n<hossman_> steffkes: i think what i would suggest is to keep your new layout, treat position as special and put some sort of visual indicator on terms that are at the same position\n\n<hossman_> oh yeah ... i ment to ask about that ... i'm assuming you look at the capital letters in the class name?\n<hossman_> i think it's an assume way to save space, definitely a good idea for verbose==false (as long as you can mouse over it or something to see the full name)\n<hossman_> for verbose==true ... not sure\n\nregarding the two-column-layout / Index- vs. Query-Time:\n<elyograg> I see now.  I think they might need headers to indicate which is which.  Not strictly required if your screen is wide enough, but if it wraps below, it may not be immediately apparent. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13058879",
            "date": "2011-07-01T23:56:17+0000",
            "content": "\nUwe, maybe you could give it a try w/ lucene-gosen? These are the required changes (since the last svn-commit).\n\nIf Uwe doesn't have the time, I'll try to investigate this in the next few days, once I stop laughing about \"Version 1980\".\n\nwe have a version that works with trunk here, https://lucene-gosen.googlecode.com/svn/branches/4x "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13058997",
            "date": "2011-07-02T08:16:14+0000",
            "content": "we have a version that works with trunk here, https://lucene-gosen.googlecode.com/svn/branches/4x\ngreat .. that was easy to install – even for me \n\nThe Results for gosen .. just took text from the TestToStringUtil-Class:\n\n\n\n\n \nVersion 1980\nFirst Try\nCurrent Page\n\n\nNormal (ja)\nScreenshot\nScreenshot\nScreenshot\n\n\nVerbose (ja)\nScreenshot\nScreenshot\nScreenshot\n\n\n\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13059007",
            "date": "2011-07-02T09:37:01+0000",
            "content": "Traumhaft! Danke! (Very nice! Thanks!)\n\nCan you provide the patch and upload it here (for current trunk), please also give the svn rev against what version it is? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13059013",
            "date": "2011-07-02T10:10:16+0000",
            "content": "Patch attached, based on SVN-Rev 1142186\nIncludes few XSS-Fixes and the new Analysis-Page "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13059104",
            "date": "2011-07-02T19:02:25+0000",
            "content": "I'm away from a computer till the 4th... Uwe, go ahead and commit Stefan's patch if you like...\n\nscreenshots look great.  As always, thanks Stefan! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13059244",
            "date": "2011-07-03T17:49:06+0000",
            "content": "OK, will do once I have reviewed it locally. I have some small issues, but they are minor. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13060262",
            "date": "2011-07-06T03:38:16+0000",
            "content": "Hey Stefan,\n\nWith the old UI, we repackage Solr a bit so that instead of running under the Solr context, it runs under the root context, but the Solr dispatch filter picks up anything sent to /solr. With the old UI, this worked fine - in general all links are still relative to Solr (there are one or two broken links that I'd like to fix).\n\nWith this however, all links end up being eg root/admin rather than say root/solr/admin.\n\nI've started poking around a bit, but I'm not quite sure where data-basepath is being picked up.\n\nIs there an easy change that can be made that allows the links (ajax calls and others) to resolve similarly to how they do with the older admin UI? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13060271",
            "date": "2011-07-06T04:12:18+0000",
            "content": "Hey Mark-\n\nI also repackaged it...  the only thing you really need to change is in index.jsp\n\n    app_config.solr_path = 'your path here'; //<%= request.getContextPath() %>';\n    app_config.core_admin_path = 'and here'; //<%= cores.getAdminPath() %>';\n    app_config.zookeeper_path = 'zookeeper.jsp';\n\n\n\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13060274",
            "date": "2011-07-06T04:25:24+0000",
            "content": "Nice, thanks Ryan. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13060276",
            "date": "2011-07-06T04:44:12+0000",
            "content": "So the other problem I get, which is odd, because it doesn't seem to be a problem with solr trunk for me, but it complains about the javascript variable class in script.js (L969) when i repackage.\n\nIf I change that to clazz, all complaints go away and then I can modify app_config.solr_path and things seem to go well from there. This is a reserved word in javascript, so I'm not super surprised it's causing me grief (in firefox and chrome), but what does surprise me is that when i load the admin page in straight solr trunk, it causes me no grief. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13060342",
            "date": "2011-07-06T07:38:03+0000",
            "content": "Mark,\n\nchanging the Pathes should be really easy, like Ryan said. So, should we use something other then request.getContextPath()? Maybe combined with a Conditional?\n\nbut it complains about the javascript variable class in script.js (L969) when i repackage.\nthat's already changed :> Or did you use another Version?\n\nStefan "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13060435",
            "date": "2011-07-06T09:24:55+0000",
            "content": "Perhaps we should close this issue and open new ones since this one is getting incredibly long in comments and it's already been committed.\n\nBut... one issue I have is that the schema/config views don't take advantage of my browsers ability to render XML as a collapsible/expandable tree structure.  It's surely nice as it is now for browsers that don't do XML like this... so maybe we leave it like it is but also provide a direct link to the show file request handler for those files like the old-school admin links do.  Thoughts? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13060441",
            "date": "2011-07-06T09:32:26+0000",
            "content": "... so maybe we leave it like it is but also provide a direct link to the show file request handler for those files like the old-school admin links do. Thoughts?\nEither this, yes – or we add tabs to the relevant views. The current one as first and an additional one with \"raw view\"? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13060551",
            "date": "2011-07-06T13:06:30+0000",
            "content": "So, should we use something other then request.getContextPath()? Maybe combined with a Conditional?\n\nNot sure yet - if there is something easy we can figure out, sounds great - otherwise I'm pretty happy that it's as easy to configure as it is already anyway.\n\nthat's already changed :> Or did you use another Version?\n\nAh, cool - I have a slightly older version of trunk. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13060682",
            "date": "2011-07-06T16:51:37+0000",
            "content": "I also repackaged it... the only thing you really need to change is in index.jsp\n\nHmmm... is that really necessary?\n\nSolrDispatchFilter already has the notion of a \"path-prefix\" setting that can be specified in the web.xml and defaults to null. it uses that wen proxying to build up the correct urls for things like the per core admin pages and what not anytime it proxies a request to the JSPs.\n\ncouldn't we just make SolrDispatchFilter add the pathPrefix to the HttpServletRequest as an attribute, and then no one would ever need to modify the index.jsp ... it could just derive all the paths from request.getContextPath() and request.getAttribute(\"solr-path-prefix\").\n\nright? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13061230",
            "date": "2011-07-07T11:52:33+0000",
            "content": "One additional question on the new analysis page:\n\n\tDoes your code also support CharFilters? I just ask because I had no time to try it out, it just came into my mind when i worked on FieldAnalysisReqHandler. The problem is that CharFilters return a different set of attributes and only one token.\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13061348",
            "date": "2011-07-07T14:39:46+0000",
            "content": "Does your code also support CharFilters?\nThanks Uwe – actually it does not. i've just checked the default-enabled fields & types from the example package. I'll try to fix that and update my last patch.\n\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response>\n    <lst name=\"responseHeader\">\n        <int name=\"status\">0</int>\n        <int name=\"QTime\">1</int>\n    </lst>\n    <lst name=\"analysis\">\n        <lst name=\"field_types\">\n            <lst name=\"text_char_norm\">\n                <lst name=\"index\">\n                    <str name=\"org.apache.lucene.analysis.charfilter.MappingCharFilter\">Foo</str>\n                    <arr name=\"org.apache.lucene.analysis.core.WhitespaceTokenizer\">\n                        <lst>\n                            <str name=\"text\">Foo</str>\n                            <str name=\"raw_bytes\">[46 6f 6f]</str>\n                            <int name=\"start\">0</int>\n                            <int name=\"end\">3</int>\n                            <int name=\"position\">1</int>\n                            <arr name=\"positionHistory\">\n                                <int>1</int>\n                            </arr>\n                            <str name=\"type\">word</str>\n                        </lst>\n                    </arr>\n                </lst>\n            </lst>\n        </lst>\n        <lst name=\"field_names\"/></lst>\n</response>\n\n\nwill create an virtual object for CharFilters so that they have on property text - should be okay? Especially in Combination with other Filters & Tokenizer which have more than that. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13061390",
            "date": "2011-07-07T15:32:29+0000",
            "content": "Patch based on SVN-Rev 1143882, works now also with CharFilter-Output.\n\nScreenshot: Normal, Verbose "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13062056",
            "date": "2011-07-08T16:57:53+0000",
            "content": "its great to see all this progress here!\n\nI had one suggestion, I felt this way about Version 1980 too... should we default the verbose checbox for analysis to \"on\"? I could be in the minority here, am I the only one who clicks verbose every time when using this?\n "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13062058",
            "date": "2011-07-08T17:03:57+0000",
            "content": "verbose default to on please, yes: +1 - I always check that myself, and teach it that way to others. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13062061",
            "date": "2011-07-08T17:11:09+0000",
            "content": "verbose on: +1 "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13062065",
            "date": "2011-07-08T17:27:41+0000",
            "content": "verbose on: +1\nI've updated the last Patch, now based on SVN-Rev 1144392 – verbose activated per default "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13067754",
            "date": "2011-07-19T14:45:49+0000",
            "content": "This is great stuff - brings Solr's admin UI into the modern age. The Solr website could use some similar love \n\nI'd love to get off forrest and onto the new CMS - and get off our wiki software as well. Then perhaps Stefan could lend us some more of his skills \n\nWe have plenty of need for this type of contributor IMO. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13068769",
            "date": "2011-07-21T02:34:24+0000",
            "content": "Hey Stefan-\n\nI have been out for a while...  not sure what the state of your patches vs /trunk are.  Do you want to make a new patch and I will get things up to date?\n\nMaybe we should close this ticket and open a few smaller ones for remaining TODO items.\n\nryan "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13068908",
            "date": "2011-07-21T11:12:13+0000",
            "content": "Ryan,\n\nthere was not really progress since a few days ... but i realized, that the directory structure was changed .. so i've updated the last patch, it's now based on SVN-Rev 1149113.\n\nClosing this ticket and continue with smaller todo-tickets sounds good, yes \n\nStefan "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13068994",
            "date": "2011-07-21T14:29:17+0000",
            "content": "This issue has become too large, so lets move subsequent work to SOLR-2667 "
        },
        {
            "author": "hadi",
            "id": "comment-13119289",
            "date": "2011-10-03T13:14:00+0000",
            "content": "I download the solr-admin patch, is it possible just overwrite the solr-admin files into the admin folder in tomcat/webapp? or it needs to add into the source and rebuild it with ant?\nalso i want to use it with solr 3.3 "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13122737",
            "date": "2011-10-07T12:36:32+0000",
            "content": "hadi,\n\nI download the solr-admin patch, is it possible just overwrite the solr-admin files into the admin folder in tomcat/webapp? or it needs to add into the source and rebuild it with ant?\njust updating the files in your webapp folder should be fine\n\nalso i want to use it with solr 3.3\nthis instead, i guess, will not work completely. some parts of the new ui are relying on features which are only available on trunk. but i'd like to see if the other parts works like expected, if you'd give a try?\n\nStefan "
        }
    ]
}