{
    "id": "SOLR-4612",
    "title": "Admin UI - Analysis Screen contains empty table-columns",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "While checking the links from the Tutorial, i discovered (at least) one which contains multiple empty table columns in the generated result-table\n\nhttp://localhost:8983/solr/#/collection1/analysis?analysis.fieldvalue=%EF%BD%B6%EF%BE%80%EF%BD%B6%EF%BE%85&analysis.query=%E3%82%AB%E3%82%BF%E3%82%AB%E3%83%8A&analysis.fieldtype=text_cjk&verbose_output=0\n\n\n\n\n ST \n ｶﾀｶﾅ \n \n\n\n CJKWF \n カタカナ \n \n\n\n LCF \n カタカナ \n \n\n\n CJKBF \n カタ, タカ, カナ \n \n\n\n\n\n(because the jira-markup allows not colspan, used a comma to visualize the three columns of the last row)\n\nNot sure where they are coming from ..",
    "attachments": {
        "SOLR-4612.patch": "https://issues.apache.org/jira/secure/attachment/12589320/SOLR-4612.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13691487",
            "date": "2013-06-23T15:22:46+0000",
            "content": "After a bit digging into the code, the problem appears to be: the CJKBigramFilter splits the provided into three parts (the code therefore raises the column-count to three), but since they belong all to the first word, the table later on uses html's colspan to make the relation clear. results in a table with three columns, where only the first one is used - because the first analyzer only gives one word. \n\nperhaps a combination with positionHistory would work, since that is later on used for the colspan magic, which i already mentioned .. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13691510",
            "date": "2013-06-23T16:30:14+0000",
            "content": "looks like it could be done much easier than i initially thought.\n\nthe first item in the chain defines the upper limit of possible positions - and the count never gets higher than that.\n\nso to say, the position itself does, but the positionHistory never does - and this is what the UI relies on. simply example would be \"TvTv\" with a WDF, which gets split into two tokens but on the same position (read as positionHistory)\n\nworks at least for the given sample and a few others which i've tested randomly. needs a bit more testing to make sure that nothing gets broken w/ this patch. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13824571",
            "date": "2013-11-16T18:54:43+0000",
            "content": "Commit 1542547 from Stefan Matheis (steffkes) in branch 'dev/trunk'\n[ https://svn.apache.org/r1542547 ]\n\nSOLR-4612: Admin UI - Analysis Screen contains empty table-columns "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13824572",
            "date": "2013-11-16T18:55:34+0000",
            "content": "Commit 1542548 from Stefan Matheis (steffkes) in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1542548 ]\n\nSOLR-4612: Admin UI - Analysis Screen contains empty table-columns (merge r1542547) "
        },
        {
            "author": "Hossein Taghi-Zadeh",
            "id": "comment-13917353",
            "date": "2014-03-02T10:37:12+0000",
            "content": "I has a fieldType which used the two separate PatternReplaceCharFilterFactory.\nfor example \n     <charFilter class=\"solr.PatternReplaceCharFilterFactory\" pattern=\"[\\u200E|\\u200C|\\u200D|\\u200F]\\s\" replacement=\"  \" />\n     <charFilter class=\"solr.PatternReplaceCharFilterFactory\" pattern=\"(?<Unable to render embedded object: File ((\\d) not found.(\\d|\\w))\" replacement=\" \" />\n     <tokenizer class=\"solr.StandardTokenizerFactory\"/>\n\nAnd in analysis screen, after PRCF filter any result was not shown!!! "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13917399",
            "date": "2014-03-02T12:51:41+0000",
            "content": "Hossein Taghi-Zadeh, I assume that you are using the just-released 4.7.0, or perhaps a later dev version.  SOLR-5800 has been filed for the problem you are experiencing. "
        }
    ]
}