{
    "id": "SOLR-12832",
    "title": "Java core dmp file is being created with a huge filesize (32gb) and due to which solr server is going to hung mode",
    "details": {
        "type": "Bug",
        "status": "Closed",
        "labels": "",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "priority": "Major",
        "resolution": "Invalid",
        "affect_versions": "5.5.1"
    },
    "description": "All of a sudden the solr api is going in hung mode and when we look into the reason we do see its taking up the diskspace by creating a huge java core dump file in this case its 32GB.\n\n \n\nHere are the more details:\n\nSolr version : 5.5.0\n\nJVM: IBM Java 1.7.0\n\nJVM Memory setup: 40GB (total system memory is 128GB)\n\nThis is happening occasionally and right now as a workaround we are just clearing up that huge java.core dmp file to make it work. And the major thing is that we couldn't able to open this file in any tools to see what's causing the java.core dump file.\n\n \n\nSo we really need some help here on how / where to start debugging what's the issue is?\n\n \n\nAny basic things to be verified here in this case? please let me know as this causing a huge impact.\n\n \n\nThanks,",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16639000",
            "content": "Jira is not a support portal.  Requests for help need to go to the mailing list or the IRC channel.  When you created this issue, there would have been some very prominent red text outlining this fact.  When you use one of these support resources, we will need things like logfiles.\n\nCore dumps are not created by Solr.  That would be a function of either java, or more likely, the operating system.\n\nThe project strongly recommends not using IBM Java.  It has known bugs with Lucene/Solr code.  Use either Oracle or OpenJDK. ",
            "author": "Shawn Heisey",
            "date": "2018-10-04T22:55:54+0000"
        }
    ]
}