{
    "id": "SOLR-5703",
    "title": "User Guide docs on using cursors & deep paging",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SOLR-5463 and cursorMark need documented in the user guide – beyond just simple usage, we need to explain the why/how it's distinct from regular pagination.",
    "attachments": {
        "pagination.user.guide.txt": "https://issues.apache.org/jira/secure/attachment/12627509/pagination.user.guide.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13894003",
            "date": "2014-02-06T23:52:40+0000",
            "content": "Attaching a text file with the verbage i've come up with.\n\nthe basic idea i had was to build up a new page in the doc (still not sure where it should live) where we first describe how basic pagination can be implemented for apps with UIs using start+rows, then talk about when/why \"deep pagination\" using start+rows is problematic, and then introduce cursor based pagination.  I also included info in both sections about how index updates affect multiple requests when using each type of pagination.\n\nwould appreciate feedback and any suggestions folks have for how a new page like this should fit into the current ref guide structure\n\n(Note: txt file is in my own little psuedo-markup since confluence doesn't have a wiki syntax anymore) "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13894983",
            "date": "2014-02-07T20:22:32+0000",
            "content": "A couple of comments:\n\n1. I didn't really understand deep paging before, but get it much more clearly now, so great start in that regard. And the client code examples are great. One question that still isn't clear, though, is how to use the nextCursorMark. After reading a couple of times, I finally caught the phrase \"take the \"nextCursorMark\" String value from the response\", so I'm thinking that maybe adding an example of what a nextCursorMark might look like and how to use it would answer the question that I had.\n\n2. In terms of where to put it in the Ref Guide, I think the Searching section is an obvious choice even though that section is getting large and unwieldy and deserves some more attention to the overall organization. While that's a bit of a separate topic, I moved a couple of pages around so this topic more neatly fits before or after the Result Grouping and Result Clustering pages. Hopefully soon I can take a deeper look at it and think of some better organization for Searching generally. Let me know if you think it should belong somewhere else. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13895089",
            "date": "2014-02-07T21:47:30+0000",
            "content": "One question that still isn't clear, though, is how to use the nextCursorMark. After reading a couple of times, I finally caught the phrase \"take the \"nextCursorMark\" String value from the response\", so I'm thinking that maybe adding an example of what a nextCursorMark might look like and how to use it would answer the question that I had.\n\nHere's a working concrete example:\nhttp://heliosearch.org/solr/paging-and-deep-paging/ "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13895131",
            "date": "2014-02-07T22:20:28+0000",
            "content": "I'm thinking that maybe adding an example of what a nextCursorMark might look like and how to use it would answer the question that I had.\n\nyeah ... i've added some example curl commands based on the example data with most of the response info pruned to try and highlight how the nextCursorMark is used.\n\nI also considered retooling the \"Using Cursors\" paragraph to be a bulleted list of steps, but that just started to feel to redundant with the psuedo-code for fetching all docs so i scrapped that.  It also occured to me that the mention of \"nextCursorMark\" in the para will probably pop more once it's in the wiki and i can use markup on it to make it stand out as a param name.\n\nhere's what i've got now, i'll start figuring out hte new Confluence UI to import this and format it all pretty.\n\n... before or after the Result Grouping and Result Clustering pages.\n\nI'll start with \"before\" and we can take it from there. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13895247",
            "date": "2014-02-07T23:33:08+0000",
            "content": "Ok, even though the WYIWYG editor keeps lying to me about where there are paragraph breaks, i'm calling this done for now...\n\nhttps://cwiki.apache.org/confluence/display/solr/Searching\nhttps://cwiki.apache.org/confluence/display/solr/Pagination+of+Results\n\n..additional tweaks to content & formatting can be handled on an ongoing basis as with any other page. "
        }
    ]
}