{
    "id": "SOLR-7208",
    "title": "CSV response support for returning same column name multiple times",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.2",
        "status": "Resolved",
        "resolution": "Not A Problem",
        "priority": "Trivial"
    },
    "description": "the CSV response writer will not currenlty generate CSV output in which 2 columns have identical names, ie, in the techproducts example wt=csv&fl=id,name,id,manu_id_s generates a CSV file with only 3 columns (id, name, manu_id_s)\n\nA work around for people who really want the same data to come back in 2 diff columns is to use fl field aliasing:  wt=csv&fl=id,name,id_again:id,manu_id_s which will produce a redundent \"id\" column using the column name \"id_again\"\n\nthere is no known workarround to get 2 columns in the CSV output with the same name (regardless of wether they come from the same original field or transformer)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-09T14:04:06+0000",
            "author": "Erick Erickson",
            "content": "Offhand, I don't see a good reason to support this, why do you think this is important? Why can't the client just deal with a single instance of the field?\n\nI suspect you'll find this is a pretty invasive change. Unless a good case can be made for supporting this has a common use-case I doubt it'll get much support.\n\nFeel free to argue the point, but I'd get some consensus that this would be accepted before putting in the work.\n ",
            "id": "comment-14353007"
        },
        {
            "date": "2015-03-09T15:49:23+0000",
            "author": "Nagabhushan",
            "content": "I agree, when we construct the search query dynamically, we can expect anything from user like they use to do in DB query.\n\nI wrote a solr client, getting similar kind on queries. ",
            "id": "comment-14353135"
        },
        {
            "date": "2015-03-09T17:24:49+0000",
            "author": "Hoss Man",
            "content": "tweaked summary & description wording to clarify this as a feature request, not a \"request for help\"\n\nnoted work around for some situations ",
            "id": "comment-14353226"
        },
        {
            "date": "2015-03-10T07:11:01+0000",
            "author": "Nagabhushan",
            "content": "Thanks a lot for work around. ",
            "id": "comment-14354442"
        },
        {
            "date": "2015-03-10T15:20:25+0000",
            "author": "Erick Erickson",
            "content": "There's a workaround, and no convincing argument has been made for why this is desirable. ",
            "id": "comment-14355051"
        }
    ]
}