{
    "id": "SOLR-2491",
    "title": "spellcheck.maxCollationTries breaks when using FieldCollapsing",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "If specifying \"spellcheck.maxCollationTries\" and \"group=true\" on the same query, you never get any Spell Check Collations back.  The problem is that SpellCheckCollator relies on ResponseBuilder.getToLog().get(\"hits\") to see how many results each test query returns.  When \"group=true\", the \"toLog\" isn't populated so SpellCheckCollator is unable to find a collation that can return results.",
    "attachments": {
        "SOLR-2491.patch": "https://issues.apache.org/jira/secure/attachment/12478090/SOLR-2491.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "James Dyer",
            "id": "comment-13028410",
            "date": "2011-05-03T20:29:01+0000",
            "content": "This patch fixes the problem & includes a unit test.  This patch simply removes the \"group\" parameter from any test queries prior to running them.  \n\nNote that the # of hits for each collation returned will always be the # of ungrouped hits.  This is consistent with the fact that FieldCollapsing is unable to tell us the number of grouped hits.\n\nIt is a bit disturbing to me how brittle getting the # of hits back via \"toLog\" has proven to be.  If someone can point to a less breakable way to do this it would be appreciated. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13045248",
            "date": "2011-06-07T03:04:16+0000",
            "content": "James: any opinion on this with regards to SOLR-2564?\n\nI'm totally lost when it comes to grouping, but do you still think collation should use ungrouped queries or should we wait on SOLR-2564, which seems to suggest it can return this count... I could be confused here and haven't looked in detail though.\n "
        },
        {
            "author": "James Dyer",
            "id": "comment-13045453",
            "date": "2011-06-07T14:33:11+0000",
            "content": "I think this issue can go separately from SOLR-2564 and have it use ungrouped queries.  This little patch allows people to use both features in tandem now rather than waiting for later (for instance, I have an app in production using this patch now...) .\n\nAs a follow-up to SOLR-2564, it would be nice to give the user the option to return # of grouped hits.  If the end-user is receiving groups as results and the app gives a message like \"300 results (groups) returned\", then in the case of a misspelled query, any \"did-you-mean\" message that includes # of hits would probably need to be consistent and give # groups rather than # documents.  So this would be useful additional functionality, whenever we indeed get grouping that can return # groups...\n\nMaybe a separate issue should be opened just for this, and it can be worked after SOLR-2564 goes in? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13045458",
            "date": "2011-06-07T14:47:36+0000",
            "content": "James: sounds like a plan. \n\nLets try to get this one resolved and we can followup with the option (and maybe change default or whatever) when that makes sense.\n\nI'll review the patch shortly. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13045472",
            "date": "2011-06-07T15:16:24+0000",
            "content": "Committed revision 1133043.\n\nThanks James! "
        },
        {
            "author": "Christian Johnsson",
            "id": "comment-13442089",
            "date": "2012-08-26T11:58:28+0000",
            "content": "Hi, I wonder if this is also a bug: https://issues.apache.org/jira/browse/SOLR-3758\nOr if i have missunderstood something. Worked perfectly in 3.5 but not i 4.0 beta.\n\nSorry for hijacking but i think it's kind of rellated  "
        }
    ]
}