{
    "id": "SOLR-2931",
    "title": "Statistics/aggregated values per group in a grouped response",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "We need to get minimum and maximum values for a field, within a group in a grouped search-result.\n\nI'll flesh out our use-case a little to make our needs clearer:\n\nWe have a number of documents, indexed with a price, date and a hotel. For each hotel, there are a number of documents, each representing a price/date combination. We then group our search result on hotel. We want to show the minimum and maximum price for each hotel.\n\nOther use-cases could be to calculate an average or a sum within a group.\n\n\nWe plan to work on this in the coming weeks, and will be supplying patches.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Paul Masurel",
            "id": "comment-13710832",
            "date": "2013-07-17T07:50:55+0000",
            "content": "We have a similar need for this feature. Could you tell us whether/how you addressed this issue?  "
        },
        {
            "author": "Morten Lied Johansen",
            "id": "comment-13710844",
            "date": "2013-07-17T08:11:49+0000",
            "content": "We tried to find a working solution, but time constraints and having a hard time working out how to implement this in SOLR lead us to dropping the feature instead.\n\nTo my knowledge no further work has been done on this. "
        },
        {
            "author": "Ansarul Islam Laskar",
            "id": "comment-14220717",
            "date": "2014-11-21T09:23:46+0000",
            "content": "Morten Lied Johansen..\nI need a full statistics for the grouped filed. Means every group should have its statistics. Can someone come forward and look into this. "
        },
        {
            "author": "Morten Lied Johansen",
            "id": "comment-14222794",
            "date": "2014-11-24T08:51:54+0000",
            "content": "After a couple weeks of trying to make this work, we gave up because of a lack of knowledge of the internals of SOLR and the complexities involved in the solution. We have since moved away from the feature and no longer have a need to solve this use-case.\n\nWe are not doing any more work on this issue (as should be evident from my comment last year). It is unlikely to be implemented unless someone who has a need for this use-case steps forward. "
        }
    ]
}