{
    "id": "SOLR-1575",
    "title": "loading solr.xml takes a lot of time when there are lot of cores",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.5"
        ],
        "components": [
            "multicore"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "We have around 38K cores which takes up around 25 mins to start the server. Keep in mind that no cores are started and this is the time taken for loading the solr.xml.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12779879",
            "date": "2009-11-19T08:47:08+0000",
            "content": "It may not be due to solr.xml itself. Further investigation may reveal what is wrong.. "
        },
        {
            "author": "olivier soyez",
            "id": "comment-13509857",
            "date": "2012-12-04T17:00:03+0000",
            "content": "We have around 50K cores with loadOnStart=\"false\" and same issue to start the server.\nIt takes a very long time to start, and it is just the time taken for loading the config file listing the available solr cores : solr.xml.\n\nTo solve this, in the \"load\" function, I just replace the line 532 of CoreContainer.java (Apache Solr 4.0 release) from \"p.setCoreProperties(readProperties(cfg, node));\" to \"p.setCoreProperties(readProperties(cfg, node.getParentNode().removeChild(node)));\"\n\nNow, it takes a few seconds to start the server "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13510581",
            "date": "2012-12-05T16:45:12+0000",
            "content": "This is very much changing, but be aware that the \"loadOnStartup\" is only for trunk (5.0). It hasn't been back-ported to the 4.x code line yet, so it's unsurprising that it doesn't make any difference.\n\nIt would be great if you could pull down 5x and give it a whirl without your change as a test... but be sure you have loadOnStartup rather than loadOnStart.\n\nTake a look at SOLR-4083 for the direction things are going. "
        },
        {
            "author": "olivier soyez",
            "id": "comment-13511545",
            "date": "2012-12-06T17:34:33+0000",
            "content": "In fact, I used the 4.0 code + SOLR-1293 modified code to test lotsofcores solr 4.0 (to be able to handle 50k cores per server with 1000 lives cores max at any time, shared configs, numBuckets, lazy load cores, efficient start cores, automatic start/stop cores, core creation on the fly, efficient fresh start). It's the reason why I have the loadOnStart=\"false\" option.\n\nAnyways, I pull down 5x and without changes, I try to start the server (50K cores with \"loadOnStartup=false\"), and same issue (very very long time to start ...)\nAfter that, I applied the change (line 590 of CoreContainer.java Apache Solr 5.0 trunck). In this way, the node you are working with is detached from the main document. So, it's a huge speed up for the evaluate method used in readProperties function called for each core, especially in case of lots of cores. And now it takes a few seconds to start the server.\n\nThanks, I would following SOLR-4083, because in your specific use case (50k cores), deprecate solr.xml entirely could be a scalability problem (especially fresh start time). "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13511561",
            "date": "2012-12-06T17:53:32+0000",
            "content": "Well, first the option is \"loadOnStartup\", not \"loadOnStart\". loadOnStart=\"false\" will still load everything. If you change that and still get extremely long load times, let me know....\n\nSecond, I've tested 15K cores parsing on a spinning-disk and it \"seemed\" acceptable to me performance wise, 15-20 seconds to get all the files off the disk (but not load cores). \n\nBut real-life tests always trump experiments, please let me know if it continues to not work.... "
        },
        {
            "author": "olivier soyez",
            "id": "comment-13526534",
            "date": "2012-12-07T16:52:01+0000",
            "content": "With trunk solr 5.0, all cores with loadOnStartup=\"false\" in solr.xml :\n\n\twithout any changes in the code :\n15K cores server startup in 220115 ms   ~  4 min\n50K cores server startup in 2925056 ms  ~  49 min\n\n\n\n\n\twith the change :\n15K cores server startup in 8145 ms     ~  8 sec\n50K cores server startup in 17211 ms    ~  17 sec\n\n\n\nThis little change is a big boost for the server startup ... "
        }
    ]
}