{
    "id": "SOLR-4165",
    "title": "Queries blocked when stopping a node",
    "details": {
        "affect_versions": "6.0",
        "status": "Reopened",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "search",
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Our 10 node test cluster (10 shards, 20 cores) blocks incoming queries briefly when a node is stopped gracefully and again blocks queries for at least a few seconds when the node is started again.\n\nWe're using siege to send roughly 10 queries per second to a pair a load balancers. Those load balancers ping (admin/ping) each node every few hundres milliseconds. The ping queries continue to operate normally while the requests to our main request handler is blocked. A manual request directly to a live Solr node is also blocked for the same duration.\n\nThere are no errors logged. But it is clear that the the entire cluster blocks queries as soon as the starting node is reading its config from Zookeeper, likely even slightly earlier.\n\nThe blocking time when stopping a node varies between 1 or 5 seconds. The blocking time when starting a node varies between 10 up to 30 seconds. The blocked queries come rushing in again after a queue of ping requests are served. The ping request sets the main request handler via the qt parameter.\n\n\n\nUPDATE:\nSince SOLR-3655 queries are no longer blocked when starting a node, only for a few seconds when a stopping node using Solr 5.0.0.2013.02.15.13.26.04",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Markus Jelsma",
            "id": "comment-13542994",
            "date": "2013-01-03T15:36:12+0000",
            "content": "Anyone here to test whether this issue applies to 4.x as well? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13543010",
            "date": "2013-01-03T15:51:35+0000",
            "content": "4x and 5x are pretty much in alignment these days.\n\nAre you still seeing this? Very strange... "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13543021",
            "date": "2013-01-03T16:04:37+0000",
            "content": "Yes. Query time is consistent until a node starts. A few seconds after start up all other nodes stop responding for a significant period (10-30 seconds). When that time has passed, the nodes suddenly send the response again. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13543022",
            "date": "2013-01-03T16:11:35+0000",
            "content": "We're also seeing the restarted node as ACTIVE immediately after start up in the cluster state but it's schema and index have not been loaded yet, only after everything is initialized the state becomes RECOVERING. Is it possible it's ACTIVE too early so the other nodes query it but do not receive reply until it's fully initialized? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13543028",
            "date": "2013-01-03T16:15:38+0000",
            "content": "Probably - good thought. Take a look at SOLR-3655 by the way.\n\nI'll try and think on this some... "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13543723",
            "date": "2013-01-04T09:11:09+0000",
            "content": "SOLR-3655 sounds like what i describe. Seems i opened a duplicate. Thanks! "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13551461",
            "date": "2013-01-11T19:51:22+0000",
            "content": "Hey Markus - how were you stopping the node? Standard stop or kill? A standard stop should pull the node out of live nodes pretty darn quickly... "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13551878",
            "date": "2013-01-12T10:32:10+0000",
            "content": "Hi Mark, this is for standard stops. On shutdown the cluster can stall very briefly, a matter of 1 or 2 seconds at most in our case. On start up the problem is more serious. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13554530",
            "date": "2013-01-15T23:47:26+0000",
            "content": "Mark, can this be resolved as a duplicate of SOLR-3655? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13574814",
            "date": "2013-02-08T20:55:53+0000",
            "content": "Yeah, resolving as a duplicate - I'll solve this in SOLR-3655. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13579165",
            "date": "2013-02-15T13:15:54+0000",
            "content": "Mark, i'm not sure this issue is entirely resolved. If i'm doing a stress test against a cluster and restart a node, the entire cluster still gets blocked. SOLR-3655 did improve things a lot, now the cluster only gets blocked when a node stops. When the node starts up again the stress test continues without being interrupted. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13579187",
            "date": "2013-02-15T13:53:25+0000",
            "content": "i guess reopen and rename this is the best move "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13579207",
            "date": "2013-02-15T14:25:29+0000",
            "content": "These can't be blocked for long right? We are publishing down before shutting down - my guess is that doing what we do on startup - waiting to see the published state show up in our clusterstate, will deal with this, but must be a pretty short time difference even now. I suppose I could have said the same thing about startup though. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13579211",
            "date": "2013-02-15T14:33:07+0000",
            "content": "Correctt. Start up was up to 30 seconds and on shutdown not more than a few seconds. Shutdown still stops the world for about two seconds, not a lot more but you'll clearly notice it when a stream of HTTP requests suddenly freezes. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13579837",
            "date": "2013-02-16T17:02:13+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1446914\n\nSOLR-4421,SOLR-4165: On CoreContainer shutdown, all SolrCores should publish their state as DOWN. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13579885",
            "date": "2013-02-16T19:20:13+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1446926\n\nSOLR-4421,SOLR-4165: Fix wait loop to sleep, reduce max wait time, wait min 1 second "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13580027",
            "date": "2013-02-16T20:48:12+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1446938\n\nSOLR-4421,SOLR-4165: On CoreContainer shutdown, all SolrCores should publish their state as DOWN. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13580034",
            "date": "2013-02-16T21:03:33+0000",
            "content": "Can you try out the latest when you get a chance Markus? "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13580041",
            "date": "2013-02-16T21:10:27+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1446939\n\nSOLR-4421,SOLR-4165: Fix wait loop to sleep, reduce max wait time, wait min 1 second "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13580572",
            "date": "2013-02-18T12:07:21+0000",
            "content": "Hi Mark, the problem persists and it seems to block slightly longer on shutdown than the previous check out (15th). It waits about 3-4 seconds now. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13580656",
            "date": "2013-02-18T15:19:46+0000",
            "content": "Bah, that's odd. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13580663",
            "date": "2013-02-18T15:30:00+0000",
            "content": "I've double checked. All nodes run the today's build. I did the test after all nodes got the upgrade. To make things really sure i did another test just now. .... ...  and it still blocks.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13580690",
            "date": "2013-02-18T16:13:41+0000",
            "content": "I'm guessing we get our shutdown call in filter#destroy after jetty already stops taking connections - or something along those lines. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13585179",
            "date": "2013-02-23T18:06:38+0000",
            "content": "I think the best we can do is offer an explicit api to first publish the node as down in zookeeper, then you do a hard stop. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717280",
            "date": "2013-07-23T18:47:43+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971194",
            "date": "2014-04-16T12:57:25+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}