{
    "id": "SOLR-5432",
    "title": "Allow simple editing for solrconfig.xml and schema.xml from the admin interface",
    "details": {
        "affect_versions": "4.6,                                            6.0",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Stefan Matheis (steffkes) OK, let's see if we can make the simple case work as per the discussion in SOLR-5287 and reserve the rest of the enhancements for later?\n\nI'll try to create an end-point Real Soon Now and we can try it out. This will be the simple case of just writing basically anything in the conf directory. Specifically excluding anything in the sub-directories for the time being.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13817444",
            "date": "2013-11-08T16:51:55+0000",
            "content": "Well, this might be a short-lived JIRA. I looked at the managed schema code and chatted with Steve Rowe. It looks like it would be relatively straight-forward to leverage the managed schema infrastructure to allow for CRUD on arbitrary files at least in the conf directory. On a quick glance it doesn't appear to be much, if any, more work than the \"simple\" way of doing things. And it would get us SolrCloud support \"for free\" or at least using prior art.\n\nWe'll be able to look at this a bit more next week.\n\nAny red flags here? It seems like schema.xml lends itself to a whole series of specific calls, the addfield, updatefield, copyfield sort of thing but the other files don't really, they're more blobs.\n\nWhich does leave us with the question of how the managed index schema for schema.xml should play if we also have generic file CRUD operations. Does it make sense to prevent the managed-file manipulation of schema.xml if they have configured the managed schema option? My personal take is that, barring having a hard time making this happen in the code, that the two options are not mutually exclusive and we shouldn't worry about it. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13823966",
            "date": "2013-11-15T19:10:38+0000",
            "content": "Fixed as part of SOLR-5287 "
        }
    ]
}