{
    "id": "SOLR-3529",
    "title": "clarify distnction between index & query tables on analysis debug pages",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Working on the tutorial, i noticed that the analysis debug page is a little hard to read when specifying both index and query values\n\n\n\tif the inputs are short, it's not entirely obvious that you are looking at two tables (especially compared to how the page looks using only the \"index\" textbox)\n\tif the inputs are longer, the \"query\" table shifts down below the fold where users may not even be aware of it.\n\n\n\nScreenshots and ideas for improvement to follow",
    "attachments": {
        "SOLR-3529.patch": "https://issues.apache.org/jira/secure/attachment/12532611/SOLR-3529.patch",
        "short-side-by-side.png": "https://issues.apache.org/jira/secure/attachment/12531459/short-side-by-side.png",
        "long-side-by-side.png": "https://issues.apache.org/jira/secure/attachment/12531458/long-side-by-side.png",
        "med-just-index.png": "https://issues.apache.org/jira/secure/attachment/12531461/med-just-index.png",
        "med-side-by-side-below-fold.png": "https://issues.apache.org/jira/secure/attachment/12531462/med-side-by-side-below-fold.png",
        "long-side-by-side-below-fold.png": "https://issues.apache.org/jira/secure/attachment/12531457/long-side-by-side-below-fold.png",
        "med-side-by-side.png": "https://issues.apache.org/jira/secure/attachment/12531463/med-side-by-side.png",
        "med-query-only.png": "https://issues.apache.org/jira/secure/attachment/12531460/med-query-only.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13292049",
            "date": "2012-06-08T22:29:15+0000",
            "content": "These screenshots are from my 1440x900 laptop running Firefox 3.6 with the window expanded to full screen (i confirmed with a helpful user on the #solr irc channel that they see similar behavior in firefox 13)\n\n\n\tshort-side-by-side.png - shows how even with fairly short inputs in both text boxes, the delineation between the two tables isn't very obvious\n\tmed-just-index.png - using slightly longer input in only the \"index\" text box, you can see that the results are similar enough to be easily confused with the short side-by-side example\n\tmed-side-by-side.png - the same \"index\" input combined with comparable \"query\" input is visually indistinguishable form the \"index only\" page, because the \"query\" table has been pushed down below the fold (med-side-by-side-below-fold.png)\n\tthis confusion is only exaserbated when the inputs/tables get really long (long-side-by-side.png & long-side-by-side-below-fold.png)\n\n\n\nIn my opinion:\n\n\n\tthe fieldtype pulldown, verbose checkbox, and analyze buttons should move above the text boxes so that the text boxes are closer to the tables they produce\n\twhen both text boxes are used:\n\t\n\t\tthe resulting tables should be enclosed in bounding boxes with a width of 50% of the main area (just like the text boxes are right now) – if either table is wider then this 50%, it should get a horizontal scroll bar (even if the other half of the page has lots of empty space\n\t\tthe dividing line between the two tables should be more visibly noticable (darker/thicker/whatever)\n\t\n\t\n\twhen only one text box is used:\n\t\n\t\tthe resulting table should be left aligned (regardless of which text box it's the result of)\n\t\tsome sort of visual cue should be provide about the text box that created that table...\n\t\t\n\t\t\tgrey out the unused text box until/unless the user starts typing in it?\n\t\t\tput color coded borders around both the text boxes and tables all the time, so the absence of a table with the corresponding color stands out when only one is used?\n\t\t\tput an irregular shaped boarder around the table and the text box that created it when only one is used (ie: exclude the unused text box ... think the outline of utah when the table belongs to the \"index\" text box, and the mirror image of utah when the table belongs to the \"query\" text box.\n\t\t\n\t\t\n\t\n\t\n\n "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13292622",
            "date": "2012-06-11T02:52:23+0000",
            "content": "Just some thoughts I have about the analysis page:\n\n\n\tThere's now a \"multiterm\" analyzer chain, and it'd be great to integrate that.  In order to do so, I think we should rethink the page a bit, and perhaps have only a single text area and have check boxes to be able to multselect of those three (index, query, multiterm) current analysis chains.\n\n\n\n\n\tHighlighting index terms matching from the query text analysis... this is a very misleading/confusing thing to work with unless you really understand that this is purely analysis and no query parsing is involved.  Somehow we should integrate query parsing into a trouble-shooting / exploratory / introspection tool like this, perhaps separately from the analysis page, but maybe somehow optionally integrated such that a query text box is truly parsed.\n\n\n\nI'd really like to see a multiterm analysis view. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13292623",
            "date": "2012-06-11T02:54:14+0000",
            "content": "One thought about all those attributes... what about check boxes to select the attributes to dynamically show or not? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13294840",
            "date": "2012-06-14T06:49:40+0000",
            "content": "Sorry for the long delay, still busy at the weekend, but i'll have a look next week and see what i can do. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13397108",
            "date": "2012-06-19T22:16:30+0000",
            "content": "First Patch: moved Field-Selection + Button on Top, Divider-Line between both columns uses darker Column.\n\nI'll see if i can integrate the \"Uta-Model\" tomorrow "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13397738",
            "date": "2012-06-20T18:29:47+0000",
            "content": "Next Patch, right now Columns have a fixed with (50%), even if only one Value (Index or Query) is given.\n\nThe 'Utah Approach' sounds nice, at least in Theory, but in Pratice we have too much \"trash\" around .. there are currently too much lines & dividers, which make it hard to recognize which Side is used and which one not.\n\nI'll take Pen & Paper and scribble a bit :> "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13397745",
            "date": "2012-06-20T18:36:49+0000",
            "content": "Erick, i'll need your help there - would you mind to give me a few examples of what you'd like to see? After Reading the Wiki, i have no (good) idea how to integrate it :/ "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13397768",
            "date": "2012-06-20T18:52:29+0000",
            "content": "Nope, I didn't write the comment, and the Hatch-man is away until next week so he'll have to pick it up then <G>.... "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13397776",
            "date": "2012-06-20T18:57:22+0000",
            "content": "Argh .. sorry, didn't pay enough attention - Erik (w/o c) was the person in question (: Sorry for the confusion Erick! "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13398404",
            "date": "2012-06-21T13:04:54+0000",
            "content": "Stefan - often folks just need to see the tokens emitted, not the offsets, raw bytes or other attributes.  What I was envisioning was a series of checkboxes above the output that controls what is shown.  With the text of the token being the default, but other unchecked options for \"raw bytes\", \"positions\", \"offsets\", etc.  To do this with arbitrary attributes, the output would need to be processed to get the dynamic set of attributes represented.  If this isn't clear, I'll try to draw a picture and attach. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13398984",
            "date": "2012-06-21T23:12:37+0000",
            "content": "I'm not sure if the change towards a two-column layout was really good .. perhaps we should go back and show three typical rows: settings/textarea for index&query-value, result on index- & result on query-analysis. \n\nthen we would have the complete width for every result, there is no need to change between a 50/50 and \"if it's larger than ..\" layout with 2 rows. \n\nOr will we loose a big advantage which we have currently? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13399286",
            "date": "2012-06-22T12:30:16+0000",
            "content": "OK, I will make a comment or two... But understand that my UI design skills are legendary... legendarily bad.\n\n> Let's not default to verbose. That's real intimidating for someone seeing it for the first time.\n\n> Let's remove one of the entry fields. 99% of the time I really want to see the same input go through at least the index and query chains. I'd rather put different text in a single entry field on those rare occasions when I want different index and query terms analyzed than copy all the time.\n\n> I think it's extremely valuable to have side-by-side display. When someone just starting looks at, say, WDFF on a side-by-side screen, it gives them information that they'd never notice otherwise. If this is only in non-verbose mode, fine.\n\n> I think that having the sliders for long input when side-by-side is preferable to stacking anything vertically. Most of the time, I'm only worried about a few terms anyway and the usually fit side-by-side.\n\n> Putting on my newbie hat, it's not obvious that the really cool display of the class when you hover over the abbreviations for the tokenizers/filters is available. Perhaps a note somewhere \"hover over abbreviations to see the definition\"? What'd be really cool is to show the complete definition in the hover box (e.g. the catenateWords, catenateNumbers from WDFF). Don't quite know how to get it to the UI, but.. <G>....\n\n> I thought a bit about MultiTermAware stuff, and it's a sticky wicket for the same reasons it's always been one, this bypasses parsing. Can we cheat here? I have in mind some weird bit where we detect wildcards on input, and somehow send all the wildcard terms through the multiterm chain and put them back in the display in place of the wildcards that went through the whole chain. I like making Stefan work hard <G>... OK, maybe I can help. Perhaps we can colorize this switch with a note about it somehow to signal that \"something you may not have expected happened\".\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412120",
            "date": "2012-07-11T22:26:04+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429805",
            "date": "2012-08-07T03:43:11+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452201",
            "date": "2012-09-10T17:41:58+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13566755",
            "date": "2013-01-30T18:46:43+0000",
            "content": "I was discussing this with Stefan on IRC.  I think that what needs to happen is that the background color of the index section needs to be visually distinct from the background color of the query section, and both need to be different from the white UI background and the purple highlight background.  The same colors should be used as the backgrounds for the text input boxes.\n\nI'm OK with the query section dropping down below the index section when the index section is really wide.  I'd also be OK with it being to the right, but only if a visual indicator is displayed (other than the horizontal scrollbar itself) that makes it clear you have to scroll right to see more. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717141",
            "date": "2013-07-23T18:47:15+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971363",
            "date": "2014-04-16T12:57:53+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}