{
    "id": "SOLR-44",
    "title": "Basic Facet Count support",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "First pass at basic facet support.  initial patch includes utilities for use in RequestHandlers, and usage in StandardRequestHandler (DisMax should use SolrParams before attempting to add this)\n\nBasic idea is that:\n\n\tfacet=true indicates facet counts are desired.\n\tfacetField=inStock indicates we want a count of the matching docs for each value in the field inStock\n\tfacetQuery=title:ipod indicates we want the count of matching docs also in the set of docs matching query title:ipod\n\tif user wants to apply a facet constraint on subsequent queries, they can add an \"fq\" (filter query) param (support for this was added to StandardRequestHandler as well)\n\n\n\nThings marked TODO...\n\n\tadd support for per field facetLimit indicating that only the top N items in each facetField should be returned\n\tadd support for a per field facetZero boolean indicating that there is no reason to bother returning counts of 0 for facetFields (some clients may want to know the list, others don't care)\n\tpotential optimization when using faceLimit to cache the terms with the highest docFreq and see if they provide all the info we need without doing a full TermEnum\n\n\n\nI'd like to get some feedback on the overall appraoch and params before i proceed too much farther.",
    "attachments": {
        "ASF.LICENSE.NOT.GRANTED--simple-facets.patch": "https://issues.apache.org/jira/secure/attachment/12339826/ASF.LICENSE.NOT.GRANTED--simple-facets.patch",
        "simple-facets.patch": "https://issues.apache.org/jira/secure/attachment/12340119/simple-facets.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mike Klaas",
            "id": "comment-12431625",
            "date": "2006-08-30T17:11:41+0000",
            "content": "I haven't looked at the patch yet but in terms of the parameters, might it make sense to use a group name similar to the highlighter params?  e.g., facet, facet.fl, facet.query, facet.limit, etc.\n\nAlso, now that we have per-field override capability for params, we should document which params can be thus overridden (facet.zero, facet.limit?) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12431745",
            "date": "2006-08-30T23:26:13+0000",
            "content": "Per mailing list discussion...\n  1) Mike's points about parameter names are dead on, and i'll be making changes.\n  2) Yonik pointed out I wasn't very forthcoming with examples, my bad.\n\nWith the patch as it stands right now, a query like this (against the example schema/docs) ...\n\nhttp://localhost:8983/solr/select/?q=video&facetQuery=inStock:true&facetQuery=price:[*+TO+500]&facet=true\n\n...would match on 3 docs, and would contain the following additional data...\n\n   <lst name=\"facet_counts\">\n     <int name=\"inStock:true\">1</int>\n     <int name=\"price:[* TO 500]\">2</int>\n   </lst>\n\nThe real powerful stuff comes into play when using facetField ...\n\nhttp://localhost:8983/solr/select/?indent=1&q=video&facetField=inStock&facetField=cat&facetQuery=price:[*+TO+500]&facet=true\n\n...to get...\n\n\n<lst name=\"facet_counts\">\n <int name=\"price:[* TO 500]\">2</int>\n <lst name=\"inStock\">\n  <int name=\"true\">1</int>\n\n  <int name=\"false\">2</int>\n </lst>\n <lst name=\"cat\">\n  <int name=\"search\">0</int>\n  <int name=\"memory\">0</int>\n  <int name=\"graphics\">2</int>\n  <int name=\"card\">2</int>\n\n  <int name=\"connector\">0</int>\n  <int name=\"software\">0</int>\n  <int name=\"electronics\">3</int>\n  <int name=\"copier\">0</int>\n  <int name=\"multifunction\">0</int>\n  <int name=\"camera\">0</int>\n\n  <int name=\"music\">1</int>\n  <int name=\"hard\">0</int>\n  <int name=\"scanner\">0</int>\n  <int name=\"monitor\">0</int>\n  <int name=\"drive\">0</int>\n  <int name=\"printer\">0</int>\n\n </lst>\n</lst>\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12432392",
            "date": "2006-09-03T23:24:58+0000",
            "content": "Per more mailing list discusion, a new version of the patch...\n\n1) param names have changed to match conventions disccuessed about highlighting...\n\nfacet - boolean - do facet counts or not\nfacet.query - multival string - list of arbitrary query constraints to count\nfacet.field - multival string - list of fields to treat as facets\nfacet.missing - boolean, per field - count docs that have no value for field\nfacet.zeros - boolean, per field - include facet field values with 0 counts\nfacet.limit - int, per field - max number of field values to return (desc)\n\n2) note that previuosly TODO \"limit\" and \"zeros\" functionality has been added\n\n3) note addition of \"missing\" option per discussion on the list\n\n4) response format has been modified slightly (not as extensively as discussed on the list since there wasn't a clear concensus about a good API - but a cleaner seperation of query based facets and facet fields)\n\n5) heavy refactoring: all functionality put into a \"SimpleFacets\" class which can be subclasseed/composed to get individual pieces of functionality.  usage of this class by StandardRequestHandler also refactored into method that subclassing handlers can override (to add complex facet behavior without giving up other built in goodness of StandardRequestHandler)\n\nA cool example that demonstrates everything with the example schema/docs...\n\nhttp://localhost:8983/solr/select/?facet.query=price:[400+TO+*]&facet.query=price:[*+TO+400]&q=video&start=0&rows=0&f.cat.facet.limit=8&facet.zeros=false&f.cat.facet.zeros=true&facet=true&facet.field=inStock&facet.field=cat&f.includes.facet.missing=true&facet.field=includes\n\n(NOTE: this is all still just used in StandardRequestHandler - not DisMax yet) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12432978",
            "date": "2006-09-06T22:03:04+0000",
            "content": "revised patch inlcudes facet support for the DisMax handler, also changed DisMax handler's use of \"fq\" to be multivalue (as standard request handler is now)\n\nI'll probably commit this version sometime in the next 24 hours unless any one spots any problems. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12432987",
            "date": "2006-09-06T22:31:16+0000",
            "content": "Small change to the way the fq params are processed...\n\npreviously it was valid to have an \"fq\" param of \"\" that would be ignored by the DisMax handler (if it did't ignore it, you got a parse error from QueryParser) ... i readded that logic to the utility that now deals with the FQ params for both standard and dismax. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12433138",
            "date": "2006-09-07T14:58:03+0000",
            "content": "I've tried it out... seems to be working great! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12433197",
            "date": "2006-09-07T18:52:36+0000",
            "content": "patch commited ... i'll update work on some better wiki pages this afternoon. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12437747",
            "date": "2006-09-26T05:59:45+0000",
            "content": "whoops ...  i left this open to remind me to work on the wiki pages, which i did without remembering to resolve this. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589327",
            "date": "2008-04-15T23:56:42+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}