{
    "id": "SOLR-11075",
    "title": "Refactor handling of params in CloudSolrStream and FacetStream",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "7.1",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We started to look more closely at how toExpression is used in these classes and the more we look the more puzzled we became (Varun and I that is).\n\nIs there any reason other than history why the params are pulled apart then reconstructed into comma-separated lists when there are more than one of any particular parameter? I suspect than when I worked on SOLR-8467 I didn't delve deeply enough here.\n\nDennis GoveJoel Bernstein Kevin Risden in particular we'd like your opinion. Arguably this is going to lead to anomalies, i.e. differences in what streaming selects .vs. what standard Solr would select.\n\nFor instance, let's say the user puts two \"q\" parameters in. Standard Solr parsing uses the first one encountered. what happens when we get q=clause1,clause2 as a result of the toExpression is anybody's guess. It just shouldn't be different than straight-up Solr IMO.\n\n\"fl\" parameters on the other hand are all honored, as are \"fq\" clauses.\n\nMultiple \"sort\" clauses it appears first one wins.\n\nSo my question is whether it makes sense to just add the parameter multiple times, presumably reflecting the actual query.\n\nAssigning to myself but someone else should feel free to take it",
    "attachments": {
        "SOLR-11075.patch": "https://issues.apache.org/jira/secure/attachment/12877405/SOLR-11075.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-14T22:03:02+0000",
            "content": "straw-man patch, Joel BernsteinDennis Gove any comments?\n\nIt would be possible to just make the calls to these classes use ModifiableSolrParams, but that would involve changing the c'tors which is a back-compat issue. Plus I kind of like having a local copy. ",
            "author": "Erick Erickson",
            "id": "comment-16088179"
        },
        {
            "date": "2017-07-15T18:00:03+0000",
            "content": "I do not recall any particular reason why parameter values are joined with a comma instead of adding the parameter for each value. Looking at the history, support for multiple values for a single parameter was added in this commit. Supporting multiple is certainly the appropriate thing to do, but I do believe you're correct in wondering why commas are used as opposed to adding the parameter multiple times.\n\nFrom my perspective, and in the world of expressions, there's no effective difference. ",
            "author": "Dennis Gove",
            "id": "comment-16088686"
        },
        {
            "date": "2017-07-15T22:15:15+0000",
            "content": "bq: I do not recall any particular reason why parameter values are joined with a comma instead of adding the parameter for each value.\n\nI'm pretty sure it was unintentional on my part when we went from Map<> to SolrParams in SOLR-8467. That bit went from \nEntry<String,String>\nto \nEntry<String,String[]>\nand I said \"Hmm, looks like the array of strings should be combined with a comma\". Wrong. Of course the old way wouldn't have worked for this case anyway since you couldn't specify two \"fq\" clauses.\n\nAnyway, it's good to have your perspective, I'll commit this soon. ",
            "author": "Erick Erickson",
            "id": "comment-16088747"
        },
        {
            "date": "2017-07-16T16:05:38+0000",
            "content": "Commit b17ec1445dd58a8e13c7718d17d1ee6467cde799 in lucene-solr's branch refs/heads/master from Erick\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b17ec14 ]\n\nSOLR-11075: Refactor handling of params in CloudSolrStream and FacetStream ",
            "author": "ASF subversion and git services",
            "id": "comment-16088982"
        },
        {
            "date": "2017-07-16T16:10:28+0000",
            "content": "Commit dc28374bea6592c1ba1f9b3436427bf5d7c9edeb in lucene-solr's branch refs/heads/branch_7x from Erick\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=dc28374 ]\n\nSOLR-11075: Refactor handling of params in CloudSolrStream and FacetStream\n\n(cherry picked from commit b17ec14) ",
            "author": "ASF subversion and git services",
            "id": "comment-16088984"
        },
        {
            "date": "2017-10-17T11:03:42+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16207357"
        }
    ]
}