{
    "id": "SOLR-4783",
    "title": "Rollback is not working in SolrCloud",
    "details": {
        "affect_versions": "4.2.1,                                            5.3",
        "status": "Closed",
        "fix_versions": [
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "I have 4 Solr 4.2.1 and 3 zookeeper cluster with frontend haproxy to Solr instances.\n1. Add a doc (without inline commit and autocommit is disabled in solrconfig.xml)\n2. Issue rollback.\n3. Again add another doc.\n4. Issue commit.\nBoth docs will be committed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13648315",
            "date": "2013-05-03T10:44:39+0000",
            "content": "What do we need rollback for anyway? The simplest resolution to this issue is to remove the (broken) rollback feature from Solr. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13648421",
            "date": "2013-05-03T13:57:48+0000",
            "content": "Remove it? Why not just disable it for SolrCloud, if that is the immediate problem?\n\nRollback seems like a useful, and traditional, feature for me, so I don't quite grasp what exactly you mean when you ask \"Do we really need it?\". Can you clue us in on your thinking? I mean, \"rollback\" is a traditional function of database transactions, which is what a sequence of uncommitted updates followed by a commit seems to be, to me.\n\nAnd if it is removed from Solr, what \"workaround\" will you suggest for situations where a user needs or wants to \"roll back\" latest, uncommitted ranges?\n\nIn any case, it would be nice to hear more of a discussion about what exactly is broken and why it can't be readily fixed.\n\nAlso, if it is marked as a \"major\" bug, then maybe the feature is more useful than you suggest. I mean, you are making it sound as if it is a marginal feature so that the priority should be \"trivial\". "
        },
        {
            "author": "Shekar R",
            "id": "comment-13648427",
            "date": "2013-05-03T14:05:37+0000",
            "content": "If there is no Rollback feature... why we need explicit Commit!! "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13648438",
            "date": "2013-05-03T14:18:50+0000",
            "content": "As mentioned on the dev-list http://search-lucene.com/m/Mu1N010en0G rollback is trappy and deceptional. For this reason I have never advised any customer to rely on it, since stuff might get committed underneath their feet. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13648606",
            "date": "2013-05-03T17:36:22+0000",
            "content": "As the wiki notes, \"This is an expert-level API that should only be used if the application is taking complete responsibility for update concurrency, replication, and sharding.\" So, any difficulties with rollback are not relevant for non-experts, people who have multiple, un-coordinated clients, using auto-commit or commit within, etc. So... what's the problem with keeping it for the experts who have configured their application so that they do have the level of control needed?\n\nStill unanswered: is there a specific bug/design problem with SolrCloud? I mean, if auto-commit/commitWithin are not enabled and \"the\" client does explicit commits, is there still some bug?\n\nAnd maybe rollback should fail if auto-commit or commitWithin are configured or the latter is explicitly used on update requests or in update documents. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717431",
            "date": "2013-07-23T18:48:13+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13862444",
            "date": "2014-01-04T23:30:50+0000",
            "content": "Any news regarding cloud and rollback?  "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13970951",
            "date": "2014-04-16T12:56:43+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15006721",
            "date": "2015-11-16T14:27:58+0000",
            "content": "Anyone tried rollback with SolrCloud in 5.x? Does it work? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-15012005",
            "date": "2015-11-18T21:24:49+0000",
            "content": "It should be made to throw an unsupported exception. SolrCloud does not support rollback. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15013441",
            "date": "2015-11-19T12:26:59+0000",
            "content": "Closing as duplicate of SOLR-4895 - this is already implemented "
        }
    ]
}