{
    "id": "SOLR-8165",
    "title": "Add new book 'Apache Solr Essentials'",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Packt Publishing is proud to finally announce the book \"Apache Solr Essentials\" by Andrea Gazzarini. This book is specifically for developers with practical experience of technologies similar to Apache Solr and want to develop efficient search applications. It leverages the power of Apache Solr to create efficient search applications and upskill the readers with the conceptual framework for robust search application creation.\n\nApache Solr Essentials is a fast paced guide that maximizes the data searching capability of your application and help you customize your search applications to meet your project specifications.\n\nApache Solr Essentials will quickly help you learn the process of creating a scalable, efficient, and powerful search application. The book starts off by explaining the fundamentals of Solr and then goes on to cover various topics such as data indexing, ways of extending Solr, client APIs and their indexing and data searching capabilities, an introduction to the administration, monitoring, and tuning of a Solr instance, as well as the concepts of sharding and replication. Next, you'll learn about various Solr extensions and how to contribute to the Solr community. By the end of this book, you will be able to create excellent search applications with the help of Solr.\n\nClick here to read more about Apache Solr Essentials.",
    "attachments": {
        "SOLR-8165.patch": "https://issues.apache.org/jira/secure/attachment/12767261/SOLR-8165.patch",
        "B03955_Apache Solr Essentials.jpg": "https://issues.apache.org/jira/secure/attachment/12767305/B03955_Apache%20Solr%20Essentials.jpg"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-10-18T16:36:09+0000",
            "author": "Andrea Gazzarini",
            "content": "Hi, this is the patch containing the book description and the cover image. I inserted it in the list following a chronological order. ",
            "id": "comment-14962492"
        },
        {
            "date": "2015-10-19T07:18:28+0000",
            "author": "Andrea Gazzarini",
            "content": "Patch updated (doesn't contain the image as it has been provided as a separate attachment) ",
            "id": "comment-14962954"
        },
        {
            "date": "2015-10-19T10:50:14+0000",
            "author": "Zico Fernandes",
            "content": "Thank you Andrea Gazzarini ",
            "id": "comment-14963144"
        }
    ]
}