{
    "id": "SOLR-7786",
    "title": "Admin UI: While working on a tab in a core, ability to switch to another core without losing input on the page",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Wish",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "There are frequently times that I am working on one of the tabs within a core (analysis, query, etc) and I would like to switch to another core so I can repeat exactly what I'm doing – so I'd like to switch without losing the tab I'm on and the inputs I've made.  This is particularly important while testing, because the alternate core very likely has a slightly different configuration or schema.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-13T13:25:29+0000",
            "author": "Shawn Heisey",
            "content": "One way to do it would be to have it be the default behavior when choosing a new core from the Core Selection dropdown.  Not sure if that's the right approach, but it's a possibility. ",
            "id": "comment-14624636"
        },
        {
            "date": "2015-07-13T13:44:25+0000",
            "author": "Upayavira",
            "content": "The challenge here is first identifying what the correct behaviour should be. I would expect that when you select a new core, you are abandoning the existing one. However, as you suggest, sometimes you build up a complex query for example, then realise you did it against the wrong core. A way to switch would be nice, but a clear signposting for this option isn't immediately obvious to me. ",
            "id": "comment-14624657"
        },
        {
            "date": "2015-07-13T15:34:18+0000",
            "author": "Shawn Heisey",
            "content": "It's definitely a challenging idea, and one that would be really helpful even if it only worked on Query and Analysis.  It might not ever happen, which is why I classified this as a Wish instead of Improvement. ",
            "id": "comment-14624802"
        },
        {
            "date": "2015-07-13T15:37:37+0000",
            "author": "Erick Erickson",
            "content": "Hmmm, what isn't solved here by opening two (or more) tabs in the browser? Or multiple browsers? Not as elegant maybe, but it exists currently... ",
            "id": "comment-14624809"
        },
        {
            "date": "2015-07-13T16:00:24+0000",
            "author": "Upayavira",
            "content": "The point is to persist the query parameters that you have entered. Multiple browser windows wouldn't get you that.\n\nI did have a patch worked on that persisted the parameters in the URL - it mostly worked, but was waaay too complex for the current UI where the task is achieving feature parity.\n\nIf we (once feature parity is achieved) did persist the query params in the URL, you could get to the other core just by editing the core in the URL.  ",
            "id": "comment-14624855"
        }
    ]
}