{
    "id": "SOLR-6162",
    "title": "Softcommit does not open a new searcher if nrtMode is false",
    "details": {
        "affect_versions": "4.8",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "We just upgraded from 4.2 to 4.8.1 and now run into an issue where added documents are not visible after doing a soft commit. Seems to be introduced by SOLR-5783. \n\nProblem manifests if conig explicitly sets nrtMode to false\n\nThe setup of the index is fairly simple; single core, no cloud, no replication, java program that adds a few rows, concludes with a softcommit, hardcommit is done via autoCommit few times an hour. Another (similar) index that uses autoSoftCommit instead of softcommitting via code has the same issue. Here is a snippet of the log:\n\n07:34:01.867 INFO  [qtp1520582600-1445       ] : o.a.s.u.processor.LogUpdateProcessor     - [PRD_KlwrDocAttrs] webapp=/solr path=/update params={wt=javabin&version=2} {add=[id-04114dd2-339e-4d2f-bb9f-539415799b1a (1470681570716155904), id-05eac67d-4f84-4c6f-b78f-714fe31eab40 (1470681570716155905), id-07559ff2-246c-4fde-9b97-0c5926348f62 (1470681570716155906), id-07cc0feb-b92d-41b8-9755-7677c9589af8 (1470681570716155907), id-11214665-9640-459d-804b-d9e3b069e8c2 (1470681570716155908), id-1147abeb-3dd5-4cda-b469-a99ebce913b4 (1470681570716155909), id-143f50b4-c195-480e-ab44-0ee4e7fbdc5c (1470681570716155910), id-14ad5b3e-1558-4bc6-a7a7-d2f03d1cd040 (1470681570717204480), id-168e810c-9a75-4e4f-84f4-946866cf0d26 (1470681570717204481), id-16de425b-0cd8-4bcd-98c1-6699c3de5112 (1470681570717204482), ... (87 adds)]} 0 264\n07:34:01.869 INFO  [qtp1520582600-1445       ] : org.apache.solr.update.UpdateHandler     - start commit{,optimize=false,openSearcher=true,waitSearcher=true,expungeDeletes=false,softCommit=true,prepareCommit=false}\n07:34:01.872 INFO  [qtp1520582600-1445       ] : org.apache.solr.core.SolrCore            - SolrIndexSearcher has not changed - not re-opening: org.apache.solr.search.SolrIndexSearcher\n07:34:01.872 INFO  [qtp1520582600-1445       ] : org.apache.solr.update.UpdateHandler     - end_commit_flush\n07:34:01.873 INFO  [qtp1520582600-1445       ] : o.a.s.u.processor.LogUpdateProcessor     - [PRD_KlwrDocAttrs] webapp=/solr path=/update params={waitSearcher=true&commit=true&wt=javabin&version=2&softCommit=true} {commit=} 0 4\n0",
    "attachments": {
        "KlwrDocAttrs.zip": "https://issues.apache.org/jira/secure/attachment/12650284/KlwrDocAttrs.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-14029485",
            "date": "2014-06-12T17:44:09+0000",
            "content": "Pieter: Your log message is definitely pecuiluire looking – but i'm unable to reproduce the behavior you are describing when modify the example solrconfig.xml to disable all autocommit and just do manual softCommits after adding docs – the searcher always re-opens when i expect.\n\ni suspect the problem must be in some edge case of config options that we haven't accounted for in our testing that you just happen to have – can you please post full details on how to reproduce:\n\n\n\tyour complete core configs (solrconfig.xml & schema.xml and any files they include)\n\teither a standalone java app for doing the doc adds & commits or some sequence of curl commands that triggers this behavior.\n\n\n "
        },
        {
            "author": "Pieter",
            "id": "comment-14030571",
            "date": "2014-06-13T12:21:53+0000",
            "content": "I attached a zip with the core config. Curl commands to reproduce the issue are:\n\ncurl http://server:8081/solr/KlwrDocAttrs/update -H \"Content-Type: text/xml\" --data-binary '<add><doc><field name=\"puid\">XXX</field><field name=\"repositoryId\">-1</field><field name=\"executionId\">-1</field><field name=\"informatiesoort\">XXX</field><field name=\"alle-uitgaven\">XXX</field><field name=\"vakgebied\">XXXXXX</field></doc></add>'\ncurl http://server:8081/solr/KlwrDocAttrs/update -H \"Content-Type: text/xml\" --data-binary '<commit waitSearcher=\"true\" softCommit=\"true\" />'\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14031300",
            "date": "2014-06-13T22:53:59+0000",
            "content": "(NOTE: for anyone trying to reproduce using Pieter's configs - they include an auto(Hard)Commit that may confuse your results if you just try to reproduce with the softCOmmit commands he mentioned and the autocommit triggers before you run the softComit or check the search results)\n\nPieter: looking over the configs you posted the crux of the problem seems to be that you have explicitly disabled \"nrtMode\"...\n\n\n    <nrtMode>false</nrtMode>\n\n\n\n\n\tthe nrtMode config option did not exist in Solr 4.2, so this has to be something new you added when upgrading to 4.8\n\tUnless i'm forgetting something, it's conceptually impossible to have a softCommit+openSearcher w/o using nrtMode==true\n\n\n\n..can you elaborate on why you set nrtMode==false?\n\nI think the best we can do here is throw an error or log a warning if someone tries a softCommit (or configures autoSoftCommit) w/o nrtMode being enabled?  (have to think about that more ... not sure if there's anything better we can do to in that case) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14031409",
            "date": "2014-06-14T02:26:02+0000",
            "content": "I think the best we can do here is throw an error or log a warning if someone tries a softCommit (or configures autoSoftCommit) w/o nrtMode being enabled?\n\nI think one of the only reasons that nrtMode was added was for developer debugging when the code was new (i.e. if someone thought they saw a problem, we could tell them to try setting nrtMode=false to see if it was something related to re-opening a reader with the writer).  IMO, it's like a cache size setting... it should not cause the external API to change.  From that perspective, one would want softCommit to just fall back to a normal commit.\n\nWe could also just get rid of the nrtMode parameter... or are there still use cases for it? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14031436",
            "date": "2014-06-14T03:34:48+0000",
            "content": "We could also just get rid of the nrtMode parameter\n\n+1 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14031490",
            "date": "2014-06-14T06:56:52+0000",
            "content": "We could also just get rid of the nrtMode parameter\n\nIs that actually a viable option?\n\nFrom the example...\n\n\n    <!-- If true, IndexReaders will be opened/reopened from the IndexWriter\n         instead of from the Directory. Hosts in a master/slave setup\n         should have this set to false while those in a SolrCloud\n         cluster need to be set to true. Default: true\n      -->\n\n\n\nWhich at a glance seems to be backed up by TestReplicationHandler.java which forces nrtMode==false. "
        },
        {
            "author": "Pieter",
            "id": "comment-14031512",
            "date": "2014-06-14T08:44:11+0000",
            "content": "That nrtMode parameter does the trick. Elaboration on how it got there is quite short; when upgrading to 4.8 I diffed my solrconfig with the new one from the examples and noticed this parameter. I interpreted the comment quoted above as a hint to set it to true, since we run in master/slave setup. That means, for most cores we have a master/slave setup. For a few we query directly on the master and on those we had the issue. \n\nI can't add anything to the discussion about removing the param. If it can be removed cause it doesn't add anything (but confusion), I would vote for it. Regardless that param, I do think that if a user makes the effort to do a softcommit (or configure autosoftcommit), he'll do so because he wants the update to be visible after the commit. Having an extra configuration switch to confirm such behaviour is not intuitive I think.\n\nThanks for the quick solution! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14031590",
            "date": "2014-06-14T14:58:42+0000",
            "content": "Is that actually a viable option?\nNot sure... I had thought that all the code (like installing an index snapshot) was currently smart enough to open from from the Directory when needed. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14032635",
            "date": "2014-06-16T16:58:50+0000",
            "content": "tweaked issue summary/description for posteity to make it clear what combination of thigns causes bug.\n\nPieter: your process/explanation of how you got into this situation makes total sense – part of my initial confusion was in not realizing/remembering that softCommit+openSearcher even existed prior to nrtMode.  (off the top of my head, i can't even remember what that did under the covers before we had an nrtMode to open the searcher directly off the writer)\n\nobviously we'll need to get to the bottom of what the \"Right\" thing to do is moving forward, but it's good to know that removing nrtMode=false from your configs seems to be working with your master->slave setup and gives us a viable workarround in the mean time.\n\nif you run into any other problems using this setup, please file new bugs, but make sure to reference this one as well to help keep in mind that it may in fact be a replication+nrtMode+softcommit related issue. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16076073",
            "date": "2017-07-06T07:16:08+0000",
            "content": "This issue is now invalid because nrtMode was deprecated in 5.0 with SOLR-6897 and then removed entirely from solrconfig.xml and code in 6.0 "
        }
    ]
}