{
    "id": "SOLR-9177",
    "title": "Support oom hook when running Solr in foreground mode",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "After reading through the comments on SOLR-8145 and from my own experience, seems like a reasonable number of people run Solr in foreground mode in production.\n\nTo give some more context, I've seen Solr hit OOM, which leads to IW being closed by Lucene. The Solr process hangs in there and without the oom killer, while all queries continue to work, all update requests start failing.\n\nI think it makes sense to add support to the bin/solr script to add the oom hook when running in fg mode.",
    "attachments": {
        "SOLR-9177.patch": "https://issues.apache.org/jira/secure/attachment/12881053/SOLR-9177.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-14T20:46:41+0000",
            "author": "Shawn Heisey",
            "content": "Strong +1 from me.  I found this issue after seeing this in the IRC channel today:\n\n\n14:37 < wryfi> elyograg: looking at bin/solr, i see that -XX:OnOutOfMemoryError\n               is only set when the process is backgrounded, whereas upstart\n               likes to run things in the foreground. so that explains why the\n               option was missing. i wonder what the reasoning was behind that\n               and/or if this should be a bug report.\n\n ",
            "id": "comment-16049643"
        },
        {
            "date": "2017-06-14T21:41:42+0000",
            "author": "Simon Tower",
            "content": "I accidentally hosed our entire cluster when I queried for too many rows. Having this option on by default when running in the foreground would have saved me a lot of trouble today. One of the shard indexes became corrupt, forcing us to delete all of the collections, recreate them, and reindex. ",
            "id": "comment-16049695"
        },
        {
            "date": "2017-06-14T23:14:45+0000",
            "author": "Chris Haumesser",
            "content": "With systemd eating the world, more and more people are going to be running solr in the foreground. As there is potential data corruption that can arise from this bug, and it is a simple fix, it would be great if someone could take a look at this.  ",
            "id": "comment-16049792"
        },
        {
            "date": "2017-06-16T08:15:36+0000",
            "author": "Jan Høydahl",
            "content": "Are there benefits from running in foreground with systemd that you don't get by using Type=forking? Created SOLR-10905 to explore official systemd script. ",
            "id": "comment-16051573"
        },
        {
            "date": "2017-06-16T14:32:33+0000",
            "author": "Shawn Heisey",
            "content": "Are there benefits from running in foreground with systemd \n\nI'd like to know that too.  My guess: If you start a foreground process, you don't have to track it.  Taking action when the process ends is simply a matter of script or code after the call to start the process. ",
            "id": "comment-16051976"
        },
        {
            "date": "2017-08-09T17:51:44+0000",
            "author": "Shawn Heisey",
            "content": "Patch with fix, CHANGES.txt entry in 7.0.0. ",
            "id": "comment-16120350"
        }
    ]
}