{
    "id": "SOLR-367",
    "title": "RFC: use contrete return types in analysis factory declarations",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "will attach patch for comments: the main idea is to change most of the Tokenizer and TokenFilterFactories to be explicit about what their \"create\" method returns instead of just using \"TokenStream\"",
    "attachments": {
        "concrete.declared.returntype.factories.diff": "https://issues.apache.org/jira/secure/attachment/12366705/concrete.declared.returntype.factories.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12530870",
            "date": "2007-09-27T23:13:49+0000",
            "content": "my main motivation for this is a little project i'm working on in some spare time to try and build a reflection based tool that will help us autogenerate Factories whenever we upgrade the Lucene jar.  step one is identifying which TokenFilter and Tokenizer factories already exist (even though the names might be inconsistent).  for that specific use case i could also introduce some new annotations, but it got me thinking about this and i think it's a good idea in general.  It makes the API of each factory self documenting about what that factory produces, and makes hte javadocs a lot easier to follow.\n\nno functionality is changed, and it is 100% backwards compatible.\n\ni'm seeking comments before commiting however because it does violate the typical philosophy of an API: declare that you return an interface/abstract class, not a concrete implementation.  I'm not sure that is as important in the case of these factories.  it also (in theory) could cause problems down the road if we start optimizing the factories.  ie: if we decide that for certain input options, SynonymFilterFactory isn't going to return a SynonymFilter and instead will return some new AliasFilter then in theory we have painted ourselves into a corner unless this AliasFilter is a subclass of SynonymFilter because people might have written code that directly calls the create method on the factory and expects a specific return type.  likewise we might run into similar problems if we promote some of our own filters up into lucene (and the packages change)\n\nthese seem like minor concerns however, given the intended usecase of these factories, and the \"self documentation\" benefits of the API.\n\n...but that's just my opinion, which is why i wanted to put it out there and see what people think. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12530909",
            "date": "2007-09-28T04:27:26+0000",
            "content": "Seems fine to me. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12539481",
            "date": "2007-11-01T22:38:10+0000",
            "content": "Committed revision 591158. "
        }
    ]
}