{
    "id": "SOLR-6576",
    "title": "ModifiableSolrParams#add(SolrParams) is performing a set operation instead of an add",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Came across this bug by attempting to append multiple ModifiableSolrParam objects together but found the last one was clobbering the previously set values. The add operation should append the values to the previously defined values, not perform a set operation.",
    "attachments": {
        "SOLR-6576.patch": "https://issues.apache.org/jira/secure/attachment/12672210/SOLR-6576.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-10-01T00:39:35+0000",
            "author": "Steve Davids",
            "content": "Fix + tests added in attached patch. ",
            "id": "comment-14154107"
        },
        {
            "date": "2014-10-01T01:51:31+0000",
            "author": "Hoss Man",
            "content": "I haven't looked at this closely, but I think the behavior you are observing is intentional – although it almost certainly needs better docs, and is probably not the best name.\n\nI think the intent here was for ModifiableSolrParam.add(SolrParams) to be analogous to Map.putAll(Map).  It's not a shortcut for adding all of values associated with each key in the argument SolrParams object; it's a method for updating the current SolrParams object to have all of the params (keys and values) in the argument SolrParams object\n\nSince the semantics are clearly ambiguous, and a change like this could really screw things up for existing users who expect the current behavior, the best course of action may be to deprecate the method completely and add new methods with more clear names?\n\n(FWIW: your desired goal is exactly what SolrParams.wrapAppended(SolrParams) was designed for.) ",
            "id": "comment-14154216"
        },
        {
            "date": "2014-10-01T04:06:50+0000",
            "author": "Steve Davids",
            "content": "Yea, this is a bit misleading as ModifiableSolrParams.add( String name, String ... val ) says:\n\nAdd the given values to any existing name\n\nThe behavior of this particular method works as expected, I would likewise assume that the \"add\" for SolrParams would work just the same way. That would be like saying we had a map with two methods: put(K key, V value) and putAll(Map<? extends K,? extends V> m) but did two completely different things.\n\nSo in my head I would think the method for the current functionality would mimic the \"set\" capability:\n\nReplace any existing parameter with the given name.\n\nand should be named appropriately. Also, SolrParams.wrapAppended(SolrParams) is deprecated so that isn't very re-assuring to use  ",
            "id": "comment-14154316"
        },
        {
            "date": "2014-10-01T16:54:14+0000",
            "author": "Hoss Man",
            "content": "So in my head I would think the method for the current functionality would mimic the \"set\" capability ... and should be named appropriately. \n\nI don't disagree with you, it's just the missfortune of how the API evolved w/o people giving a more critical eye to what those methods were named.\n\nAlso, SolrParams.wrapAppended(SolrParams) is deprecated so that isn't very re-assuring to use.\n\nUh? ... no it's not what makes you say that?\n\nhttps://lucene.apache.org/solr/4_10_0/solr-solrj/org/apache/solr/common/params/SolrParams.html#wrapAppended%28org.apache.solr.common.params.SolrParams,%20org.apache.solr.common.params.SolrParams%29 ",
            "id": "comment-14155103"
        },
        {
            "date": "2014-10-01T19:17:50+0000",
            "author": "Steve Davids",
            "content": "Oops, I glanced at the code too fast last night and saw the suppress deprecated warning:\n\n\n@SuppressWarnings({\"deprecation\"})\npublic static SolrParams wrapAppended(SolrParams params, SolrParams defaults) {\n\n\n\nwhich I mistook as @deprecated for some reason, my bad. ",
            "id": "comment-14155314"
        }
    ]
}