{
    "id": "SOLR-3154",
    "title": "SolrJ CloudServer should be leader and network aware when adding docs",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "It would be good when indexing if the SolrJ CloudServer was leader aware so that we could avoid doing an extra hop for the data.  It would also be good if one could easily set things up based on data locality principles.  This might mean that CloudServer is aware of where on the network it is and would pick leaders that are as close as possible (i.e. local, perhaps.)  This would come in to play when working with tools like Hadoop or other grid computing frameworks.",
    "attachments": {
        "SOLR-3154.patch": "https://issues.apache.org/jira/secure/attachment/12538494/SOLR-3154.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13222359",
            "date": "2012-03-05T14:05:43+0000",
            "content": "The main difficulty here is that to get the readable to indexed id that we hash, we need the field type and the id field. The id field we can simply have the user supply - but technically each field type can impl a custom method to get the indexed id that we hash on. Not sure what we do about this, but initially I was thinking we could support one or two field types (int, string) and just copy the (simple) logic for these two types into the server impl. Then the user would also have to supply the type (int,string) of the id field as well - though we could default it to what the example schema uses. "
        },
        {
            "author": "Michael Garski",
            "id": "comment-13399612",
            "date": "2012-06-22T21:17:59+0000",
            "content": "Would there be any issues with just hashing on the string representation of the ID? That would provide a neutral format that both client and server could use and I implemented that approach in a patch for SOLR-2592 (pluggable sharding), however I have not yet done anything on the SolrJ side of things. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13425489",
            "date": "2012-07-31T03:38:35+0000",
            "content": "Would there be any issues with just hashing on the string representation of the ID? \n\nYonik?\n\nI've done a bit of early work here tonight - I had to copy a fair amount of code and put it in this util class due to the hashing. \n\nThe patch is limited, but a start: right now it's just for String and Integer Id's and it only acts upon the first document or deleteby id (favoring document) - if you use the bulk methods they are all sent along to the leader of the first id. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13425875",
            "date": "2012-07-31T16:07:19+0000",
            "content": "> Would there be any issues with just hashing on the string representation of the ID?\nYonik?\n\nChatted with Mark a bit about this - I think it's fine.  We should just make sure to make it's a good hash (i.e. not String.hashCode  and define it well so it can be implemented in other languages/clients. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13426173",
            "date": "2012-07-31T22:15:05+0000",
            "content": "I just added a MurmurHash3 implementation that can be used on a String and give the same code as the UTF-8 bytes.\nhttp://svn.apache.org/viewvc?view=revision&revision=1367800 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13637679",
            "date": "2013-04-21T23:22:33+0000",
            "content": "A kind of easy win was taken in SOLR-3710 where we started just sending to leaders first (though not necessarily the right leader) - still need to do this and have the cloudsolrserver hash as well though. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13702841",
            "date": "2013-07-09T03:30:22+0000",
            "content": "Mark Miller should this be resolved as dupe of SOLR-4816 now? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13702860",
            "date": "2013-07-09T03:48:00+0000",
            "content": "No, I wouldn't do that until SOLR-4816 went in. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717349",
            "date": "2013-07-23T18:47:56+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787030",
            "date": "2013-10-05T10:18:49+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}