{
    "id": "SOLR-2520",
    "title": "JSONResponseWriter w/json.wrf can produce invalid javascript depending on unicode chars in response data",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.2"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Please see http://timelessrepo.com/json-isnt-a-javascript-subset.\n\nIf a stored field contains Unicode characters that are valid in Json but not valid in Javascript, and you use the query option to ask for JSONP (json.wrf), solr does not escape them, resulting in content that explodes on contact with browsers. That is, there are certain Unicode characters that are valid JSON but invalid in Javascript source, and a JSONP response is javascript source, to be incorporated in an HTML script tag. Further investigation suggests that only one character is a problem here:  U+2029 must be represented as \\u2029 instead of left 'as-is'.",
    "attachments": {
        "SOLR-2520.patch": "https://issues.apache.org/jira/secure/attachment/12479399/SOLR-2520.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13034151",
            "date": "2011-05-16T17:55:03+0000",
            "content": "I'm confused here: As far as i can tell, the JSONResponseWriter does in fact output valid JSON (the link mentioned points out that there are control characters valid in JSON which are not valid in javascript, but that's what the response writer produces – JSON) ... so what is the bug?\n\nAnd what do you mean by \"the query option to ask for jsonp\" ? ...  i don't see that option in the JSONResponseWriter\n\n(is this bug about some third party response writer?) "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13034159",
            "date": "2011-05-16T18:05:46+0000",
            "content": "Fun happens when you specify something in json.wrf. This demands 'jsonp' instead of json, which results in the result being treated as javascript, not json.  wt=json&json.wrf=SOME_PREFIX will cause Solr to respond with\n\n     SOME_PREFIX(\n{whatever it was otherwise going to return})\n\ninstead of just\n\n     {whatever it was otherwise going to return}\n\nIf there is then an interesting Unicode character in there, Chrome implodes and firefox quietly rejects.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13034179",
            "date": "2011-05-16T18:31:28+0000",
            "content": "Benson: thanks for the clarification, i've updated the summary to attempt to clarify the root of the issue.\n\nWould make more sense to have a \"JavascriptResponseWriter\" or to have the JSONResponseWriter do unicode escaping/stripping if/when json.wrf is specified? "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13034187",
            "date": "2011-05-16T18:38:24+0000",
            "content": "I'd vote for the later. I assume that there is some large inventory of people who are currently using json.wrf=foo and who would benefit from the change. However, I have limited context here, so if anyone else knows more about how users are using this stuff I hope they will speak up. Sorry not to have been fully clear on the first attempt. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13034197",
            "date": "2011-05-16T18:56:16+0000",
            "content": "It looks like we already escape \\u2028 (see SOLR-1936), so we should just do the same for \\u2029? "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13034352",
            "date": "2011-05-16T21:49:35+0000",
            "content": "Yes, that looks like that. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13034399",
            "date": "2011-05-16T22:44:29+0000",
            "content": "Here's a patch w/ simple test. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13034501",
            "date": "2011-05-17T02:14:59+0000",
            "content": "Committed to trunk and 3x.\nThanks for bringing this to our attention Benson! "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043596",
            "date": "2011-06-03T16:44:56+0000",
            "content": "Bulk close for 3.2 "
        }
    ]
}