{
    "id": "SOLR-3654",
    "title": "Add some tests using Tomcat as servlet container",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Build"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "All tests use Jetty, we should add some tests for at least one other servlet container (Tomcat). Ref discussion at http://search-lucene.com/m/6mo9Y1WZaWR1",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13419068",
            "date": "2012-07-20T11:49:52+0000",
            "content": "Have not done a lot of investigation but we could probably build this test using Cargo: http://cargo.codehaus.org/Ant+support\n\nHaving got Tomcat test support, it should be trivial to add other supported containers as well [Geronimo, Glassfish, JBoss, Resin...]. Also, if all Jetty tests now use JettySolrRunner, we have a single point of entry to plug in container randomization further down the road. This could be controlled by options so that Jetty is default but nightly builds randomize container per run. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13419097",
            "date": "2012-07-20T12:50:05+0000",
            "content": "I'm 100% against this.  "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13419457",
            "date": "2012-07-20T19:13:20+0000",
            "content": "I'm 100% against this. \n\nWhy? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13419473",
            "date": "2012-07-20T19:29:29+0000",
            "content": "Mark, you have started committing changes making Solr Jetty-bound, without a prior discussion on dev. Many of our users depend on Solr working with their app-servers, especially the OEMs, so such radical change of direction cannot be made without a thorough discussion and preferably a [VOTE].\n\nPlease continue voice your view, and aid in constructive planning for how and when Solr could (if it should) become a standalone app rather than a WAR - also consulting the user community, but it is not constructive to block test quality progress in 4.0 as long as 4.0 is planned to be a WAR release as before. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429736",
            "date": "2012-08-07T03:42:34+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451170",
            "date": "2012-09-08T00:18:58+0000",
            "content": "removing fixVersion=4.0 since there is no evidence that anyone is currently working on this issue.  (this can certainly be revisited if volunteers step forward)\n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15082953",
            "date": "2016-01-05T12:20:53+0000",
            "content": "Not relevant anymore "
        }
    ]
}