{
    "id": "SOLR-2471",
    "title": "Localparams not working with 2 fq parameters using qt=name",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "We are having a problem with the following query. If we have two localparams (using fq) and use QT= it does not work.\n\nThis does not find any results:\nhttp://localhost:8983/solr/provs/select?qname=john&qspec=dent&fq=\n{!type=dismax qt=namespec v=$qspec}&fq={!type=dismax qt=dismaxname v=$qname}&q=val:\"{!type=dismax qt=namespec v=$qspec}\n\" val:\"\n{!type=dismax qt=dismaxname v=$qname}\"&fl=specialties_desc,score,hgid,specialties_search,specialties_ngram,first_middle_last_name&wt=csv&facet=true&facet.field=specialties_desc&sort=score desc&rows=1000&start=0\n\nThis works okay. It returns a few results.\nhttp://localhost:8983/solr/provs/select?qname=john&qspec=dent&fq={!type=dismax qf=$qqf v=$qspec}&fq={!type=dismax qt=dismaxname v=$qname}\n&q=val:\"\n{!type=dismax qf=$qqf  v=$qspec}\n\" val:\"\n{!type=dismax qt=dismaxname v=$qname}\n\" &qqf=specialties_ngram^1.0 specialties_search^2.0&fl=specialties_desc,score,hgid,specialties_search,specialties_ngram,first_middle_last_name&wt=csv&facet=true&facet.field=specialties_desc&sort=score desc&rows=1000&start=0\n\nWe would like to use a QT for both terms but it seems there is some kind of bug when using two localparams and dismax filters with QT.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13022303",
            "date": "2011-04-20T19:02:20+0000",
            "content": "Bill: based on the information givein in the bug report, i'm having troupble understanding what the goal is, let alone the problem.\n\ncould you perhaps post some URLs demonstrating the problem against a schema and data that is publicly available soe people can reproduce?  (either the example schema/data or one provided in an attachment). \n\nat a general level, i'm not really sure i understand what you would expect \"qt\" to do when used in localparams.  qt selects the request handler used, but when local params are parsed the handler is has already been choosen (there is only one handler per request) ... i'm fairly certain that the qt local patrams in your second example isn't doing anything – but you said it works for you, hence my confusion about what your goal is. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13022313",
            "date": "2011-04-20T19:10:55+0000",
            "content": "Let's avoid asking questions in JIRA and take it to the mailing list in the future. "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13023108",
            "date": "2011-04-22T04:37:20+0000",
            "content": "This is not a question. It is a bug.\n\nHere is the problem:\n\nI want to do two FQs (filtered queries) to reduce the results. Each FQ is a subquery. For example:\n\nfq=\n{!type=dismax qt=dismaxname v=\"bill\"}\nfq=\n{!type=dismax qt=anotherfield v=\"doctor\"}\n\nWhat happens is the QT (solrconfig) dismaxname is used for both FQs. We need it to support 2 different QT names.\n\nIs this clear? If not, I will send an example that show breakage. "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13023110",
            "date": "2011-04-22T04:38:49+0000",
            "content": "Hoss,\n\nSince they are LocalParams, why can't we have TWO QTs? One for each subquery? Based on what you are saying, this would be a new feature request...\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13023219",
            "date": "2011-04-22T13:48:43+0000",
            "content": "What happens is the QT (solrconfig) dismaxname is used for both FQs.\n\nAs Hoss pointed out \"qt\" has nothing to do with dismax.\nPerhaps you were thinking of \"qf\" for query fields? "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13023482",
            "date": "2011-04-23T01:33:28+0000",
            "content": "Ok. That is just what I called it. \n\nIn one qt I have a long list of qf fields,\nand in the other qt I have a different list of qf fields.\n\nI separate the two do that the amount of incoming bandwidth\nis reduced. \n\nI was hoping to gave one qt per localparams. But it seems not possible.\n "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13023483",
            "date": "2011-04-23T01:38:48+0000",
            "content": "I am trying to search two user imputed fields. I know in the standard\nhandler I can do specialty:dentist AND name:bill. But since they are user \ninputed I want to do 2 subqueries. \nThat is why I have 2 fq parameters with different qf lists.\n\nDoes this make sense now? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13024935",
            "date": "2011-04-25T19:57:19+0000",
            "content": "In one qt I have a long list of qf fields\n\nI'm still at a loss to understand what you're trying to do with \"qt\".\n\nI know in the standard handler I can do specialty:dentist AND name:bill. But since they are user  inputed I want to do 2 subqueries. \n\nAhhh, so does this all boil down to \"how do you AND two dismax queries\" (e.g. dismaxquery1 AND dismaxquery2)? "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13026842",
            "date": "2011-04-29T04:54:44+0000",
            "content": "Yonik,\n\nI am not sure why we cannot communicate? I know how to AND two dismax queries... Just throw them both into two fq params. Pretty simple. There are other ways to do it too.\n\nBut this is not my question. Is it possible to have two QT parameters in the same call to Solr? I would like each of these fq params to have a pre-defined qt list of parameters for the localparams. \n\nfq=\n{!dismax qt=second}\nbill\nfq=\n{!dismax qt=third}\ntom\nq=jones\nqt=first\ndefType=dismax\n\nIn solrconfig:\n\nqt=second would be defined with qf=\"name\" and other params like mm.\nqt=third would be defined with qf=\"name2\" and other params like mm.\n\nBut I guess this is not possible since ALL the params are being loaded from including the 2 fq ones.\n\nIf you want you can close this, but it would be a nice feature.\n\nI would want it to work that each localParams are set by \"second\" and \"third\".  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13026951",
            "date": "2011-04-29T12:33:12+0000",
            "content": "Is it possible to have two QT parameters in the same call to Solr?\n\nNope, see the response from Hoss: \"qt selects the request handler used, but when local params are parsed the handler is has already been choosen (there is only one handler per request)\" "
        }
    ]
}