{
    "id": "SOLR-1236",
    "title": "stop using strings for filepaths and start using File objects",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "Catching up on my email after a long hiatus i notice SOLR-1213 and it reminded me that the last time i was digging arround in the code i was frustrated by lots of places in Solr where \"String\" instances to store a file or directory paths and then manipulated with String operations.  I would be nice to switch all of these member variables and and function params to use genuine File objects to improve the code base readibility, and reduce the likelyhood of OS variant bugs or nonsensical path operations.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12723076",
            "date": "2009-06-23T13:45:19+0000",
            "content": "True - but we need to also keep in mind places that some things may want to map to things other than a local file in the future...  for example, pointing to a resource such as a synonym file or other config that resides on HDFS or zookeeper. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13631163",
            "date": "2013-04-13T21:10:14+0000",
            "content": "SPRING_CLEANING_2013 JIRAS Anyone want to take this on or should we consider it closed? Probably still true. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15544184",
            "date": "2016-10-04T03:08:08+0000",
            "content": "I believe most of these should have been resolved with time and/or move to SolrCloud.\n\nClose the issue? If specific problems are still present, a new - more focused - issue could be created. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-15549149",
            "date": "2016-10-05T16:00:30+0000",
            "content": "I guess the question is whether we need a specific issue to focus on avoiding String and platform-specific representations of paths.  I think it will always be relevant to worry about this, but IMHO it's more of a general coding guideline than a specific issue.  That approach says we close this issue and check whatever documentation we have regarding coding practices.\n\nFile objects, the focus of this issue, are now thoroughly outdated.  Lucene has switched to NIO2, which utilizes Path.\n\nIf it hasn't been done already, then for both LUCENE and SOLR, I think we probably need to add File to the forbidden-api list to detect any unwanted stragglers and make sure the old APIs don't creep back in. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15549240",
            "date": "2016-10-05T16:32:37+0000",
            "content": "I get 77 files, when I run:\n\nack \"java.io.File;\" --type java --ignore-dir=\"test-framework\" --ignore-dir=\"test\" |wc -l\n\n\n\nI would say we are not ready for forbidden-api for this one. I am not sure if that means we should have a different issue(s) open for this discovery.\n\nBut the \"Strings\" issue is probably done as a specific \"next-action\" issue. If there is no further objections, I will close it. "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-15549249",
            "date": "2016-10-05T16:35:47+0000",
            "content": "https://issues.apache.org/jira/browse/SOLR-8282 is what you want there, I think.  I got stuck trying to get DirectoryFactories converted, but it can probably be picked up again. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15549263",
            "date": "2016-10-05T16:40:54+0000",
            "content": "Ok. Good to know. We are definitely well covered for this topic with other JIRAs then. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15557393",
            "date": "2016-10-08T06:47:33+0000",
            "content": "This issue is done. "
        }
    ]
}