{
    "id": "SOLR-9511",
    "title": "Retire using individual versions to request updates during PeerSync",
    "details": {
        "components": [],
        "type": "Wish",
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "7.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "We started using version ranges to request updates during PeerSync in SOLR-9207. Using version ranges was also made default.\n\nThere is no need to have code that uses individual versions start Solr 7. Decommission (remove unnecessary code)",
    "attachments": {
        "SOLR-9511.patch": "https://issues.apache.org/jira/secure/attachment/12831844/SOLR-9511.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-03T14:01:26+0000",
            "author": "Pushkar Raste",
            "content": "We are planning to set num records in ulog to a very high number. If that number is too high, leader may run into issues (throw OOM), when replica asks for high number of updates. In such a case we will have to request updates in chunks/batches. In preparation of that, we should keep PeerSync.requestVersions() logic simple. \n\nThis is ticket is to track effort for removing old way of using individual versions to request updates. ",
            "id": "comment-15542481"
        },
        {
            "date": "2016-10-03T14:01:38+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user praste opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/87\n\n    SOLR-9511, removed use of individual versions in PeerSync\n\n\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/praste/lucene-solr SOLR-9511\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/87.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #87\n\n\ncommit 8e6c96df4363c4c8e187ab7132c26305603d175e\nAuthor: Pushkar Raste <praste@bloomberg.net>\nDate:   2016-09-30T20:53:11Z\n\n    SOLR-9511, removed use of individual versions in PeerSync\n\n ",
            "id": "comment-15542482"
        },
        {
            "date": "2016-11-25T04:09:38+0000",
            "author": "Noble Paul",
            "content": "Do we have the individual versions API used anywhere?\n\nWe keep old APIs available for a few extra releases. The reason is  when you do a rolling restart after upgrading your solr version, some nodes will expect the old API to be available while the other node may not have it. So, what we need to do is to ensure that\n\n1) No code uses the old APi for the last 2 or 3 releases\n2) ensure that the \"upgrading from Solrx.x\" in CHNAGES.txt has the relevant information ",
            "id": "comment-15694774"
        },
        {
            "date": "2016-11-25T21:01:49+0000",
            "author": "Pushkar Raste",
            "content": "I don't think individual versions API is being used anywhere. \n\nI agree to keep old API around for may be another major version (8.X), but don't see much harm to get rid of it in 8.X itself as old API is there in 6.X and 7.X ",
            "id": "comment-15696682"
        },
        {
            "date": "2016-11-26T15:44:45+0000",
            "author": "Noble Paul",
            "content": "The option is to make this changes to trunk and not to branch_6x. The problem with that option is that the trunk diverges from the release branch a lot over time. This gives all of us a headache when applying changes across branches. I would choose to mark the methods as deprecated and remove it on both branches at once  ",
            "id": "comment-15698111"
        }
    ]
}