{
    "id": "SOLR-4169",
    "title": "The test suite should consistently pass",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Tests"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I'm at the end of my rope. \n\nLast week I tried to help with this: but its already wednesday and solr tests are 20x worse.\n\nUsers are complaining that they cannot get snapshots and test them, because the tests fail all the time.\n\nMaven dependencies are wrong, but we never knew, because the tests never succeeded so the validation task hasn't actually run in months.\n\nI think fixing this situation is a blocker to release: I can't imagine a bigger blocker actually.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Michael McCandless",
            "id": "comment-13530008",
            "date": "2012-12-12T14:57:11+0000",
            "content": "+1 "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13530018",
            "date": "2012-12-12T15:13:46+0000",
            "content": "+1\n\nMaybe especially problematic tests could be disabled, but coverage would still need to be fairly decent.\n\nAlso, put a hard limit of, say, 20 seconds per test. You could argue that even that is too generous. But if someone is going to run tests on an especially slow box, they should be able to raise that as needed.\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13530036",
            "date": "2012-12-12T15:35:12+0000",
            "content": "\nMaybe especially problematic tests could be disabled, but coverage would still need to be fairly decent.\n\nIf a test fails all the time it has 0% coverage. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530037",
            "date": "2012-12-12T15:37:07+0000",
            "content": "Many of the current fails are existing bugs that have been exposed in tests by recent changes. Im excited to see these fails! This is good stuff. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530040",
            "date": "2012-12-12T15:38:43+0000",
            "content": "If a test fails all the time it has 0% coverage.\n\nThats not true! This feedback and a variety of output from the fails over time is invaluable! Even knowing it can pass sometimes and not others is more valuable information. Call me sherlock holmes, but I love it. Such a help. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530052",
            "date": "2012-12-12T15:49:48+0000",
            "content": "One nice thing about all the jenkins now, pumping away all the time, is that it was really quick to be able to tell that I would have a lot easier time finding things using my windows VM - it seemed more fails happening there. I was able to determine that pretty quickly compared to how long (if ever) id have to wait in the old days!\n\nI also was able to tell a lot by the difference between 4x and 5x fails - again in a fairly short period of time.\n\nThis stuff is great! "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13530060",
            "date": "2012-12-12T16:05:18+0000",
            "content": "Im excited to see these fails!\n\nI don't agree. When I worked on SOLR-3855, I very often got errors from BasicDistributedZkTest.testDistribSearch, but I couldn't know whether I introduced a bug or if it was a random failure. This is very frustrating and can make us commit buggy stuff because we assume the bug is in the test. "
        },
        {
            "author": "selckin",
            "id": "comment-13530065",
            "date": "2012-12-12T16:16:29+0000",
            "content": "Also see issues like SOLR-2608 that are ignored, i've been running lucene tests in a loop on and off for periods, and basically gave up on solr tests aswel, they randomly fail all the time "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530066",
            "date": "2012-12-12T16:16:31+0000",
            "content": "Any test that catches a bug is good test to me! The bugs need to be fixed - I'd rather have complaints about them then not even know they are there!\n\nIndividuals can still locally ignore tests, use @slow, etc.\n\nSome of these fails take a while to track down, still others are introduced inadvertently over time in other code. \n\nIf any test is failing too often for you, you should make a JIRA issue and we can work down to the problem - that has generally worked out well. I usually have these test passing consistently in many jenkins envs or am otherwise working on making it so.\n\nIm still excited when existing bugs are unearthed by our tests - call me crazy!  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530071",
            "date": "2012-12-12T16:20:42+0000",
            "content": "Also see issues like SOLR-2608 \n\nThat issue was never ignored! Test replication handler has been exposing problems with a handler running after core shutdown for a long time. It has found many bugs that I have fixed!\n\nIn fact, I think Ive finally got that test near 100%. That ignored test has gotten a ton of my time this year - finally about to pay off. Sorry Im not as fast as Id like to be  Its in very good shape on 5x right now I think. The fact that the test passes 99% of the time says a lot even before - if it didnt run at all, we would just introduce more bugs.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530080",
            "date": "2012-12-12T16:31:10+0000",
            "content": "To add a bit of history:\n\nMost of these fails never would have been fails when most of this code was written. Back then, we didnt check for directories not being closed, we didnt run tests in parallel, tests ran once a day, we didn't have an awesome test framework that failed based on all these things.\n\nSo before, most of what randomly fails now, would not even have failed before.\n\nThe original coders for a lot of the tests and code failing had moved on to other things. It's taken time to slowly harden everything. SolrCloud and its jetty based tests introduced a new layer.\n\nMeanwhile, I do a lot of solr development and i find the tests very useful. If you need some help, please, ask me and I can lend you hand. \n\nThe tests have made great strides - I and a couple others are reducing the failures all the time. Sometimes they flair up due to some change or mix of changes - currently that is happening due to a couple issues that are well documented and attended to on the list. Real issues that need to be dealt with.\n\nThe random fails are not usually test issues - but nor are they always critical issues. In fact, most involve shutdown - an area we just have not cared a great deal about in Solr in the past. So what if shutdown wasnt perfect. SolrCloud changes that a bit.\n\nAnyhow, I put a lot of effort into improving the tests, and I know I've made a lot of ground, and will continue to do so. There are a lot of challenges. Like I said, Ive been in the Lucene world too, and the nature of it being a library without jetty or large integration tests really made it an breeze in comparison. Lucene also is lucky enough to have more people that are test fanatics at the moment. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530083",
            "date": "2012-12-12T16:37:33+0000",
            "content": "can make us commit buggy stuff because we assume the bug is in the test.\n\nBy the way, your in the same boat without the test - you would commit the same buggy code - you just would also have a possible false sense of comfort. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13530098",
            "date": "2012-12-12T16:53:01+0000",
            "content": "Back then, we didnt check for directories not being closed, we didnt run tests in parallel, tests ran once a day\n\nI agree with Mark that the restrictions put on tests have made it more difficult for the complex stuff to pass. And every Lucene/Solr committer should try to fix at least one Solr test to get the taste of how complex those tests are  These aren't necessarily regressions – they're existing weak spots uncovered by more rigorous test sandbox rules. \n\nThis said, I still think it'd be nice if we could somehow disable those tests that we know produce a lot of noise and only enable them on a build plan that would run with a specific e-mail prefix or with an entire different e-mail sink. Once somebody  decides they're ok to be included in all plans they can do so; if builds start to fail again – switch them back to the \"unstable\" zone. Much like in-progress branches, really. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13530104",
            "date": "2012-12-12T16:56:29+0000",
            "content": "\nAnd every Lucene/Solr committer should try to fix at least one Solr test to get the taste of how complex those tests are\n\nBut this isn't a good thing really. The tests shouldnt be complex to debug. its junit, they should be unit tests.\n\nmaybe these integration tests should be yanked out into a separate part of the build. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13530106",
            "date": "2012-12-12T16:58:50+0000",
            "content": "This would be an ideal situation, I agree. But then what would \"unit\" tests for Solr be?  "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13530107",
            "date": "2012-12-12T16:59:30+0000",
            "content": "By the way, your in the same boat without the test - you would commit the same buggy code - you just would also have a possible false sense of comfort.\n\nAgreed, but still this situation makes it hard for new Solr contributors like me to know whether their patchs are committable or not. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530110",
            "date": "2012-12-12T17:02:12+0000",
            "content": "I dont mind if integration tests were separate, but I dont think it would change too much. Youd still have to run them the same - I find them more important than unit tests for having any faith in the system. For me, unit tests are nice and super useful, integration tests are essential.\n\nThe main difference is that you could iterate in dev faster by just running faster unit tests and then run integration tests before committing.\n\nBut that seems the same as @slow to me now, so I don't think it buys much.\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13530112",
            "date": "2012-12-12T17:03:00+0000",
            "content": "\nThis would be an ideal situation, I agree. But then what would \"unit\" tests for Solr be?\n\nFor instance: tests that test a query parser can just create that QP, and do:\n\n\nQuery expected = ...\nassertEquals(expected, parser.parse(someString));\n\n\n\nJust like unit tests everywhere else.\n\nBut nobody writes solr tests this way (i dont know why, ive definitely written such unit tests for solr components before).\nInstead e.g. all the queryparser tests actually index documents and assert XPATH shit against the response.\n\nThis makes them significantly harder to debug for no good reason. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530115",
            "date": "2012-12-12T17:05:41+0000",
            "content": "makes it hard for new Solr contributors like me to know whether their patchs are committable or not. \n\nDude, I don't doubt you! I spent more time on tests this year than feature dev because of that very issue. But these tests are critically useful regardless. I cant help that - I can just keep helping make them hardier.\n\nAnd if contributors have questions about a fail, I can give some guidance depending on the test and fail.\n\nI mean, hopefully we get to very few fails - but its a constant moving battle. I feel like we have been gaining a lot of ground. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13530188",
            "date": "2012-12-12T18:33:43+0000",
            "content": "By the way: I want to make sure its clear I'm not trying to blame Mark here.\n\nI suspect he takes some of this personally because he is the main guy actually working on fixing these problems.\n\nI just opened an issue for the general problem that we need to stabilize the solr test suite so we can trust it.\n\nPart of that means that more people than Mark have to somehow be involved fixing this stuff. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13530528",
            "date": "2012-12-13T00:18:34+0000",
            "content": "But then what would \"unit\" tests for Solr be? \n\nIn the longer-term, heavy use of mocking.\n\nWhatever value Mark finds in the current tests (which is real and significant), mocking with a wider range of behavior (including randomized behavior) of dependencies would increase the value of Solr testing by orders of magnitude.\n\n\nFull integration tests certainly do have real value, and a hybrid of some mocking and some real dependencies would give the best of both worlds. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530628",
            "date": "2012-12-13T03:07:19+0000",
            "content": "Unit tests are great. IMO, all tests are great.\n\nBecause system tests are what the user will see (he doesn't care much if the components work in isolation, he needs them to work togther), they are what I personally prioritize. Unit tests are important as well, and can help in debugging. We have some of these tests in the code base but, like all tests, not as many as we'd like. If anyone is volunteering to write some, please do!\n\nI've always like Apache because it's really about getting work done - if someone wants to see something, jump in with a shovel.\n\nI just committed some new tests using easymock that Per wrote (today or yesterday, I don't remember). We will happily take test patches! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13531099",
            "date": "2012-12-13T15:32:46+0000",
            "content": "While we're discussing the way things should ideally be.... if I had my way, we wouldn't need tests because people wouldn't add bugs \n\nThe labels of \"integration\" or \"unit\" don't really matter much here - they are all important and need to be run.\nIntegration tests are needed to ensure things work more full-stack.  Lower level tests can be useful to either test more combinations quickly, or for an aid in debugging.  Tests that are too low level can also be a maintenance nightmare too, because they assert current implementation details you don't really care about. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13531206",
            "date": "2012-12-13T17:20:12+0000",
            "content": "The truth on Solr tests is that way more people than just me have been making them a lot better for a long time now. It's tended not to be a noisy affair - a lot more slow and steady grinding than talking. The best thing you can do for Solr tests if you are interested them is lend a hand. \n\nLike I said, it's been a long battle - but the pay off is much nearer than someone with a 30k view might think. We have made tremendous progress. I don't have to convince you - the tests will end up speaking for themselves. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717142",
            "date": "2013-07-23T18:47:15+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971240",
            "date": "2014-04-16T12:57:32+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}