{
    "id": "SOLR-5108",
    "title": "plugin loading should fail if mor then one instance of a singleton plugin is found",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Continuing from the config parsing/validation work done in SOLR-4953, we should improve SolrConfig so that parsing fails if multiple instances of a \"plugin\" are found for types of plugins where only one is allowed to be used at a time.\n\nat the moment, SolrConfig.loadPluginInfo happily initializes a List<PluginInfo> for whatever xpath it's given, and then later code can either call List<PluginInfo> getPluginInfos(String) or PluginInfo getPluginInfo(String) (the later just being shorthand for getting the first item in the list.\n\nwe could make getPluginInfo(String) throw an error if the list has multiple items, but i think we should also change the signature of loadPluginInfo to be explicit about how many instances we expect to find, so we can error earlier, and have a redundant check.",
    "attachments": {
        "SOLR-5108.patch": "https://issues.apache.org/jira/secure/attachment/12598841/SOLR-5108.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13726739",
            "date": "2013-08-01T18:54:23+0000",
            "content": "Sounds like this might resolve SOLR-4304 - \"NPE in Solr SpellCheckComponent if more than one QueryConverter\". "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13744142",
            "date": "2013-08-19T19:51:44+0000",
            "content": "Jack: I think it will sort of \"fix\" SOLR-4304 in that i think I can make it so that instead of getting an NPE at request time, you'll get an error on startup that you can't have multiple queryConvertors.\n\nbut in general the way queryConvertors are configured/initialized seems to be a giant pile of crap – i'll post more details in SOLR-4304 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13744292",
            "date": "2013-08-19T21:42:33+0000",
            "content": "patch...\n\n\n\trequires usage of loadPluginInfo to specify if multiple PluginInfo instances are expected else error\n\tmakes getPluginInfo fail if multiple PluginInfo instances exist\n\tadds a test for a good error if multiple instances of directoryFactory are found (as an example)\n\tfixes a bug in solrconfig-test-misc.xml that actually did have redundent directoryFactories configured.\n\n "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13745090",
            "date": "2013-08-20T16:02:39+0000",
            "content": "Commit 1515852 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1515852 ]\n\nSOLR-5108: fail plugin info loading if multiple instances exist but only one is expected "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13745101",
            "date": "2013-08-20T16:30:01+0000",
            "content": "Commit 1515859 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1515859 ]\n\nSOLR-5108: fail plugin info loading if multiple instances exist but only one is expected (merge r1515852) "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787039",
            "date": "2013-10-05T10:18:53+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}