{
    "id": "SOLR-3596",
    "title": "Backport of SOLR-141 to 3.x",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "This is an attempt at a backport of the functionality introduced with SOLR-141 I don't necessarily expect many more 3.x releases but it at least makes error reporting a bit better on 3.x",
    "attachments": {
        "SOLR-3569-Backport-of-SOLR-141-Better-exception-handling.patch": "https://issues.apache.org/jira/secure/attachment/12535282/SOLR-3569-Backport-of-SOLR-141-Better-exception-handling.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13407585",
            "date": "2012-07-05T23:17:37+0000",
            "content": "\nif/when 3.6.1 comes out it should only have bug fixes, and i don't think SOLR-141 can be justifiably called a bug fix.\n\nIn particular i'm worried about people who have applications that are relying on the eccentricities of pre SOLR-141 HTTP response, and that upgrading from 3.6->3.6.1 might not be trivial for them, which would either mean sacraficing other 3.6.1 fixes, or changing their own code. "
        },
        {
            "author": "Greg Bowyer",
            "id": "comment-13407588",
            "date": "2012-07-05T23:24:18+0000",
            "content": "I somewhat agree, I dont think this should be included in 3.6.1 (if/as that appears), I have a need for this fix and as such I only put it on jira should others need to apply this patch. Maybe if there is a point release to 3.7 I would sing a slightly different tune, but I dont expect a 3.7. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13407594",
            "date": "2012-07-05T23:27:35+0000",
            "content": "I have a need for this fix and as such I only put it on jira should others need to apply this patch. \n\nAh ok ... in that case i would just put it as (clearly named) an attachment in SOLR-141 so it's easy to find if people in a similar situation go looking for it. "
        },
        {
            "author": "Greg Bowyer",
            "id": "comment-13407595",
            "date": "2012-07-05T23:28:31+0000",
            "content": "Good idea, I will do that "
        },
        {
            "author": "Greg Bowyer",
            "id": "comment-13407597",
            "date": "2012-07-05T23:29:15+0000",
            "content": "Patch moved to the original issue SOLR-141 "
        }
    ]
}