{
    "id": "SOLR-75",
    "title": "XSLT-based \"Schema Browser\" in admin view",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The files in this upcoming patch create a simple \"schema browser\" for the admin tool.  It serves schema.xml along with a stylesheet that in compliant browsers creates a page with a tree widget to show the fieldtypes and fields, as well as their uses and cross references.  This is similar to the schemaxsl.zip originally attached to SOLR-58, but a few features have been added, and the look and feel has been changed to fit in better with the rest of the admin tool.\n\nNote that it does not work against the live IndexSchema – it merely transforms schema.xml.  There is probably not a significant difference now, but it is worth raising the issue in case there are future administration capabilities in mind (i.e. on http://wiki.apache.org/solr/MakeSolrMoreSelfService ) that might require a schema browser to be talking to the live values.",
    "attachments": {
        "closed.gif": "https://issues.apache.org/jira/secure/attachment/12345994/closed.gif",
        "schemav2sample.zip": "https://issues.apache.org/jira/secure/attachment/12346961/schemav2sample.zip",
        "solr75v1.diff": "https://issues.apache.org/jira/secure/attachment/12345993/solr75v1.diff",
        "open.gif": "https://issues.apache.org/jira/secure/attachment/12345995/open.gif"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Greg Ludington",
            "id": "comment-12454247",
            "date": "2006-11-29T07:51:57+0000",
            "content": "XSLT and jsp changes to allow schema.xml to be explored via a DHTML tree widget, with some cross referencing of fields and fieldtypes according to their usages.\n\n\n\tChanges get-file.jsp so that it serves a content type of text/xml for files ending in .xml\n\n\n\n\n\tDynamically inserts an xsl declaration in the requested xml (e.g. schema.xml) if an xsl request parameter is present.  (It unfortunately stuffs more code in get-file.jsp, but the alternative would be to force users to modify their schema.xml to add this declaration, which would be worse for several reasons.)\n\n\n\n\n\tAdded a schema.xsl to perform the actual transformation, as well as icons to represent the open and closed states of the folder.\n\n\n\nI have not checked the \"grant license\" option primarily because of those icons.  As credited in the XSL, I took the icons as well as adapted the tree javascript from this old DevX article:\n\nhttp://www.devx.com/getHelpOn/Article/11874\n\nThere is no license at all on the article or on the code from that article, but I do not know ASF's policy on the use of such assets, as I cannot claim to have created them.  If these are unsuitable, I have written many versions of these sorts of scripts, and I could rewrite that party easily enough, but I am not a graphic artist.\n\nOnce those issues are cleared, or suitable replacements are found, I would be happy to resubmit and grant license to the patch.  In the meantime, I have submitted the code so people can take a look at it, and, if you find it useful, hopefully to test the XSLT and CSS on more browsers that I have at hand. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12456253",
            "date": "2006-12-06T23:14:16+0000",
            "content": "I really haven't had the time to play with this that i hoped i would (i was really hoping to try and tweak it to add some logic to pull all of the fieldtype attributes into the field, and add some links from this tool out to the analysis page as well) but I just wanted to go on record that i think it's really cool.\n\nGreg: if you are interested, one way to avoid the issues with get-files and the stylesheet hearder would be to write a new JSP and/or servlet just for powering the schema explorer that applies the transformation on the server side – it should be fairly easy with the XSL Transform utility methods Bertrand added to support the XSLTResponseWriter. ... then we don't have to require the files have the correct stylesheet declaration, or inject the one we want, or rely on the browser to apply it properly.\n\nAs for the license issues ... i don't think we can use those images or any javascript you cut/paste from the article ... but i could be wrong.  if there are similar methods you can find that have an Apache compatible license, we should definitely be able to use those. "
        },
        {
            "author": "Greg Ludington",
            "id": "comment-12456285",
            "date": "2006-12-07T02:43:44+0000",
            "content": "(Sent in email earlier, but adding it to the JIRA issue proper)\n\nI do not know if you have seen the update, as opposed to the one\noriginally attached to an earlier JIRA issue, but this one should\ninclude every attribute in a field or fieldtype – the \"attributes\"\ntable should contain every attribute of the node.  Also, I included\n(via cut-and-paste) the basic analysis form, so that it shows for each\nfield (and submits to analysis.jsp) as well.  If these do not fit what\nyou need, and do not have time to take a further look, I would be\nhappy to take suggestions for tweaks.\n\nI thought about doing the transformation server-side as well, but I\nstuck client-side because other admin pages rely on client-side\ntransformation.  I can rework it as a server-side transformation, if\nthat is preferable.  The only downsides to server-side approach would\nbe the extra (likely insignificant) burden on the server, and the size\nof the page – the transformed HTML will be an order of magnitude\nlarger than the XML.\n\nAs for the licensing, I did modify the code from an article, but it is\nstill largely intact.  I could easily write javascript that is\nentirely free of the original article code, and/or contact the\noriginal author for explicit permission.  As for the icons – I am not\nmuch of a graphic artist.  I could also rewrite the tree to use\ncharacters instead, unless somebody can locate license free icons, or\nperhaps the people redoing SOLR-76 could also create new icons of that\nsize?  (The XSL in this issue shares the base admin.css, so we may\nhave to rework the XSL to take SOLR-76 into account.)  If it is\npermissible, I think it would be better to use the original code and\ncredit the author, both to give the original author deserved credit\nfor his idea and to minimize duplication of work on our parts  "
        },
        {
            "author": "Bertrand Delacretaz",
            "id": "comment-12456316",
            "date": "2006-12-07T08:06:17+0000",
            "content": "The tango icons (http://tango.freedesktop.org) could be used I think.\n\nAs mentioned at the bottom of http://tango.freedesktop.org/Tango_Desktop_Project, they are licensed under the Creative Commons Attribution Share-Alike license, which I think is acceptable for us to redistribute (although there is no black/white policy on this yet at the ASF, see [1] and [2]).\n\n[1] http://mail-archives.apache.org/mod_mbox/www-legal-discuss/200610.mbox/%3Cc5e632550610270807qad46ffaodc4d65703676608f@mail.gmail.com%3E\n[2] http://www.apache.org/legal/3party.html\n "
        },
        {
            "author": "Greg Ludington",
            "id": "comment-12457579",
            "date": "2006-12-12T05:17:59+0000",
            "content": "An updated sample, including feedback about fieldtype->field inheritance.  It presumes that:\n\na) a field can inherit any attribute from a field type\nb) a field cannot override analyzers (or any other child node), only attributes. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13289027",
            "date": "2012-06-05T00:47:18+0000",
            "content": "Please close this. "
        }
    ]
}