{
    "id": "SOLR-6537",
    "title": "A uLogDir configured outside of dataDir is not cleaned up by CoreAdmin UNLOAD",
    "details": {
        "affect_versions": "4.10",
        "status": "Open",
        "fix_versions": [
            "5.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "If one has defined a uLogDir which is not inside the dataDir then the CoreAdmin#UNLOAD call will not clean it up.",
    "attachments": {
        "SOLR-6537.patch": "https://issues.apache.org/jira/secure/attachment/12669781/SOLR-6537.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Varun Thacker",
            "id": "comment-14139397",
            "date": "2014-09-18T19:53:44+0000",
            "content": "Patch with a test case.\n\nI think we could remove the creation of a new CloudServer client for every test case under DeleteReplicaTest and use the instance variable 'client' . Just wanted to get an opinion before removing it. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14139421",
            "date": "2014-09-18T20:08:24+0000",
            "content": "The CoreAdmin Unload documents 'deleteInstanceDir' as \"If true, removes everything related to the core, including the index directory, configuration files and other related files.\".\n\nCan we not use that and just clean up uLogDir if deleteInstanceDir is set? Adding more granularity just increases complexity. We might also want to delete the uLogDir when 'deleteDataDir' is set to true. It makes sense to cleanup the uLogDir when the data directory is being deleted. "
        },
        {
            "author": "Varun Thacker",
            "id": "comment-14140099",
            "date": "2014-09-19T06:48:59+0000",
            "content": "Yeah nice idea to piggy back on instanceDir and not introduce more options.\n\nPatch which removes uLogDIr when deleteInstanceDir=true "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14140183",
            "date": "2014-09-19T08:37:51+0000",
            "content": "Thanks for putting this up Varun. The patch looks fine to me other than one small thing, there isn't really anything that's changed in OverseerCollectionProcessor so it'd be best to not have that in the diff.\nI'll work on this tomorrow morning as before anything else, DeleteReplicaTest failures on trunk have to be handled. It fails for me always and is also currently failing on Jenkins. Might be the 4x->5x + back-port stuff but I'd need to look. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14141340",
            "date": "2014-09-19T21:32:10+0000",
            "content": "You're trying to set core level (uLogDir, instanceDir, dataDir) properties while creating the collection on the same machine and the same directory. That's leading to failure in core creation due to conflict.\nYou might want to look at creating a collection without those properties and then adding a core with those properties (for the purpose of testing this) or perhaps just create a collection with a single core (1 shard, 1 replica) and delete that. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14141392",
            "date": "2014-09-19T22:05:11+0000",
            "content": "An updated patch with a working test. I need to spend just some more time on this to clean it up and make variable names better. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14141399",
            "date": "2014-09-19T22:07:06+0000",
            "content": "Removed an unwanted logging from in there. "
        },
        {
            "author": "Varun Thacker",
            "id": "comment-14141955",
            "date": "2014-09-20T12:51:27+0000",
            "content": "Made 1 additional change - Reused the CloudSolrServer client across both the tests. No need to create it again in the individual tests "
        },
        {
            "author": "Varun Thacker",
            "id": "comment-14141969",
            "date": "2014-09-20T13:33:48+0000",
            "content": "Anshum Gupta I just realized that in the test you changed the collection call from a CollectionsAPI call to a CoreAdmin call. Does it make sense to be a cloud test anymore? "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14142122",
            "date": "2014-09-20T17:24:40+0000",
            "content": "Varun Thacker The core admin call is in addition to the 'createCollection' and the 'deletereplica'. It's good to test that as DeleteReplica uses CoerAdminUnload. We could add another non-cloud test that just validates a CoreAdmin UNLOAD working as expected too. "
        }
    ]
}