{
    "id": "SOLR-3885",
    "title": "audit solr DocumentBuilder logic & tests",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Spun off of SOLR-3875: it would be good to audit DocumentBuilder carefully and ensure that there are adequate tests for the various edge cases (ie: docboosts, copyfield, multivalued fields, various combinations of, etc..) and special types of fields (ie: polyfields).\n\nThere also seems to be some dead code here that can likely be cleaned up.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13462270",
            "date": "2012-09-24T23:52:35+0000",
            "content": "assigned to myself to keep it on my radar, but anyone else interested should feel free to take it from me. "
        },
        {
            "author": "Toke Eskildsen",
            "id": "comment-13482240",
            "date": "2012-10-23T09:56:04+0000",
            "content": "It seems that there are indeed problems with copyFields and that it is a blocker for using docBoosts with the standard practice catch-all copyField. I have updated SOLR-3875 with a description of the problem. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13593871",
            "date": "2013-03-05T20:29:42+0000",
            "content": "The current standing is that DocumentBuilder.toDocument has fairly decent test coverage except for a few error case conditions.  It's only the non static \"iterative\" use methods – which are not used anywhere in the solr code – that are lacking decent test coverage.\n\nSeveral months ago, i worked up a patch to deprecate & remove the unused methods, but aparently i never uploaded/commited that patch, and can't find it on my computer.\n\nOver in SOLR-4329, Smiley is currently working to revamp the logic of how DocumentBuilder works to better support complex FieldTypes, so it doesnt' seem prudent to try and recreate my previous work at the moment – let's see how things shape up there.  (Even if we decide not to more forward with that proposal, I just noticed there is also SOLR-4167 to explicitly track cleaning up those unused methods)\n\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717410",
            "date": "2013-07-23T18:48:09+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971306",
            "date": "2014-04-16T12:57:44+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}