{
    "id": "SOLR-6767",
    "title": "Improve user experience when starting Solr in standalone mode using scripts",
    "details": {
        "components": [
            "Admin UI",
            "scripts and tools"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Implemented",
        "priority": "Major"
    },
    "description": "As of now, starting Solr in standalone mode using './solr start' starts up Solr without any core. Trying to create a core from coreadmin UI doesn't work and errors out (when using defaults).\nError CREATEing SolrCore 'new_core': Unable to create core [new_core] Caused by: Can't find resource 'solrconfig.xml' in classpath or '/lucene-solr/solr/server/solr/new_core/conf'\n\nThe only way to get it to work would be to use the /server/<configset> directory to be the instance directory and then, the core creation would create unwanted  directories in there. The only way to clean that up being, \n\n> rm -rf .. ; svn up # (if it's a repo check out).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-11-20T00:12:51+0000",
            "author": "Anshum Gupta",
            "content": "The scripts work fine as they use configSet param while creating the core. Here are 2 things that (together) might help:\n1. Support specifying the configset in the admin UI.\n2. Like in SolrCloud mode, copy the root server directory to another directory (node?) and run the node off it. That would ensure that the checkout stays clean when using the schema-less mode. ",
            "id": "comment-14218760"
        },
        {
            "date": "2014-11-20T00:21:45+0000",
            "author": "Timothy Potter",
            "content": "you can also do: bin/solr create_core -n new_core\n\nSupport specifying the configset in the admin UI.\n+1 ... We definitely need to add support for configSets in the UI\n\nfor #2 - maybe just use a different Solr home? bin/solr start -s foo (we could fix the script to create foo and foo/solr.xml on-the-fly) \n ",
            "id": "comment-14218773"
        },
        {
            "date": "2014-11-20T02:06:48+0000",
            "author": "Erick Erickson",
            "content": "+1 to adding support for configsets in the admin UI.\n\nThat said, though, when  starting Solr up from scratch: \n\nbin/solr start -e techproducts\n\nstarts up a Solr, creates a core called \"techproducts\" and indexes the sample docs. So perhaps we could call this out more explicitly in the docs?\n\nI've been tripping over trying to do things that I used to do before the directories were restructured and being surprised, only to discover that there's usually a new way to do what I want.\n\nI'm soooo glad that the default \"collection1\" is gone and that we're introducing people to how things work re: collections/cores and creating them though.\n\n\"It's not the things you don't know that'll kill ya, it's the things you do know that ain't so\"  \n ",
            "id": "comment-14218895"
        },
        {
            "date": "2014-11-25T13:48:47+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I find the new cores/collections being created under server/solr to be quite problematic. I think that directory should be mostly unchanged (maybe log files). The new examples should be created in the example directory. ",
            "id": "comment-14224544"
        },
        {
            "date": "2014-12-01T23:03:28+0000",
            "author": "Timothy Potter",
            "content": "I committed a fix that affects this. Now, when you do:\n\n\nbin/solr -e techproducts\n\n\n\nThe script does the following when creating the techproducts core:\n\nmkdir -p server/solr/techproducts\ncp -r server/solr/configsets/sample_techproducts_configs/conf server/solr/techproducts/conf\n\n\n\nThis leaves the configsets/sample_techproducts_configs untouched.\n\nI believe adding some UI support for the configsets is a must-have for 5.0 release. Ideally, the user will be able to go to the Admin UI and create a new core by only providing a name and selecting a configset from a drop down. ",
            "id": "comment-14230647"
        },
        {
            "date": "2016-08-03T15:49:16+0000",
            "author": "Alexandre Rafalovitch",
            "content": "bin/solr scripts have been updated several times now to provide an improved user experience.\n\nThe additional need for Admin UI to support configset should probably be a new issue (or offshoot of SOLR-8136) for which this discussion no longer makes sense. ",
            "id": "comment-15406104"
        },
        {
            "date": "2016-08-09T14:15:30+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Implemented in other JIRAs for more specific issues. Nothing else is happening on this one. ",
            "id": "comment-15413580"
        }
    ]
}