{
    "id": "SOLR-8446",
    "title": "Allow failonerror to be configured for unit tests",
    "details": {
        "components": [
            "Tests"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Currently, failonerror is hard coded to false for the \"test\" task at the top level scope.  For jenkins runs, it would be useful to be able to configure this because:\n1) unit tests runs are flaky\n2) jenkins can detect test failures even if the the test task itself passes and mark the build yellow (which happens if failonerror is true)\n\nTherefore, this allows some nicer visualization of the jenkins history, i.e.:\ngreen if everything is good\nyellow if unit tests are failing (most likely flaky)\nred if compile / precommit, etc are broken",
    "attachments": {
        "SOLR-8446.patch": "https://issues.apache.org/jira/secure/attachment/12778652/SOLR-8446.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-19T02:13:52+0000",
            "author": "Gregory Chanan",
            "content": "Here's a trivial patch that makes failonerror configurable for the top-level \"test\" task.\n\nThis works for the use case above but depending on what you want to happen, you need to understand the ant structure a bit.  For example:\n1) If the test task fails, no test report will be generated.  So you may have to specify -Dtests.ifNoTests=ignore as well or the task will still fail.  If all the lucene tests pass and the solr tests fail (or visa versa), the task will succeed even without specifying -Dtests.ifNoTests=ignore because the passing subdir will generate the report.\n2) This setting affects the entire task, so calling \"ant test\" can pass even if say, compilation is broken.  You may want to specify something like \"ant compile compile-test test\" or similar to avoid this. ",
            "id": "comment-15065158"
        }
    ]
}