{
    "id": "SOLR-1557",
    "title": "shards param not parsed as a multivalue param",
    "details": {
        "affect_versions": "1.4",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "the shards param currently uses some odd parsing code to split on \",\" ... it should both allow whitespace, and allow the shards to be specified as a multi-valued param...\n\nhttp://old.nabble.com/Shards-param-accepts-spaces-between-commas--to25962879.html#a25962879",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12777149",
            "date": "2009-11-12T19:51:07+0000",
            "content": "I wouldn't call it odd - it's the same well defined splitting code used in a few places in solr.\nI'd also be against allowing whitespace, if it weren't for Jason's interesting use-case... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12777168",
            "date": "2009-11-12T20:30:09+0000",
            "content": "I wouldn't call it odd - it's the same well defined splitting code used in a few places in solr.\n\n...hmmm, it seemed odd to me.\n\nSolrPluginUtils.split(String) was designed for splitting params that were delimited (it's what \"fl\" uses) ... The shards param is using StrUtils.splitSmart() which handles quoting and backslash escape characters – neither of which really make sense for a list of URLs.\n\nI'm totally fine with not allowing whitespace if you had a compelling reason for excluding it – i've been vocally opposed to supporting comma delimited values for things like this anyway but we need to leave it for back compatibility – my main concern is that we start supporting \"shard\" it as a multivalued param. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12777185",
            "date": "2009-11-12T21:03:08+0000",
            "content": "Some things make more sense as multi-valued (from the HTTP arg perspective) than others.\nI hope everyone can agree that allowing \"fl\" to be multivalued is overkill.\nOther things like \"fq\" make perfect sense due to the independence of the parameters and the escaping that would be needed to shove multiple in a single param.\nI'm not sure I see the need or the benefit for \"shard\" to be multivalued though. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12777321",
            "date": "2009-11-13T01:35:33+0000",
            "content": "I'm not sure I see the need or the benefit for \"shard\" to be multivalued though.\n\nthe simplified specification of defaults in solrconfig.xml seems like reason enough.\n\nbut it also seems like the \"defaults\" vs \"appends\" distinction of multivalued params makes as much sense for shards as it does does for fq, etc...  ie: i want this shard to always be appended to the shards list because it's the \"current\" shard, but let the client specify additional shards if they want to also query older/alternate content in addition. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872495",
            "date": "2010-05-27T22:06:32+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043754",
            "date": "2011-06-03T16:46:53+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106392",
            "date": "2011-09-16T14:50:52+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237065",
            "date": "2012-03-23T20:31:38+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13294747",
            "date": "2012-06-14T00:16:01+0000",
            "content": "Removing fix version since this issue hasn't gotten much attention and doesn't appear to be a priority for anyone.  \n\nAs always: if someone wants to take on this work they are welcome to do so at any time and the target release can be revisted "
        }
    ]
}