{
    "id": "SOLR-2416",
    "title": "Solr Cell fails to index Zip file contents",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Resolved",
        "fix_versions": [
            "6.0"
        ],
        "components": [
            "contrib - DataImportHandler",
            "(1)",
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "Working with the latest Solr Trunk code and seems the Tika handlers for Solr Cell (ExtractingDocumentLoader.java) and Data Import handler (TikaEntityProcessor.java) fails to index the zip file contents again.\nIt just indexes the file names again.\nThis issue was addressed some time back, late last year, but seems to have reappeared with the latest code.\n\nJira for the Data Import handler part with the patch and the testcase - https://issues.apache.org/jira/browse/SOLR-2332.",
    "attachments": {
        "SOLR-4216.patch": "https://issues.apache.org/jira/secure/attachment/12653220/SOLR-4216.patch",
        "SOLR-2416_ExtractingDocumentLoader.patch": "https://issues.apache.org/jira/secure/attachment/12473188/SOLR-2416_ExtractingDocumentLoader.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jayendra Patil",
            "id": "comment-13004761",
            "date": "2011-03-09T19:51:00+0000",
            "content": "Fix attached. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13008269",
            "date": "2011-03-18T01:27:05+0000",
            "content": "I'm not sure what exactly jayendra is referring to by \"was addressed some time back ... seems to have reappeared\" (i couldn't find any issues that looked similar) but i just tested and confirmed that in 1.4.1 SolrCell only indexed the metadata about *.zip files, not the contents of the zip.\n\nthe behavior in the 3.1rc1 solr release candidate is consistent with 1.4.1 - only info about the zip file itself is extracted, not the contents (although in 3.1 we actually extract more metadata then we did in 1.4.1) so this definitely isn't a 3.1 blocker (some people were wondering on IRC)\n\nI'm not personally even clear if this is really a bug, or if it should be request option driven – perhaps some users only want the data about the zip file, not it's contents; and what should the beahvior be if zip file contains multiple files, and the request specifies a literal id? "
        },
        {
            "author": "Jayendra Patil",
            "id": "comment-13008284",
            "date": "2011-03-18T02:13:28+0000",
            "content": "This issue existed in Solr 1.4 packaged with Tika 0.4, which prevented us from using the stable version.\n\nThread - http://lucene.472066.n3.nabble.com/Issue-Indexing-zip-file-content-in-Solr-1-4-td504914.html\nThe issue was resolved with the Tika 0.5 upgrade @ https://issues.apache.org/jira/browse/SOLR-1567\n\nWe are working on a Snapshot of Solr Trunk 4.X marked around 15 August 2010, which uses the Tika 0.8 snapshot jars, and the extraction works fine for us.\nHowever, with the latest Trunk upgraded to the stable release of Tika 0.8, it does not have the same behaviour. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043861",
            "date": "2011-06-03T16:47:26+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106271",
            "date": "2011-09-16T14:50:20+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13176371",
            "date": "2011-12-28T00:13:33+0000",
            "content": "If we add this, the behavior should probably be parameter driven. Some questions arises:\na) What to do with metadata? Should meta data for all files in the ZIP be added to the document? What's Tikas default?\nb) How do you present the title of such a document consisting of multiple docs from ZIP? Each individual document has its own title metadata...\nc) Do you always want to traverse all files in the ZIP or only some types?\nd) What do you do when a ZIP contains another ZIP?\n\nAll in all, perhaps this isn't such a useful feature after all? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13188206",
            "date": "2012-01-18T02:19:15+0000",
            "content": "Unless I get good answers to the questions above, I'll close this as \"Not a problem\" "
        },
        {
            "author": "Jayendra Patil",
            "id": "comment-13188616",
            "date": "2012-01-18T18:53:16+0000",
            "content": "Tika parsers the zip file and extracts the complete content of the files as well.\nIt parsers all the files in the zip as well as the the zip in zip.\nThe metadata is the zip file rather than the individual files\n\nThere would be no special handling required from the Solr side.\nThe metadata for the Zip and its contents would be indexed as well.\n\nAlso, Solr doesn't allow attaching multiple files with a single document.\nZip is a nice way of associating a document with multiple files.\n\nAnd, as in the current behavior of indexing zip with just the file names doesn't have much value in it. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13188628",
            "date": "2012-01-18T19:10:43+0000",
            "content": "I see. Perhaps we should make \"recursive parsing\" a config option, so people can choose?\n\nAlso, according to http://wiki.apache.org/tika/RecursiveMetadata the parser passed to the context is the parser used to parse inner files. Your patch assumes that is always AutoDetectParser, but in the case someone passes stream.type=application/zip, you'll be lost. So perhaps a better way is to create a new AutodetectParser to pass to the context.\n\nWould you like to attempt a new patch with this fix as well as controlling it via a config parameter, e.g. recurseContainers=true?\n\nPlease also add a JUnit test case to the patch to verify the fix. "
        },
        {
            "author": "Jayendra Patil",
            "id": "comment-13188648",
            "date": "2012-01-18T19:25:05+0000",
            "content": "sure .. will try to check on this. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237076",
            "date": "2012-03-23T20:31:41+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412180",
            "date": "2012-07-11T22:26:14+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13422184",
            "date": "2012-07-25T12:02:52+0000",
            "content": "Moving to 5.0. If anyone wants this in as an option for Solr4, we welcome patches  "
        },
        {
            "author": "Maciej Lizewski",
            "id": "comment-13546719",
            "date": "2013-01-08T09:09:09+0000",
            "content": "I think this is really needed feature. Also in earlier versions of Solr it worked different than now: grepping code of org.apache.solr.handler.extraction.ExtractingDocumentLoader from version 1.4.0.1 show that context was not created and instead autoDetectParser::parse function was called with 3 parameters (without context) and this caused context to be automatically created with Parser=autoDetectParser...\nthis is backward compatibility violation after adding PasswordProvider. Also comments in current code suggest that someone was not sure about consequences of such change: \"TODO: should we design a way to pass in parse context?\"\n\nthe patch is already attached as I see... "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13547308",
            "date": "2013-01-08T21:38:58+0000",
            "content": "As far as I can see, this behaviour has been consistent over several years and versions, seemingly unrelated to PasswordProvider change for v4.0. Thus there are probably more Solr users expecting today's behavior than the pre 1.4.1 one.\n\nAs with open source in general, features are added by real world needs, by contributors who want to help. If you need this feature for your company, the first thing to do would be to test the attached patch, add configuration param for enabling/disabling, add JUnit tests and work step by step towards a mature patch. "
        },
        {
            "author": "Steve Molloy",
            "id": "comment-14048048",
            "date": "2014-06-30T19:55:56+0000",
            "content": "Patch including parameter to make behavior optional. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16067311",
            "date": "2017-06-28T21:56:37+0000",
            "content": "Steve Molloy you filed the last patch for this, and it is really small and contained. Are you able to write a unit test and a CHANGES entry to make this ready for final review and commit? I'm happy to commit this for 7.x once it is ready. "
        },
        {
            "author": "Tim Allison",
            "id": "comment-16084599",
            "date": "2017-07-12T20:10:58+0000",
            "content": "This should have been fixed by SOLR-7189, no?  Or am I confusing DIH and Solr Cell?\n\nIn Tika 1.15 (TIKA-2096), we changed the default behavior to add an embedded parser if a user fails to pass one in via the parse context.  So, if we upgrade to Tika 1.16 (just out), this will be fixed, too.  We'll probably want to let Solr users configure turning off embedded document handling... "
        },
        {
            "author": "Tim Allison",
            "id": "comment-16084606",
            "date": "2017-07-12T20:13:40+0000",
            "content": "For more fun with embedded docs, see the issue on adding the RecursiveParserWrapper's behavior to Solr – SOLR-7229 .  This would create a separate Solr document for each document embedded in the zip (perhaps child documents?). "
        },
        {
            "author": "Markus Schuch",
            "id": "comment-16458950",
            "date": "2018-04-30T19:39:31+0000",
            "content": "I just tested ZIP extraction with 7.3.0 and i can confirm that due to the new default behavior of Tika 1.15+ the Extracting Request Handler extracts the text of the embedded documents as well and not only the file names as stated in the issue description.\n\nSo this was fixed with SOLR-10335. "
        }
    ]
}