{
    "id": "SOLR-12439",
    "title": "Switch from Apache HttpClient to Jetty HttpClient which offers a single API for Async, Http/1.1 Http/2.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-03T09:38:53+0000",
            "content": "Just for the record, so does Apache HttpClient 5.0.\n\nOleg  ",
            "author": "Oleg Kalnichevski",
            "id": "comment-16499350"
        },
        {
            "date": "2018-06-04T04:59:04+0000",
            "content": "Yeah, I looked at 5, but it is was still in beta. I saw a separate async project but did not look into whether 5 was incorporating that. For a variety of reasons, the Jetty HttpClient fits our needs very well and these features have been out for some time maturing. I've had a much nicer experience than with Apache HttpClient in the past. ",
            "author": "Mark Miller",
            "id": "comment-16499741"
        },
        {
            "date": "2018-06-04T06:59:24+0000",
            "content": "I am not asking you to reconsider your decision. I could not care less what HTTP transport Sorl ends up using, given I am not a Solr user. However the reason for switching from Apache HttpClient to Jetty stated in this issue is misleading and factually incorrect.\n\nOleg   ",
            "author": "Oleg Kalnichevski",
            "id": "comment-16499825"
        },
        {
            "date": "2018-06-04T13:38:05+0000",
            "content": "The issue doesn't state the reasons, it just mentions that the the jetty client offers these features in a single API. There are a variety of reason we are switching that are more fully enumerated in a related issue.\n\nI'd still list the unified API in that list, given Apache HttpClient 5 is in beta, but this title is not trying to encompass the reason for switching in any way, it is trying to encompass a work item.\n\n  ",
            "author": "Mark Miller",
            "id": "comment-16500223"
        },
        {
            "date": "2018-06-04T13:46:28+0000",
            "content": "I also still see a classic and async api for the clients in Apache Http Client 5 Beta. Perhaps we are just meaning different things with the idea of a \"single API\". ",
            "author": "Mark Miller",
            "id": "comment-16500233"
        },
        {
            "date": "2018-06-04T14:54:56+0000",
            "content": "HttpClient 5.0 async \"... offers a single API for Async, Http/1.1 Http/2...\". I am not sure what idea you have in mind. \n\nOleg ",
            "author": "Oleg Kalnichevski",
            "id": "comment-16500332"
        },
        {
            "date": "2018-06-04T17:27:39+0000",
            "content": "I compared a few clients, so nothing in this issue is directly related to Apache HttpClient.\n\nThe Apache client has a competing offer in it's 5 version, which is in beta so not considered. I considered clients that have been out of beta for a long time.\n\nHow singular the API design and focus is is also something I considered, there is no reason to argue about it here.\n\nThe decision on the client did not come down to those individual points, nor was it a 1 on 1 comparison. Regardless, with Apache HttpClient 5 in beta, I only looked at it out of curiosity more than anything. ",
            "author": "Mark Miller",
            "id": "comment-16500567"
        }
    ]
}