{
    "id": "SOLR-6348",
    "title": "Collection of improvements to StatsComponent & FacetComponent for loose coupling",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "This is a parent wrapper issue for a collection of small-ish, improvements that can be made to the StatsComponent and the FacetComponent to allow them to play nicer together and – in combination with eachother – provide more powerful combinations of features that will still work well in a SolrCloud setup.\n\nThe end goal, once all tasks are completed, is that it should be possible to specify some query params like...\n\n\nstats.field={!tag=price_stats min=true max=true}product_price\nstats.field={!tag=avg_rating mean=true}user_rating\nfacet.range={!tag=price_ranges stats=rating_stats facet.range.start=...}price\nfacet.pivot={!range=price_ranges stats=price_stats}store,category\n\n\n\nAnd in the results you would get:\n\n\n\tthe min & max product_price for all matching documents\n\tthe mean user_rating for all matching documents\n\trange facet counts over the price field\n\t\n\t\tfor each range bucket, in addition to the normal constraint count there would also be:\n\t\t\n\t\t\tthe average user_rating for all documents in that range bucket.\n\t\t\n\t\t\n\t\n\t\n\tpivot facets drilling down on all matching documents, first by store then by category\n\t\n\t\tfor value/count node in the pivot tree, there would also be:\n\t\t\n\t\t\tthe min & max product_price for all documents matching this pivot constraint\n\t\t\trange facet counts over the price field for documents matching this pivot constraint\n\t\t\t\n\t\t\t\tfor each range bucket, in addition to the normal constraint count there would also be:\n\t\t\t\t\n\t\t\t\t\tthe average user_rating for all documents in that range bucket.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-14091547",
            "date": "2014-08-09T01:25:56+0000",
            "content": "\nSince I don't normally mass-open a bunch of jira's like this all at once, i wanted to share some back story...\n\nThe origins of this idea came from the discussions i had several months back with various folks about the \"AnalyticsComponent\" (SOLR-5302 & SOLR-5963).  As noted in the comments of those Jiras, the overall design of that component, and the expressiveness of it's user syntax/API, make it pretty much impossible to implement distributed support (ie: SolrCloud) for all possible options the user could specify.\n\nArround that time, i was talking with some customers who were excited by the prospect of better \"facetted statistics\" in Solr (but really needed distributed support as well) about what types of real world use cases they had.  And then i talked to some folks at apachecon in denver about some \"pie in the sky\" ideas for completely new implement ions of stats/analytics in solr that would need to be built from scratch, and then (where most of my brain storming time comes from) on a plane trip home i started drafting up some notes of potential \"small\" improvements that could be made incrementally to the StatsComponent and FacetComponent to give us more powerful features w/o needing to completely start over from the ground up.\n\nI discussed some of these ideas with coworkers, but never really talked about them publicly much because a big factor in how useful most of my ideas could be are dependent on getting distributed pivot faceting to work – and i wasn't sure how feasible that was.  \n\nWhich is why i spent the past 3 months heads down on SOLR-2894.\n\nNow that SOLR-2894 is starting to look very viable, i'm more confident in the basic premise of the various ideas in this issue (and it's sub-task), and figured I should start opening some some Jiras based on the notes i already had typed up. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14091652",
            "date": "2014-08-09T05:13:56+0000",
            "content": "+1\n\nI am still digesting this and SOLR-2894 but this is awesome, Hoss!  "
        }
    ]
}