{
    "id": "SOLR-8554",
    "title": "RebalanceLeader and ForceLeader APIs should be part of OverseerCollectionMessageHandler",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I think RebalanceLeader and ForceLeader API calls should be part of the OverseerCollectionMessageHandler.\n\nThere are two reasons for this -\n1. If the API is implemented within the OverseerCollectionMessageHandler the Overseer provides us with concurrency guarantees i.e two calls against a collection can't be executed simultaneously .\nAn example, a delete shard was fired and simultaneously a force leader was fired. Now say the replica which was meant to be deleted became the new leader.\n2. Less important that 1 , but if the API is implemented within the OverseerCollectionMessageHandler , we can provide an async option in these APIs",
    "attachments": {
        "SOLR-8554.patch": "https://issues.apache.org/jira/secure/attachment/12783578/SOLR-8554.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-15T16:35:41+0000",
            "author": "Erick Erickson",
            "content": "Works for me. ",
            "id": "comment-15102033"
        },
        {
            "date": "2016-01-21T13:06:33+0000",
            "author": "Varun Thacker",
            "content": "Patch which moves force leader and rebalance leader to the overseer. The size is bloated because of the code moving around\n\nSome additional changes to force leader:\n\n\tChanged some INFO/WARN logging to DEBUG in Forceleader\n\tForceLeader never waited for the shard responses to be collected. Patch adds that as well\n\tForceLeader makes use of sliceCmd and implements async as well\n\n\n\nSome additional changes for rebalance leader:\n\n\tThe response object has a success message along with covers more responses where errors could happen\n\tI couldn't get the max_at_once param to work correctly . The problem is once we send a shard request of REJOINLEADERELECTION we wait for changes to complete in waitForNodeChange . We also use the sequence number so we can't delay waitForNodeChange either.\n\n\n\nMaybe we should just remove max_at_once? The way rebalance leaders has worked is one at a time. That means unless one shard is fully complete the second one doesn't start . So this parameter is not too useful either. ",
            "id": "comment-15110552"
        },
        {
            "date": "2016-01-21T16:11:15+0000",
            "author": "Erick Erickson",
            "content": "As we were talking yesterday, max_at_once has never worked so removing it seems fine. I don't even think we need to deprecate it. ",
            "id": "comment-15110840"
        }
    ]
}