{
    "id": "SOLR-12472",
    "title": "SOLR JDBC issue with running queries",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrJ"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.5.1",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "I am trying to work with the SOLR-JDBC.\n\nFor some reason it works with DbVisualizer, but a simple java program ..\n\nClass.forName(\"org.apache.solr.client.solrj.io.sql.DriverImpl\");\n\nConnection conn = DriverManager.getConnection(\"jdbc:solr://zootest01:2181/?collection=mycol\");\n\nStatement stat = conn.createStatement();\n\nResultSet rs = stat.executeQuery(\"select item_id from mycol limit 10\");\n\nthis fails with exception coming from :\n\norg.noggit.JSONParser$ParserException: JSON Parse Error : char=< ...\n\nIt seems like the internal engine is returning HTML or XML while JSON is expected due to some reason.\n\nAs there is totally no documentation at all about the Driver Properties or anything else, I've no idea what is causing this or why is works with SquirrelSql & dbVisualizer, and not with other tools like DBeaver for example, which have the very same issues as I get with simple java program.\n\nAny idea what is wrong there ? Cause definitely something is wrong, as I use a very simple Java sample which works fine with every other JDBC driver I've tested.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-10T20:29:36+0000",
            "content": "This issue tracker is not a support portal.\n\nPlease discuss the problem with the community, either on the user mailing list or the IRC channel.  If the community determines that the problem you're having is a bug, then we can take further action in Jira.\n\nhttp://lucene.apache.org/solr/community.html#mailing-lists-irc\n\nIn the community discussion, please provide any entries in solr.log that correspond with the attempted query.  Any other information you can supply would also be helpful. ",
            "author": "Shawn Heisey",
            "id": "comment-16507499"
        }
    ]
}