{
    "id": "SOLR-10194",
    "title": "Unable to use the UninvertedField implementation with legacy facets",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.2,                                            6.3,                                            6.4.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "FacetComponent's method \"modifyRequestForFieldFacets\" modifies the distributed facet request and sets the mincount count to zero which then the SimpleFacets implementation is unable to get into the UIF code block when facet.method=uif is applied. The workaround which I found is to use facet.distrib.mco=true which sets the mincount to one instead of zero. \n\nWorking:\n\nhttp://somehost:9100/solr/collection/select?facet.method=uif&facet.field=attribute&q=*:*&facet=true&debug=true&facet.distrib.mco=true \n\nNone-Working:\n\nhttp://somehost:9100/solr/collection/select?facet.method=uif&facet.field=attribute&q=*:*&facet=true&debug=true&facet.distrib.mco=false\n\nSemi-working when it isn't a distributed call:\n\nhttp://somehost:9100/solr/collection/select?facet.method=uif&facet.field=attribute&q=*:*&facet=true&debug=true&facet.distrib.mco=false&distrib=false\n\nJust make sure to run it on a multi-shard setup.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-02-23T23:26:14+0000",
            "content": "This could be part of an issue where the description is just \"Solr 6.x performance is much worse than Solr 4.x performance.\"  This statement is particularly true when facets (and probably grouping) are involved.  For the person who filed this issue (who I have been talking to via IRC), enabling docValues and reindexing makes performance worse, not better. ",
            "author": "Shawn Heisey",
            "id": "comment-15881542"
        },
        {
            "date": "2017-02-24T15:10:06+0000",
            "content": "I actually found the core cause of the performance issue, it was due to too many segments on disk. Minimizing the amount of segments on disk brought the performance on par with solr 4.10. However, this is still a legitimate bug where the use of the UninvertedField implementation is blocked from use without the activation of facet.distrib.mco=true. \n\nI haven't tried docValues with the minimized amount of segments yet, but our index leans toward the static side of things so the UninvertedField implementation at query time is the ideal use case.  ",
            "author": "Victor Igumnov",
            "id": "comment-15882845"
        }
    ]
}