{
    "id": "SOLR-8731",
    "title": "onException behavior in search components",
    "details": {
        "components": [
            "SearchComponents - other"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "The idea is to allow search components to execute logic in case an exception  was thrown while processing a query.\nA new \"onException\" function can be added to the SearchComponent class. Then, parts of SearchHandler's handle-request functions can be surrounded in a try-catch block, where onException is called within the catch section on all relevant SearchComponents.",
    "attachments": {
        "SOLR-8731.patch": "https://issues.apache.org/jira/secure/attachment/12790132/SOLR-8731.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-29T20:17:11+0000",
            "author": "Dean Gurvitz",
            "content": "I wanted to add the reason I submitted this patch:\nRecently I was writing a search component that needs to save and use information about all queries running at a given moment. In the \"prepare\" method it adds the necessary information to a shared hashmap, and in one of the final calls to \"finishStage\" it removes it. In case of an exception thrown by another search component, the information about the unsuccessful query gets stuck in my hashmap, which creates a very big problem for me. \nThe \"onException\" mechanism allows me to make sure I remove the information about a specific query whether it succeeded or not. Locally I used it by inheriting from SearchHandler and from SearchComponent, but I think this functionality belongs in the original classes, and wanted to share my idea with the community. ",
            "id": "comment-15172523"
        },
        {
            "date": "2016-03-03T18:28:40+0000",
            "author": "Dean Gurvitz",
            "content": "Hello, I would really appreciate if someone took the time to inspect this issue. The patch is very small and simple, and reviewing it shouldn't take long ",
            "id": "comment-15178314"
        }
    ]
}