{
    "id": "SOLR-8014",
    "title": "Replace langdetect lib by more updated fork",
    "details": {
        "components": [
            "contrib - LangId"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "The language-detection library we use is https://code.google.com/p/language-detection/ version 1.1 from 2012. The project has stalled with no new development, not even in the [github repo](https://github.com/shuyo/language-detection) the original author put up.\n\nLooks like the most promising fork is this one https://github.com/optimaize/language-detector/ which is also being selected by the Tika project to replace Tika's old detector.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-07T14:12:21+0000",
            "author": "Dawid Weiss",
            "content": "https://github.com/carrotsearch/langid-java\n\nThere's also this one we ported from Python (a good while ago). It'd be interesting to see how they all compare in terms of model quality...  ",
            "id": "comment-14733757"
        },
        {
            "date": "2015-09-07T14:15:49+0000",
            "author": "Jan Høydahl",
            "content": "Cool. Feel free to file a new JIRA to add a this as a new implementation, then users can choose depending on needs. ",
            "id": "comment-14733761"
        },
        {
            "date": "2015-09-07T19:01:17+0000",
            "author": "Dawid Weiss",
            "content": "I think there should be a JIRA issue lying around for it somewhere... but it really boils down to maintenance and accuracy – too many options will only confuse people, one implementation that does the job properly should be enough. I don't know the fork you mentioned, so I can't really comment on the accuracy (but it looks very good!). ",
            "id": "comment-14733994"
        },
        {
            "date": "2015-09-09T04:43:38+0000",
            "author": "Hoss Man",
            "content": "...too many options will only confuse people, one implementation that does the job properly should be enough.\n\nI think Jan's point is that this issue should remain focused on updating LangDetectLanguageIdentifierUpdateProcessor to use the more up to date fork of the library it's already using, because that hsould be fairly straight forward.\n\nWe already ship/support 2 implementations of LanguageIdentifierUpdateProcessor, adding a 3rd based on langid-java (and or deprecating/removing either of the ones we have already) should be done as distinct issue(s) ... particularly since deciding which ones are the best will probably take more time/effort/consideration then just upgrading the langdetect lib. ",
            "id": "comment-14736161"
        },
        {
            "date": "2018-03-16T11:46:58+0000",
            "author": "Jan Høydahl",
            "content": "The proposed project https://github.com/optimaize/language-detector/ also seems to be abandoned now.\n\nI see that the Tika language detector we offer is now deprecated in Tika, and may perhaps go away. Instead they have some new classes, have not tested them, but we should also consider upgrading, or creating another implementation for the new Tika detector. ",
            "id": "comment-16401786"
        },
        {
            "date": "2018-03-17T01:26:29+0000",
            "author": "Ryan Pedela",
            "content": "Would OpenNLP be a better option? They recently released a trained model that supports 103 languages. ",
            "id": "comment-16403190"
        },
        {
            "date": "2018-03-17T01:40:26+0000",
            "author": "Steve Rowe",
            "content": "Would OpenNLP be a better option? They recently released a trained model that supports 103 languages.\n\nThis has already been implemented: SOLR-11592, which will be included in soon-to-be-released Solr 7.3. ",
            "id": "comment-16403196"
        }
    ]
}