{
    "id": "SOLR-6522",
    "title": "DirectUpdateHandler2 - log start/end on debug-level",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "There are some loggings in DirectUpdateHandler2 on info-level that I believe ought to be on debug-level. That is\n\n\tAll the log.info(\"start ...); and log.info(\"end ...); loggings\n\tlog.info(\"No uncommitted changes. Skipping IW.commit.\");\n\tlog.info(\"Committing on IndexWriter close.\");\n\n\n\nReason I want it changed is that we log something on info-level (that really belongs on info-level) in our extended version of DirectUpdateHandler2, and we want that logged without filling up our log-files with the stuff mentioned above. Now that is not especially relevant for Apache Solr, but besides that I believe that this change is \"the right thing to do\", and that it should therefore be done.\n\nIn general I believe it would be a good idea to scan the entire code-base to see if we log on the \"right\" level - I believe there are lots of places around the code where the log-level is chosen \"by random\". But I will leave that to other issues.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-14135547",
            "date": "2014-09-16T14:45:42+0000",
            "content": "After a quick scan, I think most of these are appropriate for info level (given how we already use info level).\nIt's been very useful in the past to see when a commit starts and ends when debugging a customer problem.\nAlso, stuff like \"Committing on IndexWriter close.\" is a rare event. "
        },
        {
            "author": "Per Steffensen",
            "id": "comment-14135583",
            "date": "2014-09-16T15:15:19+0000",
            "content": "After a quick scan, I think most of these are appropriate for info level (given how we already use info level).\n\nOk, then maybe you should consider \"the way you use info-level\" \n\nIt's been very useful in the past to see when a commit starts and ends when debugging a customer problem.\n\nThe keyword is \"debugging\". That kind of stuff belongs on debug-level\n\nBut of course I understand that when you get a log from a customer that he picked up after an error occurred, it is hard to tell him to turn on debug-level and make the error occur again  But I guess there is not a single log-line in the code where you cannot say that it would be useful to have the output from that line when debugging a problem in that area of the code - and still log-lines using debug-level exists in the code\n\nAlso, stuff like \"Committing on IndexWriter close.\" is a rare event.\n\nYeahhh ok, actually it is the start/end loggings that are bothering us. I just went through the file to see if there where other lines that potentially belonged on debug-level, and came up with a few additional\n\n-------------\n\nBut ok, if you have arguments not to do the change, that is perfectly ok. I guess I will live with it. Thanks for responding! "
        }
    ]
}