{
    "id": "SOLR-6748",
    "title": "Additional resources to the site to help new Solr users ramp up quicker",
    "details": {
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "I would like to request the addition of an online training I created for Pluralsight called Getting Started with Enterprise Search using Apache Solr in the following page: http://lucene.apache.org/solr/resources.html\n\nIt is not exactly a video only, it is an online training so no idea if it should be added beneath videos or separately.\n\nIt aims to take a developer with absolutely no knowledge of Solr or even search engines, to take them into being able to create a basic POC style application with Solr in the backend. A few thousand people have watched it and I have received very positive feedback on how it has helped people get started very quickly and reduce the entry level barrier.  \n\nIs this possible? The url of the training is:\nhttp://www.pluralsight.com/courses/table-of-contents/enterprise-search-using-apache-solr\n\nI believe it will help a lot of people get started quicker.\n\nHere is the full story of how this training came to be:\nA while back I was a Solr total rookie, but I knew I needed it for one of my projects. I had a little bit of a hard time getting started, but I did after a lot of hard work and working with other pretty good Solr developers.\n\nI then worked and created a system which is doing pretty good now. But I decided that I wanted to create a resource that will help people with absolutely no knowledge of Solr or search engines get started as quickly as possible. And given that I am already a trainer/author at Pluralsight, who focused mainly on Agile development, I thought this was the right place to start helping others.\n\nAnd so I did. I have received positive feedback, and given my background as a trainer I have also given it as \"Solr for the Uninitiated\", also for people with no previous knowledge of Solr. \n\nIt has also been received well to the extent that I have been hired to make it into a book, which I am writing at the moment.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-09T22:50:11+0000",
            "author": "Steve Rowe",
            "content": "Hi Xavier,\n\nI think the appropriate place for linking to your training site is from the Solr MoinMoin wiki's Support page: http://wiki.apache.org/solr/Support.  Or maybe create a new wiki page for training?\n\nFor things other than books, I think the standard for posting on the website should be that materials are freely available.\n\nAlso, if we were to start including things like this on the website, there would be huge amounts of churn as people want to add/remove/change stuff - the wiki is much more suited to that kind of thing. ",
            "id": "comment-14240208"
        },
        {
            "date": "2014-12-14T02:55:01+0000",
            "author": "Xavier Morera",
            "content": "Hi Steve Rowe,\n\nThanks for your feedback. I will add it there. Two comments:\n\n\tEven though the training is under a paid site, if you get a trial account you can actually watch the course for free so there is no obligation to pay. That's why I thought it would've been a good fit under Resources page. Also, I've spent hundreds of hours creating material to help non-proficient-in-search-devs get started, delivered it as an online training, then an in person training and now...\n\tI also have a book coming up in the next month on the same subject, focusing on helping people get started with Solr quickly. This one will be 100% free. Being a book, can I come back and submit it to be added to the website with the others?\n\n\n\nThanks also for your time to reply. Much appreciated.  ",
            "id": "comment-14245789"
        },
        {
            "date": "2014-12-14T14:42:38+0000",
            "author": "Steve Rowe",
            "content": "Being a book, can I come back and submit it to be added to the website with the others?\n\nPlease do. ",
            "id": "comment-14245929"
        }
    ]
}