{
    "id": "SOLR-1021",
    "title": "NullPointerException(s) in SolrJ when using stats and result set is empty",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "A NullPointerException is thrown at line 51 of class FieldStatsInfo since the returned stats information for the fname (ctor variable) is null and not checked for being so.\n\nSeems like this occurs when the search returns with no results but there were some setGetFieldStatistics defined for some fields.",
    "attachments": {
        "QueryResponse.java": "https://issues.apache.org/jira/secure/attachment/12400691/QueryResponse.java",
        "SOLR-1021.patch": "https://issues.apache.org/jira/secure/attachment/12401656/SOLR-1021.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Arie Fishler",
            "id": "comment-12673602",
            "date": "2009-02-15T11:10:36+0000",
            "content": "Added an if statement to avoid the ctor of FieldStatsInfo "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12675171",
            "date": "2009-02-19T23:03:40+0000",
            "content": "Arie: I'm not sure that i really understand the problem you're describing, and it looks like perhaps you didn't attach the file you ment to attach.  \n\nCan you post a stack trace showing the NPE you're describing?\n\nAlso: If you haven't already seen it http://wiki.apache.org/solr/HowToContribute has some info on generating patches with bug fixes. "
        },
        {
            "author": "Arie Fishler",
            "id": "comment-12675635",
            "date": "2009-02-22T09:05:46+0000",
            "content": "I'll start from scratch since it might be possible I generated some mess here \n\nIn FieldStatsInfo I got a NullPointerException in line 51 which indicated that the nl variable passed to the constructor is probaby null\nFieldStatsInfo( NamedList<Object> nl, String fname )\n\nConstructor is only called from QueryResponse.java and I added the if statement there to avoid the exception (and not call the constructor when this occurs. I did not get too deep into that but seems like there might be a situation when the stat info is null for some fields. \nI am not sure if this is the best solution or it might indicate another problem. This solution works for me. \n "
        },
        {
            "author": "Arie Fishler",
            "id": "comment-12675636",
            "date": "2009-02-22T09:08:27+0000",
            "content": "This is the correct file. My change is at line 134.\n\nI can try later on and generate a more appropriate contribution on this according to the guidelines. Could not get to it right now "
        },
        {
            "author": "Rohit Gandhe",
            "id": "comment-12679767",
            "date": "2009-03-06T23:45:18+0000",
            "content": "This patch contains Arie's fix and an additional (related) fix I had to make when extracting facet info in QueryResponse. As he mentioned earlier, the NPE is thrown when trying to extract stats and facets from a resultset which contain 0 docs. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12689583",
            "date": "2009-03-26T18:26:04+0000",
            "content": "The bug with stats makes sense – the question is what behavior would be better for clients:\n\n1) leave the _fieldStatsInfo Map empty \n2) populate _fieldStatsInfo with all of the fields that were returned as keys, but null for hte values \n3) populate _fieldStatsInfo with \"empty\" FieldStatsInfo objects (so all the accessors – ie: FieldStatsInfo.getCount() – return null)\n\n#2 & #3 being alternate methods for conveying to clients which fields they would have gotten stats for if the result set hadn't been empty.\n\nany of these approaches is relatively trivial to implement, it's just a question of which will be the best for clients.\n\nI don't really understand the change to extractFacetInfo in the patch.  even with an empty result set, the facet_query NamedList will never contain a null value – they will all be zeros. ... can someone post a stack trace (and explanation of what the request looked like) where the current code caused a problem?  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12704082",
            "date": "2009-04-29T11:50:51+0000",
            "content": "This might have been fixed by Ryan in revision r763791.\n\nCan somebody use a recent nightly (or trunk) and confirm? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12711499",
            "date": "2009-05-21T07:16:09+0000",
            "content": "there is a fix that is already checked in Rohit ,is the fix good enough ? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12713915",
            "date": "2009-05-28T09:18:18+0000",
            "content": "Marking this as fixed. We can re-open if the problem still exists. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775660",
            "date": "2009-11-10T15:51:57+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}