{
    "id": "SOLR-11179",
    "title": "Ability to dump jstack",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "scripts and tools"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Add a \"jstack\" command to the \"bin/solr\" script to ease capture of jstacks.",
    "attachments": {
        "SOLR-11179.patch": "https://issues.apache.org/jira/secure/attachment/12879991/SOLR-11179.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-08-02T08:35:07+0000",
            "content": "Here is the proposed addition. ",
            "author": "Ramsey Haddad",
            "id": "comment-16110537"
        },
        {
            "date": "2017-08-02T13:47:21+0000",
            "content": "A few initial comments.  Some/many of these are opinions, so feel free to disregard those you don't care for...\n\n\n\tare we planning on supporting the jstack mode on Windows (solr.cmd) too?  If so, similar changes need made to that file too.\n\tit might be nice to have a -o flag to specify the output file.\n\teven if we don't want to support user-specified output file names, it might be nice to at least support outputting straight to stdout so users can pipe to other shell commands.  Maybe this doesn't make a ton of sense for jstack output, just something to consider.\n\tI don't know much about jstack, but I'd guess that this command will only work in certain circumstances.  Does Solr have to be on the same box?  Are there any options that must be enabled at Solr-startup?  We should probably store these notes in the Usage text for this command.\n\tSpeaking of documentation, if you'd like, this command could be added to the Solr Ref Guide documentation in the file: ./src/solr-control-script-reference.adoc\n\n ",
            "author": "Jason Gerlowski",
            "id": "comment-16110934"
        },
        {
            "date": "2017-08-17T07:41:55+0000",
            "content": "Here is a patch that incorporates some of your suggestions.\n\n\tWe don't build/run Solr on Windows. I'd be happy to include changes for solr.cmd by someone in a position to test them.\n\tYes, I have added a -o flag as suggested. .\n\tYes, with the new design, if no output file is specified via -o, then the output will now go to stdout.\n\tYes, the jstack needs to be run on the same box, as do many of the other commands, including the stars of this bin/solr script: start and stop. I'm pretty sure that if you have a suitable ${JAVA_HOME}/ for Solr, then jstack will be there in ${JAVA_HOME}/bin,\n\tYes, documentation added to Solr Ref Guide.\n\n ",
            "author": "Ramsey Haddad",
            "id": "comment-16130055"
        },
        {
            "date": "2017-10-24T10:00:17+0000",
            "content": "OK. And here's a refined patch that also adds jstack to the windows solr.cmd file. ",
            "author": "Ramsey Haddad",
            "id": "comment-16216636"
        }
    ]
}