{
    "id": "SOLR-3631",
    "title": "Parse exception when spellchecker with collations is used",
    "details": {
        "affect_versions": "3.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search",
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Request \n\nhttp://<host>:<port>/solr/live/select/?spellcheck=true&q=+((shortDesc_en:(hg1453hg)^8))\n\n\nto Solr calls exception. See attached file exception-log.log.\n\nsolrconfig.xml:\n\n...\n<requestHandler name=\"standard\" class=\"solr.SearchHandler\" default=\"true\">\n\t<!-- default values for query parameters -->\n\t<lst name=\"defaults\">\n\t\t<str name=\"echoParams\">explicit</str>\n\n\t\t<str name=\"spellcheck.onlyMorePopular\">true</str>\n\t\t\n\t\t<str name=\"spellcheck.extendedResults\">false</str>\n\t\t<str name=\"spellcheck.collate\">true</str>\n\t\t<str name=\"spellcheck.collateExtendedResults\">true</str>\n\t\t\n\t\t<str name=\"spellcheck.maxCollations\">3</str>\n\t\t\n\t\t<str name=\"spellcheck.maxCollationTries\">6</str>\n\t\t\n\t\t<str name=\"spellcheck.count\">3</str>\n\t</lst>\n\t<arr name=\"last-components\">\n\t        <str>spellcheck</str>\n\t</arr>\n</requestHandler>\n...",
    "attachments": {
        "exception-log.log": "https://issues.apache.org/jira/secure/attachment/12536790/exception-log.log"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13417909",
            "date": "2012-07-19T00:43:18+0000",
            "content": "Eugene: I'm not very knowledgeable about the spellcheck code, but i'm unable to reproduce the problem you are seeing – most likely because the spellchecker works based on the indexed data, and w/o a copy of your exact schema and data, specific examples you provide won't necessarily reproduce with the same errors.\n\ncould you please try to reproduce this with the example schema and example data?  if you have to make modifications to the solrconfig.xml file that's fine, just tell us what changes you made – but to try and dig into a problem like this we really need to understand exactly what data is being used.\n\nIt would also be helpful if you could test this using Solr 4.0.0-ALPHA or Solr 3.6.0 and let us know if you can reproduce the problem in either of those (there have been a lot of spellcheck related changes and bug fixes since Solr 3.1) "
        },
        {
            "author": "James Dyer",
            "id": "comment-13418325",
            "date": "2012-07-19T14:31:12+0000",
            "content": "Based on the exception log, here's what I think is happening:\n\n1.The QueryConverter class is not parsing the query correctly.  Unless the solrconfig.xml has a <queryConverter /> element, it would use SpellingQueryCOnverter.  At least one related bug was fixed in 3.6 (SOLR-2509).\n\n2. Based on incorrect assumptions from the QueryConverter, it corrects \"shortDesc_en:(hg1453hg)\" to \"shortDeshigh\"\n\n3. With \"maxCollationTries\" set, it re-queries this correction.  However, the query parser cannot handle the resulting nonsense query.\n\nSo I would try 3.6 or at least patch what you've got with the fix on SOLR-2509.  If that doesn't work, we at least need to see your spellcheck response output with \"spellcheck.extendedResults=true\".  I wouldn't be terribly surprised if SpellingQueryConverter can't handle this query.\n\nAs a workaround, try simplifying the query with fewer parenthesis.  Worst case, strip out everything that is not a correctable keyword and put that on \"spellcheck.q\".  Also, if it works most of the time but just fails when part-number queries are sent you can safely ignore the exception (but still help us fix this if its a new bug!). "
        },
        {
            "author": "Eugene Viktorovich",
            "id": "comment-13428078",
            "date": "2012-08-03T13:31:22+0000",
            "content": "In Solr 3.6.1 issue doesn't exist. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13428112",
            "date": "2012-08-03T14:19:14+0000",
            "content": "User reported this works with 3.6.1 (probably fixed with SOLR-2509, 3.6.0) "
        }
    ]
}