{
    "id": "SOLR-2852",
    "title": "SolrJ doesn't need woodstox jar",
    "details": {
        "affect_versions": "None",
        "status": "Reopened",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The /dist/solrj-lib/ directory contains wstx-asl-3.2.7.jar (Woodstox StAX API).  SolrJ doesn't actually have any type of dependency on this library. The maven build doesn't have it as a dependency and the tests pass.  Perhaps Woodstox is faster than the JDK's StAX, I don't know, but I find that point quite moot since SolrJ can use the efficient binary format.  Woodstox is not a small library either, weighting in at 524KB, and of course if someone actually wants to use it, they can.\n\nI propose woodstox be removed as a SolrJ dependency.  I am not proposing it be removed as a Solr WAR dependency since it is actually required there due to an obscure XSLT issue.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13136129",
            "date": "2011-10-26T17:27:32+0000",
            "content": "Two other points:\n\n\tAs a general principle, minimizing client libraries/dependencies is a good thing, especially one that isn't likely to actually be used!\n\tMost people will assume all libraries in the /dist/solrj-lib/ directory are required when this one isn't.\n\tWoodstox is not the only fast implementation; some quick google searches unearthed Aalto\n\n "
        },
        {
            "author": "David Smiley",
            "id": "comment-13137189",
            "date": "2011-10-27T14:57:56+0000",
            "content": "After some deliberations I had on IRC #lucene-dev with Steve Rowe and Chris Male, I haven't convinced them and so I will close the issue. "
        },
        {
            "author": "David Smiley",
            "id": "comment-15536020",
            "date": "2016-09-30T13:36:33+0000",
            "content": "I think the time for this has come.  What's changed is increased usage of Solr's \"javabin\" format – it's the default, not XML.  Lets reduce the dependencies users think they need (they don't actually need Woodstox but they don't even know that). "
        }
    ]
}