{
    "id": "SOLR-3840",
    "title": "XML query response display is unreadable in Solr Admin Query UI",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.1"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "If I execute a query in the Solr Admin Query UI, the default XML \"writer\" displays only the raw text of the Solr response XML element values, but none of the XML syntax itself, rendering the response display on the Query page almost completely useless. JSON, Ruby, et al display very reasonably formatted output, but XML does not.\n\nYou can click on the icon next to the generated query URL to display the response in a browser tab of its own and then it does display the XML very reasonably, but the framed display on the query page is simply not readable.\n\nMy recollection is that the old UI had this same problem.",
    "attachments": {
        "Query-UI-XML-unreadable.png": "https://issues.apache.org/jira/secure/attachment/12545081/Query-UI-XML-unreadable.png",
        "solr-admin-ui-query-highlight-json.png": "https://issues.apache.org/jira/secure/attachment/12561751/solr-admin-ui-query-highlight-json.png",
        "SOLR-3840.patch": "https://issues.apache.org/jira/secure/attachment/12546545/SOLR-3840.patch",
        "solr-admin-ui-query-highlight-xml.png": "https://issues.apache.org/jira/secure/attachment/12561752/solr-admin-ui-query-highlight-xml.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13455423",
            "date": "2012-09-13T23:20:13+0000",
            "content": "I can't reproduce the problem description on the 4x branch – the frame embedded in the search UI page shows me the same xml appearance as when it's loaded in it's own tab.  sounds like a browser specific behavior (details on your browser would be appreciated)\n\nRemoving fixVersion=4.0 as this does not seem like a significant enough issue to warrant impeeding momentum towards the (hopefully) rapidly approaching release. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13455443",
            "date": "2012-09-13T23:39:21+0000",
            "content": "I'm running Google Chrome on Windows 7. I attached the screenshot.\n\nI tried IE 9, but the dashboard is completely dysfunctional there - I'll file a separate issue. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13455468",
            "date": "2012-09-13T23:59:09+0000",
            "content": "Issue is the same with a fresh download of Firefox. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13461753",
            "date": "2012-09-24T11:56:15+0000",
            "content": "Jepp, that's right .. depends a bit on your Browser, if it will render the XML correctly .. or not :/\n\nAt the Beginning we thought about using the same (clientside) XML-Renderer like we have in place for displaying the schema.xml/solrconfig.xml, but if we do so the browser features to expand/collapse the xml-tree (or whatever your browser has implemented) are gone.\n\nAnd right know, i don't have a chance to detect if the client is able to render xml as xml or not. what we could think about, is offering a second view: one nativ, the second rendered ... so the user could decide which one to use? "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13461794",
            "date": "2012-09-24T13:52:30+0000",
            "content": "Just to be clear, both Chrome and Firefox on Windows know how to render XML, and in fact if I click on the icon next to the query URL the XML displays properly when it is a page of its own in the browser.\n\nI don't have any browser add-ons - I use the browsers exactly as they are downloaded. Is there maybe some add-on that might be needed? Or maybe some option(s) that need to be enabled or disabled?\n\nI would add that when I do display the XML by clicking on the URL icon, Chrome does also inform me that \"This XML file does not appear to have any style information associated with it. The document tree is shown below.\" It still formats the XML properly though. I get the same exact message in Firefox if I click on the URL icon.\n\nSomebody must have some clue as to while this specific feature of the Solr UI would behave differently on my system. My current suspicion is that the Solr UI is dependent on some add-on that your average Solr committer happens to have also installed.\n "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13462120",
            "date": "2012-09-24T20:59:19+0000",
            "content": "I think this might be related to http://code.google.com/p/chromium/issues/detail?id=434 (see message at the bottom). Chrome can display XML, but not if it is in an iFrame.\n\nIn addition, Firefox does display XML - with folding too - but it puts an ugly big banner on top with the 'missing style' message.\n\nMaybe the default return type should be changed at least for Admin. I vote for Ruby/indented. Not a default return type at the backend, just start the UI page with those options pre-selected. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13462128",
            "date": "2012-09-24T21:05:08+0000",
            "content": "I vote for Ruby/indented.\n\nJSON is much more standard... but ruby does have a big advantage for debugging in that newlines can be embedded in strings (common in explain output, exception traces, etc) and so it looks much better. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13462969",
            "date": "2012-09-25T16:58:06+0000",
            "content": "The point is exactly as Alexandre stated, the rendering does not work by default for content in iframes .. afaik the can be enabled as 'advanced setting', but this nothing i'd like to build on.\n\nfirst draft attached, which uses the same client-rendering as we do for schema/config. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13536219",
            "date": "2012-12-19T18:13:00+0000",
            "content": "Updated Patch, includes Highlighting for XML as well as JSON (see attached screenshots for samples) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13536262",
            "date": "2012-12-19T18:35:31+0000",
            "content": "Sweet!\n\nAbout the JSON colors though - the red text kind of stands out a bit and makes you think \"error\".  Many syntax highlighters use green for quoted strings.  And perhaps we could use blue for the map keys (which currently look sort of darkish green/gray?)\n\nAnyway - just my first impressions - I'd like to hear what other people think are good colors (esp with the JSON which I hope is the default!) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13536276",
            "date": "2012-12-19T18:40:01+0000",
            "content": "Ah, well .. yes .. of course! let me know which one you like .. perhaps you can have a look at the given themes on the highlight.js page: http://softwaremaniacs.org/media/soft/highlight/test.html ? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13536286",
            "date": "2012-12-19T18:48:15+0000",
            "content": "+1 for XCode\n\nas always, looks great Stefan! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13544722",
            "date": "2013-01-05T14:06:45+0000",
            "content": "Ryan, was not completely happy with the XCode Theme :/ so i took a couple of colors from the typical \"jsonview\" plugins for firefox/chrome - at least for the json-format. xml stays the same for now, github-ish style .. otherwise it was too much dark in dark and not easy to see the difference between attribute and attribute's value.\n\nI'll go ahead and commit this soon .. if anyone has suggestions on specific color improvements, let me know  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13544725",
            "date": "2013-01-05T14:26:32+0000",
            "content": "trunk: r1429288\nbranch_4x: r1429289 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13544813",
            "date": "2013-01-05T20:27:30+0000",
            "content": "[branch_4x commit] Stefan Matheis\nhttp://svn.apache.org/viewvc?view=revision&revision=1429289\n\nSOLR-3840: XML query response display is unreadable in Solr Admin Query UI (merge r1429288) "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13544843",
            "date": "2013-01-05T20:28:03+0000",
            "content": "[trunk commit] Stefan Matheis\nhttp://svn.apache.org/viewvc?view=revision&revision=1429288\n\nSOLR-3840: XML query response display is unreadable in Solr Admin Query UI "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13546470",
            "date": "2013-01-08T01:01:22+0000",
            "content": "Looks great now! Thanks for this nice improvement of 4.1 over 4.0.\n\nI did an ant run-example with a fresh svn co of branch_4x. "
        }
    ]
}