{
    "id": "SOLR-11473",
    "title": "Make HDFSDirectoryFactory support other prefixes (besides hdfs:/)",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "hdfs"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "6.6.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Not sure if it's a bug or a missing feature  I'm trying to make Solr work on Alluxio, as described by Timothy Potter in https://www.slideshare.net/thelabdude/running-solr-in-the-cloud-at-memory-speed-with-alluxio/1\n\nThe problem I'm facing here is with autoAddReplicas. If I have replicationFactor=1 and the node with that replica dies, the node taking over incorrectly assigns the data directory. For example:\n\nbefore\n\n\"dataDir\":\"alluxio://localhost:19998/solr/test/\",\n\n\nafter\n\n\"dataDir\":\"alluxio://localhost:19998/solr/test/core_node1/alluxio://localhost:19998/solr/test/\",\n\n\nThe same happens for ulogDir. Apparently, this has to do with this bit from HDFSDirectoryFactory:\n\n  public boolean isAbsolute(String path) {\n    return path.startsWith(\"hdfs:/\");\n  }\n\n\nIf I add \"alluxio:/\" in there, the paths are correct and the index is recovered.\n\nI see a few options here:\n\n\tadd \"alluxio:/\" to the list there\n\tadd a regular expression in the lines of [a-z]*:/ I hope that's not too expensive, I'm not sure how often this method is called\n\tdon't do anything and expect alluxio to work with an \"hdfs:/\" path? I actually tried that and didn't manage to make it work\n\thave a different DirectoryFactory or something else?\n\n\n\nWhat do you think?",
    "attachments": {
        "SOLR-11473.patch": "https://issues.apache.org/jira/secure/attachment/12892400/SOLR-11473.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-12T11:32:05+0000",
            "content": "I'd parse this with the URI java class. After parsing it you can use methods like isAbsolute() and similar to check the status. ",
            "author": "Uwe Schindler",
            "id": "comment-16201811"
        },
        {
            "date": "2017-10-12T11:36:24+0000",
            "content": "Sounds good, thanks Uwe! Should I just attach a patch with that change? ",
            "author": "Radu Gheorghe",
            "id": "comment-16201818"
        },
        {
            "date": "2017-10-12T11:44:27+0000",
            "content": "You can propose a patch, if you like! I'd use: https://docs.oracle.com/javase/8/docs/api/java/net/URI.html#isAbsolute--\n\nI don't think this method is called too often. It is not very expensive. In general, I would prefer to use the URI class throughout HDFSDirectoryFactory for resolving paths, but this is just my personal opinion. ",
            "author": "Uwe Schindler",
            "id": "comment-16201829"
        },
        {
            "date": "2017-10-12T11:55:50+0000",
            "content": "In general, I would prefer to use the URI class throughout HDFSDirectoryFactory for resolving paths, but this is just my personal opinion.\n\nIIRC I tried this once before and ran into something thorny. But I can't figure out what it was. If you run into problems, feel free to ping me about it Radu Gheorghe ",
            "author": "Mike Drob",
            "id": "comment-16201846"
        },
        {
            "date": "2017-10-13T19:05:39+0000",
            "content": "I didn't try auto-add replica feature with Alluxio yet. For the update log, I worked around the issue by setting the fully qualified classname on the <updateLog> element in the config, e.g. <updateLog class=\"...HdfsUpdateLog\"> ... but that doesn't address the dataDir issue. ",
            "author": "Timothy Potter",
            "id": "comment-16204040"
        },
        {
            "date": "2017-10-16T15:59:57+0000",
            "content": "Thanks, Uwe Schindler, Mike Drob and Timothy Potter for your comments. I tried specifying HdfsUpdateLog for the transaction log - indeed that helps storing the transaction log in Alluxio, but not with this path issue.\n\nI'm attaching a patch that would fix this, with a few comments:\n\n\tI've only really changed the isAbsolute() method. I looked around in HDFSDirectoryFactory and I didn't find other places where it would be useful. Maybe I'm wrong, maybe this could be refactored to look nicer, but I thought starting with a minimal patch would be better \n\twhile I tested this patch with Alluxio and it worked well, I didn't add any unit tests. I thought it would basically be testing the URI class, which seemed pointless, but on the other hand I thought it would be nice to make sure we don't lose this functionality in the future (i.e. to make non-hdfs:/ paths work). Let me know if that's needed, though, or if you have any suggestions on what should be tested (I'm thinking of an hdfs:/ path, an alluxio:/ path and a relative path)\n\tthis was all tested with Solr 6.6.1, and I've based my changes off the 6_6 branch from GitHub. I didn't add anything to CHANGES.txt because it's unclear to me where this change would go. Or if a CHANGES.txt modification should be added at this stage, without knowing the Fix Version. Also, `git format-patch` misbehaved for me, so I've generated this through `git diff`. Is that OK?\n\n\n\nBesides the last question, do you have any other thoughts or questions? ",
            "author": "Radu Gheorghe",
            "id": "comment-16206092"
        }
    ]
}