{
    "id": "SOLR-3887",
    "title": "Add support for arrays of operations to JSON Update Handler",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Currently, UpdateRequestHandler accepts a sequence of operations in JSON format by specifying duplicate keys. While duplicate keys aren't forbidden by the JSON spec, in practice, this makes the update handler difficult to use in conjunction with JSON serialization libraries in clients.\n\nThis has been mitigated somewhat by adding special syntax to add and delete in SOLR-2496 and SOLR-3508 respectively, but there's still no way to specify operations in a particular sequence as you can with XML. Per the JSON spec, the right way to do this is with an array, as objects are considered unordered sets.\n\nUsing an array at the top level would obviate the need for such a key, but that syntax was used in the fix for SOLR-2496 as a shortcut for adds, so...\n\nThe attached patch adds an \"operations\" key that can exist at the same level as any other operation. The \"operations\" key's value is an array of objects, each of which uses the same syntax as the root object:\n\n\n{\n  \"operations\": [\n      {\"add\": {\"id\": \"1\"}},\n      {\"delete\": {\"query\": \"foo\"}},\n      {\"add\": {\"id\": \"2\"}},\n      {\"commit\": {}},\n  ]\n}",
    "attachments": {
        "SOLR-3887.patch": "https://issues.apache.org/jira/secure/attachment/12546456/SOLR-3887.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13462904",
            "date": "2012-09-25T16:07:44+0000",
            "content": "Jesse: thanks for your patch.  \n\nThis looks like it should be a valuable feature, but at this point in the 4.0 release cycle we are focusing only on merging bug fixes to the 4.0 release branch, so i'm removing that as an intended fix version. "
        },
        {
            "author": "Jesse Dubay",
            "id": "comment-13462924",
            "date": "2012-09-25T16:32:10+0000",
            "content": "Hoss, no problem. Thanks for taking a look at it! "
        }
    ]
}