{
    "id": "SOLR-9189",
    "title": "explosion of timeout related failures in jenkins the past few days",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.1"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Blocker"
    },
    "description": "In the past few days, something has gone seriously wonky with our jenkins tests – causing a serious explosion in the number of test failures – notably do to various sorts of timeouts...\n\n\n\t\"Unable to create core ... Timed out getting coreNodeName for ...\"\n\t\"msg=SolrCore is loading,code=503\"\n\t\"Timeout occured while waiting response from server\"\n\t\"No registered leader was found after waiting for 30000ms\"\n\t\"Unable to create core ... Caused by: Timed out getting shard id for core: ...\"",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-06T17:53:11+0000",
            "author": "Hoss Man",
            "content": "My initial gut paranoia skimming the jenkins emails this morning was to assume that this might be because of SOLR-9107 / SOLR-5776 – the hypothosis being: \"The increased randomized use of ssl (factoring in tests.nightly / tests.multiplier) is causing more tests to slow down due to the crypto calculations\"\n\n... but that hypothosis seems weak when i started looking at the logs – there is a \"Randomized ssl\" line as part of the logs for every SolrTestCaseJ4 subclass showing if ssl is being used or not...\n\n\n\thttp://jenkins.thetaphi.de/job/Lucene-Solr-6.x-Linux/834/\n\t\n\t\t25 test failures\n\t\tonly 7 of those were using ssl\n\t\n\t\n\thttps://builds.apache.org/job/Lucene-Solr-NightlyTests-master/1034/\n\t\n\t\t44 test failures\n\t\tonly 17 of those were using ssl\n\t\n\t\n\n\n\n...even if we assume every test failure where ssl was in use was directly caused by ssl, that still leaves a really high increase in the number of failed tests in those two runs.\n\nSo my ammended (paranoid) hypothosis is \"The increased randomized use of ssl (factoring in tests.nightly / tests.multiplier) is causing more tests to slow down due to the crypto calculations EVEN IN OTHER TESTS AT THE SAME TIME DUE TO CPU STARVATION\"\n\nI'm going to commit a blanket disable of all SSL randomization on master ASAP to test this hypothosis.\n\nPart of me feels like this is an overkill reaction, and that a more rational response would simply be to undo the \"increased odds of using ssl\" portion of SOLR-9107 – but I'd really like to get a difinitive understanding of wether SSL usage is really having such a seriously pronounced affect on other tests in the same jenkins run – OR – is it just a red herring, and some other recent change has caused serious timeout issues?\n\n\nEDIT: clarified jira refrences ",
            "id": "comment-15316873"
        },
        {
            "date": "2016-06-06T18:46:43+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 59b4fc0bb0105ec25285f763fde86739433a38b1 in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=59b4fc0 ]\n\nSOLR-9189: temp disable randomized ssl to get to bottom of recent explosion of timeout related failures in jenkins builds ",
            "id": "comment-15316965"
        },
        {
            "date": "2016-06-06T19:49:37+0000",
            "author": "Hoss Man",
            "content": "sarowe reminded me offline about the \"buildTimeTrend\" feature of jenkins – while the ASF jenkins machines have only been running tests about once a day, so it's hard to spot an obvious pattern, uwe & sarowe's jenkins machines have been hammering on tests a lot faster, and you can really spot a trend...\n\nhttp://jenkins.thetaphi.de/job/Lucene-Solr-master-Linux/buildTimeTrend\nhttp://jenkins.thetaphi.de/view/All/job/Lucene-Solr-6.x-Linux/buildTimeTrend\n\nhttp://jenkins.sarowe.net/job/Lucene-Solr-tests-master/buildTimeTrend\nhttp://jenkins.sarowe.net/job/Lucene-Solr-tests-6.x/buildTimeTrend\n\n...from sarowe's master job, build #7028 was the first test in a while to go over 20 minutes, and from that point on tests were reliably over 40 minutes until build #7035 which droped down to 10 minutes....\n\n\n\thttp://jenkins.sarowe.net/job/Lucene-Solr-tests-master/7028/\n\t\n\t\t1e2ba9fe9be84f0b5defe4965735eae892fabf7b\n\t\t\"Jun 4, 2016 7:14:24 AM\"\n\t\tchanges:\n\t\t\n\t\t\tRevert \"SOLR-9181: Fix test bug in ZkStateReaderTest\" (detail)\n\t\t\n\t\t\n\t\n\t\n\thttp://jenkins.sarowe.net/job/Lucene-Solr-tests-master/7035/\n\t\n\t\tc8570ed821654cdce5f92ae17d06a21f242524e2\n\t\t\"Jun 6, 2016 1:08:05 PM\"\n\t\tchanges:\n\t\t\n\t\t\tRevert \"SOLR-9140: Replace some zk state polling with (detail)\n\t\t\tLUCENE-7132: BooleanQuery sometimes assigned the wrong score when ranges (detail)\n\t\t\n\t\t\n\t\n\t\n\n\n\n...that means the slow down didn't hit jenkins master until 3 days after i committed SOLR-9107 to that branch – but it did start right whne a SOLR-9181commit happened.  Likewise the build#7035 speedup was before my SOLR-9189 commit to disable randomized ssl testing on on master completely - and again, coincided with a SOLR-9140 commit.\n\nAlan Woodward - definitely wnat to draw your attention to this issue – your recent commits may have resvolved the slowdowns (at least on master), but i want to make sure you're aware of the situation. ",
            "id": "comment-15317085"
        },
        {
            "date": "2016-06-06T19:50:38+0000",
            "author": "Hoss Man",
            "content": "marking as a blocker for 6.1 – even if the problem has magically started to disipate, we should probably not release unless we're confident we understand why this hapened. ",
            "id": "comment-15317089"
        },
        {
            "date": "2016-06-06T21:24:47+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 4e3884bec7c386fe718abc423b2381b68aaf1a97 in lucene-solr's branch refs/heads/branch_6x from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4e3884b ]\n\nRevert \"SOLR-9140: Replace some zk state polling with CollectionStateWatchers\"\n\nAlan's comments (via Uwe) in SOLR-9140 jira comments suggest that he thought he had already\nreverted this on both branches, but that is not the case.  Reverting on his behalf due to the\nlikelyhood that this is causing SOLR-9189.\n\nAlan's comments regarding the master equivilent revert...\n\n\"There's still some places where notifications can be missed, so I'm reverting\nthis until those are fixed.\"\n\nThis reverts commit 9f299bb6ad39960469e297b0b364f5972e485621. ",
            "id": "comment-15317273"
        },
        {
            "date": "2016-06-06T23:42:17+0000",
            "author": "Hoss Man",
            "content": "yeah ... i think the evidence is pretty strong that this issue was caused by something related to the ZkStateReader changes Alan Woodward was working on in SOLR-9181+SOLR-9140...\n\nsarowe's 6.x jenkins job just finished build#1207 – the first build after 4e3884bec7c386fe718abc423b2381b68aaf1a97 landed on branch_6x – and it only took 12 minutes  (this in spite of the fact that i made no SSL randomization suppression related changes to branch_6x as part of this issue – that was just to master)\n\nhttp://jenkins.sarowe.net/job/Lucene-Solr-tests-6.x/1207/\n\nJust to be safe, i'll leave 59b4fc0bb0105ec25285f763fde86739433a38b1 on master until tomorrow morning (in case my observations related to SOLR-9181+SOLR-9140 wind up being total flukes) before reverting. ",
            "id": "comment-15317500"
        },
        {
            "date": "2016-06-07T08:39:43+0000",
            "author": "Alan Woodward",
            "content": "Yup, this is my fault, sorry.  Am at buzzwords with some flaky internet, and my push to branch_6x failed without me noticing it.  Thanks for fixing Hoss Man! ",
            "id": "comment-15318140"
        },
        {
            "date": "2016-06-07T16:19:39+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 6ffd1ba9787e4c8ae881663a93cb7958e84e3891 in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6ffd1ba ]\n\nRevert \"SOLR-9189: temp disable randomized ssl to get to bottom of recent explosion of timeout related failures in jenkins builds\"\n\nAll evidence points ot the root cause being unrelated to ssl randomization, so re-enabling this.\n\nThis reverts commit 59b4fc0bb0105ec25285f763fde86739433a38b1. ",
            "id": "comment-15318793"
        },
        {
            "date": "2016-06-07T16:22:02+0000",
            "author": "Hoss Man",
            "content": "handing this issue off to alan to make the final call as to wether this issue is \"resolved\" (ie: are master & 6.x in \"good\" states after the various commits & reverts) ",
            "id": "comment-15318794"
        },
        {
            "date": "2016-06-09T09:36:20+0000",
            "author": "Adrien Grand",
            "content": "Alan Woodward This issue is a blocker for 6.1, so could you check whether it can be considered resolved? Thanks. ",
            "id": "comment-15322239"
        },
        {
            "date": "2016-06-09T10:19:03+0000",
            "author": "Alan Woodward",
            "content": "The flaky commits have been reverted, so this should be fine for 6.x ",
            "id": "comment-15322304"
        }
    ]
}