{
    "id": "SOLR-3384",
    "title": "Custom SolrServer chains - mixing SolrServer-subclass properties as you like to",
    "details": {
        "affect_versions": "3.5",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Today it is like this\n\n\tLBHttpSolrServer is load-balancing over HttpSolrServers\n\tConcurrentUpdateSolrServer is using HttpSolrServer internally for sending requests (or its not, but I believe (without having looked thoroughly into it) it ought to)\n\tCloudSolrServer is using LBHttpSolrServer to load-balance over HttpSolrServer (one for each slice in a collection)\n\n\n\nIMHO it is a little to hardcoded to release its full potential. Those SolrServers (or some of them) ought to take the \"internally used SolrServer(s)\" or a factory to help creating those as a parameter (constructor and/or set-method). E.g.\n\n\tLBHttpSolrServer should just be called LBSolrServer and not be hardcoded to use HttpSolrServers internally. Instead of taking a list of URLs to load-balance over (using HttpSolrSever) it should just take a list of SolrServers to load-balance over.\n\tConcurrentUpdateSolrServer should not be hardcoded to use HttpSolrServer internally. Instead take SolrServers (or a factory to construct those) to use internally as input from the outside.\n\tCloudSolrServer of course will need to load-balance over the slices in the collection (that is its core property), but not necessarily directly using HttpSolrServers. Instead it should probably take a factory accepting a URL in its \"createInstance\"-method to be used when creating the SolrServers to load-balance over.\n\n\n\nMaking SolrServer more generic like this, having them deal only with their core reason for existing (separation of concerns), you will be able to create you own custom chains of SolrServers - e.g. a \"LBSolrSever -> CloudSolrSevers -> LBSolrServer -> ConcurrentSolrServers -> HttpSolrServer\" chain which I believe I would like to use to load-balance asynchronously over several collections.\n\nThis improvement is very hard to do before SOLR-3382 and SOLR-3383 has been solved, because you will not be able to add Concurrent(Update)SolrServer to your chain without limiting the functionality of your chain (update only) and you will not be able to get responses back.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13412201",
            "date": "2012-07-11T22:26:19+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429863",
            "date": "2012-08-07T03:43:41+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451107",
            "date": "2012-09-07T22:53:39+0000",
            "content": "removing fixVersion=4.0 since there is no evidence that anyone is currently working on this issue.  (this can certainly be revisited if volunteers step forward) "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13669223",
            "date": "2013-05-29T13:15:48+0000",
            "content": "I still have a large interest in this - as well as the two related issues that are necessary to allow it.\n\nI've got a lot of back compat worries, but perhaps we can 'start fresh' for 5.0. "
        }
    ]
}