{
    "id": "SOLR-6027",
    "title": "Replica assignments should try to take the host name into account so all replicas don't end up on the same host",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I have 18 SolrCloud nodes distributed across 3 Ec2 instances, so 6 per instance. One of my collections was created with all replicas landing on different SolrCloud nodes on the same instance. Ideally, SolrCloud would be a little smarter and ensure that at least one of the replicas was on one of the other hosts.\n\nshard4: {\n\thttp://ec2-??-??-??-239.compute-1.amazonaws.com:8988/solr/med_collection_shard4_replica1/ LEADER\n\thttp://ec2-??-??-??-239.compute-1.amazonaws.com:8984/solr/med_collection_shard4_replica3/ \n\thttp://ec2-??-??-??-239.compute-1.amazonaws.com:8985/solr/med_collection_shard4_replica2/ \n}\n\nI marked this as minor for now as it could be argued that I shouldn't be running that many Solr nodes per instance, but I'm seeing plenty of installs that are using higher-end instance types / server hardware and then running multiple Solr nodes per host.",
    "attachments": {
        "SOLR-6027.patch": "https://issues.apache.org/jira/secure/attachment/12643956/SOLR-6027.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13983230",
            "date": "2014-04-28T17:18:13+0000",
            "content": "it could be argued that I shouldn't be running that many Solr nodes per instance\n\nI think we want to make things as smart as we can! Everything is very basic right now and the intention has always been to make it much better - we want at least the option to take into account as much info as we can when choosing hosts (eventually, even hardware, avg load, whatever!). "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13983264",
            "date": "2014-04-28T17:36:24+0000",
            "content": "I would be nice to make this decision configurable/pluggable. One could select the nodes for a collection depending on case-specific context.  "
        },
        {
            "author": "Jessica Cheng Mallet",
            "id": "comment-13983300",
            "date": "2014-04-28T17:52:30+0000",
            "content": "I would be nice to make this decision configurable/pluggable.\n+1. For example, something like \"rack awareness\" would be nice to be taken into account as well. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13992776",
            "date": "2014-05-08T14:11:37+0000",
            "content": "I still don't know how to write a test case for this "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13995986",
            "date": "2014-05-13T03:03:02+0000",
            "content": "I've got some stuff that should be reusable / useful here as part of my replica failover work - it has some simple code to create a specific cluster state using some mock objects. You setup various states and check that the nodes chosen match what you expect or doesn't violate what you don't expect when passed to a method that returns which nodes where chosen to create on. \n\nA state is created via a short string ie csrsrrcr*r, so it ende up being simple and fast to test the hall out of this types of thing, and then you need less variation in any integration tests.  "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13998530",
            "date": "2014-05-15T07:31:56+0000",
            "content": "hi Mark, it would be great if you can post your patch (in whatever form) "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-14001560",
            "date": "2014-05-19T10:12:52+0000",
            "content": "Perhaps rename this JIRA -> \"Real World Awareness for SolrCloud\", encompassing host awareness, rack awareness, datacenter awareness whatever... Agree that it would make sense to have this pluggable or scriptable in some way. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14001584",
            "date": "2014-05-19T11:01:44+0000",
            "content": "I'm not sure if we should address all the points in this ticket. We can open new issues to address other points "
        },
        {
            "author": "Gavin",
            "id": "comment-16574153",
            "date": "2018-08-09T01:01:41+0000",
            "content": "Move issue from deprecated 'In  Progress' back to 'Open' "
        }
    ]
}