{
    "id": "SOLR-4377",
    "title": "making release tarballs identical to the release tags",
    "details": {
        "affect_versions": "4.0,                                            4.1",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Now that we're integrating Solr with Hadoop via the Apache Bigtop project it is a bit of a nuisance to our build system that the release tarballs don't quite match the SVN tags. This is also something that is not quite ASF kosher strictly speaking. \n\nWould it be ok with a Solr community to add a comparison check between release tarballs and SVN tags as part of the release process checklist?\n\nIf you guys have a Wiki outlining how-to-release perhaps it needs to be captured over there or just added to the process. Either way would be fine.",
    "attachments": {
        "diff.txt": "https://issues.apache.org/jira/secure/attachment/12567033/diff.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Rowe",
            "id": "comment-13565695",
            "date": "2013-01-29T19:33:18+0000",
            "content": "Hi Roman,\n\nI'm not sure what you mean when you say that release tarballs don't match the SVN tags.  Please provide details. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565703",
            "date": "2013-01-29T19:40:29+0000",
            "content": "This is also something that is not quite ASF kosher strictly speaking.\n\nI'm not sure that is the case. I think it comes down to the PMC for a particular project and what they decide to release.\n\nRegardless, I agree that it's a good goal.\n\nBefore we can put in a check for it, we have to fix the current issue though. Eg, what are all the differences?\n\nI suspect the biggest issue is around svn subtitution variables (those $id's and such). That's the first thing I saw when I took a quick look.\n\nThere where a bunch of them in test config files - I just zapped them.\n\nThe more committers that start to use Git, the less these svn properties make sense (if they ever did - I've never liked them and I'm glad we have been removing them over time).\n\nIn any event:\n\n+1 to finding the issues that make up the differences and addressing them\n+1 to adding a check about tags matching src releases\n\nI saw that right after the 4.1 tag, a couple quick commits went in - one for a spell fix in CHANGES and one a build issue - it made me unsure about whether we had released the tag, or a rev with the two fixes that happened right after. Of course I suspect we released the tag, but an automated smoke test would make me feel better about trusting that. "
        },
        {
            "author": "Roman Shaposhnik",
            "id": "comment-13565713",
            "date": "2013-01-29T19:47:30+0000",
            "content": "Here's an example from the 4.1.0 release (diff is attached):\n\n$ cd /tmp\n$ tar xzvf solr-4.1.0-src.tgz\n$ svn co http://svn.apache.org/repos/asf/lucene/dev/tags/lucene_solr_4_1_0\n$ find . -name .svn -type d -exec rm -rf {} \\;\n$ diff -ruN solr-4.1.0 lucene_solr_4_1_0 | grep '^diff' | wc\n    71     284   12019\n$ diff -ruN solr-4.1.0 lucene_solr_4_1_0  > diff.txt\n\n\n\nSo as you can see the diff is actually quite large (71 files total). My cursory glance shows that most of the deltas are trivial enough to be taken care of during the release process. What's more important (and what I'm asking for) is to have\n a release policy where a diff like I've mentioned would be part of the release check list. "
        },
        {
            "author": "Roman Shaposhnik",
            "id": "comment-13565719",
            "date": "2013-01-29T19:50:25+0000",
            "content": "I'm not sure that is the case. I think it comes down to the PMC for a particular project and what they decide to release.\n\nWell, as an IPMC member I can tell you that this is something we strongly required from the poddling release. Perhaps you're right and somehow the TLPs are exempt from this requirement. I'd be happy to solicit the advice of ASF long timers if for nothing else but to make sure we treat poddling the same way we are going to treat them when they graduate. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565828",
            "date": "2013-01-29T21:27:10+0000",
            "content": "The incubators projects have a long history of having much stricter rules than other TLP's that are applied before graduating. Podlings are at the mercy of the incubator PMC. Other top level projects are not however.\n\nIn our case, we vote on specific artifacts bits for release, not on a tag in svn. We could also choose to vote on a tag, but I don't believe that any current policy requires that our project ensures the tag exactly matches the released artifacts we voted on. It's a nice quality in any case though!\n\nLooking at that diff, this looks beyond svn subs. That does not really look like the issue after all. I'd have to look closer to understand what those diffs are all about:\n\n\ndiff -ruN solr-4.1.0/solr/core/src/java/org/apache/solr/highlight/RegexFragmenter.java lucene_solr_4_1_0/solr/core/src/java/org/apache/solr/highlight/RegexFragmenter.java\n--- solr-4.1.0/solr/core/src/java/org/apache/solr/highlight/RegexFragmenter.java\t2012-12-11 08:19:43.000000000 -0800\n+++ lucene_solr_4_1_0/solr/core/src/java/org/apache/solr/highlight/RegexFragmenter.java\t2013-01-29 11:43:20.242509623 -0800\n\n\n\nThere is an example - all this stuff looks suspicious. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565843",
            "date": "2013-01-29T21:41:48+0000",
            "content": "Most of the ones that look like the example i pasted above are because the src release came from the branch and not the tag it looks.\n\nThat's less worrisome than the css and other files with content differences.... "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13565853",
            "date": "2013-01-29T21:56:19+0000",
            "content": "The release process I followed and I think Robert followed, was to tag after a successful VOTE.  Otherwise, the tag will be in the wrong place for some of the svn history. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565856",
            "date": "2013-01-29T21:59:01+0000",
            "content": "The rest of the issues look like:\n\n1. generated stuff - eg our html changes stuff.\n2. hg and git ignore files at the root.\n\nSo it looks to me like those are the 3 total differences? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13565860",
            "date": "2013-01-29T22:01:42+0000",
            "content": "Yes, I also tagged once the vote for the artifacts completes. The release artifacts are made from the branch and the revision is recorded in the vote mail thread. After the vote succeeds, I tagged this exact revision number. So the only differences can be rev nos in $Id$ tags inside source files (which we should remove asap, they are causing trouble all the time). "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565862",
            "date": "2013-01-29T22:02:16+0000",
            "content": "The release process I followed and I think Robert followed, was to tag after a successful VOTE.\n\nI don't think that is a problem - as long as the tag matches what we released. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13565864",
            "date": "2013-01-29T22:03:23+0000",
            "content": "generated stuff - eg our html changes stuff.\n\nGood point. The Changes HTML is added to the source tarball and is not existent in SVN. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13565897",
            "date": "2013-01-29T22:35:37+0000",
            "content": "I'm not sure why .gitignore and .hgignore aren't present, but I'd argue that they have no point in a source tarball outside of a VC system.\n\nAll of the other difference (except for svn $URL$ keyword expansion differences as a result of branch vs. tag location) appear to be intentional - see the package-src-tgz target in solr/build.xml. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565901",
            "date": "2013-01-29T22:43:54+0000",
            "content": "I'm not sure why .gitignore and .hgignore aren't present, but I'd argue that they have no point in a source tarball outside of a VC system.\n\nAs they are part of our src tree and serve a purpose, I don't see why wouldn't include them.\n\nkeyword expansion\n\nI'd like to just remove these. Who stands to defend them? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13565903",
            "date": "2013-01-29T22:47:05+0000",
            "content": "\nI'm not sure why .gitignore and .hgignore aren't present, but I'd argue that they have no point in a source tarball outside of a VC system.\n\nAs they are part of our src tree and serve a purpose, I don't see why wouldn't include them.\n\nThey are not in the src-tarball, because the ANT <fileset/> used by the <tar/> task excludes those file types: http://ant.apache.org/manual/dirtasks.html#defaultexcludes - This is intended, otherwise it would also contain .svn/ and similar files. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13565904",
            "date": "2013-01-29T22:47:15+0000",
            "content": "Steve: I'd agree these differences are intentional and while I labeled them suspicious initially, each appears to check out as expected.\n\nHowever, for one, I'd like to nuke the var expansion anyway , and two, we should check with Roman about what the issue is in regards to big top integration and see what we can do to smooth things out if possible. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13565913",
            "date": "2013-01-29T22:52:34+0000",
            "content": "However, for one, I'd like to nuke the var expansion anyway\n\n+1, we never started that officially (whenever I saw such a comment, I nuked it), but nobody did it everywhere. Solr has one problem with this, as some description \"Strings\" for MBeans also contain $Id$ tags. \n\nWe can add the pattern for those $Id$ and other tags to our precommit ANT check. This would also find the offenders very quick, just change the root build.xml to include another regex (next to nocommit,...). "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13565916",
            "date": "2013-01-29T22:54:53+0000",
            "content": "They are not in the src-tarball, because the ANT <fileset/> used by the <tar/> task excludes those file types: http://ant.apache.org/manual/dirtasks.html#defaultexcludes - This is intended, otherwise it would also contain .svn/ and similar files.\n\nI checked in build/solr/svn-export/, where the source is put before packaging, and the .gitignore and .hgignore files are there, so you must be right Uwe.  But since this is an svn export, and not a checkout, there are no .svn/ directories.  So we should add defaultexcludes=\"no\" to include those two file.  I looked at all of the patterns in the Ant docs, and none of them are applicable, since this is always a fresh export, there will be no backup/temporary/VC files that we'll want to exclude. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13565933",
            "date": "2013-01-29T23:11:07+0000",
            "content": "I still don't think they are useful in a source release. In my opinion, bigtop should use the same \"defaultexcludes\" when checking the tag against the release artifact. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13565949",
            "date": "2013-01-29T23:16:05+0000",
            "content": "@Mark:\nI saw that right after the 4.1 tag, a couple quick commits went in - one for a spell fix in CHANGES and one a build issue - it made me unsure about whether we had released the tag, or a rev with the two fixes that happened right after. Of course I suspect we released the tag, but an automated smoke test would make me feel better about trusting that.\n\nAfter I created the RC, I made those commits to the branch anticipating another RC, but I tagged the revision the RC was built from, so those commits aren't included there.\n\nThe dev-tools/scripts/buildAndPushRelease.py script creates the trailing dir name in the release staging RC URL (e.g. http://people.apache.org/~sarowe/staging_area/lucene-solr-4.1.0-RC1-rev1434440/), including the SVN revision, supplied by the svnversion program.  You can manually verify that the tag revision and the RC revision match once the tag has been created. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13565984",
            "date": "2013-01-29T23:55:03+0000",
            "content": "\nHowever, for one, I'd like to nuke the var expansion anyway\n\nPlease! "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13566621",
            "date": "2013-01-30T17:04:53+0000",
            "content": "I've created SOLR-4385 to address the var expansion. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13567315",
            "date": "2013-01-31T03:29:48+0000",
            "content": "The release process I followed and I think Robert followed, was to tag after a successful VOTE. Otherwise, the tag will be in the wrong place for some of the svn history.\n\nPerhaps we should start making rc tags and then move the final rc tag to the release tag - it looks like this is what the ZooKeeper project does - see Publishing: 1. Tag the release at https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToRelease\n\nThat seems a little cleaner - any thoughts on that? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13567317",
            "date": "2013-01-31T03:33:51+0000",
            "content": "Seems only like unnecessary additional work for the release manager.\n\nall of the RCs i generated have revXXXXXX in their name, so why create an svn tag?\n\nhttp://people.apache.org/~rmuir/staging_area/ "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13568036",
            "date": "2013-01-31T19:53:44+0000",
            "content": "Other differences I missed:\n\nNOTICE and README end up in root but are not there in svn, clover folder is excluded in dist (has license file)\n\nAlso expected. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717201",
            "date": "2013-07-23T18:47:27+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971034",
            "date": "2014-04-16T12:56:57+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}