{
    "id": "SOLR-2363",
    "title": "Rename the example \"dismax\" request handler instance",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It is misleading that one of the requestHandlers in the example schema is named the same as the queryParser \"dismax\". It creates confusion as to whether the use of defType=dismax vs qt=dismax. It would be better if the example requestHandler was named e.g. \"dismaxexample\"",
    "attachments": {
        "SOLR-2363.patch": "https://issues.apache.org/jira/secure/attachment/12471075/SOLR-2363.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-12994785",
            "date": "2011-02-15T13:45:37+0000",
            "content": "The DismaxRequestHandler and StandardRequestHandler are both deprecated and replaced with SearchHandler.\n\n\n\n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-12994786",
            "date": "2011-02-15T13:49:36+0000",
            "content": "Reopening. This issue is not talking about the old DisMaxRequestHandler but the example SearchHandler config named \"dismax\". \n\nWe should probably start using the name \"RequestHandler instance\" or similar for these entries. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-12994787",
            "date": "2011-02-15T13:49:56+0000",
            "content": "This patch renames the example requesthandler to \"dismaxexample\", updates the outdated comment with more proper reference to DisMaxQParser and switches to edismax as default. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-12994788",
            "date": "2011-02-15T13:51:30+0000",
            "content": "Just renaming issue to reflect that it's about a requesthandler instance "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12994793",
            "date": "2011-02-15T14:00:06+0000",
            "content": "ah - my bad.\n\nwhat about something more descriptive?  dismax is kinda cryptic.  maybe 'escaped', 'safe', or just 'query'\n\nThough i'm not convinced it really needs changing – we would also need to update all the documentation that refers to ?qt=dismax "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-12994817",
            "date": "2011-02-15T14:55:33+0000",
            "content": "bq: Though i'm not convinced it really needs changing – we would also need to update all the documentation that refers to ?qt=dismax\n\nI agree with Jan on this one. I distinctly remember having this confusion, and I've seen it go round multiple times on the user's list. Interestingly, I can't find anything on the Wiki where \"qt=dismax\" is in the text..\n\nbq:  I would suggest we have a qt=dismax that is plain vanilla,\n\nPlease no! The whole point is to avoid the confusion over qt=dismax and defType=dismax. \n "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-12994837",
            "date": "2011-02-15T15:20:26+0000",
            "content": "Also we must remember that it's only (supposed to be) an EXAMPLE schema. It's where most people start learning about Solr, request handlers and the like - thus it should not be confusing, but rather have super-clear comments helping the user get going.\n\nAlso, per definition, changing this in the example schema will not break anything anywhere \n\n&qt=robust or &qt=userfriendly or &qt=onesearchbox could be other alternatives? "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-12995589",
            "date": "2011-02-16T23:55:20+0000",
            "content": "This patch may need a slight change depening on whether edismax becomes the new dismax. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13000498",
            "date": "2011-02-28T20:18:02+0000",
            "content": "I agree that we should stop perpetuating the meme that dismax is a handler.\n\ni don't think we really need any specific example handler declaration just to show off dismax – the /browse example already demo's it – really we just need better docs about defType and the types of parsers that are available (and maybe some more exmaples in the /browse declaration of what params are available when you use defType=dismax)\n\nFWIW: i'm going to try and clean this up holisticly in my work on SOLR-2397 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13001016",
            "date": "2011-03-01T18:52:22+0000",
            "content": "dealt with in SOLR-2397, no longer have a handler named \"dismax\" "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013162",
            "date": "2011-03-30T15:45:44+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}