{
    "id": "SOLR-5671",
    "title": "Heisenbug #2 in DistribCursorPagingTest: full walk returns one fewer doc than expected",
    "details": {
        "affect_versions": "4.7",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Twice on Uwe's Jenkins, DistribCursorPagingTest has paged through a small number of indexed docs and retrieved one fewer doc than the number of indexed docs.  Both of these failures were on trunk on Windows:\n\nhttp://jenkins.thetaphi.de/job/Lucene-Solr-trunk-Windows/3708/\nhttp://jenkins.thetaphi.de/job/Lucene-Solr-trunk-Windows/3713/  \n\nI've also seen this twice on trunk on my OS X laptop (out of 875 trials).\n\nNone of the seeds have reproduced for me.\n\nAll the failures were using either Lucene41 or Lucene42 codec",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "ASF subversion and git services",
            "id": "comment-13882881",
            "date": "2014-01-27T15:21:42+0000",
            "content": "Commit 1561709 from Steve Rowe in branch 'dev/trunk'\n[ https://svn.apache.org/r1561709 ]\n\nSOLR-5671: increase logging to try and track down test failure "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13882884",
            "date": "2014-01-27T15:27:02+0000",
            "content": "Commit 1561711 from Steve Rowe in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1561711 ]\n\nSOLR-5671: increase logging to try and track down test failure (merged trunk r1561709) "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13882885",
            "date": "2014-01-27T15:27:10+0000",
            "content": "I committed a change to DistribCursorPagingTest that will print the details of the indexed doc(s) not returned by deep paging. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13896840",
            "date": "2014-02-10T18:48:31+0000",
            "content": "Given this...\n\nAll the failures were using either Lucene41 or Lucene42 codec\n\n... and the fact that (as far as i can tell) we haven't seen any more failures of this type since the codec constraints were added to the test in SOLR-5652, my hunch is that this is the same test bug manifesting itself in a slightly different way:  just as the non-deterministic behavior the docvalues w/missing value caused a doc to appear twice in SOLR-5652, shifting from it's originla position to a later position on a subsequent request, it's easily concievable that the same non-deterministic behavior could cause a doc to shift to an early position – prior to the current cursor page – on subsequent requests, causing that doc to be skipped entirely.\n\nI think we can go ahead and resolve this – if it does pop up again we can re-open (and we'll have the better assertion failure message steve added to help diagnose) "
        }
    ]
}