{
    "id": "SOLR-4030",
    "title": "Allow rate limiting Directory IO based on the IO context",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Allow setting rate limits for default,read,merge,flush.\n\n\n  <directoryFactory name=\"DirectoryFactory\" \n                    class=\"${solr.directoryFactory:solr.NRTCachingDirectoryFactory}\"> \n              <double name=\"maxWriteMBPerSecFlush\">20</double>\n              <double name=\"maxWriteMBPerSecMerge\">20</double>    \n  </directoryFactory>",
    "attachments": {
        "SOLR-4030.patch": "https://issues.apache.org/jira/secure/attachment/12560138/SOLR-4030.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13505161",
            "date": "2012-11-28T01:55:28+0000",
            "content": "This would be nice to add - could you update this patch to 5x trunk Radmin? "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13505790",
            "date": "2012-11-28T19:02:42+0000",
            "content": "it still merges into trunk cleanly. just do git pull "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13505840",
            "date": "2012-11-28T19:52:06+0000",
            "content": "it still merges into trunk cleanly. \n\nSure, it applies - it does not compile.\n\njust do git pull\n\nI'm using your patch and an svn checkout - no git to be found. "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13505855",
            "date": "2012-11-28T20:02:22+0000",
            "content": "but it failed to build with 5.x in jenkins. i will take a more detailed look on it "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13505866",
            "date": "2012-11-28T20:18:11+0000",
            "content": "LUCENE-4537 is cause. I will rework it but its not clear if new rate limiter is used for ordinary writes (not just merges) as well. "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13505892",
            "date": "2012-11-28T21:05:46+0000",
            "content": "added limits for reading, merging and writing. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13505908",
            "date": "2012-11-28T21:27:27+0000",
            "content": "Looks good. I'll look at adding a unit test. I'd also rather detect when no settings have been entered (all unlimited) and not wrap the dir with a rate limiting wrapper in that case.\n\nWe also do an instance of check in 4x against fsdir - so we should make that work with this. "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13508813",
            "date": "2012-12-03T15:46:32+0000",
            "content": "any progress on this? its trivial patch. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13527113",
            "date": "2012-12-08T11:49:06+0000",
            "content": "Why did you mark this as `not a problem`. This issue is not resolved. "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13527135",
            "date": "2012-12-08T13:16:00+0000",
            "content": "It was resolved for me. If you need this open your ticket. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13527176",
            "date": "2012-12-08T15:49:00+0000",
            "content": "Radim, maybe you can put your patch back?\n\nOther users could apply it / improve it, someone else may add a test case, etc., and it will eventually be committed.  The process takes time ...\n\nUntil Solr catches up, users can also look at ElasticSearch ... it's had IO throttling for a while now ( https://github.com/elasticsearch/elasticsearch/issues/2041 ) "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13527181",
            "date": "2012-12-08T16:13:41+0000",
            "content": "You guys had 1 month of time and wasted it. Now we fork and taking our patches with us. Case closed. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13527187",
            "date": "2012-12-08T16:30:28+0000",
            "content": "Now we fork\n\nForking is understandable when you have time pressure and other interests to satisfy. No problem there. Hopefully you can contribute back some of the work from your fork.\n\ntaking our patches with us.\n\nHow is that related to forking? I mean, sure, you can apply the patch on your own fork, but why does forking imply that you think you need to delete the posted patch?\n\nBesides, didn't you cede ownership of the patch to the community/ASF when you posted it? So, technically, it is no longer yours, right?\n\nIt sounds like you need a refresher course in \"Community 101\"! "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13527223",
            "date": "2012-12-08T18:29:59+0000",
            "content": "Unless you have written permission from us to distribute our work, you are losing court case against us after we prove to court that we are authors of code in question. We never lost such cases. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13527224",
            "date": "2012-12-08T18:34:25+0000",
            "content": "I will contact the board about what's going on here. Unfortunately, the custom JIRA plugin where you had to sign the ASF contribution by clicking the checkbox is no longer working with JIRA 5.2, now used by this server. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13527227",
            "date": "2012-12-08T18:37:54+0000",
            "content": "We've had the same issues with him at Apache Nutch. After contacting the board it was decided to restore the original patch but not include it in the source tree, and ignore it further. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13527228",
            "date": "2012-12-08T18:40:16+0000",
            "content": "Apache has a pretty clear record in these cases I think - if a contributor wishes to withdraw his own work - especially if it's not yet committed to the codebase - we should simply allow them to do so. I'm sure situations around this can get complicated, but this case does not seem complicated at all. These patches have only one author and they have not been committed yet. We are in the business of accepting patches from willing contributors.\n\nIf someone wants to see these features implemented, I'd suggested writing new patches. Neither issue is very large. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13527230",
            "date": "2012-12-08T18:43:22+0000",
            "content": "Thanks Markus. So restoring patches in JIRA actually works with help of infra, but this is useless here, as we would not use it in our source tree. And: He said it is trivial, so anybody who has interest in this functionality could write the code easily. So I see no problem and we just leave the issue open until somebody has the time to resolve this with a good patch.\n\nI think we should ignore Radim for any patches about Lucene and Solr, his social competence seems to be zero. I added a filter to my mail inbox. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13527232",
            "date": "2012-12-08T18:58:10+0000",
            "content": "if a contributor wishes to withdraw his own work - especially if it's not yet committed to the codebase - we should simply allow them to do so.\n\nThat makes sense at least for a short interval, except for the case of anyone who may have included the patch in their own fork and maybe even could be in production with it and is now in limbo or worse. In this specific instance the triviality and brief tenure of the patch kind of makes it moot, but for future instances now we have to think twice when recommending a non-committed patch. At a minimum, somewhere there needs to be a notice/warning that use and ownership of uncommitted patches is a potentially questionable and risky activity - and that permisssion can be revoked at any moment. And if the \"donate\" check box can't be restored, then there needs to be some mechanism for a donor to explicitly cede ownership, to at least confirm the donation even if its legal status may vary from jurisdiction to jurisdiction. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13527237",
            "date": "2012-12-08T19:14:41+0000",
            "content": "Keep issue open "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13527238",
            "date": "2012-12-08T19:16:08+0000",
            "content": "Lets not over-think this or make it too complicated guys...\n\nNo, you can't take back a contribution once it's been contributed. If/when it's been committed or not is just a detail.\nWe can normally choose not to commit it (the distinction is pretty important), and I think that's what we should do here.\n\nIf a contribution wasn't valid in the first place (i.e. someone saying... \"hey, this person didn't have permission to contribute X\") then we can figure that out on a case-by-case basis.  Hasn't happened yet here AFAIK. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13527242",
            "date": "2012-12-08T19:29:26+0000",
            "content": "@Yonik: I agree here, we should not overcomplicate it. Just ignore Radim (at least I will do this). My only problem here is the missing checkbox in JIRA, where the users from the beginning have to specify if they agree with the Apache License. In that case, Radim would not be able to go to court or think about it, because he agreed on publishing the patch by open source terms. The problem, as Jack now explain, is the case for external people, using this issue tracker as a source for their work. Maybe some company would have used Radim's patch for their own product! Nobody inform them that he removed his patch here.\n\nIn my opinion, you should not be able to at least remove patches in JIRA, but just offer the option to say at a later stage: \"I submitted the patch, but I need to undo that.\" This should be noted in the submit form, so anybody who is not sure if the patch can be added here, would not do it. If some patch really have to be deleted, only PMC members should be able to do this completely (like in SVN where you can revert, but you have no chance to completely remove the occurence - only SVN admins could really remove a commit completely).\n\nTo stop Radim editing this issues or reopen/close it, I set a new reporter. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13527244",
            "date": "2012-12-08T19:43:18+0000",
            "content": "The checkbox was never necessary - it's just that people became used to seeing it and started assuming it was.\nContributions to our software are under the ASL by default - one would need to explicitly state when adding something that looks like a contribution to our JIRA that it was in fact not a contribution (and that is what the old checkbox facilitated). "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13527247",
            "date": "2012-12-08T19:49:27+0000",
            "content": "Contributions to our software are under the ASL by default\n\nBut does any user who opens an issue knows this? The Apache Issue tracker is missing a extra page, referred from the create issue / upload patch page that all work done here is under ASL. My own issue tracker presents the terms and conditions to the user when using the issue tracker. "
        },
        {
            "author": "Radim Kolar",
            "id": "comment-13527260",
            "date": "2012-12-08T21:07:06+0000",
            "content": "Yes, i had similar issue with nutch project. Markus Jelsma reuploaded my patch back to JIRA and refused to delete it. Its still in JIRA violating my copyright laws. I decided not to escalate the conflict and go after ASF and harm other projects just because of misbehavior of one person. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13527288",
            "date": "2012-12-08T23:28:51+0000",
            "content": "Radim:\n\nAt some point, you might reflect upon the fact that the common element in your conflicts with various Apache projects is...you.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13527689",
            "date": "2012-12-10T02:27:55+0000",
            "content": "Here is a simple patch that lets you use a rate limited directory wrapper - you can set the rate for each of the io contexts that lucene provides. If no limited are configured, no rate limited directory wrapper is created. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13529235",
            "date": "2012-12-11T19:20:09+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1420336\n\nSOLR-4030: Allow rate limiting Directory IO based on the IO context. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13529243",
            "date": "2012-12-11T19:28:25+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1420340\n\nSOLR-4030: Allow rate limiting Directory IO based on the IO context. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13529244",
            "date": "2012-12-11T19:29:59+0000",
            "content": "I've added a test and committed. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13529274",
            "date": "2012-12-11T19:52:37+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1420341\n\nSOLR-4030: messed up import somehow "
        }
    ]
}