{
    "id": "SOLR-12737",
    "title": "Let Solr init script create SOLR_PID_DIR",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "6.6.5,                                            7.4",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "It would be great if the Solr init script could create the configured SOLR_PID_DIR with permissions for the Solr user, if it doesn't exist.\n\nThe use case is to store the PID file for the Solr service in a directory below the /run directory, which is typically mounted as tmpfs file system and empty after reboot. For example, with \"SOLR_PID_DIR=/run/solr\" in solr.in.sh, Solr will be unable to write its PID file after reboot because the solr subdirectory does not exist.",
    "attachments": {
        "init-script-mkdir-pid-dir.patch": "https://issues.apache.org/jira/secure/attachment/12942379/init-script-mkdir-pid-dir.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-09-05T14:49:22+0000",
            "content": "Simple patch attached. ",
            "author": "Andreas Hubold",
            "id": "comment-16604499"
        },
        {
            "date": "2018-10-04T23:14:59+0000",
            "content": "The patch assumes that every variable definition is at the very beginning of the line in the include script, but that is not a strict requirement for that file.  Things defined in that file still work if there is whitespace at the beginning of every line, but this directory creation wouldn't work if that were the case.\n\nSeems much better to source the file like bin/solr does, setting the variables in the environment, rather than rely on a very strict format requirement.\n\nThe init script is the correct place to do this.  If it were done in bin/solr, it wouldn't work because a regular user typically doesn't have permission to create directories in system locations like /run.\n\nI wonder if the group permission should be changed to $RUNAS as well (with output redirected to /dev/null just in case there's not a group with the same name as the user). ",
            "author": "Shawn Heisey",
            "id": "comment-16639021"
        }
    ]
}