{
    "id": "SOLR-11030",
    "title": "Add a test that fails if a collection API has no corresponding v2 API mapping in CollectionApiMapping class",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud",
            "v2 API"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.6",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "A few recently added collection APIs had no equivalent v2 endpoints. We should add a test that fails if a collection API has no corresponding v2 API mapping in CollectionApiMapping class so that it is no longer possible to write a v1 API without a v2 counterpart.",
    "attachments": {
        "SOLR-11030.patch": "https://issues.apache.org/jira/secure/attachment/12876252/SOLR-11030.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-08T17:25:47+0000",
            "content": "Took a quick stab at this, to at least show what it could look like.\n\nOf course, currently the test fails with the message: \"java.lang.AssertionError: All CollectionActions must have V2 mappings.  Currently unmapped: CREATESNAPSHOT, DELETENODE, DELETESNAPSHOT, MOVEREPLICA, MIGRATESTATEFORMAT, REPLACENODE, LISTSNAPSHOTS\"\n\nThis failure is at least partially expected: SOLR-11027, SOLR-11028, and SOLR-11029 involve creating v2 equivalents of MOVEREPLICA, DELETENODE, and REPLACENODE respectively.  And I suspect that MIGRATESTATEFORMAT should also have a JIRA to get a v2 mapping created.\n\nThat leaves the *SNAPSHOT internal commands, which aren't real APIs afaik.  I plan to add them to the list of exempted CollectionActions in the test, but I know very little about the Overseer, so I figured I'd mention it here first so someone can correct me if this is wrong.\n\nAs a side note, this test could be cleaner if the CollectionActions enum had an isApi boolean field to differentiate the true APIs from internal commands.  Wanted to see if anyone had any thoughts on doing that as a part of this patch. ",
            "author": "Jason Gerlowski",
            "id": "comment-16079238"
        }
    ]
}