{
    "id": "SOLR-9514",
    "title": "deprecate BALANCESHARDUNIQUE command if favor of the more generic ADDREPLICAPROP command",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "if there is anything missing in ADDREPLICAPROP we should add it",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-14T20:11:21+0000",
            "author": "Erick Erickson",
            "content": "From an offline conversation:\n\nBesides the background of why BALANCESHARDUNIQUE, the purpose of prefixing custom properties (as opposed to properties like node_name or base_url) is to keep users from overwriting important properties. If we have some kind of list of \"reserved\" properties we run into maintenance issues when we add property N+1.\n\nAt least that was the original reasoning, whether it was good reasoning or not is TBD. ",
            "id": "comment-15491342"
        },
        {
            "date": "2016-09-15T07:18:19+0000",
            "author": "Noble Paul",
            "content": "is to keep users from overwriting important properties\n\nWe  must restrict users from overwriting well-known properties such as node_name and base_url\n\nso, what happens when a user does invokes command=SETREPLICAPROP&property=node_name&value=mynodename. This will result in a new property in the state.json as property.node_name=mynodename\n\nSo, we never have a collision of property names ",
            "id": "comment-15492621"
        },
        {
            "date": "2016-09-15T08:19:18+0000",
            "author": "Noble Paul",
            "content": "interestingly, we already have a ADDREPLICAPROP and REMOVEREPLICA prop commands which do the same \n\nhttps://cwiki.apache.org/confluence/display/solr/Collections+API#CollectionsAPI-AddReplicaProp  ",
            "id": "comment-15492725"
        },
        {
            "date": "2016-09-15T15:22:45+0000",
            "author": "Erick Erickson",
            "content": "bq: interestingly, we already have a ADDREPLICAPROP and REMOVEREPLICA prop commands which do the same\n\nProbably where I stole the idea from. Which begs the question of whether the proper thing to do is just deprecate/remove BALANCESHARDUNIQUE altogether and make onePerShard an option on ADDREPLICAPROP. I'm all for removing code when possible. ",
            "id": "comment-15493640"
        },
        {
            "date": "2016-09-15T15:34:43+0000",
            "author": "Noble Paul",
            "content": "Yes, we should deprecate BALANCESHARDUNIQUE and make ADDREPLICAPROP & REMOVEREPLICAPROP do the job. If there is something missing we can add to these commands ",
            "id": "comment-15493685"
        }
    ]
}