{
    "id": "SOLR-6448",
    "title": "Improve SolrJ support for Collections API",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Right now SolrJ doesn't really support all of the collections API.\nThis is a parent issue for bringing SolrJ support for all APIs up to where it should be.",
    "attachments": {
        "SOLR-6448.patch": "https://issues.apache.org/jira/secure/attachment/12688820/SOLR-6448.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Varun Thacker",
            "id": "comment-14136995",
            "date": "2014-09-17T09:25:44+0000",
            "content": "A few things that I noticed when looking at this - \n\n1. The async API call is only supported in the CREATE SolrJ call. It's supported in all of the collection APIs right? We should support it in all of it's equivalent SolrJ calls then\n2. In SOLR-6073 we moved to a builder pattern. We should make the collection api calls immutable\n\nFor example this is what the API calls should look like\n\n    new Create.CreateBuilder(\"testasynccollectioncreation\")\n        .numShards(1)\n        .configName(\"conf1\")\n        .asyncId(\"1001\")\n        .build().process(server);\n\n\nWe can then have all the variables in the Create class be final. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14137504",
            "date": "2014-09-17T16:33:34+0000",
            "content": "The async API call is only supported in the CREATE SolrJ call.\nIt is actually supported by CREATE, DELETESHARD, ADDREPLICA (I think every command that supports Async). Also, not all APIs support Async as of now (though I think most of it ideally should).\n\nWe should make the collection api calls immutable\nThat would translate to a back compat break. Not sure if we want that. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14137533",
            "date": "2014-09-17T16:48:46+0000",
            "content": "About asyncid support, you're partially right.\nNot all of the calls I mentioned above support AsyncId in SolrJ but a few do. e.g. \nCollectionAdminRequest.CreateShard.getParams()  calls getCommonParams which handles AsyncId. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14256777",
            "date": "2014-12-23T09:29:49+0000",
            "content": "Initial patch that adds SolrJ support for:\n\n\tDeleteReplica\n\tClusterProp\n\tMigrate\n\tAddRole\n\tRemoveRole\n\tOverseerStatus\n\tClusterStatus\n\tList\n\tAddReplicaProp\n\tDeleteReplicaProp\n\tBalanceShardUnique\n\tRebalanceLeaders\n\n\n\nWorking on the tests. Should have those tomorrow.\nThis isn't perhaps the most optimal (best designed) way to do this but it gets us a public API. I want to add basic checks etc. in here to fail fast in case of trivial problems with the request. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14258162",
            "date": "2014-12-24T10:29:28+0000",
            "content": "Updated patch with tests. Need to clean up a few things, might have to restructure a bit but it's almost done for this bit.\nI haven't created any specific CollectionAdminResponse sub-types, specific to the request. Will take that up in the next phase (if I can't get to that by the new year). "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14258718",
            "date": "2014-12-25T10:42:28+0000",
            "content": "Still trying to wrap up one test (BALANCESHARDUNIQUE). In the middle of validating that all supported SolrJ methods (for each of the Collection API calls) are actually supported. Once that's done, should be able to commit it and with SolrJ supporting all Collection API calls, it should be a merry christmas!  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14258721",
            "date": "2014-12-25T11:03:11+0000",
            "content": "Still trying to wrap up one test (BALANCESHARDUNIQUE).\n\nIsn't that and REBALANCELEADERS no longer in 5.0? See SOLR-6691 "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14258801",
            "date": "2014-12-25T16:19:07+0000",
            "content": "BALANCESHARDUNIQUE works fine in 5.0; it correctly updates the cluster state so I left it in 5.0. It may not be useful since the use-case I intended it for is REBALANCELEADERS, but it's still there.\n\nREBALANCELEADERS OTOH, was pulled from 5.0.\n\nI put REBALANCELEADERS back in to trunk last night (along with a bad svn EOL style, siiiiggggh) and I'll back-port after 5.0 is cut.\n\nAnshum Gupta There are a bunch of tests in TestReplicaProperties that might be be useful models. Those tests do the functionality pretty thoroughly, maybe it would be enough for the SolrJ tests to do more minimal testing? Also ReplicaPropertiesBase has some helper methods that you might find useful. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14258831",
            "date": "2014-12-25T18:34:19+0000",
            "content": "Shalin, as Erick mentioned, REBALANCELEADER was not in there but BALANCESHARDUNIQUE is.\nThat list that I put up with my comment is wrong as I never put in RebalanceLeaders in there. The rest is all fine.\n\nConsidering, REBALANCELEADER is only in trunk now, I'll leave that out for now and open another issue for just that and handle it after 5x is out. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14258843",
            "date": "2014-12-25T19:48:52+0000",
            "content": "Works for me, thanks! "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14260474",
            "date": "2014-12-29T21:59:46+0000",
            "content": "Final patch. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14260499",
            "date": "2014-12-29T22:37:46+0000",
            "content": "A few more test fixes and a back-compat fix too i.e. deprecating a public call instead of direct removal. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14260545",
            "date": "2014-12-29T23:37:06+0000",
            "content": "Commit 1648446 from Anshum Gupta in branch 'dev/trunk'\n[ https://svn.apache.org/r1648446 ]\n\nSOLR-6448: SolrJ support for all Collection API calls "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14260573",
            "date": "2014-12-29T23:58:37+0000",
            "content": "Commit 1648447 from Anshum Gupta in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1648447 ]\n\nSOLR-6448: SolrJ support for all Collection API calls (merge from trunk) "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-14332667",
            "date": "2015-02-23T05:01:14+0000",
            "content": "Bulk close after 5.0 release. "
        }
    ]
}