{
    "id": "SOLR-4882",
    "title": "Restrict SolrResourceLoader to only classloader accessible files and instance dir",
    "details": {
        "affect_versions": "4.3",
        "status": "Resolved",
        "fix_versions": [
            "4.6",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SolrResourceLoader currently allows to load files from any absolute/CWD-relative path, which is used as a fallback if the resource cannot be looked up via the class loader.\n\nWe should limit this fallback to sub-dirs below the instanceDir passed into the ctor. The CWD special case should be removed, too (the virtual CWD is instance's config or root dir).\n\nThe reason for this is security related. Some Solr components allow to pass in resource paths via REST parameters (e.g. XSL stylesheets, velocity templates,...) and load them via resource loader. By this it is possible to limit the whole thing to\nnot allow loading e.g. /etc/passwd as a stylesheet.\n\nIn 4.4 we should add a solrconfig.xml setting to enable the old behaviour, but disable it by default, if your existing installation requires the files from outside the instance dir which are not available via the URLClassLoader used internally. In Lucene 5.0 we should not support this anymore.",
    "attachments": {
        "SOLR-4882.patch": "https://issues.apache.org/jira/secure/attachment/12585600/SOLR-4882.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13670798",
            "date": "2013-05-30T22:03:12+0000",
            "content": "... In Lucene 5.0 we should not support this anymore.\n\nFWIW: it's not hard to imagine situations where people have legitimate desire for using absolute paths like this.  ie: loading synonyms or stop words from some central location outside of their solr home dir (eg: /etc/solr-common/stopwords/en.txt, used by multiple solr instances, with diff solr home dirs, running on diff ports.  \n\nWith that in mind, I don't think it makes sense to completely remove this ability – but it certainly makes sense to disable it by default and document the risks.\n\nIn 4.4 we should add a solrconfig.xml setting to enable the old behaviour, but disable it by default...\n\nGiven the lifecycle of the resource loaders, it may not be easy to have this configuration per-core in solrconfig.xml.  I'm also not sure if it's worth adding as a solr.xml config option given the complexities in how that file is peristet after core operations (and how many times we've screwed ourselves adding things to that file)\n\nGiven that this is something (i think) we should generally discourage, and something that i don't think we should be shy about making \"hard\" to turn on, it might be enough just to say that the only way you can enable it is with an explicit (and scary named) system property that affects the entire Solr instance?\n\n\n\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13671398",
            "date": "2013-05-31T12:34:41+0000",
            "content": "Attached is the patch implementing this with a system property.\n\nThe patch revisits the current logic of the open resource call of SolrResourceLoader and also fixes some possible bugs. It also uses the \"hack\" to make tests work only when the test mode of Solr is enabled. This closes more \"leaks\" that can be used.\n\nThis should also improve security of velocity templates, i am not sure about their functionality but they are also loaded by SolrResourceLoader, as far as I see. This reduces more attack vectors.\n\nAll tests pass, some tests had to be changed:\n\n\t2 tests needed the sysprop set, because they were explicitely testing the access to absolute paths\n\tSome missing close() on SolrResourceLoader was added to get rid of warnings in Eclipse.\n\tOne test was changed to SolrTestCaseJ4, so the test mode was correctly enabled (this was not needed before, so it extended LuceneTestCase only)\n\n\n\nThe Solr example starts successfully and I have seen no problems. If you are affected by this change you get an IOException warpped by the SolrException explaining that you may enable the mode for escaping the restricted resource loader.\n\nThe test if the path is from inside the restricted path is done by transforming the file paths (absolute path, not canonic path, to enable playing with symlinks pointing from Solr conf directory to the outside) to URIs and then trying to relativize the URI, which is only possible if the normalized (./.. removed) URIs start with the same prefix and are not opaque. If this fails, the paths are considered as not related and the restriction is enforced.\n\nTell me what you think, Hoss & others. We don't need to hurry. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13671399",
            "date": "2013-05-31T12:35:57+0000",
            "content": "Ah patch is against branch_4x, because I was expecting to remove the absolute path mode from trunk, so I wanted the merge this way. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13671447",
            "date": "2013-05-31T13:23:06+0000",
            "content": "Probably good enough. An alternative to allow-everything could be a config option safePaths=/etc/solr/conf,/ext/other/path option to let RL see selected safe paths outside instanceDir. Windows users don't have symlinks so this could be nice for htem.\n\nHow do paths work when under ZK? Is it allowed to do ../../some/path to read ZK data outside \"conf\"? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13671482",
            "date": "2013-05-31T14:03:25+0000",
            "content": "How do paths work when under ZK? Is it allowed to do ../../some/path to read ZK data outside \"conf\"?\n\nNo idea at all. I don't know how ZK works, I only know that ZK gets queried with the full path, I have no idea if ../ and stuff works at all with ZK. I think Mark can explain. I just fixed one small thing in the ZKResourceLoader, unrelated to ZK (the slashes when querying classloader must be forward).\n\nProbably good enough. An alternative to allow-everything could be a config option safePaths=/etc/solr/conf,/ext/other/path option to let RL see selected safe paths outside instanceDir. Windows users don't have symlinks so this could be nice for htem.\n\nWindows 7 and Server 2008 have symlinks. Nevertheless, this was the question to Mark miller. We have a hierarchy of SolrResourceLoaders (one for the startup and one for each core). Ideally, we would atomatically allow access to the directories of the parent ResourceLoader. Unfortunately, there is currently only a hierrarchy in the ClassLoaders not in the SolrResourceLoader as a whole (the core SolrResourceLoaders are not childs of the parent SolrResourceLoader, only the inner ClassLoaders use the hierarchy. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13671506",
            "date": "2013-05-31T14:19:34+0000",
            "content": "I found maybe another security problem with velocity (have to investigate). By default it uses SolrResourceLoader to find vm files, but it may also fall back to config directory (if not in zookeeper mode). We should probably simply disable this (the file resource loader) in VelocityResponseWriter#getEngine(). SolrResourceLoader and the special params resource loader should be way enough to find the templates, everything else makes it unmaintainable. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13671510",
            "date": "2013-05-31T14:23:14+0000",
            "content": "Patch that removes the legacy resource loader from velocity. It now only uses the SolrResourceLoader (wrapped) and the ParameterResourceLoader.\n\nAs SolrResourceLoader can also read files from the instance dir, there is no backside, but you can no longer escape the sandbox. Also the special setting for the base dir to velocity default file loader was removed, as it allowed to change the \"base\" dir for loading vm files to be changed from the request URL -> same problem as the XSL issues "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717396",
            "date": "2013-07-23T18:48:07+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13773716",
            "date": "2013-09-21T03:57:06+0000",
            "content": "Hi,\n\nnobody commented on this issue, so I think the current patch is fine. I would like to commit this for 4.6.\n\nAfter that is resolved, we can also do SOLR-5234. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13773825",
            "date": "2013-09-21T14:33:24+0000",
            "content": "Here is the final patch for trunk. I also added a test that checks for escaping instance dir "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13773831",
            "date": "2013-09-21T14:54:28+0000",
            "content": "Commit 1525246 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1525246 ]\n\nSOLR-4882: Restrict SolrResourceLoader to only allow access to resource files below the instance dir "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13773832",
            "date": "2013-09-21T14:58:33+0000",
            "content": "Commit 1525248 from Uwe Schindler in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1525248 ]\n\nMerged revision(s) 1525246 from lucene/dev/trunk:\nSOLR-4882: Restrict SolrResourceLoader to only allow access to resource files below the instance dir "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13836421",
            "date": "2013-12-02T11:01:34+0000",
            "content": "Commit 1546958 from Uwe Schindler in branch 'dev/branches/lucene_solr_3_6'\n[ https://svn.apache.org/r1546958 ]\n\nSOLR-5520: Backport of SOLR-4882 (SolrResourceLoader was restricted to only allow access to resource files below the instance dir) "
        }
    ]
}