{
    "id": "SOLR-5665",
    "title": "Would like a 'REBUILD' method in the collections api to reconstruct missing cores",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Test Scenario:\n   Multinode solrCloud deployment\n   Completely delete one of those nodes\n   Bring it back online empty (no cores, no indexes at all)\n   Node will come up with each of the replicas in recovery mode and they will stay there forever since the cores don't actually exist.\n\nI've written a small external script that goes and gets the  collections/shards/replicas->core mapping from clusterstate.json, and then calls the core create url for each core that is in a down state. This was relatively easy to implement externally - and should be even more trivial to implement inside of the collections api. \n\nI envision this to apply this to all collections:\n\nhttp://localhost:8983/solr/admin/collections?action=REBUILD\n\nand this to apply the operation to a single collection:\n\nhttp://localhost:8983/solr/admin/collections?action=REBUILD&name=collname\n\nIndependently, I'd like to see this sort of \"server is blank, recreate missing automatically\" triggered automatically, but I can see where that might not be expected behavior.",
    "attachments": {
        "recreate-solr-cores.pl": "https://issues.apache.org/jira/secure/attachment/12625188/recreate-solr-cores.pl"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Nathan Neulinger",
            "id": "comment-13881920",
            "date": "2014-01-25T15:13:57+0000",
            "content": "simple example perl script to do it as an example of how trivial it is.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13881938",
            "date": "2014-01-25T16:04:17+0000",
            "content": "This type of functionality will be part of the \"ZooKeeper is cluster truth\" mode that is being developed. Rather than being a command, I think it should actually be fairly automatic. "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13882317",
            "date": "2014-01-26T14:54:54+0000",
            "content": "Response indicates it'll be addressed with future functionality in a different way.\n\nAttached script is available if anyone wants it or you want to stick it in contrib.  "
        }
    ]
}