{
    "id": "SOLR-70",
    "title": "ping.jsp is very naive -- doesn't work with \"qt\" or any extra query args",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "while reviewing SOLR-58 i noticed that ping.jsp is extremely naive about the types of requests it can use to sanity check the index, in particular:\n\n\tit treats the first query param that starts with \"q\" as the query string (like for example \"qt\")\n\tit ignores all other query params\n\n\n\n...this makes it worthless to try and configure anything but the standard querest handler with no options as your ping URL.",
    "attachments": {
        "ping.patch": "https://issues.apache.org/jira/secure/attachment/12346825/ping.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12457040",
            "date": "2006-12-09T02:06:38+0000",
            "content": "improvement of the parsing, along with a comment in the example solrconfig.xml about exactly what kind of string should be in <pingQuery>\n\n...fixed the issue where all params were ignored, and the first param that started with a \"q\" was used as a query (\"qt\" for example) but didn't try to change the format, or add any url-unescaping. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12458314",
            "date": "2006-12-14T00:19:53+0000",
            "content": "commited variation of patch which worked against trunk (with newer XML based pages) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589334",
            "date": "2008-04-15T23:56:42+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}