{
    "id": "SOLR-7930",
    "title": "Comment out trappy references to example docs in elevate.xml files",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.2",
            "7.0"
        ],
        "affect_versions": "5.3,                                            6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "What do people think about this? QEV, especially with the default example is trappy when someone defines the <uniqueKey> as something other than a string.",
    "attachments": {
        "SOLR-7930.patch": "https://issues.apache.org/jira/secure/attachment/12816367/SOLR-7930.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-17T04:42:24+0000",
            "author": "David Smiley",
            "content": "In which solrconfig.xml?  Based on the 3 configsets we have, it doesn't appear there is a problem:\n\n\t\"basic\": doesn't have QEC.\n\t\"data_driven_schema_configs\": I don't think you'd go modifying the ID of a data driven config?  I\n\t\"sample_techproducts_configs\": This is no longer the default template many people choose; it's now just an example.  I don't think we should change it for this.\n\n\n\nIn the end, what may be needed is a clearer error message should this mistake be made. ",
            "id": "comment-14699011"
        },
        {
            "date": "2016-07-06T04:39:14+0000",
            "author": "Erick Erickson",
            "content": "OK, I'm trying to clear out some backlog and came back to this. I think the right thing to do here is just comment out all of the entries in the elevate.xml config files.\n\nThe trappy bit is that a user whose never even heard of QEV changes the <uniqueKey> to something like \"long\" and suddenly can't load the core or create a collection. Because we've included an example elevations that are only relevant to the sample techproducts docs.\n\nIf someone intentionally changes the QEV component then I think the stack trace is sufficient since it makes sense in that context. And at least they're working with QEV so have incentive to look.\n\nI'll check this in tomorrow sometime unless there are objections. ",
            "id": "comment-15363763"
        },
        {
            "date": "2016-07-06T22:05:54+0000",
            "author": "Erick Erickson",
            "content": "BAH. I mis-typed the JIRA. The hashes for this checkin were:\n\nmaster: db295440a6a9aa0d43a2611c81331feda50a5834\n6x: 6a278333f2836d47c189ac95d2af9d465f22c676 ",
            "id": "comment-15365203"
        },
        {
            "date": "2016-08-26T14:00:33+0000",
            "author": "Michael McCandless",
            "content": "Bulk close resolved issues after 6.2.0 release. ",
            "id": "comment-15439044"
        }
    ]
}