{
    "id": "SOLR-1079",
    "title": "Rename omitTf to omitTermFreqAndPositions",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "documentation",
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "LUCENE-1561 has renamed omitTf.\n\nSee http://www.lucidimagination.com/search/document/376c1c12dd464164/lucene_1561_and_omittf",
    "attachments": {
        "SOLR-1079.patch": "https://issues.apache.org/jira/secure/attachment/12404682/SOLR-1079.patch",
        "SOLR-1079-fixcompilation.patch": "https://issues.apache.org/jira/secure/attachment/12404871/SOLR-1079-fixcompilation.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12688078",
            "date": "2009-03-21T21:13:30+0000",
            "content": "We need to get the latest lucene libs and adjust our code, but I'd vote for keeping our schema flag as \"omitTf\" for the following reasons:\n\n\n\tomitTermFreqAndPositions is looong\n\tit's not comprehensive anyway - omitTermFreqAndPositionsAndPayloads? ;-P\n\tand still... some people may not realize that phrase queries need positions, or that things that don't look like phrase queries may get turned into phrase queries (foo-bar and WDF for example).\n\tmost Solr users don't need to know what it does... we default non-text fields to use omitTf... text fields should always default to that.\n\talmost no one will have pre-conceived notions about what \"omitTf\"  will do anyway... they will need to look at the description. Hence this is really only a documentation problem, not a naming problem.\n\n\n\nOn the other side of the coin.... if we do the correct defaults (which I believe we do) then omitTermFreqAndPositions  would  rarely appear in anyone's schema anyway.  Only the most advanced user would choose to change the defaults and for them a consistency with lucene naming may be desired?\n\nAfter all that, I guess I should have argued against Lucene renaming omitTf... and at this point Solr should probably just follow suit?\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12688102",
            "date": "2009-03-22T06:30:08+0000",
            "content": "almost no one will have pre-conceived notions about what \"omitTf\" will do anyway... they will need to look at the description. Hence this is really only a documentation problem, not a naming problem.\n\nGood point! It if confuses me, I'm sure to check the documentation before changing it.\n\nI'm open to keeping it as is or changing it to conform to Lucene. I don't think it matters too much. \n\nMy main goal is to make everybody aware of Lucene's changes and to have more documentation on this. Neither the example schema nor the SchemaXml wiki page have any details about omitTf. The only place it is mentioned is the change log. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12688104",
            "date": "2009-03-22T07:08:37+0000",
            "content": "keeping it short is better . The documentation can have details .  "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12688382",
            "date": "2009-03-23T19:05:19+0000",
            "content": "I agree with shorter is better... though we should avoid cryptic or misleading.  I think omitTf is misleading.  I'd rather we think of something that's maybe less descriptive (since one will need to look at the docs anyway), but not misleading (making the person think looking at the docs is not necessary)\n\nmaybe omitTerm<something>?  \"Info\"?  That would sort of match Lucene's TermInfo object (which doesn't encompass Payloads, though). "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12688386",
            "date": "2009-03-23T19:26:46+0000",
            "content": "I disagree that \"omitTf\" is misleading... one would already have to be an expert to assume that it meant anything.\nBut while I started arguing one way in my previous message, I convinced myself of the opposite by the end - we should just rename to whatever it is in Lucene since the flag will pretty much never appear in Solr schemas anyway. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12688781",
            "date": "2009-03-24T18:34:30+0000",
            "content": "we should just rename to whatever it is in Lucene since the flag will pretty much never appear in Solr schemas anyway. \n\nreading the msgs in order, you convinced me, and then you un-convinced me, and then you re-un-convinced me.\n\nas long as it's going to be an option 99% of the world doesn't need to know about, and will need lots of documentation to explain anyway, it might as well be a long name that's consistent with the underlying java code. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12695931",
            "date": "2009-04-05T22:39:31+0000",
            "content": "Patch to rename omitTf to omitTermFreqAndPositions.\n\nDo we all agree that we should go with whatever name Lucene selects? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12695934",
            "date": "2009-04-05T22:51:44+0000",
            "content": "Please ignore the last patch. Some more changes are required. I'll post a new one soon. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-12696700",
            "date": "2009-04-07T19:16:09+0000",
            "content": "This is a first patch to remove the dummy implementation of Fieldable in QueryComponent (its not needed). This private class prevents the usage of Lucene 2.9 trunk without modifying the source (as the interface changed again in 2.9).\nThis patch just removes the FieldAble implementation colpletely and uses a conventional Out-Of-The-Box-Field to do the same. It is initialized like the StringFieldable at the beginning an then reused. The fieldname and initial value are just dummies and Field.Store.YES is used to make the Field c'tor happy.\n\nAll tests pass. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12697417",
            "date": "2009-04-09T07:29:49+0000",
            "content": "Attached new patch which includes Uwe's changes to QueryComponent.\n\nWe'd need to commit this issue, SOLR-940 updates and new lucene jars in one go to avoid compilation failures. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12697599",
            "date": "2009-04-09T18:49:23+0000",
            "content": "Just got back from vacation... \nDo we all agree that we should go with whatever name Lucene selects?\n\n+1 "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12698209",
            "date": "2009-04-12T11:06:41+0000",
            "content": "Committed revision 764291 as part of SOLR-940 changes. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775693",
            "date": "2009-11-10T15:51:59+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}