{
    "id": "SOLR-9590",
    "title": "Service installation -- save breadcrumbs for other scripts to use",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "When I opened SOLR-7826, I brought up the idea of installation breadcrumbs.\n\nIf we had good breadcrumb data saved in the install directory by the install script, a number of other scripts could use the breadcrumbs to gather relevant data about the service installation, for additional safety and more automatic operation.\n\nThe \"bin/solr create\" command could verify that it is running as the exact same user that installed Solr, and abort if they don't match.\n\nWhat if zkcli.sh (and bin/solr zookeeper options) no longer needed to be told where zookeeper was, because it could find its way to /etc/default/<service>.in.sh or $SOLR_HOME/solr.xml and grab zkHost from there?  The same thing could happen for zkHost in the idea that I filed as SOLR-9587.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-10-02T13:35:24+0000",
            "author": "Jan Høydahl",
            "content": "Also see related (not a pure duplicate though) SOLR-9272, we can resolve zk for a running Solr if we know the port. ",
            "id": "comment-15540367"
        },
        {
            "date": "2016-10-03T15:39:02+0000",
            "author": "Shawn Heisey",
            "content": "For success, a first step on the breadcrumb trail needs to be a filename that will be identical on every installation.  It must be a filename that will not ever be confused for any other purpose.  The info in that file can be used directly, or as a way to locate further configuration information in other config files.  Automation is the whole idea, so this file would not normally be hand-edited.\n\nHere's some ideas that I came up with for the filename:\n\n/etc/default/solr.crumbs\n/etc/solr.crumbs\n\nIn an actual install directory, we can have a file with a name like \"solr.servicename\" that contains the name of the service, which is given to the installation script as the -s option.\n\nAlthough in most cases I would expect there to only be one service installed, the crumbs file could contain info about multiple installs.  The contents might look something like this:\n\n\nsolr.servicenames=solr,solr6,mysolr\nsolr.solr.zkHost=localhost:9984\nsolr.solr.port=8984\nsolr.solr.install=/opt/solr\nsolr.solr.home=/var/solr\nsolr.solr.zkPort=9984\nsolr.solr6.zkHost=zoo1.example.com:2181,zoo2.example.com:2181,zoo3.example.com:2181\nsolr.solr6.port=8983\nsolr.solr6.install=/opt/solr6\nsolr.solr6.home=/var/solr6\nsolr.mysolr.port=8988\nsolr.mysolr.install=/opt/mysolr\nsolr.mysolr.home=/var/mysolr ",
            "id": "comment-15542693"
        }
    ]
}