{
    "id": "SOLR-575",
    "title": "Highlighting spans should merge across phrase query",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Somewhat related to but separate from SOLR-553,\n\nIt would be nice if the highlighter component \"joined\" the formatter tags across an entire PhraseQuery.\n\ne.g. \n\nLights (Live) : <span>I</span> <span>Love</span> <span>You</span> But <span>I've</span> <span>Chosen</span> <span>Darkness</span> :\n\nshould really be\n\nLights (Live) : <span>I Love You But I've Chosen Darkness</span> :\n\nassuming the query that generated these fragments was \"I Love You But I've Chosen Darkness\"\n\nI assume there's issues with stopwords (the But in the name was not formatted)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12621525",
            "date": "2008-08-11T17:57:29+0000",
            "content": "With the current API, I just don't see this happening. Tokens are given one at a time to be 'lit and returned - these formatted pieces are used to build up the fragments. Even trying to play tricks, I just don't think this issue is cleanly doable.\n\nWith an alternate approach (one that didn't hand off individual tokens for highlighting) its easy enough, but I don't see the approach changing soon.\n\nIt would almost be less of a hassle, if for some reason you really needed this, to just post process and merge continuous spans with regex or something. You still have the issue of stopwords that are not 'lit, etc but they are a lot easier to overcome than the API limitations of the Highlighter framework. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12622691",
            "date": "2008-08-14T20:55:50+0000",
            "content": "Brian, perhaps something as simple as the java equivalent of s/\"</span> <span>\"//g might work? "
        },
        {
            "author": "Brian Whitman",
            "id": "comment-12622695",
            "date": "2008-08-14T21:00:08+0000",
            "content": "Sure, post-processing is somewhat easy, except for stopwords (note the But in the example) – it's just one of those quality-of-life concerns \n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12674127",
            "date": "2009-02-17T07:29:28+0000",
            "content": "Marked for 1.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872623",
            "date": "2010-05-27T22:09:25+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043852",
            "date": "2011-06-03T16:47:23+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106275",
            "date": "2011-09-16T14:50:21+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234739",
            "date": "2012-03-21T18:09:07+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717430",
            "date": "2013-07-23T18:48:13+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971359",
            "date": "2014-04-16T12:57:52+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15582170",
            "date": "2016-10-17T12:56:17+0000",
            "content": "Ancient issue against the unknown highlighter. I suspect this is no longer relevant and we have UniversalHighlighter in the works as well.\n\nClose? "
        },
        {
            "author": "David Smiley",
            "id": "comment-15582381",
            "date": "2016-10-17T14:15:49+0000",
            "content": "It's \"UnifiedHighlighter\" but I like your name too \n\nThe issue here is valid – AFAIK no highlighter works as the o.p. wants it to.  I can imagine how the UH could be modified to work this way... – by having PhraseHelper produce one PostingsEnum per SpanQuery (what a phrase is converted into) instead of wrapping/filtering PE's given to it.  Then, instead of producing one position per underlying-term, it could produce one virtual position of the span.  This would only be applicable to phrase queries without slop; not other position sensitive queries or span queries generally.  It might improve passage relevance too. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15582430",
            "date": "2016-10-17T14:35:19+0000",
            "content": "Ok, good to know it is a live one.\n\nSo, what's the next action? Leave it as a suggestion against master? Or something more specific? "
        },
        {
            "author": "David Smiley",
            "id": "comment-15582649",
            "date": "2016-10-17T16:16:47+0000",
            "content": "It's a \"wish-list\" feature.  It could happen; leave it open.  IMO I don't think wish-list features should be assigned to a particular fix-version.... it just leads to \"Move issue to\" etc. comments on each release.\n\nIt was nigh impossible against the standard Highlighter.java for which this issue was created against back in 2008.  At the time we had only one highlighter. Now we have highlighters where this feature request is plausible. "
        }
    ]
}