{
    "id": "SOLR-1976",
    "title": "Commit on StreamingUpdateSolrServer can happen before all previously added docs have been sent to Solr",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Because of it's multi-threaded nature, calling commit on StreamingUpdateSolrServer  can send the commit before all the added documents have been sent to Solr.  Calling blockUntilFinished() does not change this.  It needs to be possible to send a commit that will commit all the documents that have been added previously.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12886441",
            "date": "2010-07-08T20:04:50+0000",
            "content": "Can you expound on this? It should block until all threads are done adding before doing the commit - are you seeing a bug? "
        },
        {
            "author": "Stephen Duncan Jr",
            "id": "comment-12886444",
            "date": "2010-07-08T20:10:44+0000",
            "content": "Yes, I'm seeing a bug.  In my testing the commit is happening immediately, not waiting for the threads to be done adding.  So I can see the following in my logs (and matching behavior from Solr):\n\nadd\nadd\ncommit\nadd\n\nEven though my code was:\n\nadd\nadd\nadd\nblockUntilFinished\ncommit "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12886455",
            "date": "2010-07-08T20:32:27+0000",
            "content": "Interesting - well to start, there does look to be at least one synchronization issue - \n\nrunners is protected by a lock on runners itself in every place but blockUntilFinished - where it is protected by a lock on the StreamUpdateSolrServer instance.\nThat looks like a problem, though I'm not sure its the only one, or yours. "
        },
        {
            "author": "Stephen Duncan Jr",
            "id": "comment-12886845",
            "date": "2010-07-09T19:23:18+0000",
            "content": "That does look like a problem, but I tested after changing blockUntilFinished to have a synchronized block on runners around its body, and it did not fix my issue. "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13255460",
            "date": "2012-04-17T10:53:16+0000",
            "content": "I tried to reproduce this with a testcase but so far after doing few thousand iterations of clean, add, commit, check result-size: no success\n\nStephen: can you provide a testcase that show this error? "
        },
        {
            "author": "Stephen Duncan Jr",
            "id": "comment-13255472",
            "date": "2012-04-17T11:08:32+0000",
            "content": "I have not been able to reproduce this with newer versions of Solr. "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13255474",
            "date": "2012-04-17T11:10:58+0000",
            "content": "Thanks for getting back. I'll resolve this issue then. "
        }
    ]
}