{
    "id": "SOLR-1114",
    "title": "Re-organize examples directory keeping core and contribs in mind",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Re-organize examples directory keeping core and contribs in mind.\n\nFrom Grant on solr-dev:\n\nThe templates directory would contain the configurations (i.e. schema.xml and solrconfig.xml) and any sample docs (but not the libraries) for:\n       tutorial - The current tutorial example\n       dih - The DIH example\n       extraction - Solr Cell example\n       geo - geo spatial example (once 773 is committed)\n       clustering - once SOLR-769 is committed\n       simple - A barebones schema and config (mainly used for bootstrapping a new project for experienced users)\n       exploratory - Basically, the same as simple, but the schema defines a single dynamic field -  Think of Hoss's Solr Out of the Box talk from ApacheCon whereby you want to quickly explore a new data set without having to define a schema.\n       [other] -\n\nNote, the templates directory could also live under each contrib, but it isn't necessarily a 1-1 thing (e.g. simple and exploratory templates are not contrib-specific).\n\nThen, typing \"ant example\" would copy the necessary tutorial stuff to the example directory (which still contains the Jetty stuff) but would not have to recurse into any of the contribs.\n\nTyping \"ant example -Dtype=clustering\"  would copy the clustering requirements, plus go to contrib/clustering (or whatever) and get the appropriate material such that the example directory.  Similarly for any of the other \"templates\"\n\nAdditionally, you could also define -DoutputDir such that it would take and copy the whole example directory (including the appropriate type) to some output dir.  This would allow one to quickly bootstrap a Solr project without having to do a lot of schema editing.\n\nhttp://markmail.org/thread/w6da7pwhcsdn43n3",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13604382",
            "date": "2013-03-16T19:13:44+0000",
            "content": "SPRING_CLEANING_2013. We can reopen if there's interest. "
        }
    ]
}