{
    "id": "SOLR-2594",
    "title": "Make Replication Handler cloud aware",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "replication (java)",
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Replication handler should be cloud aware. It should be possible to switch roles from slave to master as well as switch masterUrls based on the cluster topology and state.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13104160",
            "date": "2011-09-14T01:53:56+0000",
            "content": "Shalin - do you see the existing replication handler mechanism becoming cloud aware or do you see replication changing all together, for example from periodically polling a master for index changes (which ain't real-time), to being implemented as real-time synchronous or asynchronous per-document, push-based replication a la ElasticSearch?\n\nIf we look towards the bottom of http://wiki.apache.org/solr/NewSolrCloudDesign there is even a mention of replication functionality (in its today's form) not being needed any more once Solr Cloud functionality is all in place.  If that is correct, what is the plan for this issue? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-13104187",
            "date": "2011-09-14T02:45:37+0000",
            "content": "This issue needs to be 'won't fix'.  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13105216",
            "date": "2011-09-15T08:41:33+0000",
            "content": "Otis - The original idea behind this issue was to use host configuration from ZK to automatically replicate from master as well as provide failover support. However, with the new SolrCloud Design, this idea is not applicable anymore.\n\nThe transaction log based recovery/replication system described by the new SolrCloud design is best built in a different issue. I'll mark this one as \"won't fix\". "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13107332",
            "date": "2011-09-18T04:05:57+0000",
            "content": "Resolving as Won't Fix as suggested. "
        }
    ]
}