{
    "id": "SOLR-2669",
    "title": "SchemaField.calcProps has some backwards validation",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.4",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "LUCENE-2048 drew my attention to SchemaField.calProps and made me realize that some of the validation checks in this method are backwards\n\nThe check rmuir added in LUCENE-2048 seems to just bea straight up mistake...\n\n\tomitTermFreqAndPosition=false, omitPositions=true ... ERROR\n\tomitTermFreqAndPosition=true, omitPositions=false ... NO error but non-sense\n\n\n\nThe following however are long standing oddities...\n\n\tindexed=false omitNorms=true ... ERROR\n\tindexed=false omitTermFreqAndPositions=true ... ERROR\n\tindexed=false omitNorms=false ... NO error but non-sense\n\tindexed=false omitTermFreqAndPositions=false ... NO error but non-sense\n\t(omitPositions was added to the \"INDEX\" check and has similar problems)\n\n\n\nI asked yonik about this in IRC, and he speculates that the reason this test started out that way is that it doesn't make any sense to ask for some index specific stuff to be omited if you have already said you don't want indexing at all.\n\nmy counter point was that it doesn't hurt to ask for some indexing metadata to be omited, but it certainly doesn't make sense to explicitly ask for any of that metadata to be left in if you asid you don't want any indexing.\n\nTo draw an analogy: \"Please omit the dressing from my salad, and please don't bring me a salad\" is a redundant request, but it doesn't hurt anything.  \"Please make sure there is dressing on my salad, and please don't bring me a salad\" makes no sense at all – if you don't want the salad, then why are asking for dressing on it?",
    "attachments": {
        "SOLR-2669.patch": "https://issues.apache.org/jira/secure/attachment/12487474/SOLR-2669.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13069723",
            "date": "2011-07-22T20:32:36+0000",
            "content": "patch that reverses these validation checks, with test config additions demonstrating the combinations that should work, and BadIndexSchemaTest additions that demonstrate the combinations that should fail. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13069919",
            "date": "2011-07-23T08:38:16+0000",
            "content": "\nTo draw an analogy: \"Please omit the dressing from my salad, and please don't bring me a salad\" is a redundant request, but it doesn't hurt anything. \"Please make sure there is dressing on my salad, and please don't bring me a salad\" makes no sense at all – if you don't want the salad, then why are asking for dressing on it?\n\nI think this logic makes sense... the whole intention for the positions checks was to throw an error in the nonsense case (I tested, doesn't actually work at all in trunk right now)\n\npatch looks good, this stuff needed tests. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13070241",
            "date": "2011-07-24T20:17:34+0000",
            "content": "Thanks for the review rmuir\n\nCommitted revision 1150478. - trunk\n\nStill working on backporting to 3x, i thought it was going to be straight forward but BadIndexSchemaTest is vastly diff on that branch because of SOLR-1846\n\n(Poking around with this also made me realize that none of the validation Solr does accounts for inconsistencies between the fieldtype and the field, so i've spun that off into SOLR-2674) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13070270",
            "date": "2011-07-24T22:46:53+0000",
            "content": "Committed revision 1150510. - 3x "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106205",
            "date": "2011-09-16T14:48:51+0000",
            "content": "bulk close for 3.4 "
        }
    ]
}