{
    "id": "SOLR-12755",
    "title": "Force merge (optimize) should respect distrib=false",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud",
            "update"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.4",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "It would be desirable in a Solr Cloud configuration if a request like:\n\nupdate?optimize=true&distrib=false\n\nonly executed on the shard that received the request.\n\n \n\nAs is well known force merging is a very expensive/disk space hungry operation and hence this increased control should address the following issues:\n\nFree disk space requirements: 1-2x size of ALL shards on the machine vs 1-2x size of largest shard\n\nI/O: High disk contention when a machine holds multiple shards as all shards are being simultaneously rewritten\n\nAvailability: All replicas will simultaneously have impaired performance\n\n \n\nRelevant previous issue: SOLR-6264",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-09-09T12:31:25+0000",
            "content": "Free disk space requirements: 1-2x size of ALL shards on the machine vs 1-2x size of largest shard\n\nAre you seeing SolrCloud do simultaneous optimizes of multiple shards?  It was my understanding that when you ask for an optimize, that SolrCloud will step through the shard replicas for that collection and optimize them one at a time until the entire collection is done.  Doing them simultaneously could cause serious I/O problems.\n\nYou are correct that distrib=false should restrict the optimize to one core, like it does for a query.  This has been brought up before.  See SOLR-10740. ",
            "author": "Shawn Heisey",
            "id": "comment-16608438"
        },
        {
            "date": "2018-09-09T13:24:07+0000",
            "content": "Yes I am seeing all shards being optimized simultaneously, and yes it does cause the I/O problems one would expect from doing that! It sounds like prior to SOLR-6264 it may have worked in the way you describe.\n\nI hadn't seen SOLR-10740, and I agree that this is basically a duplicate, but hopefully this issue spells out the problems with sending the optimize request to all replicas of every shard simultaneously. ",
            "author": "Daniel Lowe",
            "id": "comment-16608446"
        }
    ]
}