{
    "id": "SOLR-4129",
    "title": "Solr UI doesn't support log4j",
    "details": {
        "affect_versions": "4.0-ALPHA,                                            4.0-BETA,                                            4.0",
        "status": "Closed",
        "fix_versions": [
            "4.3"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "For many project use the log4j, actually solr use slf logger framework, slf can easy to integrate with log4j by design. \n\nSolr use log4j-over-slf.jar to handle log4j case.\nThis jar has some issues.\na. Actually last invoke slf to print the logger (For solr it is JDK14.logging).\nb. Not implement all log4j function. ex. Logger.setLevel() \nc. JDK14 log miss some function, ex. thread.info, day rolling \n\nSome dependence project had been used log4j that the customer still want to use it. JDK14 log has many different with Log4j, at least configuration file can't reuse.\n\nThe bad thing is log4j-over-slf.jar conflict with log4j. If use solr, the other project have to remove log4j.\n\nI think it shouldn't use log4j-over-slf.jar, still reuse log4j if customer want to use it.",
    "attachments": {
        "patch-4129.txt": "https://issues.apache.org/jira/secure/attachment/12555492/patch-4129.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Raintung Li",
            "id": "comment-13507232",
            "date": "2012-11-30T10:06:37+0000",
            "content": "This patch finish the UI for log4j case that will be shown in the Admin page. \nSomething still need to do, maven build need log4j jar, and it need to check slf load logic for different component logger to find way can set it outside.\n "
        },
        {
            "author": "David Smiley",
            "id": "comment-13507352",
            "date": "2012-11-30T14:27:45+0000",
            "content": "+1 Patch looks good. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13507489",
            "date": "2012-11-30T17:45:44+0000",
            "content": "I've been trying to work out what is being said here and I'm finding it hard to follow.  I'm especially confused by the part about log4j-over-slf4j.\n\nIf this means that I will be able to change logging levels for log4j within the GUI, I'm all for it.  I'm less concerned about being able to view the log within the GUI, but that would be a nice addition.\n\nI use log4j with Solr, and I've included log4j-over-slf4j.  To make it a lot easier to build that way, I patched solr/build.xml, that patch is attached to SOLR-3918.  I have the following jars in jetty's lib/ext:\n\njcl-over-slf4j-1.7.2.jar\nlog4j-1.2.17.jar\nlog4j-over-slf4j-1.7.2.jar\nslf4j-api-1.7.2.jar\nslf4j-log4j12-1.7.2.jar "
        },
        {
            "author": "David Smiley",
            "id": "comment-13507496",
            "date": "2012-11-30T17:50:23+0000",
            "content": "Shawn, how could you have both log4j-over-slf4 and log4j itself on the classpath?  That doesn't make sense and SLF4J will probably complain; if it doesn't it's still an error.  If your intent is to use Log4j then remove log4j-over-slf4. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13507511",
            "date": "2012-11-30T18:09:18+0000",
            "content": "Shawn, how could you have both log4j-over-slf4 and log4j itself on the classpath? That doesn't make sense and SLF4J will probably complain; if it doesn't it's still an error. If your intent is to use Log4j then remove log4j-over-slf4.\n\nI did this because I didn't know any better.  I'm a bit of a beginner in the Java universe.  I added the slf4j things included in the standard WAR except for the JUL binding, then added the log4j binding and log4j.  There are no complaints about it in my log.  It's probably not complaining because alphabetically, the real log4j jar comes before the slf4j one, so when the import is done, the right class gets loaded.\n\nAfter removing log4j-over-slf4j, Solr still seems fine.  Both before and after the removal, logging at WARN, the only log entry I get is \"Log watching is not yet implemented for log4j.\"\n\nI would like to have short logs saying that each core has been started and that Solr is fully started.  Would it be reasonable to file a jira asking for this to happen at WARN, or would I just have to figure out which class(es) to set to INFO in my log4j config? "
        },
        {
            "author": "David Smiley",
            "id": "comment-13507518",
            "date": "2012-11-30T18:20:53+0000",
            "content": "I would like to have short logs saying that each core has been started and that Solr is fully started. Would it be reasonable to file a jira asking for this to happen at WARN, or would I just have to figure out which class(es) to set to INFO in my log4j config?\n\nUsing WARN for an informational message just seems wrong to me, albeit I've seen it in some projects at work.  Simply setting only one class to INFO and others higher (e.g. WARN) wouldn't work because this would probably go in SolrCore which has plenty of other INFO messages to say.  Too much IMO.  I think the right solution is to log an announcement message to a special name like \"org.apache.solr.announcement\".  Yeah, file an issue for that. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13507522",
            "date": "2012-11-30T18:25:33+0000",
            "content": "I changed this issue to an \"improvement\" and changed the title to reflect it's a UI thing.  That is what is reflected in the patch.  The author of the description on the other hand, appears to be unaware that log4j-over-slf4j-1.7.2.jar needs to be removed if you're going to log to Log4j.  I believe there's even an ant target to pre-package the .war file appropriately. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13507568",
            "date": "2012-11-30T19:15:39+0000",
            "content": "See also SOLR-3356\n\nFYI, the LogWatcher stuff initially supported Log4J out-of-the-box, but given the classpath conflicts with testing, it was removed.\n\nThere was discussion of moving the default solr log implementation to Log4J... but that did not resolve.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13507575",
            "date": "2012-11-30T19:22:34+0000",
            "content": "There was discussion of moving the default solr log implementation to Log4J\n\n+1 "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13507602",
            "date": "2012-11-30T19:46:15+0000",
            "content": "Using WARN for an informational message just seems wrong to me, albeit I've seen it in some projects at work. Simply setting only one class to INFO and others higher (e.g. WARN) wouldn't work because this would probably go in SolrCore which has plenty of other INFO messages to say. Too much IMO. I think the right solution is to log an announcement message to a special name like \"org.apache.solr.announcement\". Yeah, file an issue for that.\n\nYou're right, such logs aren't warnings.  I'll file the new issue.\n\nI believe there's even an ant target to pre-package the .war file appropriately.\n\nThere's a dist-war-excl-slf4j target, but there's no easy way to get both the special war AND the rest of what 'dist' does.  I filed SOLR-3918 initially to just add a dist-excl-slf4j target, then updated that issue to also remove slf4j-api-1.6.4.jar.  I'll be updating that issue with my full rationale for why I think it should be committed. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13594038",
            "date": "2013-03-05T22:39:50+0000",
            "content": "log4j-over-slf.jar has been removed - I think starting at 4.1. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13603222",
            "date": "2013-03-15T08:02:16+0000",
            "content": "consolidating log4j issues "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653810",
            "date": "2013-05-10T10:33:03+0000",
            "content": "Closed after release. "
        }
    ]
}