{
    "id": "SOLR-1708",
    "title": "Allowing import / update of a specific document using the data import handler",
    "details": {
        "affect_versions": "1.4",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "There is the need that changes or new documents need to be added immediately to the Solr Index. This could easily done via the update-handler - however, when using the DataImportHandler it shouldn't be necessary to specify the data extraction for the the DataImportHandler and also for feeding it to into the update-handler. It should be centralized.\n\nHaving to run delta query, identifying the changes, for changes where the ID's of the updated documents are already known to the application is a rather costly (in terms of database load) way to solve this.\n\nThe attached patch allows to specify one or more query parameters for the delta-import command, named 'root-pk', which allow to specify the document(s) to be updated or added.",
    "attachments": {
        "02-single-update.patch": "https://issues.apache.org/jira/secure/attachment/12429646/02-single-update.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Simon Lachinger",
            "id": "comment-12799168",
            "date": "2010-01-12T12:07:37+0000",
            "content": "fixed: last index date is not to be updated for udpates via root-pk "
        },
        {
            "author": "Simon Lachinger",
            "id": "comment-12799169",
            "date": "2010-01-12T12:10:11+0000",
            "content": "The last_index_date is no longer updated when using the delta-import command like this:\nhttp://localhost:8080/solr/locations-eng/dataimport?command=delta-import&root-pk=967&indent=on\n\nThus, other changes will also taken into account on the next regular delta-import. "
        },
        {
            "author": "Simon Lachinger",
            "id": "comment-12799170",
            "date": "2010-01-12T12:11:47+0000",
            "content": "Still missing: Tests. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12799179",
            "date": "2010-01-12T12:38:31+0000",
            "content": "This does not seem to be a good way to solve your problem. you can pass your root-pk as params and use them in your queries directly\n\n${dih.request.root-pk} \n\nWe cannot change the core of DIH for this kind of  problems "
        },
        {
            "author": "Simon Lachinger",
            "id": "comment-12799184",
            "date": "2010-01-12T12:52:29+0000",
            "content": "Well, the solution with ${dih.request.root-pk} generates duplicate configurations if users want to user full-import, delta-imports, and imports with root-pk. And I doubt it will handle the last_index_time correctly. This kind of problems seems to be a pretty basic requirement actually. And all workarounds I could google/think of required creating and maintaining duplicates of the import queries. Which is quite bad.\n\nI guess it would be better to have an additional command to allow these actions? "
        },
        {
            "author": "Klaus Bayrhammer",
            "id": "comment-14343158",
            "date": "2015-03-02T13:32:20+0000",
            "content": "We have multiple projects, which have quite similar requirements like those Simon Lachinger pointed out. Does the latest version of solr support a way of handling these kind of root-pk-updates without maintaining duplicate versions of import queries? "
        }
    ]
}