{
    "id": "SOLR-10675",
    "title": "differentiate DRAFT builds of the html/pdf ref-guides vs the official releases",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [
            "6.6",
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "We should tweak the build system for the new ref guide so that it's obvious from the artifacts when they are unofficial \"DRAFT\" copies (default) vs official releases",
    "attachments": {
        "draft-background.png": "https://issues.apache.org/jira/secure/attachment/12867693/draft-background.png",
        "SOLR-10675.patch": "https://issues.apache.org/jira/secure/attachment/12867692/SOLR-10675.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-12T01:26:07+0000",
            "content": "\nHere's patch makes a few changes to the way the ref guide is built...\n\n\n\tbuild.xml now allows differantiation from the solr version the guide covers (ex: 6.6) and the guide version (ex: 6.6, 6.6.1)\n\t\n\t\tThis will typically be the same - but now if we want to do a \"bug fix release\" of the guide itself, we can – and if we do so, the bug fix number for the doc doesn't need to be tied to any particular code bug fix that has/has not yet happened on the same branch_X_Y\n\t\n\t\n\tboth the PDF & HTML versions will now note their \"Guide Version\"\n\t\n\t\tHTML in <title> and page footer\n\t\tPDF in the page footer\n\t\n\t\n\tby default, anyone building the PDF or html site wil now get \"DRAFT\" copies of these files\n\t\n\t\tthe guide version# will default to ending in -DRAFT\n\t\tthe the HTML guide will include a DRAFT watermark and special note in the sidebar w/link to official versions\n\t\tthe PDF filename will include the -DRAFT suffix\n\t\n\t\n\tTo build a \"release\" of the docs, just specify `-Dsolr-guide-version=X.Y` on the command line.\n\t\n\t\t`ant build-site build-pdf -Dsolr-guide-version=X.Y`\n\t\n\t\n\tI also updated the meta-docs where approrpiate to reflect these changes\n\n\n\n(watermark file draft-background.png attached independently - assume it's in solr/solr-ref-guide/src/\n\nCassandra Targett: what do you think?\n ",
            "author": "Hoss Man",
            "id": "comment-16007477"
        },
        {
            "date": "2017-05-12T18:00:11+0000",
            "content": "I think this is good. I'm not totally sold on the DRAFT watermark, but it does get the point across and it doesn't obscure any text (code blocks go over it, which is nice). I definitely like the version being printed at the bottom of each page (in html and pdf) and the fact it includes \"-DRAFT\".\n\nUnless you have any other ideas today, I think we could work with this. ",
            "author": "Cassandra Targett",
            "id": "comment-16008486"
        },
        {
            "date": "2017-05-12T18:18:39+0000",
            "content": "Commit 0c2330bea082a8936e60aa61fea0e7a1a54f2300 in lucene-solr's branch refs/heads/branch_6_6 from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0c2330b ]\n\nSOLR-10675: differentiate DRAFT builds of the html/pdf ref-guides vs the official releases\n\n(cherry picked from commit b552127ea36bd54f70014bab67738d3f156b505a) ",
            "author": "ASF subversion and git services",
            "id": "comment-16008514"
        },
        {
            "date": "2017-05-12T18:18:42+0000",
            "content": "Commit 977b17bca4194cb43942b7af741f8da6a8b72bf6 in lucene-solr's branch refs/heads/branch_6x from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=977b17b ]\n\nSOLR-10675: differentiate DRAFT builds of the html/pdf ref-guides vs the official releases\n\n(cherry picked from commit b552127ea36bd54f70014bab67738d3f156b505a) ",
            "author": "ASF subversion and git services",
            "id": "comment-16008515"
        },
        {
            "date": "2017-05-12T18:18:46+0000",
            "content": "Commit b552127ea36bd54f70014bab67738d3f156b505a in lucene-solr's branch refs/heads/master from Chris Hostetter\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b552127 ]\n\nSOLR-10675: differentiate DRAFT builds of the html/pdf ref-guides vs the official releases ",
            "author": "ASF subversion and git services",
            "id": "comment-16008516"
        },
        {
            "date": "2017-05-12T18:23:18+0000",
            "content": "I think this is good. I'm not totally sold on the DRAFT watermark, but it does get the point across and it doesn't obscure any text ...\n\nexactly, and if we decide it's not subtle enough, we can always tweak the image.\n\nPersonally i love the watermark – no one can ever again claim they didn't realize something wasn't the \"official\" guide.  I was hoping we could include it in the PDF too, but aparently it doesn't work with asciidoctorJ...\n\n\thttps://github.com/asciidoctor/asciidoctor-pdf/blob/master/docs/theming-guide.adoc\n\thttp://discuss.asciidoctor.org/Asciidoctor-YAML-style-file-for-PDF-and-maven-td3849.html\n\n ",
            "author": "Hoss Man",
            "id": "comment-16008523"
        },
        {
            "date": "2017-05-12T18:29:28+0000",
            "content": "It can do the decission in the same way like the remaining build system. It is a release build if version property equals version.base property. See the common build files how to do this. There are many examples e.g. in define javadoc url targets of solr. ",
            "author": "Uwe Schindler",
            "id": "comment-16008532"
        },
        {
            "date": "2017-05-12T19:15:53+0000",
            "content": "Uwe Schindler it does in fact work very similar, and if you note in the patch/commits both the \"guide version\" and \"solr version\" defaults come from the existing version.properties file – but please note my comments when i attached the patch...\n\nThis will typically be the same - but now if we want to do a \"bug fix release\" of the guide itself, we can – and if we do so, the bug fix number for the doc doesn't need to be tied to any particular code bug fix that has/has not yet happened on the same branch_X_Y\n\nWe specifically can NOT depend on the guide version matching the version.base to know if it's a \"release\" because the version.base on the release branch will be incremented immediately after the code releases, but the solr guide may be released after that.  likewise, we may want to do a \"guide bugfix\" release (to fix some egregious formatting mistake or missleading content) independent of if/when there was a \"code bugfix\" release on the same branch.\n\nhence the introduction of the new solr-guide-version sys property. ",
            "author": "Hoss Man",
            "id": "comment-16008578"
        },
        {
            "date": "2017-05-12T19:56:16+0000",
            "content": "IMHO, the ref guide versions should maybe also in the version.properties file. And by the way, the PDF file on jenkins does not have \"-SNAPSHOT\" in the version number. So maybe just copy the approach from the normal builds, but use a different \"pair\" of properties for it. ",
            "author": "Uwe Schindler",
            "id": "comment-16008629"
        },
        {
            "date": "2017-05-12T22:40:31+0000",
            "content": "IMHO, the ref guide versions should maybe also in the version.properties file. ...\n\nIt is already based on the version in versions.properties – there's no need for a new distinct version# in there.  Specifying -Dsolr-guide-version=X.Y on the command line when building a guide release is just like specifying -Dversion=X.Y.Z when releasing the code – the only reason for the new/diff prop name on the command line is simply to allow us to still read the (existing) version value from versions.properties on the current branch to correctly identify which major.minor version of solr we're publishing the guide for.\n\n\nAnd by the way, the PDF file on jenkins does not have \"-SNAPSHOT\" in the version number ...\n\nthe branch_6_6 and branch_6x jenkins guide jobs both (currently) include -DRAFT in their artifact name as intended.  the master jenkis guide job does not – but that's only because that job last ran BEFORE i committed these changes.\n\nThe choice of \"-DRAFT\" vs \"-SNAPSHOT\" was deliberate to be consistent with the way we refered to the cwiki content prior to this migration.  If you think we should cahnge that please file a new issue.  (Personally i think that while SNAPSHOT makes sense for \"code builds\", the term \"DRAFT\" will be easier for folks to udnerstand in the context of documentation. ",
            "author": "Hoss Man",
            "id": "comment-16008844"
        }
    ]
}