{
    "id": "SOLR-10719",
    "title": "Creating a core.properties fails if the parent of core.properties is a symlinked dierctory",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [
            "6.6.1",
            "7.0",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "Well, it doesn't actually fail until you try to restart the Solr instance. The root is that creating core.properties fails.\n\nThis is due to SOLR-8260. CorePropertiesLocator.writePropertiesFile changed from:\npropfile.getParentFile().mkdirs();\nto\nFiles.createDirectories(propfile.getParent());\n\nThe former (apparently) thinks it's OK if a symlink points to a directory, but the latter throws an exception.\n\nSo the behavior here is that the call appears to succeed, the replica is created and is functional. Until you restart the instance when it's not discovered.\n\nI hacked in a simple test to see if the parent existed already and skip the call to createDirectories if so and ADDREPLICA works just fine. Restarting Solr finds the replica.\n\nThe test \"for real\" would probably have to be better than this as we probably really want to keep from overwriting an existing replica and the like, didn't check whether that's already accounted for though.\n\nThere's another issue here that failing to write the properties file should fail the ADDREPLICA IMO.\n\nAlan Woodward I'm guessing that this is an unintended side-effect of SOLR-8260 but wanted to check before diving in deeper.",
    "attachments": {
        "SOLR-10719.patch": "https://issues.apache.org/jira/secure/attachment/12869994/SOLR-10719.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-19T21:25:19+0000",
            "content": "Assigning to myself to track, but anyone else should feel free to tackle it. ",
            "author": "Erick Erickson",
            "id": "comment-16018045"
        },
        {
            "date": "2017-05-22T15:18:18+0000",
            "content": "I don't follow what's happening here - are you saying that Files.createDirectories() fails, but the ADDREPLICA call succeeds anyway?  That sounds ... wrong? ",
            "author": "Alan Woodward",
            "id": "comment-16019693"
        },
        {
            "date": "2017-05-22T15:32:27+0000",
            "content": "Alan Woodward There's no question that this is wrong. Yes, the ADDREPLICA succeeds. I looked at it quickly and the replica is even up and running. Until you restart solr then core.properties is not found, the core is not discovered and people are left wondering what happened. If you manually reconstruct the core.properties file at the destination of the symlink and restart, the core is alive and healthy. This is not theoretical BTW, it happened \"in the field\".\n\nIt's particularly scary when you then DELETEREPLICA because you see your new replica active. It takes over leadership and everything.\n\nThis worked in earlier versions of Solr.\n\nFiles.createDirectories throws an exception \"file already exists\" IIRC, but it's swallowed, doesn't propagate back up the stack.\n\nSo there are two issues here I suppose:\n1> should we follow symlinks (I think we should)\n2> should failing to write core.properties files cause the ADDREPLICA to fail (I think it should).\n\nMaybe break <2> out into a new JIRA?\n ",
            "author": "Erick Erickson",
            "id": "comment-16019710"
        },
        {
            "date": "2017-05-25T22:58:28+0000",
            "content": "This is actually a bit weirder. Files.createDirectories does succeed if you specify a subdir of the symlink. So if\nsym -> dir1\n\nand I ask CreateDirectories to create sym/eoe1/eoe2/eoe3 all the directories are created just fine. But when core.properties is being written, it wants to write to sym/core.properties and the createDirectories fails on creating sym as it's a symlink.\n\nI see multiple places in the code where we call Files.createDirectories, even some tagged with\n\n//note, this will fail if this is a symlink\n\nAll in all, symlinks are going to be a problem in several places in the code.\n\nSo I'm thinking of providing a method  in FileUtils to deal with this kind of thing that would then be available for other users as appropriate.\n\nOh, and I'm not suggesting that we make this a blanket change as I'm not sure these other places should be changed. ",
            "author": "Erick Erickson",
            "id": "comment-16025518"
        },
        {
            "date": "2017-05-26T04:04:16+0000",
            "content": "First cut at a patch. It seems to handle the cases in this JIRA, i.e. if the dest is a symlink it'll still create the core and write the core.properties. Additionally, if the core.properties file cannot be created it throws an error.\n\nWill look more tomorrow but so far this approach looks promising. ",
            "author": "Erick Erickson",
            "id": "comment-16025778"
        },
        {
            "date": "2017-05-30T03:09:48+0000",
            "content": "Commit 412e4ae2c192a5b444dd63220e5918f4e7fd47be in lucene-solr's branch refs/heads/master from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=412e4ae ]\n\nSOLR-10719: Creating a core.properties fails if the parent of core.properties is a symlinked dierctory ",
            "author": "ASF subversion and git services",
            "id": "comment-16028719"
        },
        {
            "date": "2017-05-30T03:11:42+0000",
            "content": "final patch with CHANGES ",
            "author": "Erick Erickson",
            "id": "comment-16028721"
        },
        {
            "date": "2017-05-30T03:15:56+0000",
            "content": "Commit ee10c452d1710ad2b0028675623dfee467981afd in lucene-solr's branch refs/heads/branch_6x from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ee10c45 ]\n\nSOLR-10719: Creating a core.properties fails if the parent of core.properties is a symlinked dierctory\n\n(cherry picked from commit 412e4ae) ",
            "author": "ASF subversion and git services",
            "id": "comment-16028722"
        },
        {
            "date": "2017-08-21T02:59:40+0000",
            "content": "Commit 425af4f658de763821fea41b763fb3fda8316ad0 in lucene-solr's branch refs/heads/branch_6_6 from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=425af4f ]\n\nSOLR-10719: Creating a core.properties fails if the parent of core.properties is a symlinked dierctory\n\n(cherry picked from commit ee10c45) ",
            "author": "ASF subversion and git services",
            "id": "comment-16134655"
        }
    ]
}