{
    "id": "SOLR-8334",
    "title": "Highlighting content field problem when using JiebaTokenizerFactory",
    "details": {
        "components": [
            "highlighter",
            "search"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3",
        "status": "Closed",
        "resolution": "Invalid",
        "priority": "Major"
    },
    "description": "When I tried to use the JiebaTokenizerFactory to index Chinese characters in Solr, it works fine with the segmentation when I'm using the Analysis function on the Solr Admin UI.\n\nHowever, when I tried to do the highlighting in Solr, it is not highlighting in the correct place. For example, when I search of 自然环境与企业本身, it highlight 认<em>为自然环</em><em>境</em><em>与企</em><em>业本</em>身的\nEven when I search for English character like  responsibility, it highlight  <em> responsibilit<em>y.\n\nBasically, the highlighting goes off by 1 character/space consistently.\nThis problem only happens in content field, and not in any other fields.\n\nI've made some minor modification in the code under JiebaSegmenter.java, and the highlighting seems to be fine now.\n\nBasically, I created another int called offset2 under process() method.\nint offset2 = 0; \nAfter which, I modified the offset to offset2 for this part of the code under process() method. \nThe changes are in the attachment below.",
    "attachments": {
        "JiebaSegmenter.java": "https://issues.apache.org/jira/secure/attachment/12773977/JiebaSegmenter.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-24T03:31:48+0000",
            "author": "Edwin Yeo Zheng Lin",
            "content": "This is the modified JiebaSegmenter.java which allows the highlighting of the content fields to work correctly. The <em> tags for content are now showing at the correct place. ",
            "id": "comment-15023708"
        },
        {
            "date": "2016-09-29T20:24:55+0000",
            "author": "Cassandra Targett",
            "content": "The JiebaToknizerFactory is not maintained by the Lucene/Solr community. Instead, it appears to come from this project: https://github.com/sing1ee/jieba-solr. It may be more helpful to ask in that project. ",
            "id": "comment-15533950"
        }
    ]
}