{
    "id": "SOLR-8235",
    "title": "Federated Search (new) - Merge",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "4.10.3"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "This issue describes a SearchComponent for merging search results obtained from a DJoin distributed search (see SOLR-8234) as part of federated search - that is, distributed search over documents stored in separated instances of SOLR (for example, one server per continent), where a single document (identified by an agreed, common unique id) may be stored in more than one server instance, with (possibly) differing fields and data.\n\nIn the use of this search component, it is assumed that there is a single SOLR server (the \"aggregator\") that uses distributed search (shards=) to collect documents from other SOLR servers using DJoin (see SOLR-8234). The DJoin generates a result set containing parent documents each with child documents having the same unique id. This merge component turns each set of child documents into a single document conforming to the aggregator schema.\n\nFor example, suppose the aggregator schema defines a multi-valued integer field, 'num', and three shards return field values \"48\", 23, and \"strawberry\". Then the resulting merged field value would be [48, 23] and an error would included for the NumberFormatException.\n\nCustom field merge behaviour may be specified by defining custom field types in the usual way and this is supported via a MergeAbstractFieldType class.\n\nThis issue combines with others to provide full federated search support. See also SOLR-8234 and SOLR-8236.\n\n–\n\nNote that this is part of a new implementation of federated search as opposed to the older issues SOLR-3799 through SOLR-3805.",
    "attachments": {
        "SOLR-8235.patch": "https://issues.apache.org/jira/secure/attachment/12776835/SOLR-8235.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-10T17:00:15+0000",
            "author": "Tom Winch",
            "content": "patch against SOLR 4.10.3 ",
            "id": "comment-15051237"
        }
    ]
}