{
    "id": "SOLR-3204",
    "title": "solr-commons-csv must not use the org.apache.commons.csv package",
    "details": {
        "affect_versions": "3.5",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The solr-commons-csv artifact reused the code from the Apache Commons CSV project but the package wasn't changed to something else than org.apache.commons.csv in the process. This creates a compatibility issue as the Apache Commons team works toward an official release of Commons CSV. It prevents Commons CSV from using its own org.apache.commons.csv package, or forces the renaming of all the classes to avoid a classpath conflict.",
    "attachments": {
        "SOLR-3204.patch": "https://issues.apache.org/jira/secure/attachment/12517320/SOLR-3204.patch",
        "apache-solr-commons-csv-1.0-SNAPSHOT-r966014.jar": "https://issues.apache.org/jira/secure/attachment/12517424/apache-solr-commons-csv-1.0-SNAPSHOT-r966014.jar",
        "solr-csv.patch": "https://issues.apache.org/jira/secure/attachment/12517241/solr-csv.patch",
        "rule.txt": "https://issues.apache.org/jira/secure/attachment/12517416/rule.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-13222911",
            "date": "2012-03-06T02:05:42+0000",
            "content": "Solr is using a snapshot commons CSV build (commons-csv-1.0-SNAPSHOT-r966014) – solr does not change anything and would prefer to use a release build.\n\nHas there been class refactorings that make replacing the .jar with the dev build impossible?  If so, perhaps we should just update the .jar file we are including. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13222917",
            "date": "2012-03-06T02:09:13+0000",
            "content": "Background here: http://markmail.org/message/lsxtxoetpw7a47uf\n\nAs far as I can determine, this is just a maven meta-data issue?\ni.e. it doesn't seem like we should change java package names, but just make sure that the maven meta-data is completely distinct from any official commons-csv releases?  (disclaimer: I still really know nothing of maven, other than it's becoming more a pain all the time  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13222930",
            "date": "2012-03-06T02:24:08+0000",
            "content": "Emmanuel, can you confirm this is just a maven issue?\n\nCan it be solved with adding exclusions?\n\n    <dependency>\n      <groupId>org.apache.solr</groupId>\n      <artifactId>solr-core</artifactId>\n      <version>${solr.version}</version>\n      <exclusions>\n        <exclusion>\n          <groupId>org.apache.solr</groupId>\n          <artifactId>solr-commons-csv</artifactId>\n        </exclusion>\n        ...\n\n\n\nObviously the best approach is to work with an official release... but until that exists, what do you suggest?  (Actually forking the project and changing the package names seems pretty bad)  "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223080",
            "date": "2012-03-06T08:09:38+0000",
            "content": "Hi all and thank you for your quick reply. This is not a \"simple\" Maven metadata issue. Even if you consider solr-commons-csv to be an internal part of Solr it's now a public Maven artifact that people are starting to use in their projects (The Apache Commons teams even starts receiving bug reports for solr-commons-csv). When Commons CSV is officially released there will be a conflict if solr-commons-csv and commons-csv are both brought to the classpath through the transitive dependencies of a project, because they have the same classes in the same package.\n\nImagine a project using Solr and doing CSV stuff with Commons CSV, when the CSVParser classes is instantiated it can be either the one from solr-commons-csv or the one from Commons CSV, this is guaranteed to break badly.\n\nThe right approach is to change the package of solr-commons-csv, for example to org.apache.solr.commons.csv, so both solr-commons-csv and Commons CSV can coexist on the classpath without conflict. This can be automated with the Maven Shade plugin.\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223193",
            "date": "2012-03-06T12:35:39+0000",
            "content": "This is a maven issue. solr-commons-csv only exists to maven.\n\nOtherwise these are just classes inside the war file (essentially an implementation detail of solr).\nIt seems to me, no offense, that the solution is to make an official release of commons-csv!\n\nThen nothing needs to coexist, as we would rather use a release instead anywaay, and all \ngrandfather poms,wagons, nexuses,surefires,whatever in maven will be adjusted and everyone is happy. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223198",
            "date": "2012-03-06T12:52:04+0000",
            "content": "I agree a release of Commons CSV is desirable, but that's not a reason for using the namespace of other projects. The artifact is free to use by anyone from the Maven repository, it's no longer an implementation detail of Solr, people are starting to use it in the wild, and this will lead to classpath conflicts.\n\nRepackaging a Commons component and renaming its package isn't uncommon, Tomcat does this for DBCP:\n\nhttp://www.jarvana.com/jarvana/inspect/org/apache/tomcat/tomcat-dbcp/7.0.23/tomcat-dbcp-7.0.23.jar\n\nTomcat is released with a tomcat-dbcp artifact containing the DBCP classes but under the org.apache.tomcat.dbcp package. Solr should adopt the same approach until Commons CSV is officially released. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223228",
            "date": "2012-03-06T13:11:42+0000",
            "content": "seriously, this is no blocker. \n\nI don't appreciate you reverting my change there.\n\nnow this becomes resolved as won't fix. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223242",
            "date": "2012-03-06T13:25:50+0000",
            "content": "Robert, should I appreciate that you are negating the issue? This is considered a blocker because Solr must not make new releases until this is resolved. This is a serious issue, don't take it lightly please. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13223255",
            "date": "2012-03-06T13:32:47+0000",
            "content": "It is not an issue, as Solr is built with Apache Ant, Apache Maven is not fully supported and only \"for convenience\". If it works, it works, if not its of minor priority. It definitely does not block a release. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223265",
            "date": "2012-03-06T14:10:02+0000",
            "content": "\nThis is considered a blocker because Solr must not make new releases until this is resolved. This is a serious issue, don't take it lightly please.\n\nReally? who will stop us? \n\nSeriously, all solr does is put commons-csv-1.0-SNAPSHOT-r966014.jar in solr/lib (along with LICENSE/NOTICE information).\n\nWe don't use any commons-csv-1.0-RELEASE.jar because one doesnt exist. "
        },
        {
            "author": "Torsten Curdt",
            "id": "comment-13223277",
            "date": "2012-03-06T14:29:47+0000",
            "content": "Folks, how can you not see that this is an issue?\n\nThis is not a maven problem. You are releasing code in the Commons namespace that eventually will clash. I am sure everyone is on board to get this resolved by releasing commons-csv ...but if you do a release beforehand - please be a good ASF citizen and use some kind of shading technique (e.g. using jarjar).\n\nJust closing this issue as \"Won't Fix\" is not helping. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223278",
            "date": "2012-03-06T14:33:20+0000",
            "content": "Really? who will stop us?\n\nYour morality, kindness and innate sense of teamwork among Apache developers ? \n\nYou may have not noticed that solr-commons-csv is in the central Maven repository, it's not just secretly included in the solr/lib directory:\n\n\nhttp://search.maven.org/#artifactdetails|org.apache.solr|solr-commons-csv|3.5.0|jar\n \n\nThat means two things:\n\n\tPeople are using this artifact in their Maven projects, independently of Solr\n\tAnyone importing the solr-core artifact in its project will be unable to use Commons CSV when it's released\n\n\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223281",
            "date": "2012-03-06T14:36:05+0000",
            "content": "\nYou are releasing code in the Commons namespace that eventually will clash\n\nWe aren't releasing any code.\n\nWe have a library in solr/lib. we are depending upon this library. we don't release it.\n\nThis issue is only about maven, which is just supplied as convenience, as Uwe mentions. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223285",
            "date": "2012-03-06T14:40:46+0000",
            "content": "Here is a patch importing the Commons CSV revision 966014 in the org.apache.solr.csv package to avoid classpath conflicts "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223290",
            "date": "2012-03-06T14:44:03+0000",
            "content": "-1\n\nI don't think we should code-dup entire packages just because of the viral nature of maven \n(to make a maven release of X, all of its dependencies must also be in maven, too).\n\nThat seems like the root problem here. Perhaps a blocker issue should be opened in maven's JIRA instead. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13223297",
            "date": "2012-03-06T14:54:37+0000",
            "content": "Just to add: Should we also clone/fork the whole Mortbay Jetty repository or Apache Xerces into Solr's tree? For both libraries we also have bugfixes but upstream did not release an update until now?\n\nWhat will user X do, if the probject he is using depends on an older CSV version but Solr needs a new one, although in Maven Central? Yes, he has a conflict. The situation is not different here. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13223306",
            "date": "2012-03-06T15:04:30+0000",
            "content": "One idea how to solve the issue: Maybe commons-csv should publish their nightly builds through jenkins to maven? Then Solr could add the snapshot build as a dependency and we are done?\n\nUwe "
        },
        {
            "author": "Ralph Goers",
            "id": "comment-13223319",
            "date": "2012-03-06T15:17:30+0000",
            "content": "Robert, if you are not releasing code then how did the artifact find its way into the Maven Central repository? The maintainers of the repository will ONLY accept artifacts when they come from the appropriate place - in this case that would need to be Apache's repository. I can't imagine how anyone other than Solr's team could have caused that to happen.\n\nAs for snapshots, that doesn't really solve the problem as you can't release with a dependency on a snapshot.\n\nIf the intent was just to use the jar internally in a war file that your customers don't change then somewhere in your build you have a mistake as the jar is apparently being made available to the public. If, however, the dependency is required for users or Solr to do builds then you need to change the package names so that they don't conflict with those in Commons. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223326",
            "date": "2012-03-06T15:28:46+0000",
            "content": "Ralph: see Uwe's comment.\n\nIts frequently the case that lucene/solr depend on things that are not in maven. When this is the case, the guys who work on maven here\ndo whatever is necessary to make maven work (I really don't know the details, most of us just use ant).\n\nThis is purely a maven issue, and as mentioned earlier, maven is provided as a convenience for build configuration, no different from\nconvenience build configurations provided for Eclipse or Intellij IDEA.\n\nThats why I said: we aren't releasing anything. there is just commons-csv-1.0-SNAPSHOT-r966014.jar in our solr/lib. Our ant build system\npackages this up into solr.war\n\nAs for maven, eclipse, intellij, netbeans, whatever, it doesnt really matter to me how they work, but supporting those alternative\nbuild configurations != releasing code. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223328",
            "date": "2012-03-06T15:31:30+0000",
            "content": "\nOne idea how to solve the issue: Maybe commons-csv should publish their nightly builds through jenkins to maven? Then Solr could add the snapshot build as a dependency and we are done?\n\nCommons CSV snapshots are available in the Apache snapshot repository, but when you release Solr in the central repository all its dependencies have to be there as well, so that won't work.\n\n\nWhat will user X do, if the project he is using depends on an older CSV version but Solr needs a new one, although in Maven Central? Yes, he has a conflict. The situation is not different here.\n\nOnce Commons CSV is released we guarantee the binary compatibility of the next releases. The Apache Commons team takes compatibility issues very seriously because our components are reused in many projects. When we have to break the compatibility the code is moved to a new package to avoid conflicts. For example Commons Lang 3 broke the binary compatibility with the previous releases and used a new namespace org.apache.commons.lang3 to avoid issues.\n\nIf Solr wants to shield its user from incompatibilities, even after Commons CSV is officially released, it's possible to automate the process of renaming the package of the dependencies. That's what Tomcat does with Commons DBCP. Tools like the Maven Shade plugin or the JarJar Ant tasks are designed for this purpose. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13223329",
            "date": "2012-03-06T15:31:37+0000",
            "content": "Robert, if you are not releasing code then how did the artifact find its way into the Maven Central repository? The maintainers of the repository will ONLY accept artifacts when they come from the appropriate place - in this case that would need to be Apache's repository. I can't imagine how anyone other than Solr's team could have caused that to happen.\n\nWe are releasing Maven Artifacts of Solr just for convenience using a special ANT script (which is unsupported by our committers). The community wants it, so we do it. Maybe that script also published one of the snapshot artifacts (is there also a Jetty prerelease artifact?); but that was not our intention. We should simply remove it. "
        },
        {
            "author": "Torsten Curdt",
            "id": "comment-13223334",
            "date": "2012-03-06T15:37:38+0000",
            "content": "You guys don't like maven - we get that (who really does?) ...but that's not the point. For now let's just assume your bugfix jars did not get released to maven central. (That's another issue to deal with)\n\nWhat about Solr users that now have some unreleases Xerces, Jetty und Commons classes in their classpath? Maybe even without knowing? If you don't hate your users - don't do it.\n\nMaintaining upstreaming patches is painful - but that's how it is. Push for a release, maintain a patch or (only worst case) fork.\n\nBut there is an option somewhere in the middle is using using tools like minijar/the shade plugin/jarjar. They let you do the rewriting of the package transparently on the byte code level. That makes getting back to the releases version easier. Or you do it like Tomcat - they so some search and replace in their build.\n\nI your specific case I would keep the bugfix jars in your lib dir (just like you have now) but modify your build to include a relocated version of your bugfix jars into the Solr jar (by using jarjar). Problem solved!\n\nNo one needs those bugfix version in a repo and it's super easy to fall back to the official release once out. \n\nThere are ways around big code duplications and still avoid the namespace problem.\nCome on guys - be good to the world  "
        },
        {
            "author": "Sebb",
            "id": "comment-13223335",
            "date": "2012-03-06T15:38:02+0000",
            "content": "This is a classpath issue - a class can be loaded only once in a given classpath.\nIt's vitally important to ensure that each class has only a single definition in a classpath, otherwise all sorts of failures can occur. These failures can be extremely difficult to debug.\n\nMaven uses the groupId/artifactId to resolve multiple references to the same jar.\nIt picks one copy of the most recent version. \n\nThis only works properly if the Maven ids are unique for each package.\nIt does not read the package names within the jar; it assumes that the POM is correct for the associated jar.\n\nIn this case, the Solr pom uses its own unique groupId/artifactId, but the package names used within the jar (and indeed the pom inside the jar) are for an entirely different package. This is totally contrary to the way Maven is supposed to be used.\n\nThe consequence is that Maven does not know that the renamed \"solr\" commons-csv jar uses the same package as the \"real\" commons-csv, so it cannot prevent duplicate classes on the classpath. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223339",
            "date": "2012-03-06T15:44:43+0000",
            "content": "I think we should fix this.\n\n\nWe are releasing Maven Artifacts of Solr just for convenience using a special ANT script (which is unsupported by our committers). The community wants it, so we do it. Maybe that script also published one of the snapshot artifacts (is there also a Jetty prerelease artifact?); but that was not our intention. We should simply remove it.\n\nBecause of Solr's dependency on a snapshot of commons-csv, and because Maven releases are not allowed to depend on snapshots, we have to publish the snapshot, renamed not to appear to be a snapshot.  Simply removing it is not an option, assuming we will continue to provide Maven artifacts as part of the Lucene/Solr release process. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223340",
            "date": "2012-03-06T15:44:58+0000",
            "content": "\nMaintaining upstreaming patches is painful - but that's how it is.\n\nIf there is a bug in some 3rd party component: i care about fixing the bug.\n\nI don't care about maven, I'm not going to do the extra work to deal with these viral issues and its not a blocker for releasing 3.6 "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223341",
            "date": "2012-03-06T15:45:02+0000",
            "content": "There is a similar issue with the solr-carrot2-core, solr-noggit, solr-uima and solr-jsonic artifacts, and probably more.\n\nYou were right to -1 my patch Robert, the issue is much deeper. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13223344",
            "date": "2012-03-06T15:51:11+0000",
            "content": "I think the jarjar idea was raised quite often, this seems to be a good solution, so we republish all \"changed\" dependencies using a different class/pkg name. We should create jarjared versions of all those changed snapshot dpenendecies, so the use o.a.solr.internal./o.a.lucene.internal. as package name (like Java does for Xerces/Xalan/Rhino).\n\nThose jars would be published by maven as it is now, but would never conflict. "
        },
        {
            "author": "Torsten Curdt",
            "id": "comment-13223352",
            "date": "2012-03-06T15:59:47+0000",
            "content": "Steve, no you don't have to publish those snapshots. Please read my previous comment about inlining the bugfix jars.\n\nPlease folks, look at http://code.google.com/p/jarjar/\nIt's an easy fix and you would make many people happy. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223354",
            "date": "2012-03-06T16:00:37+0000",
            "content": "\nI think the jarjar idea was raised quite often, this seems to be a good solution, so we republish all \"changed\" dependencies using a different class/pkg name.\n\nThis sets an unreasonable burden to fix a simple bug in a third-party component (think, the jetty patch).\n\nIts already hard enough to dive in as \"stranger in a strange land\" to some other codebase to fix a bug that affects our stuff,\nand then to rename anything that uses it too just because of maven?\n\nLets take the jetty case... should we seriously rename all the jetty stuff because it has a unicode bug? what about configuration \nand reflection and stuff for this servlet container? E.g. users will no longer be able to use any normal jetty configuration or\njetty documentation because we re-jarjared all the package names?\n\n\n<Configure id=\"Server\" class=\"org.eclipse.jetty.server.Server\">\n  <!-- basic configuration here -->\n</Configure>\n\n\n\netc\n\nthis is insane. "
        },
        {
            "author": "Torsten Curdt",
            "id": "comment-13223356",
            "date": "2012-03-06T16:04:07+0000",
            "content": "Uwe, no need to even publish those bugfix jars. I would just inline them into the Solr artifact. (Think ueberjar) Then you don't even have to change a line of java source code nor the bugfix jars. Just the build. "
        },
        {
            "author": "Torsten Curdt",
            "id": "comment-13223365",
            "date": "2012-03-06T16:11:31+0000",
            "content": "Well, I do see the problem with jetty but doubt the other dependencies are that problematic. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223370",
            "date": "2012-03-06T16:16:58+0000",
            "content": "\nWell, I do see the problem with jetty but doubt the other dependencies are that problematic.\n{quote\n\nJarjaring is dangerous also because of reflection in from other libraries.\n\nFor example, if we find a bug in ICU, submit it, and they commit it, we should be able to\ndepend upon a snapshot unreleased build of ICU, yet, at the same-time, arabic PDF extraction\nshould still work (apache PDFBox reflects the icu package names to determine if this works).\n\nSo renaming packages with jarjar is not safe for a number of reasons, I really don't think\nwe should do this just to satisfy maven. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13223389",
            "date": "2012-03-06T16:37:05+0000",
            "content": "Robert: Its not only a maven problem, its the DLL ähm JAR-hell  So I agree with all others that having patched JARs is a no-go for production, because nobody is able to then satisfy all dependencies.\n\nOn the other hand, Solr is a end-user product, so I have no idea why it is in maven at all. You download the distribution and install it. If you need to compile plugins against it, setup your eclipse classpath. Lucene is different, but it has no patched JARs (it does not depend on any external JAR at all). The Xerces JAR in benchmark is also only a \"utility\" package, that should not be in maven.\n\nTo come back to the example:\n\n\tJetty should not be a problem, because Solr will upgrade to Jetty 8 (breaking lots of backwards). For the Jetty 6 series there is no support at all, so there will not be a new release. Our fixed Jetty 6 is just a plain jetty with one broken unicode method patched. If somebody accidently have it in his classpath, he will be happy that Chinese, Japanese, and Mormon UTF8 works correct...\n\tFor the other JARs that have no other relations except to Solr, JARJARing them is no issue at all. It would be what I would recommend. This affects commons JARs like commons-csv, also noggit,\n\tThe ICU example is just a minor \"example\", we will not need to patch ICU, because they are releasing quite often.\n\tIf you have reflection dependecies or dependencies from other JARs in you classpath, you can still install the original unpatched version and you are happy. They will not conflict.\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223399",
            "date": "2012-03-06T16:42:18+0000",
            "content": "How close is commons-csv to a release?   "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223416",
            "date": "2012-03-06T16:54:45+0000",
            "content": "Not close enough to satisfy Solr's pace of releases I think. Any help would be appreciated, the API has been reworked recently to take advantage of Java 5 features. A feedback on how it integrates with Solr would be welcome. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223435",
            "date": "2012-03-06T17:11:42+0000",
            "content": "I propose we jarjar only the currently used commons-csv snapshot, and leave all other jars as-is.  (Uwe, you mentioned noggit, but it has never been released on its own, so I don't think it's necessary to jarjar it.)\n\nA feedback on how it integrates with Solr would be welcome.\n\nThe 3.6 release is going to happen soon; it seems unwise to upgrade on branch_3x at this point.\n\nOn trunk, however, upgrading the commons-csv snapshot to a more recent revision is a good idea, to prepare for the (eventual) release. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223437",
            "date": "2012-03-06T17:13:54+0000",
            "content": "Since we don't really deploy with maven, can we just point the maven artifact to the snapshot build? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223440",
            "date": "2012-03-06T17:17:49+0000",
            "content": "Uwe, no need to even publish those bugfix jars. I would just inline them into the Solr artifact. (Think ueberjar) Then you don't even have to change a line of java source code nor the bugfix jars. Just the build.\n\nTorsten, in case you're wondering why nobody is answering you: Lucene/Solr publishes Maven artifacts that are identical to the released Ant-built binary jars, so your proposal would require increasing the size of our released jars, solely to solve a Maven dependency problem.  Changing the Ant build simply to solve Maven problems has historically been a non-starter. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223443",
            "date": "2012-03-06T17:22:21+0000",
            "content": "This is not possible Ryan. But you might reference org.apache.solr:solr-commons-csv:3.5.0 in Solr 3.6 and stop publishing new artifacts to Maven central besides the solr/lucene specific ones. This will stop the proliferation of conflicting artifacts in the Maven repository, but it won't fix the classpath issue for projects using Solr and Commons CSV. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223445",
            "date": "2012-03-06T17:26:58+0000",
            "content": "Since we don't really deploy with maven, can we just point the maven artifact to the snapshot build?\n\nI don't know the answer, but I object to going down this road.  There is a reason for not depending on snapshots: they change, often incompatibly.  Having internal snapshots isn't just a sneaky workaround - it fixes the underlying problem (potentially incompatible changes), while also, of course, creating a different problem...\n\nWe have an example in the specific case of commons-csv: as Emmanuel said, the API has changed (very likely incompatibly) since our internal snapshot was taken.\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223448",
            "date": "2012-03-06T17:32:32+0000",
            "content": "But you might reference org.apache.solr:solr-commons-csv:3.5.0 in Solr 3.6\n\nI think this is a good idea, and would require very little effort.  I'll make a patch. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223453",
            "date": "2012-03-06T17:34:57+0000",
            "content": "\nTorsten, in case you're wondering why nobody is answering you: Lucene/Solr publishes Maven artifacts that are identical to the released Ant-built binary jars, so your proposal would require increasing the size of our released jars, solely to solve a Maven dependency problem. Changing the Ant build simply to solve Maven problems has historically been a non-starter.\nSteven, this will not increase the global size of the distribution, it might even reduce it. You are trading a core Solr jar with a few modified dependent jars, all downloaded from the central Maven repository, for a unique jar containing Solr and it dependencies, and possibly only the necessary classes. For example Solr doesn't use the writer package of Commons CSV, it can be automatically removed in the process to reduce the size of the dependencies.\n\nStill not interested?  "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223458",
            "date": "2012-03-06T17:41:05+0000",
            "content": "Still not interested?\n\nI think you missed my point?: Changing the Ant build to fix a Maven problem is a non-starter. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223463",
            "date": "2012-03-06T17:46:01+0000",
            "content": "But you might reference org.apache.solr:solr-commons-csv:3.5.0 in Solr 3.6\n\n+1 "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223486",
            "date": "2012-03-06T18:07:21+0000",
            "content": "Steven, you created this Maven problem by releasing conflicting artifacts to the central repository. Refusing to fix it is irresponsible. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223502",
            "date": "2012-03-06T18:18:32+0000",
            "content": "Steven, you created this Maven problem by releasing conflicting artifacts to the central repository.\n\nIn fact, I am personally responsible for putting the conflicting artifacts in the central repository.  It is also largely as a result of my efforts that Lucene/Solr continues to publish Maven artifacts at all.\n\nRefusing to fix it is irresponsible.\n\nOnly if one assumes that refusing to implement your proposed fix is equivalent to refusing to do anything?  I suspect we disagree on this point.\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223527",
            "date": "2012-03-06T18:40:41+0000",
            "content": "Steven, you created this Maven problem\n\nLets keep our heads cool here.  To be clear, Steven wants to help and is doing what he can.  We need to figure a way to help within the limits of the lucene community.  Previous discussion in this thread should give you a sense of the animosity towards maven – the question is how to move forward within these limits.\n\nThe obvious best solution is to point to an official commons-csv release.\n\nShort of that, we need to make sure we don't make the problem worse;  We can do that by releasing 3.6 pointing to the 3.5 solr-commons-csv package.  \n\n\n\n\n\n\n\n\n\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223556",
            "date": "2012-03-06T19:08:29+0000",
            "content": "\nPrevious discussion in this thread should give you a sense of the animosity towards maven – the question is how to move forward within these limits.\n\nIts not unjustified animosity towards maven: this issue is solely maven  "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223577",
            "date": "2012-03-06T19:27:16+0000",
            "content": "Steven I wasn't referring to you explicitly, but to the Solr community. I didn't know you actually deployed the artifacts. If you dislike Maven you'll be pleased to learn that it was a great blow to the Maven integrity \n\nI'm glad to hear you are willing to do something, what's your plan? Let me recap the options currently identified:\n\n\tEmbed the Commons CSV source files in the core of Solr. That was the purpose of my patch, but it doesn't solve the issue for the other dependencies (carrot, noggit, uima, jsonic, etc)\n\tEmbed the pacthed dependencies in the main Solr jar and rename the packages with jarjar or a similar tool. The additional benefit it a reduction of the global distribution size by keeping only the classes actually used by Solr.\n\tKeep publishing Solr specific dependencies but after renaming the packages with JarJar\n\tImport the source of the dependencies and rename the package with the Ant replace task (Tomcat solution)\n\tStop releasing Maven artifacts completely, even Solr core.\n\n\n\nPointing to the 3.5 artifacts is a temporary solution, because:\n\n\tthe classpath conflicts still exists for projects importing solr-core\n\tthe next time Solr needs a patched unreleased dependency it will be problematic\n\n "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13223622",
            "date": "2012-03-06T20:23:54+0000",
            "content": "To be clear, Steven wants to help and is doing what he can.\n\nI would make this statement far stronger:\n\nWithout all of Steven's hard work struggling with Maven, while working\nwithin the constraints of the other Lucene/Solr committers (who\ngenerally, strongly, dislike the impositions Maven places on a\nproject's development, case in point), there would be no Maven\nartifacts for Lucene nor Solr.\n\nSeriously, Steven is the ONLY reason why Lucene and Solr have, and\ncontinue to have, Maven artifacts.\n\nThank you Steven!! "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223735",
            "date": "2012-03-06T22:19:04+0000",
            "content": "Patch switching solr-commons-csv Maven dependency to v3.5.0.\n\nI will commit in a couple of hours if there are no objections. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223770",
            "date": "2012-03-06T23:06:21+0000",
            "content": "Pointing to the 3.5 artifacts is a temporary solution\n\nI agree.  I also agree with Ryan: \"[W]e need to make sure we don't make the problem worse; We can do that by releasing 3.6 pointing to the 3.5 solr-commons-csv package.\"\n\nIf you dislike Maven you'll be pleased to learn that it was a great blow to the Maven integrity \n\nI actually like Maven for some things.\n\n\"Great blow\"?  I sincerely doubt that this is the first time something like this has happened.  \n\n\"Maven integrity\"?  Oxymoronic much?\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223829",
            "date": "2012-03-06T23:46:06+0000",
            "content": "I'm glad to hear you are willing to do something, what's your plan?\n\nI don't have one yet.  What's your plan for releasing commons-csv?\n\n\nLet me recap the options currently identified:\n\n1. Embed the Commons CSV source files in the core of Solr. That was the purpose of my patch, but it doesn't solve the issue for the other dependencies (carrot, noggit, uima, jsonic, etc)\n\n-1. I think this is too intrusive.  Maven's requirement cannot dictate Lucene/Solr Ant build structure.\n\n2. Embed the pacthed dependencies in the main Solr jar and rename the packages with jarjar or a similar tool. The additional benefit it a reduction of the global distribution size by keeping only the classes actually used by Solr.\n\n-1.  Again, too intrusive.\n\n3. Keep publishing Solr specific dependencies but after renaming the packages with JarJar\n\nI think this is a possibility.\n\n4. Import the source of the dependencies and rename the package with the Ant replace task (Tomcat solution)\n\n-0.  The project would require a new module for each dependency.  Seems too heavy to me.\n\n5. Stop releasing Maven artifacts completely, even Solr core.\n\n Fantastic! Thanks for your input! You're, like, awesome! "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223842",
            "date": "2012-03-07T00:06:32+0000",
            "content": "Emmanuel, you neglected to include transitive exclusion in your \"identified options\":\n\n6. Ryan suggested excluding solr-commons-csv from solr-core's transitive dependencies: https://issues.apache.org/jira/browse/SOLR-3204?focusedCommentId=13222930&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13222930\n\nThis puts the burden on users, who won't know it's necessary until after they run into classpath trouble.  We should figure out something better. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223865",
            "date": "2012-03-07T00:37:45+0000",
            "content": "\nWe should figure out something better.\n\nNot knowing anything about maven, but just comparing this to the releases that solr users download, the main\ndifference seems to be that in general the 'artifact' for an ordinary user is a .war file, a server-side \nwebapp that a user places into their servlet container... maybe the maven artifact should be consistent with that?\n\nWouldn't this avoid exposing any internal implementation details of whats actually inside that .war file,\nsuch as any external dependencies? "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13223868",
            "date": "2012-03-07T00:40:26+0000",
            "content": "@Steven Yes that's a possible workaround for Solr users, as long as they don't touch directly or indirectly the CSV related classes. But that solution doesn't spare a necessary modification of the Solr build with regard to patched dependencies. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13223872",
            "date": "2012-03-07T00:44:27+0000",
            "content": "Solr is a end-user product, so I have no idea why it is in maven at all. \n\nthe 'artifact' for an ordinary user is a .war file, a server-side webapp that a user places into their servlet container... maybe the maven artifact should be consistent with that? Wouldn't this avoid exposing any internal implementation details of whats actually inside that .war file, such as any external dependencies?\n\nSolr can be used in embedded fashion (though I don't have any experience with that).\n\nAlso, solrj is a client jar.\n\nedit: oops, solrj isn't relevant here - we're talking about solr-core. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223881",
            "date": "2012-03-07T00:56:27+0000",
            "content": "The real problem (regardless of ant/maven) is for users that want to use o.a.c.csv classes that are not the ones in the solr distribution.  This can happen when people have plugins using something based on a recent CSV build – something will break, either their code, or the CSVResponseWriter\n\nThis is not a maven issue, it is a question of who should put classes into the org.apache.commons.csv namespace.  I understand why the csv folks are pissed, and think it is fair we look for ways to fix it.\n\nI am now +1 on Emmanuel's patch to embed o.a.solr.csv in the solr core jar file – we should have notes that it won't be supported once a real csv is released.\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223907",
            "date": "2012-03-07T01:53:27+0000",
            "content": "\nThis is not a maven issue, it is a question of who should put classes into the org.apache.commons.csv namespace.\n\nThis is a 100% maven and only maven issue.\n\nFor the ant build we are just using a snapshot jar in solr/lib, not 'releasing' nor 'putting classes' anywhere.\nIts an implementation detail of solr. Its simply a dependency. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223920",
            "date": "2012-03-07T02:31:32+0000",
            "content": "Sorry, by 'put classes', i mean that when commons-csv-1.0-SNAPSHOT-r966014.jar is in the runtime classpath it uses classes in the namespace org.apache.commons.csv\n\nBy using this namespace, it prevents people from using other dependencies with that same package name reliably.  The commons-csv folks are understandably upset that that means their jar file does not work as expected within solr.\n\nConsider the case where someone deploys the solr.war file (built by ant) with a plugin that uses the current commons-csv.jar from /trunk.  something will break – either the CSVRequestHandler or their plugin depending on what is first in the classpath.  (I think their plugin would always fail since it is loaded second)\n\nI think we have gotten lost in the maven discussion, when the real problem is about how our CSV.jar interacts with plugins (or anything else in the runtime classpath)\n\n\n\n\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13223922",
            "date": "2012-03-07T02:43:37+0000",
            "content": "This issue isnt about plugins, having commons-csv in the classpath only affect users of solr.\n\nPlease don't try to spin the issue, this issue is all about maven and only about maven:\n\n\tthe very title of this jira issue 'solr-commons-csv' is a maven-only concept\n\tas stated by Emmanuel in his first response back 'Even if you consider solr-commons-csv to be an internal part of Solr it's now a public Maven artifact that people are starting to use in their projects'\n\n\n\nSo thats the only issue, maven artifacts.  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13223984",
            "date": "2012-03-07T05:08:21+0000",
            "content": "I'm not trying to spin anything – I'm trying to figure out what the real issue is.  Part of it is obviously the maven release.  Emmanuel can you tell us more about how this came up? "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224116",
            "date": "2012-03-07T09:22:17+0000",
            "content": "Your analysis is correct Ryan. Anyone building upon the Solr code is affected by this issue. The fact the offending artifacts are in the central Maven repository only makes the problem worse, \n\nI discovered this issue because someone who imported solr-commons-csv in its project reported an issue (SANDBOX-330), an infinite loop with trailing comments, that was already fixed on the trunk. I didn't know about the solr-commons-csv artifact in the central Maven repository until then. So I inspected the jar and gasped in awe at the unmodified namespace.\n\nI understand that Maven as a build tool is controversial, I'm myself an heavy Ant user on several projects requiring complex build setups. But Maven, as a way to share code through a central repository, is also a very valuable tool. It's adopted by alternative build tools like Ivy and Gradle. It's also used by IDEs to import dependencies automatically and to be able to browse their source and Javadoc easily. It's difficult to understand why this part is also hated by Maven detractors. The constraints on the central repository aren't that unbearable, the most important rule to follow is to not publish two artifacts identified by distinct groupId:artifactId with conflicting classes. The corollary is that a project A should not publish classes in the namespace of a project B. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224205",
            "date": "2012-03-07T11:09:50+0000",
            "content": "The arguments that this is more than a maven issue are bogus.\nDo you take me for a fool?\n\nThe same arguments could be had for even released dependencies like httpclient-3.0 that we use. What if a user wants to use 4.0?\n\nTo ant, whether its released or unreleased, its just a jar in a /lib and in the users classpath.\nBut thats not the real issue here: These people are angry about maven repositories.\n\nSo quit screwing around with crazy ideas about duplicating whole codebases and fix the real problem:\n\nopen a bug report at Maven with the Description:\n\nAllow maven project A to depend upon project B without B being in maven at all\n\nThats the bug, it stops the replication of the virus, and i don't see any reason why maven wouldnt want to fix it? If they object, then it only proves my point that its really the GPLv3 of build tools.\n\n "
        },
        {
            "author": "Greg Stein",
            "id": "comment-13224208",
            "date": "2012-03-07T11:24:32+0000",
            "content": "Maven is a red herring.\n\nThe short answer is that the Lucene PMC is releasing artifacts (to the maven repository) in the org.apache.commons namespace.\n\nIt doesn't matter how the release is done. You're doing it. You have released Commons code to the public. Period. Stop pointing fingers at tools. The Lucene PMC has released code in another project's namespace, which is incompatible with the direction that project wants to take the namespace. The Lucene PMC has no right to usurp the direction of other projects here at the ASF.\n\nIf you cannot get the tool to avoid releasing/interfering with other projects' code, then stop using the tool. Seriously.\n\nThe Lucene PMC's releases should stop interfering with other projects' namespaces. Find a way to fix it. Stop blaming tools. Start fixing. "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224209",
            "date": "2012-03-07T11:25:48+0000",
            "content": "HTTClient 4 can coexist with HTTPClient 3 in the same classpath, because they are not in the same package. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13224284",
            "date": "2012-03-07T13:18:16+0000",
            "content": "I guess I'm missing something.  We aren't part of the Commons project.  The Commons code is Apache licensed, we are using it as we see fit under the T&C of the ASL.  What prevents someone else from going and doing the same thing outside of Apache?  In fact, it happens all the time, even at Apache.  Commons CLI 2 is the biggest one, as I know of several projects that \"release\" that b/c Commons itself never has.  Here are also several who do it for Lucene.  The problem is Maven and it isn't going away.\n\nHere are some examples:\n\n\thttp://search.maven.org/#artifactdetails%7Corg.hibernate.apache.lucene.solr%7Capache-solr-analyzer%7C1.2.0%7Cjar\n\thttp://search.maven.org/#artifactdetails%7Corg.apache.clerezza.ext%7Corg.apache.lucene%7C0.1-incubating%7Cbundle\n\n\n\nTomcat does the same thing to Commons (file upload, for example):\n\n\thttp://search.maven.org/#search%7Cga%7C4%7Ccommons\n\n\n\nI could keep going.  Just do searches for popular Apache libraries in Maven and you will see what I mean.  Maven is not a red herring.  It is the problem.   "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224329",
            "date": "2012-03-07T13:33:33+0000",
            "content": "That's not correct for Tomcat, the Commons components in Tomcat have a different namespace to avoid classpath conflicts.\n\nClerezza releases will have to be changed too.\n\nHibernate probably made a mistake in 2008, they haven't released a solr artifact since then, so I guess they fixed the issue.\n\nEDIT: Indeed Hibernate fixed the dependency in Hibernate Search 3.3.0 Beta2, the dependency was introduced with the Beta 1 "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13224332",
            "date": "2012-03-07T13:44:08+0000",
            "content": "More that do it:\nGeronimo (Apache) (Digester, Discovery)\nJVNet-Hudson (commons-jelly)\ncom.kenai.nbpwr\nServiceMix (commons-csv)\nApache Directory does this weird thing where they package the Commons jars inside of another jar.  Not sure what that does, but the nested jar is Commons.  Not quite sure how the classloader would deal with that.\nMahout does it for Commons-CLI2 (b/c commons never seems to want to release it)\n\nAnd that is just me searching for commons.\n\nBTW, I don't actually think the problem is Maven.  The problem is Java's classloader is broken.  The way to fix it is to use a classloader that scopes dependencies properly.  Otherwise, this is simply a known problem with Java and the solution is that one has to be careful about what versions of things one imports.  It's exactly the same issue as when one has two dependencies that each have dependencies on different versions of commons-lang or Lucene or whats-it-called.jar. \n\nIn other words, I don't think this is worth us doing anything different than what we are already doing.  Except, for seeing if we can upgrade our version of Commons CSV to an official release as a courtesy.  "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13224333",
            "date": "2012-03-07T13:46:07+0000",
            "content": "There are two very different issues mixed in here:\n\nIssue 1: a private, internal dependency in Solr on commons-csv (and\nothers) has become \"publicly released\" in Maven as solr-commons-csv.\nI know very little about Maven, but this does sound bad.  That said, I\ndon't think Maven has any right to \"peek in\" and force Solr's private\ndependencies to become public; what deps Solr uses is an\nimplementation detail of Solr. Short of removing Solr from Maven, is\nthere some way to publish Solr's WAR through Maven while keeping (some\nof?) its dependencies private?\n\nIssue 2: JAR hell (runtime CLASSPATH pollution): this is an age old,\nwidespread issue, completely orthogonal to Maven.  Regardless of how a\nproject builds its artifacts, if it has external dependencies, it will\nof course \"pollute\" the CLASSPATH.  This is a well known problem.\n\nReally, we should open a new issue for issue 2: it has nothing to do\nwith Maven and is long-standing (our ant-produced artifacts have had\nthe issue forever).  In practice, this has never seemed to be a\nproblem to users, presumably because users don't usually embed Solr.\nNormally users deploy the WAR and use as-is, except for plugins.  If\nwe really think this needs to be fixed (I'm doubtful), there are\nvarious options... eg OSGI seems to \"solve\" this, but adds complexity.\nJarjar, minijar, ant replace, are also options, but I don't like the\nrisk of hard-to-explain bugs.  We can discuss on a separate issue... "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13224344",
            "date": "2012-03-07T13:59:25+0000",
            "content": "That's not correct for Tomcat, the Commons components in Tomcat have a different namespace to avoid classpath conflicts.\n\nNot in the ones I downloaded.\n "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224348",
            "date": "2012-03-07T14:05:58+0000",
            "content": "Grant, get the latest ones:\n\nhttp://www.jarvana.com/jarvana/inspect/org/apache/tomcat/tomcat-dbcp/7.0.23/tomcat-dbcp-7.0.23.jar "
        },
        {
            "author": "Mike Sokolov",
            "id": "comment-13224365",
            "date": "2012-03-07T14:27:04+0000",
            "content": "There is no issue for users of the WAR, I think, which will generally be external to a project, and handles all of these bundling issues internally.\n\nThe issue arises in projects that depend on the various solr jars that are bundled in its WAR.  Using Maven, it's as if you exploded the WAR, pulled all its jars into your project, and then added your own code too.  As an example, we've done this in a project where I work so we can run EmbeddedSolrServer in our tests. I have it on my TODO list to break this dependency though since it's overkill to include all of solr in our project for this convenience.   "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224377",
            "date": "2012-03-07T14:46:12+0000",
            "content": "As noted before, we cannot fix this for Jetty 6 by package-renaming using JarJar, as this would break almost everything in the jetty configuration (Jetty is JarJar unfriendly), but Jetty can be easily solved on our side by upgrading to Jetty 8 (also for Solr 3.6!!!!). The patch/branch is ready, just needs committing. We can then ship with unmodified Jetty 8, as the Unicode bugs should be fixed.\n\nFor the other projects I see no real problem in using jarjar (which is used in lots of projects): Lets simply investigate what foreign namespaces we use in our packages (e.g. we should also rename the Snowball classes, because we heavily forked them and they are still in org.tartarus namespace - as we forked that project, we should do it in the source code). For e.g. commons-csv we have no problem jarjaring our fork and re-release it. In the jarjar issue tracker is also a discussion about “hiding” renamed classes from GUIs by prefixing all renamed class names with $, so they are invisible for an autocomplete-using Eclipse developer, so nobody outside can use the jarjared classes outside Lucene/Solr.\n\nAbout the remaining issues Robert mentioned: They are all solvable. JarJar renames also class names inside strings used for reflection, it can also rewrite Manifests and META-INF (we use e.g. for codecs, or Apache Xerces uses to plug in the parser impl). I just would like to give it a try, it cannot happen more than our testcases do not run. The example Robert has given with external references to icu4j is exactly what we want to prevent with JarJaring, so it doesn’t apply in my opinion. If we patch and modify icu4j and ship with a package-renamed version, code that uses reflection outside the Solr/Lucene JAR is completely unaffected. If the external project side-by-side with Lucene/Solr wants to use icu4j it can simply include the original in any version, solr with its patched version is completely unaffected and vice versa.\n\nSo I would strongly suggest to jarjar all dependencies that we modified locally (means all foreign jar-files with solr-prefix). How we do this is a different issue: We can only rename all classes in that jar-file and republish it (but then we have to change our import statements in our code – I would prefer this), or we jarjar the whole Solr distribution after the complete build. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224381",
            "date": "2012-03-07T14:55:29+0000",
            "content": "How would this work for e.g. the carrot2 example? The carrot2 class names are referenced in user configuration files (solrconfig.xml):\n\nFor example:\n\n    <lst name=\"engine\">\n      <!-- The name, only one can be named \"default\" -->\n      <str name=\"name\">default</str>\n      <str name=\"carrot.algorithm\">org.carrot2.clustering.lingo.LingoClusteringAlgorithm</str>\n    </lst>\n\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224384",
            "date": "2012-03-07T14:58:22+0000",
            "content": "Also the UIMA integration has the same issue, configuration files contain their qualified class names, for example:\n\n\n<type allAnnotatorFeatures=\"true\">org.apache.uima.SentenceAnnotation</type>\n\n "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224389",
            "date": "2012-03-07T15:05:37+0000",
            "content": "\nHow we do this is a different issue: We can only rename all classes in that jar-file and republish it (but then we have to change our import statements in our code – I would prefer this), or we jarjar the whole Solr distribution after the complete build.\n\nIt's preferable to post process the Solr jar rather than renaming the packages imported in the source code. That's less intrusive and let you upgrade to the official fixed dependency more easily. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13224399",
            "date": "2012-03-07T15:19:33+0000",
            "content": "As Mike and Yonik mentioned - most of us don't know much about maven. I still wish it was a downstream issue. I still wish we would have voted on supporting it. With all due respect to Steve and his great work around it. I really wish it was not our problem - as I know many others do.\n\nWhat was the issue with just using a released version of csv? This issue is so long already, its hard to find it. \n\nAnd -1 for continuing Maven support within the project for what its worth  (Though I love your work and dedication to this Steve  ) "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224402",
            "date": "2012-03-07T15:23:54+0000",
            "content": "\nWhat was the issue with just using a released version of csv? This issue is so long already, its hard to find it. \n\nI think the major issue is that there is not yet a released version. I think we would definitely prefer that.\n\nSpeaking from some experience: In my opinion CSV is deceptively complex and is a perfect example of where we \nwould rather 'downstream' that knowledge to someone who focuses on it and gives good performance. \nRolling our own is dangerous.\n\nBut there is not yet any official releases to use... "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224424",
            "date": "2012-03-07T15:28:54+0000",
            "content": "\nHow we do this is a different issue: We can only rename all classes in that jar-file and republish it (but then we have to change our import statements in our code – I would prefer this), or we jarjar the whole Solr distribution after the complete build.\n\nIt's preferable to post process the Solr jar rather than renaming the packages imported in the source code. That's less intrusive and let you upgrade to the official fixed dependency more easily.\n\nThat's our committers decision. The fact here is, that Solr or even Lucene is not just a WAR file, its consisting of lot's of unrelated JAR artifacts and all of them should live on its own, so a user can remove features he does not need. So I prefer to \"transform\" those \"changed\" artifacts separately to private \"namespace\" and simply change maybe 3 import statements (I can even use \"sed\" for that). "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13224429",
            "date": "2012-03-07T15:36:05+0000",
            "content": "But there is not yet any official releases to use...\n\nAh, interesting. Perhaps we could get the favor of a release \n\nIt's 5 classes it looks like - and it's Apache licensed and there is no release - can't we simply suck this into our code base with a readme and JIRA about removing it and switching to a release when one occurs? Get the whole dependency thing right out of Maven's claws. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224433",
            "date": "2012-03-07T15:38:59+0000",
            "content": "So I prefer to \"transform\" those \"changed\" artifacts separately to private \"namespace\" and simply change maybe 3 import statements (I can even use \"sed\" for that).\n\n+1 "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224434",
            "date": "2012-03-07T15:39:27+0000",
            "content": "That was the purpose of my patch Mark  "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224437",
            "date": "2012-03-07T15:43:47+0000",
            "content": "\nIt's 5 classes it looks like - and it's Apache licensed and there is no release - can't we simply suck this into our code base with a readme and JIRA about removing it and switching to a release when one occurs? Get the whole dependency thing right out of Maven's claws.\n\nYes while this is the case, and as Emmanuel states, the purpose of his patch, its not a scalable solution in general.\nIts also expensive to fork software... there is always the danger that we then become out-of-sync and never sync back up.\n\n(feel free to hit me, for Uwe's example of snowball, which is a perfect example)\n\nWhat about the other cases that fall into this same 'maven namespace' category, e.g. the UIMA case for example?\n\nHow to fix the general problem? Thats why I think that the only proper way to fix the bug is to attack it at the heart:\nThats the fact that for maven project A to depend upon project B that is not in maven, maven project A must \"publish\" some \"fake maven release\" of project B. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224438",
            "date": "2012-03-07T15:48:20+0000",
            "content": "And for the record, i want to withdraw my opposition to Emmanuel's patch.\n\nI still feel strongly this doesn't solve the 'real problem', but if it makes the commons-csv developers happy, lets do it.\n\nThough I think its fair to say I will speak up if i see any commits/local modifications to this, because ultimately I want\nto see us depending upon a released version of this jar file. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13224441",
            "date": "2012-03-07T15:52:06+0000",
            "content": "That was the purpose of my patch Mark \n\n+1 - I think this is the way to go, I just haven't understood any objections to it yet.\n\nI still feel strongly this doesn't solve the 'real problem',\n\nHate to sound like a broken record jerk, but again I think the real problem is our support of Maven \n\nI don't see how, short of dropping internal Maven support, we solve the real problem. And barring a full glorious solution, this is a small and simple thing we can do that makes the commons guys happy. If all of a sudden we are bombarded by issues like these, I guess we can burn that bridge later. And drop Maven  "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224454",
            "date": "2012-03-07T16:02:31+0000",
            "content": "\nI still feel strongly this doesn't solve the 'real problem', but if it makes the commons-csv developers happy, lets do it.\n\nThough I think its fair to say I will speak up if i see any commits/local modifications to this, because ultimately I want\nto see us depending upon a released version of this jar file.\n\nTo prevent this I would prefer jarjar, its not risky here at all (and also not for other usitility libs from commons). I am already plaing around with that. What I did here was repackage the JAR file and used a simple serach/replace on our source files to refer to new package name. Not even maven config has to be changedm Steven Rowe can publish the solr-commons-csv.jar as he likes. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224465",
            "date": "2012-03-07T16:09:21+0000",
            "content": "Uwe: maybe we should do it just for this case (rather than offering a general solution?)\n\nBasically what i'm trying to say is that the general problem is complex, I think there are enough examples (jetty, carrot2, uima, etc)\nthat fall in this category that aren't really solved by jarjar. I think we either need to solve this issue as a 'case-by-case' for commons-csv,\nor fix the entire problem (which definitely, definitely, certainly, without a doubt, involves fixing maven).\n\nBut to be practical, lets come up with something so that commons-csv developers are happy and can issue a release (which we can then depend upon).\n\nKeeping in mind that this is supposed to be a 3.6 minor release, can we apply the jarjar solution only to commons-csv?\nI feel the other situations are more dangerous and I think we should be careful, but at the same time we should address\ntheir concerns and put ourselves in a situation where we don't end out 'forking' it... I don't want to see that. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13224476",
            "date": "2012-03-07T16:25:14+0000",
            "content": "can we apply the jarjar solution only to commons-csv?\n\n+1 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224479",
            "date": "2012-03-07T16:31:28+0000",
            "content": "I think there are enough examples (jetty, carrot2, uima, etc) [...]\n\nWe are not currently publishing third party solr-uima-* artifacts, though we have in the past (versions prior to 3.5.0). "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224482",
            "date": "2012-03-07T16:33:49+0000",
            "content": "Here the patch and the transformed JAR file (and renamed). Most of the patch is my rename of the JAR file to solr- prefix. Code changes is 5 lines of import statements!\n\nWhat I did:\n\n\tcopy the original JAR file to a folder\n\tplace jarjar-1.2.jar somewhere\n\tedit the rules.txt file and change package names\n\trun java -jar jarjar-1.2.jar process rule.txt commons-csv-1.0-SNAPSHOT-r966014.jar solr-commons-csv-1.0-SNAPSHOT-r966014.jar\n\tplace the resulting jar file in solr/core/lib (remove the old one before) and commit it like any other bundled artifact \n\n\n\nAll tests pass and the supplied JAR file could be published in maven with the name sarowe gave it. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224489",
            "date": "2012-03-07T16:38:47+0000",
            "content": "Thanks Uwe: i support your change. I think it is the best compromise.\n\nit seems to me, because the jar is \"pre-jar-jar'ed\" we don't fall into various \nIDE configuration conflicts either right? Its just as easy for developers to configure \ntheir workspace (ant eclipse, ant idea)\n\n+1 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224491",
            "date": "2012-03-07T16:40:26+0000",
            "content": "+1 for Uwe's JarJar fix. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224497",
            "date": "2012-03-07T16:48:28+0000",
            "content": "The keep line is not even needed in the rules.txt. There is one small issue: The resulting JAR file contains an empty org.apache.commons folder and some maven relicts (die,die,die), but thats minor. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224506",
            "date": "2012-03-07T17:08:38+0000",
            "content": "Updated patch to make it mor consistent with the naming conventions of Solr. \n\nI think we should do the same for the other file in lib: noggit\n\nSteven Rowe: What other modified JARs do we have that are republished through maven? "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13224510",
            "date": "2012-03-07T17:16:05+0000",
            "content": "Don't jarjar Carrot2, please. We are plugging in our commercial clustering engine into Solr via Carrot2 controllers so if you change package namespace we will no longer be able to do it. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224515",
            "date": "2012-03-07T17:23:16+0000",
            "content": "Steven Rowe: What other modified JARs do we have that are republished through maven?\n\nFor branch_3x:\n\n\n\n\nmodule\njar\n\n\nLucene benchmark\nlucene/contrib/benchmark/lib/xercesImpl-2.9.1-patched-XERCESJ-1257.jar\n\n\nSolr clustering\nsolr/contrib/clustering/carrot2-core-3.5.0.jar\n\n\nSolr langid\nsolr/contrib/langid/lib/jsonic-1.2.0.jar\n\n\nSolr langid\nsolr/contrib/langid/lib/langdetect-r111-java5.jar\n\n\nSolr core\nsolr/lib/apache-solr-noggit-r1099557.jar\n\n\nSolr core\nsolr/lib/commons-csv-1.0-SNAPSHOT-r966014.jar\n\n\n\n\n\nTrunk is the same, except that the carrot2-core jar is no longer required (it's required on branch_3x because it's a specially Java5-compiled jar, but no longer on trunk/4.0, which requires Java 6, and so can use the Maven central artifact.)\n\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224516",
            "date": "2012-03-07T17:23:29+0000",
            "content": "According to Steven, we don't republish them so there is no need to do this. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224524",
            "date": "2012-03-07T17:26:54+0000",
            "content": "For carrot: If you can just compile carrot with Java 5 and produce Java 5 JARs, why does Dawid/Carrot not do this? A Java 6 class/jar file is not really useful if just the version number of the file header is different... "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13224602",
            "date": "2012-03-07T19:08:11+0000",
            "content": "Well the carrot is similar to the uima case, in both cases we have their committers also as committers working\non integrations within on our project, and they have voiced no problem with how things work so far, so why break it? "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13224634",
            "date": "2012-03-07T19:35:53+0000",
            "content": "\nHow to fix the general problem? Thats why I think that the only proper way to fix the bug is to attack it at the heart:\nThats the fact that for maven project A to depend upon project B that is not in maven, maven project A must \"publish\" some \"fake maven release\" of project B.\n\n+1, this sums up the Maven issue.\n\nBut is it really true?  Is there really no way to stop Maven from\nmaking project A's private deps public?  This is horribly invasive.\n\nCLASSPATH polution is a separate, widespread, longstanding and very\nreal issue. I don't think jarjar'ing every dependency Solr (or our\nmodules, contribs, etc.) is a good general solution.\n\nBut I think it's OK in this case... progress not perfection. Your\npatch looks good Uwe, thanks! "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13224645",
            "date": "2012-03-07T19:53:13+0000",
            "content": "+1 thanks Uwe\n\nI don't think jarjar'ing every dependency Solr\n\nThe only jar files in question are snapshot/unreleased code.  The commons-csv problem is a non issue if we were using a released version. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13224663",
            "date": "2012-03-07T20:13:22+0000",
            "content": "The commons-csv problem is a non issue if we were using a released version.\n\nWait, are you talking about the Maven issue (\"my private deps become publicly released to Maven\"), or the more general JAR hell problem?\n\nFor JAR hell, I thought even released versions can cause problems too?\n\nIe, we include version X of a dep, and the app embedding solr is using version Y, and they may conflict?\n\nIe the classic problem: http://en.wikipedia.org/wiki/Java_Classloader#JAR_hell "
        },
        {
            "author": "Tommaso Teofili",
            "id": "comment-13224678",
            "date": "2012-03-07T20:27:25+0000",
            "content": "Well the carrot is similar to the uima case, in both cases we have their committers also as committers working on integrations within on our project, and they have voiced no problem with how things work so far, so why break it?\n\nalso starting from 3.5.0 the UIMA dependencies' jars are released artifacts (see SOLR-2746 and thus http://mvnrepository.com/artifact/org.apache.solr/solr-uima/3.5.0 ) "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224683",
            "date": "2012-03-07T20:32:49+0000",
            "content": "For JAR hell, I thought even released versions can cause problems too?\n\nYes of course. But e.g. maven can help to prevent those problems. It will not allow you to add the same dependency in different versions. The issue we had caused by our separate release of unreleased package under the solr group-id was that maven is seeing our repackaged dependency under another artifact id - so it cannot prevent that a project adds solr-commons-xx, version-foo and commony-xx, version-bar, because it is two different things. "
        },
        {
            "author": "Tommaso Teofili",
            "id": "comment-13224688",
            "date": "2012-03-07T20:37:57+0000",
            "content": "The issue we had caused by our separate release of unreleased package under the solr group-id was that maven is seeing our repackaged dependency under another artifact id - so it cannot prevent that a project adds solr-commons-xx, version-foo and commony-xx, version-bar, because it is two different things.\n\nyes, that's also my understanding of this issue with unreleased dependencies' jars. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13224690",
            "date": "2012-03-07T20:39:56+0000",
            "content": "Wait, are you talking about the Maven issue (\"my private deps become publicly released to Maven\"), or the more general JAR hell problem?\n\nI see this entirely as as JAR hell problem.  Maven just makes it easier to discover.  \n\n\nFor JAR hell, I thought even released versions can cause problems too?\n\nOf course - but this is an expected side-effect of a release.  This whole discussion is because the commons-csv people never agreed to support the classnames solr is using.  If they request we change the name, it seems only appropriate that we do.\n\n\n\n "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13224692",
            "date": "2012-03-07T20:41:21+0000",
            "content": "For carrot: If you can just compile carrot with Java 5 and produce Java 5 JARs, why does Dawid/Carrot not do this? A Java 6 class/jar file is not really useful if just the version number of the file header is different...\n\nIt's not that simple. We use 1.6 APIs and we have libraries that are compiled under 1.6. The version embedded in Solr is patched and backported using retroweaver if I remember correctly. Like I said, I don't have a problem if you just publish that particular artefact as is under Solr's groupid. I don't see a problem here, really. Classpath conflicts do happen but it's easier to recover from a classpath conflict than from a jarjared file which happens to use runtime reflection or something like that (just replacing strings is often not enough if class names are constructed dynamically).\n "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13224723",
            "date": "2012-03-07T21:27:33+0000",
            "content": "So, I hear that you all wish that you had more control over the dependencies that you propagate when you publish to maven central. Perhaps I could help?\n\nOption 1, which you've already detected, is to use jarjar or shade so that you can publish your fork of someone else's stuff in your own package namespace fairly painlessly, either storing it inside some other jar of yours or publishing it under your coordinates.\n\nOption 2 is optional dependencies: http://maven.apache.org/guides/introduction/introduction-to-optional-and-excludes-dependencies.html.\n\nThis is a way to force the users of your artifacts to explicitly declare some or all of your dependencies, rather than getting them automatically. In other words, virality control.\n\nNow, if you don't publish one of these, anyone who uses your published artifact will get past the maven dependency graph – and then sink or swim based on whether they've made their own arrangements to get the code into their classpath. I can't help wondering how this helps with the original complaint of the Common(s)-Folk: if you release a version of Lucene that requires a forked version of Commons, and you don't change the packages, you're setting up for a classpath conflict, sooner or later, with or without maven, aren't you?\n\n\nOption 3 is simply to observe that your users can always use 'exclude' to cut off following some dependency link of yours that doesn't appeal to them.\n\nDoes any of this help?\n\np.s. I don't know much about jarjar, but I know that shade has a lot of fancy options that can, in some cases, compensate for reflection or other problems with the package rename process. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224740",
            "date": "2012-03-07T21:37:41+0000",
            "content": "p.s. I don't know much about jarjar, but I know that shade has a lot of fancy options that can, in some cases, compensate for reflection or other problems with the package rename process.\n\njarjar does the same. Shade is only available to Maven so not really useable for us. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224742",
            "date": "2012-03-07T21:38:21+0000",
            "content": "Dawid: Thanks for insight! "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224745",
            "date": "2012-03-07T21:40:16+0000",
            "content": "I prepared my checkout for committing this. It seems that we all agree that this is, until commons-csv is released, the simpliest option. I cleaned up the JAR file a little bit and removed the empty commons directory and removed the wrong maven metadata. I also added a note to NOTICE.txt, that this JAR file is a prerelease of commons-csv and was jarjared to an internal solr package name.\n\nAny objections? "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224749",
            "date": "2012-03-07T21:50:12+0000",
            "content": "Here my final patch and cleaned up jar. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13224751",
            "date": "2012-03-07T21:52:00+0000",
            "content": "Any objections?\n\n+1 to commit.\n\nBut can you please open a follow-on issue that once commons-csv is released we should upgrade...? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224752",
            "date": "2012-03-07T21:53:04+0000",
            "content": "\nOption 2 is optional dependencies: http://maven.apache.org/guides/introduction/introduction-to-optional-and-excludes-dependencies.html.\n\nThis is a way to force the users of your artifacts to explicitly declare some or all of your dependencies, rather than getting them automatically. In other words, virality control.\n\nI don't like the fact that taking this approach for all of our non-Mavenized dependencies (by which I mean those that are not in Maven Central) would put a much greater burden on our users that consume Lucene/Solr artifacts via Maven.  \n\nUsers would have to either have to a) download the binary release and manually install the non-Maven artifacts one-by-one in their local or internal repository (after consulting both the top-level Maven POM and a list of per-module dependencies that currently only exists in a lib/ directory listing); or b) download the source release, run ant get-maven-poms, then run mvn -N -Pbootstrap install.  Neither of these fall within the expected level of effort for Maven users.\n\n-1 from me for using optional dependencies to counter Maven's virality. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224757",
            "date": "2012-03-07T21:56:21+0000",
            "content": "But can you please open a follow-on issue that once commons-csv is released we should upgrade...?\n\nOf course!  "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13224758",
            "date": "2012-03-07T21:58:04+0000",
            "content": "Uwe you can also remove the writer package in the jar, Solr doesn't use it and it has been removed from Commons CSV. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224770",
            "date": "2012-03-07T22:06:13+0000",
            "content": "I think I leave it as it is for now. The jar file name contains the revision no of the Commons-CSV, so it should be unmodified (exept the package name).\n\nOnce Commons-CSV is released, we will drop the JAR file and replace by the official dependency. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13224772",
            "date": "2012-03-07T22:08:05+0000",
            "content": "In the unlikely event that you bump into something that makes shade attractive, let me know. I'll make you an ant task for it. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13224775",
            "date": "2012-03-07T22:09:29+0000",
            "content": "\nFor JAR hell, I thought even released versions can cause problems too?\n\nYes of course. But e.g. maven can help to prevent those problems. It will not allow you to add the same dependency in different versions. The issue we had caused by our separate release of unreleased package under the solr group-id was that maven is seeing our repackaged dependency under another artifact id - so it cannot prevent that a project adds solr-commons-xx, version-foo and commony-xx, version-bar, because it is two different things.\n\nI see.  So then we \"subverted\" Maven's ability to catch the\nconflicting versions of the same dep, by not using the same\ncoordinates that commons-csv will eventually use, once they release?\n\nGiven that, as crazy as this sounds, maybe we should have published\nusing the same coordinates?  Ie this way Maven apps would know they\nhad conflicting versions (one, from Solr, of what is basically a\npre-release snapshot of commons-csv, and another of a real, eventual\nfuture commons-csv release).\n\nOr.... maybe Maven should not make it a hard requirement that a\nnon-snapshot release (of Solr) cannot depend on a snapshot release (of\ncommons-csv)?  After all, this is really a judgement call of the\ncommitters (in Solr), as to whether a snapshot release is \"good\nenough\"/well tested, given how the project is using it, for its\npurposes/release?\n\nNet/net it looks like Maven's invasive/viral restrictions (\"all of\nyour deps become publicly released\", and \"your deps cannot be\nsnapshots\") are tying our hands here?\n\nSurely this problem has come up before in Maven usage? "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-13224778",
            "date": "2012-03-07T22:14:33+0000",
            "content": "Michael,\n\nI think you have put your finger on it. If you don't change the packages, don't change the gav. If you do change the packages, do change the gav.\n\nNone of which is to claim that Maven isn't full of flaws in this whole area; it does not model the entire world of things people need to do.\n "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13224791",
            "date": "2012-03-07T22:28:38+0000",
            "content": "Committed trunk revision: 1298164\nBackported 3.x revision: 1298169\n\nSteven Rowe: If I broke something with maven, can you please fix? I have no idea...  "
        },
        {
            "author": "Greg Stein",
            "id": "comment-13224816",
            "date": "2012-03-07T23:01:33+0000",
            "content": "Great work, Uwe. Thanks for stepping up help out the Apache Commons people! "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224818",
            "date": "2012-03-07T23:07:07+0000",
            "content": "Steven Rowe: If I broke something with maven, can you please fix? I have no idea... \n\nOnly one problem: the name of the source file in the bootstrap profile (copies lib/ files to users' local Maven repositories) - I just committed the file renaming to both trunk and branch_3x. "
        },
        {
            "author": "Scott Carey",
            "id": "comment-13224822",
            "date": "2012-03-07T23:12:23+0000",
            "content": "\nThis is a maven issue. solr-commons-csv only exists to maven.\n\nOtherwise these are just classes inside the war file (essentially an implementation detail of solr).\n\nThe java classpath is not an implementation detail if you expect any of your jars to share a classloader with others.  At least not until project Jigsaw is complete and Solr is using Java 8 modules.\n\n\nYes of course. But e.g. maven can help to prevent those problems. It will not allow you to add the same dependency in different versions. The issue we had caused by our separate release of unreleased package under the solr group-id was that maven is seeing our repackaged dependency under another artifact id - so it cannot prevent that a project adds solr-commons-xx, version-foo and commony-xx, version-bar, because it is two different things.\n\nExactly.  If you publish a maven artifact under a custom groupId:artifactId the sane thing to do is make sure the classes don't overlap with the old one.  Maven guards against duplicate artifacts in the same classpath.  Otherwise users will implicitly get both copies on their classpath too easily.\n\n\nThe arguments that this is more than a maven issue are bogus.\nDo you take me for a fool?\n\nWhat happens if a non-maven user gets both solr-commons-csv.jar and commons-csv.jar on their classpath?\n\n\nI think you missed my point?: Changing the Ant build to fix a Maven problem is a non-starter.\n\nThen specify it as <optional>true</optional> or <scope>provided</scope>.  If you publish to maven central a pom.xml that says \"Solr must have jar FOO!\" and then complain that it is a \"Maven problem\" when jar FOO is actually used, then you've used maven incorrectly.\n\n\nUsers would have to either have to a) download the binary release and manually install the non-Maven artifacts one-by-one in their local or internal repository (after consulting both the top-level Maven POM and a list of per-module dependencies that currently only exists in a lib/ directory listing); or b) download the source release, run ant get-maven-poms, then run mvn -N -Pbootstrap install. Neither of these fall within the expected level of effort for Maven users.\n\nor C)\nyou can publish the artifacts, link to them as optional, and users can specify in their pom's which jar to bring in.  This is not that uncommon – it is the expected way to deal with slf4j for example, where one and only one of several options must be chosen at runtime.  Same thing with the bytecode re-writing dependency in Hibernate.\n\n\n-1 from me for using optional dependencies to counter Maven's virality.\n\nPlease consider this further with option C) above for artifacts that live in a custom groupId:artifactId namespace but not a custom package.\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13224906",
            "date": "2012-03-08T01:14:12+0000",
            "content": "\nor C)\nyou can publish the artifacts, link to them as optional, and users can specify in their pom's which jar to bring in. This is not that uncommon – it is the expected way to deal with slf4j for example, where one and only one of several options must be chosen at runtime. Same thing with the bytecode re-writing dependency in Hibernate.\n\n-1 from me for using optional dependencies to counter Maven's virality.\n\nPlease consider this further with option C) above for artifacts that live in a custom groupId:artifactId namespace but not a custom package.\n\nMy implicit assumption was that as a result of using optional dependencies, we would cease publishing any third-party dependencies to Maven Central.  (That's part of what I was -1'ing.) "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13225150",
            "date": "2012-03-08T11:32:26+0000",
            "content": "If you don't change the packages, don't change the gav. If you do change the packages, do change the gav.\n\n+1\n\nAnd... I hate to heap even more invasiveness/virality onto Maven, but... it\nseems like if Maven also checked across artifacts\n(groupID+artifactID?) for package name conflicts... that would prevent\nfuture cases of accidentally releasing a private dependency?  (Hmmm,\nassuming commons-csv releases snapshots...). "
        },
        {
            "author": "Sami Siren",
            "id": "comment-13225951",
            "date": "2012-03-09T09:04:43+0000",
            "content": "I discovered this issue because someone who imported solr-commons-csv in its project reported an issue (SANDBOX-330), an infinite loop with trailing comments, that was already fixed on the trunk\n\nSo is the current solr version affected by this? Should it be updated? "
        },
        {
            "author": "Emmanuel Bourg",
            "id": "comment-13226046",
            "date": "2012-03-09T12:46:12+0000",
            "content": "No he used an old version of solr-commons-csv, I checked the commit log and the one used by Solr is fixed. "
        }
    ]
}