{
    "id": "SOLR-2805",
    "title": "Add a main method to ZkController so that it's easier to script config upload with SolrCloud",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "when scripting a cluster setup, it would be nice if it was easy to upload a set of configs - otherwise you have to wait to start secondary servers until the first server has uploaded the config - kind of a pain\n\nYou should be able to do something like:\njava -classpath .:* org.apache.solr.cloud.ZkController 127.0.0.1:9983 127.0.0.1 8983 solr /home/mark/workspace/SolrCloud/solr/example/solr/conf conf1",
    "attachments": {
        "jackhanna.zip": "https://issues.apache.org/jira/secure/attachment/12508931/jackhanna.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Eric Pugh",
            "id": "comment-13160083",
            "date": "2011-11-30T15:17:59+0000",
            "content": "I started working on something like this, and noticed that ZkController is marked \"final\", why is that?   I ended up cut'n'paste into my own class. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13160433",
            "date": "2011-11-30T23:04:35+0000",
            "content": "I tend to limit by default and open when needed I guess.\n\nFWIW, I've got code for this in the solrcloud branch now.\n\nIt lets you temporily launch a zk server, connects to it, and uploads a set of conf files by calling (from the /solr folder in a checkout):\n\n\njava -classpath lib/*:dist/* org.apache.solr.cloud.ZkController 127.0.0.1:9983 127.0.0.1 8983 solr ../example/solr/conf conf1 example/solr/zoo_data\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13171674",
            "date": "2011-12-17T20:57:16+0000",
            "content": "On the solrcloud branch you can see this used in solrcloud.sh - this script starts up a small cluster for testing during development. One of the first things it does is use this to upload the example config files. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13177257",
            "date": "2011-12-29T16:40:32+0000",
            "content": "Here is an up to date example of using the tool (run from the solr directory of a lucene/solr checkout):\n\n\njava -classpath lib/*:dist/*:build/lucene-libs/* org.apache.solr.cloud.ZkController 127.0.0.1:9983 example/solr 8983 example/solr/conf conf1\n\n\n\nIt takes the zookeeper address, solrhome, solr port, conf file dir to upload and the name of the conf set.\n\nYou have to run the dist ant target first with the above example. "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-13177651",
            "date": "2011-12-30T13:40:51+0000",
            "content": "I have ported a CLI for ZK, inspired heavily by https://github.com/linkedin/linkedin-zookeeper, but using all Java and some solr stuff, that came out of the ZkController main method.   I'd love thoughts on this library.  Not sure that it's a Solr thing at all, though that was where I started.   I marked as \"not intended for inclusion\", as I think it's orthogonal to solr, but if you saw value, I'd change that.   I may put it up on github.. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13197919",
            "date": "2012-02-01T15:56:22+0000",
            "content": "Hey Eric - would love to take a look - did you put this on GitHub? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13197920",
            "date": "2012-02-01T15:56:49+0000",
            "content": "This is essentially done and in trunk - further improvements can get new issues. "
        }
    ]
}