{
    "id": "SOLR-6114",
    "title": "cron for elgg_solr reindex",
    "details": {
        "affect_versions": "4.8.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "clients - php"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Hi,\n\nwe have setup solr on our server and added a elgg_solr plugin to our elgg site...and plugin is working fine with locally installed solr..and indexing manually....\n\nbut i need a cron for indexing using elgg_solr plugin...\n\nas i followed the doc.:- but can't see which cron need to be run..where is the cron. \nhttps://github.com/arckinteractive/elgg_solr\n\n Installation\n\nInstall to elgg mod directory as 'elgg_solr'.\n\nEnable the plugin in the Admin page, move to position below the search plugin.\n\nConfigure Solr with the schema.xml included in the root directory of this plugin.\n\nEnter and save the connection information on the plugin settings page.\n\nTrigger a reindex from the plugin setting page.\n\n\"Ensure hourly cron is configured and active\"\n\n\nSo please help me..i am looking for cron to setup..for autoreindex. what should be the cron...\n\nThank,\nJagdish",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-14010163",
            "date": "2014-05-27T19:22:58+0000",
            "content": "The elgg software package is not part of Solr.  This is a bug/feature tracker for Solr and other Apache projects.\n\nNobody here will have the required knowledge to help you.  You'll need to send a request to a support resource for elgg or their solr plugin.  It looks like you might be able to do this at the following location, after creating an account for their website:\n\nhttp://community.elgg.org/groups/all?filter=support\n\nAnother possibility would be to open an issue against the solr plugin project asking them to include the required crontab entry in their README, which you could do at the following URL.  You probably need a github account to do this:\n\nhttps://github.com/arckinteractive/elgg_solr/issues "
        }
    ]
}