{
    "id": "SOLR-7942",
    "title": "fix error logging when index is locked on startup, add deprecation warning if unlockOnStartup is configured",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.4",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "LUCENE-6508 removed support for unlockOnStartup, but the way the changes are made are inconsistent with how other config options have been deprecated in the past, and cause a confusing error message if an index is locked on startup...\n\n\n\tin 5x, the SolrConfig constructor should log a warning if the unlockOnStartup option is specified (regardless of whether it's true or false) so users know they need to cleanup their configs and change their expectations (even if they never get - or have not yet gotten - a lock problem)\n\n\n\n\n\tin SolrCore, the LockObtainFailedException that is thrown if the index is locked should not say \"Solr now longer supports forceful unlocking via 'unlockOnStartup'\"\n\t\n\t\tbesides the no/now typo, this wording missleads users into thinking that the LockObtainFailedException error is in some way related to that config option – creating an implication that using that option lead them to this error.  we shouldn't mention that here.",
    "attachments": {
        "SOLR-7942.patch": "https://issues.apache.org/jira/secure/attachment/12752588/SOLR-7942.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-18T22:03:37+0000",
            "author": "Uwe Schindler",
            "content": "Sorry the typo was caused by me!  ",
            "id": "comment-14702061"
        },
        {
            "date": "2015-08-18T22:07:55+0000",
            "author": "Uwe Schindler",
            "content": "In any case, the error message should be very rare.\n\nBTW, It's impossible to ever need to unlock the directory in the default config (NIOFSLockFactory), because the JVM / OS kernel cleans up the lock on JVM exit. SO the message does not need to be so prominent. In the default config, if directory is locked you have a second Solr instance somewhere running. Poeple using HDFS may need more instructions how to remove the lock! SimpleFSLockFactory is something nobody should use at all (maybe only with NFS), so this is also not a problematic thing. ",
            "id": "comment-14702066"
        },
        {
            "date": "2015-08-18T22:14:18+0000",
            "author": "Hoss Man",
            "content": "...In the default config, if directory is locked you have a second Solr instance somewhere running....\n\nright: i'd like to improve that errmsg to make the most common situation (multiple instances) more obvious, but also point out it depends on your config.  the main thing though is to stop mentioning unlockOnStartup completley – because right now even if you aren't using it, you'll get an error mentioning it, and if you go searching for it it'll be hard to find because we're removing it from the ref guide.\n\nthe only time you should ever get a log msg mentioning unlockOnStartup is_if_ you already have it configured – then we should tell you to stop (the first point)\n\n\n\nIn any case, this isn't a major issue, i just wanted to file it as a reminder to clean it up as soon as i have some time. ",
            "id": "comment-14702080"
        },
        {
            "date": "2015-08-26T22:11:04+0000",
            "author": "Hoss Man",
            "content": "Here's what i had in mind, with the true // 'fail' in trunk changed to false // warn in 5x when backporting.\n\nAnyone have concerns/feedack about the various warning/err msgs? ",
            "id": "comment-14715618"
        },
        {
            "date": "2015-08-27T17:35:41+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1698200 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1698200 ]\n\nSOLR-7942: Previously removed unlockOnStartup option (LUCENE-6508) now logs warning if configured, will be an error in 6.0.  Also improved error msg if an index is locked on startup ",
            "id": "comment-14717129"
        },
        {
            "date": "2015-08-27T18:12:12+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1698203 from hossman@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1698203 ]\n\nSOLR-7942: Previously removed unlockOnStartup option (LUCENE-6508) now logs warning if configured, will be an error in 6.0.  Also improved error msg if an index is locked on startup (merge r1698200) ",
            "id": "comment-14717202"
        }
    ]
}