{
    "id": "SOLR-5029",
    "title": "shardHandlerFactory is not properly persisted",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In SOLR-5028 I discovered persistence for shardHandlerFactory is only looking for connTimeout and socketTimeout children.  Persistence should work for any SHF impl, not just HttpShardHandlerFactory.  I think the thing to do here is just copying the underlying Node to the new file, but the current persistence code assumes a flat (String->String) hierarchy (which seems wrong, flat hierarchy was one of the reasons myself and others were against solr.properties).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Alan Woodward",
            "id": "comment-13704911",
            "date": "2013-07-10T18:52:46+0000",
            "content": "Hi Ryan, SOLR-4914 should fix this.  The only thing that actually changes in solr.xml is the cores list, so I've got round all the horribly complicated persistence rules by just storing most of the XML as a plain string, and interpolating the core information back in at persistence time. "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13705050",
            "date": "2013-07-10T20:52:39+0000",
            "content": "I think this isn't being caught because the example config in TestSolrXmlPersistence has shardHandlerFactory defined in the wrong place (directly below solr/, rather than below solr/cores).  And SOLR-4914 will also break this, because I was assuming that only <core> tags appeared below <cores>, and none of the tests picked up on it. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13705184",
            "date": "2013-07-10T22:44:01+0000",
            "content": "Oh dear. It's worse than that. Both ConfigSolr.xml and ConfigSolrOld.xml look for the shard definition directly under solr. CoreContainer.initShardHandler looks under solr/cores.\n\nUgly as the idea is, how about this? Support both positions (which will require initShardHandler looking in both places?) for 4.x. Only support the <shardHandlerFactory> as an immediate child node to <solr> in 5.0. And persist it to an immediate child of <solr> for 4.x which would, indeed, move it. "
        },
        {
            "author": "Ryan Ernst",
            "id": "comment-13705228",
            "date": "2013-07-10T23:33:36+0000",
            "content": "Erick, did you look at the related SOLR-5028?  I already have a patch fixing the issue of SHF construction for the \"new xml\" style there. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13705250",
            "date": "2013-07-10T23:57:45+0000",
            "content": "Ryan:\n\nNope, didn't see that. I think the fixes aren't all that hard if we can agree on what they should be.\n\nI see what you're trying to do in SOLR-5028, but I don't think that handles Alan's persistence simplification. Of course that wasn't there until recently. Which is pretty much what was behind the proposal to move it automagically for 4.x to a child of <solr>. But I'd like Alan to weigh in on it....\n\nFor that matter, I don't think the current checked-in code for persistence does the right thing in both cases either.\n\nAlan, how do you think we should reconcile all this? "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13705607",
            "date": "2013-07-11T08:38:38+0000",
            "content": "I think we need to get this fixed for 4.4, and worry about how we reconcile it with SOLR-4914 later...\n\nMy suggestion:\n\n\tadd an abstract getShardHandlerFactoryPluginInfo() to ConfigSolr which returns the relevant PluginInfo, moving all the 'where do we get it' logic into the two different ConfigSolrXXXX implementations.  Use this in initShardHandler().\n\tpass this PluginInfo to SolrCores.persistCores() instead of the shardHandlerAttrib map.\n\n\n\nI'll put together a patch. "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13705673",
            "date": "2013-07-11T10:39:22+0000",
            "content": "Patch put up on SOLR-5028, which I think should fix this for 4.4.  If we're happy with that, then I can start on updating SOLR-4914 to deal with all of this stuff. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13705868",
            "date": "2013-07-11T14:15:37+0000",
            "content": "Commit 1502231 from Alan Woodward\n[ https://svn.apache.org/r1502231 ]\n\nSOLR-5028,SOLR-5029: Fix ShardHandlerFactory creation and persistence "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13705871",
            "date": "2013-07-11T14:21:34+0000",
            "content": "Commit 1502233 from Alan Woodward\n[ https://svn.apache.org/r1502233 ]\n\nSOLR-5028,SOLR-5029: Fix ShardHandlerFactory creation and persistence "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13705878",
            "date": "2013-07-11T14:35:13+0000",
            "content": "Commit 1502235 from Alan Woodward\n[ https://svn.apache.org/r1502235 ]\n\nSOLR-5028,SOLR-5029: Fix ShardHandlerFactory creation and persistence "
        }
    ]
}