{
    "id": "SOLR-3324",
    "title": "Put field name/type in the analysis URL",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It would be nice to be able to link directly to a page that loads the right field in the analysis UI.\n\nThis will also let us link the query-browser page to the analysis page",
    "attachments": {
        "SOLR-3324.patch": "https://issues.apache.org/jira/secure/attachment/12522384/SOLR-3324.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13247577",
            "date": "2012-04-05T19:50:08+0000",
            "content": "this isn't just a nice to have – it's necessary for the tutorial "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13247595",
            "date": "2012-04-05T20:04:50+0000",
            "content": "We may also consider some way to post a document to the analysis request handler.\n\nEven linking directly to the response would be helpful "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13252261",
            "date": "2012-04-12T07:23:11+0000",
            "content": "This patch allows: /analysis?analysis.fieldvalue=index&analysis.query=query&type_or_name=text_rev - will set the form-fields to the given values and execute the Analysis "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13252635",
            "date": "2012-04-12T17:35:22+0000",
            "content": "This looks good – can the URL update when you click \"Analyse Values\" so that it is easy to know the bookmarkable URL?  \n\nCan verbose also be in the URL?\n\nLooking at this a bit more, how does 'type_or_name' work?  I have field names that are the same as the type name – typically they use the same type, so it does not really matter... but it seems better to avoid that assumption.\n\nPerhaps the param could look like:\n f=type.pint\nor\n f=name.id\n\n\n\n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13254345",
            "date": "2012-04-15T15:10:49+0000",
            "content": "Yep, will work on this .. have to changed to logic how the form is currently handeld a bit, but show be not that complicated to integrate that - also your other suggestions, ryan "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13254557",
            "date": "2012-04-16T07:38:47+0000",
            "content": "Next try :> Submitting the Form will change the URL, afterwards the Analysis-Process is executed.\n\nCan verbose also be in the URL?\nIn Theory, yes .. right know, changing the state of verbose doesn't need to trigger a reload, it will only show additional informations in the results - they will be requested in every case, we just show them, if the box is checked. Will see how we can handle this "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13254825",
            "date": "2012-04-16T17:31:38+0000",
            "content": "Stefan – looks great.  added in r1326690\n\nFor the verbose field – i don't think it needs to trigger a reload when you click it.  But it would be nice to have it in the URL after you click the button. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13255390",
            "date": "2012-04-17T07:25:52+0000",
            "content": "But it would be nice to have it in the URL after you click the button\n\nRight, but this is how the sammy.js library works .. changing the URL will automatically trigger a reload. perhaps we can avoid this. work around, somehow ;> "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13256687",
            "date": "2012-04-18T16:39:35+0000",
            "content": "perhaps we can avoid this\nI checked this yesterday .. right now, the answer is simple: we can't. the browser is listening on the 'hashchange' event, which is triggered if we change the url (especially the hash, everything after the hash)\n\nSo, we can change it .. then it will reload the page every time you toggle the verbose-option, but we have the setting in the url. don't know what is more important? a responsive UI or the possibility to bookmark the complete option-set? "
        }
    ]
}