{
    "id": "SOLR-3438",
    "title": "Document SolrCell's use of the meta field",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "SolrCell will add document metadata to the field named \"meta\" if it is present in the schema. This is undocumented behavior and can be surprising and confusing to users who explicitly added a field named \"meta\" to their schema for their own purpose without any awareness that SolrCell would be populating it with document metadata.\n\nThis issue merely proposes to clearly document the use of the \"meta\" field, but several questions do arise:\n\n1) Is this behavior actually intended as a released future? As opposed to some experimental work that wasn't intended for release just yet.\n\n2) Should there be a request parameter to be able to disable this feature?\n2a) Should the default be that this feature is enabled or disabled?\n\n3) Should the \"meta\" field be added to the example schema (the section for SolrCell metadata fields) to reinforce the fact that a user should not blindly add their own \"meta\" field for some other purpose?\n\n4) Should there be a request parameter to redirect this behavior to a named field?\n4a) Should the default name be more explicit (e.g., solrcell_metadata)?\n\nThis issue is only intended to address documentation related to question #1. If the answers to any of the other questions are \"yes\", a separate issue can be opened. That said, I do lean towards adding the \"meta\" field to the example schema as part of the \"documentation.\"\n\nFor reference I'll attach a snippet from a query result that has the \"meta\" field populated by an extracted Word document.",
    "attachments": {
        "SolrCell meta field.xml": "https://issues.apache.org/jira/secure/attachment/12525747/SolrCell%20meta%20field.xml"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13269046",
            "date": "2012-05-05T20:02:58+0000",
            "content": "I added two files via SolrCell, a Word doc (.docx) and a PDF file which is the same document but saved in PDF format. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13269050",
            "date": "2012-05-05T20:14:42+0000",
            "content": "Forgot to format with indent. "
        }
    ]
}