{
    "id": "SOLR-11663",
    "title": "CLONE - API to create a core is broken",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Server"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.6",
        "resolution": "Duplicate",
        "status": "Closed"
    },
    "description": "Steps To Reproduce\n\n\ncurl 'http://localhost:8983/solr/admin/cores?action=CREATE&name=new_core&instanceDir=new_core'\n\n\n\nExpected Result\n\nCreate a core called \"new_core\".\n\nActual Result\n\n\nError CREATEing SolrCore 'new_core': Unable to create core [new_core] Caused by: Can't find resource 'solrconfig.xml' in classpath or '/var/solr/data/new_core/conf'\n\nSomebody on solr-users tells me:\n\n\nThe CoreAdmin API requires that the instanceDir already exist, with a\nconf directory inside it that contains solrconfig.xml, schema.xml, and\nany other necessary config files.\n\nHuh? Where is this magical knowledge mentioned in the API documentation?\n\nAnother user on the list serve says:\n\n\nIn fact, yes. The thing to remember here is that you're using a much\nolder approach that had its roots in the pre-cloud days.\n\nThe whole point of creating APIs is to abstract out details that the caller doesn't need to know, and yet this API requires an understanding of Solr's internal file structure and history of the project? I'm speechless.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-11-21T22:42:14+0000",
            "content": "The CREATE action on the CoreAdmin API has never been able to work when it can't find a configuration.  CoreAdmin is OLD, and predates all of the slick functionality of the recent admin interfaces.  Access to it has been added to the UI, but the underlying functionality is still the same as it always was.\n\nThis requirement is in the documentation and has been for a while.  I'm the one who put it there.  Here's the exact text:\n\n\nCREATE must be able to find a configuration!\n\nYour CREATE call must be able to find a configuration, or it will not succeed.\n\nWhen you are running SolrCloud and create a new core for a collection, the configuration will be inherited from the collection. Each collection is linked to a configName, which is stored in the ZooKeeper database. This satisfies the config requirement. There is something to note, though – if you’re running SolrCloud, you should NOT be using the CoreAdmin API at all. Use the Collections API.\n\nWhen you are not running SolrCloud, if you have Config Sets defined, you can use the configSet parameter as documented below. If there are no config sets, then the instanceDir specified in the CREATE call must already exist, and it must contain a conf directory which in turn must contain solrconfig.xml, your schema, which is usually named either managed-schema or schema.xml, and any files referenced by those configs.\n\nThe config and schema filenames can be specified with the config and schema parameters, but these are expert options. One thing you could do to avoid creating the conf directory is use config and schema parameters that point at absolute paths, but this can lead to confusing configurations unless you fully understand what you are doing.\n\n ",
            "author": "Shawn Heisey",
            "id": "comment-16261614"
        },
        {
            "date": "2017-11-21T22:59:50+0000",
            "content": "Ok.\nAccording to the project which I am working on, It requires the user to create a core from the UI of the project.\nIn this case how can I solve this problem? ",
            "author": "Jaya Naga Bhavana",
            "id": "comment-16261642"
        },
        {
            "date": "2017-11-22T14:13:47+0000",
            "content": "If you want to create indexes without any access to the filesystem where Solr is running, then you should run SolrCloud, which requires that you set up zookeeper.  If you run SolrCloud, then you won't be using the CoreAdmin API, you'll be using the Collections API.\n\nhttps://lucene.apache.org/solr/guide/6_6/collections-api.html\n\nFor standalone mode there is the configset feature, which allows configurations to work in a manner very close to how SolrCloud works, except that it is confined to one server, whereas SolrCloud can share configurations across many servers.\n\nThe \"standard\" setup with standalone Solr requires that you create the instanceDir and the configuration before you add a core with the CoreAdmin API. ",
            "author": "Shawn Heisey",
            "id": "comment-16262576"
        },
        {
            "date": "2018-02-01T16:50:06+0000",
            "content": "I'm closing this as a duplicate of SOLR-7316, which was the issue this was cloned from. Since the original is not closed, only stalled, creating a new issue doesn't do anything to push the original issue forward. ",
            "author": "Cassandra Targett",
            "id": "comment-16348884"
        }
    ]
}