{
    "id": "SOLR-4742",
    "title": "Autocommit configuration is not working",
    "details": {
        "affect_versions": "3.6.1",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "replication (scripts)",
            "update"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "We've configured solrconfig.xml to autocommit after 500 docs added or 30 seconds as following the configuration bellow:\n\n<autoCommit>\n  <maxDocs>500</maxDocs>\n  <maxTime>30000</maxTime>\n</autoCommit>\n\nThe problem that has been occured is after some time the commit is executed after a long time reaching 40 minutes.\n\nThat same problem has been happened with the slaves. The new documents appears after a long time on the slaves.\n\n\nWe executed the optimize but the problem happened again.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13636792",
            "date": "2013-04-19T19:47:51+0000",
            "content": "I would be very surprised if this were a problem and you're the only one who has run into it, so I'm guessing it's probably something you're doing.\n\nFirst, what's your evidence? You have to give a lot more details before anyone can help you.\n\nThe maxTime and maxDocs parameters don't start counting until a doc has been indexed, so that's the first thing I'd look at.\n\nOptimize should be pretty irrelevant except that it will force a commit.\n\nAs for your slaves, these parameters are completely irrelevant for your slaves. The slaves replicate from the master, so any delay here is \n1> the delay before committing on the master \nplus\n2> the polling interval you have configured on your slave.\n\nIn future, please raise this kind of issue on the user's list before making a JIRA to be sure you're actually seeing a problem and not mis-interpreting expected behavior. You'll get lots faster responses there too. "
        },
        {
            "author": "Gustavo Zopelari Nasu",
            "id": "comment-13636837",
            "date": "2013-04-19T20:22:54+0000",
            "content": "Hi Erick. Thank's for the answer and hints.\n\nI saw the docsPending increasing on the Solr Admin (Solr Statistics > UPDATE HANDLERS).\n\nAnyway I'm going to post this issue on the user's list. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15046124",
            "date": "2015-12-08T01:26:12+0000",
            "content": "I ran across this recently, I can't imagine anyone's going to pursue it so I'm closing. "
        }
    ]
}