{
    "id": "SOLR-2299",
    "title": "improve test-running from eclipse",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "Build"
        ],
        "type": "Test",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In eclipse, its currently difficult to get a solr development environment working.\n\nOne big thing that would help would be to make it easier to run the tests.\nWhen loading resources, if we checked the config dir + file directory from the resource path,\nthen users could simply add src/test/test-files to their eclipse build classpath, and tests would just work from the IDE.\n\nI gather that this might make things easier for other IDEs too, though I'm aware that ones like Intellij\nlet you configure the test 'working directory' on a project basis, but eclipse doesn't \n(you have to make a custom run configuration every time you run the tests)",
    "attachments": {
        "SOLR-2299_part2.patch": "https://issues.apache.org/jira/secure/attachment/12467084/SOLR-2299_part2.patch",
        "SOLR-2299.patch": "https://issues.apache.org/jira/secure/attachment/12467005/SOLR-2299.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-12975295",
            "date": "2010-12-27T17:37:52+0000",
            "content": "I'm sure this isn't perfect, for example contrib tests and tests that use the example configuration likely won't work.\n\nBut I think the majority of tests seem to work this way out of box if you add src/test/test-files to your classpath (right click src/test/test-files, Build->Add to Build Path) "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12975298",
            "date": "2010-12-27T17:46:24+0000",
            "content": "I ran all the core tests this way, most passed.\n\nThe only problems were example tests (perhaps i can figure out a way to make these work too, by adding something to the classpath or something like that), and a couple tests that explicitly use File et al versus general resources. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12975579",
            "date": "2010-12-28T18:42:48+0000",
            "content": "Same patch, i only fixed a couple tests that explicitly used File to use resources instead.\n\nI looked at all the failing ones, its a little bit of work but I think its definitely feasible that\nwe get the solr tests working so that:\n\n\tyou put test resources in classpath\n\ttests are independent of current working directory.\n\n\n\nI think this is just a good general simplification (nothing to do with eclipse) and is good\nfor the ant build too, so that tests dont have to run with a CWD of src/test/test-files in ant.\n\nThe problem with the way we do this now (even in ant) is that i've sporatically seen tests actually create files in this CWD, which means we are creating leftovers in a src directory that could accidentally be committed, among other problems.\n\nI'd like to commit this now and iterate on the remaining individual tests so that they open their test resources all as resources... its not that many left but some are tricky. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12975674",
            "date": "2010-12-28T23:12:59+0000",
            "content": "here's a patch fixing a lot of tests, only a few core tests left. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12976357",
            "date": "2010-12-31T21:46:44+0000",
            "content": "I think I'm seeing more exceptions come out of the DIH tests (and the complete solr  test suite suddenly takes longer to run too... from ~5 to ~8 min).  Looks like it may be related to this issue/changes?\n\n\n    [junit] SEVERE: Could not write property file\n    [junit] org.apache.solr.handler.dataimport.DataImportHandlerException: Unable to persist Index Start Time Processing Document # 2\n    [junit]     at org.apache.solr.handler.dataimport.SolrWriter.persist(SolrWriter.java:111)\n[...]\n    [junit] Caused by: java.io.FileNotFoundException: solr-dih\\conf\\dataimport.properties (The system cannot find the path specified)\n    [junit]     at java.io.FileOutputStream.open(Native Method)\n    [junit]     at java.io.FileOutputStream.<init>(FileOutputStream.java:179)\n    [junit]     at java.io.FileOutputStream.<init>(FileOutputStream.java:70)\n    [junit]     at org.apache.solr.handler.dataimport.SolrWriter.persist(SolrWriter.java:107)\n\n\n\nThis doesn't cause the test to fail for some reason...\nSome of the methods are ignored because of TZ issues... but not all seem to fall into that category. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12976358",
            "date": "2010-12-31T21:57:37+0000",
            "content": "looks like a bug in dih, masked all along because we set the CWD before.\n\nI think it is not properly respecting solr home? but trying to write to solr/...\n\nas for speed the tests are the same here, like 2 minutes. but, if dih is spewing exceptions,\nthe test runner buffering could be slowing you down,\n\nI think we should open an issue to fix this bug in dih... this issue merely unmasked it "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12976359",
            "date": "2010-12-31T22:02:44+0000",
            "content": "as for speed the tests are the same here, like 2 minutes. but, if dih is spewing exceptions, the test runner buffering could be slowing you down\n\nHmmm, I was unable to reproduce the slowdown - false alarm! "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12976562",
            "date": "2011-01-02T21:28:43+0000",
            "content": "Nice Robert, thank you. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013059",
            "date": "2011-03-30T15:45:26+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}