{
    "id": "SOLR-8183",
    "title": "Add Learning to Rank framework to Solr",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Add a Learning to Rank or Machine Learned Ranking framework to Solr. The framework should be able to\n1. Generate  user-result-click tracking logs \n2. Learning/Training component which is based on something like Ranklib (http://sourceforge.net/p/lemur/wiki/RankLib/)\n3. Push the model learnt in step 2 to Solr through the existing rerank framework\n\nI have a very crude experimental code for step 2 and 3 working (thanks to the help from Joel Bernstein). \nFor step 1 I was wondering if Solr has an open source version of https://docs.lucidworks.com/display/lweug/Click+Scoring+Relevance+Framework\nIf there existing something like this then it wont be hard to close the loop and have an nice feedback loop implementation on LTR framework.\n\nI feel there should be a big push on the overall algorithmic front which will help LTR framework.\nSomething like the Fair Pairs algorithm switch in Solr to turn on/off to generate unbiased clicked data will be pretty hand for optimizing the ranking through LTR.\nhttp://static.googleusercontent.com/media/research.google.com/en//pubs/archive/36363.pdf\nhttp://www.cs.cornell.edu/people/tj/publications/radlinski_joachims_06a.pdf\nAlso better support for experimenting with multi-arm bandits in search rankings will be pretty handy too! https://www.cs.cornell.edu/~rdk/papers/icml08.pdf\n\nThis calls for a better architecture to \n1. Collect user behavior data\n2. Learn a ML-model based on User data\n3. Experiment / collect unbiased datasets from deployed models",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-10-21T19:11:43+0000",
            "author": "Joel Bernstein",
            "content": "Hi Ajinkya Kale,\n\nCan you attach your code prototype? This will help people understand your implementation ideas.\n ",
            "id": "comment-14967691"
        },
        {
            "date": "2015-10-21T21:43:41+0000",
            "author": "Ajinkya Kale",
            "content": "Here is a hacky piece I wrote in a few hours https://github.com/ajkl/solr-ltr-plugin\nIts not polished but it works. \n\nI would also like to mention that I could write such a functionality without knowing Solr internals and codebase is a big win for Solr and its plugin architecture! Thank you all who made it possible. ",
            "id": "comment-14968016"
        }
    ]
}