{
    "id": "SOLR-6321",
    "title": "org.apache.solr.common.SolrException: Premature EOF",
    "details": {
        "affect_versions": "3.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "clients - php"
        ],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Hello,\nWhen I try indexing some content, some times I receive the next error: org.apache.solr.common.SolrException: Premature EOF\n\nI tried to increase the timeout connection, but the problem persist. I observed that I received the error a few seconds after begin indexing.\n\nPlease, I don't know how I can do to solve the problem.\n\nThank's for your help.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-14086429",
            "date": "2014-08-05T16:02:25+0000",
            "content": "Please raise this kind of issue on the user's list before raising a JIRA. First, it'll get more attention  (more people monitor the user's list) and second we try to keep the JIRAs for known problems.\n\nIf this turns out to be something we need to fix in code, we can always re-open this JIRA.\n\nThis error often means that the packet size is too big and the servlet container is chopping off the packet, but that's just a guess. "
        },
        {
            "author": "Constancio Nuñez Cisneros",
            "id": "comment-14086644",
            "date": "2014-08-05T19:38:59+0000",
            "content": "Ok, sorry and thanks for your help.\n\nDo you know some solution for that error?, or another issue that talks about the same problem? "
        },
        {
            "author": "Constancio Nuñez Cisneros",
            "id": "comment-14087389",
            "date": "2014-08-06T08:00:31+0000",
            "content": "Please, can you help me? "
        },
        {
            "author": "Ema Panz",
            "id": "comment-14232878",
            "date": "2014-12-03T11:00:14+0000",
            "content": "You should check this issue from both sides of your communication: timeout from SOLR (in receiving) and from the sender (your app) when waiting for a response. I had the same issue with SOLR and PHP-Solarium communication: I solved by increasing the timeouts for SOLR and Solarium. "
        }
    ]
}