{
    "id": "SOLR-6990",
    "title": "Apache Solr quickstart tutorial - error while loading main class SimplePostTool",
    "details": {
        "components": [
            "clients - java",
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "4.10.3"
        ],
        "affect_versions": "4.10.3",
        "status": "Resolved",
        "resolution": "Cannot Reproduce",
        "priority": "Blocker"
    },
    "description": "I am following Apache Solr quickstart tutorial. The tutorial comes across indexing a directory of rich files which requires implementing  java -Dauto -Drecursive org.apache.solr.util.SimplePostTool docs/ .\n\nI am getting an error which says: Could not find or load main class org.apache.solr.util.SimplePostTool inspite of following the quickstart tutorial closely. I am not getting how to resolve the error and proceed ahead with the tutorial. I am not able to index XML, nor JSON, nor CSV because of the same error.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-01-16T14:55:42+0000",
            "author": "Ahmet Arslan",
            "content": "Did you try? \n\n java -classpath dist/solr-core-*jar -Dauto -Drecursive org.apache.solr.util.SimplePostTool docs/ \n ",
            "id": "comment-14280330"
        },
        {
            "date": "2015-01-16T16:56:39+0000",
            "author": "Shubhanshu Gupta",
            "content": "Yes, it worked. Can you also please explain me, why did the old command didn't work and why this one worked? Although, I do know that the command you have given assumes that I did not set the environment through: \"export CLASSPATH\n=dist/solr-core-4.10.2.jar\" .  But I already set the environment, still there was no effect. Please correct me if I am wrong anywhere.\n\nThanks. ",
            "id": "comment-14280492"
        },
        {
            "date": "2015-02-28T16:43:14+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Can this issue be closed? \n\nThe CLASSPATH example given above uses solr 4.10.2 jars but the issue was against 4.10.3, so perhaps just a wrong jar.\n\nEither way, the issue is a classpath misconfiguration on the client system. Not a blocker. ",
            "id": "comment-14341638"
        }
    ]
}