{
    "id": "SOLR-975",
    "title": "admin-extra.html not currectly display when using multicore configuration",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I'm having \"cross-talk\" issues with using the Solr nightlies (and probably w/ 1.3.0 release but have not tested as I needed newer features of the DataImportHandler in the nightlies) \n\nBasic scenario for this bug is as follows\n\nI have two cores configured and BOTH have a customized \"admin-extra.html\", however going to the admin pages uses the SAME admin-extra.html for all cores.   the one used is whichever core is browsed first..    This looks like a caching bug where the cache is not taking into account the Core.\n\nBasically my admin-extra.html has a link to the data importer script and a link to reload the core (which has to have the core name explicitly in the per-core admin-extra.html).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12859553",
            "date": "2010-04-21T22:18:25+0000",
            "content": "support for admin-extras.html has always been a hack ... the implementation only ever worked for single core setups because it depended on functionality that took advantage of the singleton.\n\na fix should be possible, but it might make more sense to just scrap the idea of a magicly named HTML snippet file that is included verbatim (in the middle of an open table tag no less) and come up with a more intuitive and robust way to let people configure what should appear on the admin screen "
        },
        {
            "author": "Edward Rudd",
            "id": "comment-12859584",
            "date": "2010-04-21T23:37:42+0000",
            "content": "I agree that a real more robust system should be built..  Abusing the tables with badly formatted HTML to do what is currently being done is HORRID.\n\nAny suggestions on a \"cleaner\" way of doing this? and which source files do I need to tear apart? (I'll work on a patch) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12976145",
            "date": "2010-12-30T23:36:46+0000",
            "content": "FYI: i'm pretty sure yonik fixed this as part of SOLR-1930, but i haven't tested...\n\nhttp://svn.apache.org/viewvc?view=revision&revision=1054008 "
        },
        {
            "author": "Edward Rudd",
            "id": "comment-12976154",
            "date": "2010-12-31T00:10:40+0000",
            "content": "From looking at the diff it looks like it could fix it.. But it needs to be verified that it is indeed fixed.  I'll at to my TODO list to pull down a nightly build next week and test. "
        },
        {
            "author": "Edward Rudd",
            "id": "comment-12979730",
            "date": "2011-01-10T20:12:47+0000",
            "content": "I have confirmed this issue is fixed in the 4.0 nightly build from today. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12982017",
            "date": "2011-01-15T03:27:41+0000",
            "content": "Thanks for verifying Edward "
        }
    ]
}