{
    "id": "SOLR-5160",
    "title": "MoreLikeThis (MLT) - New Optional Params -  mlt.operator & mlt.sort",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "MoreLikeThis"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It seems that when we pass multiple field names with mlt.fl parameter, it is ORing them to find the MLT documents.\n\nIs there a way to specify AND operator? Means if mlt.fl=language,year, then we should return back the MLT documents which has language AND year field values as same as the main query result document.\n\nhttp://localhost:8180/solr/mltCore/mlt?q=id:111111111&wt=json&mlt=true&mlt.fl=language,year&fl=*,score&mlt.mindf=0&mlt.mintf=0&mlt.match.include=false\n\nThe above query should return those documents whose field values (language, year) are exactly matching with the document id:111111111.\n\nIs this possible thru any config or param? If not, I think it's worth having as a feature because we don't know the values of those fields to apply as FQ. \n\n\n was looking at the code and found that it is hard coded to Occur.SHOULD in MoreLikeThisQuery.\n\nI customized the code to pass a new parameter mlt.operator=AND/OR  based on that it computes the MLT documents. Default operator is set to OR.\nAnd I also want to have mlt.sort option, So I will be trying for that as well.\n\nDo you guys think, we should make this part of the MLT feature? \nPlease share your ideas. I can submit this change.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13741172",
            "date": "2013-08-15T16:51:34+0000",
            "content": "In truth, a more-like-this feature should have two modes: 1) Discovery mode, to broaden the search or increase recall (OR), and 2) Refinement mode, to narrow the search or increase precision (AND). "
        },
        {
            "author": "Kranti Parisa",
            "id": "comment-13741184",
            "date": "2013-08-15T17:03:10+0000",
            "content": "Yes, AND will help to get MLT documents based on the criteria. the criteria could be I want to get similar documents whose values are same as the original document. for example: all products manufactured in 2013 + mobiles category (these are attributes of the original document for which we are trying to find exact matches). And if the use case is to get either manufactured in 2013 OR mobiles category, then we can ask for OR.\n\nHence, I think allowing the user to specify the operator (mlt.operator or something) will help them get MLT documents based on their criteria and the results can be sorted based on mlt.sort "
        }
    ]
}