{
    "id": "SOLR-8770",
    "title": "BinaryRequestWriter interprets null object in field as literal \"NULL\" string",
    "details": {
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.5",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "From what I've been able to determine, if a null object is added with SolrInputDocument#addField, the xml writer does not include that field in the request, but the binary writer sends the literal string \"NULL\".\n\nThis became apparent when upgrading SolrJ to 5.5, which uses the binary writer by default.  Switching back to 5.4.1 fixed it, until I forced the 5.4.1 client to use the binary writer.  My source data is MySQL.  JDBC is where the null objects are coming from.\n\nAdding a null check to my doc.addField call has fixed my program with the 5.5 client, but this is likely to catch other upgrading users off guard.\n\nAt the very least, the 5.5.1 CHANGES.txt file needs a note, but I believe the behavior of the binary writer should match the behavior of the xml writer.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-03T18:51:45+0000",
            "author": "Shawn Heisey",
            "content": "Is there any acceptable reason to allow a null field value in a SolrInputDocument?  Specifically I'm wondering if we could throw IllegalArgumentException if a null object is used on methods like addField and setField.\n\nFixing what I noticed about the binary writer would still be a good idea. ",
            "id": "comment-15178363"
        },
        {
            "date": "2016-03-09T18:43:53+0000",
            "author": "Shawn Heisey",
            "content": "I've gone digging into the code a little bit.  I don't entirely understand what I'm looking at.\n\nFor the binary writer, I cannot see anything that delves into the individual fields of a document, so there's nowhere to add a null check.  The code (in JavaBinUpdateRequestCodec) appears to use an iterator to add documents to a NamedList.\n\nThe code in ClientUtils#writeVal seems to indicate that there might be legitimate uses for a null object, as there are certain situations where a null will be added to the XML.  I would need to understand other areas of the code to know what's going on there.\n\nIf there are indeed legitimate uses for a null object in SolrInputDocument field, then it will not be possible to throw IAE in SolrInputDocument. ",
            "id": "comment-15187625"
        }
    ]
}