{
    "id": "SOLR-8299",
    "title": "ConfigSet DELETE should not allow deletion of a a configset that's currently being used",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.4",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "The ConfigSet DELETE API currently doesn't check if the configuration directory being deleted is being used by an active Collection. We should add a check for the same.",
    "attachments": {
        "SOLR-8299.patch": "https://issues.apache.org/jira/secure/attachment/12772571/SOLR-8299.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-16T20:11:24+0000",
            "author": "Anshum Gupta",
            "content": "Here's a patch without the test. I've allowed deletion of configset when force=true, but I really believe we shouldn't allow that.\n\nI'll add a test and if someone has a suggestion about respecting 'force' in this case, kindly chime in. ",
            "id": "comment-15007238"
        },
        {
            "date": "2015-11-16T21:17:34+0000",
            "author": "Shai Erera",
            "content": "\"Can not delete ConfigSet as it is being used by another collection\"\n\nI would add the collection name to the message to make it more helpful?\n\nI've allowed deletion of configset when force=true, but I really believe we shouldn't allow that.\n\nI tend to agree with you on that. The problem is, from what I've seen, that the collection becomes unusable after you delete its configuration, even if it's later restored. Perhaps it was a point-in-time behavior of the code and has been fixed since then, but I prefer that we don't allow forcing the deletion of a configuration.\n\nWhy would a user want to force-delete a configuration, when there are collections that use it? What good comes out of it? Perhaps we should add this 'force' support after we see an actual use case? ",
            "id": "comment-15007340"
        },
        {
            "date": "2015-11-16T21:38:11+0000",
            "author": "Anshum Gupta",
            "content": "Thanks Shai.\n\nI would add the collection name to the message to make it more helpful?\nI thought about that too, but just wanted to be sure that I'm not overlooking any multi-tenant security requirement.\n\nWhy would a user want to force-delete a configuration, when there are collections that use it? What good comes out of it? Perhaps we should add this 'force' support after we see an actual use case?\nI completely agree with that but again, wanted to be sure that I was not missing a use-case here. Also, the collection does stay in an unusable state once you delete the config that's in-use and a ton of errors get logged too.\n\nBut I'm now more convinced to make both of those changes before I commit. ",
            "id": "comment-15007372"
        },
        {
            "date": "2015-11-17T08:58:35+0000",
            "author": "Shai Erera",
            "content": "I thought about that too, but just wanted to be sure that I'm not overlooking any multi-tenant security requirement.\n\nYes, that's a good point, but at the moment I think that whoever will hit this message, will have no idea what collection uses the config. Also, if we want to address multi-tenant and security stuff, I think that the app should be able to handle that. Maybe if we return a proper error code, or throw a specific exception. Since Solr does not support multi-tenancy natively, I don't think that we should try to protect it. ",
            "id": "comment-15008308"
        },
        {
            "date": "2015-11-24T06:37:07+0000",
            "author": "Anshum Gupta",
            "content": "Updated patch with a test.\n\nIf a collection is in use, the call would now fail, irrespective of the force param. ",
            "id": "comment-15023858"
        },
        {
            "date": "2015-11-24T13:41:14+0000",
            "author": "Jason Gerlowski",
            "content": "It's got my +1, fwiw.\n\nThough out of curiosity, are there any sort of docs that should be updated for this. (Still getting used to where Solr keeps tabs on various things.  So that's not a leading question; I actually don't know.) ",
            "id": "comment-15024531"
        },
        {
            "date": "2015-11-24T17:56:27+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1716223 from Anshum Gupta in branch 'dev/trunk'\n[ https://svn.apache.org/r1716223 ]\n\nSOLR-8299: ConfigSet DELETE operation no longer allows deletion of config sets that are currently in use by other collections ",
            "id": "comment-15024980"
        },
        {
            "date": "2015-11-24T18:43:22+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1716230 from Anshum Gupta in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1716230 ]\n\nSOLR-8299: ConfigSet DELETE operation no longer allows deletion of config sets that are currently in use by other collections (merge from trunk) ",
            "id": "comment-15025074"
        },
        {
            "date": "2015-11-24T18:44:54+0000",
            "author": "Anshum Gupta",
            "content": "Jason Gerlowski All the user-specific information should be in the reference guide. Other than that, it's just javadocs.\nIn this particular case, this should go into the ref guide. ",
            "id": "comment-15025077"
        },
        {
            "date": "2015-12-15T05:27:39+0000",
            "author": "Anshum Gupta",
            "content": "Fixing fix version and marking this as resolved. ",
            "id": "comment-15057370"
        }
    ]
}