{
    "id": "SOLR-1537",
    "title": "Dedupe Sharded Search Results by Shard Order or Score",
    "details": {
        "affect_versions": "1.4,                                            1.5",
        "status": "Closed",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Do"
    },
    "description": "Allows sharded search results to dedupe results by ID based on either the order of the shards in the shards param or by score.  Allows the result returned to be deterministic.  If by shards then shards that appear first in the shards param have a higher precedence than shards that appear later.  If by score then higher scores beat out lower scores.  This doesn't allow multiple duplicates because currently SOLR only permits a single result by ID to be returned.",
    "attachments": {
        "solr-dedupe-20091031.patch": "https://issues.apache.org/jira/secure/attachment/12423760/solr-dedupe-20091031.patch",
        "SOLR-1537-20091126-4.patch": "https://issues.apache.org/jira/secure/attachment/12426263/SOLR-1537-20091126-4.patch",
        "solr-dedupe-20091031-2.patch": "https://issues.apache.org/jira/secure/attachment/12423770/solr-dedupe-20091031-2.patch",
        "solr-dedupe-20091106-3.patch": "https://issues.apache.org/jira/secure/attachment/12424214/solr-dedupe-20091106-3.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Dennis Kubes",
            "id": "comment-12772257",
            "date": "2009-10-31T15:35:47+0000",
            "content": "Basic patch.  No unit tests.  Gives dedupe functionality for shards based on either shard order in the shard param or by score. "
        },
        {
            "author": "Dennis Kubes",
            "id": "comment-12772298",
            "date": "2009-11-01T01:35:07+0000",
            "content": "Updated patch.  Had to replace the use of the TreeSet for on the fly document queuing with a two pass HashSet and Java 5 PriorityQueue.  This was to allow comparably equal documents (i.e. documents with the same score). "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12774053",
            "date": "2009-11-05T20:01:34+0000",
            "content": "The \"ID\" here being the uniqueKey?  i.e. the use case is the removal of dupes when the same document is indexed in multiple shards and more than 1 shard return that document in the result set? "
        },
        {
            "author": "Dennis Kubes",
            "id": "comment-12774122",
            "date": "2009-11-05T23:02:59+0000",
            "content": "That is correct.  Dupes is when more than one shard returns a values for the same uniqueKey.  Removal of dupes is by uniqueKey deterministically by either order of shards or by highest score.  Before there was no way to determine which dupe would show up because it was based on whichever shard returned first from the query broadcast to multiple shards.  In other words the fastest responding shard would give the first uniqueKey value and the rest with that uniqueKey would be ignored.  Fastest though could change between query requests. "
        },
        {
            "author": "Dennis Kubes",
            "id": "comment-12774344",
            "date": "2009-11-06T18:04:40+0000",
            "content": "Fixes small issue with numFound count being double. "
        },
        {
            "author": "Dennis Kubes",
            "id": "comment-12783021",
            "date": "2009-11-27T04:32:46+0000",
            "content": "The newest patch supercedes SOLR-1143, fixing some bugs, updating unit tests, and adding the ability to return partial results even if server names are misspelled as opposed to just simple connection errors.  Also adds headers to show number of shards failed and the names of the failed shards. "
        },
        {
            "author": "Dennis Kubes",
            "id": "comment-12783022",
            "date": "2009-11-27T04:37:34+0000",
            "content": "Final patch.  This incorporates an updated version of SOLR-1143, allowing the return of partial search results.  This patch fixes bugs in the number of results returned, sorting order, errors on edge conditions, among others.  This patch also supercedes SOLR-1143 bringing all unit tests up to date and adding enhanced functionality to allow returning partial results when servers names are mispelled or there are other errors besides simple connection errors.  Headers have been added to show the number of shards failing and the names of those shards.  Unit test have been added to demonstrate dedup of search results by shard order.  This patch passes all current unit tests. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872550",
            "date": "2010-05-27T22:07:38+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043747",
            "date": "2011-06-03T16:46:52+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106337",
            "date": "2011-09-16T14:50:38+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234661",
            "date": "2012-03-21T18:08:46+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717247",
            "date": "2013-07-23T18:47:36+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971075",
            "date": "2014-04-16T12:57:05+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16067346",
            "date": "2017-06-28T22:13:50+0000",
            "content": "Closing ancient issue as won't do, since designing for dupe doc-ids is an anti pattern. At least I cannot see much use for this. Again, if you disagree and need this feature, then please re-open and start advocating for it  "
        }
    ]
}