{
    "id": "SOLR-359",
    "title": "LukeResponse.FieldInfo should expose the selected flags info and the indexInfo",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The LukeResponse has access, when reading in the NamedList to more information that is not currently being shared, like the \"flags\" for each FieldInfo and/or the indexInfo object so that more info about the fields may be used by the client.",
    "attachments": {
        "SOLR-359.patch": "https://issues.apache.org/jira/secure/attachment/12366173/SOLR-359.patch",
        "SOLR-359-v2.patch": "https://issues.apache.org/jira/secure/attachment/12366381/SOLR-359-v2.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-12528725",
            "date": "2007-09-19T10:21:43+0000",
            "content": "First draft of a patch:\n\nAdded FieldFlag.java to common package to share field flag information between the LukeReqHandler and the LukeResponse\n\nAdded to the LukeResponse to extract the flags information for each field and make it available in the Response.\n\nAlso exposed the indexInfo NamedList through a getter, since there are still other pieces of info that are not exposed, most notably the detailed information on each of the FieldTypes.   "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12528726",
            "date": "2007-09-19T10:22:22+0000",
            "content": "Not major, wish the default for JIRA was not major "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12529506",
            "date": "2007-09-21T17:11:48+0000",
            "content": "I am working on extending the LukeRequestHandler (LRH) and the LukeResponse to give more info about the FieldTypes.  Right now, the LRH returns the name of the FieldType, but does not return the class name.  Also, I would like to return back more structured access to the FieldType information by extracting it from the IndexInfo in the same way the FieldInfo does now.\n\nCurrently,  I am mirroring what is done for the FieldInfo to add FieldTypeInfo. \n\nOne question, though, LRH currently writes out the instance of the Analyzer (around line 371 of LRH), would it be better to just return the class name?  Or do people actually need the value of Analyzer.toString()\n\nAlso, do I need to worry about back-compatibility of the message?  That is, if I add in the class name of the FieldType instance (i.e. solr.IntField, etc.) does that break the compatibility of the message?\n\nI will post a new patch shortly which has more access to the FieldType info. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12529533",
            "date": "2007-09-21T19:18:38+0000",
            "content": "This patch builds on the last one to provide map backed access to FieldType metadata in a similar vein to the current FieldInfo.  It adds the className of the FieldType into the LukeRequestHandler types NamedList. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12530781",
            "date": "2007-09-27T16:47:11+0000",
            "content": "Patch applied, thanks!   \n\nLuke keeps getting handier and handier.\n\nI also agree that the analyzer output is useless, especially with the className attribute now. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12579128",
            "date": "2008-03-16T03:23:51+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked \"Resolved\" and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.3 as of today 2008-03-15\n\n\n\nThe Fix Version for all 29 issues found was set to 1.3, email notification was suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this (hopefully) unique string: batch20070315hossman1\n "
        }
    ]
}