{
    "id": "SOLR-650",
    "title": "facet.field should accept field names separated by spaces or commas",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The current version of SimpleFacets does not support specifying several fields to facet on in a single facet.field parameter; it has to be specified for each field. This behaviour is inconcistent with the other parameters which accept field names as arguments – they allow specifying multiple field names either as a comma- or space-separated list or by specifying the parameter multiple times.",
    "attachments": {
        "SOLR-650.patch": "https://issues.apache.org/jira/secure/attachment/12386780/SOLR-650.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lars Kotthoff",
            "id": "comment-12616344",
            "date": "2008-07-24T05:16:21+0000",
            "content": "Patch implementing described funtionality and adding unit tests to verify it.\n\nNote that the patch needs to be adapted if either of SOLR-247 or SOLR-645 are applied before this one. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12616349",
            "date": "2008-07-24T06:09:44+0000",
            "content": "-1\n\nthis idea has been discussed before, and i'm still opposed to it...\nhttp://www.nabble.com/new-user%3A-some-questions-about-parameters-and-query-syntax-to17514279.html#a17572002\nhttp://www.nabble.com/Re%3A--jira--Commented%3A-%28SOLR-247%29-Allow-facet.field%3D*-to-facet-on-all-fields-%28without-knowing-what-they-are%29-p10771433.html\n\n...among other things it breaks backwards compatibility for people who currently use facet.field on field names that contain whitespace.  If being consistent were worth breaking back compatibility then I would rather see us remove the \"split\" call for all params where it is currently used, then to add splitting to any existing params.\n\nThe only way i'm going to be on board with something like this is if it's a customization via some sort of general field name aliasing/globing configuration mechanism...\n\nhttp://wiki.apache.org/solr/FieldAliasesAndGlobsInParams\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12616350",
            "date": "2008-07-24T06:19:00+0000",
            "content": "I agree with Hoss. Wouldn't your approach be inconsistent with the way multi-valued parameters are handled in HTTP? I'd say put multiple parameters separated by comma only when order is important (e.g. sort). "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12616354",
            "date": "2008-07-24T06:40:41+0000",
            "content": "...among other things it breaks backwards compatibility for people who currently use facet.field on field names that contain whitespace.\n\nDo you think that this would be much of an issue? Using field names with whitespace in them breaks almost everywhere else (retrieving fields, highlighting...) – I don't think that many people are using fields with whitespace in them at all. Obviously I can only speculate about this though, so do correct me if I'm wrong.\n\nThe only way i'm going to be on board with something like this is if it's a customization via some sort of general field name aliasing/globing configuration mechanism...\n\nI think making the way parameters like this are handled consistent is a first step in that direction. It's going to be much easier to design and implement general field configuration parameters when they are handled in a uniform way.\n\nWouldn't your approach be inconsistent with the way multi-valued parameters are handled in HTTP?\n\nSort of, but so is the rest of Solr.\n\nI'd say put multiple parameters separated by comma only when order is important (e.g. sort).\n\n...which is also inconsistent with multi-valued parameter handling in HTTP \n\nI think it doesn't really matter that Solr is inconsistent with HTTP parameter handling as long as it's consistently inconsistent. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12616736",
            "date": "2008-07-25T01:55:05+0000",
            "content": "Attaching new patch which applies cleanly to current TRUNK. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12662502",
            "date": "2009-01-09T20:05:42+0000",
            "content": "Syncing patch with trunk. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13604360",
            "date": "2013-03-16T18:52:14+0000",
            "content": "This seems like it still has some validity. Terms.fl also. It'd be a great project for someone starting in to Solr. "
        },
        {
            "author": "Chris F",
            "id": "comment-14076194",
            "date": "2014-07-28T12:51:37+0000",
            "content": "We query Solr from within SAP ERP system. The available HTTP client does not accept multiple parameters with the same (key) name. We bypass this restriction by defining multiple request handlers in solrconfig.xml with different facet field combinations. This is really inflexible and messy. Would be really great if this assumedly simple feature could be added to core. "
        },
        {
            "author": "Chris F",
            "id": "comment-14121192",
            "date": "2014-09-04T10:00:31+0000",
            "content": "Added a patch that applies to current trunk. It includes a new option named facet.fieldsaslist which defaults to false. When this option is true, it allows facet fields to be specified as a comma or space separated list:\n\nhttp://127.0.0.1:8983/solr/select?facet.fieldsaslist=true&facet.field=trait_s,name,manu_id_s\nhttp://127.0.0.1:8983/solr/select?facet.fieldsaslist=true&facet.field=trait_s name manu_id_s\n\n "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-16533214",
            "date": "2018-07-05T02:52:53+0000",
            "content": "We now have JSON facets and this proposal has -1 for 10 years.\n\nIs it a \"Will-Not-Fix\"? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-16533816",
            "date": "2018-07-05T15:35:03+0000",
            "content": "+1 to close "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-16533921",
            "date": "2018-07-05T17:20:53+0000",
            "content": "JSON Facets should fulfill the original requirements. If there is any left over issue on top of the latest Solr, it is worth a separate JIRA. "
        }
    ]
}