{
    "id": "SOLR-181",
    "title": "Support for \"Required\" field Property",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.2"
        ],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In certain situations, it can be helpful to require every document in your index has a value for a given field.  While ideally the indexing client(s) should be responsible enough to add all necessary fields, this patch allows it to be enforced in the Solr schema, by adding a required property to a field entry.  For example, with this in the schema:\n\n   <field name=\"name\" type=\"nametext\" indexed=\"true\" stored=\"true\" required=\"true\"/>\n\nA request to index a document without a name field will result in this response:\n\n<result status=\"1\">org.apache.solr.core.SolrException: missing required fields: name \n(and then, of course, the stack trace)\n</result>\n\nThe meat of this patch is that DocumentBuilder.getDoc() throws a SolrException if not all required fields have values; this may not work well as is with SOLR-139, Support updateable/modifiable documents, and may have to be changed depending on that issue's final disposition.",
    "attachments": {
        "solr-181-required-fields.patch": "https://issues.apache.org/jira/secure/attachment/12352538/solr-181-required-fields.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Greg Ludington",
            "id": "comment-12477742",
            "date": "2007-03-04T06:32:10+0000",
            "content": "This patch allows a per-field \"required\" property that can be used to require clients to include certain fields to submit to the index.\n\nWith this in the index:\n  <field name=\"name\" type=\"nametext\" indexed=\"true\" stored=\"true\" required=\"true\"/>\n\nA document submitted without a name field will throw a SolrException in DocumentBuilder.getDoc() resulting in this sort of message being sent back to the client:\n\n<result status=\"1\">org.apache.solr.core.SolrException: missing required fields:\nname\n\nIssues with the patch as submitted:\n\n1) The rule is enforced, and the Exception thrown, from DocumentBuilder.getDoc().  Since this area may change in SOLR-139, this patch may need to be adjusted depending on the final result of SOLR-139.\n2) Fields with defaultValues are implicitly required, though currently this patch does not automatically make the uniqueKey field required.  It may make sense to do this; however, there seems to be some debate on the mailing lists about this, so It is commented out with a //TODO for now.  See SOLR-172.\n3) The RequiredFieldsTest case uses its own schema file, as otherwise all other tests would have to be retrofitted to add these required fields in their submissions, and all future test writers would have to keep this in mind, as well. "
        },
        {
            "author": "Greg Ludington",
            "id": "comment-12477743",
            "date": "2007-03-04T06:36:59+0000",
            "content": "SOLR-139 makes documents modifiable, instead of all-or-nothing added, which has implications for restricting fields.\n\nSOLR-172 covers similar ground specific to the uniqueKey field. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12492524",
            "date": "2007-04-28T23:24:12+0000",
            "content": "Finally got a chance to look at this.  It looks good.  I made a few modifications:\n\n1. changed tabs to spaces\n2. Added javadoc comments to make it clear that RequiredFields must contain all fieldsWithDefaultValues\n3. The error now contains the documents uniqueKey\n4. moved the test to o.a.s.schema\n5. I added a non-final flag to SchemaField to say if the field is required.\n6. Modified IndexSchema.java to set the uniqueKey as required unless it is specified as required=\"false\" in the schema\n7. Added required=\"true\" to the example schema.xml \n8. Added required=\"false\" to the test schema.xml (one test does not include it)\n\nAs a note to anyone else looking at the change log, Greg's patch also modifies AbstractSolrTestCase and TestHarness to be able to check what status is expected from checkUpdateU\n\n\nI think this offers a good solution to the (mis)feature that you could have a null uniqueKey.  This patch lets you have a null uniqueKey, but you have to configure it.\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12492532",
            "date": "2007-04-29T00:37:04+0000",
            "content": "Haven't looked at the code,  but the description looks fine.\n\n+1 "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12492616",
            "date": "2007-04-30T00:41:57+0000",
            "content": "commited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589312",
            "date": "2008-04-15T23:44:45+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.2\n\n\n\nThe Fix Version for all 39 issues found was set to 1.2, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman2 "
        }
    ]
}