{
    "id": "SOLR-10572",
    "title": "(from 7.0.0 onwards) remove three no-longer-supported warnings in SolrIndexConfig",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Won't Do",
        "status": "Resolved"
    },
    "description": "The mergeScheduler, mergePolicy and luceneAutoCommit no-longer-supported warnings date back to 2012. Let's remove them from 7.0.0 onwards for clarity. This caught my attention as part of SOLR-8668's mergePolicy support removal.",
    "attachments": {
        "SOLR-10572.patch": "https://issues.apache.org/jira/secure/attachment/12865181/SOLR-10572.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-05T17:58:50+0000",
            "content": "Commit a96f39449b48c7c2b4f2a82c808a97fb0c60ffc5 in lucene-solr's branch refs/heads/master from Christine Poerschke\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a96f394 ]\n\nSOLR-10572: Removed three \"no longer supported in solrconfig.xml\" asserts. ",
            "author": "ASF subversion and git services",
            "id": "comment-15998677"
        },
        {
            "date": "2017-05-11T18:00:37+0000",
            "content": "wait a minute – the mergePolicy warning may date back to 2012, but the code to parse & use a mergePolicy declaration if it exists is still in the 6x code (and for that matter master too)\n\nwe shouldn't be removing the assertWarnOrFail call until AFTER the functionality is removed ... that's the entire point of that method: while the functionality is still supported (but deprecated) it can warn, once the functionality is removed it can fail.\n\nAs things stand right now, if 7.0 is released tomorow someone with an old config (who may not have ever noticed the warnings in past versions, or may upgraded to 7.0 from a version before we deprecated that syntax) won't get a warning about their mergePolicy config usage at all – but in some future version it will just silently stop working.\n ",
            "author": "Hoss Man",
            "id": "comment-16006901"
        },
        {
            "date": "2017-05-12T11:02:14+0000",
            "content": "Re-opening to revert as per above, good catch, thanks Hoss!\n\nThe removal of the <mergePolicy> warning would be included in the SOLR-8668 effort then instead, right? And the other two warnings would stay for now. ",
            "author": "Christine Poerschke",
            "id": "comment-16007961"
        },
        {
            "date": "2017-05-12T13:59:09+0000",
            "content": "Commit 6d74a9e858d464fbfa6fc9e0fc90abf437565c3b in lucene-solr's branch refs/heads/master from Christine Poerschke\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6d74a9e ]\n\nRevert \"SOLR-10572: Removed three \"no longer supported in solrconfig.xml\" asserts.\"\n\nThis reverts commit a96f39449b48c7c2b4f2a82c808a97fb0c60ffc5.\n\nResolved Conflicts:\n\tsolr/CHANGES.txt ",
            "author": "ASF subversion and git services",
            "id": "comment-16008162"
        },
        {
            "date": "2017-05-12T14:05:16+0000",
            "content": "Won't do, the warnings are not yet remove-able. ",
            "author": "Christine Poerschke",
            "id": "comment-16008175"
        },
        {
            "date": "2017-05-12T16:28:54+0000",
            "content": "The removal of the <mergePolicy> warning would be included in the SOLR-8668 effort then instead, right? And the other two warnings would stay for now.\n\nChristine Poerschke: I haven't looked closely at the other two to know when they are safe to remove – i just noticed that removingthe mergePolicy warning was weird since hte functionality itself doesn't seem to have been removed.\n\nto be clear: the call to assertWarnOrFail should be removed many versions AFTER the functionality is removed – the only change should be in the final argument to the call, so that instead of logging a warning \"don't do X use Y instead\" it triggers a hard failure with the message \"don't do X use Y instead\"\n\n\n\nThe method was designed so that the final boolean \"failCondition\" could be something conditional – like comparing some constant with the Version.LATEST (of the luceneMatchVersion from the users config) – so that you could write a single line of code on master, backport it to a stable branch, and get a \"fail\" on master but a \"warn\" on older branches (or better: a warn if their luceneMatchVersion < X, but when they edit or replace their config and use a newer luceneMatchVersion the warning becomes a fail) ... then we don't have to go out of our way to remember when it's safe to remove an assertWarnOrFail method call – we just remove it completley once whatever Version constants it refers to are removed (ie: 6.6 removed in 8.0)\n ",
            "author": "Hoss Man",
            "id": "comment-16008340"
        },
        {
            "date": "2017-05-12T17:21:46+0000",
            "content": "Thanks for the detailed explanation!\n\nAt the risk of confusing things further and from just looking at this again now, the code that I was trying to get rid of was\n\nassertWarnOrFail(\"The <mergePolicy>myclass</mergePolicy> syntax is no longer supported in solrconfig.xml. Please use syntax <mergePolicy class=\\\"myclass\\\"/> instead.\", \n    !((solrConfig.getNode(prefix + \"/mergePolicy\", false) != null) && (solrConfig.get(prefix + \"/mergePolicy/@class\", null) == null)), \n    true); \n\n\nwhich is actually for functionality already no longer supported.\n\nHowever since <mergePolicy class=\"myclass\">...</mergePolicy> is still supported at present and since the difference between class=\"myclass\" attribute and <mergePolicy>myclass</mergePolicy> element is very subtle then it is clearest to leave the code-as, hence the reverted commit. ",
            "author": "Christine Poerschke",
            "id": "comment-16008419"
        },
        {
            "date": "2017-05-12T17:58:48+0000",
            "content": "Oh man ... I'm sorry – i totally missed the distinction. (and the fact that this line ends with true); ... not sure why it was ever written that way?)\n\n... it is clearest to leave the code-as, hence the reverted commit.\n\nI'm going to stop assuming I know what i'm talking about and trust you on this – but i have to ask: isn't <mergePolicy class=\"myclass\">...</mergePolicy> already deprecated though?  Shouldn't this (effectively) automatic failure if <mergePolicy>myclass</mergePolicy> is found be telling people to use mergePolicyFactory ? ",
            "author": "Hoss Man",
            "id": "comment-16008485"
        }
    ]
}