{
    "id": "SOLR-248",
    "title": "Capitalization Filter Factory",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "For tokens that are used in faceting, it is nice to have standard capitalization.  \n\nI want \"Aerial views\" and \"Aerial Views\" to both be: \"Aerial Views\"",
    "attachments": {
        "SOLR-248-CapitalizationFilter.patch": "https://issues.apache.org/jira/secure/attachment/12358059/SOLR-248-CapitalizationFilter.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-12498487",
            "date": "2007-05-24T05:29:22+0000",
            "content": "Implementation and test...\n\n<filter class=\"solr.CapitalizationFilterFactory\" onlyFirstWord=\"false\" keep=\"and or the is my or de\" maxTokenLength=\"40\" maxWordCount=\"4\" okPrefix=\"McK\" forceFirstLetter=\"true\" />\n\nonlyFirstWord=\"false\" – this capatalizes every word\n\nkeep=\"and or the is my or de\" – don't change capitalization for these words\n\nforceFirstLetter=\"true\" – capitalize the first letter of the Token (not word) even if it is in the \"keep\" list\n\nmaxTokenLength=\"40\" – if the token is longer then 40 chars, don't even try to capitalize it\n\nmaxWordCount=\"4\" – if there are more then 4 words, don't try capitalizing "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12498488",
            "date": "2007-05-24T05:42:28+0000",
            "content": "1) would it make sense for the keep option to refer to a file, using the same format as StopFilter ... that way it's easy to reuse the same file (which seems like it would be a common case.\n\n2) what is the point of forceFirstLetter=\"true\" ? ... if you want to force capitalization, what's the point of making hte keep list?\n\n3) is okPrefix going to force the case for things that have that prefix in an alternate case, or only allow that casing to remain (ie: if i index McKeen, Mckeen, mckeen and MCKEEN what tokens do i wind up with?) "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12498492",
            "date": "2007-05-24T06:06:59+0000",
            "content": "> \n> 1) would it make sense for the keep option to refer to a file, using the same format as StopFilter ... that way it's easy to reuse the same file (which seems like it would be a common case.\n> \n\nprobably.  that is a good idea\n\n\n> 2) what is the point of forceFirstLetter=\"true\" ? ... if you want to force capitalization, what's the point of making hte keep list?\n> \n\nThis is one that came of necessity!\n\nwith keep=\"the ...\"  and input:\n \"Grand army of the Republic\", \"the arts\"\n\nI want: \"Grand Army of the Republic\" and \"The Arts\"\n\n\"forceFirstLetter\" only applies to the first character in the token, not to each word.\n\n\n> 3) is okPrefix going to force the case for things that have that prefix in an alternate case, or only allow that casing to remain (ie: if i index McKeen, Mckeen, mckeen and MCKEEN what tokens do i wind up with?)\n> \n\nAs written, if the prefix matches, it assumes the word capitalization is correct.  For my input data, this is sufficient – but it should problem do something smarter.\n\nSo, if you index \"McKeen, Mckeen, mckeen, MCKEEN and McKEEN\", you would get:\n\n \"McKeen, Mckeen, Mckeen, Mckeen And McKEEN\"\n\nIf \"okPrefix\" was treated as the capitalization for input where the lowercase prefix matches \"mck\", it would give:\n\n \"McKeen, McKeen, McKeen, McKeen And McKeen\"\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12498700",
            "date": "2007-05-24T16:23:40+0000",
            "content": "Hmmm, this feels slightly strange implementing at the indexing level.\nWhat are the ads/disads vs just lowercasing for indexing and capitalizing at the presentation/application layer? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12498711",
            "date": "2007-05-24T16:43:48+0000",
            "content": "It is a little strange, but (in my case anyway) i think it makes sense...  \n\nI am indexing a bunch of metadata from a bunch of libraries (OAI-PMH) – I want to display the data exactly as it came from the source, but for faceted browsing I need to normalize capitalization.\n\nImplemented at the indexing level, I can have different values for the stored value and indexed terms.  Also, at the indexing level I can leverage existing Tokenizers and Filters to build the tokens that need capitalization – it keeps all the configuration in schema.xml and lets the OAI -> solr xml be a simple transformation, this way whoever takes care of this need only learn solr configuration, not ryan+solr configuration. \n\nIf it is not generally useful I can keep it elsewhere - that is why we have the nice plugin framework!\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12498717",
            "date": "2007-05-24T17:07:39+0000",
            "content": "> Implemented at the indexing level, I can have different values for the stored value and indexed terms.\nOne downside is that it complicates certain things like wildcard or prefix queries (capitalizing the first letter and lowercasing the second is something that the QueryParser does not support).\n\nYou could still store the values verbatim, and index as all lowercase.\nThen the application could capitalize the results it gets back as it sees fit.\nI do see value pushing this type of logic back to the search engine though.\n\nOf course, I think this might be a more general problem in faceting... what to actually use as a label for display purposes vs what the terms in the index were (think price formatting, labels for more complex facet queries, etc). "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12498726",
            "date": "2007-05-24T17:20:34+0000",
            "content": "> \n>> Implemented at the indexing level, I can have different values for the stored value and indexed terms.\n> One downside is that it complicates certain things like wildcard or prefix queries\n>\n\ncurrently i'm using copyfield and doing the prefix query on a different field... not great but it works!\n\n> \n> Of course, I think this might be a more general problem in faceting... what to actually use as a label for display purposes vs what the terms in the index were (think price formatting, labels for more complex facet queries, etc).\n> \n\nInteresting.  I could index with a lowercase filter then reformat the facet results...  I'll take a look at that after the deadline passes  "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12498817",
            "date": "2007-05-24T20:38:29+0000",
            "content": "While I fully agree that faceting does raise some odd issues stemming from the display of normally-invisible indexed values to humans, and that it  theoretically should be responsibility of the front-end to translate index values into human-readable values, there are great practical advantages in both efficiency and convenience to making the indexed values \"pretty\", and to centralize as much of that as possible in the Analysis stage.\n\nIn particular, I will try this and am very likely to put this into use this weekend, so thank you Ryan!  So I'm +1 to adding it to the Solr distribution, though to avoid confusing people it should have a JavaDoc comment explaining that the main use is in faceting to avoid having to introduce such common logic into the presentation-layer.\n\nRegarding the implementation,\n\n1. For 'keep' and 'okPrefix' (and were it not for reverse-compatibility issues, for 'words' in StopFilter), it would be nice to have a means to specify either a direct list or a filename in the same parameter.  A simple approach might be something like keep=\"word word word...\" vs. keep=\"<file\", or even keep=\"<file <file word word\" (with the requirement for backslash-escaping spaces in either)...  Or alternately something like txt:filename (vs. xml:filename, json:filename, etc.) with an unescaped : being significant.\n\n2. Why is so much of the logic in the Factory?  This drags Solr-specific stuff in when a user might want to use just the Analyzer in a non-Solr context. Wouldn't it be better in general for Solr Analyzers to be self-complete, with the Factory merely being an adaptor between SolrParams & external resources and the Analyzer's constructor?\n\nAlso, why is keep in a synchronized map, since there is no mutator?  (I know, picky picky...)\n\nGood luck with the deadline! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12498834",
            "date": "2007-05-24T20:59:55+0000",
            "content": "> Why is so much of the logic in the Factory?\n\nI haven't looked at this specific code, but this is my preference in general.  multiple TokenFilters are created per-field instance on the index side, and per-query-term on the search side, so it's better to pull all the setup you can out of the Filter for performance reasons. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12498841",
            "date": "2007-05-24T21:07:48+0000",
            "content": "> Why is so much of the logic in the Factory? \n\nIt seemed silly to copy the same things over and over for each time the type is indexed or queried...  \n\n> why is keep in a synchronized map,\n\nI'm not sure it needs to be, but i was being cautious...   the map is only created once (and never edited) but could be accessed my many threads simultaneously.\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12501409",
            "date": "2007-06-04T23:57:27+0000",
            "content": "applies with trunk "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12512603",
            "date": "2007-07-13T20:09:10+0000",
            "content": "1. Added better javadocs explaining the configuration.\n2. removed synchronized map\n3. put the Filter as a package private class in the Factory file – since the filter relies on hte factory, it is not particularly useful outsid solr.\n\nI would like to add this soon "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12517591",
            "date": "2007-08-03T17:27:00+0000",
            "content": "added a while ago "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12579136",
            "date": "2008-03-16T03:23:51+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked \"Resolved\" and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.3 as of today 2008-03-15\n\n\n\nThe Fix Version for all 29 issues found was set to 1.3, email notification was suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this (hopefully) unique string: batch20070315hossman1\n "
        }
    ]
}