{
    "id": "SOLR-8982",
    "title": "UI: Cloud -> Dump option isn't working",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "the \"Dump\" option on the (new) angular UI Cloud screen doesn't seem to be working.  the \"pre\" tag where all the data is suppose to appear  is empty...\n\nhttp://127.0.1.1:8983/solr/#/~cloud\n\nWork around: use the older deprecated UI, it does appear to be working...\n\nhttp://127.0.1.1:8983/solr/old.html#/~cloud",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-14T00:09:20+0000",
            "author": "Upayavira",
            "content": "Or delete the functionality. What benefit does it give you? In what way is it useful to you? ",
            "id": "comment-15240297"
        },
        {
            "date": "2016-04-14T07:50:32+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "Or delete the functionality. What benefit does it give you? In what way is it useful to you?\n\nThe reason we added them in the first place was to get as much information as possible (from one place) when a user might have problems with his cloud-setup. i can't say if it did get use often, never used the cloud functionality that extensive on my own. ",
            "id": "comment-15240763"
        },
        {
            "date": "2016-04-14T16:17:04+0000",
            "author": "Erick Erickson",
            "content": "IIRC, this was always buggy (had a \"buggy\" note right on the link).\n\nThe point of it in the first place was to be able to have a convenient way to get the entire clusterstate copied somewhere so it could be e-mailed or attached to a JIRA. How many times int he 4x world do you remember something like \"send me your cluster state\".\n\nFor troubleshooting your own installation, we can look at the clusterstate right in the UI.\n\nI guess what I'm saying here is that as far as I'm concerned, it's not important to bring it back. No real strong feelings on that mind you... ",
            "id": "comment-15241437"
        },
        {
            "date": "2016-08-04T02:10:27+0000",
            "author": "Alexandre Rafalovitch",
            "content": "This is a discussion about the awkward Adobe Flash-requiring presentation of the results of one URL call: \n`http://localhost:8983/solr/admin/zookeeper?wt=json&dump=true`\n\nCould we just document that call, possibly under https://cwiki.apache.org/confluence/display/solr/Command+Line+Utilities and rip out the whole Dump screen and dependencies?\n\nAnd/or we could make that Dump link just open the URL above in a new browser window and let people copy from that. It would just work too.\n\nI can make a patch of either option. ",
            "id": "comment-15406993"
        },
        {
            "date": "2017-05-08T15:20:27+0000",
            "author": "Jan Høydahl",
            "content": "I've removed dump feature in SOLR-10042 ",
            "id": "comment-16000897"
        },
        {
            "date": "2017-05-18T12:23:36+0000",
            "author": "Jan Høydahl",
            "content": "Closing as won't fix now that the old UI is ripped out. I simply removed this feature.\n\nIf anyone wants to re-implement DUMP, please do so with HTML5 and not Flash  ",
            "id": "comment-16015665"
        }
    ]
}