{
    "id": "SOLR-11516",
    "title": "Unified highlighter with word separator never gives context to the left",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.4,                                            7.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "When using the unified highlighter with hl.bs.type=WORD, I am not able to get context to the left of the matches returned; only words to the right of each match are shown.  I see this behaviour on both Solr 6.4 and Solr 7.1.\n\nWithout context to the left of a match, the highlighted snippets are much less useful for understanding where the match appears in a document.\n\nAs an example, using the techproducts data with Solr 7.1, given a search for \"apple\", highlighting the \"features\" field:\n\nhttp://localhost:8983/solr/techproducts/select?hl.fl=features&hl=on&q=apple&hl.bs.type=WORD&hl.fragsize=30&hl.method=unified\n\nI see this snippet:\n\n\"<em>Apple</em> Lossless, H.264 video\"\n\nNote that \"Apple\" is anchored to the left.  Compare with the original highlighter:\n\nhttp://localhost:8983/solr/techproducts/select?hl.fl=features&hl=on&q=apple&hl.fragsize=30\n\nAnd the match has context either side:\n\n\", Audible, <em>Apple</em> Lossless, H.264 video\"\n\n(To complicate this, in general I am not sure that the unified highlighter is respecting the hl.fragsize parameter, although SOLR-9935 suggests support was added.  I included the hl.fragsize param in the unified URL too, but it's making no difference unless set to 0.)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-20T16:33:28+0000",
            "content": "Hi,\nFor the UnifiedHighlighter, the interpretation of hl.bs.type is essentially a pluggable way to establish a snippet boundary.  The value of WORD and CHARACTER are technically supported but probably make no sense. The default is SENTENCE.\n\nNote that the FastVectorHighlighter uses the same parameter name and values but with a different semantic meaning – and in its meaning, WORD is what you'd likely want it at, and it's the default for that highlighter.\n\nWhen you use the UH with the default hl.bs.type, what snippeting challenges do you face?\n\nhl.fragsize is supported but it's fidelity is to the hl.bs.type unit – generally a sentence boundary.  With the original Highlighter, it was to the word edge, which meant it very likely chopped off a sentence, which isn't great. ",
            "author": "David Smiley",
            "id": "comment-16212850"
        },
        {
            "date": "2017-10-20T17:28:13+0000",
            "content": "David Smiley yes, that makes sense. Thanks for the quick reply.\n\nThe domain I'm working in (recruitment) is quite similar to a general purpose search engine - we have documents of maybe 1000 words, and need to show the gist of where the matches appear.  We are happy with cutting off in the middle of a sentence, because well-known search engines do it.\n\nWhen using hl.bs.type=SENTENCE, I have run into examples where the surrounding sentences were not pulled in within the fragsize that we had set - unfortunately I can't show a quick example of this on the techproducts collection, but I can confirm this (and file as a separate issue?) if needed. It was something like:\n\n    \"Foo bar baz. Very long sentence starts here that goes on for several hundred chars.\"\n\nThen a search for \"foo\" would bring back as a snippet:\n\n    \"<em>Foo</em> bar baz.\"\n\nThis led to very short summaries of the document, where only one or two short \"sentences\" are provided that match the query, and the total summary was less than one line long.\n\nWhat I was hoping for was a way to use the unified highlighter to produce similar summaries to the other highlighter options (i.e. cutting off at word boundaries, I think I mean), to take advantage of the performance and flexibility advantages described in the documentation. ",
            "author": "Tim Retout",
            "id": "comment-16212919"
        },
        {
            "date": "2017-10-20T19:01:13+0000",
            "content": "Ok.  At least with respect to the issue title... this issue can probably be won't-fix or perhaps outright remove WORD & CHARACTER options since they are bad options.  (FWIW I didn't don't recall including them; they were probably inherited options from similar code for the FVH).\n\nCan you try simply increasing the hl.fragsize a bunch more?  And then if the result is too long then trimming client-side?\n\nFWIW there is an already coded option on the Lucene end of this to have hl.fragsize be a target/average such that the snippet will break on the side closest to the target (either ahead or before).  There is no Solr option to enable this; it's a TODO.  The current setting picks the earliest always, even if the next break is only a word beyond the target.\n\nSnippeting is hard to satisfy everyone with.  There are many ways to skin this cat. ",
            "author": "David Smiley",
            "id": "comment-16213063"
        },
        {
            "date": "2017-10-20T20:38:28+0000",
            "content": "Huh, okay, that's fair enough - it greatly surprises me that you don't want word separation!  This seems to be very common on, say, Google Search.  I'm not clear on what way the semantics are meant to be different here, but I've probably been lulled into this by the similarity with FVH.\n\nHowever, I can either increase the fragsize and truncate sentences client-side, or use a different highlighter.  I'd agree with removing the option if it's not wanted.\n\nThanks! ",
            "author": "Tim Retout",
            "id": "comment-16213196"
        }
    ]
}