{
    "id": "SOLR-3911",
    "title": "Make Directory and DirectoryFactory first class so that the majority of Solr's features work with any custom implementations.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The biggest issue is that many parts of Solr rely on a local file system based Directory implementation - most notably, replication. This should all be changed to use the Directory and DirectoryFactory abstractions.\n\nOther parts of the code that count on the local file system for making paths and getting file sizes should also be changed to use Directory and/or DirectoryFactory.\n\nOriginal title: Replication should work with any Directory impl, not just local filesystem based Directories.\n\nI've wanted to do this for a long time - there is no reason replication should not support any directory impl. This will let us use the mockdir for replication tests rather than having to force an FSDir and lose all the extra test checks and simulations. This will improve our testing around replication a lot, and allow custom Directory impls to be used on multi node Solr.\n\nExpanded scope - full first class support for DirectoryFactory and Directory.",
    "attachments": {
        "SOLR-3911.patch": "https://issues.apache.org/jira/secure/attachment/12547449/SOLR-3911.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13468100",
            "date": "2012-10-02T21:35:58+0000",
            "content": "First draft:\n\nAll tests pass with a few caveats:\n\n\n\tReplication tests that replicate config files are currently disabled and it's not yet supported.\n\n\n\n\n\tReplication backup command test is disabled and not yet supported.\n\n\n\n\n\tThere are a few nocommits around little issues to work out.\n\n\n\n\n\tStill need to add back local FileSystem optimizations - mostly doing rename for a move rather than copy from one Directory impl to another.\n\n\n\nIn pretty good shape though. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13468175",
            "date": "2012-10-02T23:29:56+0000",
            "content": "Two other things not yet handled:\n\n\n\tI took out any use of lastModified.\n\n\n\n\n\tI have not yet impl'd getting the directory size from a Directory rather than the filesystem - should be simple enough, right now I just return 0.\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13468190",
            "date": "2012-10-02T23:35:39+0000",
            "content": "I have not yet impl'd getting the directory size from a Directory rather than the filesystem - should be simple enough, right now I just return 0.\n\nmark: can you look into fixing SOLR-3665 when you do this?\n\nTheres a TODO in CoreAdminHandlerTest related to this because of how CoreAdminHandler currently tries to determine directory size.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13472095",
            "date": "2012-10-09T03:03:28+0000",
            "content": "Yeah, sure.\n\nI've got the conf tests passing tonight. Just have to do backup and these other clean up issues. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13472830",
            "date": "2012-10-09T22:53:02+0000",
            "content": "New patch.\n\nAll tests are now uncommented and pass.\n\nStill some more cleanup and checking to do. Especially some hard thinking around where we use File.getCanonical and File.getAbsolute path. There are possibly issues our test cases are not catching.\n\nStill have a mkdir issue to address properly - right now I just special case for a couple fs based Directory impls.\n\nsizeOfIndexDirectory now works based on Directory.\n\nStill have not optimized rename/move for fs based Directory impls.\n\nLooking good though - this is fairly close. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13472883",
            "date": "2012-10-10T00:11:12+0000",
            "content": "I was a little surprised, but even almost all of the solrcloud tests pass without forcing a file system based directory. I thought they probably should, but didn't think I'd end up so lucky.\n\nOnly one cloud test is failing when I don't force a local fs based dir for it - I'll try and look into why soon. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13472949",
            "date": "2012-10-10T02:40:43+0000",
            "content": "Only one cloud test is failing when I don't force a local fs based dir for it\n\nI see what this is about - RamDirectory does not keep it's contents over a restart and when a machine comes up and all of a sudden has no existing index but it still has it's old transaction log files, peer sync recovery than can succeed based on the transaction log, but the node will actually be out of sync. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13473420",
            "date": "2012-10-10T18:03:04+0000",
            "content": "This issue has been very satisfying. All tests passing. I still force an fs directory for 2 solrcloud tests due to the recovery issue mentioned above. We can probably fix that in another issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13474841",
            "date": "2012-10-12T06:46:44+0000",
            "content": "I think I'm close to committing something. Patch is getting big enough that it will be really annoying to keep up to date - so I'd like to commit and start baking in trunk as soon as possible. I'll post my latest work tomorrow. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13485471",
            "date": "2012-10-27T16:55:20+0000",
            "content": "I missed converting one of the prop files we write to using a Directory (logReplicationTimeAndConfFiles). This is the file with replication history and stats - obviously no testing for it  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13527249",
            "date": "2012-12-08T20:12:52+0000",
            "content": "I'll commit code to write the replication state through the directory in a moment. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13527266",
            "date": "2012-12-08T21:27:17+0000",
            "content": "'replication stats' I meant - committed. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13527267",
            "date": "2012-12-08T21:28:07+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1418756\n\nSOLR-3911: write out replication stats through Directory\n "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13527299",
            "date": "2012-12-09T00:14:08+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1418789\n\nSOLR-3911: sync properties files after write so that they are written out before the directory is closed.\n "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13529064",
            "date": "2012-12-11T15:46:21+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1420231\n\nSOLR-3911: fix properties file name misspelling and use constant for file name everywhere "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530041",
            "date": "2012-12-12T15:41:15+0000",
            "content": "Okay, this is pretty firmed up now - I'm ready to bring it back. Currently, 4x is having more issues with replication than 5x. There are multiple problems showing up in 4x, none of them currently showing up in 5x - so I think it's better we move down to one set of code to track and debug. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13530044",
            "date": "2012-12-12T15:44:07+0000",
            "content": "+1... merging any of these bug issues targeted for 4.1 (but not yet merged) alone seems really hard at this point.  let's just do them together to make sure we don't miss anything.  AFAIK, there have been no changes to solr specifically targeted toward 5. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530057",
            "date": "2012-12-12T15:53:45+0000",
            "content": "Okay, makes sense. There should only be the lazy cores issue other this this and custom hashing. Anything else that is different should be a mistake.  "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13530381",
            "date": "2012-12-12T21:46:20+0000",
            "content": "[branch_4x commit] Yonik Seeley\nhttp://svn.apache.org/viewvc?view=revision&revision=1420992\n\nSOLR-2592: SOLR-1028: SOLR-3922: SOLR-3911: sync trunk with 4x "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13530649",
            "date": "2012-12-13T03:52:08+0000",
            "content": "This is done. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13552237",
            "date": "2013-01-13T16:57:22+0000",
            "content": "I think this needs a little more work. Now that we write small meta data files through the directory, heavy directory impls might be used because they are designed for index directories. I think we need to be able to do something like pass a context that indicates if the dir will be used for an index or meta data files and then a dir factory could return different impls depending. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13552254",
            "date": "2013-01-13T17:40:10+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1432670\n\nSOLR-3911: pass a context flag so that impls can use different strategies for index directories vs meta data file directories "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13552257",
            "date": "2013-01-13T17:46:10+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1432671\n\nSOLR-3911: pass a context flag so that impls can use different strategies for index directories vs meta data file directories "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13566586",
            "date": "2013-01-30T16:30:12+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1440508\n\nSOLR-3911: Replicate after startup option would not replicate until the IndexWriter was lazily opened. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13566606",
            "date": "2013-01-30T16:50:11+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1440510\n\nSOLR-3911: Replicate after startup option would not replicate until the IndexWriter was lazily opened. "
        }
    ]
}