{
    "id": "SOLR-2980",
    "title": "DataImportHandler becomes unresponsive with Microsoft JDBC driver",
    "details": {
        "affect_versions": "3.4,                                            3.5",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "A solr core has been configured to use the DataImportHandler to read a set of documents from a Microsoft SQL Server database, via the Microsoft JDBC driver.  A known-good configuration for the data import handler is used, and a \"reload-config\" followed by \"full-import\" command are issued to the DataImportHandler.\n\nThe handler switches to a status of \"A command is still running...\", and shows 1 request has been made to the data source.  Subsequent status calls show the Time Elapsed growing, but the handler fails to perform any action--SQL Server confirms that a login event occurs, but no queries are issued.  Solr does not throw any exceptions, even after a very long duration.  The last message in Solr's output is \"INFO: Creating a connection for entity \n{entity name}\n with URL: \n{entity datasource url}\n\"\n\nAttempts to issue an Abort command to the DataImportHandler appear successful, but do no stop the operation.\n\nRunning the solr instance with the \"java -verbose\" flag shows the following:\n\nIMMEDIATELY UPON EXECUTING \"FULL-IMPORT\" COMMAND\n[Loaded com.microsoft.sqlserver.jdbc.StreamPacket from file:/home/MYWEBGROCER/swolfe/downloads/apache-solr-3.5.0/example/lib/sqljdbc4.jar]\n[Loaded com.microsoft.sqlserver.jdbc.StreamLoginAck from file:/home/MYWEBGROCER/swolfe/downloads/apache-solr-3.5.0/example/lib/sqljdbc4.jar]\n[Loaded com.microsoft.sqlserver.jdbc.StreamDone from file:/home/MYWEBGROCER/swolfe/downloads/apache-solr-3.5.0/example/lib/sqljdbc4.jar]\n\nAPPROXIMATELY 40 SECONDS LATER\n[Loaded java.io.InterruptedIOException from /usr/lib/jvm/java-1.6.0-openjdk-1.6.0.0.x86_64/jre/lib/rt.jar]\n[Loaded java.net.SocketTimeoutException from /usr/lib/jvm/java-1.6.0-openjdk-1.6.0.0.x86_64/jre/lib/rt.jar]\n[Loaded sun.net.ConnectionResetException from /usr/lib/jvm/java-1.6.0-openjdk-1.6.0.0.x86_64/jre/lib/rt.jar]\n\nAn issue with identical symptoms has been reported on StackOverflow (the OP found that using a 3rd party JDBC driver appeared successful): http://stackoverflow.com/questions/8269038/solr-dataimporthandler-logs-into-sql-but-never-fetches-any-data",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Steve Wolfe",
            "id": "comment-13172721",
            "date": "2011-12-19T23:05:59+0000",
            "content": "FYI: This issue has been isolated by testing the identical Solr configs, with successful results, on several different boxes.  These tests have confirmed that the SQL Login is valid and capable of executing the required query, and that the other Solr configuration parameters (schema, solrconfig, etc) are valid and functional.  Network-tests have been performed from the problem-box to ensure it has full network access to the SQL database. "
        },
        {
            "author": "Steve Wolfe",
            "id": "comment-13174042",
            "date": "2011-12-21T12:28:53+0000",
            "content": "After careful comparison of the working vs. non-working machines I identified that the non-working machines were using a slightly newer build of the JRE (both were using 1.6.0_20, but two different builds of that same runtime).  By explicitly installing the older version all issues went away.  During diagnostics I had also found that the issue was not specific to Solr, but rather appeared to be between the affected JRE and the SQL Server JDBC driver.\n\n\"Good\" build of the JRE: http://pkgs.org/centos-5-rhel-5/centos-rhel-x86_64/java-1.6.0-openjdk-1.6.0.0-1.22.1.9.8.el5_6.x86_64.rpm.html\n\"Bad\" build of the JRE: http://pkgs.org/centos-5-rhel-5/centos-rhel-updates-x86_64/java-1.6.0-openjdk-src-1.6.0.0-1.23.1.9.10.el5_7.x86_64.rpm.html "
        },
        {
            "author": "Steve Wolfe",
            "id": "comment-13174043",
            "date": "2011-12-21T12:29:53+0000",
            "content": "Determined that the issue is not Solr-specific, but rather it occurs between affected versions/builds of the JRE and the MS SQL JDBC driver.  See comment for details. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13174044",
            "date": "2011-12-21T12:36:11+0000",
            "content": "See my comments about the mess with OpenJDK version numbers, you cannot read anything out of it: My advise: Don't use OpenJDK and download real Oracle JDKs - please!\n\nhttp://blog.thetaphi.de/2011/12/jdk-7u2-released-how-about-linux-and.html "
        }
    ]
}