{
    "id": "SOLR-8997",
    "title": "useCompoundFile should default to true like Lucene",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "See the discussion at the end of SOLR-4941.  Essentially, useCompoundFile should default to true, like Lucene.  In this sense, we can just not set it if useCompoundFile isn't explicitly set.\n\nFurthermore, it's possible for some combinations of this setting and merge policy's setting to make no sense – specifically configurations that go from not using CFS, to using CFS, then to not using CFS again!  If we can detect that this happens, we should log a warning.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-15T15:05:35+0000",
            "author": "David Smiley",
            "content": "I'm also of the opinion, that we should remove <useCompoundFile> from the solr configs we ship with.  It's confusingly named and it's such an in-the-weeds detail; we needn't clutter our configs with it (cognitive distraction / noise).  We don't even have noCFSRatio in our configs, which I think is more useful to set than useCompoundFile. ",
            "id": "comment-15243079"
        },
        {
            "date": "2017-04-26T15:41:56+0000",
            "author": "Christine Poerschke",
            "content": "When Solr defaults to the same default as Lucene then yes it would be good to remove the <useCompoundFile> from the example configs since as you say it clutters up the configs.\n\nChanging Solr to default to the same default as Lucene, would that be something that is best be done from 7.0 onwards or could it happen (in principle) in a 6.x release also? ",
            "id": "comment-15985025"
        },
        {
            "date": "2017-04-26T15:42:59+0000",
            "author": "David Smiley",
            "content": "I think changing the default could happen whenever.  This is a tuning option. ",
            "id": "comment-15985026"
        }
    ]
}