{
    "id": "SOLR-2367",
    "title": "DataImportHandler unit tests are very noisy",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "Build",
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Running DataImportHandler unit tests emits a lot of console noise, mainly stacktraces because dataimport.properties can't be written. This makes it hard to scan the output for useful information.\n\nI'm attaching a patch to get rid of most of the noise by creating the conf directory before test runs so that the properties file write doesn't fail.",
    "attachments": {
        "SOLR-2367-log-exceptions-through-SolrException.patch": "https://issues.apache.org/jira/secure/attachment/12471234/SOLR-2367-log-exceptions-through-SolrException.patch",
        "SOLR-2367-extend-SolrException.patch": "https://issues.apache.org/jira/secure/attachment/12471216/SOLR-2367-extend-SolrException.patch",
        "SOLR-2367.patch": "https://issues.apache.org/jira/secure/attachment/12471195/SOLR-2367.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Gunnlaugur Thor Briem",
            "id": "comment-12995387",
            "date": "2011-02-16T16:59:14+0000",
            "content": "Patch to address this issue. Creates conf directories under work directory before test runs, and suppresses a warning.\n\nThe console noise that remains is some XML parsing failure, which may or may not be meaningful (I don't know) — at least now it is visible. \n\nThis patch is against branch_3x as of just now. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12995402",
            "date": "2011-02-16T17:28:19+0000",
            "content": "Thanks for the patch. I modified it, to just specify the absolute path to these directories.\n\nthis way we don't have to make any useless directories underneath the CWD.\n\nSeparately, as far as the exceptions, this is in the test TestErrorHandling, its 'expected exceptions'. I tried to modify this test to use the 'expected exception' logic in SolrTestCaseJ4, etc, but I could not make it work. \n\nI think this is because DIH throws DataImportHandlerExceptions (extends RuntimeException) instead of ones that extend SolrException? "
        },
        {
            "author": "Gunnlaugur Thor Briem",
            "id": "comment-12995466",
            "date": "2011-02-16T19:13:29+0000",
            "content": "Oh, right, much neater. "
        },
        {
            "author": "Gunnlaugur Thor Briem",
            "id": "comment-12995469",
            "date": "2011-02-16T19:18:07+0000",
            "content": "If it helps, here's a patch that makes DataImportHandlerException extend SolrException (and deprecates a constructor that seems not to be used anywhere). All tests pass, but beyond that this has not been tried out at runtime (and maybe the change isn't even appropriate?) ... does this make the exception silencing work? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12995479",
            "date": "2011-02-16T19:31:01+0000",
            "content": "Thanks for the followup patch, I will try and see if i can use the exception ignores mechanism now with it... maybe this time it will work. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12995537",
            "date": "2011-02-16T21:53:47+0000",
            "content": "I tried to use your patch and silence the tests in various ways... I was unsuccessful.\n\nIts a mystery really to me (because I don't understand the code that well) that all\nthese exceptions are being thrown and nothing is failing... so I'm not sure how to silence them.\n\nLets commit the first patch and fix 80% of the problem... maybe we can figure out the other exceptions in the future. I'll keep the issue open. "
        },
        {
            "author": "Gunnlaugur Thor Briem",
            "id": "comment-12995579",
            "date": "2011-02-16T23:29:18+0000",
            "content": "Here goes the remaining 20% — I'm attaching SOLR-2367-log-exceptions-through-SolrException.patch which makes DataImportHandler log exceptions through SolrException.log() instead of directly into the logger. This way the exception-ignoring mechanism gets a say in matters. Test output is nice and clean now. I addressed only those logger calls that were emitting exceptions in unit test runs.\n\nNote: this does not require DataImportHandlerException to extend SolrException, so the earlier SOLR-2367-extend-SolrException.patch is not needed. (Might still be worthwhile, I don't know — but not needed for this fix). "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12995785",
            "date": "2011-02-17T12:33:34+0000",
            "content": "Thanks Gunnlaugur for getting to the bottom of this! "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013226",
            "date": "2011-03-30T15:45:55+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}