{
    "id": "SOLR-11335",
    "title": "HdfsDirectory & Factory should not close the FileSystem object retrieved with get",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Hadoop Integration"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I'm seeing issues where the Hadoop FileSystem instance is closed out from under other objects. From what I understand, the Hadoop FileSystem object (org.apache.hadoop.fs.FileSystem) retrieved with FileSystem.get as is done in HdfsDirectory's ctor is a shared object that if closed, can affect other code using that same shared instance. You can see this is a cached, shared object here -> \nhttps://github.com/apache/hadoop/blob/trunk/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/fs/FileSystem.java#L455\n\nThus, I suspect Solr should not be closing any FileSystem instance retrieved with get. It's important to mention that if I set the fs.$SCHEME.impl.disable.cache to true, then my problems go away, which seems to confirm that Solr is using the API incorrectly. That being said, I'm surprised this hasn't been raised before, so maybe I've missed something basic in Solr's use of HDFS?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-07T15:57:19+0000",
            "content": "Mark Miller I know you've done a ton of work here, am I missing something or is this really a bug? ",
            "author": "Timothy Potter",
            "id": "comment-16157129"
        },
        {
            "date": "2017-09-08T16:19:15+0000",
            "content": "With a bit more digging, I see that HdfsUpdateLog sets fs.hdfs.impl.disable.cache=true, but I'm not sure if that Configuration applies to HdfsDirectory as well. Then I realized that the initialization of HdfsUpdateLog depends on this check:\n\n      if (dataDir != null && dataDir.startsWith(\"hdfs:/\")) {\n\n\nWhich doesn't work for me, because my HDFS path is alluxio://. Given HDFS allows different schemes besides HDFS, seems like this code should not only look for hdfs:/ ",
            "author": "Timothy Potter",
            "id": "comment-16158868"
        },
        {
            "date": "2017-09-08T16:20:49+0000",
            "content": "Changed to minor given the user can just disable the cache in core-site.xml loaded into Solr. ",
            "author": "Timothy Potter",
            "id": "comment-16158871"
        }
    ]
}