{
    "id": "SOLR-10642",
    "title": "Facet offset not returning enough results with solr cloud",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [
            "6.6"
        ],
        "affect_versions": "6.4.1",
        "resolution": "Duplicate",
        "status": "Resolved"
    },
    "description": "A collection has four shards. \nA field has >5K terms according to the web ui for one core of the collection.\nA json facet query with limit 20 and offset 0 returns 20 buckets as expected.\n\nThe same query with an offset of 20 returns only seven more buckets.\n\nWith debugQuery= true I see that the first query with offset = 0  the four cores return 27 different vals which are merged. The top 20 are collected for the result.\n\nWith offset=20 I see the same 27 vals for the cores. But now the first 20 are skipped and seven are returned.\nAnd with offset=40 the same is returned as for offset=20.\n\nExample:\nhttp://mysolrserver/solr/my_collection/select?wt=json&indent=false&q=*&rows=0&json.facet={\"my_facet\"%3A+\n{\"field\"%3A+\"some_field\"%2C+\"limit\"%3A+20%2C+\"offset\"%3A+20%2C+\"sort\"%3A+\"count+desc\"%2C+\"type\"%3A+\"field\"}\n}",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-09T10:42:21+0000",
            "content": "Hi thanks Sascha for opening the issue! I will take care to ask the right person to fix this. ",
            "author": "Uwe Schindler",
            "id": "comment-16002465"
        },
        {
            "date": "2017-08-18T11:58:13+0000",
            "content": "Hi Yonik Seeley / Yonik Seeley,\ndo you have an idea where to look for? You have written the code, but it is almost impossible to me to find the bug. I'd really like to help Sascha, but based on the comments in the code of the experimental facet module, the passing of offset and limit to shards is not fully implemented, e.g. look at FacetFieldMerger.java, line 119 (branch_6x):\n\n\n    // TODO: change effective offsets + limits at shards...\n\n\n\nTo me it looks like it does not correctly calculate the \"limit\" that needs to be passed to the shards. A quick fix would be to just add the offset to the limit sent to each shard, so it collects many more buckets on the shards, but I have no idea where to best do this.\n ",
            "author": "Uwe Schindler",
            "id": "comment-16132096"
        },
        {
            "date": "2017-08-18T12:23:20+0000",
            "content": "Hi Sascha,\n\nas a quick fix, could you try to use the overrequest parameter when building the facet request? By default it is -1 which calculates the 27 items to fetch. So you can give offset, limit and overrequest. Maybe start with something like an additional overrequest = offset * 1.10 (10% more items to fetch than the current offset).\n\nI think I can add this somehow to the code, but I have no index available to test this quickly. I am just guessing. ",
            "author": "Uwe Schindler",
            "id": "comment-16132113"
        },
        {
            "date": "2017-08-18T13:05:02+0000",
            "content": "Hi,\nI think, I found the problem:\n\n\tIn FacetFieldProcessor#findTopSlots it calculates the effectiveLimit and also the off (effective offset), which is used if the current request is a shard.\n\tIt sets the offset explicitely to \"0\", if it is a shard request\n\tOn the other hand, it does not raise the effective limit by the same value.\n\n\n\nI attached a patch. All tests still pass. But I have to write a new test, that tries to reproduce this bug. ",
            "author": "Uwe Schindler",
            "id": "comment-16132150"
        },
        {
            "date": "2017-08-18T15:06:06+0000",
            "content": "I recall fixing something like this... is this still a problem on master/7?\nIs this just SOLR-10480? ",
            "author": "Yonik Seeley",
            "id": "comment-16133089"
        },
        {
            "date": "2017-08-18T18:52:55+0000",
            "content": "Hi Yonik,\n\nthanks for the hint! This explains why I was not able to easily reproduce the issue on 6.x branch. I was just starring at the code and did not see the issue. I should have looked at the Git log!\nI will tell Sascha to update to 6.6.\n\nUwe ",
            "author": "Uwe Schindler",
            "id": "comment-16133459"
        },
        {
            "date": "2017-08-18T18:57:10+0000",
            "content": "I removed the patch, it was not helping,  but I was close!  Thanks Yonik! ",
            "author": "Uwe Schindler",
            "id": "comment-16133472"
        },
        {
            "date": "2017-08-18T18:58:30+0000",
            "content": "This is a duplicate of SOLR-10480, which was solved in Solr 6.6. ",
            "author": "Uwe Schindler",
            "id": "comment-16133476"
        }
    ]
}