{
    "id": "SOLR-1413",
    "title": "Add MockSolrServer to SolrJ client tests",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.3"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Test",
        "priority": "Minor",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "The SolrJ unit test suite has no \"mock\" solr server for HTTP access, and there are no low-level tests of the Solrj HTTP wire protocols.\n\nThis patch includes org.apache.solr.client.solrj.MockHTTPServer.java and org.apache.solr.client.solrj.TestHTTP_XML_single.java. The mock server does not parse its input and responds with pre-configured byte streams. The latter does a few tests in the XML wire format. Most of the tests do one request and set up success and failure responses.\n\nUnfortunately, there is a bug: I could not get 2 successive requests to work. The mock server's TCP socket does not work when reading the second request.  If someone who knows the JDK socket classes could look at the mock server, I would greatly appreciate it.\n\nThe alternative is to steal a bunch of files from the apache commons httpclient test suite. This is a quite sophisticate bunch of code:\n\nhttp://svn.apache.org/repos/asf/httpcomponents/oac.hc3x/trunk/src/test/org/apache/commons/httpclient/server/",
    "attachments": {
        "SOLR-1413.patch": "https://issues.apache.org/jira/secure/attachment/12418732/SOLR-1413.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12751831",
            "date": "2009-09-06T06:19:34+0000",
            "content": "Why should it be opening a ServerSocket ? Why can't you start a jetty server and register a servlet to respond with the appropriate response for ach given url.  "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12752312",
            "date": "2009-09-08T02:53:59+0000",
            "content": "Noble, you and your sensible ideas \n\nYes, it's cleaner with a Jetty server and a custom servlet. Version 2 of the patch uses this.\n\nBTW, the point of this is that using the SolrJ client with lots of threads might have problems, and this allows direct investigation. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12752319",
            "date": "2009-09-08T03:14:36+0000",
            "content": "the patch looks fine. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12752320",
            "date": "2009-09-08T03:25:39+0000",
            "content": "Thanks!\n\nIn fact I'm now afraid it won't work, I don't know java HTTP coding ver well. Are HTTP sessions are matched between threads in the SolrJ client app and servlet HTTP sessions?\n\nThat is, if 8 client threads walk the same sequence of mock responses, will the Apache Commons simple and multi-threaded connection managers vector the client threads to the right sessions? If not, the clients will get a random sequence of responses and some of the sessions will run out of responses.\n\nDo I have to turn on something in the Servlet? "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12752350",
            "date": "2009-09-08T05:42:47+0000",
            "content": "I guess your \"Mock Servlets\" do not use http session . If this is true everything should be ok.ideally requests to Solr does not need sessions "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12752352",
            "date": "2009-09-08T05:50:01+0000",
            "content": "We don't really need to register a new servlet for every \"path\" one standard servlet can take care of all the paths.\n\nlet the servlet have a method. \n\n\npublic void addPath(String path, Map<String,Object>httpheaders, NamedList httpResponse ){\n}\n\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13631176",
            "date": "2013-04-13T21:26:48+0000",
            "content": "SPRING_CLEANING_2013 JIRAS Still hasn't been done, but lots of work has happened in the test infrastructure. Is this still valid? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13634830",
            "date": "2013-04-18T04:45:37+0000",
            "content": "The test infrastructure has had a huge upgrade since 3 years ago. This is no longer a valid thang. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13635095",
            "date": "2013-04-18T11:21:46+0000",
            "content": "Thanks for closing Lance! "
        }
    ]
}