{
    "id": "SOLR-992",
    "title": "Add Ability To Use JNDI Keys In Configuration String Replacement Tags",
    "details": {
        "affect_versions": "1.4",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The configuration syntax allows users to specify tags which will be replaced with values pulled from system properties, or a given default value if the system property can not be found. It could also be useful to allow users to pull replacement values from the JNDI environment configuration.\n\nIssues:\n1. Full JNDI tags are specified with a url syntax, which includes a \":\" character. The \":\" character is currently used to separate the system property name to be used for replacement from the (optional) default value to use.\n2. JNDI might not be configured for the application's context at all.\n3. The specified JNDI reference might not be found in the application's context.\n4. The specified JNDI reference might be malformed.\n\nThe attached patch is a simple first-draft attempt to merge the code used to pull a value for solr.home from JNDI into the variable replacement utility. The syntax I went with for determining that it's a JNDI replacement key is to require a \"jndi/\" prefix, where anything following that prefix is expected to be a \"/\"-delimited JNDI path: \"jndi/data/home\".\n\nI had to comment out the log references because there is no log object available in the DOMUtil. I also had to replace the reference to \"project\" with its defined value, since that variable is just a final static String in the SolrResourceLoader class anyway.",
    "attachments": {
        "solr-992.zip": "https://issues.apache.org/jira/secure/attachment/12398949/solr-992.zip"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Michael Henson",
            "id": "comment-12668240",
            "date": "2009-01-28T23:52:55+0000",
            "content": "First draft version of the patch. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13604361",
            "date": "2013-03-16T18:54:02+0000",
            "content": "Could someone JNDI-savvy comment here? Or kill this issue.. "
        }
    ]
}