{
    "id": "SOLR-4249",
    "title": "change UniqFieldsUpdateProcessorFactory to subclass FieldValueSubsetUpdateProcessorFactory",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "UniqFieldsUpdateProcessorFactory has been arround for a while, but if we change it to subclass FieldValueSubsetUpdateProcessorFactory, a lot of redundent code could be eliminated from that class, and the factory could be made more configurable by supporting all of the field matching logic in FieldMutatingUpdateProcessorFactory, not just a list of field names.\n\n(the only new code that would be needed is handling the legacy config case currently supported by UniqFieldsUpdateProcessorFactory)\n\n—\n\nFor users of 4.x starting with 4.5, the existing init param syntax will still be supported, but a warning will be logged recommending they switch to using <arr name=\"fieldName\">...</arr> instead of <lst name=\"fields\">..</lst>.  Starting with 5.0, the \"fields\" option won't be recognized at all.",
    "attachments": {
        "SOLR-4249.patch": "https://issues.apache.org/jira/secure/attachment/12600511/SOLR-4249.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13753080",
            "date": "2013-08-29T00:14:19+0000",
            "content": "A \"phase 1\" patch that switches UniqFieldsUpdateProcessorFactory to be a subclass of FieldValueSubsetUpdateProcessorFactory with some custom init logic to deal with the previous \"fields\" config syntax and log a warning that it is deprecated.  Includes a new test of the FieldMutatingUpdateProcessor selector syntax, but leaves the other existing tests alone to prove that it still works.\n\nplan is to commit & backport this, then commit a trunk only change removing the backcompat support for the hackish syntax and upate the test configs accordingly. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13753840",
            "date": "2013-08-29T17:31:18+0000",
            "content": "Commit 1518717 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1518717 ]\n\nSOLR-4249: UniqFieldsUpdateProcessorFactory now extends FieldMutatingUpdateProcessorFactory and supports all of it's selector options "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13753907",
            "date": "2013-08-29T18:26:54+0000",
            "content": "Commit 1518746 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1518746 ]\n\nSOLR-4249: UniqFieldsUpdateProcessorFactory now extends FieldMutatingUpdateProcessorFactory and supports all of it's selector options (merge r1518717) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13754094",
            "date": "2013-08-29T21:40:56+0000",
            "content": "Commit 1518836 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1518836 ]\n\nSOLR-4249: remove legacy UniqFieldsUpdateProcessorFactory init param syntax from trunk for 5.0 "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787096",
            "date": "2013-10-05T10:19:11+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}