{
    "id": "SOLR-5198",
    "title": "Make default similarty configurable",
    "details": {
        "affect_versions": "4.4",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Though the code has supported for customizing scoring on a per-field basis in using <similarity/> in a schema's fieldType and \nwe can configure our custom similarity factory in schema,  we can't configure the default similarty and it is hardcode in SchemaSimilarityFactory. \n\n  If we want to use another similarity as default similarty instead of DefaultSimilarity provided by lucene, we must to write another similarity factory to do this. Therefore, it is necessary to make default similarty configurable. \n\n  Any comments is welcomed.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13752433",
            "date": "2013-08-28T14:30:54+0000",
            "content": "This isnt really true.\n\nIf you want to use a different default similarity, use that instead of schemasimilarityfactory.\n\nif you want to do per-field support and do things differently, just make your own core-aware similarityfactory (schemasimilarity is not special, its just an example we provide).\n\nThere are too many possibilities for things people want to do and too many traps. Plugging in your own for expert stuff is really the way to go here. "
        },
        {
            "author": "Feihong Huang",
            "id": "comment-13754236",
            "date": "2013-08-30T00:05:42+0000",
            "content": "Make default similary configurable maybe make sense, \nSuch as We can use BM25Similarity instead of TFIDFSimilarity just through modifying configure, \nrather than writing other custom schemasimilarityfactory.  "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13754271",
            "date": "2013-08-30T01:12:51+0000",
            "content": "I am using BM25 without any custom code.  Here's the top of my schema.xml:\n\n\n<schema name=\"ncdat\" version=\"1.5\">\n\n  <similarity class=\"solr.BM25SimilarityFactory\"/>\n\n\n "
        },
        {
            "author": "HeXin",
            "id": "comment-13754372",
            "date": "2013-08-30T04:56:50+0000",
            "content": "hi, Shawn, you are right. \nBut i think you have written the class BM25SimilarityFactory at first and maybe its function just to provide BM25Similarity as default similarity.\n\nMaybe i have not describe the feature clearly.  I just want the two scenarios below can be done just through modifying schema.xml. \n\n1. If we want to use a different default similarity rather than TFIDFSimilarity. \n2. If we want to do per-field support and make BM25Similarity as default similarity for the fields which not configure similarity. \n\nI think we can support it without any custom code. "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13754595",
            "date": "2013-08-30T11:02:10+0000",
            "content": "If you need BM25Similarity to be the DEFAULT instead of TFIDFSimilarity, you will have to provide your own SchemaSimilarityFactory just like Robert sais, and let it return your preferred Similarity instead. Check line 48:\n\nhttp://svn.apache.org/viewvc/lucene/dev/trunk/solr/core/src/java/org/apache/solr/search/similarities/SchemaSimilarityFactory.java?view=markup "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971318",
            "date": "2014-04-16T12:57:46+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}