{
    "id": "SOLR-5094",
    "title": "TestJmxIntegration makes no sense",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "for reasons i can't explain, TestJmxIntegration stoped working on my machine today, and when i started looking into it, i realized that there's no logical reason why it should be working on any machine at all.\n\nBack when this test was first written, it was setup to ensure that an MBean server was up and running prior to initializing the SolrCore, and then the configuration used by the test was designed to use JMX if and only if an existing MBean server was running.\n\nin r1402613 this was (inadvertantly?) changed so that the SolrCore was initialized @BeforeClass, but there was no certainty that the Mbean server was started until later – so the test fails in a variety of confusing ways because there is no JMX running at all.  The only reason it can succeed is if an MBean server already happens to be running.\n\nI've got a patch that should fix this in general, or at least make it fail with a clear error if hte problem is that a JMX server isn't found on core init",
    "attachments": {
        "SOLR-5094.patch": "https://issues.apache.org/jira/secure/attachment/12595050/SOLR-5094.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13724465",
            "date": "2013-07-30T21:36:49+0000",
            "content": "linking up a variety of related JMX/TestJmxIntegration  bugs i found while looking into this that i'm going to investigate some more while my head is in this space "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13724466",
            "date": "2013-07-30T21:37:42+0000",
            "content": "patch that should fix the problem with the test "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13724467",
            "date": "2013-07-30T21:40:30+0000",
            "content": "I have experienced the same issue. \n\nI think your explanation might make some sense: somehow this test must rely upon the test order of previous tests? So someone makes a unrelated commit (e.g. that adds a new test) and based on the number of processors i have/the phase of the moon/whatever it causes it to start failing on my machine that day.\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13724472",
            "date": "2013-07-30T21:45:14+0000",
            "content": "somehow this test must rely upon the test order of previous tests?\n\nprobably yeah ... if this is the first test running in the VM, it will likeley fail, but if another test runs first and causes an MBean server to be created then the tests works fine.\n\nand recently committed cahnges seem to have shifted the test ordering in the VM slightly?\n\neither way: this just started failing in jenkins as well, suggesting that it's not my imagination or something that changed on my machine – something fundemental changed today on both trunk and 4x causing this to fail regardless of seed. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13724485",
            "date": "2013-07-30T21:58:12+0000",
            "content": "+1 to commit.\n\ntoday:\nthis test fails on clean checkout (with any jvm) if you run ant test -Dtestcase=TestJmxIntegration\nthe \"J9 assume/bug\" is not related to J9 at all. its the same bug here.\n\nwith patch it all works (tested both oracle and J9, with assume removed) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13724487",
            "date": "2013-07-30T21:58:55+0000",
            "content": "Commit 1508661 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1508661 ]\n\nSOLR-5094: Fix order of setup in TestJmxIntegration so MBean server is running before Solr init.  Also fixes SOLR-4418 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13724494",
            "date": "2013-07-30T22:02:35+0000",
            "content": "Commit 1508662 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1508662 ]\n\nSOLR-5094: Fix order of setup in TestJmxIntegration so MBean server is running before Solr init.  Also fixes SOLR-4418 (merge r1508661) "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787065",
            "date": "2013-10-05T10:19:01+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}