{
    "id": "SOLR-5045",
    "title": "Pluggable Analytics",
    "details": {
        "affect_versions": "6.0",
        "status": "Resolved",
        "fix_versions": [
            "6.0"
        ],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Incomplete"
    },
    "description": "This ticket provides a pluggable aggregation framework through the introduction of a new Aggregator interface and a new search component called the AggregatorComponent.\n\nThe Aggregator interface extends the PostFilter interface providing methods that allow DelegatingCollectors to perform aggregation at collect time. Aggregators were designed to play nicely with the CollapsingQParserPlugin introduced in SOLR-5027. \n\nThe AggregatorComponent manages the output and distributed merging of aggregate results.\n\nThis ticket is an alternate design to SOLR-4465 which had the same basic idea but a very different implementation. This implementation resolves the caching issues in SOLR-4465 and combined with SOLR-5027 plays nicely with field collapsing. It is also much less intrusive on the core code as it's entirely implemented with plugins.\n\nInitial Syntax for the sample SumQParserPlugin Aggregator:\n\n../select?q=*:*&wt=xml&indent=true&fq={!sum field=popularity id=mysum}&aggregate=true\n\nfq={!sum field=popularity id=mysum} - Calls the SumQParserPlugin telling it to sum the field popularity.\n\naggregate=true  - turns on the AggregatorComponent\n\nThe output contains a block that looks like this:\n\n<lst name=\"aggregates\">\n  <lst name=\"mysum\">\n    <long name=\"sum\">85</long>\n  </lst>\n</lst>",
    "attachments": {
        "SOLR-5045.patch": "https://issues.apache.org/jira/secure/attachment/12592866/SOLR-5045.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Joel Bernstein",
            "id": "comment-13711674",
            "date": "2013-07-17T21:47:07+0000",
            "content": "Initial patch for review. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13711705",
            "date": "2013-07-17T22:11:17+0000",
            "content": "I need some help understanding what features this component would provide to a user of Solr. In particular, what forms of \"aggregation\" would it perform or be capable of performing? Like, \"aggregation\" of what? "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13711793",
            "date": "2013-07-17T23:23:53+0000",
            "content": "This allows people to plug-in custom Aggregators using an extension of the PostFilter framework.\n\nPeople currently use PostFilters to filter queries. This ticket expands the functionality of PostFilters to allow for collecting aggregates. It also manages the merging of the aggregates during distributed search.\n\nThe current aggregation tools, Facets and Stats, are monolithic and not easy to plug-in custom aggregation logic.\n\nAlso rather then having large monolithic aggregation components, this design allows for a library of small pluggable aggregation functions.\n\n\n\n\n\n\n\n "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13712509",
            "date": "2013-07-18T17:13:15+0000",
            "content": "Added SumQParserPlugin which is a very simple Aggregator implementation. At this point this class is only to show the mechanics of how an Aggregator works and to test the framework. This class will be iterated on to make it more full featured. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13712548",
            "date": "2013-07-18T17:43:30+0000",
            "content": "One interesting test case: There has been some interest in adding \"median\" to the stats component. The difficulty is that you need to build up the frequency distribution so that you can find the value that is >= half of the values, which is a lot more effort than simply adding values to an accumulator. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13712554",
            "date": "2013-07-18T17:46:07+0000",
            "content": "Can I \"script\" some custom analytics?\n\nOr is that simply a question of how this new component hooks in with the proposed JavaScriptRequestHandler (SOLR-5005)? "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13712566",
            "date": "2013-07-18T17:56:43+0000",
            "content": "You have the flexibility to calculate median, atleast on a single server. Not sure what the best approach to this would be. Distributed median may be harder. You'd have to build up distributions in a way that can be merged.\n\nScripting is a very cool thing. I need to do some research though on SOLR-5005 and see if it can be applied. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13719512",
            "date": "2013-07-25T11:18:25+0000",
            "content": "Joel Bernstein how does this play with SOLR-2894?  Overlap?  Is the plan to be able to use this approach here to implement SOLR-2894 later on? "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13719614",
            "date": "2013-07-25T13:36:22+0000",
            "content": "Yeah, the plan eventually would be to port the techniques used in SOLR-2894 to a pluggable Aggregator. Ideally pluggable analytics would lead to the implementation of different aggregation libraries. Since they can be implemented as pure plugins, developers wouldn't have to worry about getting their library committed. Interesting commercial opportunity for developing and maintaining a high performance analytic library for Solr, above and beyond what the community provides.  "
        },
        {
            "author": "Andrew Muldowney",
            "id": "comment-13732091",
            "date": "2013-08-07T15:17:20+0000",
            "content": "Do you mean 2894 distributed pivot facets or SOLR-3583 the pivot facet statistics patch? "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-13732097",
            "date": "2013-08-07T15:25:37+0000",
            "content": "Andrew,\n\nThis ticket just provides a pluggable aggregation framework. It probably will include a basic SUM aggregator as a reference for how the framework works. Any other aggregation implementations will be added in other tickets. So pivot facets only relate in that they could one day be implemented as a pluggable aggregation in a future ticket. "
        },
        {
            "author": "Joel Bernstein",
            "id": "comment-14030147",
            "date": "2014-06-13T01:36:12+0000",
            "content": "Closing this issue as it is superseded by SOLR-6150 "
        }
    ]
}