{
    "id": "SOLR-7994",
    "title": "Add suggest \"playground\" to Angular admin UI",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.5"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Let's add a Suggester \"playground\" to the Angular core admin UI - allowing the configured suggesters to display their results given some text",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-31T19:52:54+0000",
            "author": "Upayavira",
            "content": "Can you show some sample requests? Do you have any ideas yet for a particular UI?\n\nDo these results come out of a standard query, or a different one? I've conceived of a structured UI for search results in general - it would attempt to display search results more as a normal search UI, would have feature specific ways to display explains output, debug queries, perhaps a facet output UI - basically, anything you can get out of a query should have a custom UI to view it. Wondering whether this broader view could contain your need? ",
            "id": "comment-14723942"
        },
        {
            "date": "2015-08-31T20:52:44+0000",
            "author": "Erik Hatcher",
            "content": "Requests would be to a handler that has a suggest component wired into it: https://cwiki.apache.org/confluence/display/solr/Suggester#Suggester-AddingtheSuggestRequestHandler\n\nI think there'll be a need to provide some way to introspect the registered suggesters or handlers that have a suggest component included.\n\nAs for this fitting into a broader \"structured UI for search results\" - definitely suggest would fit into that.  It's hard to do these things in a general purpose way though, so I'm looking forward to seeing how you wrangle this challenge.  (perhaps tangential, but I'd love to see wt=velocity incorporated into the mix.  It's got power that no Ajax request to Solr can accomplish because it has inside-Solr context that can be leveraged.  It can act either as the entire driver of a UI or as an Ajaxed in panel of sorts) ",
            "id": "comment-14724018"
        }
    ]
}