{
    "id": "SOLR-8614",
    "title": "Add simple SolrClient.setUseXmlFormat",
    "details": {
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "It'd be nice if there was a SolrClient one-liner to set all communication (req & rsp) to be XML or binary as a toggle, without having to know which classes to the parsing/writing as that's really an implementation/internal detail. It's nice to make such a flag configurable in the client's software to ease upgrades.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-01-28T15:14:27+0000",
            "author": "Yonik Seeley",
            "content": "When/why would we recommend that a user use XML instead of the default binary? ",
            "id": "comment-15121658"
        },
        {
            "date": "2016-01-28T15:17:21+0000",
            "author": "David Smiley",
            "content": "Should the binary format change (it has in the past), the toggle enables a compatibility mode to be use for temporary purposes during an upgrade.  You might start an upgrade by first toggling this to XML in the client, then upgrade the server, then upgrade the client.  I recall doing this a year and a half ago for someone. ",
            "id": "comment-15121668"
        },
        {
            "date": "2016-01-28T15:22:46+0000",
            "author": "Yonik Seeley",
            "content": "Almost feels like it should be an env variable so one could do it w/o any code changes. ",
            "id": "comment-15121681"
        },
        {
            "date": "2016-01-28T15:23:35+0000",
            "author": "Mark Miller",
            "content": "I cannot remember for sure, but I think for SolrCloud, the leader to replica communication has to be binary because it's the only one currently expressive enough to match a Solr command object (though I had to make it so, so it's not impossible for other formats). ",
            "id": "comment-15121682"
        },
        {
            "date": "2016-01-28T15:29:17+0000",
            "author": "David Smiley",
            "content": "Almost feels like it should be an env variable so one could do it w/o any code changes.\n\nGreat idea!\n\nRE leader/replica communication:  Okay; interesting.  I don't recall if the upgrade was to use a completely different Solr cluster – I think so.  That would make this feature useful but if the Solr cluster is to be upgraded in a rolling fashion in-place, then I can appreciate this toggle may be of no use.  \n\nIf it's felt this would be useless due to stability of the binary format then we can just close as won't-fix.  I have no strong feelings.  I didn't intend to do this work; it was mostly an idea I've had that's appropriate for a \"newdev\" label. ",
            "id": "comment-15121692"
        },
        {
            "date": "2016-01-28T15:30:55+0000",
            "author": "Yonik Seeley",
            "content": "Really, we shouldn't be making back-incompat changes like that though (I think the move from CESU8 to UTF8 was a mistake - it cost more CPU/memory and broke back compat).  It will also break any kind of rolling upgrade of a cluster. ",
            "id": "comment-15121697"
        },
        {
            "date": "2016-01-28T15:31:01+0000",
            "author": "Jan Høydahl",
            "content": "I also had to make a flag in a customer's application to fallback to xml during upgrade from 1.4 to 3.x. An env.variable on the client side would have been a nice solution there for allowing server upgrade without code upgrade on all clients.  ",
            "id": "comment-15121698"
        },
        {
            "date": "2016-01-28T15:36:14+0000",
            "author": "Mark Miller",
            "content": "Should the binary format change (it has in the past)\nstability of the binary format\n\nWell, you never know, but that last time it broke we added some tests to try and keep us honest.\n\nAnyway, it at least seems appealing to be able to to choose a supported format like this to me. ",
            "id": "comment-15121717"
        },
        {
            "date": "2016-01-29T11:35:34+0000",
            "author": "Shashank Tyagi",
            "content": "I can work on this.\nHow can I assign it myself? ",
            "id": "comment-15123368"
        },
        {
            "date": "2016-01-29T16:49:12+0000",
            "author": "David Smiley",
            "content": "Don't worry about assigning it; that's for committers.  It was good to say you wish to work on it so as to deconflict with others possibly doing so.  Thanks for volunteering. ",
            "id": "comment-15123738"
        },
        {
            "date": "2016-02-02T14:30:30+0000",
            "author": "Shashank Tyagi",
            "content": "Even though  if developer sets communication in SolrClient still there is chance to that calling code can send requestwriter in request which might be not necessarily appropriate according to format. ",
            "id": "comment-15128317"
        }
    ]
}