{
    "id": "SOLR-3750",
    "title": "On session expiration, we should explicitly wait some time before running the leader sync process so that we are sure every node participates.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "We should wait until all the known nodes are part of the election, or X amount of time if that does not happen (when a node or more does not come back for whatever reason).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13445007",
            "date": "2012-08-30T15:17:52+0000",
            "content": "I think initially we should wait for the known amount of replicas to show up, else a set amount of time (N).\n\nWe need something like this for a start, but it seems it could be improved. The ugly case seems to be when 2 or more nodes go down and are not coming back anytime soon...updates would then be down for N amount of time. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13445011",
            "date": "2012-08-30T15:19:31+0000",
            "content": "To clarify, the above comment is more in regards to the leader goes down case. In the connectionloss case, usually everyone should come right back in the normal case. When a leader goes down, we can look for numReplicas-1 - but if 2 or more nodes go down, we would have to wait N amount of time. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13445225",
            "date": "2012-08-30T19:33:30+0000",
            "content": "I'd like to come up with a goo N to wait - initially I'm going with 5 min. Suggestions? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13445241",
            "date": "2012-08-30T19:48:03+0000",
            "content": "I suppose one way to kick the can is to make this configurable - which % of replicas to wait and see up before leader election, and how long to wait for that many to show up. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13445253",
            "date": "2012-08-30T20:03:13+0000",
            "content": "To add further - I don't think this is strictly necessary right now - due to the fact that we require updates to hit all replicas before returning success or failure. It will become a nice option once we let you be less strict with that though. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13447072",
            "date": "2012-09-03T01:02:31+0000",
            "content": "Because this behavior is not currently strictly necessary, and sometimes not ideal, I'm thinking I will default it to false and allow it to be configured to on along with the amount of time to wait - at least initially.\n\nLater, when we allow you to return before every replica has an update, this could probably be automatically enabled? Or in the case you could choose that behavior per update, doc'd that you should enable it.\n\nI think it should be an option now because it also can offer some protections against more esoteric cases - eg when starting the cluster, you start using a really old node and start that node first and it becomes leader...you just want to be willing to live with some of the esoteric downsides of enabling it as as well. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653790",
            "date": "2013-05-10T10:33:00+0000",
            "content": "Closed after release. "
        }
    ]
}