{
    "id": "SOLR-1834",
    "title": "Document level security",
    "details": {
        "affect_versions": "1.4",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SearchComponents - other"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Attached to this issue is a patch that includes a framework for enabling document level security in Solr as a search component. I did this as a Master thesis project at Findwise in Stockholm and Findwise has now decided to contribute it back to the community. The component was developed in spring 2009 and has been in use at a customer since autumn the same year.\n\nThere is a simple demo application up at http://demo.findwise.se:8880/SolrSecurity/ which also explains more about the component and how to set it up.",
    "attachments": {
        "SOLR-1834.patch": "https://issues.apache.org/jira/secure/attachment/12439280/SOLR-1834.patch",
        "SOLR-1834-with-LCF.patch": "https://issues.apache.org/jira/secure/attachment/12444400/SOLR-1834-with-LCF.patch",
        "html.rar": "https://issues.apache.org/jira/secure/attachment/12439648/html.rar"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12848946",
            "date": "2010-03-23T22:47:59+0000",
            "content": "Anders: I only had a few moments to skim your patch, but it seems like a very cool feature, thank you (and Findwise) for contributing this.\n\nOne thing i noticed was that there didn't seem to be a lot of documentation (javadoc or otherwise) ... i see that the demo application you cited seems to have some good overview documentation on how all the pieces fit together, and what configuration should look like – if your intention is that this documentation can also be used by Solr, would you mind attaching it to the Jira issue (as HTML, or in javadoc comments on the java files themselves) with the \"Grant ... Apache License ...\" box checked off so there's a clear audit log that the documentation can be reproduced within Solr? "
        },
        {
            "author": "Anders Rask",
            "id": "comment-12849140",
            "date": "2010-03-24T10:33:52+0000",
            "content": "HTML page describing the component and how to use it "
        },
        {
            "author": "Anders Rask",
            "id": "comment-12849141",
            "date": "2010-03-24T10:37:50+0000",
            "content": "Thank you for looking at the patch.\n\nI'm aware that the component lacks javadoc and this will need to be corrected in the future. But for now I took the information from the demo site and put it in the html.rar file attached. "
        },
        {
            "author": "Andreas Hubold",
            "id": "comment-12855884",
            "date": "2010-04-12T08:26:49+0000",
            "content": "The SecurityComponent from the patch wraps the parsed query in a FilteredQuery. \nWould it make sense to add the filter to ResponseBuilder#getFilters instead to utilize Solr's filterCache? "
        },
        {
            "author": "Anders Rask",
            "id": "comment-12864498",
            "date": "2010-05-05T20:49:53+0000",
            "content": "Hi Andreas,\n\nSorry for my late reply.\n\nI haven't looked in to the difference between using the ResponseBuilder#getFilters and using filter's in a normal query. Are there any functional differences between the two ways other than that one of them utilizes Solr's filterCache and the other doesn't? "
        },
        {
            "author": "Karl Wright",
            "id": "comment-12866150",
            "date": "2010-05-11T14:06:59+0000",
            "content": "Hi Anders,\nI spent an hour or so refreshing my memory as to SOLR-1834 this morning.\nIt appears to me that SOLR-1834 delegates specific knowledge of all document access tokens to SOLR-1834 repository plugins, and similarly delegates knowledge of user access tokens to security provider plugins.  The only thing that 1834 does not delegate is the repository-type attribute.  Thus, anything that plays along with 1834 must include this attribute.\n\nIt seems possible to develop SOLR-1834 repository and security provider plugins that would work explicitly with LCF - which basically take the code currently in ticket SOLR-1895 and just apply the appropriate class structure.  The only other necessary change would have to be to be sure documents from LCF were indexed with the repository-type attribute, and that is already easily done by adding an appropriate argument using the configuration UI.  This would yield an LCF \"repository\" and a corresponding LCF \"security provider\".\n\nIs this something you would like to pursue?  The advantage I see is that folks who want late binding for some kinds of documents can get that in conjunction with LCF, using this setup, although configuration would be more complex.  I could readily contribute this, but it's not clear how exactly to contribute a patch to a patch... "
        },
        {
            "author": "Karl Wright",
            "id": "comment-12867135",
            "date": "2010-05-13T13:56:03+0000",
            "content": "I've attached what I think to be the correct code to structure the LCF security support as two plugins into this framework.  The first is a security provider, the second is a model.  In order to use this with LCF, you still need to set up a schema consistent with SOLR-1895, and you would also need the schema addition that this framework provides.\n\nThe SOLR-1834-with-LCF.patch file is an SVN diff against Solr trunk.  I needed to make a number of changes to build.xml to get it to work in the current trunk environment.  Also, I needed to comment out the @override commands for some reason - but still, everything looked good. "
        },
        {
            "author": "Ravish Bhagdev",
            "id": "comment-13097108",
            "date": "2011-09-05T10:17:11+0000",
            "content": "are there any plans for adding this or other document level or other search security solutions into solr? This requirement is quite critical for most enterprise search apps I would have thought?  Has this been discussed in detail elsewhere? "
        },
        {
            "author": "Sumit Sen",
            "id": "comment-13180923",
            "date": "2012-01-05T23:04:58+0000",
            "content": "I have added SOLR-1834 patch codes under contrib\\security folder in Solr 3.4 distribution including build.xml. I am trying to build (ant dist) and apparently it is keep on running with no error.  Is there anything I am missing. I am new to adding Solr patch stuff. Thanks. "
        }
    ]
}