{
    "id": "SOLR-7548",
    "title": "CloudSolrStream Limits Max Results to rows Param",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "The CloudSolrStream stream class accepts a set of params to be passed to the standard query handler. If the provided params doesn't include \"rows=N\" then maximum # of records returned by this stream is the configured default rows value (generally 10, but perhaps more). \n\nAs CloudSolrStream would generally be the first part of a larger set of stream expressions it seems counterintuitive to limit the first set by this value.\n\nThis ticket is to address this so that either we set pass a param of rows=MAX where MAX is the max value we can pass (max int or max long I suppose) or make it so that default value is ignored when in a streaming context.\n\nExample:\nImagine we have a collection \"people\" with 90 documents in it\n\nThe following query would return at most 10 documents (assuming 10 is the default)\n\nsearch(people,q=*:*,fl=\"id,name_s,gender_s,nick_s\",sort=\"name_s desc\")\n\n\n\nThe following query would return all documents\n\nsearch(people,q=*:*,fl=\"id,name_s,gender_s,nick_s\",sort=\"name_s desc\",rows=100)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-05-15T02:10:11+0000",
            "author": "Joel Bernstein",
            "content": "The Streaming API really was designed to be paired with the /export handler, which always returns all rows. \n\nWe should consider making the /export handler the default handler. ",
            "id": "comment-14544785"
        },
        {
            "date": "2015-05-15T13:24:57+0000",
            "author": "Dennis Gove",
            "content": "That makes sense. At the moment how would I make that change to use export? Is it in the solrconfig.xml or as part of the incoming query? ",
            "id": "comment-14545472"
        },
        {
            "date": "2015-05-15T16:00:33+0000",
            "author": "Joel Bernstein",
            "content": "You would add the parameter: qt=/export to the query. We can hardcode that into the SolrStream if we want to make that the default.\n ",
            "id": "comment-14545706"
        },
        {
            "date": "2015-05-15T16:07:17+0000",
            "author": "Yonik Seeley",
            "content": "Longer term I still want to make /export obsolete.  It's a performance optimization that we should be able to fold into the normal handler.\n\nAt the moment how would I make that change to use export?\n\nEither use the /export URL, or a query parameter of qt=\"/export\" ",
            "id": "comment-14545722"
        },
        {
            "date": "2015-05-15T16:47:43+0000",
            "author": "Joel Bernstein",
            "content": "You'll find that \"/export\" is very picky about what it allows compared to the regular handler. No scores are returned and all sorts and fl fields must be a DocValues fields. \n\nThis ticket (SOLR-7472) also needs to be committed for 5.2, which deals with a specific error that isn't logged from the /export handler. ",
            "id": "comment-14545772"
        },
        {
            "date": "2015-05-15T17:18:04+0000",
            "author": "Joel Bernstein",
            "content": "One of the main reasons to not make the /export handler the default is that it is a little painful to get started with because it is so picky.\n\nSo, I think most people would want to prototype some Streaming Expressions with a small amount of data using the default handler. Then go into production with /export handler on the larger data set.\n\nAs Yonik mentions, ideally we could do everything from the default handler, but the \"/export\" handler enforces a bunch of rules that enable it export and sort really large data sets. If we can find a way to loosen those rules and still handle the export of large data sets that would be great.\n\nWe could also have a flag in the default handler to enforce certain rules when run in \"streaming\" mode. There are still other technical hurdles to getting the default handler to behave like the /export handler though. ",
            "id": "comment-14545810"
        }
    ]
}