{
    "id": "SOLR-10103",
    "title": "Admin UI -- display thread statistics in the dashboard",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The admin UI should display any available thread statistics in the dashboard.  The most important number is probably active threads, but if other stats like total threads are available, they could be displayed too.\n\nAlternatively, the numbers could be shown on the thread dump tab.  I'm surprised they aren't there now.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-02-08T00:45:08+0000",
            "content": "What's the use case? What does knowing it is 20 vs 40 threads give you? ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15857126"
        },
        {
            "date": "2017-02-08T09:40:00+0000",
            "content": "Somebody on IRC was concerned that a 14GB value in the VIRT memory column on \"top\" meant that Solr was starting a lot of threads.  I let them know that the size of their indexes would typically contribute to this column, but I couldn't think of any way to assure them that their thread count was probably not out of control.  I did finally remember the thread dump, but this doesn't count the threads even though it does display them all. ",
            "author": "Shawn Heisey",
            "id": "comment-15857725"
        },
        {
            "date": "2017-02-08T09:41:03+0000",
            "content": "Which brings up something else that would be potentially useful if it is available – a summary of the amount of virtual memory used for MMAP. ",
            "author": "Shawn Heisey",
            "id": "comment-15857728"
        },
        {
            "date": "2017-02-08T18:47:55+0000",
            "content": "Detailed information about Solr's operation and environment that is readily available to the code (easy/fast to obtain) really ought to be available.  Perhaps it might go in a far corner of the admin UI so things that are considered critical are not lost in the noise.\n\nFor those of us that provide public support for Solr, some of the more arcane details about a user's environment can provide insight into unusual problems. ",
            "author": "Shawn Heisey",
            "id": "comment-15858381"
        }
    ]
}