{
    "id": "SOLR-6614",
    "title": "SolrCloud graph viz truncates port designation",
    "details": {
        "components": [
            "Admin UI",
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.1",
        "status": "Closed",
        "resolution": "Cannot Reproduce",
        "priority": "Minor"
    },
    "description": "I believe this is a regression but I didn't see anything jump out at me from the history on cloud.js.  The port designation for shards is truncated.  I am pretty sure the port designation only appears if you have multiple JVMs on the same hostname in your SolrCloud.\n\nHere is a visual depiction of the problem: http://monosnap.com/image/WzETqptfhcuDGKXjpJPR854lIzriyI\n\nI have a very minor patch which addresses this as well as an issue with the legend being overlaid on top of shard designations.  It's pretty simple, but I generally only have the use case of dozens or hundreds of shards so I'm not sure how this looks in other situations.",
    "attachments": {
        "Screen Shot 2014-11-14 at 3.43.39 PM.png": "https://issues.apache.org/jira/secure/attachment/12681544/Screen%20Shot%202014-11-14%20at%203.43.39%20PM.png",
        "SOLR-6614.patch": "https://issues.apache.org/jira/secure/attachment/12673901/SOLR-6614.patch",
        "cluster_state1.json": "https://issues.apache.org/jira/secure/attachment/12681628/cluster_state1.json",
        "Screen Shot 2014-11-14 at 3.44.05 PM.png": "https://issues.apache.org/jira/secure/attachment/12681546/Screen%20Shot%202014-11-14%20at%203.44.05%20PM.png",
        "Screen Shot 2014-11-14 at 3.44.38 PM.png": "https://issues.apache.org/jira/secure/attachment/12681547/Screen%20Shot%202014-11-14%20at%203.44.38%20PM.png",
        "cluster_state2.json": "https://issues.apache.org/jira/secure/attachment/12681629/cluster_state2.json",
        "Screen Shot 2014-11-14 at 3.43.53 PM.png": "https://issues.apache.org/jira/secure/attachment/12681545/Screen%20Shot%202014-11-14%20at%203.43.53%20PM.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-10-09T14:46:28+0000",
            "author": "Ralph Tice",
            "content": "changes translate(100,0) to translate(-100,0) on the outermost g element in the graph viz svg ",
            "id": "comment-14165192"
        },
        {
            "date": "2014-11-14T14:42:49+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "as i've explained to Ralph Tice yesterday on the conference party, i don't believe that it's an explicit problem with the port number .. to me it looks more like the svg-drawing area just ends - and the content doesn't completely fit.\n\n-100 might be a bit to much, since that really moves the area out of the content-area (if looking at html-elements), Ralph for me, reducing the first param to zero works fine as well, can you confirm that?\n\n\n-      .attr( 'transform', 'translate(100, 0)' );\n+      .attr( 'transform', 'translate(0, 0)' );\n\n\nthe underlying problem is .. a tree in d3.js uses one top-node, which doesn't work in our case .. so i'm faking here a bit by leaving that blank. looking at the rendered source-code you can see classes like lvl-1 which indicate the invisible tree-nodes. they are taking up a bit space, which is why reducing the position from 100 to 0 still leaves some white space on the left side. but avoids that elements are actually overlapping - which might lead to problems like \"i can see button xy, but i can't click on it\" which can happens in some browsers in such a case. ",
            "id": "comment-14212315"
        },
        {
            "date": "2014-11-14T14:45:52+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "sometimes a picture can say more than a bunch of words .. at least for me, right now ;> attached screenshots should give an explanation what is happening here. they are btw done in chrome, on the bottom you see the chrome developer tools - just in case you're wondering. ",
            "id": "comment-14212320"
        },
        {
            "date": "2014-11-14T22:24:35+0000",
            "author": "Ralph Tice",
            "content": "Hi Stefan!\n\nPart of the trouble is that I was hacking around in Dev Tools in browser to construct this \"patch\", and I have no real context for what's an acceptable level of quality when it comes to the underlying SVG structures.\n\nI've attached some cluster state examples, and since it occurred to me that it might be a combination of length of host name and number of shards I maintained the same number of characters when sanitizing the larger of the two of these cluster state examples.\n\nThe smaller cluster state is composite routing and the larger is implicit, just trying to provide as much variety as possible. ",
            "id": "comment-14212959"
        },
        {
            "date": "2016-08-09T14:38:30+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I cannot reproduce this with the standard cloud example on the latest Admin UI.\n\nCan anybody with large set of collections see this issue (should be obvious on the cloud screen)? If not, the case can be probably closed. ",
            "id": "comment-15413625"
        },
        {
            "date": "2016-08-15T12:59:33+0000",
            "author": "Alexandre Rafalovitch",
            "content": "If the issue still happens with the new UI and recent browsers, we can reopen this case or - probably better - open a new one with more specific details. ",
            "id": "comment-15420941"
        }
    ]
}