{
    "id": "SOLR-7179",
    "title": "JettySolrRunner should not use system properties to pass configuration",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "JettySolrRunner sets a bunch of system properties to pass configuration down to its SolrDispatchFilter and CoreContainer.  This means that we can't launch multiple runners at the same time - sys props must be set up, the runner launched, we wait for solr to start up, then sys props must be changed before the next runner can be instantiated.\n\nInstead we should be able to pass the relevant properties down to SolrDispatchFilter via the servlet context.  This will allow MiniSolrCloudCluster and the various ZK test cases to start and stop their jetties in parallel, which will speed up individual tests (and with luck speed up the test suite overall as well).",
    "attachments": {
        "SOLR-7179.patch": "https://issues.apache.org/jira/secure/attachment/12701632/SOLR-7179.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-28T22:17:27+0000",
            "author": "Alan Woodward",
            "content": "Patch.\n\nSolrDispatchFilter checks its servlet context for solr home and node properties on init, defaulting to the usual ways of getting these from sys props if the attributes aren't set.  JettySolrRunner takes a Properties object as a construction parameter, and the various setXXX methods are deprecated.  These were trappy anyway, as they only worked if you had a solr.xml or core.properties set to use specific sysprops. ",
            "id": "comment-14341805"
        },
        {
            "date": "2015-02-28T23:29:43+0000",
            "author": "Alan Woodward",
            "content": "This patch fixes some test failures due to some odd jetty race conditions ",
            "id": "comment-14341832"
        },
        {
            "date": "2015-03-01T04:48:26+0000",
            "author": "Mark Miller",
            "content": "Yeah, being able to launch and stop jetties in parallel will be a big savings. I started down this path once, but ran into some crap and moved onto other things. ",
            "id": "comment-14341930"
        },
        {
            "date": "2015-03-03T10:45:48+0000",
            "author": "Alan Woodward",
            "content": "Still chasing down some errors due to various tests setting coreRootDirectory in system properties.  Will hopefully be able to commit this in the next couple of days though. ",
            "id": "comment-14344911"
        },
        {
            "date": "2015-03-05T09:52:28+0000",
            "author": "Alan Woodward",
            "content": "Final patch.  Some funkiness introduced due to SOLR-7171, and we should look at reducing the multiplicity of startJetty() commands in the tests (or better, to start migrating tests to use MiniSolrCloudCluster).  But that's for later. ",
            "id": "comment-14348504"
        },
        {
            "date": "2015-03-05T09:56:39+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1664292 from Alan Woodward in branch 'dev/trunk'\n[ https://svn.apache.org/r1664292 ]\n\nSOLR-7179: Stop using sysprops to configure test jettys ",
            "id": "comment-14348507"
        },
        {
            "date": "2015-03-05T10:34:31+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1664296 from Alan Woodward in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1664296 ]\n\nSOLR-7179: Stop using sysprops to configure test jettys ",
            "id": "comment-14348551"
        },
        {
            "date": "2015-03-05T13:32:02+0000",
            "author": "Noble Paul",
            "content": "I came across a problem of not being able to use System.getProperty() in a static context of a class. If it was the only test , it would pass , but if I run tests in a batch (means the static is initialized already) it fails ",
            "id": "comment-14348737"
        },
        {
            "date": "2015-03-05T14:28:43+0000",
            "author": "Alan Woodward",
            "content": "Not sure I follow, Noble.  This change means that you shouldn't use system properties for solr config. ",
            "id": "comment-14348774"
        },
        {
            "date": "2015-03-05T15:12:26+0000",
            "author": "Noble Paul",
            "content": "I have a property called enable.runtime.lib\nI used initialized it as follows\n\npublic static final boolean enableRuntimeLib = System.getProperty(\"enable.runtime.lib\",\"false\")\n\nAnd I do a Sytem.setProperty(\"enable.runtime.lib\",\"true\") in the @BeforeClass method of my test. The test would pass if that is the only test\n\nIf I run the entire set of tests . This fails because the static variable is already initialized. I guess the classes are pre-initialized by the time the testcase is reached  ",
            "id": "comment-14348847"
        }
    ]
}