{
    "id": "SOLR-124",
    "title": "use NewIndexModifier, LUCENE-565",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "LUCENE-565 adds extension points to the IndexWriter, and adds delete-by-term functionality.\nWe should probably take advantage of this (when available) in our UpdateHandler (a new one, or modify DU2?)\nand perhaps implement a more efficient deleteByQuery.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12470063",
            "date": "2007-02-04T16:10:12+0000",
            "content": "LUCEUE-565 has been committed, but Solr doesn't have that version yet.\nLucene 2.1 is right around the corner though. "
        },
        {
            "author": "Tim Patton",
            "id": "comment-12481163",
            "date": "2007-03-15T14:21:45+0000",
            "content": "I see that Lucene 2.1 is out and the latest DL of Solr that I got had the jars.  Will this patch be added in soon, or is it available somewhere now? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12481238",
            "date": "2007-03-15T17:33:10+0000",
            "content": "no patch exists yet ... this issue was opened to track that it should be done at some point.\n\ni believe it will be a somewhat significant change, but i'm not much of an expert on the update internals. "
        },
        {
            "author": "Tim Patton",
            "id": "comment-12481247",
            "date": "2007-03-15T17:39:59+0000",
            "content": "Oh I read \"LUCEUE-565 has been committed\" as meaning Yonik had committed the code to some branch or had at least checked the code worked but was waiting to commit it in to the trunk.  \n\nIf one were to work on this, would it be easier to work from DU2 or the original DU?  It looks like DU2 duplicates a lot of features of the new IndexWriter and DU would be a more straitforward starting point. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12481264",
            "date": "2007-03-15T18:06:52+0000",
            "content": "DUH may be simpler, but DUH2 has also been carefully modified to safely support multithreaded indexing and autocommitting.\n\nDoes anyone have a feeling on whether LUCENE-565 will improve performance?  Or is it likely to be mostly a code cleansliness improvement? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12482414",
            "date": "2007-03-20T15:35:34+0000",
            "content": "> Does anyone have a feeling on whether LUCENE-565 will improve performance?\n\nProbably not much, if at all.  Deletions happen after a segment flush, which is slightly less efficient (more indexreaders that need to be opened), but does get deletions in the index faster (meaning they are more likely to be \"squeezed\" out by a subsequent segment merge).\n\nOne small advantage to LUCENE-565 is that overwriting is atomic... you can't crash and see duplicates.\n\nThe patch has been changed around multiple times, and it would now be necessary to include a lucene package in solr to get access to package-protected stuff that would allow efficient delete-by-query. "
        },
        {
            "author": "Tim Patton",
            "id": "comment-12483194",
            "date": "2007-03-22T15:34:17+0000",
            "content": "Which package protected parts of lucene would need to be accessed?  Perhaps a patch to lucene could be submitted to support dleete by query (or at least all easy support of delete by query). "
        },
        {
            "author": "Koji Sekiguchi",
            "id": "comment-12599363",
            "date": "2008-05-23T13:35:32+0000",
            "content": "I could be wrong but is this duplicate of SOLR-559? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12599369",
            "date": "2008-05-23T13:55:27+0000",
            "content": "Yes it is mostly a duplicate (I did a search before I opened 559, but didn't turn up this one).\n\nI had been planning on having to implement our own deleteByQuery efficiently w/ certain IndexWriter extension points, but Lucene now has deleteByQuery in trunk, so we should just wait for that. "
        }
    ]
}