{
    "id": "SOLR-12390",
    "title": "Website search doesn't work for simple searches",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "6.6,                                            7.1",
        "resolution": "Duplicate",
        "status": "Closed"
    },
    "description": "Simple searches aren't working well in the website.\n\nI've tested it on 6_6 and 7_1 docs version.\n\nBecause the purpose of Solr is to empower better search quality, I see this ticket as kinda important.\n\nHere some examples that I've got no results:\n\nngram\n\nanalysers (analy*z*ers work)\n\nspellcheck\n\nand probably much more.\n\n \n\nNow where I'm creating this ticket, I've paid more attention I saw the placeholder \"Page title lookup\", but even though I think this is not well seen AND not good for us developers to find easily the documentation part we want.\n\nIf I could help with something please let me know.\n\nThank you",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-05-23T13:23:36+0000",
            "content": "The first thing in the description is:  \"Simple searches aren't working well in the website.\"\n\nWhat is \"the website?\"  This might be completely clear to you, but I have no idea what you're referring to.\n\nWhether a specific search is going to work or not depends on the data in your index and how Solr is configured, especially the schema.  Designing a schema that achieves the search results you want is one of the most time-consuming parts of setting up Solr. ",
            "author": "Shawn Heisey",
            "id": "comment-16487237"
        },
        {
            "date": "2018-05-23T13:26:30+0000",
            "content": "This issue reads to me like a support request, not a bug report.  The Solr project does not use Jira as a support portal.  The mailing list and IRC channel are the correct places for support.\n\nhttp://lucene.apache.org/solr/community.html#mailing-lists-irc ",
            "author": "Shawn Heisey",
            "id": "comment-16487243"
        },
        {
            "date": "2018-05-23T13:47:23+0000",
            "content": "Shawn Heisey I was talking about this website https://lucene.apache.org/solr/guide/7_1/ am I creating a ticket for the wrong project?\n\nAs I selected the \"website\" component I expected to be clear. ",
            "author": "Jean Silva",
            "id": "comment-16487275"
        },
        {
            "date": "2018-05-23T14:01:53+0000",
            "content": "The search box on the online reference guide only searches page titles.  It is not a comprehensive keyword search of the entire guide.  We are aware of the irony of not having comprehensive search for the documentation of a search server.  At this time we don't have a solution, but we very much want to find one.\n\nCassandra Targett, do we already have a ticket for search functionality in the online guide?  If so, this ticket would need to be closed as a duplicate.\n\nIf you want to do comprehensive searches on the reference guide, download the PDF version.  The PDF version is the official documentation release. ",
            "author": "Shawn Heisey",
            "id": "comment-16487297"
        },
        {
            "date": "2018-05-23T14:12:21+0000",
            "content": "This is basically a duplicate of SOLR-10299. ",
            "author": "Cassandra Targett",
            "id": "comment-16487320"
        },
        {
            "date": "2018-05-23T14:51:04+0000",
            "content": "Is there a way I could contribute? I assume this is the repo, correct? https://github.com/apache/lucene-solr/tree/master/solr/solr-ref-guide\n\n \n\nThanks ",
            "author": "Jean Silva",
            "id": "comment-16487404"
        },
        {
            "date": "2018-05-23T16:52:56+0000",
            "content": "That is the source that generates the documentation both the PDF version and the HTML version that you can get to on the Solr website.  Building the guide creates a very simple index of page titles.  The search box on the generated website searches that index.\n\nIf you want to attempt something more capable, feel free to check out the source and contribute a patch.\n\nhttps://wiki.apache.org/solr/HowToContribute\n\nSOLR-10299 discusses some ideas and provides a link where one of them has been implemented.\n\nOne roadblock to \"real\" search capability is that the reference guide is static content, served by a fairly basic webserver.  Providing real search capability typically requires special infrastructure beyond that.  Getting special resources from Apache INFRA usually requires significant justification. ",
            "author": "Shawn Heisey",
            "id": "comment-16487629"
        },
        {
            "date": "2018-05-23T17:37:20+0000",
            "content": "One thing to do is go to the \"other formats\" drop-down at the top and then \"archived PDFs\" and download the entire PDF file for the reference guide and search that.\n ",
            "author": "Erick Erickson",
            "id": "comment-16487726"
        }
    ]
}