{
    "id": "SOLR-5930",
    "title": "Add Threshold counts capability to PingRequestHandler",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "PingRequestHandler in solrconfig.xml for doing threshold checks say min no of documents to be presented in the index. we can specify the : in ping query but then if that returns 0 documents, we should be able to say it's not healthy.\n\nextension: (Shawn has described a work around - check the comments)\noptions to configure  PingRequestHandler for the entire solr instance (in multi-core environment). all the cores should be healthy in order to say the instance is healthy.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13950947",
            "date": "2014-03-28T16:07:33+0000",
            "content": "I filed an issue once upon a time for a distributed PingRequestHandler.  I ended up not needing it, though.  Here's what I do right now, which works really well:\n\nMy distributed index uses what I call a broker core.  It's a core with the same schema and mostly the same config as the other cores, but an empty index.  All of the search handler definitions in solrconfig.xml include the shards parameter.  With this, the client doesn't need to know that the index is distributed – it just makes a request to what it thinks is a single index.\n\nBecause the ping handler just uses one of the local search handlers, it automatically does the right thing, whether it's a broker core or a core with an index.  The load balancer health check is wired to the broker cores on each host, so it will only send queries when the entire index is working. "
        },
        {
            "author": "Kranti Parisa",
            "id": "comment-13950952",
            "date": "2014-03-28T16:11:15+0000",
            "content": "So this is about checking all cores. but we still need to figure out a way for threshold counts (min no of documents) right? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13950989",
            "date": "2014-03-28T16:33:46+0000",
            "content": "So this is about checking all cores. but we still need to figure out a way for threshold counts (min no of documents) right?\n\nExactly. "
        },
        {
            "author": "Kranti Parisa",
            "id": "comment-13950993",
            "date": "2014-03-28T16:35:12+0000",
            "content": "Sounds good.  "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13954881",
            "date": "2014-03-31T00:26:22+0000",
            "content": "all the cores should be healthy in order to say the instance is healthy.all the cores should be healthy in order to say the instance is healthy.\n\nI'm not sure this is exactly what we want.  A particular Solr instance may be handling several indexes that have no connection with each other.  One of the cores related to one index may be disabled so that it can be rebuild after config changes, but the rest of the cores on that machine are perfectly functional. "
        }
    ]
}