{
    "id": "SOLR-11868",
    "title": "CloudSolrClient.setIdField is confusing, it's really the routing field. Should be deprecated.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "IIUC idField has nothing to do with the <uniqueKey> field. It's really\nthe field used to route documents. Agreed, this is often the \"id\"\nfield, but still....\n\nIn fact, over in UpdateReqeust.getRoutes(), it's passed as the \"id\"\nfield to router.getTargetSlice() and just works, even though\ngetTargetSlice is clearly designed to route on a field other than the\n<uniqueKey> if we didn't just pass null as the \"route\" param.\n\nThe confusing bit is that if I have a route field defined for my\ncollection and want to use CloudSolrClient I have to figure out that I\nneed to use the setIdField method to use that field for routing.\n\n \n\nWe should deprecate setIdField and refactor how this is used (i.e. getRoutes). Need to beef up tests too I suspect.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-01-17T22:52:23+0000",
            "content": "Possibly related to these two JIRAs. David's comment that testing the route field is rarely done is worrisome.\n\n \n\nIt's at least worth looking at those two JIRAs for hints, but I suspect they're tangentially related at best, and probably this Jira can be fixed independently of those other two. ",
            "author": "Erick Erickson",
            "id": "comment-16329651"
        },
        {
            "date": "2018-02-15T21:28:56+0000",
            "content": "If we fix/change the \"setIdField\" method it's worth checking this at the same time. ",
            "author": "Erick Erickson",
            "id": "comment-16366278"
        },
        {
            "date": "2018-10-25T02:45:42+0000",
            "content": "I wonder if we even need this setting if cluster state has the route field?  If it doesn't, it's the uniqueKey.  Separately, we could standardize on \"id\" for uniqueKey and/or have the router field default in cluster state on creation to be what the uniqueKey is. ",
            "author": "David Smiley",
            "id": "comment-16663117"
        },
        {
            "date": "2018-10-25T04:34:09+0000",
            "content": "Actually, I've long thought that allowing the <uniqueKey> to be something besides \"id\" is more trouble than it's  worth, so AFAIC, standardizing would be fine. ",
            "author": "Erick Erickson",
            "id": "comment-16663225"
        }
    ]
}