{
    "id": "SOLR-8641",
    "title": "Core Deleted After Failed Index Fetch When Replication Disabled",
    "details": {
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I am getting occasional Index Fetch Failures (due to server overloading I suspect). This is appearing in my log file as\n\nMaster at: http://MOTOSOLR01:9000/solr/ShowcaseData is not available. Index fetch failed. Exception: Server refused connection at: http://MOTOSOLR01:9000/solr/ShowcaseData\n\nAt the point of the failure the master version of the core has replication disabled (but still contains data) and it appears that on the next replication cycle that the slave version of the core is being emptied. Once replication is enabled everything works as expected.\n\nHaving looked at the source code I suspect that lines 311-327 in indexfetcher.java are at fault. What I think is happening is that the failed IndexFetch is setting forcereplication to true, and this cause a forced delete of the core before reloading the core (which then doesn't happen as replication is disabled)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-11-04T17:30:50+0000",
            "author": "James Strassburg",
            "content": "I agree that this is a bug. We recently hit this issue too. We disable replication on our replication master while we reindex then enable it so that a partial index doesn't replicate. When the communication to the master blipped we got the 'master is not available. Index fetch failed' message then the index was deleted. From look at the mentioned code it seems the issue is because of the dual use of the indexversion both to represent an actual index version of zero and to disable replication. A fix may be to update the replication handler to provide an enabled boolean status in the response to indexversion or a separate command to determine if replication is enabled or not. ",
            "id": "comment-15637085"
        }
    ]
}