{
    "id": "SOLR-10699",
    "title": "make it optional to specify authorization plugin class name",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "security"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "It is unlikely that users specify anything other than  \"class\":\"solr.RuleBasedAuthorizationPlugin\" for authorization. So , if nothing is specified we should take the default as solr.RuleBasedAuthorizationPlugin",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-18T08:12:16+0000",
            "content": "-0 Keep it simple and explicit - people don't type this by hand anyway so what do you save? ",
            "author": "Jan Høydahl",
            "id": "comment-16015403"
        },
        {
            "date": "2017-05-18T08:47:00+0000",
            "content": "\n\tThe name is ugly\n\tThere is very little chance of of people using anything else\n\tThough people don't type it , it's visible in security.json\n\n ",
            "author": "Noble Paul",
            "id": "comment-16015442"
        },
        {
            "date": "2017-05-18T09:05:21+0000",
            "content": "We have uglier names in our code base without making them defaults  This thing is pluggable so per definition people will use other impls further down the road. I feel this is different from choosing json as default wt; the authz class directly dictates how to parse the remainder of the authz JSON object. One of the benefits of Solr's plugin system is that it is quite explicit, you can read it and understand how it is wired.\n\nAn alternative could perhaps be to let Solr's security plugins use SPI. Then instead of removing we could replace class by, e.g. \"impl\":\"rulebased\"? ",
            "author": "Jan Høydahl",
            "id": "comment-16015461"
        },
        {
            "date": "2017-05-18T09:45:39+0000",
            "content": "I don't think we have a very user friendly system in Solr. It's quite powerful but most of the times it's tasteless. My point is 99.99% of the time nobody is going to use a different authz plugin. So, it's going to be used only by a power user. We don't have to tell the normal users that it's pluggable, they just don't need to know it. This whole pluggability business is an annoyance to most users.   ",
            "author": "Noble Paul",
            "id": "comment-16015506"
        },
        {
            "date": "2017-05-18T11:08:23+0000",
            "content": "I think the way to approach user friendliness for security is much more about tooling such as SOLR-8440 as well as API and UI support. Most users want to run a command solr auth enable or to click a button in UI. More advanced users will talk to our security REST api set-permission etc. Developers and advanced users may craft their own security.json but I don't think those users are annoyed by the class param, rather the opposite, they expect it.? ",
            "author": "Jan Høydahl",
            "id": "comment-16015587"
        },
        {
            "date": "2017-05-18T12:57:02+0000",
            "content": "My point is 99.99% of the time nobody is going to use a different authz plugin\n\nAre you sure about that? Both Hortonworks and Cloudera have authorization plugins (for Ranger and Sentry, respectively) that work with Solr. I don't know the internals of how those work, but do you? Since Solr is integrated in both platforms, there are a lot of potential installations that are going to use those plugins instead of Solr's in order to have a single authz management experience.  ",
            "author": "Cassandra Targett",
            "id": "comment-16015710"
        },
        {
            "date": "2017-05-18T13:05:22+0000",
            "content": "We are not taking away any feature. We are trying to establish sensible defaults so that, non experts are not exposed to information that they don't need ",
            "author": "Noble Paul",
            "id": "comment-16015717"
        }
    ]
}