{
    "id": "SOLR-11077",
    "title": "Multi-dimensional points",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Schema and Analysis"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Reopened"
    },
    "description": "To support multi-dimensional point fields in Solr, 2 things are needed:\n\n\ta way to index a multi-dimensional point.  Perhaps provide as a comma delimited string.\n\ta way to do a multi-dimensional range query.  Write a new query parser.\n\n\n\nWe ought to do this in a some new FieldType's... one for whole numbers, another for floating point.\n\nOriginal description:\n\nThe release of Apache Solr 6.5.0. has a Highlight that \"PointFields (fixed-width multi-dimensional numeric & binary types enabling fast range search) are now supported\" 。\nBut I read the source code of solr 6.6 about point, I didnot find out n dimensional that n bigger than 3.\nIn solr,\n1.LatLonPointSpatialField support 2D using LatLonPoint in lucene。\n2.And IntPointField/LongPointField/FloatPointField/DoublePointField only support 1D, although multi-dimensional point is supported in lucene。\n\nSo i have a quesion that is how to support n dimensional search in solr( n >= 3 )?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-14T16:34:49+0000",
            "content": "This is not an appropriate use of Solr's JIRA, we reserve the JIRA system for code issues rather than usage questions.\n\nPlease ask the question here: solr-user@lucene.apache.org ",
            "author": "Erick Erickson",
            "id": "comment-16087556"
        },
        {
            "date": "2017-07-15T05:02:05+0000",
            "content": "Perhaps the user should have asked the question on the solr-user list... but nonetheless I think this JIRA issue is a valid one.  It's filed as a \"New Feature\" – and indeed this is a new feature (request) since Solr doesn't do it now and it could be enabled to thanks to the low level support in Lucene.  The title & description are perhaps not written as a feature-request, they are worded as a question – hence your reaction Erick on stylistic points but nonetheless it stands that Solr ought to do this and does not yet. ",
            "author": "David Smiley",
            "id": "comment-16088462"
        }
    ]
}