{
    "id": "SOLR-4770",
    "title": "Mouse-over info for other nodes in SolrCloud rendering",
    "details": {
        "affect_versions": "4.2",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "We render a nice graphical view of your current cluster from the URL http://localhost:8983/solr/#/~cloud\n\nIt'd be nice to gather some info about those other nodes without having to visit them.  Since you can't right-click to open those nodes in another tab, your only choice now is to duplicate that tab, and then click the link.\n\nThis was mentioned in SOLR-4438 but Stefan Matheis (steffkes) requested that it be broken out into a separate task and detailed a bit more.\n\nMouse-Over often indicates a Balloon-help style thing, but another option is to reserve another part of the screen down below that can display node info, and then refresh it as the mouse hovers over various nodes.  I'm not sure which is easier nor which is more accessible.\n\nSadly some devices don't support Hover, and the click method is already used to take you to that other node.  So perhaps it'd be easier to display some type of \"\" / Info icon that you can specifically click on to see that node's info, without jumping to it.\n\nSpecific items it might be nice to see:\n(generally mirroring what's on default Dashboard screen if you were to visit that node)\n\n\tStart\n\tHost\n\tCWD\n\tInstance\n\tData\n\tIndex\n\tSolr & Lucene version (to help with upgrading, though not sure we need all 4 fields?)\n\n\n\nResources:\n\n\tJVM meory\n\tmaybe Physical Memory\n\tSome hint about disk stats?\n\n\n\n\nArgs of:\n-DnumShards\n-DzkRun\n-STOP\n... not sure how many.... could get too much, but some would be handy",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13643063",
            "date": "2013-04-26T17:44:25+0000",
            "content": "Mark, currently we are not able to display such information .. because they don't exist in the clusterstate.json file, which is used for almost all the cloud-related UI things as underlying information. You can check what's available right now with /solr/zookeeper?detail=true&path=%2Fclusterstate.json (or access it through the UI, as you like) .. and that's not really that much information about another instance.\n\nThe UI itself can't check for the details (f.e. by requesting /admin/system which powers the Dashboard) because that would be a CrossDomain-Request (javascript requires scheme, host & port to be the same) which is not possible on the client-side.\n\nSo, if we'd like to have this information there .. we have to get it (somehow) into ZK. Should be doable, but i have not enough knowledge on that topic. .. JFYI Mark Miller  "
        },
        {
            "author": "Mark Bennett",
            "id": "comment-13643188",
            "date": "2013-04-26T20:03:32+0000",
            "content": "See SOLR-4439 for an alt use case that might scratch the same itch.\n\nBut in terms of infrastructure, might somebody want to have a complete cluster snapshot, with detailed info for all nodes by default.  And if that existed, then getting this info would just be a subset.\n\nOr maybe pushing more info into ZK would be a good thing.  I'd be curious to hear from folks that manage large clusters.  Or maybe debug new, intermediate clusters that they're developing or testing on.  Do folks like the idea of being able to quickly get detailed info about multiple nodes (presentation style being a cosmetic detail)\n\nLike... \"hey, I wonder if all my nodes are up to date wrt Lucene/Solr version?\"  Or \"hey, which of my nodes just came up, vs. which nodes have been for a while?\"  I'd also think folks would like to see things about JVM memory, index size and disk space stats at a glance, BUT maybe folks are already using other tools for this. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13643233",
            "date": "2013-04-26T20:47:28+0000",
            "content": "Actually .. what we might do w/o a change to the zookeeper-data is drum roll using state-of-the-art JSONP. which allows the UI to fetch information from remote hosts.\n\nOf course that would mean, that if we'd like to show some kind of cluster-overview presented as a table (all nodes visible at once) .. it might take a while, to generate that one, because we have to issue N HTTP-Requests to display it.\n\nOn the other hand, displaying this information (only) on-demand might work out w/o problems, since it's only one node at a time.\n\nWhile writing about the Idea of a cluster-overview (as table) which i find pretty nice, not sure if it's that helpful? It reminds me a bit about Foreman (http://theforeman.org/static/images/screenshots/host_listing.png) ...  "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16438528",
            "date": "2018-04-14T22:27:52+0000",
            "content": "I'm tackling this as part of SOLR-8207, implementing a whole new \"Nodes\" tab with a nodes-oriented view of the cluster as opposed to a collection-oriented one. I'll probably close this once that is done. We could of course also provide links from the graph view node name to the corresponding line in the new Nodes view to jump directly to that extended node info. "
        }
    ]
}