{
    "id": "SOLR-1906",
    "title": "Posibility to store actual geohash values in the geohash field type",
    "details": {
        "affect_versions": "1.5",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Tried to index some data, containing already encoded geohashes, into a geohash field type.\nTo my surprise I could not make it work...\nA sneak peak at the source, revealed to me that this field type takes a lat/lng pair as it's value, not a geohash...\n\nCould this be fixed, so the field type also can take actual geohashes?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15547725",
            "date": "2016-10-05T05:25:56+0000",
            "content": "David Smiley Is this issue from 5 versions ago still relevant? "
        },
        {
            "author": "David Smiley",
            "id": "comment-15549038",
            "date": "2016-10-05T15:14:51+0000",
            "content": "Regarding accepting a geohash as input as an alternative to a lat,lon or WKT... I don't know... I guess so?  Patches welcome   One could always write an UpdateRequestProcessor to do such things.\n\nBTW I think GeoHashField should be removed from Solr 7.0; it's dated and I can't think of any reason why someone would use it. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15549250",
            "date": "2016-10-05T16:36:27+0000",
            "content": "What would the URP do (using the latest available geo fields)? We could create an enhancement newdev JIRA for this.\n\nOn removing the GeoHashField, if we were to remove it, would we want to deprecate it first? Do we need a new Jira for that? "
        },
        {
            "author": "David Smiley",
            "id": "comment-15549286",
            "date": "2016-10-05T16:48:57+0000",
            "content": "What would the URP do (using the latest available geo fields)? We could create an enhancement newdev JIRA for this.\n\nQuite simply use GeoHashUtils to parse it to get a lat-lon, and then spit that out as \"lat, lon\".  I think I like this better than the spatial field type itself accepting a geohash.  Any way, I'm a little skeptical how much people would care about this feature.  If nobody further responds to this issue wanting this capability within a month, I suggest taking no further action and closing the issue.  Either way, I'm not signing up to do the issue, only to review & commit a suitable patch.\n\nI filed SOLR-9606 to remove GeoHashField "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15549334",
            "date": "2016-10-05T17:01:58+0000",
            "content": "Thanks David for the feedback.\n\nI'll monitor this issue and close it if nobody jumps on it, as you suggest. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15582123",
            "date": "2016-10-17T12:35:49+0000",
            "content": "There was no interest. As per last discussion, closing it. "
        }
    ]
}