{
    "id": "SOLR-12277",
    "title": "Zookeeper version on the documentation",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.3",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Hello,\n\nIn this page: https://lucene.apache.org/solr/guide/7_3/setting-up-an-external-zookeeper-ensemble.html#download-apache-zookeeper\n\nSays: Solr currently uses Apache ZooKeeper v3.4.11.\nBut since today, this version is no longer available. So, can you change the documentation to add an availabled version ?\nhttp://apache.mirrors.ovh.net/ftp.apache.org/dist/zookeeper/\n\nThanks.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-04-26T15:55:20+0000",
            "content": "The ZK version that is included in a specific version of Solr is not going to change even if what's available for download on the ZK page changes.  If we updated the documentation, then it wouldn't match what Solr actually includes.  Solr version 7.3 is always going to include 3.4.11. ",
            "author": "Shawn Heisey",
            "id": "comment-16454433"
        },
        {
            "date": "2018-04-26T17:06:47+0000",
            "content": "It looks like the reason 3.4.11 has been pulled from download is probably this: ZOOKEEPER-2960\n\nI don't think this is a concern for Solr itself, unless somebody is using the embedded ZK and is customizing that ZK config.  The embedded ZK is not recommended except for tests or proof of concept.  Our advice when running a config that's not recommended would be to not configure ZK in a way that encounters that issue, or to manually upgrade ZK to 3.4.12 in the Solr install.\n\nAs already said, we won't be updating the 7.3 documentation to refer to a version other than 3.4.11, because that would be incorrect information. ",
            "author": "Shawn Heisey",
            "id": "comment-16454551"
        },
        {
            "date": "2018-04-26T17:08:00+0000",
            "content": "Resolving/closing the issue as \"invalid\".  This isn't a problem.\n\nIf we later determine that there is a real issue, we can re-open. ",
            "author": "Shawn Heisey",
            "id": "comment-16454554"
        }
    ]
}