{
    "id": "SOLR-10007",
    "title": "Clean up references to CoreContainer and CoreDescriptors",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [
            "6.6",
            "7.0"
        ],
        "affect_versions": "6.4",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "It's a bit weird that CoreDescriptor contains a reference to CoreContainer. It seems like the SolrCore should reference CoreContainer.\n\nSimilarly, SolrCore keeps a copy of CoreDescriptor and another copy is kept in the various CoreDescirptor lists making it difficult to track which is the \"real\" CoreDescriptor.\n\nThis is an umbrella issue as I think this (and perhaps other) issues can be tackled separately.",
    "attachments": {
        "SOLR-10007.patch": "https://issues.apache.org/jira/secure/attachment/12861817/SOLR-10007.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-04-04T04:25:31+0000",
            "content": "Here's what this patch is looking like. Something of a WIP, but reasonably close I think.\n\nIt touches a lot of files. Mostly it's just something akin to:\n\n\n\tthis(core.getCoreDescriptor().getCoreContainer(), core.getName());\n+    this(core.getCoreContainer(), core.getName());\n\n\n\nI seem to be having trouble with, of all things, TestConfigSetsAPI. Haven't run precommit either. ",
            "author": "Erick Erickson",
            "id": "comment-15954548"
        },
        {
            "date": "2017-04-05T15:36:28+0000",
            "content": "I think this is very close to ready, running tests and precommit and such again.\n\nIt touches a lot of files, but most of them are changing solrcore.getCoreDescriptor().getCoreContainer()\nto\nsolrcore.getCoreContainer().\n\nAlong the way I renamed a few internal variables to more accurately reflect what they're supposed to be.\n\nThere may be a few gratuitous format changes, I upgraded IntelliJ and somehow had the \"strip trailing spaces on save\" set and \"reformat whole file\" rather than \"only reformat VCS changed text\". I went through and undid all the gratuitous junk I could find, but a few might have snuck through.\n\nStructurally this is significantly better I think. There were a number of places where we were using the CoreDescriptors to infer the state of the SolrCore. The big thing this patch does is try to separate the use of CoreDescriptors and SolrCores.\n\nThe other change here is it moves the CoreContainer reference from the CoreDescriptor to SolrCore.\n\nI'll commit this in a day or two unless there are objections. It' incorporates both SOLR-10008 and SOLR-10009 so I'll close those now. ",
            "author": "Erick Erickson",
            "id": "comment-15957041"
        },
        {
            "date": "2017-04-05T17:35:01+0000",
            "content": "First time I've ever had precompile fail but still be able to 'ant clean server dist' successfully due to a renamed method.\n\nPatch now passes precommit and test. ",
            "author": "Erick Erickson",
            "id": "comment-15957294"
        },
        {
            "date": "2017-04-13T00:00:46+0000",
            "content": "Final patch with CHANGES entry.\n\nI've tested this pretty thoroughly, all tests pass 20 iterations of the full unit tests.\n\nThis is a big patch, but it has a lot of mechanical changes, i.e. core.getCoreDescriptor().getCoreContainer()\nis now just\ncore.getCoreContainer()\n\nSignificant fragility in the code was because we kept CoreDescriptors in multiple places, which is no longer the case.\n\nI also renamed a couple of the internal methods to make their purpose clearer.\n\nI also added a \"reload\" method to CoresLocator, there has to be the possibility of re-reading the coreDescriptor from disk. ",
            "author": "Erick Erickson",
            "id": "comment-15966888"
        },
        {
            "date": "2017-04-13T00:03:08+0000",
            "content": "Commit 4cb00ccca40854f4b51ea7edb829d48228c95673 in lucene-solr's branch refs/heads/master from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4cb00cc ]\n\nSOLR-10007: Clean up references to CoreContainer and CoreDescriptors ",
            "author": "ASF subversion and git services",
            "id": "comment-15966893"
        },
        {
            "date": "2017-04-13T04:56:00+0000",
            "content": "Commit acf302202a15426eee148f58346689ff42dd23e4 in lucene-solr's branch refs/heads/branch_6x from Erick Erickson\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=acf3022 ]\n\nSOLR-10007 Clean up references to CoreContainer and CoreDescriptors ",
            "author": "ASF subversion and git services",
            "id": "comment-15967136"
        }
    ]
}