{
    "id": "SOLR-6342",
    "title": "Solr should mention CHANGES from Lucene which have side effects in Solr",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.10",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "This is the problem that I faced - A user upgraded Solr from 4.0 to 4.9 and the queries being formed were behaving differently.\n\nI tracked it down to LUCENE-5180 ( which I believe is the correct thing to do ) . The problem is since Solr does't ship with the Lucene CHANGES.txt file and we didn't record this under the the Solr CHANGES.txt file also, a user is not aware of such changes when upgrading.\n\nI can think of two options - \n1. Duplicate the changes which have side effects in Solr under Solr's CHANGES.txt file also ( not sure if we do this already and that we missed this one ).\n2. Be conservative and ship Solr binaries with the Lucene CHANGES.txt file also\n\nWe should address this problem",
    "attachments": {
        "SOLR-6342.patch": "https://issues.apache.org/jira/secure/attachment/12662023/SOLR-6342.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-14091461",
            "date": "2014-08-08T23:48:16+0000",
            "content": "I'm so use to dealing with source releases, it didn't even occur to me until now that the binary releases wouldn't include the Lucene CHANGES.txt file – but given the package structure of course that makes sense.\n\n1. Duplicate the changes which have side effects in Solr under Solr's CHANGES.txt file also ( not sure if we do this already and that we missed this one ).\n\nfor really major things we usually note these in the \"Upgrading\" section, but no matter hw dillegent we may be, i still think it's a good idea that all solr users should have a copy of hte lucene CHANGES.txt as well\n\nI think a build.xml addition that copies ../lucene/CHANGES.txt into the dist dir as \"LUCENE_CHANGES.txt\" and a one line note about it at the top of Solr's CHANGES.txt would make a lot of sense. "
        },
        {
            "author": "Varun Thacker",
            "id": "comment-14092497",
            "date": "2014-08-11T06:27:51+0000",
            "content": "Slightly unrelated but maybe we could also fix the problem pointed out by Ramkumar Aiyengar here - http://mail-archives.apache.org/mod_mbox/lucene-dev/201401.mbox/%3CCADMUOEWDZjg3BKE3m_2FxtKVHa3uA_6kjY_iSJt9Wxv3ixyLKg@mail.gmail.com%3E  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14098262",
            "date": "2014-08-15T06:51:31+0000",
            "content": "Attaching a quick patch along the lines of what i described before ... i think this is good to go, but i might be missing something. (Steve Rowe, Uwe Schindler, ... other build.xml folks: see any red flags here?)\n\nSlightly unrelated but maybe we could also fix the problem pointed out...\n\nmore like completely unrelated - there's nothing about our build system or the CHANGES.txt file itself that needs modified to address that request, we should just start including the appropriate link in our release notes (we only have to remember to do it once, after that the \"header\" of the last release announcement usually just gets copied for the next one, etc...) "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14098978",
            "date": "2014-08-15T19:32:59+0000",
            "content": "The build.xml modifications look good to me.  I ran ant package from solr/ and then unpacked each of the three distributions (binary .zip and .tgz; source .tgz) and found that LUCENE_CHANGES.txt is in the expected place in each, and its contents are the same as Lucene's CHANGES.txt.\n\nThe attached patch, which includes Hoss's changes, fixes a problem in the Changes.html generated by ant changes-to-html under solr/: the added per-release text about LUCENE_CHANGES.txt was improperly added as a numbered item under the \"Versions of Major Components\" section.  I fixed this by moving the text  in CHANGES.txt under each release so that it's the first thing under the release header - this makes the text its own item.\n\nIn the patch, I've also enabled auto-linkification in changes2html.pl (called by ant changes-to-html) of LUCENE_CHANGES.txt, to the appropriate Lucene Changes.html file. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14099185",
            "date": "2014-08-15T21:37:08+0000",
            "content": "Commit 1618281 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1618281 ]\n\nSOLR-6342: build.xml clones lucene/CHANGES.txt as LUCENE_CHANGES.txt in solr releases; changes2html hotlinks LUCENE_CHANGES.txt when found "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14099212",
            "date": "2014-08-15T21:48:10+0000",
            "content": "Commit 1618284 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1618284 ]\n\nSOLR-6342: build.xml clones lucene/CHANGES.txt as LUCENE_CHANGES.txt in solr releases; changes2html hotlinks LUCENE_CHANGES.txt when found (merge r1618281) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14099217",
            "date": "2014-08-15T21:49:46+0000",
            "content": "Committed on sarowe's behalf per IRC disucssion.\n\nCommitted revision 1618281.\nCommitted revision 1618284.\n\nalso spun off an idea he had for an improvement that came up during my testing: SOLR-6384\n "
        }
    ]
}