{
    "id": "SOLR-3226",
    "title": "SignatureUpdateProcessor ignores non-string field values from the signature generation",
    "details": {
        "affect_versions": "1.4,                                            3.1,                                            3.2,                                            3.3,                                            3.4,                                            3.5,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "update"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When using for example XMLUpdateRequestProcessor, the signature is calculated correctly since all field values are strings. But when one uses DataImportHandler or BinaryUpdateRequestHandler, the signature generation will ignore any field values that are ints, longs, dates etc. \n\nThis might result in overwriting non-similar documents, as it happened in my case while importing some db data through DIH.",
    "attachments": {
        "SOLR-3226.patch": "https://issues.apache.org/jira/secure/attachment/12517708/SOLR-3226.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Spyros Kapnissis",
            "id": "comment-13226037",
            "date": "2012-03-09T12:11:37+0000",
            "content": "I'm adding a small patch that adds a simple String.valueOf for any field that fails the instanceof String typecheck. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13244499",
            "date": "2012-04-02T19:35:26+0000",
            "content": "Hmmm .... just noticed this jira ... this definitely seems like a really bad bug.\n\nSpyros: thank you so much for your patch (including tests!) ... i've updated it to also fix the case of Collections that contain non string. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13244505",
            "date": "2012-04-02T19:41:03+0000",
            "content": "I wanna commit this into 3.6 ... but i'd like to get mark miller to sanity check th patch first (the instanceof String seems so deliberate i'm not sure if i'm missing something - i've pinged him on IRC to see if he can review ASAP)\n\nSuggested special text for the upgrading section in CHANGES.txt...\n\n\nA bug found and fixed in the SignatureUpdateProcessor that previously caused some \ndocuments to produce the same signature even when the configured fields contained \ndistinct (non-String) values.  Users of SignatureUpdateProcessor are strongly advised \nthat they should re-index as document signatures may have now changed. \n(see SOLR-3226 for details)\n\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13244799",
            "date": "2012-04-02T23:01:30+0000",
            "content": "Committed revision 1308604. - trunk\n\n...had to make a tweak to schema-luceneMatchVersion.xml to get all tests working however (TestMatchVersions uses same solrconfig.xml but diff schema.xml, so it freaked about \"id\" not existing)\n\nstill testing the backport to 3x ... there were some other subtle tweaks needed there to the test because of branch drift "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13244845",
            "date": "2012-04-02T23:45:07+0000",
            "content": "Committed revision 1308625. - 3x "
        }
    ]
}