{
    "id": "SOLR-1439",
    "title": "Enhance PollInterval for Java Replication",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "I am not a huge fan of PollInterval. It would be great to add an option to get the Index based on exact time: PollTime=\"*/15 * * * *\" That would run at every 15 minutes based on the clock. i.e. 1:00pm, 1:15pm, 1:30pm, 1:45pm, etc. All my slaves are sync'd using NTP, so this would work better. Since each slave starts differently, we cannot set the PollInterval=\"00:15:00\" since they would get different indexes based on when they start. The other option would be to suspend polling - and start - which would be very manual I guess. Setting the PollInterval to 10 seconds would be getting a new index when the old one is still warming up. Even 10 seconds interval would not be good, since we get so many updates, each server would have different indexes. With Snap we don't have this issue.\n\nWe get SOLR updates frequently and since they are large we cannot wait to do a commit at the 15 minute mark using cron. Optimize just takes too long.\n\nOn our system we need to limit how often the slaves get the new index. We would like all slaves to get the index at the same time.\n\nFrom Noble Paul:\nThe default pollInterval can behave the way you want (so that the fetches are synchronized in time by the clock). Raise a separate issue and we can fix it",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-12756352",
            "date": "2009-09-17T03:40:57+0000",
            "content": "isn't it same as SOLR-1435? "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775877",
            "date": "2009-11-10T15:52:15+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}