{
    "id": "SOLR-1378",
    "title": "Add reference to Packt's Solr book.",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I've attached news of the Solr update.  It includes an image under the left nav area, and a news item with the same image.  The text is as follows:\n\nDavid Smiley and Eric Pugh are proud to introduce the first book on Solr, \"Solr 1.4 Enterprise Search Server\" from Packt Publishing.\n\nThis book is a comprehensive reference guide for nearly every feature Solr has to offer. It serves the reader right from initiation to development to deployment. It also comes with complete running examples to demonstrate its use and show how to integrate it with other languages and frameworks.\n\nTo keep this interesting and realistic, it uses a large open source set of metadata about artists, releases, and tracks courtesy of the MusicBrainz.org project. Using this data as a testing ground for Solr, you will learn how to import this data in various ways from CSV to XML to database access. You will then learn how to search this data in a myriad of ways, including Solr's rich query syntax, \"boosting\" match scores based on record data and other means, about searching across multiple fields with different boosts, getting facets on the results, auto-complete user queries, spell-correcting searches, highlighting queried text in search results, and so on.\n\nAfter this thorough tour, you'll see working examples of integrating a variety of technologies with Solr such as Java, JavaScript, Drupal, Ruby, PHP, and Python.\n\nFinally, this book covers various deployment considerations to include indexing strategies and performance-oriented configuration that will enable you to scale Solr to meet the needs of a high-volume site.",
    "attachments": {
        "solr-book-image.jpg": "https://issues.apache.org/jira/secure/attachment/12417307/solr-book-image.jpg",
        "solr_book_packt.patch": "https://issues.apache.org/jira/secure/attachment/12417306/solr_book_packt.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-12746158",
            "date": "2009-08-21T19:04:08+0000",
            "content": "The image goes here: src\\site\\src\\documentation\\content\\xdocs\\images\\solr-book-image.jpg "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12746392",
            "date": "2009-08-22T01:31:30+0000",
            "content": "David, I needed to put <p> </p> tags around the book image in the news section.\n\"forrest run\" (interactive mode) does not detect all the errors that the straight \"forrest\" will.\n\nThat said, I can't build the current site myself... not even on a clean checkout with your patch not applied (I've only tried forrest 0.8 so far).  Anyone else? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12747595",
            "date": "2009-08-25T19:32:34+0000",
            "content": "once you fix the paragraph tag issue, the remaining build failure is evidently a problem we've had for a while (i don't remember noticing it the last time i updated the site, but rolling back a few versions shows it's been happening since before grant switched the search box to point to lucid)\n\nthe forrest failure doesn't actaully prevent the site from generating pages – it just fails once it's finished generating pages because the of the broken-links report.\n\ni went ahead and commited the changes from this patch and pushed to the live site (normal mirroring lag applies) ... i'll spend a few minutes seeing if i can get the broken link report to go away, but that's unrelated to this issue. "
        }
    ]
}