{
    "id": "SOLR-1676",
    "title": "spellcheck.count has confusing default and documentation",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [
            "1.5"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "It seems spellcheck.count does not just limit the number of results returned, as the documentation claims. Instead, this value is given to the Lucene SpellChecker class which multiplies it by 10 and then only fetches the first spellcheck.count*10 candidates, ignoring all others. The effect is that with a low value for spellcheck.count you might miss good hits. In other words, the first item with spellcheck.count==1 is not always the same item as with e.g. spellcheck.count==10.\n\nThe fix could be to fix the documentation (the comments in the sample solrconfig.xml) to mention this and use a better default.\n\nThe Lucene SpellChecker class says about the numSug parameter: \"Thus, you should set this value to at least 5 for a good suggestion.\"",
    "attachments": {
        "solr-spellcheck.diff": "https://issues.apache.org/jira/secure/attachment/12428628/solr-spellcheck.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12793158",
            "date": "2009-12-21T11:17:20+0000",
            "content": "Although it is not documented anywhere, SpellCheckComponent passes max(spellcheck.count, 5) to the Lucene spellchecker, see AbstractLuceneSpellChecker line 141 in trunk.\n\nThe effect is that with a low value for spellcheck.count you might miss good hits. In other words, the first item with spellcheck.count==1 is not always the same item as with e.g. spellcheck.count==10. \n\nThat is true. It is a trade-off between accuracy and performance. We cannot avoid this without fetching all results (or a large number of them) internally and score all of them with a distance metric and that can make it very slow.\n\nDo you have any suggestion on how we could improve the documentation?\n "
        },
        {
            "author": "Daniel Naber",
            "id": "comment-12793209",
            "date": "2009-12-21T14:16:46+0000",
            "content": "Here's a suggestion on how we could modify the documentation (i.e. the sample config): mention that the limit might need to be increased, and set the default value to 5. I see there are many more solrconfig.xml files in the test directory, I'm not sure if those would need to be modified, too. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12793277",
            "date": "2009-12-21T17:59:05+0000",
            "content": "I guess it is better to add this information to the SpellCheckComponent wiki page and reference that in the example solrconfig.xml. Anybody using SpellCheckComponent would anyway need to refer to the wiki to figure out the other parameters.\n\nhttp://wiki.apache.org/solr/SpellCheckComponent "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12793278",
            "date": "2009-12-21T18:00:06+0000",
            "content": "Ah, I see you have already added it. Let us just refer to the wiki in the example then. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12794329",
            "date": "2009-12-24T06:35:58+0000",
            "content": "Committed revision 893700.\n\nI've added a note in the example solrconfig.xml to refer to the wiki for details on the request parameters.\n\nThanks Daniel! "
        }
    ]
}