{
    "id": "SOLR-1576",
    "title": "Provide better error reporting for clients performing updates (or other operations)",
    "details": {
        "affect_versions": "1.4",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It's frustrating from a client point of view to perform an update and then get back a 400 with no additional information.  Would it make sense to supply an HTTP header with information about the error?  I was thinking something like:\n\n\nX-SOLR-ERROR-MESSAGE: unknown field 'fooBarBaz'\n\n\nThis would snap right into SolrDispatchFilter in sendError at line 363:\n\n\nres.addHeader(\"X-SOLR-ERROR-MESSAGE\",ex.getMessage());",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12781681",
            "date": "2009-11-23T22:51:06+0000",
            "content": "At the moment the response formatting is at the whim of the servlet container – so you do get additional information, but it's servlet container dependent on how that error information is formatted.\n\nSOLR-141 aims to fix that by allowing response writer specific formatting of the underlying exception so the client has all the data available.  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12781682",
            "date": "2009-11-23T22:52:33+0000",
            "content": "Linking to SOLR-141 instead of marking as a Dup, because i definitely think there may be some value in having SolrDispatchFilter add some HTTP headers based on teh error as well  (writer specific errors are still handy particularly for non-HTTP based communication, but that doesn't mean we can't have both) "
        },
        {
            "author": "Paul R. Brown",
            "id": "comment-12781688",
            "date": "2009-11-23T22:56:19+0000",
            "content": "I ended up dealing with this particular item by implementing a custom update processor that puts a block with the document id and a messge into the response when an update fails. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15770258",
            "date": "2016-12-22T15:16:19+0000",
            "content": "Ran across this randomly, can it be closed? Chris Hostetter (Unused) "
        }
    ]
}