{
    "id": "SOLR-4534",
    "title": "Shard Aliasing",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Collection Aliasing lets you do some interesting things, but all of it requires multiple collections. It's also interesting to be able to alias shards within a collection so that you don't always have to use multiple collections to take advantage of aliasing.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13596195",
            "date": "2013-03-07T19:04:21+0000",
            "content": "Any opinions on where this API should live? The collection aliasing API is on the collections API - it's probably easiest to put this there as well, but I'm not totally sold yet. I suppose instead of /collections?cmd=CREATEALIAS, it could just be /collections?cmd=CREATESHARDALIAS or something. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13596231",
            "date": "2013-03-07T19:21:44+0000",
            "content": "edit: reformatted to please JIRA\n\nMaybe \n\nPUT /admin/collections/{collection-name}/shards/{shard-name}/aliases/alias\n\nand to add multiple aliases: \n\nPOST /admin/collections/{collection-name}/shards/{shard-name}/aliases\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13596290",
            "date": "2013-03-07T19:55:24+0000",
            "content": "Hey Steve - I of course prefer that type of format, but it's not really consistent with the current admin API's. So initially, I think I might favor being more consistent - I think it would be more awkward for the shard and collection aliasing to be so different than with the new schema api not being consistent - depending on how long this takes to get in.\n\nHowever, I would like to change the current admin API's to all work closer to what your suggesting now that you have gotten restlet in.\n\nI was thinking to deal with back compat, I could just make new apis and keep the old ones around, but deprecate and remove for 5 or something.\n\nI know it's a big deal to change the API's, but it would just be admin side, not search, and it would be a big step forward I think. The current admin API's are fairly unusual. "
        }
    ]
}