{
    "id": "SOLR-8659",
    "title": "Improve Solr JDBC Driver to support more SQL Clients",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "SOLR-8502 was a great start to getting JDBC support to be more complete. This ticket is to track items that could further improve the JDBC support for more SQL clients and their features. A few SQL clients are:\n\n\tDbVisualizer\n\tSQuirrel SQL\n\tApache Zeppelin (incubating)\n\tSpark\n\tPython & Jython\n\tIntelliJ IDEA Database Tool\n\tODBC clients like Excel/Tableau",
    "attachments": {
        "iODBC_Demo__Unicode__-_Connected_to__remotesolr__and_Attach_screenshot_-_ASF_JIRA.png": "https://issues.apache.org/jira/secure/attachment/12792257/iODBC_Demo__Unicode__-_Connected_to__remotesolr__and_Attach_screenshot_-_ASF_JIRA.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-08T21:42:49+0000",
            "author": "Kevin Risden",
            "content": "Some rough notes that should be added as subtasks for DbVisualizer:\n\n\tAfter connection, click on Database Info tab after double clicking on connection name ensure that DB capabilities are correct - SOLR-8815\n\tAfter connection, click on Database Info tab after double clicking on connection name should add add info about supported Keywords and Functions - SOLR-8816\n\tAfter connection, click on Data Types tab after double clicking on connection name should add info about data types - SOLR-8817\n\tAfter connecting, ResultSet is empty if double click on \"DB\" under connection name then click on Tables tab. - SOLR-8818\n\tAfter connecting, NPE if double click on \"DB\" under connection name then click on References tab. - SOLR-8819\n\tAfter connecting, ResultSet is empty if double click on \"Table\" under \"DB\" then click on Tables tab. - SOLR-8820\n\tAfter connecting, NPE if double click on \"DB\" under \"DB\" then click on References tab. - SOLR-8821\n\tImplement DatabaseMetaDataImpl.getPrimaryKeys(String catalog, String schema, String table) - SOLR-8822\n\tImplement DatabaseMetaDataImpl.getColumns(String catalog, String schemaPattern, String tableNamePattern, String columnNamePattern) - SOLR-8823\n\n ",
            "id": "comment-15137755"
        },
        {
            "date": "2016-02-08T21:44:20+0000",
            "author": "Kevin Risden",
            "content": "As for SquirrelSQL the following will at minimum be needed:\n\n\tDocumentation on how to use SquirrelSQL like SOLR-8521 - SOLR-8825\n\tTest SquirrelSQL with Solr JDBC and resolve issues - SOLR-8827\n\n ",
            "id": "comment-15137758"
        },
        {
            "date": "2016-02-08T23:22:39+0000",
            "author": "Kevin Risden",
            "content": "Another thing to test is potentially a ODBC-JDBC bridge (http://docs.oracle.com/cd/E13167_01/aldsp/docs20/appdev/jdbcclt.html#1072126) to potentially use software like Excel/Tableau/other non Java tools. ",
            "id": "comment-15137984"
        },
        {
            "date": "2016-02-11T15:00:19+0000",
            "author": "Joel Bernstein",
            "content": "Yes, Tableau is going to be very important. We might want to consider changing this ticket to be \"Improve Solr JDBC Driver to support Tableau\"\n\nAs the 6x branch progresses this will be one of my highest priorities along with SOLR-8593. ",
            "id": "comment-15142842"
        },
        {
            "date": "2016-02-11T17:31:53+0000",
            "author": "Kevin Risden",
            "content": "So for any ODBC program (Tableau, Excel, etc), this is going to require an ODBC-JDBC bridge. I have been trying to get OpenLink to work on my Mac, but they don't seem to support Mac OS X 10.11 :/ I have a support ticket open since Tuesday, but no word back yet. I may have to spin up a Windows VM or something else to try to test an ODBC-JDBC bridge. ",
            "id": "comment-15143113"
        },
        {
            "date": "2016-02-16T16:57:52+0000",
            "author": "Kevin Risden",
            "content": "The OpenLink 6.x ODBC-JDBC bridge is linked against an older version of Java and won't work with JDK 7/8. I have an open support ticket with OpenLink (case 21637). Until I am able to get a new build won't be able to test Excel/Tableau/etc on my Mac. For reference the error message is as follows:\n\n\n/Library/Application\\ Support/iODBC/bin/iodbctest \"DSN=Solr;UID=hr;PWD=openlink\"\niODBC Demonstration program\nThis program shows an interactive SQL processor\nDriver Manager: 03.52.1015.0210\n\n\t\tTue Feb 16 2016\n10:48:48 ERROR: Can't find DBMS Driver = [org/apache/solr/client/solrj/io/sql/DriverImpl]\n1: SQLDriverConnect = [OpenLink][ODBC][JDBC Server]java.lang.UnsupportedClassVersionError: org/apache/solr/client/solrj/io/sql/DriverImpl : Unsupported major.minor version 52.0 (0) SQLSTATE=HY000\n1: ODBC_Connect = [OpenLink][ODBC][JDBC Server]java.lang.UnsupportedClassVersionError: org/apache/solr/client/solrj/io/sql/DriverImpl : Unsupported major.minor version 52.0 (0) SQLSTATE=HY000\n\nHave a nice day.%\n\n ",
            "id": "comment-15148908"
        },
        {
            "date": "2016-02-16T19:10:17+0000",
            "author": "Joel Bernstein",
            "content": "I believe Spotfire has native JDBC support, maybe that's a good one to focus on. We can also just keep building out the driver for DbVisualizer and Squirrel and it should in theory work for a JDBC/ODBC bridge as well once we find a good one to test with. Alfresco (who I work for)  is pretty interested in Tableau so it's likely to get some internal testing.  ",
            "id": "comment-15149117"
        },
        {
            "date": "2016-03-09T13:58:59+0000",
            "author": "Kevin Risden",
            "content": "Good news: I was able to get a beta build of Openlink ODBC-JDBC 7.x that is linked against JDK 1.8 to test with. I was able to test the JDBC driver with Openlinks iODBC Demo app\nLess good news: There are some more methods that need to be implemented. I have a working patch and was able to get some results. The screenshot is attached. I am going to open a JIRA and attach the patch here this morning. ",
            "id": "comment-15187121"
        },
        {
            "date": "2016-03-09T14:02:25+0000",
            "author": "Joel Bernstein",
            "content": "This is great news, clears the path for excel and Tableau work. ",
            "id": "comment-15187124"
        },
        {
            "date": "2016-03-09T14:22:27+0000",
            "author": "Kevin Risden",
            "content": "Side note about testing Tableau Desktop on a Mac. As of Tableau 9.2.5 there is no generic ODBC option available. This means testing it will be a pain. http://kb.tableau.com/articles/issue/generic-odbc-data-connection-unavailable-on-the-mac ",
            "id": "comment-15187144"
        },
        {
            "date": "2016-03-09T14:34:31+0000",
            "author": "Joel Bernstein",
            "content": "Yeah Tableau is surprisingly windows centric. Wonder if they are phasing out the desktop product anyway in favor of something browser based.  ",
            "id": "comment-15187164"
        },
        {
            "date": "2016-03-09T15:37:17+0000",
            "author": "Kevin Risden",
            "content": "IntelliJ IDEA has the ability to interact with databases that have JDBC drivers. This is another thing that can be tested for the Solr JDBC driver. ",
            "id": "comment-15187258"
        },
        {
            "date": "2016-03-11T16:59:55+0000",
            "author": "Kevin Risden",
            "content": "Joel Bernstein - It would be great to get the following 3 JIRAs into Solr 6:\n\n\tSOLR-8819\n\tSOLR-8809\n\tSOLR-8810\n\n ",
            "id": "comment-15191214"
        },
        {
            "date": "2016-03-15T12:26:18+0000",
            "author": "Kevin Risden",
            "content": "A few more languages/clients that could be useful to test at some point:\n\n\tR - SOLR-9019 & SOLR-9021\n\t\n\t\tRJDBC - https://cran.r-project.org/web/packages/RJDBC/index.html\n\t\n\t\n\tPython/Jython - SOLR-9011 & SOLR-9013 & SOLR-9018\n\t\n\t\thttps://wiki.python.org/jython/DatabaseExamples\n\t\thttps://pypi.python.org/pypi/JayDeBeApi/\n\t\thttp://www.jython.org/jythonbook/en/1.0/DatabasesAndJython.html\n\t\n\t\n\n ",
            "id": "comment-15195201"
        },
        {
            "date": "2018-06-20T21:41:33+0000",
            "author": "Aroop",
            "content": "Kevin Risden\n\nTableau Desktop 2018 has ODBC support and I was able to use OpenLink to connect Solr to it.\n\nThe collections even show up on the schema dictionary, However, queries on collections fail due to Tableau's fixation with modeling everything as inner-queries and the integration does not work at this point. Tableau builds Queries like this \" select a as T.A, T.b as B from (select * from collectionA) as T\" and there does not seem to be any way to go around this, and these kind of queries fail on Solr obviously. ",
            "id": "comment-16518628"
        }
    ]
}