{
    "id": "SOLR-10332",
    "title": "Rounding errors in min/max statistics for a currency field/currency conversion",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.4.1,                                            6.4.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "There are rounding errors in the Stats component of Solr while requesting min/max statistics for a currency field.\n\nDescription: \nI have a currency field price in the Solr index. Here is the schema definition:\n<fieldType name=\"currency\" class=\"solr.CurrencyField\" currencyConfig=\"currency.xml\" defaultCurrency=\"EUR\" precisionStep=\"8\"/>\n<field name=\"price\" type=\"currency\" multiValued=\"false\" indexed=\"true\" required=\"false\" stored=\"true\"/> \n\nSending a stats query to get the min/man price in the result set leads to rounding errors for index documents with a price with certain digits after the decimal point.\nThe following stats-string is used in the stats query:\nStats-string\nstats=true&stats.field={!func}currency(price,EUR)\n\n\n\nExample 1:\nIndex document with\n\"price\":\"209.90000,EUR\"\n\nStats query only for this document (with additional fq-filter using the id) returns:\n  \"stats\":{\n    \"stats_fields\":{\n      \"currency(price,EUR)\":{\n        \"min\":209.89999389648438,\n        \"max\":209.89999389648438, \n        ...\n\nExample 2:\nIndex document with\n\"price\":\"295.95000,EUR\",\n\nStats query only for this document (with additional fq-filter using the id) returns:\n\"stats\":{\n    \"stats_fields\":{\n      \"currency(price,EUR)\":{\n        \"min\":295.95001220703125,\n        \"max\":295.95001220703125,\n        ...\n\nNow if you want to determine a price range to show to the user (min and max price in the index for the current constraints), you can not safely use the stats function: if you round the result 295.95001220703125 to a price with two digits after the decimal point you get: 295.95. Now if you use 295.95 as the max price of the range, you will not find documents which actually have a price 295.95001220703125 and not 295.95000 in the second example. The stats function returned 295.95001220703125 but we don't know if it is a rounding error or a real price. Note, that if a price has a different currency, the conversion to EUR (default currency) can also produce a result with a lot of decimal places so you have to rely on accuracy of the stats function. \nSo it is not a solution to round an inaccurate result to determine the max price (if you round the inaccurate result down, you get 295.95 but you will not find documents with an other currency equal to for example 295.951 EUR, so you should not round down. If you round the inaccurate result up you get: 295.96 but it is not the real price of the document in the second example).\n\nThe min and max stats function should return an accurate result (example 1: 209.9 EUR, example 2: 295.95 EUR)\n\nThe SolrJ interface of Solr in Java returns a result of min/max stats function as double, but double can provide inaccurate results for currency fields and currency conversion, please consider using BigDecimal.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-22T14:16:11+0000",
            "content": "While testing the SQL interface I also ran across strange results when performing min/max on the version field which is a long. The stats component appears to treat longs as doubles and then has floating point errors which return incorrect long values.\n\nI think it makes sense to review how numbers are being handled by stats component and compare it with faceting.\n ",
            "author": "Joel Bernstein",
            "id": "comment-15936376"
        }
    ]
}