{
    "id": "SOLR-4354",
    "title": "Replication should perform full copy if slave's generation higher than master's",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [
            "4.2"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "We have dual masters each incrementally indexing from our MySQL database and sit behind a virtual hostname in our load balancer. As such, it's possible that the generation numbers between the masters for a given index are not in sync. Slaves are configured to replicate from this virtual host (and pin based on source/dest IP hash) so we can add and remove masters as necessary (great for maintenance). \n\nFor the most part this works but we've seen the following happen:\n\n\tSlave has been pulling from master A\n\tMaster A goes down for maint and now will pull from master B (which has a lower generation number for some reason than master A).\n\tSlave now tries to pull from master B (has higher index version than slave but lower generation).\n\tSlave downloads index files, moves them to the index/ directory but these files are deleted during the doCommit() phase (looks like older generation data is deleted).\n\tIndex remains as-is and no change.",
    "attachments": {
        "SOLR-4354.patch": "https://issues.apache.org/jira/secure/attachment/12566471/SOLR-4354.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Amit Nithian",
            "id": "comment-13562495",
            "date": "2013-01-25T07:24:34+0000",
            "content": "My fix will force a full copy if the slave's generation is greater than the master's generation. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13562690",
            "date": "2013-01-25T13:55:20+0000",
            "content": "Amit, I don't complete understand the problem.\n\nSlave now tries to pull from master B (has higher index version than slave but lower generation)\n\nSay, slave has generation G and version V and master(B) has a higher version V+1 but lower generation G-1. The code right now says:\n\nboolean isFullCopyNeeded = IndexDeletionPolicyWrapper\n           .getCommitTimestamp(commit) >= latestVersion\n-          || commit.getGeneration() >= latestGeneration || forceReplication;\n\n\n\nSince master's generation is lower than slave, a full copy will be forced here. Further, your patch has:\n\n-          || commit.getGeneration() >= latestGeneration || forceReplication;\n+          || commit.getGeneration() >= latestGeneration || (commit.getGeneration() > latestGeneration) || forceReplication;\n\n\n\nI don't see how that changes anything. The second condition on generation is redundant. Did I miss something? "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13562863",
            "date": "2013-01-25T17:38:15+0000",
            "content": "My apologies that was embarrassing. I was looking at the 4.0 code that we use and not the 4.1 code which has this fixed. I blindly copied my code to trunk without doing a proper code refresh (so much for late night working).\n\nAgain please accept my apologies. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13562868",
            "date": "2013-01-25T17:46:42+0000",
            "content": "No worries Amit - looks like this was a dupe of SOLR-4303. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653683",
            "date": "2013-05-10T10:32:39+0000",
            "content": "Closed after release. "
        }
    ]
}