{
    "id": "SOLR-5759",
    "title": "increasing hl.fragsize loses part of the search term",
    "details": {
        "affect_versions": "4.4",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "When using the highlighter, and increasing the fragsize from 100 (the default) to 200, sometimes the search term is no longer entirely contained by the returned fragment, even though it was in the smaller snippet.\n\nFor instance:\n\nhttp://host/solr/index/select?q=(\"Tony+Yet\"+AND+exact_text:\"Tony+Yet\")&wt=json&indent=true&hl=true&hl.fl=title,summary,extracted_text&hl.simple.pre=<em>&hl.simple.post=</em>&hl.fragsize=100\n\nresults in the fragment:\n\n\"7618861\":\n{\n      \"extracted_text\":[\" enterprise forward.\\n\\n<em>Tony</em> <em>Yet</em>, one of the centre's organisers, explains: \\\"I think what Hong Kong needs\"]}\n,\n\nwhereas:\n\nhttp://host/solr/index/select?q=(\"Tony+Yet\"+AND+exact_text:\"Tony+Yet\")&wt=json&indent=true&hl=true&hl.fl=title,summary,extracted_text&hl.simple.pre=<em>&hl.simple.post=</em>&hl.fragsize=200\n\nresults in:\n\n\"7618861\":\n{\n      \"extracted_text\":[\" interested in social issues, as well as mentorship for upcoming enterprises.\\n\\nAs in the UK, it is also creating the community of people, skills and ideas that is needed to push social enterprise forward.\\n\\n<em>Tony</em>\"]}\n,\n\nBoth reference roughly the same position from the same field, but I can't for the life of me imagine why the larger fragment would shift to the left so far as to drop half of the search term.\n\nIf desirable, I can upload the entire json results for both requests.\n\nLet me know if there is any other information I can supply, or checks I can perform.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13907976",
            "date": "2014-02-21T05:27:50+0000",
            "content": "Let me know if there is any other information I can supply, or checks I can perform.\n\neric: the most useful ting you could provide us to help understand this problem is self contained reproducible steps – ie: that include all the neccessary configs & data.  \n\nIf you're comfortable writing a JUnit test that's by far the most helpful, but almost as useful would be if you could just give an example of a single document that can be indexed against the example schema.xml, followed by a sample query that shows the problem.  (or, if you are unable to reproduce the problem with the example configs, please attach a full set of configs that can be used to reproduce the problem)\n "
        }
    ]
}