{
    "id": "SOLR-5080",
    "title": "Ability to Configure Expirable Caches (use Google Collections - MapMaker/CacheBuilder for SolrCache)",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "We should be able to configure the expirable caches, especially for filterCaches. In some cases, the filterCaches are not valid beyond certain time (example 5 minutes). \n\nGoogle collections has MapMaker/CacheBuilder which does allow expiration\nhttp://google-collections.googlecode.com/svn/trunk/javadoc/com/google/common/collect/MapMaker.html\n\n\nhttp://docs.guava-libraries.googlecode.com/git/javadoc/com/google/common/cache/CacheBuilder.html\n\n\nSolrCache, LRUCache etc can be implemented with MapMaker or CacheBuilder",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13721490",
            "date": "2013-07-27T01:49:29+0000",
            "content": "I don't really understand this. You'll have to outline what cases you're talking about before this gets much traction. Caches are invalidated whenever a new searcher is opened, and since this happens whenever a hard commit (openSearcher=true) or a soft commit happens, I really don't see how this is a problem. And since you can't search anything that hasn't had a searcher opened on it, I don't see the problem. "
        },
        {
            "author": "Kranti Parisa",
            "id": "comment-13721993",
            "date": "2013-07-28T16:37:26+0000",
            "content": "Sure, new searcher will invalidate the caches. But the use cases are we don't want to expire the other caches than FilterCache. And for us the filters are time bounded, for every 5 minutes the availability changes. I am trying to set up a multi core environment and use joins (with FQ). Replication happens for every 30 min. If we open a new searcher for every 5 min, then all the other caches are also invalidated and during runtime it may cost us to rebuild those caches. Instead of that, the idea is to have a facility to configure the FilterCaches with 5 min expiration policy on one of the cores (where availability changes every 5 min) so that we can maintain the JVM sizes which will also be an imp factor on high load.\n\nSo, you suggest to open new searcher which will invalid all the caches on the specific core? "
        }
    ]
}