{
    "id": "SOLR-2616",
    "title": "Include jdk14 logging configuration file",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-BETA",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The /example/ Jetty Solr configuration should include a basic logging configuration file.  Looking at this wiki page: http://wiki.apache.org/solr/LoggingInDefaultJettySetup  I am creating this patch.",
    "attachments": {
        "SOLR-2616_jdk14logging_setup.patch": "https://issues.apache.org/jira/secure/attachment/12483456/SOLR-2616_jdk14logging_setup.patch",
        "SOLR-2616.patch": "https://issues.apache.org/jira/secure/attachment/12535736/SOLR-2616.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13061670",
            "date": "2011-07-07T23:28:11+0000",
            "content": "Seems like a good idea - any objections? "
        },
        {
            "author": "Chris Male",
            "id": "comment-13061720",
            "date": "2011-07-08T02:04:32+0000",
            "content": "+1 "
        },
        {
            "author": "Bill Bell",
            "id": "comment-13061791",
            "date": "2011-07-08T06:34:59+0000",
            "content": "+1 please!! "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13061873",
            "date": "2011-07-08T10:07:28+0000",
            "content": "+1 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13061976",
            "date": "2011-07-08T14:22:53+0000",
            "content": "So while I'm pro putting the logging config file in for easy use, I'm not so sure about wiring it up out of the box. Perhaps I'm just over used to things going to the console while starting/deving with Solr - but it has become something I've gotten used to \n\nI was thinking we just put the file there, and modify any doc to alert that you can also start Solr with a -D command to use the example logging config file.\n\nI could see going either way though.\n\nThoughts? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13061978",
            "date": "2011-07-08T14:26:14+0000",
            "content": "what will wiring it up out of box do to tests (e.g. example tests)?\n\nWill running the tests now cause jetty to create files outside of the build/ folder? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13061984",
            "date": "2011-07-08T14:34:48+0000",
            "content": "It will be an issue with tests as is I believe, but nothing we couldn't work around. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13061991",
            "date": "2011-07-08T14:45:38+0000",
            "content": "The logging configuration file I provided does not log to a file nor does it suppress logging to the console.  There is some commented configuration to make it easier to log to a file. The net perceived effect of applying this patch should be no change. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13062000",
            "date": "2011-07-08T14:58:07+0000",
            "content": "The logging configuration file I provided does not log to a file nor does it suppress logging to the console. \n\nThe question in my mind is not what the patch does, but what should we do.\n\nIf we want this as an example that is not hooked up, my preference would be to let the user know he should use -D to hook up the sample log file - not configure it in jetty.xml - we should still stay somewhat logging framework agnostic.\n\nIn both cases I would prefer that the default log.properties file use the FileHandler rather than ConsoleHandler though. We should give something close to what you actually might want to use - which is not to setup logging to log to the console.\n\nFirst I'm gathering feedback from others though.\n\nMy current leaning is to doc the wiki and what not to mention the sample log props and use of -D to put it in action, and to setup the default log props to log to the ./logs dir. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13062002",
            "date": "2011-07-08T15:05:05+0000",
            "content": "Ok.\n\nThe main thing I wanted to accomplish in this patch, was to make it easy for me to enable debug logging for a particular logger and to actually see the results.  Before this patch, the current state, I could use the logging admin page to enable debug logging for a known Solr logger but the debug output wouldn't go anywhere because the default threshold for the console logger is INFO. This patch includes a commented line to lower the console threshold.\n\nFYI I still hate JDK14 logging (aka JUL); but nonetheless it's the default as provided with Solr. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13062004",
            "date": "2011-07-08T15:09:53+0000",
            "content": "\nMy current leaning is to doc the wiki and what not to mention the sample log props and use of -D to put it in action, and to setup the default log props to log to the ./logs dir.\n\nyeah as long as we dont somehow create test meddling, I'm happy! There is already some hacks in the build somehow related to this:\n\nin lucene/common-build.xml: <property name=\"tests.loggingfile\" value=\"/dev/null\"/>\nand in the JUnitResultFormatter to reboot logging for each test case: \n try {\n      LogManager.getLogManager().readConfiguration();\n    } catch (Exception e) {}\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13062006",
            "date": "2011-07-08T15:18:32+0000",
            "content": "My current leaning is to doc the wiki and what not to mention the sample log props and use of -D to put it in action, and to setup the default log props to log to the ./logs dir.\n\nThat's a good plan I think.  It does seem important for newbies to get the instant console feedback of \"address already in use\" or other exceptions.  I actually find it pretty useful myself (when I forget that I already have an instance running, or just for seeing requests come in by default, etc).\n\nWe can also document it right in the example/README.txt! "
        },
        {
            "author": "David Smiley",
            "id": "comment-13088120",
            "date": "2011-08-20T03:44:25+0000",
            "content": "It's been a while with no activity so I just want to agree with Mark's proposal:\n\n\tDon't wire up the log file by default\n\tInclude a log file that logs to files.\n\tAdd to documentation.\n\n\n\nI think the provided config file should log to the console at INFO threshold, and log to files at DEBUG threshold (or \"finer\" or whatever JUL calls it) – these are defaults, I believe any way. There will be no changes to default categories and so nothing will actually log at these detailed levels until they are changed by the user. I also think there should be a prominent notice on the logging jsp page to tell users they are not going to see the more detailed log levels in Solr's default setup without making changes to the logging configuration. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106448",
            "date": "2011-09-16T14:51:08+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13177249",
            "date": "2011-12-29T16:27:33+0000",
            "content": "Sorry about the delay - I'm going to try to tackle this soon. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13264929",
            "date": "2012-04-30T13:32:28+0000",
            "content": "Feel free to take this from me David. It has taken me to long to get to it. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13264966",
            "date": "2012-04-30T15:05:28+0000",
            "content": "Noted.  I'll mentally ad this to my backlog  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13409816",
            "date": "2012-07-09T20:29:22+0000",
            "content": "I'll commit this one. Here is the patch - will commit soon. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13410367",
            "date": "2012-07-10T14:12:20+0000",
            "content": "Committed - lets make further improvements in new issues. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412236",
            "date": "2012-07-11T22:31:41+0000",
            "content": "hoss20120711-manual-post-40alpha-change "
        }
    ]
}