{
    "id": "SOLR-4272",
    "title": "Documentation for CountFieldValuesUpdateProcessorFactory is missing solr.RunUpdateProcessorFactory in the example",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The JavaDoc for CountFieldValuesUpdateProcessorFactory shows a sample processor chain using the processor. \n\nHowever, the example does not finish solr.RunUpdateProcessorFactory which means if somebody copies the example, they may take very long time to see why the updates are not actually happening (speaking from experience here).\n\nIt would be good to update the example to include the extra line (and maybe give the processor name attribute).",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13546490",
            "date": "2013-01-08T01:29:57+0000",
            "content": "Hmmm... the exclusion of RunUpdateProcessor was intentional in order to keep the example on point with only what was intentionally being discussed in the docs.  but i can see  how it might confuse folks.\n\nI think perhaps the best fix would be to eliminate the \"<updateRequestProcessorChain>\" tags so only the \"inner\" xml is provided and it's clear people should cut/paste into an existing chain (not attempt to use as an entire chain)\n\nthoughts? "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-13546497",
            "date": "2013-01-08T01:39:44+0000",
            "content": "How about ... before and after to indicate that more stuff could be there? Or remove outer tags like you suggest. Either way should work. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13546545",
            "date": "2013-01-08T02:38:16+0000",
            "content": "[trunk commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1430116\n\nSOLR-4272: doc sample xml tweaks to reduce confusion if people cut/paste "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13546550",
            "date": "2013-01-08T02:46:35+0000",
            "content": "How about ... before and after to indicate that more stuff could be there?\n\ni thought about that, but it seems like that would just get in the way in the \"cut and paste\" situation, because it's something that would be in the <pre/> tags that you'd have to conciously avoid during the \"cut\" stage.\n\nI cleaned up a bunch of these xml snippet examples to remove the udpateProcessorChain tags, as well as fixing a bunch that didn't have it to remove the superfluous trailing newlines.\n\nCommitted revision 1430116.\nCommitted revision 1430118. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13546551",
            "date": "2013-01-08T02:50:35+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1430118\n\nSOLR-4272: doc sample xml tweaks to reduce confusion if people cut/paste (merge r1430116) "
        }
    ]
}