{
    "id": "SOLR-5958",
    "title": "Document (and fix) numShards and router selection parameter in SolrCloud",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "documentation",
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Right now numShards works in rather mysterious ways (unless you know how it works). We should clearly document the following:\n\n\tIf we start SolrCloud with bootstrapping, without mentioning numShards parameter, it defaults to 1 and also defaults the router to 'implicit'.\n\tMentioning numShards param, defaults the router to compositeId.\n\tThough the bootstrap does not treat numShards as a required param, the Collection API does and throw an error if we don't specify numShards.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Noble Paul",
            "id": "comment-14068340",
            "date": "2014-07-21T09:22:39+0000",
            "content": "Though the bootstrap does not treat numShards as a required param, the Collection API does and throw an error if we don't specify numShards.\n\nThe collection API is not used to create the collection, but the STATE command does that. The STATE command would fail if numShards is not present, but the nodes will always send the value \"1\"  if nothing else is configured \n\nBut the collection API has to use some numShards for a non 'implicit router' collection . Hence the router is implicit\n\nProbably we need our documentation to improve "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-16054839",
            "date": "2017-06-19T22:16:27+0000",
            "content": "Coming back to this after a really long time. It's a low hanging one, and would make things easier for the end user to understand if we standardize it.\nShould we default numShards to 1 and keep things simple? We should segregate the router selection, and numShards and have simple defaults for both.\nDefault numShards = 1, and router = compositeId (so the user can come back later and split shard, etc.). "
        }
    ]
}