{
    "id": "SOLR-6260",
    "title": "Rename DirectUpdateHandler2",
    "details": {
        "affect_versions": "6.0",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "\"DirectUpdateHandler\" was removed, I think in Solr 4. DirectUpdateHandler2 should be renamed, at least remove that \"2\". I don't know really what \"direct\" means here. Maybe it could be renamed to \"DefaultUpdateHandler\", or \"UpdateHandlerDefaultImpl\", or other good suggestions",
    "attachments": {
        "SOLR-6260.patch": "https://issues.apache.org/jira/secure/attachment/12656774/SOLR-6260.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14067800",
            "date": "2014-07-20T04:33:13+0000",
            "content": "Simple search and replace to DirectUpdateHandler. Tests are passing.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14067805",
            "date": "2014-07-20T04:56:29+0000",
            "content": "Perhaps SolrUpdateHandler. It should really be our only one, and goes along with names like SolrIndexWriter and SolrCore and SolrIndexSearcher. We only really let you override it as an advanced unsupported thing, and we really don't want to have to maintain more than one implementation ourselves. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14067808",
            "date": "2014-07-20T05:35:07+0000",
            "content": "I think that sounds good. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14067809",
            "date": "2014-07-20T05:38:07+0000",
            "content": "+1 for SolrUpdateHandler "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14067831",
            "date": "2014-07-20T07:33:52+0000",
            "content": "renamed to SolrUpdateHandler "
        },
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-14067839",
            "date": "2014-07-20T08:00:19+0000",
            "content": "On a similar vein, SearchHandler should be SolrSearchHandler then? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14067935",
            "date": "2014-07-20T14:14:58+0000",
            "content": "I don't know really what \"direct\" means here.\n\nIt's right in the class javadoc comment:\n\n/**\n * <code>DirectUpdateHandler2</code> implements an UpdateHandler where documents are added\n * directly to the main Lucene index as opposed to adding to a separate smaller index.\n\n\n\nIn general, renames like this can cause more pain than the meager benefits they provide.\nThis would break compatibility for users schemas who are trying to upgrade.\n\nRegarding renaming public APIs in general:\nhttps://issues.apache.org/jira/browse/SOLR-3830?focusedCommentId=13454299&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13454299\n\nAlong the lines of \"collective knowledge\", that includes a whole ton of mail archives, blogs, books, etc, that refer to this class (or it's shortened name DUH2... which actually works to type into the class finder in intellij). "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14067944",
            "date": "2014-07-20T14:33:48+0000",
            "content": "At some point you have to start cleaning up ugly baggage though. 5x seems a great place to clean this one up. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14067948",
            "date": "2014-07-20T14:43:49+0000",
            "content": "the meager benefits\n\nI think if you look at this very narrowly, perhaps it seems meager. But it's this kind of issue that makes the code unattractive to deal with. Facilitating the clean up for users that want to fix it will encourage those users to contribute more. Cleaning up these fairly ugly code warts (I've particularly been annoyed by this DirectUpdateHandler2) will also help and encourage newer contributors.\n\nWe need to encourage and facilitate cleaning up the crap that we have always said can't be cleaned up. If we have to compromise on some of it, fine, make it only in 5x like we did with 4x. But let's not settle for crap because of back compat. Back compat will sink our ship. It's important to consider, but we can't let it strangle us. Major releases need to allow freedom to fix at a minimum.  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14067963",
            "date": "2014-07-20T15:38:11+0000",
            "content": "We need to encourage and facilitate cleaning up the crap\n\nI agree.  But I disagree that a simple rename will accomplish that. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14067964",
            "date": "2014-07-20T15:52:39+0000",
            "content": "In fact I'd love to see DUH2 / SolrCoreState  and related code refactored and cleaned up.  But back compat is not holding us back... the difficulty there is correctness I think.  This has to do with the type of code it is.  For example, refactoring & changing a faceting/search method is easy - it's deterministic without a lot of threading/concurrency concerns and we have random tests for correctness. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14067965",
            "date": "2014-07-20T15:54:32+0000",
            "content": "It's just a part of it. And the pushback against it is the thousand pin pricks that have kept so many ugly things around for so long.\n\nWhen we change big things, the repercussions are never that bad.\n\nWhen we let newer users that see ugly things change them, we don't discourage them and give the impression that it's hard to change ugly stuff and don't even bother trying because we will slowly beat you back on each issue.\n\nThere is a level of back compat that we support at http that I support 100%. Beyond that, we have always been fairly loose really. I've broken an insane amount of back compat stuff myself - to get major new features to work or fix broken design. A lot of that in 3x or 4x, not over a major version. Now we have all those advances, and the screams of pain along the way where not heard.\n\nI think, until we are in a better spot code wise, we should favor improvement over back compat beyond the http layer. Even in 4x. But good god, for 5x, let the flood gates open. It's way too easy to error on stifling the project. We need to error way the other way IMO. Until a lot of the baggage is dealt with and SolrCloud is first class and in shape, we need to error way the other way. If we want to compete as a search engine over the next decade, we need to take off the leg weights.\n\nDirectUpdateHandler2 should die. We all know it. Let's let it go. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14067973",
            "date": "2014-07-20T16:23:56+0000",
            "content": "I've broken an insane amount of back compat stuff myself - to get major new features to work or fix broken design.\n\nExactly... back compat is only one factor of many in these decisions.\n\nLooking at this patch specifically, on it's own merits, it doesn't seem worth it to me.\nAs far as encouraging new users to make changes, I'd rather encourage them to make more meaningful changes.  If someone wants to refactor DUH2 (or implement a new one and remove the old one), have at it!  I won't stand in the way because of back compat.  Maybe correctness concerns, but not back compat. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14067981",
            "date": "2014-07-20T16:56:32+0000",
            "content": "It's right in the class javadoc comment:\nI see, I missed that. \nSorry for my ignorance, but does this comment make sense now? Is it possible in Solr to add documents to a different index (other than having a separate core) or is this comment outdated?\n\nI agree with Mark, cleaning ugly code should be encouraged, and a class called “DirectUpdateHandler2” is an ugly name. I someone new to Solr sees this they would ask “Why is it called like this? Why is this ‘2’? Is there another number ‘1’? does it accomplish the same?”, and responding “It’s for historic reasons” is a bad response I think. \n\nLooking at this patch specifically, on it's own merits, it doesn't seem worth it to me.\n\nWhat does that mean? I can clean the patch if needed. As I said, I did  mostly a search and replace, maybe there is more to be done. \n\nAs far as encouraging new users to make changes, I'd rather encourage them to make more meaningful changes\n\nI find this change as a step forward, that’s why I suggested it.  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14067984",
            "date": "2014-07-20T17:11:01+0000",
            "content": "> Looking at this patch specifically, on it's own merits, it doesn't seem worth it to me.\nWhat does that mean?\n\nIt means that the disadvantages of this specific rename outweigh the advantages.  I was trying to separate this specific rename from lumping it in with a broader fallacy of \"if we can't change this, then we can't make bigger changes\".\n\nOf course I fear this thread will again demonstrate Sayre's law  "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-14068062",
            "date": "2014-07-20T22:23:06+0000",
            "content": "+1 to the rename.  If we're concerned with it breaking schemas, then maybe keep DirectUpdateHandler2 in 4x as an empty class that extends SolrUpdateHandler?  And then nuke it in trunk. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14068063",
            "date": "2014-07-20T22:23:23+0000",
            "content": "I've wanted to fix this since 2008. When can it be fixed, never? In 2028?\n\nThere is a history and a pattern of pushing back on stuff like this. All it does is discourage new contributors and hobble willing contributors. \n\nIf we changed, would anything crazy or bad happen? No. If we leave it, it's just a pattern of screwing the project from a high level under the guise of \"small improvements not being worth it\".\n\nIMO, this is push back for push backs sake. Forget committing this so that Tomas can move on and improve the next little thing. Let's tie him up and red tape and squeeze the life out of him so that he doesn't do anything crazy, like get a little enthusiasm and momentum on improving our crap load of ugly technical debt. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-14068068",
            "date": "2014-07-20T22:45:35+0000",
            "content": "Could we at least remove it from the example solrconfig in 5.0? Change the name as you see fit, and make it the default for the <updateHandler> \"class\" attribute? I mean, it always was kind of a \"wart\" to have to specify that kind of internal detail externally like that.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14068078",
            "date": "2014-07-20T23:41:36+0000",
            "content": "I mean, it always was kind of a \"wart\" to have to specify that kind of internal detail externally like that.\n\nI don't even really consider changing the updatehandler supported. It's a super expert thing that's subject to break in all kinds of ways at any time (as it has over the years).\n\nI'm def +1 on taking it out of the config. I like the idea of exposing it for people to cry crazy stuff, but we must be free to treat this stuff as internal.  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14068330",
            "date": "2014-07-21T09:04:35+0000",
            "content": "Reasonable people can disagree.  One should not have to face hurtful personal attacks when they do. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14068645",
            "date": "2014-07-21T15:39:37+0000",
            "content": "There is nothing person in anything I wrote. Feel free to pull out what you think is and I'll correct it.\n\nReasonable people can disagree, and the same culture that had Lucene locked up for years in the mid 2000's can lock up Solr here.\n\nWe need a couple things:\n\n\n\tTo transition to a SolrCloud first world where everything is sensible and not \"because of history baggage\".\n\tTo encourage and develop new contributors.\n\n\n\nPushing back on this simple issue and issues like it is part of an overall culture that hurts both those things.\n\nWhen I joined, I wanted to fix crap like this too. I was slowly beaten down over time until I just accepted that a lot of our code was crap. I stopped even trying to fix it. I won't be part of beating that out of a new generation of committers. This needs to be fixed. The benefits are bigger than you understand IMO. And the benefits of not doing it, are super minor. Solr needs to worry about the future, not the past. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14068652",
            "date": "2014-07-21T15:43:36+0000",
            "content": "If we cannot come to consensus on this issue, I think we should put it to a vote. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-14068669",
            "date": "2014-07-21T15:51:40+0000",
            "content": "We should not hang on to an old name because it was there for some time\n\n+1 to make a name change "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14069029",
            "date": "2014-07-21T18:48:02+0000",
            "content": "-1\n\nThe benefits to this simple class rename are blown way out of proportion by fallaciously linking it to real improvements.  Further, if you're worried about attracting new committers, fostering a more civil (and less aggressive and combative) environment would go a long way.\n\nAlthough there are multiple minor downsides (countering the minor upside), I'll remove my -1 if we can at least implement back compat with existing solrconfigs.  It should be trivial. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14069051",
            "date": "2014-07-21T19:02:29+0000",
            "content": "-1 to breaking compatibility in 4.x (but I'm quite sure we weren't debating that, were we?)\n\nFurther, if you're worried about attracting new committers, fostering a more civil (and less aggressive and combative) environment would go a long way.\n\nBig +1 and thank you for putting it so well. This has become a big pain point. We're all working towards the same goal of making Solr better, we can surely be more courteous to each other. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14069062",
            "date": "2014-07-21T19:07:43+0000",
            "content": "I'll remove my -1 if we can at least implement back compat with existing solrconfigs. \nSure, I can do this\n-1 to breaking compatibility in 4.x (but I'm quite sure we weren't debating that, were we?)\nYes, I was thinking on doing this change in trunk only. If merged to 4.x it should have been in a backward compatible way.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14069064",
            "date": "2014-07-21T19:08:48+0000",
            "content": "I'll remove my -1 if we can at least implement back compat with existing solrconfigs. It should be trivial.\n\nOf course we would handle back compat where it makes sense. That's an absurd condition.\n\nIn any case, if you want to -1 over a vote that shows Solr developers want this change, be my guest. We will see how long that works out for you.\n\nFurther, if you're worried about attracting new committers,\n\nI think the current culture of push back is worse than combating those that foster the pushback. I plan on continuing to push very hard for change in our obstructionist culture - one that I've played my part in at times too. It's necessary. Being aggressive is necessary. I can find a variety of issues that Tomas has filed that have a quick wet blanket thrown on them. We have done everything we can to push him away rather than pull him in from where I am standing. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14069076",
            "date": "2014-07-21T19:18:11+0000",
            "content": "Being aggressive is necessary.\n\nI disagree.  It wasn't necessary in the early days of Lucene/Solr.\nAlthough, I'll partially agree - the culture has changed such that one often does now need to be aggressive else those more aggressive will run right over you.  It's sad.  It makes me enjoy participating here much less.  But it's only currently \"necessary\" because the culture has changed to allow it. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14069078",
            "date": "2014-07-21T19:22:29+0000",
            "content": "Yes, I was thinking on doing this change in trunk only. If merged to 4.x it should have been in a backward compatible way.\n\nI meant implementing back compat in trunk too - making it easy for users to upgrade is important (as long as it's not a burden of course.) "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14069079",
            "date": "2014-07-21T19:22:49+0000",
            "content": "It's currently necessary because the old culture was obstructionist. Same as the old Lucene culture. It's a great culture for maintenance mode. Lucene changed that because of a couple aggressive people. The results speak for themselves. I've watched people spin in circles for years trying another approach. We have made very little progress on many simple, common sense issues. I'm ready to make some progress or go home. To let contributors help us. To get their patches in. To help them work around problems rather than just put up easy to lay down road blocks.\n\nWe have a lot to do. Our current pace, the pace of the past 5+ years, it won't cut it. It's no good. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14069110",
            "date": "2014-07-21T19:36:25+0000",
            "content": "We're all working towards the same goal of making Solr better ... more courteous to each other.\n\nWe all have a variety of different goals and motivations actually. Let's not pretend everyone is simply working towards making Solr better. That's a lot of people and changing motivations to account for. \n\nWhere are people not being courteous to each other in this thread? The absence of lively debate tends to mean one thing: people don't care.\n\nNow Yonik seems to have taken my broader message personally - the message of , \"We tend to push back on everything and not help contributors, especially promising contributors, get things done. We favor obstructionism because it's low effort.\"\n\nBut it's not meant for him personally. Everyone has played their part in this. I'm not quite sure where I called anyone out for any personal behavior. I called out what I think is happening to Tomas - the wet blanket responses he has received. I think the behavior of the project must change. That these issues must get in. And if you think that happens easily, guess again. I can find a lot of issues that are killed with a comment or two. It takes something like this to get these issues over the hump - to make an issue out of this. To cause discussion around this. To move forward. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14069167",
            "date": "2014-07-21T19:52:55+0000",
            "content": "It takes something like this to get these issues over the hump - to make an issue out of this.\n\nSee, I was looking at this issue just based on it's technical merits.  That should always be OK. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14069183",
            "date": "2014-07-21T20:00:24+0000",
            "content": "That was okay. But so is my coming to try and make the issue happen anyway.\n\nWhen someone with enough merit comes in and only mentions, I'm pretty much against this, it has a strong chilling effect!\n\nIf you had come in with, \"I have these concerns, but if we do this or this and/or figure out this, we could probably make this happen\", I wouldn't have felt so much that I have to try and make sure this issue still happens.\n\nI've just seen too many of these issues die summarily with light and easy pushback. For some crap JIRAs, perhaps that is sensible. Given the history of Tomas and his recent contributions and the quality of work I have seen and my own personal history and interest in this change...here we are!\n\nHowever, I'm not saying you shouldn't have done whatever you want to do. I'm responding to it. I'm trying to start a tone going forward that will let us dump single core and non cloud mode and all the baggage that makes the system not as beautiful as it needs to be. Developers want to work on beautiful, not ugly. That's our largest issue. Not any internal community communication.\n\nNow when I look at the pace of this happening, we will be done in 5-10 years. Perhaps. It's not going to cut it. We will be marginalized. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-14069198",
            "date": "2014-07-21T20:07:12+0000",
            "content": "I noticed that the SolrCore code does in fact default the update handler class to DUH2/SUH if the \"class\" attribute is not specified, so maybe the upgrade instructions can simply be for users to \"remove the <updateHandler> class attribute\", rather than for them to have to learn yet another internal name.\n\nAnd I would reiterate my proposal to remove the \"class\" attribute from the example solrconfig.xml files, for both 5.0 and 4.x.\n\nEither way, the patch should include changes to the \"Upgrading\" section of CHANGES.txt.\n\nDo those three things and then I'm an easy +1! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14069202",
            "date": "2014-07-21T20:12:08+0000",
            "content": "I noticed that the SolrCore code does in fact default the update handler class to DIH2/SIH if the \"class\" attribute is not specified\n\nThen we should probably remove it in the example solrconfigs.  That will also lessen the pain next time someone comes up with a better name  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14069233",
            "date": "2014-07-21T20:32:35+0000",
            "content": "That will also lessen the pain next time someone comes up with a better name \n\nThat's an important part of this issue too. We should clearly document that this is an expert and internal class. We need to own this, and right now it's in a grey area. What better time to clear up that it's internal and not user supported and rename it all in one. Take it out of config, document at as expert/internal.\n\nUnless someone has a burning desire to call it NewUpdateHandler3 in a couple years, I think a new name will stick for some time. Anytime you name a class Foo2, I think you can expect someone is going to want to \"fix\" it later. Call it Foo or Bar and you will get less name change demand. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-14069850",
            "date": "2014-07-22T05:31:57+0000",
            "content": "I meant implementing back compat in trunk too\nI kept the DirectUpdateHandler2 class and now extends for SolrUpdateHandler. That should allow users to keep solr.DirectUpdateHandler2 on their solrconfig or extend from it. Yonik Seeley let me know what you think. I added a test for backward compatibility.\nI also marked it as deprecated.\n\nAnd I would reiterate my proposal to remove the \"class\" attribute from the example solrconfig.xml files\nI removed the class attribute from the example solrconfig files. I kept it in most test files though.\n\nWe should clearly document that this is an expert and internal class\nI added comments in the class and example solrconfig files.  "
        }
    ]
}