{
    "id": "SOLR-11596",
    "title": "SolrJ clients -- create internal HttpClient objects with increased thread capability",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "7.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The HttpClient object that various SolrClient implementations create has HttpClient's default per-destination thread limit of two.  I'm not sure why they went with such a low default, but that's out of our hands.  The low default makes default SolrClient objects that are thread-safe, but basically unable to handle more than two threads at the same time.\n\nIncreasing this limit in user programs is very doable by creating a custom HttpClient object, but the amount of code required is fairly extensive.\n\nI think that when our client implementations create an HttpClient object, they should explicitly increase the thread limits to larger default values, and expose configuration knobs for those values in the fluent interface.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-11-02T11:13:49+0000",
            "content": "This is per RFC 2616 recommendation. \n\n\n8.1.4 Practical Considerations\n...\n   Clients that use persistent connections SHOULD limit the number of\n   simultaneous connections that they maintain to a given server. A\n   single-user client SHOULD NOT maintain more than 2 connections with\n   any server or proxy. A proxy SHOULD use up to 2*N connections to\n   another server or proxy, where N is the number of simultaneously\n   active users. \n\n\n\nThe restriction of the number of concurrent connections has been relaxed by RFC 7230 and removed in HttpClient 5.0   \n\nOleg ",
            "author": "Oleg Kalnichevski",
            "id": "comment-16235562"
        },
        {
            "date": "2017-11-19T12:56:48+0000",
            "content": "Poking through the code, it's not clear to me that SolrClient's get the default max-connections-per-route...HttpClientUtil.createClient, eventually filters down to the following line:\n\n\ncm.setDefaultMaxPerRoute(params.getInt(HttpClientUtil.PROP_MAX_CONNECTIONS_PER_HOST, 10000));\n\n\n\n(see direct link here: https://github.com/apache/lucene-solr/blob/master/solr/solrj/src/java/org/apache/solr/client/solrj/impl/HttpClientUtil.java#L246)\n\nAm I missing something here? ",
            "author": "Jason Gerlowski",
            "id": "comment-16258477"
        }
    ]
}