{
    "id": "SOLR-4732",
    "title": "CoreAdmin - SWAP and RENAME with shared instanceDir and no dataDir - problems after Solr restart",
    "details": {
        "affect_versions": "3.5",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "If your cores share an instanceDir but dataDir is not explicitly defined in solr.xml, apparently dataDir is not \"./data\" as it would be when instanceDir is not shared, it becomes (or includes) the name of the core as well.  This results in problems problems with RENAME, and probably SWAP as well.  \n\nThe RENAME will work, with the dataDir still retaining the old name.  When you restart Solr, however, the core will use the new name for the dataDir and create an empty index, ignoring the old one.  Based on this behavior, I believe that if you did a SWAP, after reload the cores would no longer be swapped.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13634531",
            "date": "2013-04-17T22:31:04+0000",
            "content": "This is the solr.xml the user had, on Solr 3.5:\n\n\n<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\n<solr persistent=\"true\">\n  <cores adminPath=\"/admin/cores\">\n    <core name=\"default\" instanceDir=\"./\"/>\n    <core name=\"413a\" instanceDir=\"./\"/>\n    <core name=\"blah\" instanceDir=\"./\"/>\n...\n  </cores>\n</solr>\n\n "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13634540",
            "date": "2013-04-17T22:35:56+0000",
            "content": "I'm not sure how this should be fixed.  SOLR-4662 and SOLR-4725 make some pretty radical changes to how cores work. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13634782",
            "date": "2013-04-18T02:34:41+0000",
            "content": "On IRC, Hoss wondered how this user was able to even get Solr working with this solr.xml.  It became clear when the user said that they have the following in solrconfig.xml:\n\n\n<dataDir>${MYSOLRROOT:/mysolrroot}/messages/solr/data/${solr.core.name}</dataDir>\n\n\n\nOn 3.5, when you rename or swap cores, the solr.core.name property does NOT get updated until you restart Solr.  I have no reason to think that 4.x is any different, but I have not verified this. "
        }
    ]
}