{
    "id": "SOLR-12454",
    "title": "tweak Overseer leadership transition related logging",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Task",
        "fix_versions": [
            "7.5",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Proposed patch to follow.",
    "attachments": {
        "SOLR-12454-overseer-scenario-run.patch": "https://issues.apache.org/jira/secure/attachment/12926956/SOLR-12454-overseer-scenario-run.patch",
        "overseer-scenario-run.sh": "https://issues.apache.org/jira/secure/attachment/12926787/overseer-scenario-run.sh",
        "SOLR-12454.patch": "https://issues.apache.org/jira/secure/attachment/12926619/SOLR-12454.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-05T19:11:11+0000",
            "content": "Attached proposed patch which is intended to make it easier to troubleshoot and debug Overseer leadership transition related problems.\n\ncc/fyi Alan Woodward and Jan Høydahl w.r.t. the earlier SOLR-5563 changes. This here would revert a small number of those info-to-debug changes but the changes are very selective and targetted at code paths that should not happen on a regular basis (e.g. am_i_leader unclear) or that happen infrequently i.e. overseer leadership transition. What do you think? ",
            "author": "Christine Poerschke",
            "id": "comment-16502339"
        },
        {
            "date": "2018-06-05T21:47:03+0000",
            "content": "Can you give background for why such debugging cannot be done by raising the log level for the Overseer to DEBUG on demand? That's what we have debug levels for, not   ",
            "author": "Jan Høydahl",
            "id": "comment-16502549"
        },
        {
            "date": "2018-06-06T08:32:35+0000",
            "content": "The nature of Overseer problems we have seen, is that by the time we realize we have lost the overseer, there is nothing more to do other than bounce to regain a new one. What we need is logging before/during the loss of overseer.\n\nJan Høydahl, by on demand, did you mean dynamically after the fact, or just we should have a custom logging configuration which would set those particular debug statements to log permanently in our setup?  The former wouldn't work (see above), but I that latter might be something we could look at.  I'm curious how others deal with these kinds of issues, or do they fortunately not have them . ",
            "author": "Daniel Collins",
            "id": "comment-16502988"
        },
        {
            "date": "2018-06-06T14:45:15+0000",
            "content": "By dynamic I meant issuing the HTTP command in order to raise certain logging to DEBUG level across the cluster. I'm not sure if overseer debugging is something so common that we should bog down everyone with those low-level logs? Anyone who had Overseer issues once or twice and want to catch the next one could of course configure log4j2.xml if they don't want to run verbose (-v) for all of Solr.\n\nThat said, I have not analysed the proposed patch in detail. If you can isolate the added logging to log events that will only occur during transition then it may be ok. But I don't want another of those log lines spamming the startup sequence or popping up every second just to say \"I'm alive\". Also see related SOLR-12456 which I just filed to try to get rid of spammy DEBUG-level logging from the overseer. ",
            "author": "Jan Høydahl",
            "id": "comment-16503400"
        },
        {
            "date": "2018-06-06T20:41:23+0000",
            "content": "... If you can isolate the added logging to log events that will only occur during transition ...\nYes, that is the intention – the logging is intended to assist not hinder and ideally to assist out-of-the-box when someone hits overseer issues for the first time e.g. due to (external) zookeeper hiccups of some sort.\n\nIn lieu of integration or regression tests, I just attached the overseer-scenario-run.sh script I wrote for my own use to more easily explore the scenarios i.e. download and unpack zookeeper, start external zookeeper, start solr cloud, trigger overseer transition, stop solr, stop zookeeper – that kind of thing.\n\nMy next intended step is to consider both the proposed info as well as the existing info logging for Overseer.java e.g. the Overseer (id=null) closing logging emitted at the start of apparently every solr node seems confusing?\n... don't want another of those log lines spamming the startup sequence or popping up every second just to say \"I'm alive\". ...\nI agree. Spammy logging can hinder log interpretation and troubleshooting.\n... Also see related SOLR-12456 which I just filed ...\nGood find, thanks! ",
            "author": "Christine Poerschke",
            "id": "comment-16503886"
        },
        {
            "date": "2018-06-07T15:48:25+0000",
            "content": "...  Overseer (id=null) closing logging emitted at the start of apparently every solr node seems confusing?\n\nOkay, so this is at the start of almost every solr node excluding the node that wins the overseer election. SOLR-12464 opened for this specifically separately for clarity. ",
            "author": "Christine Poerschke",
            "id": "comment-16504841"
        },
        {
            "date": "2018-06-07T19:04:58+0000",
            "content": "Attached revised SOLR-12454.patch and (not intended to be committed) patch with script to relatively easily explore different overseer scenarios e.g. spontaneous disappearance (here deliberate deletion) of the /overseer_elect/leader node. ",
            "author": "Christine Poerschke",
            "id": "comment-16505118"
        },
        {
            "date": "2018-07-17T19:16:59+0000",
            "content": "Commit e9c6effd07f5bd14ce87c8cea6ced64a33d8d6b0 in lucene-solr's branch refs/heads/master from Christine Poerschke\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e9c6eff ]\n\nSOLR-12454: Tweak Overseer leadership transition related logging for easier troubleshooting. ",
            "author": "ASF subversion and git services",
            "id": "comment-16547001"
        },
        {
            "date": "2018-07-17T19:38:13+0000",
            "content": "Commit df08f56420738aa38b8db011ef956b3b488b86c5 in lucene-solr's branch refs/heads/branch_7x from Christine Poerschke\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=df08f56 ]\n\nSOLR-12454: Tweak Overseer leadership transition related logging for easier troubleshooting. ",
            "author": "ASF subversion and git services",
            "id": "comment-16547026"
        },
        {
            "date": "2018-07-17T19:41:12+0000",
            "content": "Returned to this ticket after some time and as per above have gone ahead and committed the patch – as always though, further comments, suggestions, revisions etc. welcome – thank you. ",
            "author": "Christine Poerschke",
            "id": "comment-16547029"
        }
    ]
}