{
    "id": "SOLR-12887",
    "title": "TRA: document re-dating (question, test, docs)",
    "details": {
        "type": "Sub-task",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Minor",
        "resolution": "Unresolved",
        "affect_versions": "None"
    },
    "description": "This ticket is sort of a combination of a question with small test and documentation additions.\n\nAfter a document is added, can subsequent updates to it include a change of its timestamp? What happens if a timestamp change logically 'moves' the document out of its original collection?",
    "attachments": {
        "SOLR-12887.patch": "https://issues.apache.org/jira/secure/attachment/12944737/SOLR-12887.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16656929",
            "content": "Attached draft illustrative patch. Intuitively:\n\n\tan add/update to redate the document within its existing collection should be just fine, but\n\tan add/update that changes the timestamp to a value outside the existing collection would result in two documents in two collections.\n\tIf two documents are not what is intended by the client then they can do a delete followed by an add instead of just an add/update alone.\n\n\n\nInterestingly the draft patch in its current form suggests that query behaviour is variable when two TRA collections have a document with the same key i.e. sometimes it says \"found 1\" and sometimes it says \"found 2\" even if \"cache=false\" was sent in the query. Could be to do with which url the test's CloudSolrClient used for the requests, haven't yet looked into further. ",
            "author": "Christine Poerschke",
            "date": "2018-10-19T15:23:30+0000"
        },
        {
            "id": "comment-16665423",
            "content": "An unstated assumption is that IDs should be globally unique – just as it is if you were to use a single typical collection and likewise if you were to use an alias across multiple collections \"normally\".  Furthermore we don't expect you will update the timestamp field.  Again, that's consistent with router.field on a standard collection. ",
            "author": "David Smiley",
            "date": "2018-10-26T17:05:22+0000"
        }
    ]
}