{
    "id": "SOLR-6504",
    "title": "Switching exploded war from version 4.10 caused Solr to be unable to start",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I tried upgrading to Solr 4.10 from Solr 4.8.1 by switching the server to use the new Solr 4.10 web application folder (exploded war) - simply by renaming the folder from \"solr_4_10\" to \"solr\" (and the previous \"solr\" to \"solr_old\"), then restarting the server.\n\nThis worked fine, but there was an incompatibility forcing me to switch back to 4.8.1, which I did by renaming the folders again, \"solr_old\" back to \"solr\" and restarting the server.  \n\nHowever on restart, none of the cores could load, giving the following error:\n    org.apache.solr.common.SolrException:org.apache.solr.common.SolrException: java.util.ArrayList cannot be cast to java.util.Map\n\nBy searching I found the previous issue (linked to below), and found this was the same problem - \"_rest_managed.json\" files were being created, and once I deleted them that particular error message went away and most cores could be loaded.\n\nI.e., this appears to be the same issue as:\n\nhttps://issues.apache.org/jira/browse/SOLR-6182\n\nexcept it is caused by a different process.  Either that issue wasn't really resolved, or this is a different problem with the same symptoms.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Timothy Potter",
            "id": "comment-14128723",
            "date": "2014-09-10T16:59:12+0000",
            "content": "I'll take a look "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16323004",
            "date": "2018-01-11T21:34:30+0000",
            "content": "I'm not sure we're going to fix this - it seems a pretty unique use case (switching installs back & forth to upgrade and resolve issues with the upgrade) - and since no one has looked at it yet, it seems unlikely we will.\n\nIf I'm wrong on this assessment, please reopen. "
        }
    ]
}