{
    "id": "SOLR-2556",
    "title": "Spellcheck component not returned with numeric queries",
    "details": {
        "affect_versions": "3.1",
        "status": "Closed",
        "fix_versions": [
            "5.5"
        ],
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The spell check component's output is not written when sending queries that \nconsist of numbers only. Clients depending on the availability of the \nspellcheck output need to check if the output is actually there.\n\n\nSee also:\nhttp://mail-archives.apache.org/mod_mbox/lucene-solr-user/201105.mbox/%3C201105301607.41956.markus.jelsma@openindex.io%3E",
    "attachments": {
        "SOLR-2556.patch": "https://issues.apache.org/jira/secure/attachment/12775379/SOLR-2556.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13106455",
            "date": "2011-09-16T14:51:10+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237038",
            "date": "2012-03-23T20:31:30+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13294757",
            "date": "2012-06-14T01:13:22+0000",
            "content": "when i read this issue, i assumed it was simply a matter of the spellcheck response block not being included if there was no suggestions, but it's more subtle then that.\n\nThese queries don't produce any spellcheck section in the response at all...\n\n\n\thttp://localhost:8983/solr/spell?debugQuery=true&q=1&spellcheck=true&spellcheck.collate=true&spellcheck.build=true\n\thttp://localhost:8983/solr/spell?debugQuery=true&q=9999&spellcheck=true&spellcheck.collate=true&spellcheck.build=true\n\n\n\nBut these queries do (even if that section contains no suggestions)....\n\n\n\thttp://localhost:8983/solr/spell?debugQuery=true&q=______&spellcheck=true&spellcheck.collate=true&spellcheck.build=true\n\thttp://localhost:8983/solr/spell?debugQuery=true&q=asfasdfasdfasdfasdf&spellcheck=true&spellcheck.collate=true&spellcheck.build=true\n\thttp://localhost:8983/solr/spell?debugQuery=true&spellcheck.q=9999&q=9999&spellcheck=true&spellcheck.collate=true&spellcheck.build=true\n\n\n\nNote in particular that last one - using \"spellcheck.q=9999\" causes the empty section to appear, even if it's identical to \"q=9999\"\n\nSkimming the code, the problem seems to relate to the user of the \"queryConverter\", and the fact that it's only used on the \"q\" param (a different code path is used on the \"spellcheck.q\" param) and what happens if no tokens are produced – the \"spellcheck\" block is added to the response inside a conditional block that is only executed if there are tokens.\n\nIt seems like it would be fairly easy to just move the code that adds the block to the response outside of the conditional – but the fact that the two code paths produce different behavior makes me wonder if this isn't semi-intentional?  is the idea that \"your query converter produced no tokens, therefore we assume you don't want any spellcheck results?\"  should it be?\n\n(FWIW: there is a similar condition where no \"spellcheck\" response is generated if there are no dictionaries configured) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412182",
            "date": "2012-07-11T22:26:14+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429835",
            "date": "2012-08-07T03:43:28+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451053",
            "date": "2012-09-07T22:13:02+0000",
            "content": "removing fixVersion=4.0 since there is no evidence that anyone is currently working on this issue.  (this can certainly be revisited if volunteers step forward) "
        },
        {
            "author": "David Smiley",
            "id": "comment-14582296",
            "date": "2015-06-11T18:04:41+0000",
            "content": "I've been investigating this oddity in an app I'm working on and found this issue here.  I agree with Hoss's assessment – I have the same conclusions.  If the current behavior is \"semi-intentional\", it isn't clear it should be; we could ask about the wisdom to James Dyer?.  IMO, FWIW, this is a bug.  Other components, when enabled (e.g. facet=on), output something; it's disconcerting to see nothing from spellcheck from time to time, and makes client parsing code more error prone (didn't expect a null).  I may have time to fix this soon-ish. "
        },
        {
            "author": "James Dyer",
            "id": "comment-14582329",
            "date": "2015-06-11T18:24:34+0000",
            "content": "This looks like a bug to me. "
        },
        {
            "author": "James Dyer",
            "id": "comment-15036520",
            "date": "2015-12-02T20:12:38+0000",
            "content": "Here is a patch with just failing unit tests.\n\nI think the best way to fix this is to make SpellingQueryConverter more robust to recognize digits as terms subject to corrections / suggestions.\n\nI do think the complete absence of the spellcheck section on the response was probably by design.  If there are no terms in the query that can be corrected, it leaves it off altogether. "
        },
        {
            "author": "James Dyer",
            "id": "comment-15036671",
            "date": "2015-12-02T21:26:53+0000",
            "content": "Here is a patch the tests passing.  If everything checks out, I'll commit this tomorrow. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-15038006",
            "date": "2015-12-03T16:11:45+0000",
            "content": "Commit 1717795 from jdyer@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1717795 ]\n\nSOLR-2556: Fix SpellingQueryConverter to recognize terms consisting only of digits "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-15038012",
            "date": "2015-12-03T16:16:16+0000",
            "content": "Commit 1717796 from jdyer@apache.org in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1717796 ]\n\nSOLR-2556: Fix SpellingQueryConverter to recognize terms consisting only of digits "
        }
    ]
}