{
    "id": "SOLR-8664",
    "title": "Support exporting score from the /export handler",
    "details": {
        "components": [
            "Server"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Would be great if we can export the score as well as the ID from a (SolrCloud) Stream.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-09T09:30:03+0000",
            "author": "Akiel",
            "content": "I created this issue in response to Joel Bernstein answer in the solr-user mailing group. Below is a copy of my original question and Joel's answer to help give some context:\n\nExporting scores would be a great feature to have. I don't believe it will\nadd too much complexity to export and sort by score. The main consideration\nhas been memory consumption for every large export sets. The export feature\npowers SQL queries that are unlimited in Solr 6. So adding scores to export\nwould support queries like:\n\nselect id, title, score from tableX where a = '(a query)'\n\nWhere currently you can only do this:\n\nselect id, title, score from tableX where a = '(a query)' limit 1000\n\nCan you create a jira for this and link it to SOLR-8125.\n\nJoel Bernstein\n\n> Hi,\n>\n> I would like to issue a query and get the ID and Score for each matching\n> document. There may be lots of results so I wanted to use the export\n> handler, but unfortunately the current version of Solr doesn't seem to\n> export the Score - I read the comments on\n> https://issues.apache.org/jira/browse/SOLR-5244 (Exporting Full Sorted\n> Result Sets) but am not sure what happened with the idea of exporting the\n> Score. Does anybody know of an existing or future version where this can\n> be done?\n>\n> I compared exporting 100,000 IDs via the export handler with getting\n> 100,000 ID,Score pairs using the cursor mark - exporting 100,000 IDs was\n> an order of magnitude faster on my laptop. Does anybody know of a faster\n> way to retrieve the ID,Score pairs for a query on a SolrScloud deployment\n> and/or have an idea on the possible performance characteristics of\n> exporting ID, Score (without ranking) if it was to be implemented?\n>\n> Cheers\n>\n> Akiel ",
            "id": "comment-15138620"
        },
        {
            "date": "2016-02-11T16:18:56+0000",
            "author": "Joel Bernstein",
            "content": "Akiel, could you describe your usecase? I'm trying to decide how to prioritize this ticket so the usecase you have in mind would be very helpful. ",
            "id": "comment-15142962"
        }
    ]
}