{
    "id": "SOLR-10321",
    "title": "Unified highlighter returns empty fields when using glob",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "6.4.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "q=lama&hl.method=unified&hl.fl=content_*\n\n\n\nreturns:\n\n\n  <lst name=\"http://www.nu.nl/weekend/3771311/dalai-lama-inspireert-westen.html\">\n    <arr name=\"content_en\"/>\n    <arr name=\"content_nl\">\n      <str>Nobelprijs Voorafgaand aan zijn bezoek aan Nederland is de dalai &lt;em&gt;lama&lt;/em&gt; in Noorwegen om te vieren dat 25 jaar geleden de Nobelprijs voor de Vrede aan hem werd toegekend. Anders dan in Nederland wordt de dalai &lt;em&gt;lama&lt;/em&gt; niet ontvangen in het Noorse parlement. </str>\n    </arr>\n    <arr name=\"content_general\"/>\n    <arr name=\"content_de\"/>\n    <arr name=\"content_fr\"/>\n    <arr name=\"content_es\"/>\n    <arr name=\"content_pt\"/>\n    <arr name=\"content_ja\"/>\n    <arr name=\"content_zh-cn\"/>\n    <arr name=\"content_th\"/>\n    <arr name=\"content_ar\"/>\n  </lst>\n\n\n\nFastVector and original do not emit: \n\n\n    <arr name=\"content_de\"/>\n    <arr name=\"content_fr\"/>\n    <arr name=\"content_es\"/>\n    <arr name=\"content_pt\"/>\n    <arr name=\"content_ja\"/>\n    <arr name=\"content_zh-cn\"/>\n    <arr name=\"content_th\"/>\n    <arr name=\"content_ar\"/>",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-20T15:29:34+0000",
            "content": "Ah; ok.  Solving this would be a bit tricky due to the division of responsibility between the UnifiedHighlighter (Lucene) and UnifiedSolrHighlighter.  We would need to shim in an intermediate StoredVieldVisitor to track which fields are seen vs not at all, and store it on Solr's UH subclass instance.  That doesn't seem worth it to me, especially just for wildcards in \"hl.fl\".\n\nWhat might make sense (to me) is a new boolean option to have UnifiedSolrHighlighter omit returning empty-string highlights altogether.  Although enabling that would conceal the distinction of the inability to find any snippet from stored text, vs not having any stored text to even highlight.  I dunno.\n\nI assume this is just a minor nuisance for you Markus? ",
            "author": "David Smiley",
            "id": "comment-15932832"
        },
        {
            "date": "2017-03-20T15:34:08+0000",
            "content": "Hi - it is indeed just a nuisanse so far. Although it will get worse if we receive data of more different languages. It seems to depend on what fields have data, not the fields that are defined in the schema.\n\nI think it would be handy not to add empty arrs to the named list somewhere. ",
            "author": "Markus Jelsma",
            "id": "comment-15932842"
        },
        {
            "date": "2017-03-20T15:38:00+0000",
            "content": "To avoid perhaps excessive configuration, perhaps this logic should always take effect but limited to those fields specified via a wildcard. ",
            "author": "David Smiley",
            "id": "comment-15932852"
        },
        {
            "date": "2017-07-11T14:26:13+0000",
            "content": "If there are a great number of fields to potentially highlight (even though each doc will match very few), this could also be a performance issue as reported in SOLR-10993 (a duplicate of this issue really). ",
            "author": "David Smiley",
            "id": "comment-16082276"
        },
        {
            "date": "2017-07-11T14:38:55+0000",
            "content": "I think not sending empty entries at all (even if there is a field in the document) might be a good option, since transferring and decoding the keys can take a considerable amount of time. It's always possible to look at the retrieved document to see if the field is available or not. Unfortunately, changing the default might break some clients that are currently depending on this behavior and I am not sure if it's worth breaking them (and forcing them to fix a potential performance problem). The other option would be to introduce yet another highlighting option. ",
            "author": "Christoph Hack",
            "id": "comment-16082299"
        },
        {
            "date": "2017-07-13T16:33:22+0000",
            "content": "I think omitting blank highlights for wildcard specified fields is probably the way to go, and would be minor enough as to not warrant a request flag/param (configuration-itis).  One aspect of doing this is creating a HashSet of hl.fl values (up front) and then after highlighting, testing if the field to highlight is in the set or not.  If it isn't, then there's a wildcard somewhere.  Patches welcome \n\nNote that doing wildcard highlights on tons of fields, assuming hl.requiredFieldMatch=false, assuming analysis offset source, is probably relatively slow in and of itself, aside from the excessive noise of putting useless empty entries in the Solr response.  The underlying UnifiedHighlighter will loop over each field to produce a separate FieldHighlighter which separately analyzes the query to pull out pertinent terms and do other initialization.  For a setup like this, it's all redundant duplicated work per field.  This could probably be addressed at the UnifiedSolrHighlighter level but it'd be awkward, and may actually ideally need some support at the Lucene layer too.  It would probably have limitations such that a wildcard highlighted field would then not support per-field config options. ",
            "author": "David Smiley",
            "id": "comment-16085958"
        }
    ]
}