{
    "id": "SOLR-5871",
    "title": "Ability to see the list of fields that matched the query with scores",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Wish",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Hello, I need the ability to tell users what content matched their query, this way:\n\n\n\n Name      \n Twitter Profile \n Topics \n Site Title \n Site Description \n Site content \n\n\n John Doe \n Yes                \n No      \n Yes         \n No                    \n Yes             \n\n\n Jane Doe \n No                 \n Yes     \n No          \n No                    \n Yes             \n\n\n\n\n\nAll these columns are indexed text fields and I need to know what content matched the query and would be also cool to be able to show the score per field.\n\nAs far as I know right now there's no way to return this information when running a query request. Debug outputs is suitable for visual review but has lots of nesting levels and is hard for understanding.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Alexander S.",
            "id": "comment-13961730",
            "date": "2014-04-07T09:08:09+0000",
            "content": "Any luck this could be reviewed by someone? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13967907",
            "date": "2014-04-13T18:35:23+0000",
            "content": "Hmmm, what's to review? JIRAs are generally used to propose code changes and/or discuss how to improve/change the code and/or attach patches. If this is a more general \"how to\" question, it's better to raise it on the user's list rather, you'll get lots more help there.\n\nI'll close this in a couple of days unless there's something I'm missing. This is certainly something we see regularly as a request, code patches are welcome! "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13967913",
            "date": "2014-04-13T18:55:50+0000",
            "content": "I've lost count of how many times users have requested this feature. The basic request is for an \"easy\" way to determine which fields matched which values for each document, as opposed to having to sift through the debug explanation.\n\nOne technical difficulty is analysis - the results could report the analyzed field values which matched, which won't necessarily literally agree with the source terms due to case, stemming, synonyms, etc. "
        },
        {
            "author": "Alexander S.",
            "id": "comment-13967927",
            "date": "2014-04-13T19:53:03+0000",
            "content": "I already asked at solr-user@lucene.apache.org but seems only one way currently is to read the debug explanation. Unfortunately I am not a java developer thus unable to create a patch, but Solr jira has a \"wish\" type so I posted my wish here. "
        },
        {
            "author": "Simon Rosenthal",
            "id": "comment-13976946",
            "date": "2014-04-22T15:50:21+0000",
            "content": "+1 to add this functionality - at least an enumeration of the fields where there were matches. I could live without having the matching terms.\n\n\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14125813",
            "date": "2014-09-08T17:48:20+0000",
            "content": "While I agree this is functionality that people have requested, it's pretty clear that I'm not going to get to it in any reasonable time frame, so un-assigning it. "
        }
    ]
}