{
    "id": "SOLR-7257",
    "title": "copyfieldtargets are not returned",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.3",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "copyfieldtargets are purged from field list in realtimeget and search results even if they are declared in schema like stored fields.\n\nIf i understood the source code if declared like stored fields they are correctly saved in lucene index but there is not way to return them.\n\nThis is a bug or intended behaviour?\nPerhaps it should be checked if the copied field is stored and return value in searches and gets.\n\nThanks",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-17T13:33:51+0000",
            "author": "Steve Rowe",
            "content": "Copy field targets only refer to existing field or dynamic field declarations.  Have you declared the target field(s) as stored?\n\nPlease provide an excerpt from your schema.  Also a request you think should include the target field(s) that doesn't. ",
            "id": "comment-14365105"
        },
        {
            "date": "2015-03-17T14:32:11+0000",
            "author": "Paolo Cappuccini",
            "content": "<field name=\"id1\" type=\"string\" indexed=\"true\" stored=\"true\" required=\"false\" />\n<field name=\"id2\" type=\"string\" indexed=\"true\" stored=\"true\" required=\"false\" />\n....\n        <copyField source=\"id1\" dest=\"id2\"/>\n\nI can search by \"id2\" and find my documents.\nThe field \"id2\", as you can see, is declared \"stored\" but yes, it is a copyfieldtarget.\n\nIf i retrieve results or get a document , though i specify i fieldlist the field \"id2\" this is not returned.\nI simply query \":\" and ask \"fl:id1,id2\"\n\nIn realtimegetcomponent i noticed a \"if isCopyFieldTarget(..)\" that prevent the field to be returned but i couldn't find similar filter in search results.\n ",
            "id": "comment-14365179"
        },
        {
            "date": "2015-03-17T17:07:34+0000",
            "author": "Hoss Man",
            "content": "In realtimegetcomponent i noticed a \"if isCopyFieldTarget(..)\" that prevent the field to be returned but i couldn't find similar filter in search results.\n\npretty sure this was added as a hack to ensure RTG would have consistent behavior regardless of wether the doc was returned from the index, or from the updateLog (which is before schema copyFields are evaluated)\n\nThere's a specific comment about this on the ref guide page for RTG, but no one familiar with the details of the code has bothered to try and help address this on the documentation side...\n\nhttps://cwiki.apache.org/confluence/display/solr/RealTime+Get\n\nan alternative that may work well in some cases is to remove copyFields from your schema.xml and instead use the CloneFieldUpdateProcessorFactory to ensure the Document has all of it's fields before the distributed processor (which maintains the updateLog on the leader) gets the document. ",
            "id": "comment-14365544"
        },
        {
            "date": "2015-03-18T12:55:41+0000",
            "author": "Paolo Cappuccini",
            "content": "Thanks for solution.\nSo anyway if the hack make consistent the RTG, this is not consistent with search results.\n\nActually copyfieldtargets are applied by document builder during lucene indexing.\n\nShould perhaps be moved that part to DistributedUpdateProcessor?\nOr better solution would be to fix RTG to emulate copyfields if doc is from updatelog? ",
            "id": "comment-14367092"
        }
    ]
}