{
    "id": "SOLR-6416",
    "title": "DistribDocExpirationUpdateProcessorTest is pretty slow in non nightly test runs.",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Tests"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-14108444",
            "date": "2014-08-24T16:29:42+0000",
            "content": "It looks like this test spends a very long time waiting while nothing is really happening. Perhaps we can override some settings from the test to make things go faster. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-14109972",
            "date": "2014-08-25T23:25:17+0000",
            "content": "it waits 30 seconds for the processor to do what it says it will do and \"expire\" the doc (ie: delete it)\n\nthe reason we wait 30 seconds (instead of something smaller) is because we need to give enough time for the doc to be added and be able to verify the doc is there – if we tighten up the time to something smaller, we could easily get false failures where the doc is added, then expired/deleted before we ever verify the initial add. (and if we don't verify the document is added properly, we'd get false positives thinking hte doc was deleted when it actually had a problem being added in the first place)\n\ni'm open to suggestions for improvements – but at the end of the day, what we're testing is that: 1) a Timer is created; b) that the timer fires; c) that a certain action happens.  we can make the timer duration as short as you want, but the current \"slowness\" exists because w/shorter durations it's trivial to get false successes and false failures. (which is why it's documented as @Slow "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14109993",
            "date": "2014-08-25T23:46:20+0000",
            "content": "which is why it's documented as @Slow\n\nI think in general, Slow should be tests that are 30-60 seconds. I strive to keep anything in core tests to a minute or under, though occasionally we have outliers. If a test truly requires more than that, I think it should be run nightly in most cases. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14109996",
            "date": "2014-08-25T23:47:18+0000",
            "content": "it waits 30 seconds for the processor\n\nAlso, I didn't look thoroughly, but yourkit showed it doing almost nothing for well over 30 seconds - running the test isolated and not with other tests. "
        }
    ]
}