{
    "id": "SOLR-4566",
    "title": "clusterstate#getSlices and getSlicesMap should always return all slices.",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.3",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I'm not sure I really like this getSlices vs getAllSclies - it's kind of easy to get in trouble right now I think. Some spots that we clearly want to call getAllSlices got left with getSlices. It's almost surprising that getSlices only returns active replicas - it should probably at least be called getSlicesWithActive or something more explicit. But for the first step, we should just fix the various mis calls.\n\nThere are a couple problems around the mis calls, the most severe probably being that you can lose shards that are not active from the clusterstate.json given the right races.",
    "attachments": {
        "SOLR-4566.patch": "https://issues.apache.org/jira/secure/attachment/12573528/SOLR-4566.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13600775",
            "date": "2013-03-13T03:37:46+0000",
            "content": "I've addressed this in a patch for SOLR-3755 - I'll pull it over here when I get a moment. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13600857",
            "date": "2013-03-13T05:50:44+0000",
            "content": "Do you recommend overloading getSlices to have a boolean flag (something like ignoreState) instead? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13601074",
            "date": "2013-03-13T12:40:21+0000",
            "content": "I'm going to nuke this - it's broken and none of the other code expects to only get back active shards. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13601112",
            "date": "2013-03-13T13:08:31+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1455911\n\nSOLR-4566: Fix DocCollection to return all shards not just active shards. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13601134",
            "date": "2013-03-13T13:33:22+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1455912\n\nSOLR-4566: Fix DocCollection to return all shards not just active shards. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13601147",
            "date": "2013-03-13T13:57:05+0000",
            "content": "After chatting with Anshum in IRC, he caught me up that this stuff was newly committed code for shard splitting. I thought it came from before that during the clusterstate refactoring.\n\nWhich means this is not really a current bug, since nothing currently takes advantage of slice states.\n\nThe same problems remain - getSlices should get all the slices. This is critical in the clusterstate update code and just kind of what you would expect.\n\nAnother call should be added for getActiveSlices and used where appropriate. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13601150",
            "date": "2013-03-13T14:02:56+0000",
            "content": "[trunk commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1455943\n\nSOLR-4566: revert "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13601174",
            "date": "2013-03-13T14:18:55+0000",
            "content": "[branch_4x commit] Mark Robert Miller\nhttp://svn.apache.org/viewvc?view=revision&revision=1455945\n\nSOLR-4566: revert "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13601183",
            "date": "2013-03-13T14:29:05+0000",
            "content": "And to be clear, there still is a bug in this code (you can lose slice state from clusterstate.json when a slice is inactive), it's just does not affect any current trunk features, so I won't track it as a bug here. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13601186",
            "date": "2013-03-13T14:30:06+0000",
            "content": "I'll have a patch up for this soon. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13601277",
            "date": "2013-03-13T15:59:11+0000",
            "content": "Changes to have getSlices() and getSlicesMap() return all slices instead of just active one.\n\nIntroduced a method to return active slices only in ClusterState and DocCollection. "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13601281",
            "date": "2013-03-13T16:01:45+0000",
            "content": "Correct patch. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13601378",
            "date": "2013-03-13T17:15:54+0000",
            "content": "We still want to change a bunch of the calls to use getActive slice right? "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13601381",
            "date": "2013-03-13T17:19:02+0000",
            "content": "Not until the split shard patch goes in. I'm already working on fixing that patch to correctly use getSlices vs getActiveSlices at various places.\nAs far as a fix for the state of trunk right now goes, this should solve this issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13601395",
            "date": "2013-03-13T17:28:38+0000",
            "content": "There really is no issue without the split shards patch though \n\nThat's part of what is confusing about this - it kind of seems this stuff should be part of the patch rather than pre committed. I'm not sure what the motivation of committing the shard state stuff early was.\n\nRegardless, this issue is about cleaning up what is already committed - to me, what makes the most sense from that perspective is to improve the API, and then fix the API calls. Doing this halfway doesn't gain much, and the current state is obviously confusing as it was causing your problems with your shard splitting patch itself.\n\nFurther, even in the shard splitting issue, Shalin talks about splitting that patch out into smaller issues...\n\nI don't know that that is necessary, but this looks like a perfect such sub issue here - lets improve the API call naming and start making the right calls? That would seem to mean that clusterstate updating code uses getSlices, shard id finding code uses getSlices, and a fair amount of other things should use getActive slices. If we get that base in here, we make the currently committed stuff sensible, and the current shard splitting code will start working against trunk without anyone needing to do the digging I did again.\n "
        },
        {
            "author": "Anshum Gupta",
            "id": "comment-13601412",
            "date": "2013-03-13T17:43:53+0000",
            "content": "Sure. Will leave it there for now and make these changes as part of the Shard Splitting issue (or sub issue) patch instead. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13631733",
            "date": "2013-04-15T14:07:42+0000",
            "content": "The attached patch was committed to trunk and branch_4x along with the shard split feature. If people are happy with the API proposed in the patch then we can mark this issue as resolved. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13654042",
            "date": "2013-05-10T10:33:50+0000",
            "content": "Closed after release. "
        }
    ]
}