{
    "id": "SOLR-723",
    "title": "SolrCore & aliasing/swapping may lead to confusing JMX",
    "details": {
        "affect_versions": "1.3",
        "status": "Reopened",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As mentioned by Yonik in SOLR-647, JMX registers the core with its name.\nAfter swapping or re-aliasing the core, the JMX tracking name does not correspond to the actual core anymore.",
    "attachments": {
        "SOLR-723-solr-core-swap-JMX-issues-lucene_3x.patch": "https://issues.apache.org/jira/secure/attachment/12526574/SOLR-723-solr-core-swap-JMX-issues-lucene_3x.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Henri Biestro",
            "id": "comment-12625719",
            "date": "2008-08-26T13:06:06+0000",
            "content": "Yonik's comment in solr-725 makes an analogy between name/aliases and the SolrCore that's close to what hard-links are to inodes.\nWhat if we were to consider the 'inode' as the sole think that really uniquely identifies a SolrCore, that is it's dataDir?\nThe SolrCore name would not be used for that purpose and would only happen to be the first alias (as it stands now).\nThis would allow solving this issue by changing how we register a core into JMX  (with its relative path to the solr.solr.home dir or something close to that) and have no swapping, etc.\nJust a thought. "
        },
        {
            "author": "Henri Biestro",
            "id": "comment-12626178",
            "date": "2008-08-27T16:41:24+0000",
            "content": "The other simpler approach is just to state that the core name is immutable.\nWhich would make this issue a moot point. "
        },
        {
            "author": "Greg Bowyer",
            "id": "comment-13263178",
            "date": "2012-04-26T21:55:48+0000",
            "content": "So this is an issue with core swaps in 3.6 I have an interest in fixing this but does the solr-cloud work make this irrelevant ?\n\nMy thoughts were more towards that the jmx tree should just exist for each alias as a duplicate of the original named core rather than links or aliases which are quite hard to get most monitoring tools to respect. "
        },
        {
            "author": "Greg Bowyer",
            "id": "comment-13264186",
            "date": "2012-04-28T01:22:16+0000",
            "content": "Initial attempt at making the core swapping do the right thing with regard to the JMX tree, I am also working on patches for SOLR-3083 "
        },
        {
            "author": "Greg Bowyer",
            "id": "comment-13270043",
            "date": "2012-05-07T21:48:31+0000",
            "content": "Included the missing InfoRegistry.java from the patch\n\nI really need to get better at this :S "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13835722",
            "date": "2013-11-30T13:26:13+0000",
            "content": "2013 Old JIRA cleanup "
        }
    ]
}