{
    "id": "SOLR-5688",
    "title": "Allow updating of soft and hard commit parameters using HTTP API",
    "details": {
        "affect_versions": "4.6.1",
        "status": "Open",
        "fix_versions": [
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Right now, to update the values (max time and max docs) for hard and soft autocommits one has to alter the configuration and reload the core. I think it may be nice, to expose an API to do that in a way, that the configuration is not updated, so the change is not persistent. \n\nThere may be various reasons for doing that - for example one may know that the application will send large amount of data and want to prepare for that.",
    "attachments": {
        "SOLR-5688.patch": "https://issues.apache.org/jira/secure/attachment/12626562/SOLR-5688.patch",
        "SOLR-5688-single_api_call.patch": "https://issues.apache.org/jira/secure/attachment/12626679/SOLR-5688-single_api_call.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Rafał Kuć",
            "id": "comment-13889063",
            "date": "2014-02-02T21:21:57+0000",
            "content": "Attaching a draft patch adding new request handler which allows changing autocommit values - comments welcome  \n\nI made it working on the core level. If everyone find it useful, collections API can be extended to allow such operation for the whole collection. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13889169",
            "date": "2014-02-03T02:33:19+0000",
            "content": "I absolutely love the idea here.  The implementation feels awkward, though.  I've written my fair share of awkward code, so I hope you'll find this to be constructive criticism.\n\nWhat I envision is something that works with a URL like the following, with the name of the handler and the specific action parameter something that can be hashed out together.  Even this action name feels awkward, but I like the idea of having a bunch of parameters instead of separate actions.  It allows you to make one API call to change all related parameters:\n\n/solr/admin/transientconfig?action=UPDATEAUTOCOMMITPARAMS&autoCommitMaxTime=NNNN&autoCommitMaxDocs=NNNN&autoSoftCommitMaxTime=NNNN&autoSoftCommitMaxDocs=NNNN "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13889170",
            "date": "2014-02-03T02:36:13+0000",
            "content": "UPDATEAUTOCOMMIT would be slightly less awkward. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13889175",
            "date": "2014-02-03T02:41:38+0000",
            "content": "Updated URL idea.  My sleep schedule has been off lately, I'm not quite awake:\n\n/solr/corename/admin/transientconfig?action=UPDATEAUTOCOMMIT&autoCommitMaxTime=NNNN&autoCommitMaxDocs=NNNN&autoSoftCommitMaxTime=NNNN&autoSoftCommitMaxDocs=NNNN "
        },
        {
            "author": "Rafał Kuć",
            "id": "comment-13889341",
            "date": "2014-02-03T09:37:04+0000",
            "content": "Thanks for the comments, I'll provide the updated patch later today  "
        },
        {
            "author": "Rafał Kuć",
            "id": "comment-13889610",
            "date": "2014-02-03T16:43:53+0000",
            "content": "A new patch attached. The handler now allows to set the four values at ones, so no need for separate calls.  "
        },
        {
            "author": "Rafał Kuć",
            "id": "comment-13902767",
            "date": "2014-02-16T18:03:49+0000",
            "content": "A small 'ping' from me. Do we need anything more here? Any comments? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13902802",
            "date": "2014-02-16T20:02:16+0000",
            "content": "Hopefully the guys working a bunch of other rest api stuff can comment. I think we want to all pull in the same direction with that - but I haven't followed progress closely enough to comment helpfully yet.  "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13905800",
            "date": "2014-02-19T18:24:05+0000",
            "content": "Rafał, I haven't looked at your code yet, I'll take a look some time later this week.\n\nSince we'll almost certainly have a persistent version of this as part of SOLR-5200, I'm a little concerned about mixing transient and persistent changes like this.  And what if a distributed/SolrCloud node goes down and then comes back up?  Differing configurations might trigger weird conditions.\n\nAn alternative for some changes could be to always persist changes, but not require core reloads? "
        }
    ]
}