{
    "id": "SOLR-3515",
    "title": "\"schema-browser_autoload\" cookie used by \"verbose\" option on analysis page",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The Analysis page of the UI seems to be toggling the state of the \"schema-browser_autoload\" cookie when you toggle the \"verbose\" checkbox for the analysis output.\n\nthis seems like a mistake.\n\nNote that it also does not seem to be possible to specify the \"verbose\" option as a URL param when loading the page (if it is i can't figure it out) which makes linking to specific examples from the tutorial somewhat difficult.\n\nhttp://localhost:8983/solr/#/collection1/analysis?analysis.fieldvalue=Canon+Power-Shot+SD500&analysis.query=&analysis.fieldtype=text_en_splitting",
    "attachments": {
        "SOLR-3515.patch": "https://issues.apache.org/jira/secure/attachment/12531257/SOLR-3515.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13290961",
            "date": "2012-06-07T12:30:57+0000",
            "content": "Argh, yes .. using the same variable twice will not gonna work out. Thanks Hoss, Patch attached "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13290968",
            "date": "2012-06-07T12:36:33+0000",
            "content": "Regarding the verbose-Flag, there was already a small/short Discussion in SOLR-3324. Right now, the initial fetch includes all data we need for showing 'verbose infos' therefore the Checkbox will only inline-switch the table - changing the url will trigger a reload. If you think it would be good to have that as variable as well, let me know and i'll change it. No longer that fancy, but it's more important to have a over-all usability  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13291116",
            "date": "2012-06-07T16:43:58+0000",
            "content": "the initial fetch includes all data we need for showing 'verbose infos' therefore the Checkbox will only inline-switch the table - changing the url will trigger a reload.\n\nthe main issue is really just that there is no way to link to the page such that it will explicitly be verbose or non-verbose, so links in the tutorial can't say \"and <a href=\"...\">here you see the change after checking verbose</a>\" ... i don't even really care if checking the box changes the URL, it would just be nice if there was some way to indicate in the URL what the initial state of the box should be.\n\n(for comparison, in the old UI, the form defaulted to POST, so nothing you did in the UI would change the URL, but you could still link to it with all the params in the URL) "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13291121",
            "date": "2012-06-07T16:50:39+0000",
            "content": "+1 for adding the bookmarkable setting to the URL – I often need to point people to a specific explanation and controlling verbose vs not is very useful\n\nAlso, looking at the analysis page again... what about using a brighter color to show the match values then the current grey.  Maybe use the bright blue color?  as is, the match terms are too subtle "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13291127",
            "date": "2012-06-07T17:01:40+0000",
            "content": "Cookie Issue fixed, will bring up another Issue as follow up for changing the Verbose-Handling on the Analysis Page "
        }
    ]
}