{
    "id": "SOLR-10632",
    "title": "logfiles are moved to archived if server is still running",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "logging"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.5",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "There are server logfiles without portnumber in logfile name. If another instance is started these logfiles are moved to archived, eventhough the other server is still running.\nSolution could be to give every logfile a name with the portnumber it belongs to. Or check if a logfile is still in use and quit with an error before moving to archived.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-08T12:11:50+0000",
            "content": "I would also recommend changing \n\nsolr-x.y.z/server/resources/log4j.properties\n\n line \n\n\"solr.log=${solr.log.dir}\"\n\n to\n\n\"solr.log=${solr.solr.home}/../logs\"\n\n as it is in solr-x.y.z/example/resources/log4j.properties\nThis eliminates a major pitfall while setting up separate node directories with separate logging on one sever. ",
            "author": "Bernd Fehling",
            "id": "comment-16000654"
        },
        {
            "date": "2017-05-08T19:38:12+0000",
            "content": "Since we now have the mechanism of setting SOLR_LOGS_DIR, you can workaround this as documented in https://cwiki.apache.org/confluence/display/solr/Configuring+Logging#ConfiguringLogging-PermanentLoggingSettings :\n\nexport SOLR_LOGS_DIR=logs_8983\nbin/solr start -p 8983\nexport SOLR_LOGS_DIR=logs_8080\nbin/solr start -p 8080\n\n\n\nIn this way you will get logs from the first instance in server/logs_8983 and from the other in server/logs_8080. I think this is a far better, and already supported, solution, segregating logs for each instance 100%.\n\nThis is also documented in https://cwiki.apache.org/confluence/display/solr/Taking+Solr+to+Production#TakingSolrtoProduction-Logsettings, and when you install Solr using install script, logs for each instance is automatically set relative to $SOLR_VAR_DIR.\n\nI can see that if someone is developing and starting several instances from the same installation folder without specifying SOLR_LOGS_DIR, then what you describe will be happening. We could of course default to sending logs to server/logs as today if port==8983, else change log dir to logs_<port>? ",
            "author": "Jan Høydahl",
            "id": "comment-16001413"
        },
        {
            "date": "2017-05-09T06:41:35+0000",
            "content": "It would be great to have logs_<port> by default. Users start with \"-e cloud\" and everything works but when they try to setup a system for production they get confused with the logging.\nMay be you can add your advise with export SOLR_LOGS_DIR before starting each solr instance to the cwiki documentation? ",
            "author": "Bernd Fehling",
            "id": "comment-16002159"
        },
        {
            "date": "2017-05-09T09:05:47+0000",
            "content": "It would be great to have logs_<port> by default.\nI'm not sure we should do this. If a user installs only one copy of Solr, but chooses port 8080, why should the logs folder be /var/solr/logs_8080? I think the refGuide about \"Taking Solr to Production\" is quite clear on the SOLR_LOGS_DIR already, but feel free to suggest different wording to make it even better. ",
            "author": "Jan Høydahl",
            "id": "comment-16002341"
        },
        {
            "date": "2017-05-09T09:22:07+0000",
            "content": "Well, I found my solution. Just wanted to give a hint where I (and probably others also) struggled when going from \"-e cloud\" to production.\nAny complains if I close this issue? ",
            "author": "Bernd Fehling",
            "id": "comment-16002355"
        },
        {
            "date": "2017-05-09T13:55:34+0000",
            "content": "It may be that we can try to think a bit harder whether it is possible to detect if a running solr is using the same log directory.\n\nSuggestion 1: Before moving files, list all .pid files, say you find solr-8983.pid. Then look for a $SOLR_LOGS_DIR/solr-$PORT-console.log file, do NOT rotate those logs, and either refuse to start or yell a big fat warning in the logs of the new instance that you're using same log directory as a running instance and give a hint about changing SOLR_LOGS_DIR? ",
            "author": "Jan Høydahl",
            "id": "comment-16002719"
        },
        {
            "date": "2017-05-09T14:10:30+0000",
            "content": "Excellent, +1.\n ",
            "author": "Bernd Fehling",
            "id": "comment-16002746"
        }
    ]
}