{
    "id": "SOLR-10593",
    "title": "Change Ref Guide site name at comments.apache.org for comment integration",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "The new HTML site incorporates comments from comments.apache.org, and a long time ago we had a site created named \"solrcwiki\". Since we're moving off Confluence (cwiki) that name doesn't make a ton of sense and will make less sense in the future, so now is a great time to change it/delete it/recreate it.\n\nINFRA-14063 asked for this change to be made, and I was granted access to create a new site. This issue is to take care of that and update the Javascript in the HTML page templates accordingly.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-01T20:00:42+0000",
            "content": "I've got the new site created in the Comments dashboard: https://comments.apache.org/panel.lua?view=dashboard&site=solr-refguide&uid=741d0acac05816701215f891d97c8b451fe320b5, and have committed to the jira/solr-10290 branch the required change for the pages to use the new site.\n\nIn the process of this, I realized that I neglected to finish some work I'd started to fix the styling of the comments - it's currently horrific, so I'll use this issue to keep working on that a bit more. ",
            "author": "Cassandra Targett",
            "id": "comment-15991433"
        },
        {
            "date": "2017-05-01T21:11:26+0000",
            "content": "Figured out finally what was wrong with the styling - I spent a day on this before, but couldn't get it working right, but now I think I've got it. \n\nThe comments.a.o docs say to put the link to a custom stylesheet in the JS snippet you add to each page to get the comments to appear, but it wasn't really happening. On further analysis, it seems all the elements of the comments section are loaded before the stylesheet is loaded so the stylesheet is never applied. I added a link to the stylesheet to the head.html that's used in the page, and now the stylesheet is applied. ",
            "author": "Cassandra Targett",
            "id": "comment-15991534"
        }
    ]
}