{
    "id": "SOLR-12948",
    "title": "Basic Auth login windows pops up with page loaded",
    "details": {
        "type": "Bug",
        "status": "Resolved",
        "labels": "",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "priority": "Major",
        "resolution": "Invalid",
        "affect_versions": "7.5"
    },
    "description": "I've enabled basic auth in my solr 7.5 installation (with no blockUnknown), created an admin role and added all of the predefined permission (except read and all) to the role, and created an admin user with that role.\n\nWhat I wanted to do, is to enable public access only to the /select for querying, and password protect everything else.\n\nWith this, I can hit /select without authentication, but when I browse to the admin UI, the login window pops up as I'd expect, but the dashboard page also loaded up, see attached. I'd have expected nothing's showing except the login.\n\nIf this is the wrong approach to what I needed, I'm interested in what you guys do to achieve this.\n\nThanks!",
    "attachments": {
        "Screenshot from 2018-10-31 14-30-09.png": "https://issues.apache.org/jira/secure/attachment/12946431/Screenshot%20from%202018-10-31%2014-30-09.png"
    },
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16670602",
            "content": "Bit more info, as I browse to different page like Logging, Core Admin, Java Properties, etc, the login pops up, while the page loading up with all the info. ",
            "author": "Wei Liao",
            "date": "2018-10-31T19:20:58+0000"
        },
        {
            "id": "comment-16671680",
            "content": "Closing as invalid. This is not a support portal for asking questions. Please ask your question in the solr-user mailing list http://lucene.apache.org/solr/community.html#mailing-lists-irc\n\nThere is no fine-grained authorization support in the Admin UI that would hide menus based on who logs in or similar, so what you describe is by design. Using HTTP directly towards the /select endpoint you should be able to do without authentication if you configured security.json correctly.\n\nPlease do not reply in this Jira, but follow up on the solr-user mailing list. ",
            "author": "Jan Høydahl",
            "date": "2018-11-01T14:35:40+0000"
        }
    ]
}