{
    "id": "SOLR-8419",
    "title": "TermVectorComponent distributed-search issues",
    "details": {
        "components": [
            "SearchComponents - other"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.5"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "TermVectorComponent supports distributed-search since SOLR-3229 added it.  Unlike most other components, this one tries to support schemas without a UniqueKey.  However it's logic for attempting to do this was made faulty with the introduction of distrib.singlePass, and furthermore this part wasn't tested any way.  In this issue I want to remove support for schemas lacking a UniqueKey with this component (only for distributed-search).",
    "attachments": {
        "SOLR_8419.patch": "https://issues.apache.org/jira/secure/attachment/12777929/SOLR_8419.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-16T05:47:17+0000",
            "author": "David Smiley",
            "content": "The attach patch:\n\n\tFixes the invalid/confusing response when there's a distributed single-pass situation.\n\tRemoved uniqueKeyFieldName as a key in the TV response NamedList.  Okay I didn't have to do this but this seemed totally out of place.  HighlightComponent & DebugComponent don't do this.\n\tAdded test that fails without these changes – the distrib.singlePass case.\n\n\n\nThe changes also then allows for an eventual refactoring of common code in finishStage (the loop filling arr).  This is the part affected by a distrib.singlePass bug in 3 search components.  I won't do that refactoring here though; I'll do it in BNGS-8059.\n\nAssuming tests pass I'll commit this in a couple days. ",
            "id": "comment-15059536"
        },
        {
            "date": "2015-12-17T03:47:41+0000",
            "author": "David Smiley",
            "content": "Slightly updated to adjust tests that were asserting it finds 'uniqueKeyField' in the response, to not expect it anymore (it's going away).  When I update CHANGES.txt I'll put 2 entries; one in in the Bug Fixes category and another in Other Changes category to call attention to uniqueKeyField getting removed. ",
            "id": "comment-15061409"
        },
        {
            "date": "2015-12-18T02:15:57+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1720714 from David Smiley in branch 'dev/trunk'\n[ https://svn.apache.org/r1720714 ]\n\nSOLR-8419: TermVectorComponent: fix accidental inclusion of docs when distrib.singlePass. Remove 'uniqueKeyField' from response. distrib now requires a schema unique key. ",
            "id": "comment-15063299"
        },
        {
            "date": "2015-12-18T02:21:27+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1720715 from David Smiley in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1720715 ]\n\nSOLR-8419: TermVectorComponent: fix accidental inclusion of docs when distrib.singlePass. Remove 'uniqueKeyField' from response. distrib now requires a schema unique key. ",
            "id": "comment-15063304"
        }
    ]
}