{
    "id": "SOLR-3189",
    "title": "Removing a field using TemplateTransformer",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "While importing documents through DataImportHandler I need to remove some fields from the final SolrDocument before it's submitted to Solr.\nMy usecase: the import query returns an A column which I use to fill in the B field on the Solr instance. My Solr schema contains both the A and B fields, so they are both filled in through dih. I'd like to force the deletion of A from the generated SolrDocument since I need a value only on the B field and want to leave empty the A field. The only way I found is using ScriptTransformer, so I thought it could be useful to add this feature to the TemplateTransformer.",
    "attachments": {
        "SOLR-3189.patch": "https://issues.apache.org/jira/secure/attachment/12516837/SOLR-3189.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Luca Cavanna",
            "id": "comment-13220943",
            "date": "2012-03-02T14:14:24+0000",
            "content": "Attached patch. It works like this:\n\n<entity name=\"row\">\n  <field column=\"newId\" template=\"${row.id}\"/>\n  <field column=\"id\" remove=\"true\"/>\n</entity>\n\n\n\nI introduced the use of the attribute remove. When it's true the template is not required and the field identified by the column name is removed from the resulting SolrDocument.\n\nIn the meantime I created a new transformEntityField method for each field in the row, which makes the code more readable in my opinion.\nLet me know what you think! "
        },
        {
            "author": "Luca Cavanna",
            "id": "comment-13269561",
            "date": "2012-05-07T12:13:39+0000",
            "content": "Guys, don't you think this feature could be useful? Is there something I can do to convince you?  "
        }
    ]
}