{
    "id": "SOLR-7144",
    "title": "Suggester dictionary does not set origFreq",
    "details": {
        "components": [
            "spellchecker"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.3",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Although it sets term frequency for corrections, org.apache.solr.spelling.suggest.Suggester never sets the frequency for the original term.   Thus, the spellcheck component will never format extended results.\n\nThere is a related issue with SpellCheckComponent: it may mark a query as correctly spelled, even if zero frequency terms exist in the original query.",
    "attachments": {
        "SOLR-7144.patch": "https://issues.apache.org/jira/secure/attachment/12700211/SOLR-7144.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-23T16:52:52+0000",
            "author": "Charles Reitzel",
            "content": "Here is a patch correcting issues described.  It includes a couple unit tests as well. ",
            "id": "comment-14333497"
        },
        {
            "date": "2015-02-24T14:23:10+0000",
            "author": "James Dyer",
            "content": "Charles,\n\nHere is what I believe how the \"correctlySpelled\" flag is supposed to work today:\n\n1. If \"spellcheck.maxResultsForSuggest\" is not specified\n\n\tIf any query term has a frequency of zero, \"correctlySpelled\" is false.  Otherwise it is true.\n\n\n\n2. If  \"spellcheck.maxResultsForSuggest\" is specified\n\n\tIf the query returns fewer results than specified for \"spellcheck.maxResultsForSuggest\", \"correctlySpelled\" is false.  Otherwise it is true.\n\n\n\nWere you seeing behavior different from this, or under which cases do you feel \"correctlySpelled\" is incorrect that you'd like to change?\n\nPersonally, I do not like that \"correctlySpelled\" even exists.  This is a subjective judgement and the client can decide this based on # results returned and the contents of the spell check response.  My approach with this, whenever making changes to the spell check component, is to try and keep the behavior consistent so nobody upgrades and all of a sudden their app is broken.  That doesn't mean we can't improve this though, especially if you've found a case in which its broken. ",
            "id": "comment-14334914"
        },
        {
            "date": "2015-02-24T18:46:29+0000",
            "author": "CharlesReitzel",
            "content": "Question: does rule #1 trump rule #2? I'd think #2 would kick in only if otherwise all terms have origFreq > 0.\n\nPreviously, SpellCheckComponent was setting hasZeroFrequencyToken = true, but it wasn't using it in the response.  The substance of my change to this file is to simply set correctlySpelled = false if hasZeroFrequencyToken = true.  Again, this assumes rule #1 trumps #2.  This part of the patch can be dropped if that is not the case.\n\nHowever, I can't help but agree that \"correctlySpelled\" is not useful to client applications.  \n\nFor our application, we will instead arrange to have collations returned only that result in query hits.  For single term queries (and, thus, no collations), we will use the origFreq == 0 directly to determine if a term is a useful search term.   Thus, the Suggester changes are the most important to us. ",
            "id": "comment-14335220"
        }
    ]
}