{
    "id": "SOLR-2971",
    "title": "ExternalFileFields fail if valType='float', and valType should be optional",
    "details": {
        "affect_versions": "3.5,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "valType has never done anything except throw an error, the underlying ValueSource has always been a FileFloatSource. To add to the confusion, the documents say use \"float\", which throws an exception on Solr startup every since \"float\" was re-defined as a TrieFloatField. \"pfloat\" works currently though.\n\nSince valType is never used for anything, we should make it optional until such a time as it is.\n\nAdditionally, TrieFloatField (valtype=\"float|tfloat\") types should be OK as a field type along with FloatField(valType=\"pfloat\")",
    "attachments": {
        "SOLR-2971.patch": "https://issues.apache.org/jira/secure/attachment/12507469/SOLR-2971.patch",
        "SOLR-2971-3x.patch": "https://issues.apache.org/jira/secure/attachment/12507642/SOLR-2971-3x.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13169953",
            "date": "2011-12-15T03:19:33+0000",
            "content": "Patch for trunk. I haven't run full regression tests against it yet, but I think it's pretty solid.\n\nI'll commit in a day or two unless there are objections... "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13170728",
            "date": "2011-12-16T03:13:35+0000",
            "content": "I think these patches may be ready to apply. The only thing that makes me at all nervous is the magic of calling deleteCore in the tests. The 3x tests consistently failed without it, but trunk worked just fine. So I put the call in both.\n\nSorry, there's a bit of gratuitous formatting in there, but it's pretty much whitespace only....\n\nOf course the 3x tests were enough different than the 4x ones that it needed a different patch. Siiigggh. The actual core code changes are identical though.\n\nFor an issue this small, is there any reason to add anything to CHANGES.txt?\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13171583",
            "date": "2011-12-17T14:54:40+0000",
            "content": "trunk - r1215503\n3.6   - r1215504 "
        }
    ]
}