{
    "id": "SOLR-9851",
    "title": "Introduce Interesting Terms Json Facet",
    "details": {
        "components": [
            "Facet Module",
            "faceting"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "After playing a bit with the Lucene MLT I noticed a couple of methods were there for calculating the interesting terms ( from the seed document) .\n\nI think this can be extended to a supported calculation on the search results.\nSpecifically I am thinking to initially add a new type of Json Facet ( InterestingTerms).\n\nThis new aggregation will calculate the interesting terms from the search results given :\n\n\ta field\n\ta minCount ( we ignore the score calculus for terms occurring less than this threshold in the search results)\n\tpossibly all the other supported params for faceting\n\n\n\nNaive Implementation :\nScore for each term can be calculated as :\ncount * IDF \n\nObservations\nTaking a look around the web, I see that a similar type of aggregation has already been included in Elastic Search time ago ( see nice blog from  Mark at https://www.elastic.co/blog/significant-terms-aggregation )\n\nAny reason we don't have anything similar yet ?\n\nI will provide better design and more information soon.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-12-12T10:53:24+0000",
            "author": "Alessandro Benedetti",
            "content": "Yonik Seeley what do you think ?\nIs Json Faceting the right place to include it ?\n\nI think that can be a good initial stage and then probably I can take a look to the streaming implementation in a second phase.\n\nCheers ",
            "id": "comment-15741614"
        },
        {
            "date": "2016-12-12T11:44:40+0000",
            "author": "Alessandro Benedetti",
            "content": "Of Course after the initial Naive approach we can investigate additional algorithms to score how much a term is interesting.\nSuch as :\n\n\tChi Square distance\n\tGoogle Normalized Distance\nect...\n\n ",
            "id": "comment-15741699"
        }
    ]
}