{
    "id": "SOLR-6420",
    "title": "ADDREPLICA can add a replica that reports green without actually replicating",
    "details": {
        "affect_versions": "4.10",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I am running Solr built off branch_4x, and thanks to some help from IRC (Chris Hostetter (Unused)) we've determined that we have an incompatible index situation where we have indexes built with 4.9 that we can read but not index into further or update.  In this situation, if I try to add a replica, this also fails, however, the only log ouput (at WARN threshold) is:\n\n   16:21:58.156 [RecoveryThread] WARN  org.apache.solr.update.PeerSync - no frame of reference to tell if we've missed updates\n\n ...and the replica comes up green.  I think this might indicate a missing integrity check on replication but certainly IMO a replica should report as green/active if it is not on the same revision as the leader, or at least if it has never been on the same revision as the leader.\n\nShards built with the currently running version of Solr are able to successfully ADDREPLICA as expected.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14170658",
            "date": "2014-10-14T08:24:51+0000",
            "content": "The only reason I can think when such a problem will happen is if Lucene/Solr lied about the current index generation/version (returned 0 for both) and Solr thinks that the replication actually succeeded. We don't guarantee anything when you're running unreleased code and there's no way for me to verify/fix this bug in the absence of the exact bits you deployed and your index files and even then it probably won't be a high priority (I'd rather fix bugs that we've released). "
        }
    ]
}