{
    "id": "SOLR-6155",
    "title": "Multiple copy field directives are created in a mutable managed schema when identical copy field directives are added",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "If I add the same copy field directive more than once, e.g. source=sku1 , dest=sku2, then this directive will appear in the schema as many times as it was added.\n\nIt should only appear once.  I guess we could keep the current behavior of not throwing an error when a copy field directive is added that already exists in the schema, but rather than adding a duplicate directive, just have a no-op.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-14025883",
            "date": "2014-06-09T22:53:45+0000",
            "content": "I guess we could keep the current behavior of not throwing an error when a copy field directive is added that already exists in the schema.\n\n-1 ... we should fix the bug and return an error – better to be consistent with the other apis (like adding a field) then worry about backcompat for a nonsensical situation of adding the same copyField multiple times.\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14025935",
            "date": "2014-06-09T23:35:11+0000",
            "content": "-1 ... we should fix the bug and return an error – better to be consistent with the other apis (like adding a field) then worry about backcompat for a nonsensical situation of adding the same copyField multiple times.\n\nFine by me. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-14026008",
            "date": "2014-06-10T01:25:33+0000",
            "content": "IIRC, some have used multiple copyFields for a long time to change relevance in a catch-all text field.  This dates back to my CNET days in fact...\nExample: copyField from \"title\" to \"text\" repeated 5 times... "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-14027243",
            "date": "2014-06-11T00:04:58+0000",
            "content": "Hmm, so I guess this is a feature then?  I can see people unintentionally getting bitten by it though - maybe the REST API should add an \"allowDuplicates\" param, with a default of false? "
        },
        {
            "author": "Gregory Chanan",
            "id": "comment-14029764",
            "date": "2014-06-12T20:34:17+0000",
            "content": "Steve Rowe sort of related issue, looks like the copyField additions aren't being added to the other nodes.  I filed SOLR-6164 for that. "
        }
    ]
}