{
    "id": "SOLR-8647",
    "title": "Already open IndexSearcher sees different DVs as commits are happening",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Duplicate",
        "priority": "Major"
    },
    "description": "While working on SOLR-5944, I ran into an issue whereby an already open IndexSearcher sees different views of the DVs as updates/commits are happening in different threads. This is resulting in inconsistency of DV values for the already open main searcher.\n\nWhen logging out the searcher, I can see that the searcher instance is same, but the dvgen and fieldinfogen values are changing for an existing searcher.",
    "attachments": {
        "TestIndexSearcherStability.java": "https://issues.apache.org/jira/secure/attachment/12786463/TestIndexSearcherStability.java",
        "schema16.xml": "https://issues.apache.org/jira/secure/attachment/12786902/schema16.xml",
        "SOLR-8647-tests.patch": "https://issues.apache.org/jira/secure/attachment/12787134/SOLR-8647-tests.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-05T12:04:59+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Attaching a unit test demonstrating that the DVGen of the underlying reader changes. I tried to reproduce the same using plain Lucene IndexReader/Writer/Searcher, but couldn't reproduce. I've added the test for that as well.\n\nCan someone please have a look and help? ",
            "id": "comment-15134053"
        },
        {
            "date": "2016-02-05T13:29:07+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "I can't seem to able to reproduce the problem that the DV value itself, when retrieved from the searcher after the commits in separate thread, is a different one than before. This is something, I think, is happening within the context of SOLR-5944. But now that I can't reproduce it in the context of these tests, I am not 100% sure is happening in SOLR-5944 too.\n\nBut the dvgen for the searcher's underlying segment reader is changing during a commit for sure. ",
            "id": "comment-15134165"
        },
        {
            "date": "2016-02-05T15:14:30+0000",
            "author": "Yonik Seeley",
            "content": "I tried to reproduce the same using plain Lucene IndexReader/Writer/Searcher, but couldn't reproduce.\n\nUnfortunately there is a lot of \"wrapping\" of the reader we use...  Perhaps try to do the same wrapping for the lucene version of the test (UninvertingReader and ExitableDirectoryReader)? ",
            "id": "comment-15134305"
        },
        {
            "date": "2016-02-05T15:56:20+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hi Yonik, I had tried this with the ExitableDirectoryReader and UninvertingReader wrapping as well. Adding it to the test file now. I can't reproduce the issue using just the plain Lucene readers, even after wrapping. Not sure what I'm missing... (maybe something happening during a SolrCore's commit()? even that doesn't make sense, since I'm doing a writer.commit() here, totally bypassing the SolrCore.commit()). ",
            "id": "comment-15134363"
        },
        {
            "date": "2016-02-08T22:46:04+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "I missed the schema file I used here. ",
            "id": "comment-15137913"
        },
        {
            "date": "2016-02-09T20:23:43+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Erick Erickson pinged me and pointed out that the test doesn't work due to problems with the schema file I added. Updating the patch so that this can be reproduced. ",
            "id": "comment-15139698"
        }
    ]
}