{
    "id": "SOLR-1397",
    "title": "It should be possible to highlight external text",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Many sites don't store text in Lucene/Solr and so need a way to highlight text stored in a database (or some equivalent).\n\nAs a workaround, FieldAnalysisRequestHandler can provide offsets from external text, but it does not support wildcard queries.",
    "attachments": {
        "SolrExternalFieldProvider.java": "https://issues.apache.org/jira/secure/attachment/12486674/SolrExternalFieldProvider.java",
        "SolrHighlighter.java": "https://issues.apache.org/jira/secure/attachment/12486673/SolrHighlighter.java",
        "ExternalHighlighter.patch": "https://issues.apache.org/jira/secure/attachment/12526768/ExternalHighlighter.patch",
        "DefaultSolrHighlighter.java": "https://issues.apache.org/jira/secure/attachment/12486672/DefaultSolrHighlighter.java",
        "TestExternalFieldProvider.java": "https://issues.apache.org/jira/secure/attachment/12486675/TestExternalFieldProvider.java"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Michael Goddard",
            "id": "comment-12969475",
            "date": "2010-12-08T20:38:13+0000",
            "content": "Agreed!  I've just encountered a situation which begs for the capability to access the Solr instance that provided my results, which include the primary key for the RDBMS table and the score.  I would pull the text from the RDBMS table and, hopefully, do an HTTP GET to the Solr highlight service with the query and this text, and Solr would return the text, highlighted.\n\nAre any other folks interested?  Has there been any work done along these lines? "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12970239",
            "date": "2010-12-10T17:14:41+0000",
            "content": "There has been interest for a LONG time...  but it will take some non-trivial work to make it happen.\n\nPatches are always welcome! "
        },
        {
            "author": "Jamie Johnson",
            "id": "comment-13066162",
            "date": "2011-07-15T20:00:36+0000",
            "content": "I had a need for this as well and have put together an implementation that works for my use case.  I've attached my implementation to this JIRA, I didn't know how to create a patch, but if someone has those details I'll do so. "
        },
        {
            "author": "Mike Sokolov",
            "id": "comment-13066165",
            "date": "2011-07-15T20:11:03+0000",
            "content": "I'm interested, but don't see the attachment?\n\nYou can make a patch with svn, or in an IDE equipped with svn.  From the top-level project folder run:\n\nsvn diff > SOLR-1397.patch\n\nThis assumes that the only changes in your project are related to the patch "
        },
        {
            "author": "David Smiley",
            "id": "comment-13066166",
            "date": "2011-07-15T20:15:40+0000",
            "content": "This is related to SOLR-1954 which is my patch to expose highlighting offset in the highlighting component. This was used on a system that did on the fly PDF highlighting. It's rather complicated to explain, but all we really needed from Solr was the offsets, which it already new but didn't expose in the response. "
        },
        {
            "author": "Jamie Johnson",
            "id": "comment-13066167",
            "date": "2011-07-15T20:15:45+0000",
            "content": "Modified classes to support External Fields.\n\nThe test class provided external field provider is very simple and always returns the same values, this was fine for my test since my test data always had the same value. "
        },
        {
            "author": "Jamie Johnson",
            "id": "comment-13066343",
            "date": "2011-07-16T01:50:55+0000",
            "content": "David, I looked at SOLR-1954 but after applying the patch to trunk the offsets that are returned span the full length of the field + the highlight tags, any idea why? "
        },
        {
            "author": "Jamie Johnson",
            "id": "comment-13274673",
            "date": "2012-05-14T15:22:01+0000",
            "content": "Attached is a first patch at adding the External Highlighter.  I have not had a chance to write tests for this as of yet, but it's just meant to be a starting point.  There were some changes to the DefaultHighlighter, so my changes didn't apply cleanly out of the box, but hopefully I've caught everything.\n\nTo add an external provider just add this to the highlighter.\n\nsolrconfig.xml\n    <highlighting>\n\t\t<externalFieldProvider default=\"true\" name=\"text\" class=\"somecustomfieldprovider\">\n        \t<str name=\"param1\">value</str>\n      </externalFieldProvider>\n\n "
        }
    ]
}