{
    "id": "SOLR-11573",
    "title": "Add live-preview support for ref-guide files using asciidoc-includes",
    "details": {
        "labels": "",
        "priority": "Trivial",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.2",
            "master (8.0)"
        ],
        "affect_versions": "master (8.0)",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "With the completion of SOLR-11032, the \"Using SolrJ\" page in the ref-guide now imports some Java code snippets from an external file.  This is done to allow the snippets appearing in the documentation to be compiled/run as part of the build...so they will always stay up to date.\n\nDuring the ref-guide build, this external file is copied into the ref-guide build directory so that the references to it can be resolved.  However, anyone using the \"live preview\" feature of modern asciidoc editors (Atom, etc.), will find that the snippets don't appear in their live-preview.  Depending on your editor, a discrete error message may be displayed.\n\nIt would be nice to fix this \"papercut\" in usability, or at least provide a workaround.  The easier we can make it to improve the docs, the better.",
    "attachments": {
        "SOLR-11573_meta-docs.patch": "https://issues.apache.org/jira/secure/attachment/12898962/SOLR-11573_meta-docs.patch",
        "SOLR-11573.patch": "https://issues.apache.org/jira/secure/attachment/12898372/SOLR-11573.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-29T22:11:25+0000",
            "content": "This could be as simple/lightweight as including instructions for copying conf-changes for Atom in the ref-guide Readme (or in meta-docs if they belong more there).\n\nAnother option would involve creating an ant atom target which either reconfigures Atom's included-files path.  This follows the pattern established by the existing ant eclipse and ant intellij targets.\n\nThere might be other better solutions too, these are just two options. ",
            "author": "Jason Gerlowski",
            "id": "comment-16224225"
        },
        {
            "date": "2017-10-29T23:00:53+0000",
            "content": "i'm not very familiar with ATOM or live eidting asciidoc files, but in searching a bit to see if there were options in ATOM's asciidoc support for configuring an \"include path\" i noticed this bug report...\n\nhttps://github.com/asciidoctor/atom-asciidoc-preview/issues/189\n\n3 things jump out at me in this report...\n\n\n\tthe ATOM asciidoctor live-preview functionality evidently supports the ability to specify configure custom attributes used when doing the preview?\n\tthe idea of using an attribute reference in an include:: path ... an attribute might be declared in the document metadata with one (default) value for previewing but the build system could specify a different value when generating the final html/pdf output.\n\tadjusting the SAFE mode level of asciidoctor can aparently make it possible to include:: files with relative paths outside of the base_dir.\n\n\n\n...between those 3 things it seems like it should be possible to...\n\n\n\tuse a new \"rel-path-for-solr-root\" attribute in using-solrj.adoc setup in such a way that by default, any editor that's configured to be \"unsafe\" can find the original *.java files we might want to include...\n\n= Using SolrJ\n:rel-path-for-solr-root: ../../\n:test-dir: {rel-path-for-solr-root}solrj/src/test/org/apache/solr/client/ref_guide_examples/\n...\ninclude::{test-dir}UsingSolrJRefGuideExamplesTest.java[tag=solrj-solrclient-timeouts]\n\n\n\tupdate our build.xml to override rel-path-for-solr-root to something that makes sense realtive to the build/content dir we use – hopefully no longer needing to copy the *.java files at all?\n\tadd an ant setup-atom target (if needed) that generates the appropriate ATOM config with the \"unsafe\" level we need for those paths to work?\n\n\n\nThe devil will obviously be in the details ... we've encountered enough weird bugs with asciidoctor include paths and deep dirs in the past (https://github.com/asciidoctor/asciidoctor/issues/1866 comes to mind) ... but it certainly seems like we have some options. ",
            "author": "Hoss Man",
            "id": "comment-16224240"
        },
        {
            "date": "2017-11-19T04:08:38+0000",
            "content": "Thanks for doing some digging on this Hoss.\n\nI was able to get the live-preview working pretty easily with the attribute setup you suggested.  This allows us to drop the Java-file copying too.\n\nThe only caveat is that for asciidoctor to access the included-files (which are outside of its chroot), I had to turn \"safe-mode\" off in the Jekyll config.  I'm still poking around the asciidoctor docs to see what exactly this setting controls.  It seems innocent to disable, given how we're using asciidoctor, but I'm still double checking.  Anyone have any context on the scope of this setting?\n\nAnyway, if the property ends up being safe to leave disabled, then this patch is ready for review.  Precommit passes, fwiw. ",
            "author": "Jason Gerlowski",
            "id": "comment-16258314"
        },
        {
            "date": "2017-11-20T17:02:11+0000",
            "content": "I had to turn \"safe-mode\" off in the Jekyll config....Anyone have any context on the scope of this setting?\n\nThis is already disabled in build.xml for the PDF generation, and I think it's just an oversight that it's not disabled in the HTML config also. One of the things \"unsafe\" mode allows you to do is include files - the include directive only works in certain circumstances unless it's in \"unsafe\" (which is why safe mode is disabled for the PDF).\n\nThis section of the Asciidoctor User Manual describes what is and isn't allowed with each mode: http://asciidoctor.org/docs/user-manual/#running-asciidoctor-securely. I personally think the risk is low for our purposes. ",
            "author": "Cassandra Targett",
            "id": "comment-16259482"
        },
        {
            "date": "2017-11-21T12:26:43+0000",
            "content": "Thanks for the clarification Cassandra.  Seems pretty harmless in this case.  With that cleared up, this is ready-to-review whenever. ",
            "author": "Jason Gerlowski",
            "id": "comment-16260648"
        },
        {
            "date": "2017-11-21T15:48:16+0000",
            "content": "Jason Gerlowski - I'm looking at the patch, and I'm a little confused so want to be sure I understand it for later updating the meta-docs for others to use this also:\n\n\n\tThe build.xml and _config.yml.template files set a solr-root-path parameter that is a path relative to the solr/build/solr-ref-guide/content directory, so the root ends up as solr/.\n\tThe using-solrj.adoc file sets a solr-root-path parameter that is a path relative to the solr/solr-ref-guide/src directory, again so the root ends up as solr/.\n\tThe solr-root-path param is used in another param example-source-dir with the path to the dir that has the example file.\n\n\n\nThe thing that's confusing me is why the path doesn't break in the file when the conversion is happening. My understanding of the inheritance here is that the param on the document overrides the param set in our config files (\"passed to the API or CLI\" as described here: http://asciidoctor.org/docs/user-manual/#attribute-assignment-precedence), which would mean that the path would be incorrect during build (it would go only to solr/build instead of solr).\n\nDo you have any insights on this from looking at this closer than I have? ",
            "author": "Cassandra Targett",
            "id": "comment-16260932"
        },
        {
            "date": "2017-11-21T15:53:23+0000",
            "content": "The thing that's confusing me is why the path doesn't break in the file....\n\nOh...scratch all that, I misread the order of inheritance. Whatever is passed to the API or CLI overrides what's in the document. ",
            "author": "Cassandra Targett",
            "id": "comment-16260937"
        },
        {
            "date": "2017-11-21T19:42:34+0000",
            "content": "Commit affeec726917dd4b8a93fc0ee57186a6b91cfd3e in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=affeec7 ]\n\nSOLR-11573: Add solr-root-paths param to allow pulling in code blocks from outside solr-ref-guide tree ",
            "author": "ASF subversion and git services",
            "id": "comment-16261380"
        },
        {
            "date": "2017-11-21T19:43:00+0000",
            "content": "Commit bca72bde01477f0eff782ff65a895ea890dff67f in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=bca72bd ]\n\nSOLR-11573: Add solr-root-paths param to allow pulling in code blocks from outside solr-ref-guide tree ",
            "author": "ASF subversion and git services",
            "id": "comment-16261383"
        },
        {
            "date": "2017-11-21T19:45:39+0000",
            "content": "Patch was good, just changed the order of the front-matter attributes for consistency and noticed a couple places where URLs were being rendered as links when we probably didn't want them to be.\n\nThanks Jason Gerlowski! ",
            "author": "Cassandra Targett",
            "id": "comment-16261386"
        },
        {
            "date": "2017-11-22T16:29:55+0000",
            "content": "Thanks Jason Gerlowski!\n\n+1\n\nOne question: don't we also need to update \"Importing Code Snippets from Other Files\" in meta-docs/asciidoc-syntax.adoc to make it clear how/why the use of :solr-root-path: ../../ is important? (so people don't just try to \"simplify\" things by including with simple path relative to the current adoc file) ",
            "author": "Hoss Man",
            "id": "comment-16262882"
        },
        {
            "date": "2017-11-22T17:21:13+0000",
            "content": "One question: don't we also need to update \"Importing Code Snippets from Other Files\" \n\nYes...I forgot we had added that section and assumed the older way was undocumented and was going to leave it that way until a later point in time. I'll fix it over the weekend. ",
            "author": "Cassandra Targett",
            "id": "comment-16262944"
        },
        {
            "date": "2017-11-22T23:48:52+0000",
            "content": "Cassandra: Here's a stab at a patch for the meta-docs ... not sure i like how it flows, but it might save you some time? Feel free to modify/ignore/commit as you see fit. ",
            "author": "Hoss Man",
            "id": "comment-16263574"
        },
        {
            "date": "2017-11-28T21:00:47+0000",
            "content": "Thanks Hoss, that's great. I'll just commit it here since it's a little change and we'll call this really, really done  ",
            "author": "Cassandra Targett",
            "id": "comment-16269451"
        },
        {
            "date": "2017-11-28T21:01:56+0000",
            "content": "Commit c2f26183a7dd1a32a903e5bf76b925246faeb6d2 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=c2f2618 ]\n\nSOLR-11573: Update meta-docs section on including code from non-adoc files ",
            "author": "ASF subversion and git services",
            "id": "comment-16269454"
        },
        {
            "date": "2017-11-28T21:02:21+0000",
            "content": "Commit a3b46e45cf2b4e5ec7d73f6c39e08750654f1f2a in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a3b46e4 ]\n\nSOLR-11573: Update meta-docs section on including code from non-adoc files ",
            "author": "ASF subversion and git services",
            "id": "comment-16269456"
        }
    ]
}