{
    "id": "SOLR-1802",
    "title": "Make Solr work with IndexReaderFactory implementations that return MultiReader",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "When an IndexReaderFactory returns an instance of MultiReader, various places in Solr try to call reader.directory() and reader.getVersion, which results an UnsupportedOperationException.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12840006",
            "date": "2010-03-02T04:33:59+0000",
            "content": "editing issue summary to reflect that this is an improvement, not a bug.\n\nIt was noted when IndexReaderFactory was added that using custom factories was incompatible with a lot of Solr features precisely because of the assumption about reader.directory()...\n\nCHANGES.txt when the API was introduced...\n\n59. SOLR-243: Add configurable IndexReaderFactory so that alternate IndexReader implementations \n    can be specified via solrconfig.xml. Note that using a custom IndexReader may be incompatible\n    with ReplicationHandler (see comments in SOLR-1366). This should be treated as an experimental feature.\n    (Andrzej Bialecki, hossman, Mark Miller, John Wang)\n\n\n\n\n\nexample solrconfig.xml (the only place the feature is advertised)...\n\n  <!-- Use the following format to specify a custom IndexReaderFactory - allows for alternate\n       IndexReader implementations.\n\n       ** Experimental Feature **\n       Please note - Using a custom IndexReaderFactory may prevent certain other features\n       from working. The API to IndexReaderFactory may change without warning or may even\n       be removed from future releases if the problems cannot be resolved.\n\n       ** Features that may not work with custom IndexReaderFactory **\n       The ReplicationHandler assumes a disk-resident index. Using a custom\n       IndexReader implementation may cause incompatibility with ReplicationHandler and\n       may cause replication to not work correctly. See SOLR-1366 for details.\n\n  <indexReaderFactory name=\"IndexReaderFactory\" class=\"package.class\">\n    Parameters as required by the implementation\n  </indexReaderFactory >\n\n\n\n "
        },
        {
            "author": "John Wang",
            "id": "comment-12840010",
            "date": "2010-03-02T04:49:48+0000",
            "content": "Thanks Chris for the info. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12843855",
            "date": "2010-03-11T00:55:01+0000",
            "content": "Hey John,\n\nDepending on what you are trying to do, you may look at the work around that was used in SOLR-1366. Its not generic, but it may work for your use case. "
        },
        {
            "author": "John Wang",
            "id": "comment-12843922",
            "date": "2010-03-11T05:33:55+0000",
            "content": "Thanks Mark for the pointer! "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16018994",
            "date": "2017-05-21T22:11:11+0000",
            "content": "Closing ancient issue as won't fix. If you feel this is an error, please re-open (and supply a patch)  "
        }
    ]
}