{
    "id": "SOLR-12163",
    "title": "Ref Guide: Improve Setting Up an External ZK Ensemble page",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.4",
            "master (8.0)"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "I had to set up a ZK ensemble the other day for the first time in a while, and thought I'd test our docs on the subject while I was at it. I headed over to https://lucene.apache.org/solr/guide/setting-up-an-external-zookeeper-ensemble.html, and...Well, I still haven't gotten back to what I was trying to do, but I rewrote the entire page.\n\nThe problem to me is that the page today is mostly a stripped down copy of the ZK Getting Started docs: walking through setting up a single ZK instance before introducing the idea of an ensemble and going back through the same configs again to update them for the ensemble.\n\nIOW, despite the page being titled \"setting up an ensemble\", it's mostly about not setting up an ensemble. That's at the end of the page, which itself focuses a bit heavily on the use case of running an ensemble on a single server (so, if you're counting...that's 3 use cases we don't want people to use discussed in detail on a page that's supposedly about not doing any of those things).\n\nSo, I took all of it and restructured the whole thing to focus primarily on the use case we want people to use: running 3 ZK nodes on different machines. Running 3 on one machine is still there, but noted in passing with the appropriate caveats. I've also added information about choosing to use a chroot, which AFAICT was only covered in the section on Taking Solr to Production.",
    "attachments": {
        "setting-up-an-external-zookeeper-ensemble.adoc": "https://issues.apache.org/jira/secure/attachment/12916866/setting-up-an-external-zookeeper-ensemble.adoc"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-03-29T18:02:48+0000",
            "content": "Instead of a patch I'm putting up the whole revised file since there are so many changes to the page. If anyone who knows ZK setup well has time to take a look, I'd appreciate it - otherwise I'll try to commit the changes sometime next week. ",
            "author": "Cassandra Targett",
            "id": "comment-16419503"
        },
        {
            "date": "2018-03-29T20:02:10+0000",
            "content": "This looks great!\n\nI need to read it more thoroughly but one thing I wanted to add was making sure users enable GC logging, proper log rotation and heap settings for their zookeeper installation.  This can greatly help in debugging the root cause when dealing with cluster issues. ",
            "author": "Varun Thacker",
            "id": "comment-16419663"
        },
        {
            "date": "2018-03-29T20:12:12+0000",
            "content": "one thing I wanted to add was making sure users enable GC logging, proper log rotation and heap settings for their zookeeper installation\n\nAh, great point. We currently say nothing that I can find anywhere in the guide about proper production operationalization of ZK, and we probably should (if not on this page, then in Taking Solr to Production for sure). ",
            "author": "Cassandra Targett",
            "id": "comment-16419678"
        },
        {
            "date": "2018-03-30T21:04:18+0000",
            "content": "1. \"Any shards or Solr instances\" -> \"All remaining Solr nodes in the cluster that rely...\" \n2. To me this section \"Running an Ensemble on a Single Server\" looks like it could be skipped ? If someone wants to run 3 ZK instances on one sever , we firstly shouldn't be helping them and secondly they might as well run one instance? And it just adds more docs and makes it complicated to read ?\n\n3. One really important thing users miss out while configuring zoo.cfg is setting autopurge.snapRetainCount and autopurge.purgeInterval . If you don't see the latter then basically the snapshots never get deleted and users run of out disk space. So let's add the following two params to zoo.cfg as well\nautopurge.snapRetainCount=3\nautopurge.purgeInterval=1\n\n\n4. We need to create a file called zookeeper-env.sh under zookeeper_homne/conf\n\n4.1 To configure ZooKeeper logging add the following to zookeeper-env.sh. Please additionally configure log file size in conf/log4j.properties ( line 41 )\n\nZOO_LOG_DIR=\"/Users/varunthacker/zookeeper-3.4.9/logging\"\n\nZOO_LOG4J_PROP=\"INFO,ROLLINGFILE\"\n\n\n4.2. To configure heap size and enable GC logging add the following to zookeeper-env.sh:\n\nSERVER_JVMFLAGS=\"-Xms2048m -Xmx2048m -verbose:gc -XX:+PrintHeapAtGC -XX:+PrintGCDetails -XX:+PrintGCDateStamps -XX:+PrintGCTimeStamps -XX:+PrintTenuringDistribution -XX:+PrintGCApplicationStoppedTime -Xloggc:$ZOO_LOG_DIR/zookeeper_gc.log -XX:+UseGCLogFileRotation -XX:NumberOfGCLogFiles=9 -XX:GCLogFileSize=20M\"\n\nFYI when i was testing this to see if it all works, I didn't see anything in the zookeeper_gc.log.0.current file. I had to force a GC through jconsole and then entries started to show up so don't be surprised if you don't see any gc log entries on startup. ",
            "author": "Varun Thacker",
            "id": "comment-16420934"
        },
        {
            "date": "2018-04-02T16:37:08+0000",
            "content": "Thanks Varun Thacker.\n\nI can't find any reference to a zookeeper-env.sh in ZK docs - is there anything you didn't mention that users should do during setup to be sure this file is read?\n\nQuasi-related: everything in the example zoo.cfg assumes a *nix-based OS (paths in particular), and I note that ZK 3.4.11 docs now say Windows is supported for production deployments (earlier versions said it was not...). Besides providing a Windows-based example of zoo.cfg, how do we provide a Windows-based zookeeper-env?\n\nWe can probably remove the \"all 3 zk on one server\" examples - I left/adapted it because I thought maybe it was commonly used in pre-prod scenarios since it was the only one really discussed on the page. But if it's confusing, it should go.\n\nI'll mix in the other suggestions, thank you. ",
            "author": "Cassandra Targett",
            "id": "comment-16422725"
        },
        {
            "date": "2018-04-02T18:20:01+0000",
            "content": "I can't find any reference to a zookeeper-env.sh in ZK docs - is there anything you didn't mention that users should do during setup to be sure this file is read?\nThe start script for ZooKeeper actually tries looking for a zookeeper_home/conf/zookeeper-env.sh file and picks up variables from there . But ZK doesn't ship with an empty zookeeper-env.sh file in the conf directory so one must create the file and then add those env variables . Here is where the variables are loaded : https://github.com/apache/zookeeper/blob/master/bin/zkEnv.sh#L53\n\n \n\nI don't see the same mechanics in the windows script : https://github.com/apache/zookeeper/blob/master/bin/zkEnv.cmd , so maybe we just tell windows users to load those variables to bin/zkCli.cmd ? ",
            "author": "Varun Thacker",
            "id": "comment-16422912"
        },
        {
            "date": "2018-04-03T14:19:56+0000",
            "content": "maybe we just tell windows users to load those variables to bin/zkCli.cmd ?\n\nYou lost me there - tell Windows users to modify zkCli.cmd (how?)? or provide the env file as a parameter? ",
            "author": "Cassandra Targett",
            "id": "comment-16424087"
        },
        {
            "date": "2018-04-19T14:51:11+0000",
            "content": "Commit 42da6f795d8cd68891845f20201a902f7da4c579 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=42da6f7 ]\n\nSOLR-12163: Updated and expanded ZK ensemble docs ",
            "author": "ASF subversion and git services",
            "id": "comment-16444158"
        },
        {
            "date": "2018-04-19T14:51:57+0000",
            "content": "Commit 2defbf060564d6dafdc775c12c21ced0ad8ebc09 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2defbf0 ]\n\nSOLR-12163: Updated and expanded ZK ensemble docs ",
            "author": "ASF subversion and git services",
            "id": "comment-16444159"
        },
        {
            "date": "2018-04-19T14:53:32+0000",
            "content": "I ended up only adding a note that settings that can go in zookeeper-env.sh on *nix have to go into zkServer.cmd on Windows. I can't find any good examples of doing that it ZK docs, so hopefully someone will be able to give us some feedback based on their experience that we can add to the docs later. ",
            "author": "Cassandra Targett",
            "id": "comment-16444161"
        },
        {
            "date": "2018-04-20T20:00:05+0000",
            "content": "Commit e1ccb49956d19f2449c482ece69faf9abe901095 in lucene-solr's branch refs/heads/branch_7x from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e1ccb49 ]\n\nSOLR-12163: Minor cleanups ",
            "author": "ASF subversion and git services",
            "id": "comment-16446283"
        },
        {
            "date": "2018-04-20T20:00:07+0000",
            "content": "Commit 76578cf17b07c7d3d3440de171c031386a10aa28 in lucene-solr's branch refs/heads/master from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=76578cf ]\n\nSOLR-12163: Minor cleanups ",
            "author": "ASF subversion and git services",
            "id": "comment-16446284"
        },
        {
            "date": "2018-04-20T20:01:45+0000",
            "content": "After running them by Cassandra offline, I pushed cleanups for a few minor issues I noticed on the page. ",
            "author": "Steve Rowe",
            "id": "comment-16446287"
        }
    ]
}