{
    "id": "SOLR-2229",
    "title": "DIH run on one index cause all others index's data to be deleted",
    "details": {
        "affect_versions": "3.1,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Hi guys,\n\nsorry for posting this 3rd time, but I have realized what is causing this bug and how to repeat it.\nTried on 3.1 and 4.0, exactly same issue on both.\n\nOK, once you run DIH on your forst index all is fine, but if you have second index then run DIH on second index cause first index's data to be completely deleted.\n\nHave been running DIH simultaneously before that;s why thought its unrelated but it was the last committed DIH which caused all other indexes data to be deleted.\n\n\ncheers,\n/Marcin",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12971125",
            "date": "2010-12-14T02:03:52+0000",
            "content": "Marcin: using the example-DIH setup on the Solr 3x branch, i can not reproduce the behavior you describe.\n\nSteps i used:\n\n1) in the examples directory run: \"java -Dsolr.solr.home=example-DIH/solr -jar start.jar\"\n2) load the URL \"http://localhost:8983/solr/rss/dataimport?command=full-import\" to trigger full import in the rss core\n3) verify documents were indexed using \"http://localhost:8983/solr/rss/select/?q=%3A\"\n4) load the URL \"http://localhost:8983/solr/db/dataimport?command=full-import\" to trigger full import in the db core\n5) verify documents were indexed using \"http://localhost:8983/solr/db/select/?q=%3A\"\n6) verify documents are still in the rss core by force reloading the URL from #3.\n\nnothing i did using DIH in one core affected the index in the other core.\n\nw/o more info baout your configs, my best guess is that when you say \"second index\" what you really mean is is that you have multiple DIH configs (or entities) in a single SolrCore (ie: index) and you are running multiple full-import commands.\n\nDIH has a \"clean\" param which is documented to default to \"true\" on full-import – it deletes all docs from the index (of your current SolrCore) .. i think that's may be what's confusing you.\n\nplease post a followup with more details to the solr-user mailing list if you are still confused and having problems – no need to worry about filing a Jira until people on the user list have been able to help you verify it's a reproducabile bug and not a missunderstanding in your configs "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013111",
            "date": "2011-03-30T15:45:34+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}