{
    "id": "SOLR-257",
    "title": "Add ability for WordDelimiterFilter to ignore case changes",
    "details": {
        "affect_versions": "1.2",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "update"
        ],
        "type": "Improvement",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "patch adds ignoreCaseChange option to WordDelimiterFilter, which I have used and it may be more generally useful",
    "attachments": {
        "ignoreCaseChange.patch": "https://issues.apache.org/jira/secure/attachment/12359212/ignoreCaseChange.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12502529",
            "date": "2007-06-07T21:22:20+0000",
            "content": "For reference, can you clarify how this differs from generateWordParts?\n\ni'm also wondering if the option shouldn't be inverted (ie: delimitOnCaseChange) and defaulted to true.  all of the existing options are are \"positive\" in nature, they cause the filter to \"do more\" when true ... the semantics of this option would be to \"do less\" when it's true which may be a bit confusing for people "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12502543",
            "date": "2007-06-07T21:46:23+0000",
            "content": "I like splitOnCaseChange=false (default would be true)\n "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12502546",
            "date": "2007-06-07T21:51:32+0000",
            "content": "The difference from generateWordParts is as follows:  gWP splits adjacent tokens to see if they are both alpha regardless of how they are delimited.  So if gWP=0, then PowerShot=power-shot=Power-Shot=powershot.  If gWP=1 and ignoreCaseChange=1, then PowerShot=powershot, but Power-Shot=power-shot=power shot.\n\nFor us, case changes were too \"weak\" a delimiter, and high idf subwords were inappropriately driving up relevancy on certain docs.\n "
        },
        {
            "author": "J.J. Larrea",
            "id": "comment-12502690",
            "date": "2007-06-08T06:22:19+0000",
            "content": "Just last week I considered adding a parameter to WDF to suppress splitting on case change; I lazed out by simply throwing a LowerCaseFilter in front of the WDF in my Analyzer chain, but at the time I was thinking that it would get me into trouble if I ever wanted to run the output of WDF into a case-dependent stopword or synonym table.  So this is useful and should be committed... though I agree the parameter should be \"positive\" and I like Yonik's naming suggestion.  "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12502840",
            "date": "2007-06-08T15:21:24+0000",
            "content": "Do people think the example \"text\" fieldType should default to splitOnCaseChange=\"false\"?\nMany people use these fieldType definitions unchanged, until they run into a problem. "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12502906",
            "date": "2007-06-08T19:00:34+0000",
            "content": "Might be a good idea.  Case-based splitting is a relatively aggressive default (then again, I'd say the same about stemming).\n\nI'll leave it out of the patch, and we can always change it later "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12502907",
            "date": "2007-06-08T19:06:17+0000",
            "content": "commited in r545597 with inverted logic and yonik's name suggestion. "
        }
    ]
}