{
    "id": "SOLR-8829",
    "title": "Mark CDCR as experimental in 6.0",
    "details": {
        "components": [
            "CDCR",
            "SolrCloud"
        ],
        "type": "Wish",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Invalid",
        "priority": "Critical"
    },
    "description": "A slew of improvements to CDCR viz. SOLR-6465, SOLR-8389, SOLR-8391 are planned and on which I am actively working. Unfortunately, those won't make it to the 6.0 release. At the same time since both the amount of configuration and mode of configuration (API vs editing solrconfig.xml) will change with these planned improvements, it'd be nice to not have strong back-compat guarantees which prevent us from making CDCR easier to use.\n\nTherefore, I propose to put a note in CHANGES.txt and any documentation in the Solr reference guide to this effect as well as add an experimental response key in all CDCR API responses.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-10T19:17:01+0000",
            "author": "Anshum Gupta",
            "content": "+1 to making it experimental. ",
            "id": "comment-15189778"
        },
        {
            "date": "2016-03-10T19:58:03+0000",
            "author": "Erick Erickson",
            "content": "+1\n\nBTW, I'm working on the CWiki docs for configuration, should have them in early next week. (or perhaps this weekend) so we'll have a home for documenting your changes. ",
            "id": "comment-15189858"
        },
        {
            "date": "2016-03-11T05:24:09+0000",
            "author": "Noble Paul",
            "content": "Keeping in mind that there will be significant changes on how we use CDCR as a result of SOLR-8389, it is important to highlight that it is not just experimental , the work flow and public interfaces also will change significantly ",
            "id": "comment-15190483"
        },
        {
            "date": "2016-06-09T15:00:01+0000",
            "author": "Adrien Grand",
            "content": "Is there anything we need to get done for 6.1 here? ",
            "id": "comment-15322660"
        },
        {
            "date": "2016-09-29T18:07:08+0000",
            "author": "Cassandra Targett",
            "content": "I guess this never got done. Is it too late? ",
            "id": "comment-15533547"
        },
        {
            "date": "2016-09-29T18:25:47+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Yeah, I think we can close this. The feature has already been released. We will improve it keeping a certain level of backwards-compatibility in mind and call out exceptions in the change log when necessary. ",
            "id": "comment-15533607"
        }
    ]
}