{
    "id": "SOLR-3276",
    "title": "Fix attribute conventions for JapaneseTokenizerFactory and add important information to schema.xml",
    "details": {
        "affect_versions": "3.6,                                            4.0-ALPHA",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The description of the ja_text field type in schema.xml is incomplete, doesn't describe user dictionaries and lacks a reference to the wiki page with extensive Japanese language support details (http://wiki.apache.org/solr/JapaneseLanguageSupport - currently a placeholder page).\n\nThe attribute convention used by JapaneseTokenizerFactory doesn't comply with the standards and used user-dictionary and user-dictionary-encoding instead of userDictionary and userDictionaryEncoding.\n\nThese changes are low risk and it would be a shame to not get this right in 3.6 with all the work done on Japanese.\n\nPatch coming up shortly.  I really hope it's okay to commit this.",
    "attachments": {
        "SOLR-3276.patch": "https://issues.apache.org/jira/secure/attachment/12520283/SOLR-3276.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13240409",
            "date": "2012-03-28T13:44:56+0000",
            "content": "I'll review your patch when its ready, but conceptually I don't see any issue with this.\n\nI don't have any issue at all with documentation, test, or bug fixes. We shouldn't be\nadding any new features at this point though.\n\nJust mark any issues you find like this as blocker and give extra time to review since we are in freeze.\n\nIts definitely helpful to be finding and fixing this stuff before the release candidate\nbecause it saves us all time.\n\nThanks! "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13240523",
            "date": "2012-03-28T16:39:43+0000",
            "content": "patch looks good. thanks for catching all this stuff. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13240526",
            "date": "2012-03-28T16:44:51+0000",
            "content": "looks good! Die, System.out, die! The new attributes are more \"xml-compatible\". "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13240533",
            "date": "2012-03-28T16:53:38+0000",
            "content": "Fixed a typo. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13240534",
            "date": "2012-03-28T16:54:31+0000",
            "content": "Thanks a lot, Robert and Uwe!\n\nThis is a summary of the changes:\n\n\n\tImprovements to schema.xml\n\t\n\t\tImproved description of text_ja and JapaneseAnalyzer to explain synonym compounds\n\t\tAdded a brief description of user dictionaries and a commented out sample tokenizer entry\n\t\tAdded a mention on using different segmentation modes for index and query, but no elaborate config\n\t\tAdded a wiki reference to the Japanese language support (currently a placeholder)\n\t\n\t\n\tFixed user dictionary attribute naming conventions for JapaneseTokenizerFactory.  Attributes are now userDictionary and userDictionaryEncoding (was user-dictionary and user-ictionary-encoding\n\tAdded a sample user dictionary file to solr/example/solr/conf/lang/userdict_ja.txt with format details, which is referenced from the commented out example in schema.xml.\n\tChanged Kuromoji to Japanese naming in stopwords.txt and stoptags.txt.  (Need a sync-analyzers in solr prior to commit)\n\tReplaced a one-liner of code, I've changed a System.out.println in UserDictionary to throw a RuntimeException with a proper error message in case user dictionary parsing fails, and tested this manually.\n\n\n\nIf you claim that there's been some scope-creep in this patch, I can't argue with that.    "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13240551",
            "date": "2012-03-28T17:13:52+0000",
            "content": "I'll commit this shortly. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13240563",
            "date": "2012-03-28T17:21:18+0000",
            "content": "Committed revision 1306476 to trunk.  Backporting to branch_3x. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13240602",
            "date": "2012-03-28T18:20:39+0000",
            "content": "Committed revision 1306524 to branch_3x.\n\nThanks again for reviewing, Robert and Uwe! "
        }
    ]
}