{
    "id": "SOLR-2957",
    "title": "collection URLs in a cluster",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "SolrCloud",
            "update"
        ],
        "type": "Sub-task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In solrcloud, one can hit a URL of /collection1/select and get a distributed search over collection1.\nIf we wish to maintain this, we'll need some more flexible URL to core mapping since there may be more than one core for the collection on a node, and the \"collection1\" core on that node could go away altogether.",
    "attachments": {
        "SOLR-2957.patch": "https://issues.apache.org/jira/secure/attachment/12513975/SOLR-2957.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13166361",
            "date": "2011-12-09T17:48:32+0000",
            "content": "Lookup core name directy as is done now.\nIf it's not found, and we are in ZK mode, then\nreturn the core for a shard leader in the collection one exists, or\nreturn the core for any shard in the collection.\n\nWhat about the case where there isn't even a shard for the collection being requested?\nIt would seem desirable for a client to be able to hit any node in a cluster w/o worrying about layout, movement, and rebalancing making requests suddenly fail.\n\nOne solution: if there's not a local core for the collection, convert the URL to add the collection name as a parameter and then return the default core, which can then do the appropriate forwarding logic.\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13204656",
            "date": "2012-02-09T17:07:09+0000",
            "content": "I've implemented the first part - if you pass a corename in the url that is not found, when in zk mode, we try using the corename as the collection name and we search the local instance for any cores that are in that collection, first looking for a leader. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13204692",
            "date": "2012-02-09T17:58:16+0000",
            "content": "I'm going to commit this (if there are no objections/comments) and create another issue for the further improvement of working even when there are no nodes for the collection on the local instance. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13204703",
            "date": "2012-02-09T18:10:20+0000",
            "content": "cool!  +1 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13205488",
            "date": "2012-02-10T14:55:06+0000",
            "content": "I've got a new issue for the remaining suggestion: SOLR-3119 "
        }
    ]
}