{
    "id": "SOLR-6817",
    "title": "Collation suggestions regard correctly spelt words as incorrect.",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "4.10.2",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "We've ran into an issue where if you have one word spelt correctly and one word spelt incorrectly, then the collation suggestions will only return alternatives for each word.  This is not the case if both words are spelt incorrectly.\n\nI.e, if you do a search for \"ipod toach\", it will suggest alternatives for both \"ipod\" and \"toach\".  The collation suggestions will not include \"ipod touch\" which would be the desired suggestion.\n\nIf you do a search for \"ipodd toach\", the collation suggestions will include \"ipod touch\" as both words are incorrectly spelt.\n\nSo you need to spell everything wrong, rather than some things wrong for the spell check collator to work correctly.  In the real world, some people will spell only a few words wrong in a query, not everything wrong, so it is a bit of a usability issue.\n\nI've created a workaround for the collator to include the original term in the collation suggestions if itself is spelt correctly, rather than use suggestions of the correctly spelt word.\n\nThis has a bit of a performance hit, as we need to query to make sure the word is spelt correctly, so I think there might be a more deeper way of changing it, but works as intended for now.",
    "attachments": {
        "solr_collation.patch": "https://issues.apache.org/jira/secure/attachment/12686440/solr_collation.patch",
        "SpellCheckCollator.java": "https://issues.apache.org/jira/secure/attachment/12685050/SpellCheckCollator.java"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-11T14:46:39+0000",
            "author": "James Dyer",
            "content": "I'm not convinced this is a bug, so before we continue on this route, can you post this as a question on the solr user's list?\n\nInclude:\n\n\tYour spelling config from solrconfig.xml\n\tThe two queries request URLs you are trying\n\tThe full spelling response for each query\n\n ",
            "id": "comment-14242626"
        }
    ]
}