{
    "id": "SOLR-765",
    "title": "ant example fails if example/work directory doesn't exist",
    "details": {
        "affect_versions": "1.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Running \"ant example\" when there's no example/work directory causes the build to fail because the task tries to delete the (non-existent) directory.",
    "attachments": {
        "SOLR-765.patch": "https://issues.apache.org/jira/secure/attachment/12389859/SOLR-765.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lars Kotthoff",
            "id": "comment-12629907",
            "date": "2008-09-10T18:40:47+0000",
            "content": "Patch adding 'failonerror=\"false\"' to the delete in the example ant task. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12629931",
            "date": "2008-09-10T19:50:30+0000",
            "content": "I promise to clean up my solr-patch-mess and not attach the wrong patch again. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12629958",
            "date": "2008-09-10T20:44:26+0000",
            "content": "why don't you have an example/work directory?\n\nit's actually committed to svn as an empty directory, and explicitly included as an empty directory in the releases.\n\n(i'm completely surprised that the example works at all if you've manually deleted the work directory) "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630134",
            "date": "2008-09-11T09:15:14+0000",
            "content": "why don't you have an example/work directory?\n\nActually, I have no idea. I was working with an old checkout (which I updated first), ran \"ant example\", and it failed.\n\nIs there any reason why the empty directories are checked in to SVN instead of taking care of that in the build.xml? I think this makes it easier to mess things up yourself without realising it, e.g. by deleting the work directory manually to make sure that you've got a \"fresh\" start. Same thing for the example/logs directory which is required to run Jetty. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12630832",
            "date": "2008-09-13T22:37:49+0000",
            "content": "Actually, I have no idea. I was working with an old checkout (which I updated first), ran \"ant example\", and it failed.\n\nthat's really weird .. even if you manually deleted it svn update should have recreated it.\n\nIs there any reason why the empty directories are checked in to SVN instead of taking care of that in the build.xml\n\nwell, one reason is that it makes it easier to see what's going on when browsing the repository (without actually needing to run ant) ... but it's not like we've ever had any serious discussion about it on solr-dev or anything ... it's just the way things worked out.\n\nif you're working with svn and you want to make sure you have a \"fresh start\" use \"svn revert -R\" and \"ant clean\" "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12630858",
            "date": "2008-09-14T07:54:22+0000",
            "content": "if you're working with svn and you want to make sure you have a \"fresh start\" use \"svn revert -R\" and \"ant clean\"\n\nOk, but that doesn't solve the problem if you're not using a checkout. I just think that it's not particularly good pratice to assume the existence of directories and fail if they don't when it's perfectly possible to check for the existence and create them/ignore errors in the build script. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12631868",
            "date": "2008-09-17T18:12:11+0000",
            "content": "Is there any harm in doing what Lars is suggesting?  If no, why not commit?  I can imagine removing a dir locally for whatever reason and regardless of whether I'm working with a svn checkout or downloaded dist. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12631870",
            "date": "2008-09-17T18:31:25+0000",
            "content": "\nDirectories either need to be owned by svn or not – you don't want a hybrid approach. if you have a directory owned by svn but you also have the build scripts recreate that directory as needed, you can get into really screwy situations because of the inconsistency between a directory existing as SVN expects, but the metadata for that dir is missing...\n\n\nchrish@asimov:~/lucene/solr$ rm -r example/work/\nrm: remove write-protected regular file `example/work//.svn/dir-prop-base'? y\nrm: remove write-protected regular file `example/work//.svn/entries'? y\nrm: remove write-protected regular file `example/work//.svn/format'? y\nrm: remove write-protected regular file `example/work//.svn/all-wcprops'? y\nchrish@asimov:~/lucene/solr$ mkdir example/work\nchrish@asimov:~/lucene/solr$ svn status\n~      example/work\nchrish@asimov:~/lucene/solr$ svn update\nsvn: Directory 'example/work/.svn' containing working copy admin area is missing\nchrish@asimov:~/lucene/solr$ svn revert -R .\nsvn: Try 'svn revert --recursive' instead?\nsvn: Directory 'example/work/.svn' containing working copy admin area is missing\nchrish@asimov:~/lucene/solr$ svn status\n~      example/work\n\n\n\nThis is one reason why a few years back i argued against even having \"example\" committed into svn at all – i would have preferred a \"src/example\" and have the build system create all the directories it needed under \"build/example\" and copy files as appropriate ... but i don't really think it's worth completely revamping now.\n\nThe nice thing about how we have things now (empty dirs committed) is that if people don't like ant and want to setup their own \"project configs' in their favorite editors the \"example\" directory as it comes (without the solr.war) is a complete environment – you don't have to do anything but run \"java -jar start.jar\" and jetty will run, and you can add the war however you want (ie: build by your IDE)\n\nWe can't project people from themselves ... even if we recreate the empty directories on the fly (in a way that doesn't burn people using svn), we can't recreate things like example/etc or example/lib if people inadvertently delete those. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12631918",
            "date": "2008-09-17T20:18:32+0000",
            "content": "The current patch just adds failonerror=\"false\", which won't do any harm, as it's not creating anything. Creating a directory would only be required when the example/log/ directory has been deleted (as this is required by Jetty). The other option is to simply put the logfiles somewhere else if the directory is missing. However, IMHO this should be part of a separate issue if we decided that this needs to be handled more robustly as well though. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12633436",
            "date": "2008-09-22T19:01:55+0000",
            "content": "\n1) my previous comment was in regards to your \"possible to check for the existence and create them/ignore errors in the build script\" statement\n\n2) regarding the patch: it can do harm.  I could have sworn i posted a comment about this before resolving but clearly i forgot to hit submit or something...\n\nThe purpose cleaning out the work directory is to provide a safety check to ensure that an older copy of the webapp (with old jars) isn't left lying around where Jetty might pick it up and use it by mistake – it's not suppose to happen but it can.  If we use failonerror=\"false\" it won't just silently ignore a missing work directly, it will also silently ignore any situation where files in the work directory can't be deleted by ant (because of the way the perms are set, or because windows prevents open files from being deleted, etc..) which means the whole point (the safety check) is gone –  people will unwittingly be using old jars and banging their heads against their keyboards not knowing why "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12633445",
            "date": "2008-09-22T19:33:09+0000",
            "content": "Right, fair enough. I'm attaching a new patch which calls <mkdir> on example/work and example/log. If the directories exist, nothing happens. If for some reason they've been lost, they are created. "
        }
    ]
}