{
    "id": "SOLR-3826",
    "title": "Allow unit test classes to specify core name during setup",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.0"
        ],
        "components": [
            "Build"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When creating a unit test extending SolrTestCaseJ4, the corename is forced to \"collection1\" which can be problematic if you want to do unit tests relying on schema/solrconfig specific to a core. Rather than hard-coding to \"collection1\" allow this to be specified in the initCore method.",
    "attachments": {
        "SOLR-3826.patch": "https://issues.apache.org/jira/secure/attachment/12544680/SOLR-3826.patch",
        "SOLR-3826_1.patch": "https://issues.apache.org/jira/secure/attachment/12545099/SOLR-3826_1.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Amit Nithian",
            "id": "comment-13453226",
            "date": "2012-09-11T17:46:19+0000",
            "content": "Simple patch demonstrating what I am talking about. Hopefully not too problematic  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13455422",
            "date": "2012-09-13T23:17:24+0000",
            "content": "Concept looks sound, but i'd like to replace that test specific \"collection1\" constant with a refrence to the existing place where it's defined as the default collection name (in CoreContainer i believe) as well as add some javadocs to the test harness/baseclass about the assumption.\n\nAmit: if you'd like to take a stab at those improvements before i get a chance, that would be awesome "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13455428",
            "date": "2012-09-13T23:22:40+0000",
            "content": "HossMan: Sure I'll take a stab at this. I didn't know this was a constant so I'll give a shot to find it and reference it. Are there any existing docs about how to create tests with Solr? I found there was some discussion on the mailing list. I'm happy to take a first pass at this if you think it'd help. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13455449",
            "date": "2012-09-13T23:43:08+0000",
            "content": "I didn't know this was a constant so I'll give a shot to find it and reference it.\n\nyeah, it dates back to the fact that solr will still work with \"pre-multicore\" solr home dirs that are really just single SolrCore instance dirs – in which case it refers to the core as \"collection1\" ... the constant you want is CoreContainer.DEFAULT_DEFAULT_CORE_NAME  (which this test code should have been using in the first place, but as long as we're touching it let's fix it)\n\nAre there any existing docs about how to create tests with Solr? I found there was some discussion on the mailing list. I'm happy to take a first pass at this if you think it'd help.\n\nAs far as i know the only docs are the javadocs in the base classes and test harness – if you'd like to take a stab at adding useful content to solr/test-framework/src/java/overview.html that would be awesome! (but perhaps deal with thta in a separate jira/patch so it doesn't hold up this already useful fix?) "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13455455",
            "date": "2012-09-13T23:49:24+0000",
            "content": "Sounds good! Let me get together a new patch for this and work on the documentation piece as a separate patch as per your suggestion. "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13455574",
            "date": "2012-09-14T04:56:31+0000",
            "content": "Second pass on patch after HossMan's suggestions. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13455999",
            "date": "2012-09-14T18:21:42+0000",
            "content": "Thanks Amit!\n\nI committed your patch along with a few more method level javadocs and fixed one more place where TestHarness was using a \"collection1\" literal.\n\nCommitted revision 1384872.\nCommitted revision 1384877. - 4x\n\n "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610852",
            "date": "2013-03-22T16:39:49+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1384877\n\nSOLR-3826: Test framework improvements for specifying coreName on initCore (merge r1384872) "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13653918",
            "date": "2013-05-10T10:33:24+0000",
            "content": "Closed after release. "
        }
    ]
}