{
    "id": "SOLR-1226",
    "title": "XPathEntityProcessor should resolve xsl references within Solr's configuration",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The XPathEntityProcessor forces me to use a URL to specify where my XSL file is.  if it is not a URL, what it should do is attempt to resolve it from Solr's configuration  via SolrCore.getREsourceLoader().  I have attached a patch which does this.\n\nNote: it is not clear in the DIH what the concurrency model is and thus I was not certain that XPathEntityProcessor needs to be thread-safe or not.  So just in case I cached the XSLT Transformer in a thread-safe manner using a ThreadLocal.  If DIH committers know that it doesn't have to be thread-safe then some of this code can be simplified.",
    "attachments": {
        "SOLR-1226.patch": "https://issues.apache.org/jira/secure/attachment/12410941/SOLR-1226.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12751838",
            "date": "2009-09-06T07:30:22+0000",
            "content": "Looks like we forgot about this issue.\n\nDavid, DIH is single-threaded (for now) so the ThreadLocal is not neccessary. A unit test will also be good to have. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872410",
            "date": "2010-05-27T22:04:44+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "David Smiley",
            "id": "comment-12996701",
            "date": "2011-02-19T05:09:56+0000",
            "content": "So this hasn't been committed in 1.5+ years because I didn't write a unit test?  Although I classified this issue as an \"improvement\" originally; it is arguably a bug.  All resources referenced in solr config files should be relative to the core conf directory. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12996705",
            "date": "2011-02-19T05:37:17+0000",
            "content": "So this hasn't been committed in 1.5+ years because I didn't write a unit test?\n\nA unit test might have helped, but there are currently almost 800 open issues - it's pretty easy for things to get overlooked.  Welcome to volunteer driven open source  "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-12997243",
            "date": "2011-02-21T00:01:32+0000",
            "content": "\n\tDIH is multi-threaded now. Does this need reworking?\n\tThreadLocal is old-school- there's some lighter-weight concurrent container these days.\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12997412",
            "date": "2011-02-21T14:05:37+0000",
            "content": "So this hasn't been committed in 1.5+ years because I didn't write a unit test?\n\nMore likely because the DIH authors have not been around/active for some time. One of them is an assignee on this issue. I don't use DIH (like many of the other active committers), and I am not too comfortably changing it. The state of it's tests do not look good as is - last I looked, there is not much testing going on. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043619",
            "date": "2011-06-03T16:46:08+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106283",
            "date": "2011-09-16T14:50:23+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "James Dyer",
            "id": "comment-13240614",
            "date": "2012-03-28T18:37:57+0000",
            "content": "The \"threads\" feature was removed from DIH in Trunk/4.x (see SOLR-3262). Some \"threads\" bugs were fixed in version 3.6, the last release in which \"threads\" is available. (see SOLR-3011). "
        }
    ]
}