{
    "id": "SOLR-8956",
    "title": "Highlight missing in Analysis View",
    "details": {
        "components": [
            "Admin UI",
            "Schema and Analysis"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.4,                                            5.5,                                            6.0",
        "status": "Closed",
        "resolution": "Cannot Reproduce",
        "priority": "Major"
    },
    "description": "the new analysis view is missing the highlighting for matches. screenshots appended to show the difference.\n\nthis was reported by user mloeb on #solr yesterday. initially he asked about highlighting in general - questioning a few things has gotten us to the analysis view for debugging purposes. not seeing any highlights given the index/query data - i've asked him to try the very same in the old admin ui where it worked.\n\ni haven't dived in the code yet, probably Upayavira can give a hint where / at what to look?",
    "attachments": {
        "Solr+Admin+2016-04-06+12-09-23.png": "https://issues.apache.org/jira/secure/attachment/12797495/Solr%2BAdmin%2B2016-04-06%2B12-09-23.png",
        "Solr+Admin+2016-04-06+12-03-36.png": "https://issues.apache.org/jira/secure/attachment/12797494/Solr%2BAdmin%2B2016-04-06%2B12-03-36.png",
        "analysis-fixed.png": "https://issues.apache.org/jira/secure/attachment/12868756/analysis-fixed.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-14T18:45:24+0000",
            "author": "Shawn Heisey",
            "content": "I stumbled across this problem while looking at something in 6.0.0.  Glad I checked for an existing issue.\n\nAs long as we're looking at this, can we pick a more vivid color than light urple? ",
            "id": "comment-15241706"
        },
        {
            "date": "2016-04-14T22:44:14+0000",
            "author": "Upayavira",
            "content": "Stefan Matheis (steffkes) is it simply that if a term appears in both sides (query/index) it gets highlighted? Is this represented in the underlying data, or something you do client-side? ",
            "id": "comment-15242077"
        },
        {
            "date": "2016-04-14T23:58:55+0000",
            "author": "Shawn Heisey",
            "content": "You'd probably have to check the code, but here's how I understand this feature:\n\nI believe it's done completely in the admin UI client code.  Every term from the final step of the query analysis is gathered, and at each step of the index analysis, if any of the terms match something in the gathered list, they get highlighted.\n\nAs far as I know, the page doesn't try to verify that the term and the relative position match, which would be a very useful addition.  There are two ways that I can see that working out (probably need a new issue):\n\n\n\tHave a checkbox option to only highlight when both term and relative position match.\n\tHighlight with one color when just the term matches, and another color when both match.  It would probably be a good idea to check to make sure the two colors can be distinguished by people with various forms of color blindness.  I like this option better.\n\n ",
            "id": "comment-15242169"
        },
        {
            "date": "2016-04-15T00:07:08+0000",
            "author": "Shawn Heisey",
            "content": "Position matching code could get fairly complicated, but it would really be an extremely helpful addition.\n\nOne frustration users have is that when they check the analysis page, everything shows up as highlighted, but their queries don't work.  Sometimes this is because the terms match, but the position offsets don't. ",
            "id": "comment-15242181"
        },
        {
            "date": "2016-04-15T07:15:07+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "Stefan Matheis (steffkes) is it simply that if a term appears in both sides (query/index) it gets highlighted? Is this represented in the underlying data, or something you do client-side?\n\neven simpler than that Upayavira, relevant code from the analysis.js:\n\n\n 514                       if( analysis_data[type][i+1][j].match && \n 515                         ( 'text' === short_key || 'raw_bytes' === short_key ) )\n 516                       {\n 517                         classes.push( 'match' );\n 518                       }\n\n\nthere is a match attribute in the response auf the analysis endpoint. the check in L515 is used to limit the cells that get highlighted, iirc (think of the verbose view w/ all the additional information per term) ",
            "id": "comment-15242566"
        },
        {
            "date": "2016-04-15T07:18:51+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "Shawn Heisey i like it, but given that the current functionality is done on the server - i think this one should be as well. for a bunch of reasons, one of them being: it's functionality that is used while the magic happens during search. whatever we would do on the client-side while the user uses the analysis-screen .. we can't guarantee that the results are equal. which is why i wouldn't even try to replicate the results in the first place. like the match-attribute we get back within the response, we should include should information. using them on the client-side is obviously far more easy, afaik we don't have that data yet, do we? ",
            "id": "comment-15242568"
        },
        {
            "date": "2017-05-18T12:41:25+0000",
            "author": "Jan Høydahl",
            "content": "Just tested analysis screen in the new UI and it works with highlighting. Stefan Matheis (steffkes), Upayavira,\n\nDoes that mean we can close this issue or is there something else to do? ",
            "id": "comment-16015688"
        },
        {
            "date": "2017-05-18T17:13:57+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "Jan Høydahl not sure how it got there, last time i've checked it wasn't ;o but given it is now, we can close this ticket, yep ",
            "id": "comment-16016104"
        },
        {
            "date": "2017-05-18T23:03:14+0000",
            "author": "Jan Høydahl",
            "content": "Closing.\nUpayavira please re-open if you believe that something more needs to be done on this one. ",
            "id": "comment-16016618"
        }
    ]
}