{
    "id": "SOLR-9545",
    "title": "DataImportHandler throws NPE to logs when pk attribute is not present when delta query is used",
    "details": {
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.7",
            "7.0"
        ],
        "affect_versions": "6.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Hi, \n\nCurrently, when running a delta query from the Data Import Handler and pk parameter is not specified Solr just logs NullPointerExeception, not providing any information on what was expected. \n\nPatch coming soon.",
    "attachments": {
        "SOLR-9545.patch": "https://issues.apache.org/jira/secure/attachment/12829574/SOLR-9545.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-09-21T13:40:10+0000",
            "author": "Rafał Kuć",
            "content": "Attaching a very simple patch, with naive approach to the problem. It logs the information about the missing pk attribute and in addition to that throws an exception with a proper message when that happens, so \"anonymous\" NPE is no longer thrown. \n\nLet me know, if you would like to have that handled differently  ",
            "id": "comment-15509943"
        },
        {
            "date": "2016-09-21T18:21:02+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Thanks for the patch Rafał Kuć, If I understand correctly, this code is executed when requesting a delta update but a \"deltaImportQuery\" was not configured, correct? In that case, the exception message is not correct. Also, could you make the exception a SolrException instead of a plain RuntimeException? and ideally add a unit test. ",
            "id": "comment-15510749"
        },
        {
            "date": "2016-09-21T18:22:31+0000",
            "author": "Rafał Kuć",
            "content": "Sure, will modify the code and provide a proper patch   ",
            "id": "comment-15510753"
        },
        {
            "date": "2017-03-13T16:48:27+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Moving to 6.5, since 6.4 has already been released. ",
            "id": "comment-15907819"
        }
    ]
}