{
    "id": "SOLR-8929",
    "title": "Add an idea module for solr/server to enable launching start.jar",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.1",
            "7.0"
        ],
        "affect_versions": "5.4.1",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "Currently in IntelliJ, it's difficult to create a launch config to run Solr in the same way that the bin/solr script would, because there aren't any modules that reference the jetty start.jar that it uses.\n\nI want to create a simple solr/server IJ module that can be referenced from a launch config.  I've created it manually in the past, but then I always lose it when I have to regenerate idea on branch switch.",
    "attachments": {
        "SOLR-8929.patch": "https://issues.apache.org/jira/secure/attachment/12796405/SOLR-8929.patch",
        "SOLR-8929-bin-solr-run-configuration.patch": "https://issues.apache.org/jira/secure/attachment/12798135/SOLR-8929-bin-solr-run-configuration.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-11T22:59:35+0000",
            "author": "Steve Rowe",
            "content": "I understand why you want to introduce this new module, but I'm reluctant to do so, given that it's only to support run configurations (vs. source code).\n\nit's difficult to create a launch config to run Solr in the same way that the bin/solr script would\n\nThe attached patch creates a run configuration that launches bin/solr in foreground cloud mode.  Would this be an acceptable alternative?  If so, we could also add one for *nix standalone mode, as well as Windows versions. ",
            "id": "comment-15236159"
        },
        {
            "date": "2016-04-12T04:25:31+0000",
            "author": "Scott Blum",
            "content": "Thanks for looking at this.  I don't think calling the bin/solr script is as good of a workflow, however.  If you have the right classpath setup in IntelliJ, the edit/debug cycle is really fast; you can make code changes, restart the debugger, and you're good to go.  The bin/solr script requires jars to be rebuilt or you won't be up to date with the latest code.\n\nThe whole point of using an IDE and having an IntelliJ project is for maximum productivity, and having a module setup that enables really running solr as a debug config is maximally productive. ",
            "id": "comment-15236566"
        },
        {
            "date": "2016-04-15T17:50:36+0000",
            "author": "Steve Rowe",
            "content": "Okay, I'll buy it.\n\nAll other modules have a pre-defined run configuration to run all tests in the module.  Do you think it makes sense to include a pre-defined run configuration for this new module?  If so, can you provide one?  They're in dev-tools/idea/.idea/workspace.xml. ",
            "id": "comment-15243309"
        },
        {
            "date": "2016-04-15T18:48:02+0000",
            "author": "Scott Blum",
            "content": "Will do!  Is there a canonical \"launch a local solr\" I can copy?  Like, I need to know what I should use for solr home, etc. ",
            "id": "comment-15243396"
        },
        {
            "date": "2016-04-15T19:14:53+0000",
            "author": "Steve Rowe",
            "content": "Sorry, I don't have anything canonical - maybe others who see this will?\n\nI was hoping that since you've done this in the past, you could just recreate it and then it would be the canonical thing .  We can always iterate, progress not perfection and all that. ",
            "id": "comment-15243439"
        },
        {
            "date": "2016-04-15T19:24:39+0000",
            "author": "Scott Blum",
            "content": "Ok, I have a working config that actually runs a solr in cloud mode w/ embedded zk, using solr/server/solr as the solr home.  This works fine, except I'm not sure how to create collections... I think I need to get the configset examples into ZK somehow? ",
            "id": "comment-15243451"
        },
        {
            "date": "2016-04-18T21:55:34+0000",
            "author": "Scott Blum",
            "content": "Updated patch with a real run configuration. ",
            "id": "comment-15246637"
        },
        {
            "date": "2016-04-19T20:16:13+0000",
            "author": "Steve Rowe",
            "content": "If you have the right classpath setup in IntelliJ\n\nLooks like the included run configuration only includes the new server module's classpath, which doesn't have any dependencies other than start.jar?\n\nWhen I run the solrcloud run configuration, I get java.io.FileNotFoundException: /Users/sarowe/git/lucene-solr/solr/server/solr-webapp/webapp - so I'm not sure what the benefit of this over bin/solr is?  That is, you still have to use the ant build to populate server/solr-webapp/webapp.\n\nAre you planning to flesh this out more?  I think it's possible, with the right module dependencies, and maybe also making the build/run location under idea-build/solr/server/, to get a setup that will use IntelliJ's build artifacts.\n\nI'm not sure how to create collections... I think I need to get the configset examples into ZK somehow?\n\nMaybe a bootstrapping task to run SolrCLI's ZK upconfig? ",
            "id": "comment-15248533"
        },
        {
            "date": "2016-04-19T21:18:31+0000",
            "author": "Scott Blum",
            "content": "You're correct, it pulls the binaries from WEB-INF/lib.  In this formulation the only real advantage is being able to run the debugger very easily.  I'd needed the ant build, as you mentioned, to get `server/solr-webapp/webapp` to exist at all.\n\nWhat would you think if we committed this in basically it's current state, but added a JIRA to improve it?  I would like to circle back on making this better, but I have a bunch of other stuff on my plate and I'm a little concerned that getting Jetty to run exactly the right way without WEB-INF/lib, and otherwise setting up an IntelliJ specific webapp directory will be a bit of a time sink. ",
            "id": "comment-15248669"
        },
        {
            "date": "2016-04-19T21:33:02+0000",
            "author": "Steve Rowe",
            "content": "+1 to commit as-is and make a follow-on JIRA to improve. ",
            "id": "comment-15248703"
        },
        {
            "date": "2016-04-20T01:16:30+0000",
            "author": "ASF subversion and git services",
            "content": "Commit af92294b0c914d25322308fe81c38500212dfa11 in lucene-solr's branch refs/heads/master from Scott Blum\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=af92294 ]\n\nSOLR-8929: Add an idea module for solr/server to enable launching start.jar ",
            "id": "comment-15249072"
        },
        {
            "date": "2016-04-20T01:17:00+0000",
            "author": "ASF subversion and git services",
            "content": "Commit cdf1f5ab88ad48b3fe7ffa9bc83526f69ccc0cdb in lucene-solr's branch refs/heads/branch_6x from Scott Blum\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cdf1f5a ]\n\nSOLR-8929: Add an idea module for solr/server to enable launching start.jar ",
            "id": "comment-15249073"
        },
        {
            "date": "2016-04-20T23:09:16+0000",
            "author": "Scott Blum",
            "content": "Follow up issue: SOLR-9023 ",
            "id": "comment-15250904"
        },
        {
            "date": "2016-05-09T22:59:15+0000",
            "author": "Hoss Man",
            "content": "\nManually correcting fixVersion per Step #S5 of LUCENE-7271 ",
            "id": "comment-15277250"
        }
    ]
}