{
    "id": "SOLR-1634",
    "title": "change order of field operations in SolrCell",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "As noted on the mailing list, SolrCell evaluates fmap.* params AFTER literal.* params.  This makes it impossible for users to map tika produced fields to other names (possibly for the purpose of ignoring them completely) and then using literal to provide explicit values for those fields.  At first glance this seems like a bug, except that it is explicitly documented...\n\nhttp://wiki.apache.org/solr/ExtractingRequestHandler#Order_of_field_operations\n\n...so i'm opening this as an \"Improvement\".   We should either consider changing the order of operations, or find some other way to support what seems like a very common use case...\n\nhttp://old.nabble.com/Re%3A-WELCOME-to-solr-user%40lucene.apache.org-to26650071.html#a26650071",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13402183",
            "date": "2012-06-27T12:35:21+0000",
            "content": "Marking as duplicate of SOLR-1856 which is fixed.\n\nAlso, note that as a workaround this works: fmap.title=tika_title&literal.title=HelloWorld - where the Tika-parsed title will first be moved to a new field and then accept the literal one. "
        },
        {
            "author": "Chaiyasit (Sit) Manovit",
            "id": "comment-13795488",
            "date": "2013-10-15T18:34:49+0000",
            "content": "Hello,\n\nI am not sure if SOLR 1856 completely fixes this, particularly when lowernames==true comes in to the picture. Consider a case where:\n 1. Tika generated field \"FOO=BAR\" for the doc.\n 2. literalsOverride==true.\n 3. lowernames==true.\n 4. User supplied \"literal.foo=bar\".\n\nAccording to the rules (http://wiki.apache.org/solr/ExtractingRequestHandler#Order_of_field_operations), literalsOverride is applied before lowernames and, thus, will have no effect here since the field FOO from Tika and literal.foo are considered different fields at this stage before lowernames==true kicks in. And when lowernames==true kicks in, it has the effect of merging FOO into foo, giving it both values BAR and bar.\n\nAdding \"fmap.foo=tika_foo\" does not help because fmap is applied even later, by that time foo already contains both BAR and bar.\n\nAdding \"fmap.FOO=tika_foo\" and with \"lowernames==false\" would do (regardless of literalsOverride), but what if we need \"lowernames==true\" and what if the capitalization of FOO can vary.\n\nWould it make sense to have an option to apply the rules in the order that they are specified in the config file or URL params rather than always in a static order?\n\nThanks. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13797273",
            "date": "2013-10-16T21:26:24+0000",
            "content": "Hi,\n\nCan you please open a new JIRA issue for the exact problem you are outlining here, which seems to be a corner case with upper/lowercase between Tika metadata and literals. Also please give a real world example of where it causes problems. Real-life issues tend to be prioritized over hypothetical ones.\n\nTo me it sounds like a potential, very simple solution would be to apply lowercasing at several places if lowernames=true "
        },
        {
            "author": "Chaiyasit (Sit) Manovit",
            "id": "comment-13798769",
            "date": "2013-10-18T04:09:11+0000",
            "content": "Thank you for the response, Jan Høydahl.\n\nSOLR-5362 has been created. "
        }
    ]
}