{
    "id": "SOLR-6001",
    "title": "Local/Leader shard/node preference for SolrCloud",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It would be useful if SolrCloud had special preference options on queries for preferring local nodes or shard leaders.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13975582",
            "date": "2014-04-21T14:03:35+0000",
            "content": "The shards parameter does give a SolrCloud user some capability to choose where the request goes, but just a little bit more would be extremely useful.\n\nhttp://www.elasticsearch.org/guide/en/elasticsearch/reference/current/search-request-preference.html "
        },
        {
            "author": "Manuel Lenormand",
            "id": "comment-13976084",
            "date": "2014-04-21T21:42:47+0000",
            "content": "Has to do perhaps with SOLR-5501 "
        },
        {
            "author": "David Smiley",
            "id": "comment-13976305",
            "date": "2014-04-22T02:20:12+0000",
            "content": "I suggest not prefixing issues with \"Keeping up with the competition\".  If you want to state that ES or some other platform has this capability, then do so elsewhere outside the title which should be short & sweet. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13976701",
            "date": "2014-04-22T12:38:38+0000",
            "content": "I suggest not prefixing issues with \"Keeping up with the competition\".\n\nGood idea.  Changed.  This is probably a duplicate issue anyway. "
        },
        {
            "author": "Arcadius Ahouansou",
            "id": "comment-14602132",
            "date": "2015-06-25T23:32:19+0000",
            "content": "Hello Shawn Heisey, I need a feature that looks very similar to this one.\nLet me explain:\n\nCurrently in our setting, we have let's say 3 SolrCLoud nodes on servers A, B and C.\nThe 3 nodes are identical by design and have exactly 1 collection ( with only 1 shard, 1 replica) each.\n\nOn each of these servers, we also have running a read-only API client that uses the CloudSolrClient in solrJ to query Solr.\n\nSince all solr nodes are identical, it would be interesting to see how we could tell the API to by preference query its local SolrCLoud node first i.e we need to allow for SolrJ a setting like \n\n-Dsolr.preferredReplica=solrOnServerA\n\n\nor something along this line.\n\nAnd other replicas will be queried if and only if the local node having a copy of the collection becomes unavailable.\n\nNote that we have a separate indexer which will not use this config for indexing data.\n\nThis seems to be something that could be implemented in SOlrJ only, so it may not be quite what this ticket is about.\n\nThanks\n\nArcadius.\n\n\n "
        }
    ]
}