{
    "id": "SOLR-4267",
    "title": "Solr Admin UI - checkbox option to sort cores by name",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "The new UI currently shows the list of cores in an unsorted order.  Presumably they are shown in the order that they finished starting, but I have not looked to verify this.  I would like to have the option to show that list sorted alphanumerically.  IMHO it would be good to make this the default, but I'm not willing to speak for others.\n\nThere has been recent work to support thousands of cores.  I think that this would be even more important for that.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13544143",
            "date": "2013-01-04T19:27:33+0000",
            "content": "I put the fix version at 4.1, but I know that if it's not trivial, it'll get bumped to 4.2. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13544155",
            "date": "2013-01-04T19:34:47+0000",
            "content": "It looks like the core list on the Core Admin page is in an entirely different order than the left-hand core list.  Neither list follows solr.xml order, or alphabetic. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13544159",
            "date": "2013-01-04T19:36:39+0000",
            "content": "After reloading the page in my browser, the two lists are now in the same order.  No idea what happened there. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13544160",
            "date": "2013-01-04T19:37:23+0000",
            "content": "Other ideas - if anyone likes these, they probably needs their own issues:\n\nWhen lazily loading cores, or when they are transient, have the background on the core name be a different color to indicate states other than fully loaded.\n\nWith the lazy/transient idea, will there be a UI button to unload a core without removing it from solr.xml?  Currently, when you click unload, it is removed from solr.xml. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13544260",
            "date": "2013-01-04T21:15:07+0000",
            "content": "Shawn Heisey have a look on SOLR-3851 - perhaps the title was not that descriptive, but the original though was to synchronize action on the core-admin to the left-side core-list .. while working on that, i brought up an method which sorts cores by name, because i had the exact same though as you did - i couldn't figure out which order (if any, at least) it has right now.\n\nregarding the other ideas:\n\nWhen lazily loading cores, or when they are transient, have the background on the core name be a different color to indicate states other than fully loaded.\n\nif we can determine this state somehow (maybe against /admin/cores?, did not completely follow the current development on this topic) that should be a small change\n\nWith the lazy/transient idea, will there be a UI button to unload a core without removing it from solr.xml? Currently, when you click unload, it is removed from solr.xml.\n\nsame here, should be possible - just have to define how to handle it .. because, with what i understood right now .. if we query (f.e.) /admin/system on the selected core it get's fully loaded - given the fact to you're on the start page of a core, you hit whatever-we-name-the-button .. what should happen? reloading the page would mean we initiate the core again, which is perhaps not what you'd expect, right?\n\nbut, valid for both ideas, opening a new issue is the right way - so they're easier to handle (implement, follow, ...) in the feature \n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13544273",
            "date": "2013-01-04T21:43:51+0000",
            "content": "It looks like the core list on the Core Admin page is in an entirely different order than the left-hand core list. Neither list follows solr.xml order, or alphabetic.\n\nI imagine it comes from enumerating the core Map (which is just a hash map), and hence in a mostly-random order.\nRather than a checkbox, just always sort by name? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13544290",
            "date": "2013-01-04T22:03:31+0000",
            "content": "Rather than a checkbox, just always sort by name?\n\nI do like this idea.  I didn't want to force it on everyone, but given that the order is currently useless for people who utilize more than a handful of cores, sorting for everyone might be a better way to go.\n\nI'm OK with this issue being closed as a duplicate of SOLR-3851, if we update that issue's title/description suitably and that issue is reasonably close to a committable state.  For the other ideas, should I go ahead and open new issues? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13544805",
            "date": "2013-01-05T19:54:59+0000",
            "content": "Shawn Heisey i committed SOLR-3851 this morning, have a look if this works as expected (at least it does sort cores by name, but you'd never know ;o) - if so, we can close this as a duplicate, like you already mentioned\n\nI saw SOLR-4268 as a follow-up for this unloading-thingy, if you like create another one for the core-menu and how cores show be displayed (different by state) "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13545165",
            "date": "2013-01-05T20:59:03+0000",
            "content": "The list of cores is nicely sorted now!  It seems to take a bit longer than I would expect to display the core list on a page refresh.  I have 16 cores.  I don't know that the sort made it any slower, it could be just that I am focused on it a little more now.  I worry about the performance for 'thousands of cores' functionality. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13553544",
            "date": "2013-01-15T06:38:05+0000",
            "content": "If indexTrue=false (SOLR-4302) is utilized in the UI, the load delay when refreshing UI pages would likely go away.  I'll go ahead and close this issue as a duplicate. "
        }
    ]
}