{
    "id": "SOLR-8345",
    "title": "Wrong query parsing",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Not A Problem",
        "priority": "Minor"
    },
    "description": "When sending a query for a numeirc field with &fq=myfield-1) the query is parsed as -myfield:1 \n\nI would expect it to be either parsed as myfield:\"-1\" or an exception to be returned.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-26T17:57:08+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Why would you need to put round brackets around the -1? ",
            "id": "comment-15029143"
        },
        {
            "date": "2015-11-26T18:42:19+0000",
            "author": "Ahmet Arslan",
            "content": "Saar, this is not a bug. Minus is a special query parser character. There are other query parsers to query those special characters. For example, terms query parser or raw query parser. Alternatively you can escape those special characters. \n\nPlease rise your questions on the solr mailing list. ",
            "id": "comment-15029175"
        },
        {
            "date": "2015-12-02T18:06:33+0000",
            "author": "Hoss Man",
            "content": "to clarify the specific logic taking place here...\n\n\n\t( ... ) – parens indicate grouping, typically for the purpose of constructing a multiclause sub-BooleanQuery.\n\tmyfield: is syntax for indicating that \"myfield\" should override the default field\n\tmyfield:( ... ) indicates that when parsing the contents of parens, myfield overrides the defualt field for all clauses found in the group.\n\t-foo is the syntax for a negated clause\n\tmyfield:(-1) constructs a negated clause for the term myfield:1, since it is the only cluase in the grooup no sub-BooleanQuery is created.  since it is the only clause in the top leval query, and it is negated, Solr adds the neccessary *:*\n\n\n\nthis is really no different then something like myfield:(+foo -bar yaz) .. the prefix \"+\" and \"-\" characters are always treated as MUST and MUST_NOT modifiers unless they are quoted or escaped. ie...\n\n\nmyfield:(\"+foo\" \\-bar yaz)\n\n ",
            "id": "comment-15036274"
        }
    ]
}