{
    "id": "SOLR-9265",
    "title": "Add configurable node_name aliases instead of host:post_context",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Make it possible to give an alias name to node_name of an instance. As far as I can tell you can’t do this, it's always going to be <host>:<port>_<context>. The goals of this change are the following:\n\n1) Address the node by alias in the core admin/collection apis\n2) Be able to start a new node with the same alias and have it update clusterstate with the new base_url and suck down all the cores that the old alias was hosting. This is already (kind of) possible if you create core.properties for all the cores that you want the new node to host. However I think this bleeds a little too much of the ananotmy of the cloud into the directory structure of the solr instance. The other approach is more in the paradigm of zookeeper is truth.\n\nFor #2 the desired behavior should be such that.\n1) If there is already a live node with the same node_name this current node should block until that node is gone\n2) Once there is no node with the same node name and if there are any cores assigned to that node alias they should now be hosted on the newly started node\n3) If the old node comes back with the same alias and there is now a node in live nodes with this alias go back to #1\n\nConfiguration should be in solr.xml such that:\n\n\n<solr>\n  <solrcloud>\n    <str name=\"nodeName\">${solrNodeName:}</str>\n  </solrcloud>\n<solr>\n\n\n\nwhere the default would be \"<host>:<port>_<context>\" style.\n\n\nAn example for requirement #1:\n/admin/collections?action=ADDREPLICA&collection=collection&shard=shard&node=solrNodeNameAlias",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-29T21:32:08+0000",
            "author": "Keith Laban",
            "content": "I briefly spoke to Shalin Shekhar Mangar offline about this idea ",
            "id": "comment-15355831"
        },
        {
            "date": "2016-07-05T16:47:58+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "It'd be nice to split this issue into two parts – one for the alias support and the other for the automatic creation of cores belonging to the replaced node. ",
            "id": "comment-15362756"
        },
        {
            "date": "2016-07-06T01:35:14+0000",
            "author": "Keith Laban",
            "content": "created SOLR-9280 and SOLR-9281 to track each issue independently. I'll keep this one open to discuss the overall approach if needed. ",
            "id": "comment-15363587"
        }
    ]
}