{
    "id": "SOLR-506",
    "title": "Enabling HTTP Cache headers should be configurable on a per-handler basis",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "HTTP cache headers are needed only for select handler's response and it does not make much sense to enable it globally for all Solr responses.\n\nTherefore, enabling/disabling cache headers should be configurable on a per-handler basis. It should be enabled by default on the select request handler and disabled by default on all others. It should be possible to override these defaults through configuration as well as through API.",
    "attachments": {
        "SOLR-506.patch": "https://issues.apache.org/jira/secure/attachment/12384014/SOLR-506.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12599201",
            "date": "2008-05-22T21:41:26+0000",
            "content": "Assuming some form of SOLR-505 is committed the most straightforward way to make caching configurable per handler instance is probably to add an optional init param to RequestHandlerBase "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12599208",
            "date": "2008-05-22T22:00:46+0000",
            "content": "Why didn't I think of that? \n\nYes, I agree, that should be the most painless way of implementing this. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12605093",
            "date": "2008-06-14T18:55:33+0000",
            "content": "An optional boolean init parameter \"httpCaching\" has been added to RequestHandlerBase. This parameter should be set to true if emitting cache headers is desired. By default, emitting http cache headers is disabled. Users who desire caching must enable this for the handler they want.\n\nThe example solrconfig.xml has emitting http caching enabled for the StandardRequestHandler, MoreLikeThisHandler and SpellCheckerRequestHandler. I've removed explicit setHttpCaching calls in SearchHandler, MoreLikeThisHandler and SpellCheckerRequestHandler. If a custom request handler explictly calls the SolrQueryResponse#setHttpCaching method then it will override the per-handler configuration in solrconfig.xml\n\nDo we need tests for this?\n\nsvn stat follows:\nM      src/test/test-files/solr/conf/solrconfig-nocache.xml\nM      src/test/test-files/solr/conf/solrconfig.xml\nM      src/java/org/apache/solr/handler/RequestHandlerBase.java\nM      src/java/org/apache/solr/handler/component/SearchHandler.java\nM      src/java/org/apache/solr/handler/SpellCheckerRequestHandler.java\nM      src/java/org/apache/solr/handler/MoreLikeThisHandler.java\nM      example/solr/conf/solrconfig.xml "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12606029",
            "date": "2008-06-18T18:30:46+0000",
            "content": "the patch seems straight forward, but the default for RequestHandlerBase should be that http caching is \"ok\"\n\nRequest Handlers that can't be cached will enerally be the exception to the rule (and will probably hardcode setHttpCaching(false)) ... run of the mill custom request handlers that people write which subclass RequestHandlerbase should automaticly start supporting HTTP caching, and if the users of those handlers don't wnat caching they should explicitly turn it off (not vice versa) "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12606691",
            "date": "2008-06-20T09:35:54+0000",
            "content": "With this patch the default behavior is to send cache headers by default for all responses. RequestHandlers which do not want responses to be cached can explicitly call SolrQueryResponse#setHttpCaching(false). Users who do not want responses for a particular request handler to be cached can add the following to the request handler's configuration section in solrconfig.xml\n\n\n\n<bool name=\"httpCaching\">false</bool>\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12616886",
            "date": "2008-07-25T13:44:54+0000",
            "content": "Syncing the patch with the trunk. No other changes to the code base.\n\nHoss – Do we need anything more in this patch? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12620137",
            "date": "2008-08-06T04:47:02+0000",
            "content": "Shalin: I'm sorry dude ... i'm really droping the ball lately.\n\nif you made the default behavior change then go for it. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12620144",
            "date": "2008-08-06T06:01:18+0000",
            "content": "Committed revision 683121. "
        }
    ]
}