{
    "id": "SOLR-31",
    "title": "JSON response writer",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Here is the JSON response writer, along with subclasses for Python and Ruby.\nPython: use None for null, True/False for boolean, use unicode strings where necessary\nRuby: use single quoted strings to avoid security issues, use => as map separator\n\nPatch and examples to follow, comments sought.",
    "attachments": {
        "json.diff": "https://issues.apache.org/jira/secure/attachment/12336975/json.diff",
        "example.txt": "https://issues.apache.org/jira/secure/attachment/12336978/example.txt"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12421481",
            "date": "2006-07-16T23:33:45+0000",
            "content": "Some implementation notes:\n\n\tThere is a base class for all text-oriented writers, TextResponseWriter... it is meant to be generic enough to allow things like JSON or XML output (hence the name parameter for primitives like writeInt() even though the name is unused in the primitive methods for JSON).\n\tThe FieldType hierarchy gains a new method:\n    public void write(TextResponseWriter writer, String name, Fieldable f)\n\tI left the existing XML writer methods on FieldType alone for now... a future patch could easily implement the XMLWriter in terms of TextResponseWriter and deprecate the existing FieldType.write(XMLWriter...) methods.\n\tthe style of output for NamedList (a single map, or an array or 2 element arrays) is selectable via the parameter \"json.nl\"... current values are \"map\", \"arrmap\", \"arrarr\"\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12421482",
            "date": "2006-07-16T23:38:15+0000",
            "content": "Date Types: there are no native date types in Ruby or Python to my knowledge (that need no import), so they are currently represented as a string.  A future option could allow dates to be written differently, such as the number of milliseconds since the UNIX epoch... that might make it much easier to construct native date objects. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12421913",
            "date": "2006-07-18T18:26:07+0000",
            "content": "fixed returnedField list handling, including score field, committed. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589339",
            "date": "2008-04-15T23:56:43+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}