{
    "id": "SOLR-11715",
    "title": "Spatial Search ref-guide fixes",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "fix_versions": [
            "7.3"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "Was doing a demo of spatial search and ran into the following problems:\n\n\tSome blocks of code were not formatted properly, hence losing the : parameters. Example: https://lucene.apache.org/solr/guide/6_6/spatial-search.html#SpatialSearch-bbox\n\tThe query mentioned for geodist section didn't actually return the scores. Need to add an fl parameter there. https://lucene.apache.org/solr/guide/6_6/spatial-search.html#SpatialSearch-geodist",
    "attachments": {
        "SOLR-11715.patch": "https://issues.apache.org/jira/secure/attachment/12900346/SOLR-11715.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-12-02T18:11:43+0000",
            "content": "Patch for the fixes. ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-16275692"
        },
        {
            "date": "2017-12-03T04:54:25+0000",
            "content": "Thanks; looks good.  \n\nBut is it really necessary to file a JIRA for ref guide changes?  Just commit at will IMO.  It's a shame if the move from Confluence means (to some) we need to create JIRA issues, which IMO adds unfortunate process overhead of dubious value for little stuff like this.  As it is, we have the added overhead of source control plus multiple branches to back-port (ugh; take the good with the bad).  CC Cassandra Targett for opinion ",
            "author": "David Smiley",
            "id": "comment-16275821"
        },
        {
            "date": "2017-12-03T15:40:08+0000",
            "content": "But is it really necessary to file a JIRA for ref guide changes?\n\nMy personal opinion is little changes like this don't need a JIRA, but if someone wants a review of their changes because they aren't sure if they've done something right, or worded it properly, etc., JIRA is really the only way to achieve that. And, obviously, non-committers would need a JIRA if they choose to contribute to the project by editing docs.\n\nBut, this patch doesn't appear to apply to master - the line numbers don't match up to master, and I can see section anchors that were removed after 6.6. If you want to make these changes, you should do them on master instead of branch_6x & backport (which will have merge conflicts, but the changes need to be on master first just like all other code changes).\n\nAlso, it seems it changes a few examples that are in source blocks (sections with [source,<format>]) into lines with only the backtick style for making them monospaced - the preference is actually the opposite, to put all examples into source blocks. I know today we have a mix of approaches but over time as I edit other stuff I'm slowly trying to standardize on that approach. ",
            "author": "Cassandra Targett",
            "id": "comment-16275973"
        },
        {
            "date": "2017-12-03T20:46:25+0000",
            "content": "Sorry, had attached the branch_6x patch instead of master. Attached the correct patch now.\n\nThe reason I changed [source, plain] to backticks was that the *:* was not rendering properly. Any ideas how to proceed here? ",
            "author": "Ishan Chattopadhyaya",
            "id": "comment-16276081"
        },
        {
            "date": "2017-12-04T16:55:19+0000",
            "content": "I think you have it backwards in trying to fix it - the text not in [source] blocks will get rendered as bold; the point of the source block is to skip doing that conversion.\n\nThere are problematic examples that are missing the query string *:*, but they aren't the examples you've modified in this patch. \n\nIn your patch, the example you've changed to fix missing *:*, actually currently renders properly if you look at it online at https://lucene.apache.org/solr/guide/7_1/spatial-search.html#jts-and-polygons-flat. Removing the [source] block definition will make it start to fail.\n\nAn example in another section online at https://lucene.apache.org/solr/guide/7_1/spatial-search.html#use-as-a-sub-query-to-expand-search-results is missing *:* and is not in a [source] block - see also line #170 of spatial-search.adoc on master.\n\nThe solution is really to add the [source,text] block definition instead of removing it. ",
            "author": "Cassandra Targett",
            "id": "comment-16277071"
        },
        {
            "date": "2018-02-01T16:03:37+0000",
            "content": "Commit 5b5a396b0cab3d4b844b5cc6c887395d961f7e17 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=5b5a396 ]\n\nSOLR-11715: Fix example queries so they appear correctly; add fl param to geodist example ",
            "author": "ASF subversion and git services",
            "id": "comment-16348811"
        },
        {
            "date": "2018-02-01T16:04:14+0000",
            "content": "Commit 8817d31a4d5ccce29693da08cca74ff26f7ef992 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=8817d31 ]\n\nSOLR-11715: Fix example queries so they appear correctly; add fl param to geodist example ",
            "author": "ASF subversion and git services",
            "id": "comment-16348814"
        },
        {
            "date": "2018-02-01T16:05:52+0000",
            "content": "I fixed the examples similar to how I described in my earlier comment so they now appear correctly throughout the doc (I checked all of them to be sure). I also added the fl param to the geodist query as in Ishan's patch. So while I didn't use his patch, I incorporated some of its changes in my commits. ",
            "author": "Cassandra Targett",
            "id": "comment-16348817"
        }
    ]
}