{
    "id": "SOLR-8421",
    "title": "improve error message when zkHost with multiple hosts and redundent chroot specified",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.4",
        "status": "Reopened",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "If a user mistakenly tries to specify the chroot on every zk host:port  in the zkhosts string, the error they get is confusing.\n\nwe should try to improve the error/logging to make it more evident what the problem is....\n\ninitial bug report from user\nI'm trying to run Solr Cloud with following command:\n\n\n./bin/solr -f -c -z localhost:2181/test,localhost:2182/test\n\n\n\nAnd getting error:\n\n\n749  ERROR (main) [   ] o.a.s.c.SolrCore null:org.apache.solr.common.cloud.ZooKeeperException: A chroot was specified in ZkHost but the znode doesn't exist. localhost:2181/test,localhost:2182/test\n\n\n\nNode \"/test\" exists in zookeeper. And both:\n\n\n./bin/solr -f -c -z localhost:2181,localhost:2182\n\n\n\n\n./bin/solr -f -c -z localhost:2181/test\n\n\n\nworks fine.\n\nBut I cannot get it work with multiple nodes and chroot specified.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-15T23:29:41+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "chroot needs to be added only once after the list of hosts, not after each host. See https://cwiki.apache.org/confluence/display/solr/Taking+Solr+to+Production#TakingSolrtoProduction-ZooKeeperchroot\nPlease use the users list for these kind of questions ",
            "id": "comment-15059098"
        },
        {
            "date": "2015-12-15T23:43:53+0000",
            "author": "Hoss Man",
            "content": "why don't we re-purpose this issue to try and make the error/logging more clear about what's happening in these cases? ",
            "id": "comment-15059117"
        },
        {
            "date": "2015-12-15T23:51:35+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "I thought about it. I believe the bad error is because it's considering everything since the first slash the chroot (\"/test,localhost:2182/test\") ",
            "id": "comment-15059131"
        },
        {
            "date": "2015-12-15T23:51:43+0000",
            "author": "Hoss Man",
            "content": "At a minimum, after parsing the zkhosts but before any zk connections are attempted at all, we could hueristically look at the chroot we've parsed and log a WARN if it looks like it mistakenly contains other host:port pairs. ",
            "id": "comment-15059132"
        },
        {
            "date": "2015-12-15T23:53:47+0000",
            "author": "Hoss Man",
            "content": "tomas: sure, and maybe (in a weird situation) that's a totally valid and intended chroot, but having some better logging about which chroot is used, and maybe warning if the chroot looks suspicious, would help.\n\n(Ideally we could connect w/o the chroot ourselves first, and log a very explicit warning if that path doesn't exist – noting exactly what path is being attempted – but i'm not sure how nicely that type of approach plays with the various ZK security models that i know people are / have-been working on supporting) ",
            "id": "comment-15059140"
        }
    ]
}