{
    "id": "SOLR-6518",
    "title": "CachingDirectoryFactory subclasses must init directory with NoLockFactory, because the real lock factory gets set later via injectLockFactory",
    "details": {
        "affect_versions": "6.0",
        "status": "Resolved",
        "fix_versions": [
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The whole setup should really be changed in Solr trunk, especially as we want to make the lockfactory non-mutable (set via directory ctor).\n\nAs workaround to prevent SimpleFSLockFactory from creating the lock directory initially, we should pass NoLockFactory in the create method. This is possible because injectLockFactory will set the \"configured one\" afterwards.\n\nThis change is needed in trunk, because the LockFactory creates the directory in its ctor, which leads to problems with NIO2.\n\nIn addition, the SlrCore.newSolrDataDir does not cleanup and close the directory correctly if an error occurs.",
    "attachments": {
        "SOLR-6518.patch": "https://issues.apache.org/jira/secure/attachment/12668689/SOLR-6518.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Uwe Schindler",
            "id": "comment-14133463",
            "date": "2014-09-15T00:47:14+0000",
            "content": "Patch. I will commit this now, because the bug prevents tests from succeeding.\n\nWe should really work on a better solution (pass the lock factory to protected create method, so it can be set with ctor). "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14133466",
            "date": "2014-09-15T00:49:30+0000",
            "content": "Commit 1624928 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1624928 ]\n\nSOLR-6518: CachingDirectoryFactory subclasses must init directory with NoLockFactory, because the real lock factory gets set later via injectLockFactory "
        }
    ]
}