{
    "id": "SOLR-4310",
    "title": "If groups.ngroups is specified, the docList's numFound should be the number of groups",
    "details": {
        "affect_versions": "4.1",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "If you group by a field, the response may look like this:\n<lst name=\"grouped\">\n<lst name=\"series\">\n<int name=\"matches\">138</int>\n<int name=\"ngroups\">1</int>\n<result name=\"doclist\" numFound=\"138\" start=\"0\">\n<doc>\n<int name=\"id\">267038365</int>\n<str name=\"name\">\nLarry's Grand Ole Garage Country Dance - Pure Country\n</str>\n</doc>\n</result>\n</lst>\n</lst>\n\nand if you specify group.main then the doclist becomes the result and you lose all context of the number of groups. If you want to keep your response format backwards compatible with clients (i.e. clients who don't know about the grouped format), setting group.main=true solves this BUT the numFound is the number of raw matches instead of the number of groups. This may have downstream consequences.\n\nI'd like to propose that if the user specifies ngroups=true then when creating the returning DocSlice, set the numFound to be the number of groups instead of the number of raw matches to keep the response consistent with what the user would expect.",
    "attachments": {
        "SOLR-4310.patch": "https://issues.apache.org/jira/secure/attachment/12565143/SOLR-4310.patch",
        "SOLR-4310_3.patch": "https://issues.apache.org/jira/secure/attachment/12571800/SOLR-4310_3.patch",
        "SOLR-4310_4.patch": "https://issues.apache.org/jira/secure/attachment/12592578/SOLR-4310_4.patch",
        "SOLR-4310_2.patch": "https://issues.apache.org/jira/secure/attachment/12571166/SOLR-4310_2.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Amit Nithian",
            "id": "comment-13555202",
            "date": "2013-01-16T16:58:28+0000",
            "content": "Here's my patch to address the problem. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13555349",
            "date": "2013-01-16T19:10:40+0000",
            "content": "+1 on the idea. I always thought this is how it should work in this case. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13555474",
            "date": "2013-01-16T21:25:33+0000",
            "content": "Amit, it's too close to the release to get this in for 4.1, so I'm pushing Fix Version to 4.2. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13587335",
            "date": "2013-02-26T18:18:12+0000",
            "content": "Amit: thanks for this patch.\n\nThe conceptual change makes sense to me, and the patch itself seems straight forward.\n\nif you can update the patch to include some test additions (both to the single node and distributed grouping tests) i'll get it committed. "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13587343",
            "date": "2013-02-26T18:20:09+0000",
            "content": "Sure let me work on that and resubmit! Thanks "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13588139",
            "date": "2013-02-27T09:04:02+0000",
            "content": "I was able to re-create my fixes against trunk and add a test to the non-distributed grouping tests. I am having a tough time getting the distributed tests to pass with my patch and I think there is a different code path that I am not accounting for. I'll look at this again tomorrow but if anyone has ideas, please let me know! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13589865",
            "date": "2013-02-28T19:50:58+0000",
            "content": "Amit: distributed coordination code never uses DocLists and DocSlices directly (because those are tied to the local index) so you should check the grouping code for SolrDocumentList objects – in particular look for usages of SolrDocumentList.setNumFound and SolrDocumentList.getNumFound\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13589876",
            "date": "2013-02-28T20:04:48+0000",
            "content": "If i had to guess, i suspect what you want to change is org.apache.solr.search.grouping.endresulttransformer.MainEndResultTransformer .. but there is also org.apache.solr.search.grouping.endresulttransformer.SimpleEndResultTransformer, and i don't know enough about how grouping works to understand the distinction (should one of these be subclassing the other?)\n\nOnce you track down which of these need changed – or if both need changed – it would be best to have either a test of each distributed code path changed, or a \"defensive\" test showing that code path which shouldn't be affected by this change is in fact not affected. "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13590108",
            "date": "2013-03-01T00:37:24+0000",
            "content": "Thanks! I'll take a look through this.. I will add some tests to see if I can test for this. Right now I know that the test I added breaks with my patch and passes if I remove the patch. Hitting the debugger I can see why but just trying to make sure I understand the paths before changing something. "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13591726",
            "date": "2013-03-03T12:38:24+0000",
            "content": "Thanks to HossMan for pointing me in the right direction. I was able to make the necessary fixes in the Main transformer as well as a fix in the Simple Transformer for emitting the ngroups. Admittedly there are some points I still need to investigate like why the groupcount isn't set in the TopGroups during distributed search. "
        },
        {
            "author": "John Wooden",
            "id": "comment-13702504",
            "date": "2013-07-08T21:57:40+0000",
            "content": "Amit: Could you elaborate on the remaining issues with distributed search? "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13709520",
            "date": "2013-07-16T06:34:59+0000",
            "content": "While it's been a few months since I looked at this patch (and unfortunately I don't work with Solr much anymore), I think the patch should be good to go insofar as the unit tests I submitted passes. Is there anything I can do to help get this moving along? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13709852",
            "date": "2013-07-16T15:32:14+0000",
            "content": "Amit: when you posted your last patch, you said...\n\nAdmittedly there are some points I still need to investigate like why the groupcount isn't set in the TopGroups during distributed search.\n\n...is that a non-issue?  is there still something there that needs fixed? "
        },
        {
            "author": "John Wooden",
            "id": "comment-13710007",
            "date": "2013-07-16T18:01:25+0000",
            "content": "Added another test class to check a few more use cases, both single-core and distributed.  There are also test cases written that rely on SOLR-2894 which are commented-out.\n\nFixed an issue where numFound (group count) would be 0 for a single-core edge case.\n\nOur tests suggest that distributed works just fine with 4310 unless Amit recalls what he alluded to previously.\n\nOn a semi-related note....\n\nWhen writing the additional tests, we noticed some inconsistent behavior around rows. Not a result of the 4310 patch nor pertinent to 4310's purpose, just something we discovered.\n\nOn a single core with group.limit > 1 and group.main, setting rows=10 will return 10 documents. A distributed setup with the same params will return 10 groups. A commented-out failing testcase is included in the patch. If others can confirm it, we can open a new JIRA ticket for it. "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-13710047",
            "date": "2013-07-16T18:26:07+0000",
            "content": "I apologize for my lack of memory on this... if I recall I don't think it was anything serious and perhaps something that seemed intuitive but wasn't and I had to work around it. If your tests show that this works in distributed mode then it's probably good to go! "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717285",
            "date": "2013-07-23T18:47:44+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971220",
            "date": "2014-04-16T12:57:29+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Zaid Ibrahim",
            "id": "comment-14959328",
            "date": "2015-10-15T18:13:17+0000",
            "content": "Any updates on this? I'm interested in seeing if this can/will get out, but it looks like this jira has been inactive for over a year. :/ "
        },
        {
            "author": "Amit Nithian",
            "id": "comment-14959370",
            "date": "2015-10-15T18:33:13+0000",
            "content": "I'd welcome anyone who can take my patch and apply it to the latest Solr. Unfortunately I have been out of the Solr \"community\" for several years so I don't know what has changed or if this is even still a valid patch given how long it's been. Thank for pinging the JIRA and I hope that you can take this and run with it. "
        }
    ]
}