{
    "id": "SOLR-7952",
    "title": "Change DeltaImport from HashSet to LinkedHashSet.",
    "details": {
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "This is only a minor modification which on some cases might be useful for certain custom DataSources or ImportHandlers.\n\nThe way my imports work is by fetching on batches, So I need to store those batches on a disk cache for a certain time as they are not required on the mean time.\n\nAnd also use some lazy loading as my batches are not initialized by my custom iterators until the time they are iterated for the first time,\n\nMy issue comes from that the order in which I pass the ids of my documents to the ImporHandler during the \"FIND_DELTA\" step is not the same order they are tried to be fetch during the DELTA_DUMP step. It causes my batches to be initialized when only one of them could be done at a time.\n\nWhat I would like is to simply change the HashSet used on the \"collectDelta\" method to a LinkedHashSet. This would help as we would obtain a predictable order of documents.\n\nThis may be a very specific case but the change is simple and shouldn't impact on anything.\n\nThe second option would be to create a \"deltaImportQuery\" like that would work like:\" select * from table where last_modified > '${dih.last_index_time}'\".\n\nI can issue the patch for this.",
    "attachments": {
        "SOLR-7952.patch": "https://issues.apache.org/jira/secure/attachment/12871122/SOLR-7952.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-19T07:23:12+0000",
            "author": "Xavier VILRET",
            "content": "When joining parent and children entities with join=\"zipper\", this is actually required that SOLR maintains the order of the PKs.\nCurrently, this is not the case as HashSet and HashMap are used.\n\nIn SOLR 5.1, in org.apache.solr.handler.dataimport.DocBuilder, in collectDelta method, two key collections needs to be modified in order to retain the insertion order:\n\nline 783: Set<Map<String, Object>> myModifiedPks = new LinkedHashSet<>();\nline 794: Map<String, Map<String, Object>> deltaSet = new LinkedHashMap<>();\n\nI checked the code in 6.5.1 and the bug is still there although line numbers have changed to lines 785 and 798 respectively.\nI didn't check but I guess all the SOLR releases in between are impacted as well.\n\nThis is an easy fix but definitely not minor as delta-import seems broken when using join=\"zipper\". ",
            "id": "comment-16017011"
        },
        {
            "date": "2017-06-03T18:18:09+0000",
            "author": "Mikhail Khludnev",
            "content": "Does SOLR-7952.patch help to anybody? I can commit if you wish.    ",
            "id": "comment-16036034"
        }
    ]
}