{
    "id": "SOLR-282",
    "title": "snapshooter does not work under solaris",
    "details": {
        "affect_versions": "1.2",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "replication (scripts)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "http://www.mail-archive.com/solr-user@lucene.apache.org/msg04761.html\n\nsolr is able to find snapshooter but didn't  generate any snapshot files after the index is updated. I checked the\nlog, everything looks fine, then I run snapshooter from command line. It failed because Solaris doesn't support \n-l option for cp command. I changed command \"cp -lr dir1 dir2\" to:\n\nmkdir dir2\nln dir1/* dir2\n\nIt seems working. Otis suggested to create an issue so that Bill Au & Co. can fix this problem. \nPlease note: several other commands under solr/bin also have this problem. You can use grep \"cp -lr\" to find all of them \nand make similar changes.\n\nI'm also curious why there is no error log when solr failed running snapshooter. Shouldn't solr log an error message?\n\nThanks\nXuesong",
    "attachments": {
        "solr-282-solaris-and-osx.patch": "https://issues.apache.org/jira/secure/attachment/12361482/solr-282-solaris-and-osx.patch",
        "solr-282.patch": "https://issues.apache.org/jira/secure/attachment/12361436/solr-282.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Bill Au",
            "id": "comment-12510801",
            "date": "2007-07-06T21:36:17+0000",
            "content": "I think I will go with:\n\nmkdir dir2\ncd dir1\nfind . -print|cpio -pdlmuv ${full_path_name_to_dir2}\n\nThis works closer to cp -lr in that it will take care of any subdirectory nder dir1.  I know Lucene does not put any subdirectory inside the data directory.  But you never know what people may but there to take advantage of the snapshot distribution. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12510804",
            "date": "2007-07-06T21:51:32+0000",
            "content": "lol... is cpio installed by default an all UNIX systems, and are the args the same?\nPerhaps this should be an alternate codepath for solaris? "
        },
        {
            "author": "Bill Au",
            "id": "comment-12511127",
            "date": "2007-07-09T13:59:00+0000",
            "content": "Yes, I am thinking it will be an alternate codepath for Solaris only, keeping \"cp -l\" as the default.  With so many different OSes out there I am not sure if we can come up with a single solution to works everywhere.  I am not sure we want to spend the time to find it even if it exists.  I for one only have access to a handful of OSes.  "
        },
        {
            "author": "Bill Au",
            "id": "comment-12511128",
            "date": "2007-07-09T14:00:31+0000",
            "content": "Yes, I am thinking it will be an alternate codepath for Solaris only,\nkeeping \"cp -l\" as the default.\nWith so many different OSes out there I am not sure if we can come up with a\nsingle solution to works everywhere.  I am not sure we want to spend the\ntime to find it even if it exists.  I for one only have access to a handful\nof OSes.\n\nBill\n "
        },
        {
            "author": "Bill Au",
            "id": "comment-12511233",
            "date": "2007-07-09T19:46:04+0000",
            "content": "Attached is a patch for using cpio instead of \"cp -l\" when the scripts are run on SunOS.  While I was at it, I also updated the commit and optimize related scripts to be able to handle both the old and new response format. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12511236",
            "date": "2007-07-09T19:48:47+0000",
            "content": "I have tested my patch on the only Solaris box that I have access to.  That is running Solaris 8.  It will be good if someone with access to a more recent version of Solaris check it out too. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12511405",
            "date": "2007-07-10T12:15:28+0000",
            "content": "Attached is an updated patch that works for both Solaris and OS X. "
        },
        {
            "author": "Bill Au",
            "id": "comment-12512073",
            "date": "2007-07-12T12:39:28+0000",
            "content": "I have committed the patch. "
        }
    ]
}