{
    "id": "SOLR-758",
    "title": "Enhance DisMaxQParserPlugin to support full-Solr syntax and to support alternate escaping strategies.",
    "details": {
        "affect_versions": "1.3",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The DisMaxQParserPlugin has a variety of nice features; chief among them is that is uses the DisjunctionMaxQueryParser.  However it imposes limitations on the syntax.  \n\nI've enhanced the DisMax QParser plugin to use a pluggable query string re-writer (via subclass extension) instead of hard-coding the logic currently embedded within it (i.e. the escape nearly everything logic). Additionally, I've made this QParser have a notion of a \"simple\" syntax (the default) or non-simple in which case some of the logic in this QParser doesn't occur because it's irrelevant (phrase boosting and min-should-max in particular). As part of my work I significantly moved the code around to make it clearer and more extensible.  I also chose to rename it to suggest it's role as a parser for user queries.\n\nAttachment to follow...",
    "attachments": {
        "DisMaxQParserPlugin.java": "https://issues.apache.org/jira/secure/attachment/12389588/DisMaxQParserPlugin.java",
        "UserQParser.java": "https://issues.apache.org/jira/secure/attachment/12389587/UserQParser.java",
        "UserQParser.java-umlauts.patch": "https://issues.apache.org/jira/secure/attachment/12420016/UserQParser.java-umlauts.patch",
        "AdvancedQParserPlugin.java": "https://issues.apache.org/jira/secure/attachment/12389589/AdvancedQParserPlugin.java"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-12628746",
            "date": "2008-09-05T20:56:21+0000",
            "content": "I am contributing source files to this issue instead of patches because the code was significantly reworked.\nNote that this patch depends strongly on SOLR-756 and mildly on SOLR-757 which I've contributed separately.  They need to be applied for this to compile.  Even if you don't get those patches, you can read the source any way to see what it does. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12749540",
            "date": "2009-08-31T16:44:50+0000",
            "content": "Some months ago I upgraded to Solr 1.4 and I made some small changes as part of the port. "
        },
        {
            "author": "Simon Lachinger",
            "id": "comment-12757106",
            "date": "2009-09-18T11:06:26+0000",
            "content": "First of all thanks for providing wildcard matching for the dismax query handler, that is exactly what I need. However, the WILDCARD_STRIP_CHARS regex in UserQParser.java does not work with umlauts which makes the patch useless for languages like ie. German.\n\nI will attach a diff file with the changes I have made to get it working with umlauts. "
        },
        {
            "author": "Simon Lachinger",
            "id": "comment-12757107",
            "date": "2009-09-18T11:07:40+0000",
            "content": "Making the UserQParser.java work with umlauts and other special characters. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12757139",
            "date": "2009-09-18T12:38:53+0000",
            "content": "Thanks for the update Simon.  I forget you can do things like \\w within a regex character class – [...] "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12800816",
            "date": "2010-01-15T18:25:17+0000",
            "content": "I this still needed with enhanced dismax now available? "
        },
        {
            "author": "David Smiley",
            "id": "comment-12801314",
            "date": "2010-01-17T05:05:58+0000",
            "content": "If the use-case is unrestricted Lucene syntax w/ dismax then Enhanced Dismax is the way to go.  What I'm shooting for in this issue is a more extensible query parser.  E-Dismax is cool but it doesn't look particularly extensible.\n\nFor example, in an app I support, I use this patch to do several things:\n1. check if appears to be using fancy Lucene syntax and if so then treat as such.. but with dismax of course on non-fielded clauses via SOLR-756\n2. If one clause then rewrite query to:    clause clause^0.5       – i.e. search for clause and also include partial matches.  For a small index I have this is fine but I can use n-gram some day if I need to.\n3. If multiple clauses then rewrite query to:   clauseA clauseB clauseC clauseC*^0.5     (clauseC is last clause).\n\nWhat I'm hoping for is for Solr to offer better query parsing infrastructure so that I can implement my parsing needs by re-using/plugging into as much as already exists as possible.  Committing SOLR-756 is one step there... but then there's some useful capabilty in DismaxQParser like boost queries, boost functions, q.alt.    min-should-match is relatively re-usable since it stands alone. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872640",
            "date": "2010-05-27T22:09:44+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043719",
            "date": "2011-06-03T16:46:43+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106274",
            "date": "2011-09-16T14:50:21+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234641",
            "date": "2012-03-21T18:08:41+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717246",
            "date": "2013-07-23T18:47:36+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971287",
            "date": "2014-04-16T12:57:40+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}