{
    "id": "SOLR-1622",
    "title": "Add aggregate Math capabilities to Solr above and beyond the StatsComponent",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It would be really cool if we could have a QueryComponent that enabled doing aggregating calculations on search results similar to what the StatsComponent does, but in a more generic way.\n\nI also think it makes sense to reuse some of the function query capabilities (like the parser, etc.).\n\nI imagine the interface might look like:\n\nmath=true&func=recip(sum(A))\n\n\n\nThis would calculate the reciprocal of the sum of the values in the field A.  Then, you could do go across fields, too\n\nmath=true&func=recip(sum(A, B, C))\n\n\nWhich would  sum the values across fields A, B and C.\n\nIt is important to make the functions pluggable and reusable.  Might be also nice to see if we can share the core calculations between function queries and this capability such that if someone adds a new aggregating function, it can also be used as a new Function query.\nOf course, we'd want plugin functions, too, so that people can plugin their own functions.  After this is implemented, I think StatsComponent becomes a derivative of the new MathComponent.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Randy Prager",
            "id": "comment-12837488",
            "date": "2010-02-23T22:38:23+0000",
            "content": "any thought on having this as part of 1.5? "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12842082",
            "date": "2010-03-05T22:50:42+0000",
            "content": "Sure, if we can get a patch for it.  As of now, though, no patch, so no 1.5.  "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12852810",
            "date": "2010-04-02T13:18:56+0000",
            "content": "Some notes from IRC:\n-cool - if you go into the stats stuff, dump the silly string based numerics (that we had to do in the past) and also make it per-segment \n\n\twe need one capability in the lucene FieldCache, and we could dump the legacy \"SortedInt\" stuff for good\n-that's simply the ability to tell of a document had a value or not\n\n "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12923130",
            "date": "2010-10-20T19:52:07+0000",
            "content": "we need one capability in the lucene FieldCache, and we could dump the legacy \"SortedInt\" stuff for good -that's simply the ability to tell of a document had a value or not\n\nFYI, this now exists in trunk – see: LUCENE-2649 "
        }
    ]
}