{
    "id": "SOLR-10221",
    "title": "Search for \"jac*\" or \"jacob*\" does not work for \"jacobus\" when it is part of long lists of synonyms",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "4.10.4,                                            6.2",
        "resolution": "Invalid",
        "status": "Resolved"
    },
    "description": "We have a field with SynonymFilterFactory for dutch synonyms. Both on index and on query. The word \"jacob\" and other spellings of \"jacob\" are presented in 3 very long list of synonyms.\n\nWe have the word \"jacobus\" indexed in there.\n\nSearch for \"jac*\", \"jacob*\" and etc. does not work. It does work for other words. And it does work if the synonyms are not used. Or if the synonyms are only used on query time.\n\nThe two lists of synonyms which somehow brake it are:\n\ncobes, cobis, cobus, coobes, iakobus, iakop, ijacob, ijacobis, ijacobus, ijapick, jaacke, jaacob, jaaipik, jaakes, jaakob, jaakoob, jaap, jaapik, jabec, jac., jaccob, jaces, jachop, jacke, jackes, jackob, jackop, jacob, jacobes, jacobis, jacobp, jacobs, jacobus, jacoch, jacoob, jacop, jacq, jacque, jacques, jacquis, jacub, jacus, jaecke, jaeckob, jaecob, jaecques, jaeke, jaekes, jaekob, jaep, jak, jak., jake, jakis, jakke, jakkob, jakkop, jakob, jakobes, jakobi, jakobis, jakobje, jakobus, jakoob, jakoobes, jakop, jakques, jakus, james, japek, japick, japijck, japijk, japik, japje, jappe, jappik, japyck, japyk, jaques, jaquez, jaquis, jeems, jeppik, kobbis, kobes, kobis, kobise, kobus, kobuse, koobes, koobis, koobus, koos, yacob, yacobis, yacobus, yapick => JAKOB\n\ncobes, cobis, cobus, coobes, coobus, iakobus, iakops, ijacobs, ijapicks, jaabse, jaackis, jaacobs, jaakes, jaakobs, jaakoobs, jaapiks, jaaps, jabex, jabics, jabiks, jac., jacacobs, jaccobs, jaccobsdr, jaccobsz, jaces, jachops, jacis, jackes, jackobes, jackobhs, jackobs, jackops, jacob, jacobdr, jacobes, jacobesz, jacobi, jacobij, jacobis, jacobo, jacobpsz, jacobs, jacobsd, jacobsdr, jacobse, jacobsen, jacobsens, jacobss, jacobsz, jacobszen, jacobszn, jacobszoon, jacobus, jacobussen, jacobusz, jacoby, jacobz, jacobzn, jacochs, jacoobes, jacoobs, jacopdr, jacops, jacopsdr, jacopsz, jacopszn, jacos, jacques, jac.s, jacubs, jacus, jaeckes, jaeckesdr, jaeckobs, jaeckops, jaecobs, jaecobsz, jaekes, jaekobs, jaeques, jakes, jakis, jakkobs, jakkops, jakob, jakobes, jakobessen, jakobij, jakobis, jakobjes, jakobs, jakobsdr, jakobse, jakobsen, jakobus, jakoby, jakobz, jakoobs, jakoops, jakop, jakops, jakques, jaks, jakus, james, jaobs, japeks, japicks, japicksdr, japics, japicx, japiks, japikx, japix, jappedr, jappes, jappesdr, jappesz, jappeszn, jappezn, jappiks, jappis, jaques, jaquesdr, jaquis, jaquisdr, jaquusdr, jcobs, jeppicx, jeppiks, kobbis, kobes, kobijs, kobis, kobises, kobus, kobuses, kobys, koobes, koobis, koobus, yacobs, yapicks => JAKOBS",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-02T15:08:46+0000",
            "content": "I am not sure that JIRA is the right avenue to resolve it, just yet. You should ask this question on the Mailing List first and then - if there is an actual bug - it can be tracked in JIRA.\n\nI would recommend doing a couple more tests before going to the Solr mailing list. For example:\n*) Can you reproduce this with a much smaller synonym set. If you think it is about 'jacobus' specifically, then you should be able to see it with just one or two synonyms. If it is about the synonym list length, it should happen with later terms too\n*) What is the significance of two synonyms list. Especially since they both contain 'jacobus' (and other terms) but map differently. Perhaps your issue is around that, the terms that show up in both lists. I am not actually sure what behavior you expect with this configuration\n*) What version of Solr is it?\n*) What is the field definition?\n*) What happens when you test your terms in the Admin UI's Analysis screen which shows step by step transformation?\n\nThese steps would help you to isolate and explain the situation to get the maximum help possible from the list participants. ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15892377"
        },
        {
            "date": "2017-03-02T16:00:35+0000",
            "content": "First of all, please raise questions like this on the user's list first before raising a JIRA to see if the behavior you see is really a bug or not.\n\nIn this case it's not. The problem you're having is that wildcards do not go through synonym expansion because synonym filters are not \"MultiTermAware\". That is, they may produce more than one token on output per input token, so there is no \"correct\" behavior. See: https://lucidworks.com/2011/11/29/whats-with-lowercasing-wildcard-multiterm-queries-in-solr/ ",
            "author": "Erick Erickson",
            "id": "comment-15892458"
        }
    ]
}