{
    "id": "SOLR-9200",
    "title": "Add Delegation Token Support to Solr",
    "details": {
        "components": [
            "security"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [
            "6.2",
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "SOLR-7468 added support for kerberos authentication via the hadoop authentication filter.  Hadoop also has support for an authentication filter that supports delegation tokens, which allow authenticated users the ability to grab/renew/delete a token that can be used to bypass the normal authentication path for a time.  This is useful in a variety of use cases:\n1) distributed clients (e.g. MapReduce) where each client may not have access to the user's kerberos credentials.  Instead, the job runner can grab a delegation token and use that during task execution.\n2) If the load on the kerberos server is too high, delegation tokens can avoid hitting the kerberos server after the first request\n3) If requests/permissions need to be delegated to another user: the more privileged user can request a delegation token that can be passed to the less privileged user.\n\nNote to self:\nIn https://issues.apache.org/jira/browse/SOLR-7468?focusedCommentId=14579636&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14579636 I made the following comment which I need to investigate further, since I don't know if anything changed in this area:\n3) I'm a little concerned with the \"NoContext\" code in KerberosPlugin moving forward (I understand this is more a generic auth question than kerberos specific). For example, in the latest version of the filter we are using at Cloudera, we play around with the ServletContext in order to pass information around (https://github.com/cloudera/lucene-solr/blob/cdh5-4.10.3_5.4.2/solr/core/src/java/org/apache/solr/servlet/SolrHadoopAuthenticationFilter.java#L106). Is there any way we can get the actual ServletContext in a plugin?",
    "attachments": {
        "SOLR-9200.patch": "https://issues.apache.org/jira/secure/attachment/12816669/SOLR-9200.patch",
        "SOLR-9200_branch_6x.patch": "https://issues.apache.org/jira/secure/attachment/12821450/SOLR-9200_branch_6x.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-10T00:25:03+0000",
            "author": "Gregory Chanan",
            "content": "I started working on this.  One issue I immediately hit was HADOOP-12767 – it appears upgrading the httpclient version causes a null check to need to be inserted on the path of delegation token checking.\n\nAlso note that HADOOP-12767 was fixed in hadoop 2.8 but the latest stable release is 2.7.2. ",
            "id": "comment-15323649"
        },
        {
            "date": "2016-06-15T18:02:19+0000",
            "author": "Erick Erickson",
            "content": "Greg:\n\nWhat's the status of this one? Are you actively working on it or is it on the back burner? ",
            "id": "comment-15332212"
        },
        {
            "date": "2016-06-17T19:59:02+0000",
            "author": "Gregory Chanan",
            "content": "actively working on it – are you interested in the feature? ",
            "id": "comment-15336808"
        },
        {
            "date": "2016-06-17T20:14:39+0000",
            "author": "Erick Erickson",
            "content": "It's something I had a question from a client about.... ",
            "id": "comment-15336843"
        },
        {
            "date": "2016-06-22T23:22:32+0000",
            "author": "Gregory Chanan",
            "content": "Did some more work on this.  Currently blocked because we need HADOOP-11492, which is only available in hadoop 2.7.0+.  Upgrading to hadoop 2.7.2 is currently being tracked in SOLR-9076. ",
            "id": "comment-15345380"
        },
        {
            "date": "2016-07-07T07:49:22+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hi Gregory Chanan, please let me know if I can help in any way with this. ",
            "id": "comment-15365763"
        },
        {
            "date": "2016-07-07T17:22:59+0000",
            "author": "Gregory Chanan",
            "content": "Ishan Chattopadhyaya thanks so much!  I attached my current patch; I would very much appreciate a review.  My first couple of runs through the tests failed, although I haven't determined if those are just existing flaky tests or not.\n\nI'll write up some notes shortly. ",
            "id": "comment-15366438"
        },
        {
            "date": "2016-07-07T22:56:07+0000",
            "author": "Gregory Chanan",
            "content": "Functionality:\n\n1) This patch allows configuration of delegation tokens for the KerberosPlugin.  Existing\nconfigurations will not change and will not support delegation tokens.\n\nThe configuration parameters are as follows:\n\n\n\nKey\nType\nDefault\nDescription\n\n\nsolr.kerberos.delegation.token.enabled\nboolean\nfalse\nSet to true to enable delegation tokens\n\n\nsolr.kerberos.delegation.token.kind\nString\nsolr-dt\nType name of delegation tokens, most likely doesn't need to change\n\n\nsolr.kerberos.delegation.token.validity\ninteger\n36000\nLifetime in seconds for which delegation tokens are valid\n\n\nsolr.kerberos.delegation.token.signer.secret.provider\nString\nzookeeper\nWhere delegation token information is stored internally; if not \"zookeeper\" delegation tokens won't work across solr servers\n\n\nsolr.kerberos.delegation.token.signer.secret.provider.zookeper.path\nString\n(chrooted path) + /token\nZookeeper location where secret provider information is stored\n\n\nsolr.kerberos.delegation.token.secret.manager.znode.working.path\nString\n(chrooted path) + /zkdtsm\nZookeeper location where token information is stored\n\n\n\n\n\n2) Includes solrj support for delegation tokens as follows:\n  a) DelegationTokenRequest/DelegationTokenResponse can be used to get/cancel/renew delegation tokens\n  b) HttpSolrClient.Builder now includes a \"withDelegationToken\" function for creating an HttpSolrClient\n     that uses a delegation token to authenticate\n  Note that hadoop's delegation token responses are in json map format, so there is a new ResponseParser\n  for that in DelegationTokenResponse; I couldn't find an existing response parser that worked\n\nIssues / Workarounds:\n\n3) AuthenticationPlugin has an incompatible change that means this should only go into the next major version.\nBasically:\n\nvoid doAuthenticate\n\nchanged to:\n\nboolean doAuthenticate\n\nThis is to support cases where authentication succeeds, but solr itself shouldn't process the request; e.g.\nin the delegation token management operations (get, cancel, renew).  The boolean, if false, indicates a short\ncircuit out of the rest of the solr dispatch logic.\n\n4) DelegationTokenKerberosFilter includes a workaround for null query strings.  The versions of\nhadoop / httpclient that we use don't work with null HttpServletRequest query strings, which the jetty\nversion we use can provide.  This can be solved by using HTTPCLIENT-1746 (not released yet) or HADOOP-12767\n(not released in a stable version).\n\n5) hadoop's delegation token code writes to a closed PrintWriter; this doesn't seem to be a problem for the\nversion of jetty that hadoop uses, but it causes an issue with our version.  I filed HADOOP-13346 to fix that,\nuntil then, I wrote a PrintWriterWrapper that ignores closes.\n\n6) The hadoop zookeeper delegation token code uses Curator rather than SolrZkClient; the conversion\nfrom SolrZkClient is messy in a few places:\n  a) We use the ZkController.ZkClient's ACL Provider for the delegation tokens in ZK, but it's not obvious this\n    is what you'd actually want to use.  For example, it may be reasonable to have most solr znodes be readable\n    (because clients read e.g. clusterstate.json), but you probably don't want the delegation token information\n    to be readable by anyone outside \"solr\".  I haven't checked recently, but I don't think we provide any\n    built in ACLProviders that would do something reasonable here in the general case.  Basically, it's easy to\n    get this wrong and leak security information.\n  b) Getting credentials information to curator also isn't great.  Again, we use ZkController.ZkClient's credentials\n    (at AuthenticationPlugin.init) time, but given the \"setZkCredentialsToAddAutomatically\" function, these could\n    in theory change.  I haven't looked into changing that into a builder so it's guaranteed not to change.\n  c) Retrying logic is handled completely differently.  In theory, you'd like the curator logic to follow ZkController.ZkClient's\n     ZkClientConnectionStrategy logic, but it's not clear how to implement this.  Instead, we just use curator's ExponentialBackoffRetry. ",
            "id": "comment-15366913"
        },
        {
            "date": "2016-07-07T22:57:41+0000",
            "author": "Gregory Chanan",
            "content": "CC Anshum Gupta, who worked on SOLR-7274. ",
            "id": "comment-15366917"
        },
        {
            "date": "2016-07-07T23:44:23+0000",
            "author": "Gregory Chanan",
            "content": "New patch that passes the forbidden api checks.  I had to add one suppression as follows:\n\nHttpServletResponse rspCloseShield = new HttpServletResponseWrapper(frsp) {\n      @SuppressForbidden(reason = \"Hadoop DelegationTokenAuthenticationFilter uses response writer, this\" +\n          \"is providing a CloseShield on top of that\")\n      @Override\n      public PrintWriter getWriter() throws IOException {\n        final PrintWriter pw = new PrintWriterWrapper(frsp.getWriter()) {\n          @Override\n          public void close() {};\n        };\n        return pw;\n      }\n    };\n\n\n\nI'm not 100% sure if the getWriter problem affects the hadoop usage, which is here:\nhttps://github.com/apache/hadoop/blob/9d46a49c746b9e1ef552dbb10d1e22f87db68c76/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/security/token/delegation/web/DelegationTokenAuthenticationHandler.java#L280-L282\n\nI can certainly submit a patch to hadoop (or add it to HADOOP-13346) to use OutputStream instead – Uwe Schindler? ",
            "id": "comment-15366973"
        },
        {
            "date": "2016-07-11T09:19:31+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Hi Greg. I'm reviewing the patch and shall post my comments soon.  However, I just thought I'll share my thoughts on the following:\n\n3) AuthenticationPlugin has an incompatible change that means this should only go into the next major version.\nSince AuthenticationPlugin is marked @lucene.experimental, I think we should be good to go with the change within 6x. Afair, we've done such incompatible changes in the past within 5x (when we were working on the BasicAuth functionality. Sorry, I don't have the exact JIRAs handy at the moment). Any 3rd party authentication plugins would suffer, but it should be immediately obvious to the developers how to fix it. ",
            "id": "comment-15370426"
        },
        {
            "date": "2016-07-11T16:44:01+0000",
            "author": "Anshum Gupta",
            "content": "Don't think I can get to this one today or tomorrow but I'll try and take a look whenever I get time. ",
            "id": "comment-15371126"
        },
        {
            "date": "2016-07-12T20:59:40+0000",
            "author": "Gregory Chanan",
            "content": "Ishan Chattopadhyaya your argument sounds reasonable to me.\n\nAnshum Gupta and Ishan, thanks for taking a look. ",
            "id": "comment-15373674"
        },
        {
            "date": "2016-07-14T20:52:42+0000",
            "author": "Gregory Chanan",
            "content": "Looks like there is some adverse interaction between TestSolrCloudWithDelegationTokens and TestSolrCloudWithKerberosAlt when they run in the same jvm; in the same jvm TestSolrCloudWithKerberosAlt fails when run second.  I beasted the test individually and it didn't fail in 100 runs. ",
            "id": "comment-15378355"
        },
        {
            "date": "2016-07-14T23:46:57+0000",
            "author": "Gregory Chanan",
            "content": "Looks like there is some adverse interaction between TestSolrCloudWithDelegationTokens and TestSolrCloudWithKerberosAlt when they run in the same jvm; in the same jvm TestSolrCloudWithKerberosAlt fails when run second. I beasted the test individually and it didn't fail in 100 runs.\n\nFigured this out – in Krb5HttpClientBuilder the JaasConfiguration is set up statically with baseConfig whatever is the current config, but the tests like TestSolrCloudWithKerberosAlt require that the baseConfig is what they set it to at the beginning of test; ",
            "id": "comment-15378619"
        },
        {
            "date": "2016-07-18T09:44:07+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Apologies for delay in the review; I have caught on a viral infection and have still not fully recovered. Here are some comments from before I fell sick.\n\n\n\tCan we eliminate the NoContext and replace with AttributeOnlyServletContext?\n\tI think it makes sense to write a test for internode communication to ensure that delegation tokens based authentication is working end to end. The TestSolrCloudWithDelegationTokens seems to use a 2 node mini solr cloud cluster, but it wasn't apparent to me if there are any calls made to the cluster from the test that require internode communication (maybe there is and I've missed it).\n\tHow can we ensure that no HttpSolrClients are created from elsewhere in Solr while delegation tokens based kerberos authentication is enabled (so that DTs are always passed on)? Do you think we should ban the creation of HSCs, and provide for a factory method?\n\tI see there are various places in Solr codebase where HSCs are created, e.g. SnitchContext, LeaderInitiatedRecoveryThread, OverseerAutoReplicaFailoverThread, OverseerCollectionMessageHandler, RecoveryStrategy, SyncStrategy, IndexFetcher, CdcrRequestHandler, CdcrUpdateLogSynchronizer, SolrConfigHandler, ManagedSchema, SolrCmdDistributor. These are for internode communication, but these clients do not get the delegation tokens passed on while making the request. Shouldn't they be using delegation tokens too, to make it consistent?\n\tMinor: Unused imports in AuthenticationPlugin\n\tMinor: Unnecessary change to SolrZkClient\n\tTestSolrCloudWithDelegationTokens:\n\nSystem.setProperty(KerberosPlugin.DELEGATION_TOKEN_PARAM, \"true\"); \n\n\nline has been repeated in the test\n\t\n solr.kerberos.delegation.token.signer.secret.provider.zookeper.path \tString \t(chrooted path) + /token \tZookeeper location where secret provider information is stored\nsolr.kerberos.delegation.token.secret.manager.znode.working.path \tString \t(chrooted path) + /zkdtsm \tZookeeper location where token information is stored \n\nDoes it make more sense if we move all znodes related to security under a nested znode like /security/*, i.e. modify the defaults here to /security/zkdtsm and /security/token? It might be easier for sysadmins to know what purpose these znodes are present for.\n\tI liked the idea of Solr protecting these znodes right away through ZK ACLs; it would prevent against vulnerabilities for setups where the sysadmin has forgotten to turn it on for the right znodes. However, should we make that behaviour configurable and make it possible for the sysadmin to not ACL protect those znodes, and allow him to do so manually? The usecase I have in mind, and I'm not sure if this is a real world usecase or not, is where a sysadmin is dealing with a failed ZK setup, and is cloning all the znodes into a fresh ZK cluster: I imagine that such a clone would not work for those two znodes if Solr has ACL protected them.\n\n ",
            "id": "comment-15382000"
        },
        {
            "date": "2016-07-21T19:59:22+0000",
            "author": "Gregory Chanan",
            "content": "Here's a new version of the patch, taking into account Ishan Chattopadhyaya's comments.  In particular:\n\n1.  All security related znodes have been moved under /security\n2.  The existing ZkACLProviders now derived from SecurityAwareZkACLProvider, which by default does not allow read only access to znodes under /security for non-solr users.\n3. Moved all kerberos-related test setup from KerberosTestUtil to KerberosTestServices.  This object does \"all in one\" setup, i.e. dealing with non-supported locales, kdc setup, Configuration management.  It also handles resetting the Configuration at the end of the test, so other tests in the same jvm can run successfully.\n4. Got rid of extra imports. ",
            "id": "comment-15388321"
        },
        {
            "date": "2016-07-21T20:00:08+0000",
            "author": "Gregory Chanan",
            "content": "sorry attached the wrong patch, should be correct now. ",
            "id": "comment-15388322"
        },
        {
            "date": "2016-07-22T14:25:18+0000",
            "author": "Gregory Chanan",
            "content": "removed some unused imports. ",
            "id": "comment-15389591"
        },
        {
            "date": "2016-07-28T14:30:14+0000",
            "author": "Gregory Chanan",
            "content": "I am planning to commit this soon if there are no objections. ",
            "id": "comment-15397603"
        },
        {
            "date": "2016-07-28T17:00:32+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 7bf019a9c2779368133850f141174febede6ad96 in lucene-solr's branch refs/heads/master from Gregory Chanan\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7bf019a ]\n\nSOLR-9200: Add Delegation Token Support to Solr ",
            "id": "comment-15397824"
        },
        {
            "date": "2016-07-28T17:31:18+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "+1 to all the changes, they all look great!\n\nI'm still wondering if we need the internode calls within the Solr cluster to use tokens. It seems to me that they do not, as of this patch, even if the user calls use delegation tokens. \n\nAlso, it is my belief that end to end requests work fine, even when internode requests are involved. However there are no tests for this, afaict; neither for kerberos plugin with delegation tokens, nor with delegation tokens. The former situation couldn't be tested at the time of writing the kerberos plugin due to lack of ticket cache of minikdc, but maybe that limitation doesn't stop us from writing tests for the latter. So, even if we don't write such tests here in this issue, I think we should write some as a follow up issue, so that we are alerted when such support breaks.\n\nOverall, I am okay with us committing the current patch. However, I think I'd be more comfortable if internode calls used tokens as well (or even PKI, instead of tokens). I would ideally do that here (unless there are some reasons for not doing it that I'm missing completely), however we can as well do that as a follow up issue, if you think that is a better approach.\n\nMany thanks for your excellent work on this issue, we needed this for Solr for long! ",
            "id": "comment-15397864"
        },
        {
            "date": "2016-07-28T19:10:05+0000",
            "author": "Gregory Chanan",
            "content": "Thanks for taking a look, Ishan Chattopadhyaya\n\nI'm still wondering if we need the internode calls within the Solr cluster to use tokens. It seems to me that they do not, as of this patch, even if the user calls use delegation tokens.\n\nI don't think they do, this is just for client authentication\n\nAlso, it is my belief that end to end requests work fine, even when internode requests are involved. However there are no tests for this, afaict; neither for kerberos plugin with delegation tokens, nor with delegation tokens. The former situation couldn't be tested at the time of writing the kerberos plugin due to lack of ticket cache of minikdc, but maybe that limitation doesn't stop us from writing tests for the latter. So, even if we don't write such tests here in this issue, I think we should write some as a follow up issue, so that we are alerted when such support breaks.\n\nSure, SOLR-9324 contains such a test.  Although it doesn't really solve the minikdc problem, that just uses a different authentication mechanism.\n\n\nOverall, I am okay with us committing the current patch. However, I think I'd be more comfortable if internode calls used tokens as well (or even PKI, instead of tokens). I would ideally do that here (unless there are some reasons for not doing it that I'm missing completely), however we can as well do that as a follow up issue, if you think that is a better approach.\n\nMaybe I'm misunderstanding something, but don't the internode calls already use PKI – that seems to always be used for internode calls with SolrCloud.  I don't see what's different with this patch than before it. ",
            "id": "comment-15398043"
        },
        {
            "date": "2016-07-28T22:58:57+0000",
            "author": "Steve Rowe",
            "content": "The commit on this issue is causing the Maven build to fail (from https://builds.apache.org/job/Lucene-Solr-Maven-master/1814/):\n\n\n [mvn] [ERROR] COMPILATION ERROR : \n      [mvn] [INFO] -------------------------------------------------------------\n      [mvn] [ERROR] /x1/jenkins/jenkins-slave/workspace/Lucene-Solr-Maven-master/solr/core/src/test/org/apache/solr/cloud/KerberosTestServices.java:[29,77] package com.carrotsearch.ant.tasks.junit4.dependencies.com.google.common.base does not exist\n      [mvn] [ERROR] /x1/jenkins/jenkins-slave/workspace/Lucene-Solr-Maven-master/solr/core/src/test/org/apache/solr/cloud/KerberosTestServices.java:[195,7] cannot find symbol\n      [mvn]   symbol:   variable Preconditions\n      [mvn]   location: class org.apache.solr.cloud.KerberosTestServices.Builder\n      [mvn] [ERROR] /x1/jenkins/jenkins-slave/workspace/Lucene-Solr-Maven-master/solr/core/src/test/org/apache/solr/cloud/KerberosTestServices.java:[196,7] cannot find symbol\n      [mvn]   symbol:   variable Preconditions\n      [mvn]   location: class org.apache.solr.cloud.KerberosTestServices.Builder\n      [mvn] [ERROR] /x1/jenkins/jenkins-slave/workspace/Lucene-Solr-Maven-master/solr/core/src/test/org/apache/solr/cloud/KerberosTestServices.java:[206,7] cannot find symbol\n      [mvn]   symbol:   variable Preconditions\n      [mvn]   location: class org.apache.solr.cloud.KerberosTestServices.Builder\n      [mvn] [ERROR] /x1/jenkins/jenkins-slave/workspace/Lucene-Solr-Maven-master/solr/core/src/test/org/apache/solr/cloud/KerberosTestServices.java:[207,7] cannot find symbol\n      [mvn]   symbol:   variable Preconditions\n      [mvn]   location: class org.apache.solr.cloud.KerberosTestServices.Builder\n      [mvn] [INFO] 5 errors \n\n\n\nThis import line in KerberosTestServices is the source of the problems:\n\n\nimport com.carrotsearch.ant.tasks.junit4.dependencies.com.google.common.base.Preconditions;\n\n\n\nI'm guessing the problem is that the junit4 ant tasks aren't on Maven's test classpath.\n\nBut why is this Guava class being loaded via this shaded route, when Guava is a direct Solr dependency?  AFAICT all other uses of Preconditions in Solr use this import instead - I'll test now to see if that makes the Maven build happy:\n\n\nimport com.google.common.base.Preconditions;\n\n ",
            "id": "comment-15398379"
        },
        {
            "date": "2016-07-28T23:18:44+0000",
            "author": "Steve Rowe",
            "content": "mvn test-compile succeeds when I change the import statement.  I'll go commit the change now.  Gregory Chanan, feel free to revert if you intentional did it that way for some reason; if so, I can work on addressing the Maven build problems in a different way. ",
            "id": "comment-15398399"
        },
        {
            "date": "2016-07-28T23:20:45+0000",
            "author": "ASF subversion and git services",
            "content": "Commit cead204fb6fecd576e8e1444e0de879d24d42f1b in lucene-solr's branch refs/heads/master from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cead204 ]\n\nSOLR-9200: Use direct package for Guava's Preconditions class ",
            "id": "comment-15398401"
        },
        {
            "date": "2016-07-29T16:00:45+0000",
            "author": "Gregory Chanan",
            "content": "I think your change is correct, looks like some auto import issue.  Not sure why it didn't cause problems locally. ",
            "id": "comment-15399567"
        },
        {
            "date": "2016-07-29T16:20:54+0000",
            "author": "Erick Erickson",
            "content": "What are the plans for merging this into 6x? I don't see a commit yet or are letting it bake for a while on trunk?\n ",
            "id": "comment-15399605"
        },
        {
            "date": "2016-07-29T19:21:07+0000",
            "author": "Gregory Chanan",
            "content": "Just letting it bake for a bit.  Will merge to 6x today or early next week. ",
            "id": "comment-15399882"
        },
        {
            "date": "2016-08-01T22:58:19+0000",
            "author": "Gregory Chanan",
            "content": "Here's a branch 6 patch, will commit soon assuming tests pass. ",
            "id": "comment-15402993"
        },
        {
            "date": "2016-08-02T01:07:26+0000",
            "author": "ASF subversion and git services",
            "content": "Commit cead204fb6fecd576e8e1444e0de879d24d42f1b in lucene-solr's branch refs/heads/apiv2 from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cead204 ]\n\nSOLR-9200: Use direct package for Guava's Preconditions class ",
            "id": "comment-15403152"
        },
        {
            "date": "2016-08-02T01:27:54+0000",
            "author": "Gregory Chanan",
            "content": "Interestingly, had to add SuppressSSL to DelegationToken test for 6x, because of some PKIAuthentication errors.  The PKI tests have that annotation as well, so the interesting part is why that isn't required on master. ",
            "id": "comment-15403182"
        },
        {
            "date": "2016-08-02T15:37:28+0000",
            "author": "ASF subversion and git services",
            "content": "Commit c60cd2529b9c9d3e57e23e67e7c55a75269a23f9 in lucene-solr's branch refs/heads/master from Gregory Chanan\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=c60cd25 ]\n\nSOLR-9200: Prepare Locale before starting MiniKdc ",
            "id": "comment-15404205"
        },
        {
            "date": "2016-08-02T16:53:14+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 6cfec0bd7a56f7e70046093c603e6f5982c83c69 in lucene-solr's branch refs/heads/branch_6x from Gregory Chanan\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=6cfec0b ]\n\nSOLR-9200: Add Delegation Token Support to Solr ",
            "id": "comment-15404371"
        },
        {
            "date": "2016-08-26T14:00:42+0000",
            "author": "Michael McCandless",
            "content": "Bulk close resolved issues after 6.2.0 release. ",
            "id": "comment-15439050"
        },
        {
            "date": "2016-09-01T19:31:24+0000",
            "author": "Cassandra Targett",
            "content": "Gregory Chanan or Ishan Chattopadhyaya - is the functionality described in this earlier comment https://issues.apache.org/jira/browse/SOLR-9200?focusedCommentId=15366913&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-15366913 still accurate? This has not yet been added to the Solr Ref Guide, and since I think there is some interest for it, we should try to get it in while we're waiting for the issue with publishing 6.2 to be resolved.\n\nIt belongs with the Kerberos documentation at https://cwiki.apache.org/confluence/display/solr/Kerberos+Authentication+Plugin, correct? ",
            "id": "comment-15456383"
        },
        {
            "date": "2016-09-02T17:07:47+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Cassandra Targett, I just had a look and it seems the parameters described in the comment are reflective of the changes committed, and can be imported as is into the Ref Guide. Gregory Chanan, please pitch in if that is not accurate. ",
            "id": "comment-15459060"
        },
        {
            "date": "2016-09-07T12:31:46+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "I think a section on delegation tokens can be added to the ref guide page for Kerberos Plugin. Here's a proposed wording (based on the original description in this issue):\n\n\nDelegation tokens\n-----------------\n\nThe Kerberos plugin can, optionally, be configured to use delegation tokens. The plugin allows authenticated users the ability to grab, renew or delete a token that can be used to bypass the normal authentication path for a time. This is useful in a variety of use cases:\n1) distributed clients (e.g. MapReduce) where each client may not have access to the user's Kerberos credentials. Instead, the job runner can grab a delegation token and use that during task execution.\n2) If the load on the Kerberos server is too high, delegation tokens can avoid hitting the Kerberos server after the first request.\n3) If requests/permissions need to be delegated to another user: the more privileged user can request a delegation token that can be passed to the less privileged user.\n\nEnabling delegation tokens can be done by setting the solr.kerberos.delegation.token.enabled parameter to true. ",
            "id": "comment-15470485"
        },
        {
            "date": "2016-09-07T12:34:10+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "In my previous comment about the parameters, I missed out the fact that the last two parameters are now (chroot)/security/token or (chroot)/security/zkdtsm.\n\n\nsolr.kerberos.delegation.token.signer.secret.provider.zookeper.path \tString \t(chrooted path) + /security/token \tZookeeper location where secret provider information is stored\nsolr.kerberos.delegation.token.secret.manager.znode.working.path \tString \t(chrooted path) + /security/zkdtsm \tZookeeper location where token information is stored ",
            "id": "comment-15470491"
        },
        {
            "date": "2016-09-21T17:55:37+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "\nMaybe I'm misunderstanding something, but don't the internode calls already use PKI – that seems to always be used for internode calls with SolrCloud. I don't see what's different with this patch than before it.\n\nInternode calls use PKI authentication for any plugin that does not implement HttpClientInterceptorPlugin. Kerberos plugin uses that \"interceptor\" and hence deals with its own internode communication (each node has a client principal associated with it, specified in a jaas config file, for making internode calls). I think the committed patch here for delegation tokens does not have the internode communications using the delegation tokens. If that is the case, we can open another issue to add a test and fix. ",
            "id": "comment-15510668"
        },
        {
            "date": "2016-09-23T21:03:59+0000",
            "author": "Timothy Frey",
            "content": "Hi there,\n\nNot sure if this is the appropriate place to report this issue.  We're building a Solr 6.2 cluster and we want to use BasicAuth.  We notice that if we just set a request header of \"SolrAuth\" with any value lets us completely bypass the BasicAuth layer.  I noticed a change to this function:\n\nhttps://github.com/apache/lucene-solr/blob/6cfec0bd7a56f7e70046093c603e6f5982c83c69/solr/core/src/java/org/apache/solr/security/PKIAuthenticationPlugin.java#L92\n\nLooks like every failure start of that method returns \"true\" which indicates that authentication was successful.  Am I reading this correctly? ",
            "id": "comment-15517569"
        },
        {
            "date": "2016-09-23T22:29:50+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "Thanks for reporting it, Timothy. Can you please create another issue with the appropriate title and add these details and any other information necessary to reproduce this bug? It sounds like a serious bug to me, but I haven't looked much into it. ",
            "id": "comment-15517752"
        },
        {
            "date": "2016-10-12T06:58:36+0000",
            "author": "Mikhail Khludnev",
            "content": "https://jenkins.thetaphi.de/job/Lucene-Solr-master-Windows/6175/\n\n   [junit4]   2> 1072871 ERROR (jetty-launcher-1462-thread-2) [n:127.0.0.1:64463_solr    ] o.a.h.u.Shell Failed to locate the winutils binary in the hadoop binary path\n   [junit4]   2> java.io.IOException: Could not locate executable null\\bin\\winutils.exe in the Hadoop binaries.\n   [junit4]   2>        at org.apache.hadoop.util.Shell.getQualifiedBinPath(Shell.java:356)\n   [junit4]   2>        at org.apache.hadoop.util.Shell.getWinUtilsPath(Shell.java:371)\n   [junit4]   2>        at org.apache.hadoop.util.Shell.<clinit>(Shell.java:364)\n   [junit4]   2>        at org.apache.hadoop.util.StringUtils.<clinit>(StringUtils.java:80)\n   [junit4]   2>        at org.apache.hadoop.conf.Configuration.getBoolean(Configuration.java:1437)\n   [junit4]   2>        at org.apache.hadoop.security.token.delegation.web.DelegationTokenManager.<init>(DelegationTokenManager.java:115)\n\n\nUwe Schindler, is it possible to provide  -Dhadoop.home.dir=C:\\hadoop where bin\\winutils.exe is located. Or just ignore it from windows run?  ",
            "id": "comment-15567838"
        },
        {
            "date": "2016-10-12T09:40:29+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "How about we re-close this, since this has already been released, and use another issue to track this failure? I've created SOLR-9630 for this. ",
            "id": "comment-15568209"
        },
        {
            "date": "2016-10-12T11:32:35+0000",
            "author": "Uwe Schindler",
            "content": "Please add a assumeFalse(Constants.WINDOWS) for all hadoop tests. We do this on all other tests already. ",
            "id": "comment-15568463"
        }
    ]
}