{
    "id": "SOLR-7895",
    "title": "Administrative UI Lacks Obvious \"Delete Core Contents\" Button",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "When Solr screws up, which is practically on a daily basis, I often want to delete the contents of a core without deleting its structure. Instead of clicking on a button and perhaps an \"Are you sure?\" prompt, I have to remember this incredibly unwieldy and dangerous-to-bookmark URL:\n\nhttp://[server]:8983/solr/[core name]/update?stream.body=%3Cdelete%3E%3Cquery%3Eid:*%3C/query%3E%3C/delete%3E&commit=true\n\nTo say that this is not user-friendly is a gross understatement. If there is a better way or an obvious easy way, I have not found it.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-07T05:12:49+0000",
            "author": "Shawn Heisey",
            "content": "The deleteByQuery action will mark all the documents deleted, but when it is done, the disk still has all the index files, and for many features, those documents are still utilized, although they will be pruned from results.  For some config/schema changes, deleting all the docs in the index isn't enough to prevent errors.\n\nI would like to have a button that actually deletes the data directory, after appropriate confirmation.  In order to allow it to work on Windows, it would probably need to unload the core, delete the directory and all its contents, and then re-create the core.  When the core is created, the dataDir and its index directory will be rebuilt.  Appropriate permissions on the filesystem are required, but usually if you can delete the directory, you can create it again. ",
            "id": "comment-14661332"
        },
        {
            "date": "2015-08-07T05:26:04+0000",
            "author": "Upayavira",
            "content": "I tried a delete by query on : and watched the index. Once a commit happens, Lucene notices that there are no segments left, and you are left with an entirely empty index. Thus, a <delete><query>:</query></delete> update would seem the best way, as the one thing it doesn't do is reset the index generation, that would mess things up with replication.\n\nI've thought about this feature myself. In another ticket I'm suggesting we add an \"are you sure? yes/cancel\" popup for optimization. I'm thinking of adding a \"delete with confirmation\" option to the documents tab.\n\nGiven the AngularJS UI is close to feature complete, I think we're now at the point (ready for 5.4) where we can start doing this - especially if others (such as yourself Aaron Greenspan) are actively reviewing the app. ",
            "id": "comment-14661350"
        },
        {
            "date": "2015-08-07T05:32:27+0000",
            "author": "Aaron Greenspan",
            "content": "I'm afraid I can't be of much assistance coding, but I'm happy to provide feedback. ",
            "id": "comment-14661358"
        },
        {
            "date": "2015-08-07T06:03:43+0000",
            "author": "Shawn Heisey",
            "content": "Once a commit happens, Lucene notices that there are no segments left, and you are left with an entirely empty index.\n\nDo you happen to know when this optimization was added?  Last time I explicitly checked (which I admit was quite a while ago), deleting all the docs in the index didn't clear up disk space.  When my build program starts a full rebuild (with DIH), I have it do the following sequence on each build core:  delete all docs, commit, optimize, and then reload the core.  That takes care of the disk space... but if I had the option, I'd delete the data directory and reload.  The build program runs on another host and only connects with SolrJ, there is no filesystem access. ",
            "id": "comment-14661380"
        },
        {
            "date": "2015-08-07T06:14:01+0000",
            "author": "Upayavira",
            "content": "I don't, but it would have been on a 5.2.1 index that I saw it happen. I was pleasantly surprised myself. ",
            "id": "comment-14661386"
        },
        {
            "date": "2015-08-07T06:18:04+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Delete All has been this way since Lucene 2.9 ",
            "id": "comment-14661387"
        }
    ]
}