{
    "id": "SOLR-12952",
    "title": "TFIDF scorer uses max docs instead of num docs when using Edismax",
    "details": {
        "type": "Bug",
        "status": "Resolved",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Major",
        "resolution": "Invalid",
        "affect_versions": "None"
    },
    "description": "I have recently noticed some odd behavior while using the edismax query parser.\n The scores returned by documents seem to be affected by deleted documents, which have yet to be merged and completely removed from the index.\n This causes different replicas to return different scores for the same query.\n Is this a bug, or am I missing something?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16671568",
            "content": "Lucene scoring has always been influenced by deleted docs.  SolrCloud's NRT replica type has always had the potential for this problem, because different replicas having different numbers of deleted documents has always been a possibility.  If you use TLOG/PULL replica types (new in 7.x) then all replicas will be absolutely identical, and this can't happen.\n\nIt is not a bug.  I don't know if eliminating the influence of deleted documents on the scores in a query is even possible.  Attempting to do it would kill performance. ",
            "author": "Shawn Heisey",
            "date": "2018-11-01T12:45:40+0000"
        },
        {
            "id": "comment-16671583",
            "content": "mosh, other than using TLOG/PULL replica types (as Shawn Heisey suggests), you could look into statsCache (distributed IDF), which basically does some post-calculation adjustment to normalize IDF across different shards. ",
            "author": "Michael Gibney",
            "date": "2018-11-01T12:57:21+0000"
        },
        {
            "id": "comment-16671671",
            "content": "Please ask questions like this on the user's list before raising a JIRA, and then raise a Jira if it's confirmed to be a problem.\n\nBest,\nErick ",
            "author": "Erick Erickson",
            "date": "2018-11-01T14:23:09+0000"
        }
    ]
}