{
    "id": "SOLR-3876",
    "title": "Solr Admin UI is completely dysfunctional on IE 9",
    "details": {
        "affect_versions": "4.0-BETA,                                            4.0",
        "status": "Closed",
        "fix_versions": [
            "4.1"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The Solr Admin UI is completely dysfunctional on IE 9. See attached screen shot. I don't even see a \"collection1\" button. But Admin UI is working fine in Google Chrome with same running instance of Solr.\n\nCurrently running 4.0 RC0, but problem existed with 4.0-BETA.",
    "attachments": {
        "SOLR-3876.patch": "https://issues.apache.org/jira/secure/attachment/12563290/SOLR-3876.patch",
        "screenshot-1.jpg": "https://issues.apache.org/jira/secure/attachment/12546300/screenshot-1.jpg",
        "screenshot-3.jpg": "https://issues.apache.org/jira/secure/attachment/12546309/screenshot-3.jpg",
        "screenshot-2.jpg": "https://issues.apache.org/jira/secure/attachment/12546307/screenshot-2.jpg"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jack Krupansky",
            "id": "comment-13461845",
            "date": "2012-09-24T15:05:21+0000",
            "content": "After hitting browser refresh the Admin appearance changes a little, but still no \"collection1\" button. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13461847",
            "date": "2012-09-24T15:08:11+0000",
            "content": "And for reference, here is a screenshot of Admin in Chrome running against the same Solr instance as IE 9. "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13461860",
            "date": "2012-09-24T15:29:40+0000",
            "content": "Thanks a lot for this, Jack.\n\nI'm afraid I don't know the overall status nor history of the 4.0 UI in IE9, but do you happen to know if this is a regression of it the UI has been generally broken for IE9 all along?\n\nTo me it sounds quite important to get this fixed for 4.0 if it's a regression.  I can help working some on this. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13461877",
            "date": "2012-09-24T16:03:04+0000",
            "content": "I  primarily use Chrome, so I never actually tried the Admin UI in IE 9 until recently - see my comment on SOLR-3840 dated September 13th. As indicated there, I meant to file a separate Jira for this issue, but... it slipped my mind until a was reviewing the comments on SOLR-3840 this morning when someone commented on that issue.\n\nI wasn't even aware that I had IE 9 - Microsoft must have pushed an auto-update at some point. The Wikipedia says IE 9 was released back in 2011, but that doesn't say when it became the default update for Windows 7.\n\nIn short, I don't know if this is a regression for IE 9. I'd assume that it isn't. I don't even know if it is a regression from IE 8.\n "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13461889",
            "date": "2012-09-24T16:21:58+0000",
            "content": "The 4.0 UI wasn't developed with IE9 in mind so getting IE9 supported seems like a bigger effort.  SOLR-3841 seems related to this issue and has been deferred to 4.1 so I'm suggesting that we do the same with this one as well.\n\nPlease feel free to jump in with whatever comments you might have, steffkes. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13488302",
            "date": "2012-10-31T22:17:16+0000",
            "content": "This is actually a dup of SOLR-3841 but since this issue has more comments & screnshots i'll resolve that one.\n\nThe one key comment from that issue to bear in mind...\n\n\nYonik Seeley added a comment - 24/Sep/12 18:18\n\nJust to try and quantify the severity of the issue, I quickly checked the browser stats for solr downloads - it looks like IE is running at about 17% "
        },
        {
            "author": "Daniel Collins",
            "id": "comment-13488554",
            "date": "2012-11-01T08:44:39+0000",
            "content": "For what its worth, IE 8 is just as bad. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13488659",
            "date": "2012-11-01T12:50:43+0000",
            "content": "FWIW, I don't think supporting all browsers was ever a goal. This isn't an public-facing app, devs use it. So I don't think it's unreasonable to say \"works best in Chrome, no planned support for other browsers\".\n\nSupporting the quirks of various browsers is such a rat-hole that I'm reluctant to even try. Especially since downloading Chrome and using it isn't that big a deal IMO, developers are the ones using the admin UI after all.\n\nYes, IE is on lots of desktops. Yes, some corporate policies dictate that you can't use other browsers. Yes, it would be nice if it worked in IE. No, I'm not willing to put any effort that direction <G>...\n\nmy $0.02 "
        },
        {
            "author": "Paul Alkema",
            "id": "comment-13542223",
            "date": "2013-01-02T16:41:46+0000",
            "content": "For those who use Windows Servers, this means you can't access the the Solr admin from localhost. This is a serious problem as most companies have policies against installing 3rd party browsers on production servers and I don't want to open up this admin to the public. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13542228",
            "date": "2013-01-02T16:47:43+0000",
            "content": "I don't care if everything is pretty or not, but we should at least support basic admin functionality in IE IMO (though I have not used it for years for just about anything). "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13542232",
            "date": "2013-01-02T16:53:21+0000",
            "content": "And even I (who filed the Jira) don't use IE for general web browsing on Windows, but I do keep IE as my default browser to assure that I test a fairly basic user scenario. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13542241",
            "date": "2013-01-02T17:18:03+0000",
            "content": "FWIW, I'm certainly not objecting to putting IE support in, I don't know why anyone would. That said, I'm not willing to\n\n1> put the effort into it myself (partly due to my total lack of browser programming expertise)\nor\n2> hold up a release to put it in. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13542301",
            "date": "2013-01-02T19:06:18+0000",
            "content": "FWIW, I'm certainly not objecting to putting IE support in, I don't know why anyone would.\n\nTo support those users who do (or have to) use IE, or are installing Solr on a server where only IE is installed?\nAlthough I don't think it should hold up a release, we shouldn't send a message that we don't care at all. "
        },
        {
            "author": "Paul Alkema",
            "id": "comment-13542303",
            "date": "2013-01-02T19:08:22+0000",
            "content": "I don't like IE as well however, the Solr documentation says that is supports Windows and so therefore should support the default windows browser correct? I'm wondering if it's the version of RequireJS used in the solr admin. It looks like it's RequireJS 1.0.6 but the latest version is RequireJS 2.1.2.  "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13542387",
            "date": "2013-01-02T20:37:52+0000",
            "content": "the Solr documentation says that is supports Windows and so therefore should support the default windows browser correct? \n\nNo, I don't think Solr running on windows means we require IE support. I do think we should make a best effort to get the basic working though. IE is still a major browser and the old admin UI worked with it. For an admin UI, I personally favor working in as many envs as possible (barring visual problems) over fancy looks or features. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13543919",
            "date": "2013-01-04T14:43:27+0000",
            "content": "Jack Krupansky would you mind giving this patch a shot? i have a IE 9.0 running in a Windows 7 VM and these few changes bring the whole UI back to working - at least for my setup. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13544507",
            "date": "2013-01-05T01:43:49+0000",
            "content": "Sure. I'll try to get to it this weekend. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13546115",
            "date": "2013-01-07T18:15:23+0000",
            "content": "Even if not specifically mentioned, the same goes for Paul Alkema, Daniel Collins and all other IE users of course  more tests (or at least confirmation) will help to bring this in for 4.1 "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13546485",
            "date": "2013-01-08T01:20:59+0000",
            "content": "I didn't see a commit go by, but when I checked on the XML query result display issue (SOLR-3840), the full Solr Admin UI seems to work just fine now, at least for the dozen or so screens I navigated through.\n\nI tested it with ant run-example with a fresh svn co of branch_4x just a couple of minutes ago.\n\nI still tried to apply the patch anyway, but I get a problem:\n\n\nJack Krupansky@JackKrupansky lucene_solr_4x [master] $ patch -p0 -i SOLR-3876.patch\npatching file solr/webapp/web/admin.html\npatching file solr/webapp/web/js/lib/console.js\npatching file solr/webapp/web/js/scripts/cloud.js\nHunk #1 succeeded at 436 (offset 21 lines).\nHunk #2 succeeded at 446 (offset 21 lines).\npatching file solr/webapp/web/js/scripts/app.js\nHunk #2 FAILED at 184.\nHunk #3 FAILED at 227.\nHunk #4 succeeded at 312 (offset 38 lines).\n2 out of 4 hunks FAILED -- saving rejects to file solr/webapp/web/js/scripts/app.js.rej\npatching file solr/webapp/web/js/scripts/plugins.js\n\n\n\nBut if it works without that patch, who am I to complain.\n\nIn any case, thanks for the huge improvement in 4.1 over 4.0 for IE support. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13547151",
            "date": "2013-01-08T19:26:25+0000",
            "content": "Uhm, how does that work? *g I mean .. i want complain about that fact, but well \n\nUpdated the initial Patch, the commits i made in the meantime changed a few lines. i'll commit that soon, so that this issue goes in for 4.1 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13547361",
            "date": "2013-01-08T22:42:19+0000",
            "content": "[trunk commit] Stefan Matheis\nhttp://svn.apache.org/viewvc?view=revision&revision=1430586\n\nSOLR-3876: Solr Admin UI is completely dysfunctional on IE 9 "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13547364",
            "date": "2013-01-08T22:46:23+0000",
            "content": "[branch_4x commit] Stefan Matheis\nhttp://svn.apache.org/viewvc?view=revision&revision=1430589\n\nSOLR-3876: Solr Admin UI is completely dysfunctional on IE 9 (merge r1430586) "
        }
    ]
}