{
    "id": "SOLR-525",
    "title": "NullPointerException with no query or empty query",
    "details": {
        "affect_versions": "1.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "When calling the search URL with no query or an empty query (i.e.  http://localhost:8080/solr/select/ or http://localhost:8080/solr/select/?q=), Solr throws a NullPointerException. The value for the query string returned by the SolrParams object is null, but QueryComponent tries to process it.\n\nI encountered this bug because of a bug in my application calling the search URL, but arguably the response should be more constructive.",
    "attachments": {
        "solr-search-empty-query.patch": "https://issues.apache.org/jira/secure/attachment/12379088/solr-search-empty-query.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lars Kotthoff",
            "id": "comment-12584046",
            "date": "2008-04-01T07:57:02+0000",
            "content": "Patch to fix the NullPointerException. Instead of setting the query string of the ResponseBuilder object to whatever the SolrParams object returns, check whether the returned value is null, and if so, set the query string to \"\". This will raise a ParserException when no or an empty search string is passed to Solr.\n\nI'm not sure whether this is the optimal solution, so if anyone has a better idea of how to handle this, please comment. This solution only provides a more meaningful error message than a NullPointerException. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-12584131",
            "date": "2008-04-01T13:17:39+0000",
            "content": "Thanks for posting a solution!  This is the same as SOLR-435, but that has lingered for a while. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12584374",
            "date": "2008-04-02T01:01:47+0000",
            "content": "Ah, sorry, didn't find that issue. I agree with the original thread reporting this problem that returning a 400 and indicating that a parameter is missing is a better solution. "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12584375",
            "date": "2008-04-02T01:03:02+0000",
            "content": "New patch which throws a SolrException when the query string is empty (cf. http://www.nabble.com/query-parsing-error-to14124285.html#a14140108). "
        }
    ]
}