{
    "id": "SOLR-12268",
    "title": "Opening a new NRT Searcher can take a while and block calls to /admin/cores.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "When we open a new reader from a writer, we get an IndexWriter lock and may call applyAllDeletesAndUpdates. That call can take a while holding the lock. Meanwhile calls coming to /admin/cores get isCurrent for the reader, which checks if the IndexWriter is closed, which requires the IndexWriter lock. These leads to /admin/cores calls taking as long as applyAllDeletesAndUpdates.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-04-26T20:48:25+0000",
            "content": "It seems to me we have to consider not adding anything that would get an indexwriter lock in the default output. Any opinions here? ",
            "author": "Mark Miller",
            "id": "comment-16454848"
        },
        {
            "date": "2018-04-26T20:59:43+0000",
            "content": "The problem being, an external tool may be polling /admin/cores and you may be opening new searchers a lot with NRT, and applyAllDeletesAndUpdates may take non trivial time and so each call will be much longer than a request like this should and they can start stacking up ... ",
            "author": "Mark Miller",
            "id": "comment-16454860"
        },
        {
            "date": "2018-04-27T16:04:56+0000",
            "content": "You mean in the call to LukeRequestHandler.getIndexInfo(...)? That is already optional (but default), right? ",
            "author": "Tomás Fernández Löbbe",
            "id": "comment-16456673"
        },
        {
            "date": "2018-04-27T16:21:14+0000",
            "content": "Yeah, the IndexReader.isCurrent call in getIndexInfo.\n\nI believe it's on by default, but also, index stats are the type of thing you would want to poll this api for. The isCurrent info is actually not very useful though and can significantly slow down these calls when applying deletes takes a long time.\n\nSo the current situation is not great in two ways:\n\n1. It's not apparent that you will hit this problem, so a user trying to monitor index stats won't know they should turn off index info.\n2. IndexInfo seems like the most likely info a monitoring system would want. ",
            "author": "Mark Miller",
            "id": "comment-16456692"
        }
    ]
}