{
    "id": "SOLR-8274",
    "title": "Add per-request MDC logging based on user-provided value.",
    "details": {
        "components": [
            "logging"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "Problem 1 Currently, there's no way (AFAIK) to find all log messages associated with a particular request.\n\nProblem 2 There's also no easy way for multi-tenant Solr setups to find all log messages associated with a particular customer/tenant.\n\nBoth of these problems would be more manageable if Solr could be configured to record an MDC tag based on a header, or some other user provided value.\n\nThis would allow admins to group together logs about a single request.  If the same header value is repeated multiple times this functionality could also be used to group together arbitrary requests, such as those that come from a particular user, etc.",
    "attachments": {
        "SOLR-8274.patch": "https://issues.apache.org/jira/secure/attachment/12773436/SOLR-8274.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-10T23:20:05+0000",
            "author": "Jason Gerlowski",
            "content": "To clarify, it'll obviously be tough/impossible to get this MDC context associated with every relevant log message (especially when we need to jump thread/process boundaries).  But allowing some per-request grouping here (even if it's not comprehensive) would be a big boost IMO. ",
            "id": "comment-14999573"
        },
        {
            "date": "2015-11-11T18:12:05+0000",
            "author": "Mark Miller",
            "content": "especially when we need to jump thread/process boundaries\n\ninteresting Apahce project along those lines: http://htrace.org/ ",
            "id": "comment-15000820"
        },
        {
            "date": "2015-11-20T03:34:44+0000",
            "author": "Jason Gerlowski",
            "content": "I took a stab at adding a \"requestId\" MDC tag in RequestHandlerBase.\n\nAs patches go, this is about as straw-man as it gets.  I haven't made any attempt to share this request-tracker across threads, nor have I played around with pushing it down in to the actual Lucene code where the work of searching/indexing happens.  I just wanted to upload anything in case I'm doing something horribly wrong.\n\nMy next steps are to change my approach to mimic the handling of 'collection' and 'core' in MDCLoggingContext, to try and make the request-tracker cover more of Solr/Lucene's logs.  I also need to look into testing this logging change if I can.\n\nIt's taken me a week or so to make the little progress I have so far, but most of that was learning, so hopefully things'll go more smoothly in my next revision. ",
            "id": "comment-15015146"
        },
        {
            "date": "2018-05-01T21:05:28+0000",
            "author": "Otis Gospodnetic",
            "content": "Perhaps a more modern way to approach this is to instrument Solr.  OpenTracing comes to mind.  See https://sematext.com/blog/opentracing-distributed-tracing-emerging-industry-standard/ for a quick overview.  See also https://github.com/opentracing-contrib  ",
            "id": "comment-16460158"
        }
    ]
}