{
    "id": "SOLR-5939",
    "title": "Wrong request potentially on Error from StreamingSolrServer",
    "details": {
        "affect_versions": "6.0",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "In StreamingSolrServer.getSolrServer|ConcurrentUpdateSolrServer.handleError the SolrCmdDistributor.Req req parameter is used for the req field of all error's created. This is also true for subsequent requests sent through the retuned ConcurrentUpdateSolrServer. This means a.o. that wrong request (the first request sent through this ConcurrentUpdateSolrServer) may be retried if case of errors executing one of the subsequent requests.",
    "attachments": {
        "SOLR-5939_demo_problem.patch": "https://issues.apache.org/jira/secure/attachment/12637813/SOLR-5939_demo_problem.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Per Steffensen",
            "id": "comment-13955147",
            "date": "2014-03-31T12:54:25+0000",
            "content": "Try running the test-suite (or just BasicDistributedZkTest) with attached patch SOLR-5939_demo_problem.patch. It is not supposed to be committed - just demonstrate the problem by showing where problems would have occurred if the request had resulted in errors. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13955212",
            "date": "2014-03-31T14:28:22+0000",
            "content": "This sounds so familiar - did you bring this up before in another issue? "
        },
        {
            "author": "Per Steffensen",
            "id": "comment-13955356",
            "date": "2014-03-31T16:32:02+0000",
            "content": "Well, I happened to be reading the code trying to understand how it works, during my work with SOLR-4470. I realized that this piece of code would not work - by code inspection alone. Instead of fixing it (I had to concentrate on SOLR-4470 stuff) I just added a few FIXME lines around where the problem is. Jan Høydahl is handling the SOLR-4470 patch now, and prefer that I open an issue (this SOLR-5939) about the problem and just reference that from the code instead of the FIXME description. So yes, I mentioned it before, in comments to SOLR-4470.\n\nI mentioned another issue with SolrCmdDistributor long time ago (see SOLR-3428). I do not know exactly what happened to that one. We have the fix in our version of Solr, but I am not sure what you did about it. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13955360",
            "date": "2014-03-31T16:35:22+0000",
            "content": "Just wanted to make sure I wasn't having deja vu - it def deserves it's own issue. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971239",
            "date": "2014-04-16T12:57:32+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}