{
    "id": "SOLR-2394",
    "title": "Deprecate \"standard\" writer type (wt), just say \"xml\".",
    "details": {
        "affect_versions": "1.4.1",
        "status": "Closed",
        "fix_versions": [
            "3.2",
            "4.0-ALPHA"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I think the \"standard\" writer type being aliased to \"xml\" is unnecessary and not clear.  In the full interface screen, imagine you're new to Solr and you look at the \"output type\" and you see \"standard\".  What does that mean?  \"xml\" is pretty clear.\n\nAssuming it's agreed that \"standard\" isn't of any value, I suggest that it not necessarily go away (due to backwards compatibility) but that it's existence is removed from the full interface screen, replaced with \"xml\".  Furthermore, a picker list would be a better GUI element since there are a small limited fixed number of them.\n\nPerhaps this small UI change can be considered for 3.1.  I'll write a small patch if there's agreement on the idea.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13000492",
            "date": "2011-02-28T19:55:49+0000",
            "content": "Sounds fine to me. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13000499",
            "date": "2011-02-28T20:20:38+0000",
            "content": "I think we're just tlaking about the links in the web ui, in which case i'm totally in favor of eliminating the usage of \"standard\" ... in SOLR-2397 i plan to remove the explicit declaration of \"standard\" in the example config anyway and just point out the merits of specifying 'default=\"true\"'\n\n(but for back-compat we should definitely leave the code in SolrCore that looks for a handler named \"standard\" when it can't find a default) "
        },
        {
            "author": "David Smiley",
            "id": "comment-13015096",
            "date": "2011-04-03T03:31:13+0000",
            "content": "I'm glad you are/were totally in favor of this Hoss because, yes, I was simply talking about putting \"xml\" as the value in the web UI instead of \"standard\".  I could have sworn this was going to get into 3.1 but it did not   Can someone commit this trivial change so it is not forgotten in the next release? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13022388",
            "date": "2011-04-20T21:51:47+0000",
            "content": "David: sorry .. i also thought this had already been dealt with.\n\nnote that i did not replace \"standard\" with \"xml\" ... i just flat out removed the (default) value from the form so it would be blank on submit and use whatever what configured as the default for the handler.\n\nthe less assumptions we make about what handlers/writers are configured the better.\n\nCommitted revision 1095526. - trunk\nCommitted revision 1095527. - 3x\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043603",
            "date": "2011-06-03T16:44:57+0000",
            "content": "Bulk close for 3.2 "
        }
    ]
}