{
    "id": "SOLR-8271",
    "title": "use SchemaSimilarityFactory as default when no explicit (top level) sim is configured",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "Idea spun out of SOLR-8057...\n\nAs far as i can tell, the chief reason SchemaSimilarityFactory wasn't made the implicit default in IndexSchema when it was introduced is because of how it differed/differs from DefaultSimilarity/ClassicSimilarity with respect to multi-clause queries – see SchemaSimilarityFactory's class javadoc notes relating to queryNorm and coord. Users were expected to think about this trade off when making a concious choice to switch from DefaultSimilarity/ClassicSimilarity to SchemaSimilarityFactory. But (again, AFAICT) these discrepencies don't exist between SchemaSimilarityFactory's PerFieldSimilarityWrapper and BM25Similiarity.\n\nSo assuming luceneMatchVersion >= 6.0, and BM25 is implicit default, we should be able to safely switch to using SchemaSimilarityFactory as our default (which internally uses BM25 for fieldTypes that don't override) and make it much easier for people to declare fieldType overrides for the similarity (just edit the fieldType, w/o also needing to explicitly declare SchemaSimilarityFactory)",
    "attachments": {
        "SOLR-8271.patch": "https://issues.apache.org/jira/secure/attachment/12771883/SOLR-8271.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-12T01:05:23+0000",
            "author": "Hoss Man",
            "content": "Initial simple patch, currently causes failures in TestCloudSchemaless & ChangedSchemaMergeTest.\n\nThese are the same failures I noted in the early attempts at SOLR-8057.  Earlier today I thought that was because I was being silly in that old patch and needed to use the SolrResourceLoader to create the sin factory so SolrCoreAware.inform would be called appropriately in all situations – which I do in this patch.  But the failures persist.  Digging into it I realized the same problem could easily be reproduced via configs – so this issue is currently bloced until we can get to the bottom of SOLR-8280. ",
            "id": "comment-15001436"
        },
        {
            "date": "2015-11-20T05:42:34+0000",
            "author": "Hoss Man",
            "content": "\nOk, now that SOLR-8280 is resolved the same basic patch (with one minor conflict resolution) as before passes all tests.  In this new patch I've removed most of the explicit declarations of solr.SchemaSimilarityFactory from the various tests schema files since it's now the implicit default.  A few special circumstances...\n\n\n\tschema-sim.xml - used by TestPerFieldSimilarityClassic which overrides the luceneMatchVersion so we have to be explicit that we want it to be the global sim.\n\tschema-class-name-shortening-on-serialization.xml - the purpose of this file is for TestClassNameShortening, so we need to leave the \"short\" name here in this config to test the proper behavior\n\tTestSchemaSimilarityResource.testGetSchemaSimilarity - was previously used the short class name for SchemaSimilarityFactory since that's what was explicitly mentioned in schema-rest.xml, so i changed the test to expect the FQN for the class – which is the default behavior of the REST API for implicitly defined instances.\n\n\n\n...i think we're good to go. ",
            "id": "comment-15015258"
        },
        {
            "date": "2015-11-20T17:00:36+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1715393 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1715393 ]\n\nSOLR-8271: Change implicit default Similarity to use SchemaSimilarityFactory when luceneMatchVersion >= 6 ",
            "id": "comment-15018329"
        }
    ]
}