{
    "id": "SOLR-918",
    "title": "Thread safety issue in SolrCore.infoRegistry",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "SolrCore.infoRegistry is used for keeping a reference to the SolrInfoMBean objects. When JMX is disabled, it is initialized to a LinkedHashMap which is not synchronized.\n\nWe can change this to a ConcurrentHashMap instead of a LinkedHashMap.",
    "attachments": {
        "SOLR-918.patch": "https://issues.apache.org/jira/secure/attachment/12396301/SOLR-918.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12657374",
            "date": "2008-12-17T13:08:57+0000",
            "content": "Patch to change LinkedHashMap to ConcurrentHashMap. I plan to commit shortly. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12657375",
            "date": "2008-12-17T13:11:05+0000",
            "content": "Committed revision 727370. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12657606",
            "date": "2008-12-17T23:13:04+0000",
            "content": "Hmmm, it used to be a synchronized map.\nLooks like this bug was introduced back in one of those mega-changes, SOLR-215 "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12657661",
            "date": "2008-12-18T03:21:39+0000",
            "content": "It was a HashMap in the SOLR-256 commit but I think it was changed (by me?) to a LinkedHashMap because some users complained that the order of things in stats pages is not the same anymore. Is it ok to let it be a ConcurrentHashMap or should we make it a synchronized LinkedHashMap? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12657885",
            "date": "2008-12-18T20:24:19+0000",
            "content": "Is it ok to let it be a ConcurrentHashMap or should we make it a synchronized LinkedHashMap\n\nEither should be fine... new components are added so infrequently and checked so infrequently that there won't be a performance difference.\n\nIf it's changed to synchronized LinkedHashMap, it should be noted in the javadoc for SolrCore.getInfoRegistry() (which is new in 1.3) that it's a synchronized Map and thus users need to synchronize during iteration.  This synchronization is currently being done by all users of this API since it previously was a synchronized map (before the synchronization was mistakenly removed).\n\nIf we stay with ConcurrentHashMap (and hence don't care about order), then the current synchronization while iterating should probably be removed too. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12658016",
            "date": "2008-12-19T06:04:49+0000",
            "content": "Alright. When JMX is enabled, it uses the JmxMonitoredMap which extends ConcurrentHashMap so order is not maintained anyway. Let's stick with ConcurrentHashMap, I'll scan through the code and remove all synchronization during iteration and update the javadocs. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12658021",
            "date": "2008-12-19T06:35:24+0000",
            "content": "\n\tRemoved synchronization for iterating infoRegistry from stats.jsp and PluginInfoHandler\n\tUpdated Javadocs for SolrCore#getInfoRegistry to:\n\n+   * Returns a Map of name vs SolrInfoMBean objects. The returned map is an instance of\n+   * a ConcurrentHashMap and therefore no synchronization is needed for putting, removing\n+   * or iterating over it.\n+   *\n\n\n\n\n\nI plan to commit shortly. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12658022",
            "date": "2008-12-19T06:37:43+0000",
            "content": "Committed revision 727944. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775610",
            "date": "2009-11-10T15:51:53+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}