{
    "id": "SOLR-3714",
    "title": "SolrCloud fails to query documents if the primary key field is of type \"lowercase\"",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Bug"
    },
    "description": "Running the default SolrCloud tutorial, if you change the id field to type \"lowercase\" instead of \"string\", and re-run the tests (indexing all the documents in exampledocs), queries find strange results..\nQuerying for : and rows=10 returns numFound as 26 docs, setting rows = 20 returns 23 docs, and setting rows=50, returns 12 docs!\nQuerying for specific ids seems hit and miss as well, the purely lowercase ids \"?q=id:belkin\" work ok, but anything with uppercase or mixed case ids fails to be found.\nThe index is clearly correct as booting the serer without zookeeper (just removing -DzkRun from the command line) returns all the expected docs, but somehow zookeeper is interfering with the queries?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Cao Manh Dat",
            "id": "comment-15534971",
            "date": "2016-09-30T04:17:01+0000",
            "content": "I dont think it is a valid request because \"lowercase\" is a text field, so it will be tokenized and mess up with doc id.\nSo this ticket can be closed as wont fix here. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-15535532",
            "date": "2016-09-30T09:27:44+0000",
            "content": "Closing as not a bug since we document that unique ID must not be analyzed.\n\nIn the schema file itself, it is clearly stated that \"Do NOT change the type and apply index-time analysis to the <uniqueKey> as it will likely make routing in SolrCloud and document replacement in general fail.\" "
        }
    ]
}