{
    "id": "SOLR-4132",
    "title": "Special log category for announcements, startup messages",
    "details": {
        "affect_versions": "4.0",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "When logging at WARN (log4j) or WARNING (jul), Solr startup logs nothing or next to nothing.  I would like to be able to include some informational messages in the log so that I can see that something's happening, and that Solr is ready for use.  It would probably be wrong to set the level of such things to WARN, because they aren't warnings.\n\nAn alternate plan would be to create a special log category, which could be set to INFO in log4j.properties or logging.properties.  David Smiley suggested org.apache.solr.announcement.\n\nAt a minimum, the new category should have messages for initial startup, core creation, all initialization finished, and shutdown.  There may be other things that should be included too.  It may even be a good idea to have subcategories.  Some initial ideas I've thought of:\n\norg.apache.solr.announcement.startup\norg.apache.solr.announcement.shutdown\norg.apache.solr.announcement.init\norg.apache.solr.announcement.misc",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13507622",
            "date": "2012-11-30T20:18:04+0000",
            "content": "Messages from the new category could be at slf4j's trace level so that when logging all categories at INFO or DEBUG, you won't see duplicate messages. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636747",
            "date": "2013-04-19T19:14:47+0000",
            "content": "Does this issue strike anyone as useful?\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717451",
            "date": "2013-07-23T18:48:17+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971190",
            "date": "2014-04-16T12:57:24+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}