{
    "id": "SOLR-5218",
    "title": "Unable to extend SolrJettyTestBase within a Parametrized test",
    "details": {
        "affect_versions": "4.3.1",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "Tests"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "I would like to create a unit test that extends SolrJettyTestBase using the JUnit Parameterized test format. When I try to run the test I get the following messages:\n\nMethod beforeClass() should be public & Method afterClass() should be public\nat java.lang.reflect.Constructor.newInstance(Unkown Source)...\n\nObviously it would be great if we could make those public so I can use the JUnit Runner.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Dawid Weiss",
            "id": "comment-13760577",
            "date": "2013-09-06T20:15:37+0000",
            "content": "We use a runner that does not follow all of JUnit conventions (and there are reason why it doesn't). JUnit requires all hooks to be public methods but this leads to accidental overrides and missed super calls. In RandomizedRunner a private hook is always called, regardless of the shadowing/ override.\n\nIf you want to use a parameterized test, use RandomizedRunner's factory instead, as is shown here:\nhttps://github.com/carrotsearch/randomizedtesting/blob/master/examples/maven/src/main/java/com/carrotsearch/examples/randomizedrunner/Test007ParameterizedTests.java "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13761111",
            "date": "2013-09-07T19:48:27+0000",
            "content": "Did it solve your problem, Steve? I didn't mean to sound too harsh on this, the problem is that you won't be able to extend SolrJettyTestBase and use a different JUnit runner (parameterized one) at the same time. There are certain bits of Lucene/Solr tests infrastructure that are tightly bound to RandomizedRunner, so if you want to extend SolrJettyTestBase you'll have to stick to it.\n\nThat ParametersFactory annotation plus a constructor is I think a nice mirror and equivalent of ParameterizedRunner? "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787157",
            "date": "2013-10-05T10:19:30+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}