{
    "id": "SOLR-8065",
    "title": "Improve the start/stop script shutdown logic to avoid forcefully killing Solr",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3",
        "status": "Resolved",
        "resolution": "Duplicate",
        "priority": "Minor"
    },
    "description": "Currently the start/stop script only waits 5 seconds before forcefully killing the Solr process. In our experience this is not enough for graceful shutdown on an active SolrCloud node. I propose making the shutdown wait for up to 30 seconds and check the process status every second to avoid unnecessary delay.\n\nI will attach a patch to accomplish this.",
    "attachments": {
        "solr_stop_patch.diff": "https://issues.apache.org/jira/secure/attachment/12756428/solr_stop_patch.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-17T06:47:10+0000",
            "author": "Ere Maijala",
            "content": "Proposed patch to improve the logic of solr_stop function. ",
            "id": "comment-14791670"
        },
        {
            "date": "2015-09-17T07:19:30+0000",
            "author": "Ere Maijala",
            "content": "The patch also changes the delay after kill -9 to 5 seconds to make sure the process has time to die. In practice I've seen the old 1 second delay to not be long enough causing the script to fail. ",
            "id": "comment-14791705"
        },
        {
            "date": "2015-09-28T17:14:07+0000",
            "author": "Timothy Potter",
            "content": "Ideally, we should port this polling code when stopping logic over to the SolrCLI so the process will work on Windows too. What's there for windows is quite hacky ... ",
            "id": "comment-14933591"
        },
        {
            "date": "2015-09-29T06:06:17+0000",
            "author": "Ere Maijala",
            "content": "So, as far as I can see the Windows solr.cmd is already using SolrCLI at startup but the unix script isn't. Is there a reason for that? Could that be a follow-up issue or should everything be cleaned up here? ",
            "id": "comment-14934685"
        },
        {
            "date": "2015-11-10T16:18:12+0000",
            "author": "ASF GitHub Bot",
            "content": "GitHub user yriveiro opened a pull request:\n\n    https://github.com/apache/lucene-solr/pull/209\n\n    SOLR-8065: add configurable variable to define wait time before kill -9\n\n    New patch for this JIRA.\n\n    This new patch allow the user to configure the wait time before force the shutdown with `kill -9`\n\nYou can merge this pull request into a Git repository by running:\n\n    $ git pull https://github.com/yriveiro/lucene-solr trunk\n\nAlternatively you can review and apply these changes as the patch at:\n\n    https://github.com/apache/lucene-solr/pull/209.patch\n\nTo close this pull request, make a commit to your master/trunk branch\nwith (at least) the following in the commit message:\n\n    This closes #209\n\n\ncommit baf21bb43fd57e471529a101e418293408a36f04\nAuthor: Yago Riveiro <yago.riveiro@gmail.com>\nDate:   2015-11-10T16:11:35Z\n\n    SOLR-8065: add configurable variable to define wait time before kill -9\n\n ",
            "id": "comment-14998839"
        },
        {
            "date": "2015-12-03T23:15:00+0000",
            "author": "Mark Miller",
            "content": "We should probably be willing to wait a lot longer than 30 seconds even, unless you pass an option to be more forceful.\n\nEvery SolrCore you have has to properly shutdown - this can involve a commit for each of them on shutdown which can take a long time.\n\nBailing early is really not what you want unless the user is explicit.  ",
            "id": "comment-15038805"
        },
        {
            "date": "2016-10-27T16:50:58+0000",
            "author": "Erick Erickson",
            "content": "This is really the same as SOLR-9371, so we'll do further work there. ",
            "id": "comment-15612474"
        }
    ]
}