{
    "id": "SOLR-10992",
    "title": "the default for stopwords should be disabled",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "config-api"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "6.6",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Suggest removing the stopword filter from the example configs. It is not a “best practice” or even a recommended practice. \n\nThis was discussed in the user mailing list (link below).\n\nI chose the wrong component above, what should it have been?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-07T08:37:26+0000",
            "content": "Yea, get rid of all those stopwords in the _default config-set at least. We could still ship a config-set that highlights stopword usage.\nA side effect would be that fewer users would be bitten by the dreadful dismax + stopwords => 0 hits phenomenon. ",
            "author": "Jan Høydahl",
            "id": "comment-16077814"
        },
        {
            "date": "2017-07-07T16:05:02+0000",
            "content": "I do see one issue here. First let me say I'm all for removing stopwords (+1, just to see if it's only a plus sign in the leading position that seems to get stripped lately). For that matter I'm also in favor of removing all the extra languages etc and super-especially the things like elevate that break startup.... OK, enough ranting.\n\nI usually recommend to clients when they upgrade that they take the configs from the new version and copy/paste their changes over from their old configuration rather than just carry their old ones forward to a new version, especially when they're moving to a new major version.\n\nThis is going to bite them a bit as it's likely they'll overlook something like removing stopwords for the fields they use \"as is\", which many do (text_en comes to mind).\n\nThat said bout the max I'd advocate is a comment in the configs or maybe the upgrade notes in CHANGES.txt to the effect of \"compare your schema definitions carefully since stopwords have been removed\". Well, something better than that but you get the idea. I suppose it's one more incentive to re-index. ",
            "author": "Erick Erickson",
            "id": "comment-16078296"
        },
        {
            "date": "2017-07-07T16:58:25+0000",
            "content": "We could even provide a \"add-multilingual-to-schema.json\" that when posted to schema API would add in all the relevant fieldTypes and dynamic fields given a _default configset. ",
            "author": "Jan Høydahl",
            "id": "comment-16078382"
        }
    ]
}