{
    "id": "SOLR-7909",
    "title": "ZK ACL credential provider cannot be set from JVM params as documented",
    "details": {
        "components": [
            "security"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.5"
        ],
        "affect_versions": "5.2.1",
        "status": "Resolved",
        "resolution": "Cannot Reproduce",
        "priority": "Major"
    },
    "description": "In RefGuide https://cwiki.apache.org/confluence/display/solr/ZooKeeper+Access+Control you are told to setup ZK security provider classes with system properties, but as noted in the comments to that page, that no longer works, and you need to set these in solr.xml.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-11T07:30:13+0000",
            "author": "Jan Høydahl",
            "content": "I see that ZkACLProvider is created both in ZkController (from solr.xml config only) and in SolrZkClient (from System props only), and when created in ZkController.java the instance is passed to SolrZkClient's constructor.\n\nFix is probably to make a single factory class or method for ZkACLProvider which takes both sysprop name and class name from solr.xml as input and creates the correct provider, with sysprop having priority. ",
            "id": "comment-14681367"
        },
        {
            "date": "2015-08-11T08:24:04+0000",
            "author": "Jan Høydahl",
            "content": "Changing from blocker to major, since the bug has existed for several releases and we have a known workaround. Leaving this open so we can fix refguide. ",
            "id": "comment-14681424"
        },
        {
            "date": "2015-08-11T09:03:26+0000",
            "author": "Jan Høydahl",
            "content": "Fixed reference guide to require configuration in solr.xml for providers instead of through sysprops. Leaving open to fix the code to also accept sysprops for 5.4 release. ",
            "id": "comment-14681474"
        },
        {
            "date": "2018-09-17T11:29:56+0000",
            "author": "Jan Høydahl",
            "content": "Anyone know if this now works? I will try to test ",
            "id": "comment-16617394"
        },
        {
            "date": "2018-09-17T12:22:11+0000",
            "author": "Jan Høydahl",
            "content": "This now works, so it must have been fixed sometime since 5.5 ",
            "id": "comment-16617433"
        }
    ]
}