{
    "id": "SOLR-636",
    "title": "admin page schema link fails for example multicore config",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "If I try to view the schema.xml for a single core, using the gui link:\n\nhttp://localhost:8983/solr/core1/admin/file/?file=schema.xml\n\nI get instead:\n\nHTTP ERROR: 404\n\nNOT_FOUND\n\nRequestURI=/solr/admin/file/\n\nPowered by Jetty://",
    "attachments": {
        "SOLR-636.patch": "https://issues.apache.org/jira/secure/attachment/12386258/SOLR-636.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Lars Kotthoff",
            "id": "comment-12614208",
            "date": "2008-07-17T03:05:02+0000",
            "content": "This occurs because the ShowFileRequestHandler isn't enabled by default in the multicore example configurations (showing the config fails in the same way).\n\nI'm attaching a patch which changes the multicore example configurations to enable all admin handlers through AdminHandlers. The patch also removes some parameters from the <admin> configuration element which appear to be used only in deprecated stuff.\n\nThe patch furthermore changes index.jsp to check for the existence of the ShowFileRequestHandler or the all-in-one AdminHandlers before displaying the links to get schema and config. Also the deprecated getSchemaFile()/getConfigFile() methods are changed to getSchemaResource()/getConfigResource().\n\nI've done a quick search for more solrconfig.xml with deprecated stuff in them and updated the ones in solr-ruby, but not the ones used in various tests. This should probably be a separate issue? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12614360",
            "date": "2008-07-17T14:30:41+0000",
            "content": "The root issue here is SOLR-493 ... those configs should work, with those legacy <admin> blocks.  the links need to exist on the admin page (and work) even if the ShowFileHandler isn't explicitly registered in order to be backwards compatible. \n\nThat said: it probably makes still makes sense to changes the multicore configs to make them more \"modern\" but we should try to keep them as simple as possible . "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12615553",
            "date": "2008-07-22T08:40:03+0000",
            "content": "Attaching new patch which doesn't check for the existence of the handler anymore before displaying the file download links.\n\nThe changes to the various solrconfig.xml files are mostly deletions, so I think I can safely say that this makes them simpler  "
        },
        {
            "author": "Lars Kotthoff",
            "id": "comment-12615880",
            "date": "2008-07-23T04:37:04+0000",
            "content": "Some other changes sneaked into the last patch, attaching corrected version. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12620341",
            "date": "2008-08-06T17:44:08+0000",
            "content": "Should this go into 1.3?\n(don't use multicore at the moment, so not sure how big of a problem this is) "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12620426",
            "date": "2008-08-06T21:17:09+0000",
            "content": "Committed revision 683415. \n\n...made a small tweak to index.jsp to better deal with getSchemaResource() or getConfigResource() being null (which can happen if the Configs are loaded dynamicly from an InputStream instead of a filename) "
        }
    ]
}