{
    "id": "SOLR-2911",
    "title": "Add news to website for David and Eric's latest book, AS3ESS",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "David (me) and Eric's latest book, \"Apache Solr 3 Enterprise Search Server\", was just published by Packt.  http://www.packtpub.com/apache-solr-3-enterprise-search-server/book  I'd like to get Solr's website updated very soon.  Once it is updated, the publisher will send the Apache Software Foundation 5% of revenue.\n\nI will attach a patch soon.  I must profess that I didn't run Apache Forest to verify the result, since I don't have access to JDK 1.5 and I have high confidence I got it right.  I would appreciate a committer doing a basic eyeball test of the results on the site, and clicking a few of the links.  One thing I hope happens is that the book image should appear at the top-left to replace the first edition. Strangely I don't see \"Solr 3.1 Cookbook\" right below it as I would expect, after looking at the xml I had to modify in my patch. I don't know why.",
    "attachments": {
        "as3ess_book.jpg": "https://issues.apache.org/jira/secure/attachment/12504805/as3ess_book.jpg",
        "solr_website.patch": "https://issues.apache.org/jira/secure/attachment/12504804/solr_website.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13155457",
            "date": "2011-11-22T21:38:59+0000",
            "content": "FYI the attached image goes in: solr/site-src/src/documentation/content/xdocs/images/ "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13155806",
            "date": "2011-11-23T10:59:52+0000",
            "content": "I committed this to trunk & 3x. I just wanted to mention that the donation from the publisher is totally unrelated to this patch to prevent any kind of future confusion.  Lemme figure out how to push this live  "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13155837",
            "date": "2011-11-23T12:48:58+0000",
            "content": "website is updated and published "
        },
        {
            "author": "David Smiley",
            "id": "comment-13155920",
            "date": "2011-11-23T15:30:47+0000",
            "content": "Thanks Simon!\nI know the Solr 3.5 release will be out any day now and you will of course update the website with the news for that.  A trivial error in my news is the last sentence which has \"atthe authors' site\" (without a space after \"at\"). If you remember to fix this trivial thing then great, if not then no biggie.\nThanks again. "
        },
        {
            "author": "Simon Willnauer",
            "id": "comment-13157618",
            "date": "2011-11-26T22:18:26+0000",
            "content": "which has \"atthe authors' site\" (without a space after \"at\").\nthis should be fixed now... just waiting for the website to be updated... "
        }
    ]
}