{
    "id": "SOLR-10202",
    "title": "Auto resolve urlScheme, remove cluster property",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Spinoff from SOLR-9640.\n\nToday we need to explicitly set urlScheme cluster property to enable SSL, at the same time as we need to set all the SSL env variables on each node. As discussed in SOLR-9640, we could be smarter about this so an admin only need to setup solr.in.sh with keystore to enable SSL.\n\nHow\nPerhaps simplified a bit, but in principle, at node start, if solr.jetty.keystore (one out of several possiilities) is defined then use https, else http  Then, if the administrator has mixed it up and failed to configure solr.jetty.keystore on one of the nodes, then that node will not be able to communicate with the others over http, it will get curl: (52) Empty reply from server. Opposite, an SSL enabled node trying to talk to a Solr node that is not SSL enabled over https, will get curl: (35) Unknown SSL protocol error in connection to localhost:-9847 (not the curl error of course, but similar).\n\nI don't think the nodes need to tell ZK about SSL at all?\n\nSo my claim is that this will not give bigger risk of misconfiguration, cause if you add a new node to the cluster without SSL, it will generate a lot of BUZZ in the logs and it will never receive any unencrypted data from the other nodes since connections will fail. Agree?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-08-08T12:22:49+0000",
            "content": "Trying to revive and move on old issues I once filed...\n\nPlease shoot down this suggestion of mine to simplify SSL setup if you find that it is somehow flawed. ",
            "author": "Jan Høydahl",
            "id": "comment-16573138"
        }
    ]
}