{
    "id": "SOLR-4112",
    "title": "Dataimporting with SolrCloud Fails",
    "details": {
        "affect_versions": "6.0",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Blocker",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "While trying to import data from db on cloud, it shows this in logs:\n\nSEVERE: Full Import failed:org.apache.solr.handler.dataimport.DataImportHandlerException: Unable to PropertyWriter implementation:ZKPropertiesWriter \n        at org.apache.solr.handler.dataimport.DataImporter.createPropertyWriter(DataImporter.java:336) \n        at org.apache.solr.handler.dataimport.DataImporter.doFullImport(DataImporter.java:418) \n        at org.apache.solr.handler.dataimport.DataImporter.runCmd(DataImporter.java:487) \n        at org.apache.solr.handler.dataimport.DataImporter$1.run(DataImporter.java:468) \nCaused by: org.apache.solr.common.cloud.ZooKeeperException: ZkSolrResourceLoader does not support getConfigDir() - likely, what you are trying to do is not supported in ZooKeeper mode \n        at org.apache.solr.cloud.ZkSolrResourceLoader.getConfigDir(ZkSolrResourceLoader.java:100) \n        at org.apache.solr.handler.dataimport.SimplePropertiesWriter.init(SimplePropertiesWriter.java:91) \n        at org.apache.solr.handler.dataimport.ZKPropertiesWriter.init(ZKPropertiesWriter.java:45) \n        at org.apache.solr.handler.dataimport.DataImporter.createPropertyWriter(DataImporter.java:334) \n        ... 3 more \n\nException in thread \"Thread-306\" java.lang.NullPointerException \n        at org.apache.solr.handler.dataimport.DataImporter.doFullImport(DataImporter.java:427) \n        at org.apache.solr.handler.dataimport.DataImporter.runCmd(DataImporter.java:487) \n        at org.apache.solr.handler.dataimport.DataImporter$1.run(DataImporter.java:468)",
    "attachments": {
        "SOLR-4112.patch": "https://issues.apache.org/jira/secure/attachment/12554871/SOLR-4112.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "James Dyer",
            "id": "comment-13503859",
            "date": "2012-11-26T16:10:12+0000",
            "content": "Please try the attached patch and let me know if this fixes your issue.  This may have been broken with SOLR-4051 (Trunk r1408873).  You might also want to try Trunk prior to this r1408873 and verify it works there.\n\nUnfortunately I am behind the times and do not know much about solrcloud.  Perhaps Sami can help out?  \n\nEventually I would also like to figure out how to write a good test for ZKPropertiesWriter.  I think it has no coverage and thus easily broken. "
        },
        {
            "author": "Deniz Durmus",
            "id": "comment-13504279",
            "date": "2012-11-27T01:00:10+0000",
            "content": "As a feedback, would like to say that the patch that James Dyer prepared seems to solve the exceptions  "
        },
        {
            "author": "James Dyer",
            "id": "comment-13505762",
            "date": "2012-11-28T18:37:14+0000",
            "content": "It looks like all we need for this now is a unit test for ZKPropertiesWriter, which I do not think has any test coverage?  (After breaking a bunch of things in the DIH included with Solr 3.6, I'm really trying to improve the test situation with DIH.  But I don't know how to write a good test for SolrCloud stuff...) "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13505774",
            "date": "2012-11-28T18:51:22+0000",
            "content": "don't know how to write a good test for SolrCloud stuff\n\nAnd I don't know DIH at all - but perhaps I can setup some base test class for you to build on. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13532471",
            "date": "2012-12-14T17:24:06+0000",
            "content": "I've been working with a client that has this exact problem, and this patch cures it on last night's 4x code. If I get the time this weekend, I'd like to \n1> try it on trunk\n2> make sure all tests work in both\n3> commit it to both trunk and 4x.\n\nOther then the perennial \"make some tests too\", any objections?\n\nJames:\n\nSince I have the driving need, should I just assign this to myself? "
        },
        {
            "author": "James Dyer",
            "id": "comment-13532498",
            "date": "2012-12-14T17:57:32+0000",
            "content": "Erick,  I certainly mean for this to be committed prior to a 4.1 (possibly it should be a Blocker), and if you want to commit, then go ahead.  My only concern is that if it gets committed without test coverage that a new issue be opened to add a test later.  \n\nI'm tired of breaking DIH every time I commit a change because the test coverage was inadequate and I was lulled into a false sense of security by \"All Tests Pass\".  ZKPropertiesWriter is a case in point.  This was committed back in February with no test coverage and then I come along and break it in November.  I've been trying lately to write better tests for DIH but if people's attitude is \"DIH is a low-quality contrib mod...I don't need to write a test\", then what's the point?  (we all have stories about working with developers who created \"negative productivity\".  I'm trying to personally stay out of anyone's story like that here!)  Then again my concern about coverage shouldn't hold this hostage so it misses the next release.\n\nI also wonder if SOLR-3911 means changing how ZKPropertiesWriter works entirely, or if it is even necessary at all?  I don't know enough about SolrCloud (yet...its on my to-do list) to understand how SOLR-3911 might change what needs to be done here, but maybe there is a different, better approach now?\n\nMark,  you said something about setting up a base test class to build on, but I was just looking at AbstrackDistribZKTestCase and isn't such a base class already there?  Isn't all we need to do is to set up a 1-node, 1-shard \"cluster\" and have it import 1 document then open the Properties file with ZKPropertiesWriter and see if it exists and can be read?  Someday we can get fancy and expand TestSqlEntityProcessorDelta to sometimes run in full distributed mode but for now something quick and simple would suffice, right? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13532530",
            "date": "2012-12-14T18:34:09+0000",
            "content": "Yup, we already have some base classes that I would use to build on. I would just help get it setup to run from the DIH module and offer any help around getting DIH configured and running with it. If you can easily just figure that out, then by all means, go on ahead. If you have any questions, let me know. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13533375",
            "date": "2012-12-16T12:51:51+0000",
            "content": "Making this a blocker so we are sure to deal with it before 4.1 is cut. I won't have time to deal until next week and don't want to forget it. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13539270",
            "date": "2012-12-24T13:30:55+0000",
            "content": "I'm going to go ahead and commit this in a day or two unless someone objects. If I do before some angel creates tests, I'll open up a new JIRA for tests referring back to this one. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13541364",
            "date": "2012-12-31T13:12:55+0000",
            "content": "I really want to insure that this gets into 4.1, or explicitly decide not to as part of the release process... so moving back to blocker. If nothing else, we can commit w/o tests. Honest, I spent some time trying to make some tests, but between not knowing much about either ZK or DIH tests, I got pretty lost..... "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13541372",
            "date": "2012-12-31T13:54:46+0000",
            "content": "I can take this up and write some tests. Will make sure that it goes into 4.1 "
        },
        {
            "author": "Sauvik Sarkar",
            "id": "comment-13542634",
            "date": "2013-01-03T01:04:47+0000",
            "content": "We are stuck with this issue after we upgraded from 4.0 to 4.1 Please let me know when will this be committed. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13551093",
            "date": "2013-01-11T13:03:36+0000",
            "content": "Added a test which uses DIH on a ZK Aware solr "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13551095",
            "date": "2013-01-11T13:07:08+0000",
            "content": "Shalin:\n\nThanks! Since you did the hard part, want me to check it in? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13551115",
            "date": "2013-01-11T13:25:23+0000",
            "content": "I'm about to do just that. I was waiting for the whole suite run to finish  "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13551120",
            "date": "2013-01-11T13:31:47+0000",
            "content": "Two minor nits then....\n\nTestZKPropertiesWriter.java has an uncommented \"System.out.println\" in it, probably want to take that out/comment?\n\nCHANGES.txt could use an entry.....\n\nFWIW,\nErick "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13551124",
            "date": "2013-01-11T13:41:58+0000",
            "content": "Oops, I committed it already with a change log entry in both trunk and branch_4x. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13551155",
            "date": "2013-01-11T15:04:40+0000",
            "content": "Fixed in trunk and branch_4x.\n\nThanks for taking care of the extra sysout line Erick. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610419",
            "date": "2013-03-22T16:02:25+0000",
            "content": "[branch_4x commit] Shalin Shekhar Mangar\nhttp://svn.apache.org/viewvc?view=revision&revision=1432048\n\nSOLR-4112: Fixed DataImportHandler ZKAwarePropertiesWriter implementation so import works fine with SolrCloud clusters "
        }
    ]
}