{
    "id": "SOLR-6719",
    "title": "Collection API: CREATE ignores 'property.name' when creating individual cores",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Yashveer Rana pointed this out in the ref guide comments...\n\nhttps://cwiki.apache.org/confluence/display/solr/Collections+API?focusedCommentId=47382851#comment-47382851\n\n\n\tCollection CREATE is documented to support \"property.name=value\" (where 'name' and 'property' are italics placeholders for user supplied key=val) as \"Set core property name to value. See core.properties file contents.\"\n\tThe docs for core.properties include a list of supported property values, including \"name\" (literal) as \"The name of the SolrCore. You'll use this name to reference the SolrCore when running commands with the CoreAdminHandler.\"\n\n\n\nFrom these docs, it's reasonable to assume that using a URL like this...\n\nhttp://localhost:8983/solr/admin/collections?action=CREATE&name=my_collection&numShards=2&configSet=data_driven_schema_configs&property.name=my_corename\n\n...should cause \"my_collection\" to be created, with the core name used for every replica being \"my_corename\" ... but that doesn't happen.  instead the replicas get core names like \"my_collection_shard1_replica1\"\n\n\n\nThis is either a bug, or (my suspicion) it's intentional that the user specific core name is not being used – if it's intentional, then the Collection CREATE command should fail with a clear error if a user does try to use \"property.name\" rather then silently ignoring it and the Collection CREATE docs should be updated to make it clear that \"name\" is an exception to the general property.foo -> foo in core.properties support.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-11-08T00:11:31+0000",
            "author": "Erick Erickson",
            "content": "I'd be a scared to actually name cores according to property.name. Unless it was something like\nmy_corename_shard1_replica1, i.e. just substituting \"my_corename\" for the name parameter to CREATE.\n\nIf we just used \"my_corename\", how would we distinguish between two different shards hosted in the same\nSolr instance? Or even two replicas of the same core? Or am I missing something?\n\nAll of which says that I'd favor option 2; change the docs.\n\nFWIW ",
            "id": "comment-14202985"
        },
        {
            "date": "2014-11-08T09:39:38+0000",
            "author": "Anshum Gupta",
            "content": "I think SOLR-5922 should fix this. I'm looking at that and shall commit it over the weekend. ",
            "id": "comment-14203339"
        },
        {
            "date": "2014-11-08T15:54:50+0000",
            "author": "Erick Erickson",
            "content": "Anshum Gupta I took a quick glance at SOLR-5922 and I don't see the relevance. How would that JIRA affect the functionality of the API call on the server?\n\nIf I'm reading it right, SOLR-5922 is providing a way for SolrJ to emit the call, which would do the same thing as issuing the command through cURL or the like, whereas this JIRA is about the behavior (or documentation) on Solr. ",
            "id": "comment-14203476"
        },
        {
            "date": "2014-11-08T22:10:56+0000",
            "author": "Anshum Gupta",
            "content": "Erick Erickson I think it's related but not in the way that I mentioned.\n\nAlso, you're right, this issue is about what 'Solr' does and the other one is about SolrJ actually creating/sending that call out. So yes, ignore the noise from my previous comment !  ",
            "id": "comment-14203635"
        },
        {
            "date": "2014-12-18T21:34:00+0000",
            "author": "Martin Grotzke",
            "content": "We experienced the same with ADDREPLICA and property.solr.common.data.dir (running Solr 4.10.2). ",
            "id": "comment-14252317"
        }
    ]
}