{
    "id": "SOLR-3808",
    "title": "Extraction contrib to utilize Boilerpipe",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "6.0"
        ],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Solr's extraction contrib uses Tika for document parsing and should be able te use Boilerpipe. Tika comes with Boilerpipe, a library capable of removing boilerplate text from HTML pages.",
    "attachments": {
        "SOLR-3808-trunk-1.patch": "https://issues.apache.org/jira/secure/attachment/12544195/SOLR-3808-trunk-1.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Markus Jelsma",
            "id": "comment-13450501",
            "date": "2012-09-07T10:02:18+0000",
            "content": "Here's a patch for trunk. It introduces the boilerpipe parameter which takes a names Boilerpipe extractor such as ArticleExtractor, CanolaExtractor or KeepEverythingExtractor.\n\nIt also comes with a unit test. The test HTML file's extracted content will not contain the word `footer` if the ArticleExtractor is used. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13455406",
            "date": "2012-09-13T23:01:01+0000",
            "content": "Markus: thanks for the patch and test!\n\nThis looks cool, but i'm not overly familiar with ExtractingRequestHandler so i'm not really comfortable commiting just yet because it's not clear to me if this kind of explicit registering of extractors based on specal params is really the direction we should go – it seems like a slipper slope in deciding what should be included and what shouldn't (and from what i understand i believe there are other ways to use tika configuration files to control this sort of thing, aren't there?\n\nFor now i'm going to remove the fixVersion=4.0 since this is a new feature and probably shouldn't impeed momentum towards the (hopefully) rapidly approaching release.\n\n(of course: if someone with more expertise then me what's to jump on it and commit it they totally should) "
        },
        {
            "author": "Markus Jelsma",
            "id": "comment-13455680",
            "date": "2012-09-14T09:03:45+0000",
            "content": "Hi - in Apache Nutch i keep the loaded extractors in a static hashmap<name, impl>. The content handlers have to be wrapped like this and the extractor implementation has to be passed to the BoilerpipeContentHandler constructor, it doesn't use configuration to find an extractor. "
        },
        {
            "author": "Arcadius Ahouansou",
            "id": "comment-13558147",
            "date": "2013-01-20T02:11:28+0000",
            "content": "This is related to SOLR-2250 "
        }
    ]
}