{
    "id": "SOLR-10591",
    "title": "Backup and Restore Solr Index based on Time",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "Backup/Restore"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "5.0",
        "resolution": "Invalid",
        "status": "Closed"
    },
    "description": "Hi,\n\nI am fairly new to Solr world, had an requirement regarding Backup/Solr data -\n\n Requirement -\nCurrently we are Indexing Metadatasin Solr which has been for around year. \n\nWe want to take a backup of data on Month to Month basis and restore the same when required. i.e. say - take back up of March data alone and restore the same back in the month of May.\n\nTried till now –\nI was able to take back up of Complete Index and restore the same back as new Index.\n\nBut unable to merge it with Current latest Index. Is this doable?\nCan  I take Partial data Backup and Restore the same to the current Index.?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-01T20:43:32+0000",
            "content": "I have not actually used the backup feature, but I would be VERY surprised if a \"merge\" was possible.  Pretty sure that restoring an index will make the index identical to the backup, because I think it's a file level operation.  Merging the indexes would require document level operations. ",
            "author": "Shawn Heisey",
            "id": "comment-15991501"
        },
        {
            "date": "2017-05-01T20:50:04+0000",
            "content": "Please raise issues like this on the user's list. If it's determined that it is a code issue or would be a good (and possible) improvement, then raise a JIRA. ",
            "author": "Erick Erickson",
            "id": "comment-15991510"
        },
        {
            "date": "2017-05-02T02:18:19+0000",
            "content": "@Shawn,\nWhen we restored the Index it was identical to backup.It did not merge.\nThat was my Question is it possible to Merge Runtime based on the document Indexed time?\n\n@Eric -\nNeed to understand the functionality. Hence raised the question here. \nIf it is not possible, is it doable? Or considered?\n\nRegards,\nAvinash ",
            "author": "Avinash Gaddam",
            "id": "comment-15992009"
        },
        {
            "date": "2017-05-02T12:46:33+0000",
            "content": "Your initial description on this issue isn't a problem report, it's a request for help.  That is not what this issue tracker is for.\n\nThis issue tracker is for keeping track of bugs and enhancement requests, and we very much prefer that any problems are discussed on the mailing list or in the IRC channel before they are reported here, so we can be sure that what's happening is not a configuration error and actually needs to be reported here.\n\nIf you are positive that you have encountered a bug, and have strong evidence to back that claim up, then starting with the issue tracker instead of the mailing list would be appropriate, though discussing the problem before opening an issue is still preferred.\n\nWhat you want to do is not possible.  The backup/restore capability will NOT merge indexes.\n\nErick already resolved the issue as Invalid, which is the correct action, because this issue is not a valid use of the tracker.  I am closing it.  If you want to learn what IS possible, please use the mailing list or IRC channel to discuss it.\n\nhttps://lucene.apache.org/solr/community.html ",
            "author": "Shawn Heisey",
            "id": "comment-15992831"
        }
    ]
}