{
    "id": "SOLR-949",
    "title": "Add QueryResponse and SolrQuery support for TermVectorComponent",
    "details": {
        "affect_versions": "None",
        "status": "Patch Available",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "In a similar fashion to Facet information, it would be nice to have support for easily setting TermVector related parameters through SolrQuery, and it would be nice to have methods in QueryResponse to easily retrieve TermVector information",
    "attachments": {
        "SOLR-949.patch": "https://issues.apache.org/jira/secure/attachment/12397188/SOLR-949.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Aleksander M. Stensby",
            "id": "comment-12661090",
            "date": "2009-01-06T09:47:33+0000",
            "content": "This patch includes support for specifying what term vector information we want to retrieve (tf, df, tf_idf, positions, offsets, all) and specifying term vector fields. A new class called TermVectorInfo is added, containing the returned TermVector information (returned in QueryResponse).  (Not really sure if this is a good name, so feel free to change or give feedback.) The patch also includes a test in SolrQuery for setting/getting parameters, and a test in SolrExampleTests for testing the SolrResponse. One note: I intended to use TermVectorComponent.COMPONENT_NAME in SolrQuery, but ant would not compile because it complained about not being able to find the package:\n package org.apache.solr.handler.component does not exist\nSo temporarily until i figure out why this happens i use \"tv\" for now.. Sorry about that.\nI hope my code makes sense and that it might be useful for others. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12662331",
            "date": "2009-01-09T11:32:10+0000",
            "content": "One note: I intended to use TermVectorComponent.COMPONENT_NAME in SolrQuery, but ant would not compile because it complained about not being able to find the package: package org.apache.solr.handler.component does not exist\n\nThe Solrj client is compiled separately from the core solr source to avoid any dependency to the (large) core jar. The package you wanted to use is not in solrj's compile classpath. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13061437",
            "date": "2011-07-07T16:49:03+0000",
            "content": "It would be easier for a committer to digest this patch if you didn't do any reformatting of existing code. "
        },
        {
            "author": "Łukasz Dróżdż",
            "id": "comment-14601400",
            "date": "2015-06-25T15:46:56+0000",
            "content": "I've attached Aleksander's patch with fixed formatting and adapted to compile and test against latest trunk (rev. 1687524). "
        },
        {
            "author": "Lucene/Solr QA",
            "id": "comment-16425291",
            "date": "2018-04-04T10:16:13+0000",
            "content": "\n\n\n  -1 overall \n\n\n\n\n\n\n\n\n\n Vote \n Subsystem \n Runtime \n Comment \n\n\n -1 \n  patch  \n   0m  5s \n  SOLR-949 does not apply to master. Rebase required? Wrong Branch? See https://wiki.apache.org/solr/HowToContribute#Creating_the_patch_file for help.  \n\n\n\n\n\n\n\n\n\n Subsystem \n Report/Notes \n\n\n JIRA Issue \n SOLR-949 \n\n\n JIRA Patch URL \n https://issues.apache.org/jira/secure/attachment/12741883/SOLR-949.patch \n\n\n Console output \n https://builds.apache.org/job/PreCommit-SOLR-Build/35/console \n\n\n Powered by \n Apache Yetus 0.7.0   http://yetus.apache.org \n\n\n\n\n\n\nThis message was automatically generated.\n "
        }
    ]
}