{
    "id": "SOLR-6819",
    "title": "Being able to configure the updates log implementation from solrconfig.xml",
    "details": {
        "components": [
            "SolrCloud",
            "update"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0",
        "status": "Resolved",
        "resolution": "Implemented",
        "priority": "Major"
    },
    "description": "CDCR requires its own implementation of the updates log. At the moment, there is no way to configure the class to use when instantiating the updates log. The UpdateHandler is deciding to instantiate the base class UpdateLog or its hdfs version HdfsUpdateLog based on the directory path prefix.\nWe can extend the UpdateHandler to allow for a class parameter to be defined for the updateLog section of the solrconfig.xml. For example, the relevant part of the solrconfig,xml will look like:\n\n  <updateHandler class=\"solr.DirectUpdateHandler2\">\n    <updateLog class=\"solr.CdcrUpdateLog\">\n      <str name=\"dir\">${solr.ulog.dir:}</str>\n    </updateLog>\n  </updateHandler>\n\n \nwhere the updateLog entry has a parameter class that indicates that the CdcrUpdateLog implementation must be used.",
    "attachments": {
        "SOLR-6819.patch": "https://issues.apache.org/jira/secure/attachment/12685114/SOLR-6819.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-12-04T14:39:01+0000",
            "author": "Renaud Delbru",
            "content": "The patch implementing the extension to configure the class of the updates log. This makes also the update log initialisation part of the UpdateHandler more cleaner. Specific instructions for the configuration of the HdfsUpdateLog has been moved withing HdfsUpdateLog itself. ",
            "id": "comment-14234241"
        },
        {
            "date": "2014-12-10T18:44:05+0000",
            "author": "Renaud Delbru",
            "content": "A new patch that reverts the original behavior of the update handler regarding the hdfs update log instantiation, in order to avoid back compatibility problem. ",
            "id": "comment-14241518"
        },
        {
            "date": "2016-08-05T20:49:47+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "I think this is already implemented? Can this issue be closed? ",
            "id": "comment-15410043"
        },
        {
            "date": "2016-11-25T15:52:22+0000",
            "author": "Erick Erickson",
            "content": "I checked the code and it's there, so closing. ",
            "id": "comment-15696160"
        },
        {
            "date": "2016-11-25T15:59:03+0000",
            "author": "David Smiley",
            "content": "Does the resolution status of \"Implemented\" supposed to mean Already Implemented?  If so I should use this more often in my JIRA cleanup. ",
            "id": "comment-15696177"
        }
    ]
}