{
    "id": "SOLR-7229",
    "title": "Allow DIH to handle attachments as separate documents",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "With Tika 1.7's RecursiveParserWrapper, it is possible to maintain metadata of individual attachments/embedded documents.  Tika's default handling was to maintain the metadata of the container document and concatenate the contents of all embedded files.  With SOLR-7189, we added the legacy behavior.\n\nIt might be handy, for example, to be able to send an MSG file through DIH and treat the container email as well each attachment as separate (child?) documents, or send a zip of jpeg files and correctly index the geo locations for each image file.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-11T03:01:02+0000",
            "author": "Tim Allison",
            "content": "David Smiley, do you happen to know off hand if DIH indexes lat/longs from metadata extracted by Tika?  If not, that might be a separate issue.  We'll want that capability to test this one. ",
            "id": "comment-14356141"
        },
        {
            "date": "2015-03-11T03:21:53+0000",
            "author": "David Smiley",
            "content": "There isn't spatial specific stuff in the DIH, and I don't think there needs to be if we're talking Lat-Lon data.  Simply concatenate \"lat,lon\" into one string and it'll be handled by the field type appropriately (be it LatLonType, or RPT). ",
            "id": "comment-14356168"
        },
        {
            "date": "2015-03-11T11:07:46+0000",
            "author": "Tim Allison",
            "content": "Got it.  To confirm, the idiomatic way to do this would be to configure the TikaEntityProcessor to create fields for latitude and longitude and then apply a combination of CloneFieldUpdateProcessorFactory and ConcatFieldUpdateProcessorFactory to do the concatenation?  Is there a way to configure the concatenation without creating separate latitude and longitude fields?  ",
            "id": "comment-14356721"
        },
        {
            "date": "2015-03-11T11:37:36+0000",
            "author": "Alexandre Rafalovitch",
            "content": "If you know they are lat/longs from the metadata type, can't the code just put them into one field straight away? Why both with custom chains. ",
            "id": "comment-14356752"
        },
        {
            "date": "2015-03-11T11:39:17+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Regarding the implementation, I think the parser should serve as a source for inner entity. Maybe have a flag on parent to pass-down or not pass-down parent's metadata in. Or pass it down but with a consistent prefix, so it could always be filtered out. ",
            "id": "comment-14356755"
        },
        {
            "date": "2015-03-11T12:28:55+0000",
            "author": "Tim Allison",
            "content": "Y, that's what I was getting at, and that was the answer I was hoping for.  Apologies, I'm still trying to learn the preferences for the boundary between custom hard coding and configuration over here.  I'll open another issue to add that (SOLR-7231)\n\nAnd, on another note, I just noticed that the code that adds metadata is just pulling the first value; in short, if there is a multivalued Solr field, and there's more than one metadata value in the metadata object, the values after the first are being ignored.  Looks like another issue.  (SOLR-7232) ",
            "id": "comment-14356812"
        },
        {
            "date": "2016-10-03T12:29:25+0000",
            "author": "Tim Allison",
            "content": "Let me know how I can help. ",
            "id": "comment-15542313"
        },
        {
            "date": "2016-10-03T15:27:51+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I haven't started working on this yet. Just assigned it to myself to ensure it is not lost. If you have any additional thoughts or implementation ideas, feel free to contribute. ",
            "id": "comment-15542670"
        }
    ]
}