{
    "id": "SOLR-10346",
    "title": "Clean up static page HTML top nav",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Sub-task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "For demo purposes, the top navigation bar for the HTML version of the Ref Guide includes some stuff we probably don't want in production. This should be cleaned up and finalized.\n\nI'll attach a screenshot of the current nav for reference. It currently has these sections:\n\n\n\tHome link. This should be made dynamic to update automatically for each version the Guide applies to\n\tNews. Probably don't need this? Today it goes nowhere, but it could go to the News section of the Solr website.\n\tJekyll Resources. Links to stuff about Jekyll. We don't want this.\n\tSolr Resources. Links to Javadocs, Source code and Community page of Solr website. Javadoc links should be dynamic.\n\tFeedback. Javascript to open local Mail application to send an email. Currently goes to my apache.org address, which I don't want.\n\tSearch box. This can stay, and we can modify it to do whatever we want it to do when SOLR-10299 is resolved.",
    "attachments": {
        "SRG-top-nav-20170322.png": "https://issues.apache.org/jira/secure/attachment/12859985/SRG-top-nav-20170322.png",
        "SRG-topnav-20170330.png": "https://issues.apache.org/jira/secure/attachment/12861324/SRG-topnav-20170330.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-22T20:27:54+0000",
            "content": "Home link. This should be made dynamic to update automatically for each version the Guide applies to\n\nthe link text already pulls in the version# from a site variable, and now that i've committed SOLR-10342 that will match the common-build.xml specified version.\n\nSolr Resources. Links to Javadocs, Source code and Community page of Solr website. Javadoc links should be dynamic.\n\nThis is currently a little tricky – while the \"home\" link text is part of the topnav.html template (and can refer to site variables) the template then loops over entries in topnav.yml for the other various links – and there's no way (that i know of) to have entries in topnav.yml refer to site variables.\n\nthe 2 solutions i can think of:\n\n\n\tremove topnav.yml and hardcode the html we want in topnav.html – using the existing jekyll site variable for the javadocs URL\n\trename topnav.yml to topnav.yml.template and let the existing build.xml logic do variable substitution using ant properties (this build.xml logic already exists so we can use ant variables in  _config.yml.template)\n\n ",
            "author": "Hoss Man",
            "id": "comment-15937063"
        },
        {
            "date": "2017-03-30T20:11:19+0000",
            "content": "I just committed some changes that remove topnav.yml and hardcoded the html into topnav.html. This makes it easy to use the site.solr-attributes.solr-javadocs variable in the liquid template and considering how little we need to put there that seemed easiest. The YAML data model really works best when you want the same look & feel with a different menu, and that's not the case here.\n\nI also hard-coded the \"News\" link to go to the Solr website's News page, and changed what users see to \"Solr News\".\n\nI modified _config.yml.template to disable feedback (feedback_disable: true. I couldn't really think of where we'd want email to go, and they will be able to comment on the pages. I have not yet removed the feedback.html file, however, in case anyone disagrees.\n\nOh, and I removed the \"Jekyll Resources\" stuff entirely. \n\nThe commit is: https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=3b592f1be5f803c33fc170f6bf54b78e0597bef3 ",
            "author": "Cassandra Targett",
            "id": "comment-15949724"
        },
        {
            "date": "2017-03-30T20:12:53+0000",
            "content": "Added a new screenshot showing what the nav looks like after my latest changes. ",
            "author": "Cassandra Targett",
            "id": "comment-15949725"
        },
        {
            "date": "2017-04-05T20:46:47+0000",
            "content": "I'm going to call this resolved, and if other ideas for what the top nav should look like are proposed, we'll address them in a new issue. ",
            "author": "Cassandra Targett",
            "id": "comment-15957634"
        }
    ]
}