{
    "id": "SOLR-8435",
    "title": "Long update times Solr 5.3.1",
    "details": {
        "components": [
            "update"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.2.1"
        ],
        "affect_versions": "5.3.1",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "We have 2 128GB ubuntu servers in solr cloud config. We update by curling json files of 20,000 documents. In 5.2.1 this consistently takes between 19 and 24 seconds. In 5.3.1 most times this takes 20s but in about 20% of the files this takes much longer: up to 500s! Which files seems to be quite random. Is this a known bug? any workaround? fixed in 5.4?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-17T16:13:06+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "There could be several reasons. Maybe some GC pauses are observed at that moment?\nAre both the two setups, for 5.2.1 and 5.3.1, absolutely same?\n\nAlso, I think such questions are better answered at the solr-users list. ",
            "id": "comment-15062250"
        },
        {
            "date": "2015-12-18T07:49:45+0000",
            "author": "Kenny Knecht",
            "content": "Thanks for the swift reply.\nThese setups were exactly the same, yes. In both cases we started from a fresh setup at aws (2 instances of r3.4xlarge) an empty core, sharded over two machine. 3 separate ZK machines.\nSo that is why I have posted this as a bug. Beginning 2016 we will do some more testing... ",
            "id": "comment-15063655"
        },
        {
            "date": "2015-12-18T16:13:37+0000",
            "author": "Erick Erickson",
            "content": "Check that you aren't somehow building suggesters on commit. ",
            "id": "comment-15064152"
        },
        {
            "date": "2016-01-05T14:01:50+0000",
            "author": "Kenny Knecht",
            "content": "This issue seemed to be caused by slower disks in our second setup, but the different behaviour between 5.2.1 and 5.3.1 led us to believe this was actually a bug. Sorry for bother you with it! ",
            "id": "comment-15083079"
        }
    ]
}