{
    "id": "SOLR-4157",
    "title": "Add more conventional search functionality to the Admin UI",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "The admin UI has a 'query' pane which allows searching the index. However, this is currently an 'expert' level feature, as you must specify exact request parameters and interpret output XML or JSON. \n\nI suggest we add simple versions of each. A simple query pane would give a more conventional search interface for running queries. A simple results pane would give HTML formatted results with features to nicely display hightlighting, explains, etc.\n\nTo give an idea of what this might look like, I've attached a rudimentary patch that gives an HTML option for wt which formats the query results as (somewhat minimal) HTML.\n\nThe challenge will be in producing a search interface that is schema agnostic, as to be really useful, it should work with any index, and not just with the fields in the default schema (perhaps Erik Hatcher is right, this should be backed by the velocityResponseWriter).\n\nThoughts welcome.",
    "attachments": {
        "SOLR-4157.patch": "https://issues.apache.org/jira/secure/attachment/12559991/SOLR-4157.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13532545",
            "date": "2012-12-14T18:47:16+0000",
            "content": "I have not really look at /browse, so I cannot comment there, but +1 on adding a more conventional search UI option to the admin ui! "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13533429",
            "date": "2012-12-16T16:41:35+0000",
            "content": "OK, I finally got off the road and had a chance to look. Comments:\n\n1> Looks like a really good idea.\n\n2> It'd be really cool to have JSON and XML be formatted in the pane by default, they're ugly as it stands. But only if it's really, really easy.\n\n3> Not quite sure what you mean by using Velocity, this appears to display the fields you ask for as it stands.\n\n4> Long lists overrun the pane in Chrome, assuming it's something you just haven't gotten to yet.\n\n5> I agree that the list of options are kind of intimidating, but I'm not all that concerned with simplifying it. In fact I kind of like the fact that the options are there inviting people to play with them. Let's send them to the browse handler for a more real-life \"user experience\", I think leaving this for mostly expert/debugging is fine.\n\n6> What do you think should be done with debug and facet and highlight info? I'm thinking just a continuation of the pane, really just prettifying the output.\n\nYou code, I'll commit <G>...\n\nErick "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13534038",
            "date": "2012-12-17T16:18:05+0000",
            "content": "It'd be really cool to have JSON and XML be formatted in the pane by default, they're ugly as it stands. But only if it's really, really easy.\n\nWhat about using something like:\n\nhttp://google-code-prettify.googlecode.com/svn/trunk/tests/prettify_test.html#xml\nhttp://google-code-prettify.googlecode.com/svn/trunk/tests/prettify_test.html#javascript "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15388883",
            "date": "2016-07-22T04:19:29+0000",
            "content": "Can we close this? The /browse interface has been around for quite a while now  "
        },
        {
            "author": "Upayavira",
            "id": "comment-15389344",
            "date": "2016-07-22T11:23:24+0000",
            "content": "This was intended to be a new feature, going beyond the /browse interface. I'm not likely to get to it in the forseeable future so reasonable to close it. "
        }
    ]
}