{
    "id": "SOLR-11221",
    "title": "SolrJmxReporter broken on core reload",
    "details": {
        "labels": "",
        "priority": "Critical",
        "components": [
            "metrics"
        ],
        "type": "Bug",
        "fix_versions": [
            "6.6.1",
            "7.0",
            "7.1",
            "master (8.0)"
        ],
        "affect_versions": "6.6,                                            6.7,                                            7.0,                                            master (8.0)",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "SolrJmxReporter uses Dropwizard's JmxReporter, which in turn uses a MetricRegistry listener to report newly added metrics as MBeans, and to unregister them from MBeanServer when the reporter is closed, which happens when core is closed.\n\nThe metrics API keeps around existing metrics in solr.core.* registries to help maintain continuous metrics in presence of core reloads. However, this means that some of these metric instances are not registered anew when a core is reloaded - and for these metrics the listener won't fire, so the MBeans won't be registered.\n\nThis limitation is a result of the use of MetricRegistryListener in JmxReporter and can't be fixed without reimplementing this class. Another possible approach would be to configure the JmxReporter to use a \"mirroring\" registry instead, which will be populated with existing metrics from the original registry (thus generating \"metric added\" events) and then kept in sync with the main registry via a listener.",
    "attachments": {
        "SOLR-11221.patch": "https://issues.apache.org/jira/secure/attachment/12881580/SOLR-11221.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-08-10T19:11:53+0000",
            "content": "Hmm, yet another more serious bug is present: SolrJmxReporterTest.testReloadCore doesn't really test the exact sequence of reporters starting and closing, so it doesn't catch the following problem.\n\nOn reload the old core is closed after the new core has been created - and consequently the old instance of SolrJmxReporter removes the mbeans right after they were registered by a new reporter started by the new core. End result is that only a handful of mbeans related to Searcher are registered, other mbeans are gone.\n\nIn the past JmxMonitoredMap used to track what mbean belongs to what core by adding a \"coreHashCode\" attribute to all DynamicMBean-s, and removing only those with matching coreHashCode attribute. Unfortunately, it's not possible to add additional attributes to MBeans created by Dropwizard's JmxReporter, and on close() it indiscriminately closes all MBeans with known names.\n\nOne possible solution would be to insert reporter's hashCode into the ObjectName hierarchy, but this would make the MBean names variable and unpredictable. Another (more complicated but more elegant) option is to reimplement JmxReporter to re-introduce \"coreHashCode\" attribute. ",
            "author": "Andrzej Bialecki",
            "id": "comment-16122141"
        },
        {
            "date": "2017-08-12T00:11:59+0000",
            "content": "This patch changes SolrJmxReporter so that it uses a modified version of JmxReporter, which adds an \"_instanceTag\" attribute to track what beans it had registered and unregisters only those. In a sense this is the same mechanism that JmxMonitoredMap used, only it was called coreHashCode there (we can call it the same if it gives users a sense of familiarity, but I thought the \"_instanceTag\" name is harder to mistake for a real bean attribute).\n\nThe new unit test passes with this change, while it was failing with the old implementation. Manual testing with JConsole also shows that metrics are now correctly reported in local and cloud mode, and after core and collection reloads.\n\nThis is unfortunately a bigger change than I hoped for, so I'm not sure whether this should go into 7.0 at such late stage in the release. OTOH JMX monitoring is surely broken without this change, so it can't get much worse  ",
            "author": "Andrzej Bialecki",
            "id": "comment-16124322"
        },
        {
            "date": "2017-08-14T10:43:12+0000",
            "content": "Commit 7aa660b747440bfc5beb63051db324db3c5dd761 in lucene-solr's branch refs/heads/master from Andrzej Bialecki \n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7aa660b ]\n\nSOLR-11221: SolrJmxReporter broken on core reload. ",
            "author": "ASF subversion and git services",
            "id": "comment-16125521"
        },
        {
            "date": "2017-08-14T11:10:17+0000",
            "content": "Commit ff8b90b9acb7685a77d3b4af14f18aedb681176f in lucene-solr's branch refs/heads/master from Andrzej Bialecki \n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ff8b90b ]\n\nSOLR-11221: Fix precommit issues. ",
            "author": "ASF subversion and git services",
            "id": "comment-16125547"
        },
        {
            "date": "2017-08-14T11:46:41+0000",
            "content": "Commit 2711dbed8b4b72c37fa929be5167fb6a823c1134 in lucene-solr's branch refs/heads/branch_7x from Andrzej Bialecki \n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2711dbe ]\n\nSOLR-11221: SolrJmxReporter broken on core reload. ",
            "author": "ASF subversion and git services",
            "id": "comment-16125567"
        },
        {
            "date": "2017-08-14T12:26:14+0000",
            "content": "Commit be596b90696b24c4e73e3e1455f1fb95dcc58b0d in lucene-solr's branch refs/heads/branch_7_0 from Andrzej Bialecki \n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=be596b9 ]\n\nSOLR-11221: SolrJmxReporter broken on core reload. ",
            "author": "ASF subversion and git services",
            "id": "comment-16125604"
        },
        {
            "date": "2017-08-14T12:27:16+0000",
            "content": "I'm leaving this issue open for now - let's see if jenkins is happy about this change... ",
            "author": "Andrzej Bialecki",
            "id": "comment-16125606"
        },
        {
            "date": "2017-08-18T21:17:39+0000",
            "content": "Commit 54469c7ca5f639a8120d9e4b9e51c0f82ab57b9b in lucene-solr's branch refs/heads/branch_6_6 from Andrzej Bialecki \n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=54469c7 ]\n\nSOLR-11221: SolrJmxReporter broken on core reload. ",
            "author": "ASF subversion and git services",
            "id": "comment-16133632"
        },
        {
            "date": "2017-10-17T11:03:52+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16207388"
        }
    ]
}