{
    "id": "SOLR-3004",
    "title": "All Solr(Cloud) information in ZK in a dedicated Znode",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "SolrCloud is using ZK for shared information. At the moment is distributes its information over more than one root-Znode (e.g. \"collections\", \"configs\" and \"live-nodes\"). It is not good style to act this way in ZK - pretending that you are the only one using ZK. Suggest we put it all inside one single root-Znode called \"solr\" or \"solrcloud\", so that we will have /solr/collections, /solr/configs and /solr/live-nodes in ZK instead. Believe it is important to do this change before the first \"real\" release including SolrCloud, because it is much easier to do before than after. If we do it after we will probably have to think about upgrade-code to move stuff from the old place to the new place in order to have systems build on the first release without this improvement go nicely to the next release with this improvement.\n\nE.g. I am using Lily and HBase and they nicely put all their information in ZK in designated root-Znodes (\"hbase\" and \"lily\").",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13180503",
            "date": "2012-01-05T16:22:13+0000",
            "content": "we let you use any root node you want - just creates a node for solr, such as /mysolrnode, and then use a zk address of localhost:port/mysolrnode "
        },
        {
            "author": "Per Steffensen",
            "id": "comment-13181173",
            "date": "2012-01-06T07:04:10+0000",
            "content": "OK, didnt know. That will probably do. Maybe this feature should be expressed clearly in documentation/example. Thanks! "
        }
    ]
}