{
    "id": "SOLR-5250",
    "title": "Sorting fields whose content may contain hyphens",
    "details": {
        "affect_versions": "3.6.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "Pardon this submission if I have not followed any established protocols, I'm new to the this system and also not well versed in solr in general and did not see any guidelines to issue submission. But, I believe this to be a legitimate issue not previously identified, at least in some use cases.\n\nFields, whose content may contain hyphens, are sorted by the string occurring after the last hyphen. In my case, this is happening on a field storing last names. For example: \"Abel-Johnson\" will be sorted as if it held the value \"Johnson\" excluding the content before the hyphen.\n\nI've searched through the existing issues, and there seem to be plenty of references to issues surrounding query strings which may contain hyphens in either field names, or arguments, but nothing referring to the content itself.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13771017",
            "date": "2013-09-18T18:00:02+0000",
            "content": "John: please send an email to the solr-user@lucene mailing list with more details about your data and your configuration.\n\nat first glance: it sounds like what you are describing may just be a simple missunderstanding about how sorting works and how to sort on \"string\" data – i suspect you are trying to sort on a field that uses an analyzer, and have multiple terms per document.\n\nw/o more details, it's hard to be sure – but please bring this up on the user list so we can get a sense of what exactly is the problem you are having – and if it turns out there is a bug, we can re-open this issue.\n "
        }
    ]
}