{
    "id": "SOLR-1920",
    "title": "Need generic placemarker for DIH delta-import",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The dataimporthandler currently is only capable of saving the index timestamp for later use in delta-import commands.  It should be extended to allow any arbitrary data to be used as a placemarker for the next import.\n\nIt is possible to use externally supplied variables in data-config.xml and send values in via the URL that starts the import, but if the config can support it natively, that is better.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12872571",
            "date": "2010-05-27T22:08:04+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043771",
            "date": "2011-06-03T16:46:59+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106385",
            "date": "2011-09-16T14:50:51+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234732",
            "date": "2012-03-21T18:09:04+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "James Dyer",
            "id": "comment-13496441",
            "date": "2012-11-13T19:14:21+0000",
            "content": "Shawn,\n\nCan you give more detail as to what kind of data you want to save in the properties file and where that data comes from?   "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13496531",
            "date": "2012-11-13T20:54:34+0000",
            "content": "In the MySQL database where my data originates, the field that I use for tracking what's new is an autoincrement field, mapped to a tlong in Solr.  New documents added to the database just get assigned the next autoincrement number.  If Solr could be informed that field X is the tracking field, the highest value encountered during an import (according to that field's sort mechanism) could be stored in dataimport.properties and re-used during the next delta-import.\n\nIf DIH is sufficiently disconnected from Solr schema internals (which actually seems likely), you'd have to base your sort on the SQL data type, because it would have no way to know what kind of field Solr has.\n\nI currently do all delta tracking outside of Solr, so I'm already covered.  The generic idea seemed worthy of opening an issue two years ago, because other people may run into situations where they cannot use a timestamp for delta tracking.\n\nI have no idea what kind of tracking problems you'd encounter when dealing with soft commits.  Without a transaction log, that could get ugly. For performance reasons, I am initially deploying 4.x with no transaction log (see SOLR-3954). "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13496533",
            "date": "2012-11-13T20:58:22+0000",
            "content": "Additonal note: At one time I did all document indexing using DIH – full-import for reindexes and delta-import for everything else.  Now I only use DIH for full reindexes and SolrJ for everything else. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13496541",
            "date": "2012-11-13T21:06:11+0000",
            "content": "possibly, the fields/values from the last document added could be all stored in the properties file.  This would mean you'd have to sort your documents by the autoincrement field so that the highest one is guaranteed to be last.\n\nAnother possibility is to have it go out and execute a query to get the values from the database in a special \"get the properties\" query.  This would be like SOLR-3365, where the user wants to get \"last_index_time\" from the database rather than from the Solr server's clock as currently done.  To implement SOLR-3365, I imagine letting the user specify a query like \"select CURRENT_TIMESTAMP as 'last_index_time' from dual\" .  It would be just as easy to let any set of properties be put in such a query, for instance, \"select max(autoincrement_field) from mytable\".  So maybe something can be written that would solve both issues? "
        },
        {
            "author": "Alexey Serba",
            "id": "comment-13504675",
            "date": "2012-11-27T15:29:14+0000",
            "content": "If Solr could be informed that field X is the tracking field, the highest value encountered during an import (according to that field's sort mechanism) could be stored in dataimport.properties and re-used during the next delta-import.\n+1\n\nSo you don't have to sort your documents by the autoincrement field or run another special query, but instead just keep the highest value for this field (should it support decrementing strategy? not sure). "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636573",
            "date": "2013-04-19T16:35:18+0000",
            "content": "I have no plans to work on this.  Since I switched my build system to SolrJ, I no longer use delta-import at all, and full-import is only used when I need to rebuild the entire index.  If I can figure out how to efficiently reindex millions of documents from MySQL with SolrJ, I may get rid of DIH entirely.\n\nIf nobody else wants to pick up the ball, I will close the issue.\n\nThis is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13644925",
            "date": "2013-04-29T21:52:15+0000",
            "content": "No immediate interest in the issue.  I think it's a good idea, but if you're willing to maintain state outside of Solr, there are suitable workarounds. "
        }
    ]
}