{
    "id": "SOLR-5185",
    "title": "Core Selector not compatible with text based web browsers (lynx/elinks).",
    "details": {
        "affect_versions": "4.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "The Core Selector part of the web gui is not compatible with text based web browsers (lynx/elinks) rendering the control panel useless.\n\nPriority increases when installed on a remote server when you do not wish Solr access from outwith the server.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13748651",
            "date": "2013-08-23T15:55:29+0000",
            "content": "I can't speak for Stefan Matheis (steffkes), who does most of our UI work, but I suspect that the current level of functionality would be very difficult to achieve in a way that's compatible with a text browser.\n\nIf you're trying to use a text-based browser, It's unlikely that you are running Solr on Windows.  If you have ssh access to the server from a graphical client, you can forward a local port to the Solr port on the remote system, and then access localhost:port/solr in a graphical browser on the machine making the ssh connection.  This works with PuTTY as well as virtually all commandline ssh clients.  If access requires a multi-hop ssh, you can do a port-forwarding chain.  It can be a little confusing to set up a port-forwarding chain, but it does work. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13748721",
            "date": "2013-08-23T17:06:31+0000",
            "content": "indeed as Shawn Heisey said - i'd guess that this is your first issue you're facing and not the only one (=everything else, expect that works for you), right? because if you can't select a core right now .. i believe you haven't even seen the things that were waiting for you there? (: "
        },
        {
            "author": "Alasdair Campbell",
            "id": "comment-13748738",
            "date": "2013-08-23T17:21:39+0000",
            "content": "Thanks for your reply Shawn Heisey I guess that will do, feel free to close the bug.\n\nThanks for your input Stefan Matheis (steffkes) however I have ran it locally without problems (how else would I have known about the core-selector), the issue was when I was testing it on a production server and had firewalled the port in use rendering it inaccessible remotely without using Shawn's technique.  Thanks for the input anyway. "
        }
    ]
}