{
    "id": "SOLR-8393",
    "title": "Component for Solr resource usage planning",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "One question that keeps coming back is how much disk and RAM do I need to run Solr. The most common response is that it highly depends on your data. While true, it makes for frustrated users trying to plan their deployments. \n\nThe idea I'm bringing is to create a new component that will attempt to extrapolate resources needed in the future by looking at resources currently used. By adding a parameter for the target number of documents, current resources are adapted by a ratio relative to current number of documents.",
    "attachments": {
        "SOLR-8393_tag_7.5.0.patch": "https://issues.apache.org/jira/secure/attachment/12943470/SOLR-8393_tag_7.5.0.patch",
        "SOLR-8393.patch": "https://issues.apache.org/jira/secure/attachment/12776384/SOLR-8393.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-12-08T20:03:13+0000",
            "author": "Steve Molloy",
            "content": "Patch based on replication's disk size estimate and adapted Luke's index RAM estimates. Solr RAM estimates tentatively derived from excel sheet provided in dev-tools. ",
            "id": "comment-15047383"
        },
        {
            "date": "2015-12-08T20:44:26+0000",
            "author": "Steve Molloy",
            "content": "Cleaned up version of the same patch. ",
            "id": "comment-15047433"
        },
        {
            "date": "2015-12-14T19:15:24+0000",
            "author": "Steve Molloy",
            "content": "Updated patch with extra command on collection handler to get size of whole cluster. Also allow to specify average document size to use and estimation ratio. ",
            "id": "comment-15056505"
        },
        {
            "date": "2015-12-15T18:30:03+0000",
            "author": "Steve Molloy",
            "content": "Fix disappearing collections when using collection param (should not be able to modify clusterState's getCollections result...) ",
            "id": "comment-15058491"
        },
        {
            "date": "2015-12-16T19:38:43+0000",
            "author": "Steve Molloy",
            "content": "Adjust to work with small and empty indexes, also add num docs used for estimation in results. ",
            "id": "comment-15060641"
        },
        {
            "date": "2016-01-27T16:02:35+0000",
            "author": "Steve Molloy",
            "content": "Force distrib=false for individual requests ",
            "id": "comment-15119661"
        },
        {
            "date": "2016-03-21T14:17:59+0000",
            "author": "Steve Molloy",
            "content": "Sizing Component\n\nThe Solr SizeComponent is intended to compute resource usage information for a given Solr core. It will perform those computations based on current index schema, Solr configuration and document indexed in the core. It is not meant to be distributable, see the cluster sizing action of the collection admin API for more information about sizing distributed collections.\n\nConfiguration\n\nThe SizeComponent, like any search component except for the base ones, must be defined in the solrconfig.xml file before it can be used. This is done in 2 parts.\n\n1- Declare the component:\n\n    <searchComponent name=\"size\" class=\"solr.SizeComponent\" />  \n\n2- Use the component in some handler, using the default /select handler will make it easier to use:\n\n    <requestHandler name=\"/select\" class=\"solr.SearchHandler\">  \n    ... \n        <arr name=\"last-components\">  \n      ...\n            <str>size</str>  \n        </arr>  \n    </requestHandler>  \n\nUsage\n\nOnce you have configured the SizeComponent, it can be requested by enabling it in a standard query:\n\nhttp://localhost:8983/solr/core/select?q=*:*&rows=0&wt=xml&size=true\n\nParameters\n\n\n\nname\ntype\ndefault\ndescription\n\n\nsize\nboolean\nfalse\nIf set to true, sizing information will be included in response.\n\n\navgDocSize\nlong\n0\n\tDocument size used to compute resource usage. If less than 1, the value will be computed using the content of currently indexed documents.\n\n\nnumDocs\nlong\n0\nNumber of documents to use when computing resource usage. If less than 1, actual number of indexed documents will be used. This parameter will be ignored if estimationRatio is specified.\n\n\nestimationRatio\ndouble\n0.0\nRatio used for resource usage estimations. If a value greater than 0.0 is specified, the current number of documents will be multiplied by this ratio in order to determine number of documents to be used when computing resource usage.\n\n\ndeletedDocs\nlong\n-\n\tIf specified, will be used as number of deleted documents in the index when computing resource usage, otherwise, current number of deleted documents will be used instead.\n\n\nfilterCacheMax\nlong\n-\nSize of the filter cache to use for computing resource usage, if not specified, current filter cache size will be used.\n\n\nqueryResultCacheMax\nlong\n-\nSize of the query result cache to use for computing resource usage, if not specified, current query result cache size will be used.\n\n\ndocumentCacheMax\nlong\n-\nSize of the document cache to use for computing resource usage, if not specified, current document cache size will be used.\n\n\nqueryResultMaxDocsCached\nlong\n-\nMaximum number of documents to cache per entry in query result cache to use for computing resource usage, if not specified, current maximum will be used.\n\n\n\n\n\nResponse\n\n\n    <?xml version=\"1.0\" encoding=\"UTF-8\"?>  \n    <response>  \n    <lst name=\"responseHeader\">  \n      <int name=\"status\">0</int>  \n      <int name=\"QTime\">109</int>  \n      <lst name=\"params\">  \n        <str name=\"q\">*:*</str>  \n        <str name=\"size\">true</str>  \n        <str name=\"indent\">true</str>  \n        <str name=\"rows\">0</str>  \n        <str name=\"wt\">xml</str>  \n      </lst>  \n    </lst>  \n    <result name=\"response\" numFound=\"2287\" start=\"0\">  \n    </result>  \n    <lst name=\"size\">  \n      <str name=\"total-disk-size\">199.6 MB</str>  \n      <str name=\"total-lucene-RAM\">33.35 MB</str>  \n      <str name=\"total-solr-RAM\">79.16 MB</str>  \n      <long name=\"estimated-num-docs\">2287</long>  \n      <str name=\"estimated-doc-size\">89.37 KB</str>  \n      <lst name=\"solr-details\">  \n        <str name=\"filterCache\">152.94 KB</str>  \n        <str name=\"queryResultCache\">1,000 KB</str>  \n        <str name=\"documentCache\">44.68 MB</str>  \n        <str name=\"luceneRam\">33.35 MB</str>  \n      </lst>  \n    </lst>  \n    </response>  \n\n\n\n\n\n\nresult field\n \ndescription\n\n\ntotal-disk-size\n \nEstimation of total disk space used by the index according to parameters.\n\n\ntotal-lucene-RAM\n \nEstimation of index RAM usage specifically for Lucene according to parameters.\n\n\ntotal-solr-RAM\n \nEstimation of total index RAM usage for Solr (including Lucene) according to parameters.\n\n\nestimated-num-docs\n \nNumber of documents used for computing estimated values.\n\n\nestimated-doc-size\n \nAverage size of document used for computing estimated values.\n\n\nsolr-details\nfilterCache\nEstimated maximum amount of RAM used for caching filters for the index, if cache was filled.\n\n\n \nqueryResultCache\nEstimated maximum amount of RAM used for caching query results for the index, if cache was filled.\n\n\n \ndocumentCache\nEstimated maximum amount of RAM used for caching documents for the index, if cache was filled.\n\n\n \nluceneRam\nEstimated amount of RAM used by Lucene for the index.\n\n\n\n\n\n\nCluster Sizing\n\nThe cluster sizing action of the collection handler is intended to estimate resource usage for a complete Solr cluster. It is based on the Size Component and will perform calls to it internally in order to merge the results and compute aggregated estimations. It does not require any specific configuration, but requires that the SizeComponent is declared and used by the /select handler so that the ClusterSizing action can perform requests to it.\n\nUsage\n\nThe cluster sizing action can be accessed through the collections handler:\n\nhttp://localhost:8983/solr/admin/collections?action=clustersizing\n\nParameters\n\nAll parameters from the SizeComponent, except for size parameter itself, can be passed to the cluster sizing action and will be relayed to the SizeComponent when estimating resource usage. Below is the list of parameters specific to this action, for SizeComponent parameters, see the parameter table for it.\n\n\n\n\nname\ntype\ndefault\ndescription\n\n\ncollection\nstring\n-\nList of collections (CSV) to be included in the report, if not specified, all collections will be included.\n\n\nshard\nstring\n-\nList of shards (CSV) to be included in the report, if not specified, all shards will be included.\n\n\nreplica\nstring\n-\nList of replicas (CSV) to be included in the report, if not specified, all replicas will be included.\n\n\n\n\n\nResponse\n\nThe response fields are the same as for SizeComponent, but will be grouped in 2 ways. First, each node will have estimated total usage, then all collections will have details grouped by shards and then for each replica. ",
            "id": "comment-15204298"
        },
        {
            "date": "2016-03-21T16:15:30+0000",
            "author": "Shawn Heisey",
            "content": "Although I understand that you're going for readability with output like \"1000 KB\", please strongly consider calculating everything to the same unit size and including it in the attribute name, such as queryResultCacheKB.  With a value like \"1000 KB\" or \"44.68 MB\", it is extremely difficult to write tools that can do calculations on those numbers.\n\nThe same thing needs to be done for other informational responses that Solr produces.  DIH status is one of the really bad ones for parsing in a program.  If human readability is important for a particular response, then two sets of numbers should be in the output. ",
            "id": "comment-15204522"
        },
        {
            "date": "2017-07-17T23:20:28+0000",
            "author": "Isabelle Giguere",
            "content": "Updated and improved patch, for Solr 6.6.0\n\nAdding unit tests for the SizeComponent.\n\nAdding a new parameter, 'sizeUnit', to address Shawn Heisey 's comment.\n\nIf parameter 'sizeUnit' is present, values will be output as 'double', according to the chosen size unit.\nValue of 'estimated-num-docs' remains a 'long'.\nDefault behavior, if 'sizeUnit' is not present is the human-readable format, for back-compatibility.\n\nValid values for 'sizeUnit' are : GB, MB, KB, bytes\n\nExample:\n\nq=*:*&size=true&sizeUnit=GB&rows=0&wt=xml\n\n\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response>\n\t<lst name=\"responseHeader\">\n\t\t<int name=\"status\">0</int>\n\t\t<int name=\"QTime\">0</int>\n\t\t<lst name=\"params\">\n\t\t\t<str name=\"q\">*:*</str>\n\t\t\t<str name=\"size\">true</str>\n\t\t\t<str name=\"sizeUnit\">GB</str>\n\t\t\t<str name=\"rows\">0</str>\n\t\t\t<str name=\"wt\">xml</str>\n\t\t</lst>\n\t</lst>\n\t<result name=\"response\" numFound=\"6\" start=\"0\">\n\t</result>\n\t<lst name=\"size\">\n\t<double name=\"total-disk-size\">2.2901222109794617E-6</double>\n\t<double name=\"total-lucene-RAM\">0.03125092852860689</double>\n\t<double name=\"total-solr-RAM\">0.03147673141211271</double>\n\t<long name=\"estimated-num-docs\">6</long>\n\t<double name=\"estimated-doc-size\">3.809109330177307E-7</double>\n\t\t<lst name=\"solr-details\">\n\t\t<double name=\"filterCache\">9.894371032714844E-6</double>\n\t\t<double name=\"queryResultCache\">2.13623046875E-4</double>\n\t\t<double name=\"documentCache\">2.2854655981063843E-6</double>\n\t\t<double name=\"luceneRam\">0.03125092852860689</double>\n\t\t</lst>\n\t</lst>\n</response>\n\n\n\nGB is a bit much for a unit test sample size, but you get the idea  ",
            "id": "comment-16090786"
        },
        {
            "date": "2018-10-11T15:45:48+0000",
            "author": "Isabelle Giguere",
            "content": "SOLR-8393_tag_7.5.0.patch : Same patch, on revision 61870, tag 7.5.0, latest release ",
            "id": "comment-16646648"
        }
    ]
}