{
    "id": "SOLR-11902",
    "title": "bin/solr help text should mention when commands must be run from Solr host",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "documentation",
            "scripts and tools"
        ],
        "type": "Improvement",
        "fix_versions": [
            "7.3",
            "master (8.0)"
        ],
        "affect_versions": "master (8.0)",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "The bin/solr scripts contain a number of useful tools.  Some of these can be pointed at a Solr host through config, and can be run on the Solr host, an admin's laptop, or anywhere else.  Others make assumptions that require them to be run from the same box where Solr is running.\n\nThese commands should document any such restrictions in their help text, to avoid any potential confusion.",
    "attachments": {
        "SOLR-11902.patch": "https://issues.apache.org/jira/secure/attachment/12907888/SOLR-11902.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2018-01-25T02:26:37+0000",
            "content": "The following bin/solr commands can only ever be run (or only make sense to run) on the host on which Solr is running:\n\n\tstart\n\tstop\n\trestart\n\tstatus\n\tversion\n\tauth\n\tassert\n\tcreate_core (still need to test this)\n\n\n\nThese remaining bin/solr commands can be run on any host, as long as it can talk to a remote Solr/ZK as needed:\n\n\thealthcheck\n\tcreate_collection\n\tdelete\n\tzk\n\tassert\n\n\n\n(Note that \"assert\" appears in both lists, as many of its options only make sense when run locally, but some are valid in either context.) ",
            "author": "Jason Gerlowski",
            "id": "comment-16338626"
        },
        {
            "date": "2018-01-25T18:54:47+0000",
            "content": "Erick Erickson commented this in an email reply:\n\nMakes sense, I suspect that create_core will happily create a core on a different node, but can't check now...\n\nIn what I would call typical situations, this won't work, because ${instanceDir}/conf must exist and be populated before the CoreAdmin call, which bin/solr can't do on a remote host.  If using configsets (which I wouldn't call typical), then it would work. ",
            "author": "Shawn Heisey",
            "id": "comment-16339636"
        },
        {
            "date": "2018-01-26T13:59:23+0000",
            "content": "Thanks for the help guys.  I verified the behavior that Shawn laid out above.\n\nI've attached a patch with some modifications to the help text for the various bin/solr commands.  I wasn't able to take things as far as I initially thought; some of the bin/solr commands are missing help text altogether, and others (such as assert) have their help text generated from the commons-cli library parsing the Options over in SolrCLI.java.\n\nI'm happy to add the missing help text for those commands that need it.  I'm also happy to tweak the SolrCLI-generated help text to look more like that output by the scripts.  But I wasn't sure whether to tack on that work here, or have them as separate JIRAs.\n\nDon't have a strong preference personally, but didn't want to assume.  Might help this doc change to get in quicker if those slightly-related issues are handled elsewhere.  OTOH it might be easier to review them together.  Unless I hear otherwise, I'll split them off into different JIRA's I guess. ",
            "author": "Jason Gerlowski",
            "id": "comment-16341083"
        },
        {
            "date": "2018-02-09T15:13:51+0000",
            "content": "I'm planning on committing this later today or this weekend, unless there are any objections.  Thought it would make a good trial \"first commit\".  Will upload a very very slightly revised patch in a few minutes. ",
            "author": "Jason Gerlowski",
            "id": "comment-16358517"
        },
        {
            "date": "2018-02-09T23:11:19+0000",
            "content": "Commit 11a23a90292d9eec39af6b61984e11ac6bb169b2 in lucene-solr's branch refs/heads/master from Jason Gerlowski\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=11a23a9 ]\n\nSOLR-11902: Clarify bin/solr -h text to describe which commands can be run remotely\n\nThe bin/solr scripts contain a number of independent tools.  Many of\nthese can be run anywhere and just pointed at the correct Solr or ZK\nhost.  Some must run on the machine hosting Solr itself.\n\nThis commit clarifies help text for each bin/solr command, indicating\nwhether it can be run remotely, or must be run locally. ",
            "author": "ASF subversion and git services",
            "id": "comment-16359081"
        },
        {
            "date": "2018-02-09T23:13:17+0000",
            "content": "Commit 09de0da79b09591f967d99648ef229c84a68d836 in lucene-solr's branch refs/heads/branch_7x from Jason Gerlowski\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=09de0da ]\n\nSOLR-11902: Clarify bin/solr -h text to describe which commands can be run remotely\n\nThe bin/solr scripts contain a number of independent tools.  Many of\nthese can be run anywhere and just pointed at the correct Solr or ZK\nhost.  Some must run on the machine hosting Solr itself.\n\nThis commit clarifies help text for each bin/solr command, indicating\nwhether it can be run remotely, or must be run locally. ",
            "author": "ASF subversion and git services",
            "id": "comment-16359084"
        },
        {
            "date": "2018-02-09T23:16:45+0000",
            "content": "Closing this now that patch has been merged to master and branch_7x. ",
            "author": "Jason Gerlowski",
            "id": "comment-16359086"
        }
    ]
}