{
    "id": "SOLR-2022",
    "title": "request handler paths ending in \"/\" don't work with Tomcat 7",
    "details": {
        "affect_versions": "1.1.0,                                            1.2,                                            1.3,                                            1.4,                                            1.4.1,                                            1.4.2,                                            1.5,                                            3.1,                                            3.2,                                            (1)4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "As originally reported in this thread...\n\nhttp://search.lucidimagination.com/search/document/9c09498631b7afbb/problems_running_on_tomcat\n\nTomcat 7 has made changes in how URLs are resolved that result in the requests with paths that end in a \"/\" character being given to the SolrDispatchFilter  with \"index.jsp\" appended to them.  This results in SolrDispatchFilter being unable to correctly identify some situations when a request should be processed by a request handler based on the name registered (ie: \"/update/csv/\" is seen as \"update/csv/index.jsp\" so as a result the handler registered to \"/update/csv/ is not consulted).  The problem manifests as a generic 404 (because the request is propagated to the underlying JspServlet which can not find these paths and jsps in the war)\n\nThis is most notable in a basic solr install when clicking some URLs that are linked to from the main admin page (see comments below) but this problem can also affect any situation where a client is attempting to access a request handler (or \"/select/\") using a path ending in \"/\".  The workaround is to remove hte trailing \"/\" character",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12924662",
            "date": "2010-10-25T18:16:09+0000",
            "content": "Verified the symptoms described using Solr 1.4.1 and tomcat 7.0.4\n\nSpecific problems...\n\nFrom admin screen, running solr in a webapp named \"demo\" with a a core named \"books\" and loading the admin screen...\n\n\nhttp://localhost:8080/demo/books/admin/\n\n\nthe \"schema.xml\" and \"config\" links point to these URLs...\n\n\nhttp://localhost:8080/demo/books/admin/file/?file=schema.xml\nhttp://localhost:8080/demo/books/admin/file/?file=solrconfig.xml\n\n\n\n...those both generate 404 error messages with this descriptions...\n\n\nmessage /demo/admin/file/index.jsp\ndescription The requested resource (/demo/admin/file/index.jsp) is not available.\n\n\n\n...manullly changing the urls to remove the \"/\" prior to the question mark makes the URLs work fine.\n\nClicking the \"Search\" button on the main admin screen leads to...\n\n\nhttp://localhost:8080/demo/books/select/?q=*%3A*&version=2.2&start=0&rows=10&indent=on\n\n\n\n..which also fails.  again removing the \"/\" prior to the question mark makes it work. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12925269",
            "date": "2010-10-27T06:02:29+0000",
            "content": "\nWell, the root cause seems to be a bug in tomcat...\n\nhttps://issues.apache.org/bugzilla/show_bug.cgi?id=50161\n\nfor these specific links, we could work around the problem by removing the trailing \"/\" in any links on the admin screen to a solr handler (SolrCore internally normalizes handler paths and ignores the trailing \"/\" anyway) but that wouldn't help any users who have clients hitting \".../select/?...\" (or any other handler) that try to upgrade tomcat. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12925272",
            "date": "2010-10-27T06:07:03+0000",
            "content": "updated summary and description now that root cause has been identified "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12925495",
            "date": "2010-10-27T18:40:22+0000",
            "content": "FYI: comments in tomcat bug#50161 that this is a result of a deliberate change in order to correctly implement Servlet Spec 3.0 - but i've posted some followup questions - in particular, it's not clear to me that HttpServletRequest.getServletPath() is returning what it should be even in light of the comments posted.\n\nThere is some mention that future versions of tomcat may allow a system property to override this behavior from the servlet spec, but in future versions of Solr we should probably don't want to have to rely on that being set.  There may be ways we can work around this behavior a little better – depending on what response we get in bug#50161 we might consider changes to our web.xml to override the default \"welcome-file\" behavior, or changing the way SolrDispatchFilter attempts to parse the URL path. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12925516",
            "date": "2010-10-27T19:15:22+0000",
            "content": "Updated description to clarify the scope of hte problem "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13188204",
            "date": "2012-01-18T02:15:47+0000",
            "content": "Tomcat admitted this was their bug and since Tomcat 7.0.5 this is fixed. See https://issues.apache.org/bugzilla/show_bug.cgi?id=49422#c8\n\nResolving as \"Won't fix\", since solution is to upgrade Tomcat  "
        }
    ]
}