{
    "id": "SOLR-6489",
    "title": "morphlines-cell tests fail after upgrade to TIKA 1.6 or TIKA 1.7",
    "details": {
        "affect_versions": "5.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Tests"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "After upgrade tp Apache TIKA 1.6 (SOLR-6488), solr-morphlines-cell tests fail with scripting error messages.\n\nDue to missing understanding, caused by the crazy configuration file format and inability to figure out the test setup, I have to give up and hope that somebody else can take care. In addition, on my own machines, all of Hadoop does not work at all, so I cannot debug (Windows).\n\nThe whole Morphlines setup is not really good, because Solr core depends on another TIKA version than the included morphlines libraries. This is not a good situation for Solr, because we should be able to upgrade to any version of our core components and not depend on external libraries that itsself depend on Solr in older versions!",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "ASF subversion and git services",
            "id": "comment-14125261",
            "date": "2014-09-08T07:10:13+0000",
            "content": "Commit 1623308 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1623308 ]\n\nSOLR-6489: Disable Morphlines-Cell tests, because Update to Tika 1.6 (SOLR-6488) broke them "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14125263",
            "date": "2014-09-08T07:11:10+0000",
            "content": "Commit 1623309 from Uwe Schindler in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1623309 ]\n\nMerged revision(s) 1623308 from lucene/dev/trunk:\nSOLR-6489: Disable Morphlines-Cell tests, because Update to Tika 1.6 (SOLR-6488) broke them "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14125687",
            "date": "2014-09-08T15:51:53+0000",
            "content": "Uwe Schindler, you really should wait longer than a weekend to disable tests and say you don't understand what the problem is because you want to slam in a library upgrade real quick. It's a distributed community, give time for collaboration before you disable tests. I doubt it was critical to jam in Tika 1.6 over the weekend.\n\nI'll look into the issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14125710",
            "date": "2014-09-08T16:19:44+0000",
            "content": "Bummer...seems like when someone re-factored the config for these tests, they stopped working from the IDE. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14125723",
            "date": "2014-09-08T16:32:21+0000",
            "content": "Okay, test fails from command line show that .gz files do not appear to be getting extracted properly anymore. If I remove those files, the rest of the tests pass. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14125754",
            "date": "2014-09-08T17:02:48+0000",
            "content": "So my initial guess is that kite-morphlines-tika-decompress depending on compress 1.4 and our move from 1.7 to 1.8 is perhaps the problem. Standard java jar hell. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14126205",
            "date": "2014-09-08T22:18:58+0000",
            "content": "A good chunk of the issue appears to be that the 'decompress' morphline has support for the mime type 'application/x-gzip' but not 'application/gzip' and that perhaps Tika mimetype detection is now returning that instead for these .gz files. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14126233",
            "date": "2014-09-08T22:41:39+0000",
            "content": "I'll disable the gz tests and file an issue with morphlines. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-14126269",
            "date": "2014-09-08T23:10:02+0000",
            "content": "The relevant change to Tika that caused this appears to be https://issues.apache.org/jira/browse/TIKA-1280 GZip now has an official mimetype, which refers to https://tools.ietf.org/html/rfc6713.\n\nA list of alternates before the official mimetype can be found off https://issues.apache.org/jira/browse/TIKA-1282 Additional Gzip types. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-14126293",
            "date": "2014-09-08T23:24:25+0000",
            "content": "Uwe Schindler, you really should wait longer than a weekend to disable tests and say you don't understand what the problem is because you want to slam in a library upgrade real quick. It's a distributed community, give time for collaboration before you disable tests. I doubt it was critical to jam in Tika 1.6 over the weekend.\n\nSorry, I was not expecting this to fail. And as I said: I was not able to test it locally. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-14126707",
            "date": "2014-09-09T06:59:32+0000",
            "content": "Hi Mark,\n\nif this is impossible to fix for you, I can revert my commit. I did not want to hurry anything, the bug was found by Jenkins after my commit (as I had no chance to test this locally).\n\nIn my opinion, disabling the Morphlines tests until this is fixed is a simplier solution than preventing the upgrade of TIKA at all, especially as more people will use plain Solr Cell than those using Morphlines. The main problem here (as said before) is the fact that Solr depends on an external library, that itsself depends on an older version of Solr + a specific version of TIKA of that older Solr version. In my opinion, to fix the whole thing completely, the morphlines code (at least the Solr-relevant part) should also be donated to Solr and maintained in our repository, so it fits the version of Solr.\n\nI was also not expecting a failure, because TIKA did not change its APIs and the compile worked perfectly fine. To me morphlines-cell was just a client to the extracting content handler, I was not aware that it uses TIKA on its own, bypassing extracting content handler (which is not clear from looking at the tests). Maybe you give me a short introduction what it does in addition to Solr Cell and why those features cannot be in Solr Cell, so people who want to use it do not depend on Hadoop support. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-14281785",
            "date": "2015-01-18T12:37:43+0000",
            "content": "Same issue with TIKA 1.7. I think the morphlines-libraries need to be upgraded first to take care of the new GZIP MIME type. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-14281787",
            "date": "2015-01-18T12:48:31+0000",
            "content": "I checked, morphlines in Solr is still on older version:\norg.kitesdk.kite-morphlines.version = 0.12.1\n\nThe recent one is: 0.17.1\n\nwolfgang hoschek: Do you know if the bug with TIKA 1.6 and 1.7 is fixed in newer releases? The problem is that TIKA 1.6 changed the MIME type of gzip compressed files to the \"official W3C one\". Maybe the expression checking for this was just too strict. It would be good to fix this, because we release Solr 5.0 without working support for morphlines-cell (tests are disabled). "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-14281790",
            "date": "2015-01-18T12:53:30+0000",
            "content": "I tried it out: Fails in the same way with 0.17.1. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14281794",
            "date": "2015-01-18T13:00:18+0000",
            "content": "Commit 1652747 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1652747 ]\n\nSOLR-6489: Disable only failing tests "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14281795",
            "date": "2015-01-18T13:00:56+0000",
            "content": "Commit 1652748 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1652748 ]\n\nMerged revision(s) 1652747 from lucene/dev/trunk:\nSOLR-6489: Disable only failing tests "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14281796",
            "date": "2015-01-18T13:03:30+0000",
            "content": "Commit 1652749 from Uwe Schindler in branch 'dev/branches/lucene_solr_5_0'\n[ https://svn.apache.org/r1652749 ]\n\nMerged revision(s) 1652747 from lucene/dev/trunk:\nSOLR-6489: Disable only failing tests "
        }
    ]
}