{
    "id": "SOLR-9382",
    "title": "Replication of managed resources on standalone servers",
    "details": {
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.5",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "I've a single standalone server with a managed schema, synonyms and stopwords. I was planning on configuring as master and slave cores via replication, the master as the indexing source and all slaves replicated from the master as query sources. \n\nWhere I started to run into problems is with the conffiles option on the slave replication setup. Because I'm using a shared configset and managed resources It wasn't clear how to configure this (no schema.xml or synonyms.txt...). \n\nFirst I tried with no conffiles, then I tried adding the managed resource generated files in conffiles. But the behaviour I'm seeing in both cases was no replication of the conffiles (managed resources) is taking place? Not on index changes replication, nor manual requests to replicate the slave.\n\nIn this case as the conf files are shared, no actual copying needs to take place however when synonyms are added to the master via the rest api the changes are immediately viewable via the masters synonyms resource. But the slave core(s) needs to reloaded before the same changes appear there. \n\nSo what I wanted was the slave core(s) to be reloaded(?) when config files change. Which the index replication documentation suggests should be happening?\n\n\nIf a replication involved downloading of at least one configuration file, the ReplicationHandler issues a core-reload command instead of a commit command.\n\nSo this a part bug report and part discussion on how should this work for standalone servers? \n\nref: http://lucene.472066.n3.nabble.com/Replication-with-managed-resources-tp4289880.html",
    "attachments": {
        "Capture.GIF": "https://issues.apache.org/jira/secure/attachment/12822073/Capture.GIF"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-08-04T14:18:01+0000",
            "author": "Richard osbaldeston",
            "content": "Slave replication config: https://issues.apache.org/jira/secure/attachment/12822073/Capture.GIF ",
            "id": "comment-15407832"
        },
        {
            "date": "2016-08-04T14:22:36+0000",
            "author": "Richard osbaldeston",
            "content": "A possible improvement could be the ability to use of wildcard globs in replication conffiles to monitor all language variants of the managed stopwords & synonyms. ",
            "id": "comment-15407842"
        }
    ]
}