{
    "id": "SOLR-10290",
    "title": "New Publication Model for Solr Reference Guide",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The current Solr Ref Guide is hosted at cwiki.apache.org, a Confluence installation. There are numerous reasons to be dissatisfied with the current setup, a few of which are:\n\n\n\tConfluence as a product is no longer designed for our use case and our type of content.\n\tThe writing/editing experience is painful and a barrier for all users, who need to learn a lot of Confluence-specific syntax just to help out with some content.\n\tNon-committers can't really help improve documentation except to point out problems and hope someone else fixes them.\n\tWe really can't maintain online documentation for different versions. Users on versions other than the one that hasn't been released yet are only given a PDF to work with.\n\n\n\nI made a proposal in Aug 2016 (email link) to move the Ref Guide from Confluence to a new system that relies on asciidoc-formatted text files integrated with the Solr source code. \n\nThis is an umbrella issue for the sub-tasks and related decisions to make that proposal a reality. A lot of work has already been done as part of a proof-of-concept, but there are many things left to do. Some of the items to be completed include:\n\n\n\tCreation of a branch and moving the early POC work I've done to the project\n\tConversion the content and clean up of unavoidable post-conversion issues\n\tDecisions about location of source files, branching strategy and hosting for online versions\n\tMeta-documentation for publication process, beginner tips, etc. (whatever else people need or want)\n\tIntegration of build processes with the broader project\n\n\n\nFor reference, a demo of what the new ref guide might look like is currently online at http://people.apache.org/~ctargett/RefGuidePOC/.\n\nCreation of sub-tasks to follow shortly.",
    "attachments": {
        "sitemap.patch": "https://issues.apache.org/jira/secure/attachment/12869268/sitemap.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-16T18:21:16+0000",
            "content": "I've created a branch and added most of the files that existed in my POC github repo. The branch is jira/solr-10290. \n\nThe new solr/solr-ref-guide directory contains the build scripts and tools, as well as the source content and images. It can build the HTML files and/or the PDF. The README explains a bit more about the directory structure and dependencies required to do a build. PDFs can be built without anything locally installed; the HTML needs a few things installed first. The source content is from an export of Confluence done about a month ago, so be forewarned it's slightly out of date.\n\nThe new solr/confluence-export directory includes all the tools used in the conversion of the content from Confluence's HTML to Asciidoc format, plus the post-conversion automated cleanup. Also included should be the raw export used and files from intermediary steps in the conversion process, but I'm having huge problems today with large uploads to ASF Git, so it will be a little bit longer before I can get all that into the repo where it belongs. IOW, don't try to use the conversion tools yet in case you were so inclined to do so. \n\nThe intent is that we'll get the content converted and then the confluence-export directory will go away entirely so we won't need to carry these tools around with us when this is merged to master. ",
            "author": "Cassandra Targett",
            "id": "comment-15928580"
        },
        {
            "date": "2017-05-10T21:45:22+0000",
            "content": "I just squash merged jira/solr-10290 into master\n\nhttps://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=95968c69 ",
            "author": "Hoss Man",
            "id": "comment-16005503"
        },
        {
            "date": "2017-05-12T14:46:14+0000",
            "content": "Cherrypicked to branch_6x: https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=ccbc93b80929e942d20cd4782e3a3f4c77d73932\n\nCherrypicked to branch_6_6: https://git1-us-west.apache.org/repos/asf?p=lucene-solr.git;a=commit;h=c8c2aab8dbb1174bf9fd38fdb9dea53e16307f3a ",
            "author": "Cassandra Targett",
            "id": "comment-16008237"
        },
        {
            "date": "2017-05-17T20:26:55+0000",
            "content": "Can we auto-linewrap the asciidoc content we've imported somehow?  The lines are super-long in my IDE (IntelliJ).  I can toggle the active editor's \"soft wrap\" at least (View menu, then Active Editor menu). ",
            "author": "David Smiley",
            "id": "comment-16014709"
        },
        {
            "date": "2017-05-18T08:47:24+0000",
            "content": "Yea, those lines are long\n\nI just discovered that GitHub renders our adoc sources out of the box (not perfect but ok), that's cool:\nhttps://github.com/apache/lucene-solr/blob/master/solr/solr-ref-guide/src/index.adoc ",
            "author": "Jan Høydahl",
            "id": "comment-16015443"
        },
        {
            "date": "2017-05-21T19:07:40+0000",
            "content": "Should we create another issue for completing sitemap.xml and feed.xml. One issue is that _config.yml.template currently uses a hardcoded URL:\n\n# needed for sitemap.xml and feed.xml files\nurl: https://home.apache.org/~ctargett/RefGuidePOC/jekyll-full\n\n\nAlso, what is feed.xml supposed to provide here? Currently it serves top 10 pages based on title alphabetically, and description tag is full page content... ",
            "author": "Jan Høydahl",
            "id": "comment-16018952"
        },
        {
            "date": "2017-05-22T13:46:28+0000",
            "content": "I toyed with the idea of disabling the feed.xml page (it came from the theme I used to build the HTML pages), but decided it somewhat depended on what the publication process was, which the last time I looked at this question (in March) was very much under discussion. \n\nPersonally, I think it makes little sense. On every build, every page is \"new\" since we don't build HTML pages only for files that have changed since last time - so a list of 10 pages doesn't really get anyone anywhere. And it's the same for every build, so my opinion is that it provides no value in it's current form. It's not on any of my various lists to change it - someone else would need to care about it to fix it.\n\nObviously, \"fixing\" it (and sitemap.xml) just means fixing the URL in _config.yml.template, which needs to be parameterized so it's correct for every version that's built. Not sure it needs a whole issue for itself. Since you brought it up here, you could just use this one. ",
            "author": "Cassandra Targett",
            "id": "comment-16019594"
        },
        {
            "date": "2017-05-22T14:28:56+0000",
            "content": "Propose to kill feed.xml and change URL for sitemap.xml, see sitemap.patch, assuming the final base URL of the 6.6.0 guide will be https://lucene.apache.org/solr/guide/6_6_0/ - or should we stick to https://lucene.apache.org/solr/guide/6_6/ and let bug fixes override same location? ",
            "author": "Jan Høydahl",
            "id": "comment-16019626"
        },
        {
            "date": "2017-05-22T17:28:05+0000",
            "content": "For removing feed.xml, I think you will also need to remove it from the head.html at line 35.\n\nFor the _config.yml.template changes, there is no solr-docs-version-path attribute, the one we have is solr-docs-version. But that would make the URL https://lucene.apache.org/solr/guide/6.6 which is inconsistent with paths we use elsewhere, as in Javadocs. In the sitemap.xml liquid template, I believe you could try a replace filter on the site.url to transform it to a underscore? May need to play around with that.\n\nAnd, my thought is that we should stick to https://lucene.apache.org/solr/guide/6_6 to keep things simple - Hoss added guide versions in SOLR-10675, and those will be on each page and in the footer of the PDF. ",
            "author": "Cassandra Targett",
            "id": "comment-16019868"
        },
        {
            "date": "2017-05-22T19:05:31+0000",
            "content": "The solr-docs-version-path prop works, but it always includes the patch version. So I made a new property solr-guide-version-path in build.xml which uses solr-guide-version instead, having the benefit that it changes when invoking with e.g. -Dsolr-guide-version=6.6. Output is now\n\n  <url>\n    <loc>https://lucene.apache.org/solr/guide/6_6/about-this-guide.html</loc>\n  </url>\n\n\nAlso removed tag in head and other refs to feed.xml. Also removed description variable which was only used by feed.xml.\n\nGuess we don't need sitemap.xml for the branch ref-guides built by Jenkins, so I won't bother to make the first part of the URL configurable. ",
            "author": "Jan Høydahl",
            "id": "comment-16020021"
        },
        {
            "date": "2017-05-31T21:09:00+0000",
            "content": "Commit f34155fb2014393da50a836a1b78416c406b0dfd in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=f34155f ]\n\nSOLR-10290: Replace the bright green in the bottom nav links with a lighter tone of the header ",
            "author": "ASF subversion and git services",
            "id": "comment-16031968"
        },
        {
            "date": "2017-05-31T21:09:30+0000",
            "content": "Commit fc8be1c1620363793b7e280645ca589e27041c9a in lucene-solr's branch refs/heads/branch_6x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=fc8be1c ]\n\nSOLR-10290: Replace the bright green in the bottom nav links with a lighter tone of the header ",
            "author": "ASF subversion and git services",
            "id": "comment-16031970"
        },
        {
            "date": "2017-05-31T21:09:57+0000",
            "content": "Commit 41268b175c0ef41cba36442bbc76d3ea787d93cd in lucene-solr's branch refs/heads/branch_6_6 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=41268b1 ]\n\nSOLR-10290: Replace the bright green in the bottom nav links with a lighter tone of the header ",
            "author": "ASF subversion and git services",
            "id": "comment-16031972"
        },
        {
            "date": "2018-09-12T19:01:47+0000",
            "content": "Hello. Not sure if this is the best place to ask or if it is a known issue ... I stumbled across odd-looking javadocs links in the .pdf version of the Solr Reference Guide e.g. in 7.4 search for (say) SynonymMap.Builder.html or SynonymMap.Builder and it shows (literally)\n\n#{pdf-lucene-javadocs}/analyzers- common/org/apache/lucene/analysis/synonym/SynonymMap.Builder.html[SynonymMap.Builder]\n\n\nwhereas the online equivalent is fine e.g. http://lucene.apache.org/solr/guide/7_4/filter-descriptions.html#synonym-graph-filter in this case. The issue seems to be specific to {lucene-javadocs} i.e. the {solr-javadocs} links i checked were fine. ",
            "author": "Christine Poerschke",
            "id": "comment-16612614"
        },
        {
            "date": "2018-09-12T19:50:06+0000",
            "content": "Thanks Christine, that must be a recent breakage, I will investigate and fix it. ",
            "author": "Cassandra Targett",
            "id": "comment-16612655"
        },
        {
            "date": "2018-09-12T20:08:55+0000",
            "content": "That was the tiniest of typos - a # instead of a $! Thanks! Here are the commits that fix it:\n\nmaster: ad7f15d808232572c8755967559f440c742a2352\nbranch_7x: 1a8a6eafe0220a40935d2aa9f5d4cf0b6d2eaa4b\nbranch_7_5:  b20f0c703dbba466a3e92b57673310ee88c5ef20 ",
            "author": "Cassandra Targett",
            "id": "comment-16612671"
        }
    ]
}