{
    "id": "SOLR-484",
    "title": "Solr Website changes",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "In looking at the Solr website it has many of the same issues that Lucene Java did when it comes to ASF policies about nightly builds, etc. concerning the Javadocs  \n\nSee http://lucene.markmail.org/message/a7k7kujxkhwjwfy6?q=nightly+developer+releases+list:org%2Eapache%2Elucene%2Ejava-dev+from:%22Doug+Cutting+(JIRA)%22&page=1\nand http://lucene.markmail.org/message/vaks6omed4l6buth?q=nightly+developer+releases+list:org%2Eapache%2Elucene%2Ejava-dev+from:%22Doug+Cutting+(JIRA)%22&page=1\n\nThis would suggest a change like Hadoop and Lucene Java did to separate out the main site, release docs (javadocs, any other?) and developer resources.  Currently the javadocs on the main page are the nightly and should be made less prominent.",
    "attachments": {
        "SOLR-484.patch": "https://issues.apache.org/jira/secure/attachment/12387430/SOLR-484.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12619366",
            "date": "2008-08-03T19:09:17+0000",
            "content": "\n\tChanges to the build files to make four sets of javadocs – core, solrj, contrib and all\n\tOrganized just like Lucene's javadocs – build/docs/core, build/docs/solrj, build/docs/contrib-dataimporthandler and \"all\" goes in build/docs (root folder)\n\tI took the liberty of creating a macro for javadocs similar to what Lucene build files use. This is used for all javadoc targets now for uniformity.\n\n\n\nNext steps would be to change the site to move the nightly builds and javadocs inside a \"Development\" section like Hadoop's site. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12632809",
            "date": "2008-09-19T20:33:38+0000",
            "content": "Shalin, what's left on this one, anything I can help with? "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12632920",
            "date": "2008-09-20T06:50:54+0000",
            "content": "The following needs to be done:\n\n\n\tThe current javadocs inside the Documentation section on the website refer to the nightly javadocs built by hudson. That needs to be changed to the 1.3 release javadocs.\n\tA new \"Development\" section needs to be created which should have links to the nightly builds and javadocs\n\tThe nightly build download link needs to be moved off the front page \"news\" section\n\n\n\nI guess I can finish these off this week. Is the hudson build for 1.3 release still up or should I just re-create those javadocs from the tag and scp them? "
        }
    ]
}