{
    "id": "SOLR-5599",
    "title": "SolrCloud Admin UI Cluster Table View",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Admin UI",
            "SolrCloud"
        ],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "A new table view for viewing the cluster layout. Sortable by field would be best.\n\nI talked a bit about this with Stefan in Dublin. We really need a better view for large scale clusters. A sortable table view seems like a great option to have.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13860292",
            "date": "2014-01-02T16:18:47+0000",
            "content": "Stefan Matheis (steffkes), have any further thoughts on this? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13860294",
            "date": "2014-01-02T16:19:19+0000",
            "content": "We also discussed removing the mostly unusable radial graphical view. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13860295",
            "date": "2014-01-02T16:19:33+0000",
            "content": "Though it is very pretty on a large cluster  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13917148",
            "date": "2014-03-01T18:36:12+0000",
            "content": "While working w/ Shalin on SOLR-4777 i've realized (once again) how ugly the radial view looks .. i really like the idea of replacing this view w/ a table, definitely easier to get the relevant information out of the system. \n\ninitially i'd say w/ use the data which is we have currently, can't recall but i'm pretty sure we talked about other information which might be useful to have in this view, but isn't (or at least, wasn't at the time of talking) available - do you remember those Mark Miller?\n\nRegarding the functionality, what about something like that? https://datatables.net/release-datatables/examples/api/multi_filter_select.html the layout is a bit confusing, but how it works is that: you can sort asc/desc while using the column headers .. the dropdowns at the bottom contain all (unique) values of that table .. would filter the table showing only the rows matching the selected value. maybe we could merge them and show them a 'advanced' dropdown like we already have it on the Analysis-/Schema Browser-Screen. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13998827",
            "date": "2014-05-15T15:07:19+0000",
            "content": "Stefan Matheis (steffkes) But you should see the really cool graph I saw of a bunch of nodes in the radial view. It'd make a great t-shirt! "
        }
    ]
}