{
    "id": "SOLR-6925",
    "title": "Back out changes having to do with SOLR-5287 (editing configs from admin UI)",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "affect_versions": "5.0,                                            6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Blocker"
    },
    "description": "Should have something today/tomorrow. The history here is that I had this bright idea to edit files directly from the admin UI, especially schema.xml and solrxconifg.xml. Brilliant I sez to myself... except it's a significant security hole and I'm really glad that was pointed out before we released it in 4x.\n\nSo we pulled it completely from 4.x and made it something in 5.x (then trunk) that you could enable (disabled by default) if you wanted to live dangerously and \"we'd deal with it later\". Well it's later.\n\nGiven all the work for managed schemas and the like in the interim, I think this is cruft that should be removed completely from current trunk and 5x.\n\nMarking it as a blocker so we don't release 5x with this in it or we'll have back-compat issues. Should have a fix in very quickly.",
    "attachments": {
        "SOLR-6925.patch": "https://issues.apache.org/jira/secure/attachment/12690638/SOLR-6925.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-01-07T18:48:03+0000",
            "author": "Erick Erickson",
            "content": "So someone can get to the removal of 5287 from the code line. ",
            "id": "comment-14268009"
        },
        {
            "date": "2015-01-07T22:08:08+0000",
            "author": "Erick Erickson",
            "content": "I had three non-reproducible test failures that I want to look at some more, but they're things that are failing currently I think.\n\nStefan Matheis (steffkes) I left changes in the javascript code (e.g. SOLR-5446 and SOLR-5456) on the theory that I didn't know enough about javascript to risk changing them and the back-end code is gone anyway so I don't think leaving those changes alone is a problem. Just FYI in case you're interested.\n\nAnshum Gupta I assumed on the dev list that \"next thursday\" as a target for 5.0 RC0 was the 15th, correct?\n\nIf I can satisfy myself that the test failures don't have anything to do with this patch, I'll commit tomorrow sometime (or perhaps tonight even). ",
            "id": "comment-14268352"
        },
        {
            "date": "2015-01-08T00:38:42+0000",
            "author": "Anshum Gupta",
            "content": "That sounds fine to me Erick. And yes, 15th Jan, 2015 is what I meant when I said next Thursday. ",
            "id": "comment-14268607"
        },
        {
            "date": "2015-01-08T05:15:48+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1650208 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1650208 ]\n\nSOLR-6925: Back out changes having to do with SOLR-5287 (editing configs from admin UI) ",
            "id": "comment-14268831"
        },
        {
            "date": "2015-01-08T06:42:17+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1650213 from Erick Erickson in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1650213 ]\n\nSOLR-6925: Back out changes having to do with SOLR-5287 (editing configs from admin UI) ",
            "id": "comment-14268901"
        },
        {
            "date": "2015-01-17T22:34:01+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I think hiding managed schema file in the ShowFileHandler is related to this change too. Can we re-enable displaying that file, since we are read-only now and there is no other easy way to see what the dynamic schema has evolved to. The related code. ",
            "id": "comment-14281582"
        },
        {
            "date": "2015-01-17T22:43:36+0000",
            "author": "Erick Erickson",
            "content": "Not really related as far as I know. But in any case, go ahead and open up a new JIRA for that. ",
            "id": "comment-14281583"
        },
        {
            "date": "2015-01-17T22:52:13+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Ok, opened a new JIRA: SOLR-6992 ",
            "id": "comment-14281586"
        }
    ]
}