{
    "id": "SOLR-1633",
    "title": "Solr Cell should be smarter about literal and multiValued=\"false\"",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "As noted on solr-user, SolrCell has less then ideal behavior when \"foo\" is a single value field, and literal.foo=bar is specified in the request, but Tika also produces a value for the \"foo\" field from the document.  It seems like a possible improvement here would be for SolrCell to ignore the value from Tika if it already has one that was explicitly provided (as opposed to the current behavior of letting hte add fail because of multiple values in a single valued field).\n\nIt seems pretty clear that in cases like this, the users intention is to have their one literal field used as the value.\n\nhttp://old.nabble.com/Re%3A-WELCOME-to-solr-user%40lucene.apache.org-to26650071.html#a26650071",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Khalid Yagoubi",
            "id": "comment-12789552",
            "date": "2009-12-11T21:45:38+0000",
            "content": "I have written a patch for Tika Solr Extraction to ignore tika fields it's works but I'm not sure my patch is the best way.\nIt's solved my problem by avoiding tika extract metadata that conflict with my own literral non multivalued field.\nExemple : <meta name=\"id\" content=\"10\"/> is extracted as id or I give my own id : litteral.id = 12\n==> error because id is non multivalued field\n\nI explain here my patch :\n\n\tI patched SolrContentHandler.java\n\tI added a params contentOnly= true|false\n\tI ignore metadata from Tika that are defined in the schema\n\n\n\nIdeas for improvements : \n\n\tIgnore only metadata that are given in literral.foo and is not multivalued\n\tPrefix these fields\n\tFind a better name for params contentOnly or ign.meta.conflict\n\n\n\nI'll submit my patch tommorow in the night\n\nThanks for suggestions "
        },
        {
            "author": "Chris Harris",
            "id": "comment-12851667",
            "date": "2010-03-31T00:18:53+0000",
            "content": "It seems like a possible improvement here would be for SolrCell to ignore the value from Tika if it already has one that was explicitly provided (as opposed to the current behavior of letting hte add fail because of multiple values in a single valued field).\n\nI've implemented this, or at least something pretty similar, at SOLR-1856. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13402186",
            "date": "2012-06-27T12:36:40+0000",
            "content": "Solved in SOLR-1856 "
        }
    ]
}