{
    "id": "SOLR-321",
    "title": "misleading comment about spellchecker's termSourceField in solrconfig.xml",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The config file comment says this about \"termSourceField\":\n\n\"the field in your schema that you want to be able to build\nyour spell index on. This should be a field that uses a very\nsimple FieldType without a lot of Analysis (ie: string)\"\n\nI think this is wrong or at least misleading: the Lucene spellchecker uses a TermEnum to access the terms of this field, so the only requirement is that the field needs to be indexed. Isn't the common usecase of the spellchecker to use all of your terms in e.g. \"body\" as candidates for spellchecking? Then the field given for termSourceField should be e.g. \"body\", which is usually indexed and tokenized.\n\nOf course, if you want \"new yorc\" to be corrected to \"new york\" this won't work with a tokenized field. I suggest this text for the comment:\n\nThe field in your schema that you want to be able to build your spell index on. This must be a field that is indexed. If it is of type \"text\" all the terms in that field will be used as separate candidates for spellchecking, if it is of type \"string\" the complete content of that field is considered a single term. This might me useful if you have a field whose only content is something like 'new york' and the text you want to have spell checked is 'new yrok'.\n\n(besied that, spellchecking more than one term doesn't seem to be supported, I'll see if I add a comment about that to the wiki)",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Daniel Naber",
            "id": "comment-12516219",
            "date": "2007-07-29T12:09:43+0000",
            "content": "Ah, I now understand the \"simple FieldType\" comment refers mostly to word stemming, not to analysis in general. I still think the text should be changed so that people don't get the impression the spell checker can only be built on \"string\" fields. Maybe one could also add the URL pf the wiki page to solrconfig.xml. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12573604",
            "date": "2008-02-29T05:57:23+0000",
            "content": "Looks like nobody else got confused for a while, resolving. "
        }
    ]
}