{
    "id": "SOLR-11369",
    "title": "Zookeeper credentials are showed up on the Solr Admin GUI",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "Admin UI",
            "security"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Hello Guys,\n\nWe've been noticing this problem with Solr version 5.4.1 and it's still the case for the version 6.6.0. The problem is that we're using SolrCloud with secured Zookeeper and our users are granted access to Solr Admin GUI, and, at the same time, they are not supposed to have access to Zookeeper credentials, i.e. usernames and passwords. However, we (and some of our users) have found out that Zookeeper credentials are displayed on at least two sections of the Solr Admin GUI, i.e. \"Dashboard\" and \"Java Properties\".\n\nHaving taken a look at the JavaScript code that runs behind the scenes for those pages, we can see that the sensitive parameters ( -DzkDigestPassword, -DzkDigestReadonlyPassword, -DzkDigestReadonlyUsername, -DzkDigestUsername ) are fetched via AJAX from the following two URL paths:\n\n/solr/admin/info/system\n/solr/admin/info/properties\n\nCould you please consider for the future Solr releases removing the Zookeeper parameters mentioned above from the output of these URLs and from other URLs that contain this information in their output, if there are any besides the ones mentioned? We find that it is be pretty challenging (and probably impossible) to restrict users from accessing some particular paths with security.json mechanism, and we think that that would be beneficial for overall Solr security to hide Zookeeper credentials.\n\nThank you so much for your consideration!\n\nBest regards,\nIvan Pekhov",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-09-20T10:52:13+0000",
            "content": "Sure, it is a quick workaround, to hide these well-known params from the APIs, even if the passwords will continue to leak for those that have shell access to the server.\n\nA perhaps better solution is to provide new implementations of the ACL providers that read credentials from another source than System Properties, see https://lucene.apache.org/solr/guide/6_6/zookeeper-access-control.html#ZooKeeperAccessControl-ControllingCredentials ",
            "author": "Jan Høydahl",
            "id": "comment-16173009"
        },
        {
            "date": "2018-09-07T18:41:49+0000",
            "content": "SOLR-10076 fixed this by default in 7.0, to not show system properties that contain \"password\" (case-insensitively).  You can modify the system properties to hide by setting system property solr.redaction.system.pattern (\".*password.*\" is the default pattern).\n\nIn Solr 6.6.X, sensitive property redaction was not enabled by default.  To enable, set system property solr.redaction.system.enabled to true. ",
            "author": "Steve Rowe",
            "id": "comment-16607501"
        }
    ]
}