{
    "id": "SOLR-7355",
    "title": "Java 8: ConcurrentLinkedHashMap -> Caffeine",
    "details": {
        "components": [],
        "type": "Task",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "When Solr transitions to requiring Java 8, please upgrade to Caffeine. The performance should be relatively the same. The per-instance memory usage should be smaller and Solr may decide to opt-in to use some of the additional features. The only drawback is that the jar size is larger due to code generation, though that may be trimmed over time and usually is not a concern for server-side applications.\n\nConcurrentLinkedHashMap changes will continue to be minimal, even more so now, and driven by requests from Java 6 users unable to upgrade. Caffeine is ideally the upgrade path for Guava cache users too, which due to Android cannot be significantly modified.\n\nCaffeine: https://github.com/ben-manes/caffeine\nBenchmarks: https://github.com/ben-manes/caffeine/wiki/Benchmarks\nConcurrentLinkedHashMap: https://code.google.com/p/concurrentlinkedhashmap",
    "attachments": {
        "SOLR-7355.patch": "https://issues.apache.org/jira/secure/attachment/12723883/SOLR-7355.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-04-07T13:44:09+0000",
            "author": "Shawn Heisey",
            "content": "The SVN trunk (6.0.0-SNAPSHOT) already requires Java 8.  There's a chance that branch_5x will be upgraded to require Java 8 before it is retired to maintenance mode, in the same way that we bumped our requirements to Java 7 with the release of 4.8.0.\n\nIf you check out the trunk code, you can patch it and provide repeatable benchmarks to prove to us that your library will be stable and provide a performance advantage.\n\nhttp://wiki.apache.org/solr/HowToContribute ",
            "id": "comment-14483162"
        },
        {
            "date": "2015-04-07T23:10:17+0000",
            "author": "Ben Manes",
            "content": "This ticket is not an attempt to advocate a competing project, but rather is a notification that ConcurrentLinkedHashMap has reached its end-of-life and will only receive maintenance updates. Similarly Guava's cache is in maintenance mode, performance improvements are not accepted due to a lack of owner, and Guava stay JDK6 due to Android. As the author or co-author of all three caching libraries, this is the upgrade path that I recommend. Solr can instead choose to stay as is or migrate to an alternative library.\n\nDoes Solr have performance tests? The before mentioned benchmarks show that Caffeine has equivalent performance to CLHM v1.4.2. However, Solr uses the older v1.2 dependency which typically performs reasonably well under application load but much worse in a micro-benchmark. That's due to the original focus on avoiding lock contention (Java 5 synchronizers were slow) and later resolving GC pressure under synthetic stress tests. The evolutionary improvements to Caffeine's algorithms mostly reduce memory usage and has only a subtle impact on the performance profile.\n\nCaffeine executes over 1.5 million unit tests and the changes pass Solr's test suite. Any latent bugs will be addressed upon discovery. ",
            "id": "comment-14484300"
        },
        {
            "date": "2015-04-08T00:16:55+0000",
            "author": "Shawn Heisey",
            "content": "I personally am ignorant about both Google's code and your code.  Given that, I have two primary concerns:\n\n\n\tMaking sure the license is compatible and will remain compatible for the foreseeable future.\n\tEnsuring that we don't take a step backwards in performance, and ideally, that performance is improved.\n\n\n\nIf these concerns are not a problem, then I have no opposition to your patch going in, but others may have technical questions or concerns.  If any of those come up, they will need to be addressed. ",
            "id": "comment-14484401"
        },
        {
            "date": "2015-04-08T00:19:02+0000",
            "author": "Shawn Heisey",
            "content": "Is the use of Google's hashmap implementation limited to Solr, or does it go all the way down to Lucene?  There are a number of Lucene benchmarks that are automatically run by our CI servers with each new code update, but I do not know of any specifically for Solr. ",
            "id": "comment-14484406"
        },
        {
            "date": "2015-04-08T00:24:35+0000",
            "author": "Ben Manes",
            "content": "\n\tLicense remains Apache 2.\n\tPerformance should be the same or higher.\n\tA grep for Google's shows it being used primarily for memoization.\n\tSolr appears to use many different caching implementations so its hard, as an outsider, to discern which are performance critical.\n\n ",
            "id": "comment-14484418"
        },
        {
            "date": "2015-04-08T13:14:46+0000",
            "author": "Shawn Heisey",
            "content": "Running 'ant precommit' turned up a missing eol-style on the new license file.  Attached patch fixes that.  Running precommit again. ",
            "id": "comment-14485213"
        },
        {
            "date": "2015-04-08T13:19:19+0000",
            "author": "Ben Manes",
            "content": "Thanks! I thought I fixed that in the last update (accidentally two license files), but looking at it I guess I uploaded the stale patch. ",
            "id": "comment-14485216"
        },
        {
            "date": "2015-04-08T13:35:27+0000",
            "author": "Shawn Heisey",
            "content": "My patch was actually against 5x, which I realized was wrong because it only requires Java 7.  I'm still working on precommit, this time against trunk.  There are a few more problems.\n\nThe precommit target requires a \"python3.2\" binary.  You can use a later python release, as long as you symlink or copy the executable so that one exists for python3.2 as well. ",
            "id": "comment-14485234"
        },
        {
            "date": "2015-04-08T13:38:47+0000",
            "author": "Ben Manes",
            "content": "I saw that too and assumed python3 had to be available, so I brew installed it. The precommit was successful for me, but for the patch that I accidentally didn't upload. ",
            "id": "comment-14485238"
        },
        {
            "date": "2015-04-08T13:40:01+0000",
            "author": "Shawn Heisey",
            "content": "One thing missing is solr/licenses/caffeine-NOTICE.txt – what should this file contain? ",
            "id": "comment-14485240"
        },
        {
            "date": "2015-04-08T13:42:45+0000",
            "author": "Ben Manes",
            "content": "Odd that the patch doesn't show that this was moved,\nA  +    solr/licenses/caffeine-NOTICE.txt\n        > moved from solr/licenses/concurrentlinkedhashmap-lru-NOTICE.txt\n\nThe CLHM was empty, which is acceptable for Caffeine as well. ",
            "id": "comment-14485245"
        },
        {
            "date": "2015-04-08T14:06:35+0000",
            "author": "Shawn Heisey",
            "content": "It seems that CLHM is only used by BlockCache, which is a cache type that I didn't know existed.  The only place this cache seems to be used is HdfsDirectoryFactory and associated tests, so I think that someone from Cloudera will probably need to take a look for a technical discussion.  This definitely would not affect the majority of Solr users. ",
            "id": "comment-14485271"
        },
        {
            "date": "2015-04-08T14:55:25+0000",
            "author": "Shawn Heisey",
            "content": "My svn version is 1.8.8 (newest seems to be 1.8.13).  I see that \"svn stat\" classifies the new license files for Caffeine as moves, but \"svn diff\" is not including those moves in the patch.\n\nMark Miller, can you comment on ConcurrentLinkedHashMap usage in Solr's HDFS support and whether it would be worthwhile to switch to this library from Ben Manes?  My local trunk checkout is ready for a commit, if you think it's a good idea.  Both precommit and solr tests are passing. ",
            "id": "comment-14485337"
        },
        {
            "date": "2015-04-08T15:00:48+0000",
            "author": "Shawn Heisey",
            "content": "New patch, which svn is not creating correctly, so it doesn't reflect changes in the solr/licenses directory.  If local changes are committed, I think it will be fine. ",
            "id": "comment-14485349"
        },
        {
            "date": "2015-04-08T15:37:17+0000",
            "author": "Mark Miller",
            "content": "Shawn Heisey, seems like it's the right upgrade path. ",
            "id": "comment-14485401"
        },
        {
            "date": "2015-04-08T16:23:16+0000",
            "author": "Shawn Heisey",
            "content": "When I tried to commit, I got an error message about \"Inconsistent line ending style\".  The same error has been happening on \"svn diff\".\n\nI've redone the change as straight adds and deletes, no moves.  That got rid of the message on \"svn diff\".  Checking precommit and tests again just to be sure I haven't made a mistake. ",
            "id": "comment-14485467"
        },
        {
            "date": "2015-04-08T16:25:55+0000",
            "author": "Shawn Heisey",
            "content": "New patch which should be 100% complete. ",
            "id": "comment-14485470"
        },
        {
            "date": "2015-04-08T16:41:27+0000",
            "author": "Erick Erickson",
            "content": "One of the line-ending style error message I get when checking in patches produced by others can often by fixed by setting the line-ending to \"native\" with this command:\n\nsvn propset svn:eol-style native <file>\n\nFWIW ",
            "id": "comment-14485501"
        },
        {
            "date": "2015-04-08T16:49:23+0000",
            "author": "Uwe Schindler",
            "content": "My svn version is 1.8.8 (newest seems to be 1.8.13). I see that \"svn stat\" classifies the new license files for Caffeine as moves, but \"svn diff\" is not including those moves in the patch.\n\nYou have to put --show-copies-as-adds into your svn diff command. In that case moves and copies are showing up in a diff as you would expect. Otherwise those patchs can only be applied with svn patch, because the moves/deletes/renames are only listed in the header of the hunks (the header of the hunk only shows old path and new path of file, but no diffs of files itsself, because a move does not change contents) for standard svn diff. ",
            "id": "comment-14485515"
        },
        {
            "date": "2015-04-08T16:52:09+0000",
            "author": "Shawn Heisey",
            "content": "Erick: I did set the eol-style on the new files, required to pass precommit.  It's thoroughly mystifying.\n\nUwe:  I tried building the patch with that option and it didn't change.  Could be a bug with that specific svn version (from an ubuntu package). ",
            "id": "comment-14485520"
        },
        {
            "date": "2015-04-08T17:50:22+0000",
            "author": "Uwe Schindler",
            "content": "Erick: I did set the eol-style on the new files, required to pass precommit. It's thoroughly mystifying.\n\nThose eol-style setting are not used if you apply the patch with standard patch command. \"svn patch\" applies those settings. So you have 2 options:\n\n\tapply patch with \"svn patch\" command - this will handle all renames/moves/deletes and also properties\n\tuse default patch command of OS, but this will not handle moves/deletes and not apply properties. You have to do all of this manually after patching (svn add new files, svn remove old files, add properties).\n\n ",
            "id": "comment-14485639"
        },
        {
            "date": "2015-04-08T17:53:01+0000",
            "author": "Uwe Schindler",
            "content": "\n\thttp://svnbook.red-bean.com/en/1.7/svn.ref.svn.html#svn.ref.svn.sw.show_copies_as_adds\n\thttp://stackoverflow.com/questions/317649/how-to-make-svn-diff-produce-file-that-patch-would-apply-when-svn-cp-or-svn-mv\n\n ",
            "id": "comment-14485644"
        },
        {
            "date": "2015-04-08T18:23:21+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1672133 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1672133 ]\n\nSOLR-7355: Switch from ConcurrentLinkedHashMap to Caffeine.  Trunk-only change, as it requires java 8. ",
            "id": "comment-14485721"
        },
        {
            "date": "2015-04-08T18:24:06+0000",
            "author": "Shawn Heisey",
            "content": "Finally committed.  First test run failed with a single-test failure that I see in recent email from Jenkins.  Second run passed. ",
            "id": "comment-14485735"
        },
        {
            "date": "2015-04-08T18:39:31+0000",
            "author": "Uwe Schindler",
            "content": "I somehow miss the version number in ivy-versions.properties. Maybe you only committed Solr subdir? ",
            "id": "comment-14485761"
        },
        {
            "date": "2015-04-08T19:40:29+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1672151 from Shawn Heisey in branch 'dev/trunk'\n[ https://svn.apache.org/r1672151 ]\n\nSOLR-7355: Accidentally committed from solr directory before. ",
            "id": "comment-14485875"
        },
        {
            "date": "2015-04-08T19:51:41+0000",
            "author": "Erick Erickson",
            "content": "Uwe:\n\nI usually see eol-style errors during precommit when I'm applying\nother people's patches. Thanks for the tip though, I'll use it on my\npatches...\n\n\n ",
            "id": "comment-14485891"
        }
    ]
}