{
    "id": "SOLR-10367",
    "title": "fl should support regular expressions for retrieval",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SearchComponents - other"
        ],
        "type": "New Feature",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Solr currently supports only two syntax for retrieving fields.\nfl = * (Retrieves all stored fields)\nfl = fl1, fl2, fl3, (retrieves  stored fields explicitly specified) \n\nAnd this is insufficient for many needs. And there are additional features/syntaxes that would be really handy.\nCase 1 :  Dynamic fields ( field names are prefixed/suffixed/name-spaced)\nfl=*\nfl.prefix = <prefix>.*\nfl.suffix = *.<suffix>\nor even better\nfl.ftype=<field-type>\n\nCase 2:  Field Names are explicitly namespaced by user \nfl =*\nfl = <regular-expression> \n\nImplementation wise this can be achieved by firing a LukeRequest handler to resolve the fields .. We have to be carefully see its impact on document cache keys and size but for starters we can just mark the feature an experimental and disable the document cache for wildcard support. \nSimilarly  there are a lot of cases, where user has explicitly stored huge fields for completeness sake and usually never needs it.\n  Currently we have includeOnly syntax in case of fl but something like\nfl.exclude=<field-name|regex-on-field-name> will be immensely useful.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-27T05:19:23+0000",
            "content": "This has been on my list forever. It seems like this could be something that's part of this JIRA, a way to say \"exclude these fields\".\nThe use-case here is that you have a few huge fields that you usually don't want returned, so the default is \"return all fields except X,Y,Z\"\nIf you're going to work on this JIRA, please feel free to assign SOLR-3191 to yourself, it'll relieve my guilt over not getting to it for so long. ",
            "author": "Erick Erickson",
            "id": "comment-15942664"
        }
    ]
}