{
    "id": "SOLR-6385",
    "title": "Strange behavior on indexing document with wrong date format",
    "details": {
        "affect_versions": "4.7.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Hello.\nI try to work with solr lately and did not get much experience with it yet, so part of problems that I will describe here can be due to lack of knowledge.\nExcuse me for that.\n\nProblems that I saw:\n\n1) I use solj to index collection of SolrInputDocuments.\nTo do it I call method add(Collection) of CloudSolrServer object.\nJust for fun I tried to index one of documents with not correct date:\nI took solr valid date value of one of these SolrInputDocuments and changed the \"T\" symbol in it to \"K\".\n(this date is defined in schema.xml as \n<field name=\"mydate\" type=\"tdate\" indexed=\"true\" stored=\"true\" multiValued=\"false\" />\t)\nSolr failed to index collection and returned SolrServerException.\n\nAlso what happened above is that part of documents of this SolrInputDocuments collection got indexed correctly, problematic date document failed to be indexed together with several valid (from all points of view) SolrInputDocuments of this collection.\nLooks like solr went through documents in collection, indexing them one by one, trowed exception on problematic date document and finally did not index all valid documents that were after problematic date document.\n\n\n2) After failure, described in 1), solr kept problematic date document in some queue and tried to reindex this document again (attempt per some 3-5 minutes, did not measure exact time of that), showing same (failed to parse date) exception in logs! After solr server restart issue is gone: no more tries to reindex problematic date document.\n\n\nQuestions to be answered\n\n1) What is the default behavior of solr on indexing problematic values fields? \nFor example for date field: I expect solr to index null date (instead of not indexing of whole document) and then write some warning to logs and return some indication of problem on UpdateResponse. \nMaybe solr behavior on not valid field values should be configurable (defined in some xml element in schema).\n\n2) While indexing collection of documents, should solr index all valid documents (and not return on first problem as it happens now) ?\nIf I index collection of documents, I expect solr to index all valid (from all points of view) documents and return indexing status on UpdateResponse about all not indexed problematic documents.\n\n3) Why solr tries to reindex problematic document? Looks like bug that can create useless load on server.\nIf this behavior is planned by design, then how can I force solr to stop reindexing such problem documents (without restarting of solr server)?\nWhere can I read about it?\n\nThank you.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "shubh.hive",
            "id": "comment-14108224",
            "date": "2014-08-24T02:10:31+0000",
            "content": "Erick Erickson responded to this on the dev mailing list. \nCan this be closed? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14108260",
            "date": "2014-08-24T04:33:37+0000",
            "content": "Discussed on mailing lit. Plus, the whole question of what to do when one document in a batch is bad, or how to deal with errors in asynchronous requests has other JIRAs. "
        },
        {
            "author": "Denis Shishlyannikoc",
            "id": "comment-14108280",
            "date": "2014-08-24T06:08:32+0000",
            "content": "Hello guys. Thank you for quick response.\nCan I have here link to place in dev mailing list where this issue was commented? \nThank you! "
        },
        {
            "author": "Denis Shishlyannikoc",
            "id": "comment-14108281",
            "date": "2014-08-24T06:10:35+0000",
            "content": " Erick Erickson, can you be more specific when talking about other JIRAs? \nThanks. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14108283",
            "date": "2014-08-24T06:21:33+0000",
            "content": "https://issues.apache.org/jira/browse/SOLR-445 "
        }
    ]
}