{
    "id": "SOLR-5164",
    "title": "In some cases, creating collections via the Collections API due to core being created in the wrong directory",
    "details": {
        "affect_versions": "4.5,                                            6.0",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Critical",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When you try to create a collection in SolrCloud, the instanceDir that gets created has an extra \"solr\" in it which messes up the pathing for all the <lib> directives in solrconfig.xml as they're all relative.",
    "attachments": {
        "SOLR-5164.patch": "https://issues.apache.org/jira/secure/attachment/12598337/SOLR-5164.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13741601",
            "date": "2013-08-15T22:37:32+0000",
            "content": "In a cloud (or manually sharded) environment, IMHO it's better to put jars in $solrhome/lib because they'll be automatically loaded at startup and available to all cores.\n\nBecause we can't assume symlink support, it's really difficult to use this method with the example. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13741756",
            "date": "2013-08-16T00:55:19+0000",
            "content": "Alan Woodward Well, this has to be the most time I've spent changing about 4 lines.\n\nIf you can please take a glance at it. These seem fairly safe changes, they both just bring back what was in the code a while ago. Besides the solr/solr issue, when creating a properties file in Cloud mode, it appears that the parent directory hasn't been created first, so that step was failing.\n\nIf you don't apply it (and backport it to 4.4) I'll do it in the morning. But you have a 5 hour head start <G>...\n "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13741783",
            "date": "2013-08-16T01:18:50+0000",
            "content": "Shawn Heisey It's not a matter of putting the jars in the right place at all. The core was just being created in the wrong place so the relative pathing from the stock solrconfig.xml couldn't work. The Carrotsearch classes that couldn't be found are part of the stock solrconfig distribution.... "
        },
        {
            "author": "Alan Woodward",
            "id": "comment-13742014",
            "date": "2013-08-16T08:01:41+0000",
            "content": "Related:  SOLR-5099.\n\nI think we need an explicit test for creating collections via the API, though.  It's a bit scary that this bug can occur without the test suite complaining about it.  I'm busy for the next couple of days, but will have some time next week if nobody else gets there first. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13742098",
            "date": "2013-08-16T11:01:24+0000",
            "content": "Blast, I wish I'd paid more attention to SOLR-5099, it'd have saved me some time. Sigh..\n\nAlan Woodward I looked and there are some collection creation tests, but I didn't dig enough to understand completely why the second solr in the path didn't trip this condition. What it didn't seem like we have was a way to restart from scratch. And in the case of SOLR-5099, core creation does succeed it's the restart that's the problem.\n\nFWIW. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13742134",
            "date": "2013-08-16T12:01:07+0000",
            "content": "Commit 1514666 from Erick Erickson in branch 'dev/trunk'\n[ https://svn.apache.org/r1514666 ]\n\nSOLR-5164, Can not create a collection via collections API (cloud mode). Fixes SOLR-5099 too "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13742162",
            "date": "2013-08-16T12:43:15+0000",
            "content": "Commit 1514684 from Erick Erickson in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1514684 ]\n\nSOLR-5164, Can not create a collection via collections API (cloud mode). Fixes SOLR-5099 too "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13742252",
            "date": "2013-08-16T14:20:14+0000",
            "content": "We should add a test case to the collections api that catches this.\n\nAlso, did this affect 4.4? The Affects versions seems to indicate not? If thats the case, there should be no separate changes entry. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13742258",
            "date": "2013-08-16T14:23:34+0000",
            "content": "I've reopened SOLR-5099 as well - tests for these bugs are as important as the fixes. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13742259",
            "date": "2013-08-16T14:23:39+0000",
            "content": "yeah, we should have a test, but this has been a pretty big rathole for me already and I didn't see a simple way to create a test, see my comment earlier.\n\nNo, it didn't affect 4.4 so I'll take the entry out of CHANGES.txt in the next JIRA I fix (should be this morning sometime).\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13742261",
            "date": "2013-08-16T14:27:03+0000",
            "content": "but this has been a pretty big rathole for me already and I didn't see a simple way to create a test\n\nThat's fine, but please don't resolve the issue then. Bug fixes for really ugly issues like these absolutely need tests to make sure they don't keep coming back. We have seen that type of thing a lot recently - we fix something like this and it just breaks a couple months later in a new refactoring. You don't have to write the tests, but you might ask for some advice or help from someone else on it before resolving the issue. I'm happy to help make sure these problems have tests. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13742360",
            "date": "2013-08-16T16:28:57+0000",
            "content": "Well, the code is fixed, how about raising another JIRA instead? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13742388",
            "date": "2013-08-16T16:59:30+0000",
            "content": "I don't consider this fixed without a test. The two issues are critical and somewhat complicated issues.\n\nI'm going to write the tests - without them, we only have your word they are fixed today and a random guess they will still be fixed tomorrow or the next day. These two issues are much too critical to not consider a test part of the issue.\n\nI'll finish the issues. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13742533",
            "date": "2013-08-16T19:12:30+0000",
            "content": "Commit 1514857 from Mark Miller in branch 'dev/trunk'\n[ https://svn.apache.org/r1514857 ]\n\nSOLR-5164: add relative solr.home testing to some tests, explicitly check for expected instanceDir handling with relative solr.home\nSOLR-5099: explicity check for proper solrcore.properties creation\nSpeed up some tests by setting leaderVoteWait to 0 "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13742537",
            "date": "2013-08-16T19:15:21+0000",
            "content": "Commit 1514858 from Mark Miller in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1514858 ]\n\nSOLR-5164: add relative solr.home testing to some tests, explicitly check for expected instanceDir handling with relative solr.home\nSOLR-5099: explicity check for proper solrcore.properties creation\nSpeed up some tests by setting leaderVoteWait to 0 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13742719",
            "date": "2013-08-16T23:36:35+0000",
            "content": "I added some new important testing - we were not testing with a relative solr.home at all really - now it randomly uses one. I also added explicit testing to make sure the instance dir for collections api created cores is correct. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13742817",
            "date": "2013-08-17T03:20:57+0000",
            "content": "Commit 1514939 from Mark Miller in branch 'dev/trunk'\n[ https://svn.apache.org/r1514939 ]\n\nSOLR-5164: fix relative solr.home testing on Windows "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13742819",
            "date": "2013-08-17T03:22:22+0000",
            "content": "Commit 1514940 from Mark Miller in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1514940 ]\n\nSOLR-5164: fix relative solr.home testing on Windows "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787097",
            "date": "2013-10-05T10:19:12+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}