{
    "id": "SOLR-907",
    "title": "Include access to Lucene Source with 1.4 release",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "If Solr 1.4 release with a non-release version of Lucene, please include some way to access the exact source code for the Lucene libraries that are included with Solr. This could take the form of Maven2 Repo source files, a subversion location and revision number, including the source with the distribution, etc.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12656264",
            "date": "2008-12-13T08:08:57+0000",
            "content": "anytime lucene jars are upgraded, the CHANGES.txt file lists the version – if it's not an already released version, then the CHANGES.txt includes the subversion revision, ala...\n\n\n 9. SOLR-819: Upgraded to Lucene 2.9-dev (r724059) to get access to Arabic public constructors (gsingers)\n\n\n\nThis information is also accessible without access to CHANGES.txt by inspecting the lucene-*.jar manifest files, and is exposed in the Solr admin console on /admin/registry.jsp ...\n\n\nLucene Implementation Version: 2.9-dev 724059 - 2008-12-06 20:08:54\n\n\n\nOnce you have the subversion revision number, getting the source is trivial...\n\n\nsvn co https://svn.apache.org/repos/asf/lucene/java/trunk@724059 lucene-r724059\n\n\n\n\nIs there really anything else we need to do?\n "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12732226",
            "date": "2009-07-16T22:53:49+0000",
            "content": "resolving as invalid since what was asked for (a way to know exactly which \"version\" of lucene (official, or svnversion if unofficial) has already been part of solr for some time.\n\nif someone wants to take this further (auto fetch in source jars from maven or what not) feel free to reopen. "
        }
    ]
}