{
    "id": "SOLR-8894",
    "title": "Support automatic kerberos ticket renewals in standalone Solr",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Currently in standalone Solr mode , tickets are not renewed automatically. So once a ticket expires one has to restart the solr node for it to renew the ticket.\n\nWe should support automatic ticket renewals in standalone solr as we do currently in cloud mode.\n\nThere is no workaround for this other than to restart Solr.  \n\nIf we manually do a kinit ( so that we can set a cron to do future kinit's ) and then start Solr , Solr doesn't start up correctly. Steps we tried for the workaround:\n\n\n\tSpecify useKeyTab=false in the JAAS fle and then manually do a kinit and then start solr. So fails to start in this case and throws an error like this\n\nERROR - 2016-03-14 20:07:03.505; [   ] org.apache.solr.common.SolrException; null:org.apache.solr.common.SolrException: Error initializing kerberos authentication plugin: javax.servlet.ServletException: org.apache.hadoop.security.authentication.client.AuthenticationException: javax.security.auth.login.LoginException: No key to store",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-24T13:15:55+0000",
            "author": "Ishan Chattopadhyaya",
            "content": "If we cannot find a workaround for this, I suggest that instead of writing custom TGT renewal code, we drop support for standalone users in the kerberos authentication plugin.\n\nCurrently, for SolrCloud, the TGT renewals can be taken care of by the zk client (if Solr nodes are connected to kerberized zk using the same zk client principal as its service principal for the kerberos authentication plugin) [0]. An alternative way is to use the ticket cache, and use kinit from the command line to renew the ticket, perhaps using a cronjob. If the latter is not working for standalone for some reason, which is what I believe you have tried and you find that it is not working, we should rather drop support for standalone users altogether. In such a case, a user interested in using kerberos authentication with standalone solr could use a forked version of the plugin from a separate repository and add the ticket renewal support and use the plugin.\n\nWhat do you think, Anshum Gupta, Noble Paul?\n\n[0] - https://issues.apache.org/jira/browse/ZOOKEEPER-1181 ",
            "id": "comment-15210192"
        }
    ]
}