{
    "id": "SOLR-2466",
    "title": "CommonsHttpSolrServer will retry a query even if _maxRetries is 0",
    "details": {
        "affect_versions": "1.4.1,                                            3.1,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "3.2"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The HttpClient library used by CommonsHttpSolrServer will retry by default 3 times a request that failed on the server side, even if the _maxRetries field of  CommonsHttpSolrServer is set to 0.\nThe retry count should be managed in just one place and CommonsHttpSolrServer seems to be the right one. \nCommonsHttpSolrServer should override that HttpClient default to 0 retries, and manage the retry count with the value of the field _maxRetries.",
    "attachments": {
        "SOLR-2466.patch": "https://issues.apache.org/jira/secure/attachment/12476500/SOLR-2466.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-13019021",
            "date": "2011-04-12T20:31:53+0000",
            "content": "Hmmm, that's interesting.  Does anyone know why we (CommonsHttpSolrServer) do retries when HttpClient already does them?  Is there an advantage to doing it ourselves? "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13019028",
            "date": "2011-04-12T20:44:23+0000",
            "content": "Not sure why Solr does it on CommonsHttpSolrServer. I do think is important to be able to specify the exact number of retries.  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13019030",
            "date": "2011-04-12T20:49:12+0000",
            "content": "I haven't checked hte code but if i remember correctly (from another project) HttpClient and it's RetryHandler \"hook\" are only used when dealing with network failures – ie: connection refused, connection timeout, connection aborted.  If a request is a success at the TCP layer, but a failure at the HTTP layer (ie: 500) then you need your own retry logic external to the HttpClient\n\nthat may be what SolrJ is doing, to account for transient errors (ie: trying to add during a blocking commit or something like that) "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13020496",
            "date": "2011-04-16T00:04:36+0000",
            "content": "Here's a patch that sets retry to 0 in HttpClient and lets SolrJ to the retry based on it's count. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13020508",
            "date": "2011-04-16T00:39:38+0000",
            "content": "committed to 3x and trunk. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043575",
            "date": "2011-06-03T16:44:51+0000",
            "content": "Bulk close for 3.2 "
        }
    ]
}