{
    "id": "SOLR-3509",
    "title": "Print support in Web UI",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Please try printing the various pages and decide if they need different layouts or formatting. For example, it would help if all characters are in black, not grey.\n\nI have attached a sample printout of the UI.",
    "attachments": {
        "Solr Admin (172.16.10.99).pdf": "https://issues.apache.org/jira/secure/attachment/12532982/Solr%20Admin%20%28172.16.10.99%29.pdf",
        "SOLR-3509.patch": "https://issues.apache.org/jira/secure/attachment/12532739/SOLR-3509.patch",
        "NewUI_Print_Problems.pdf": "https://issues.apache.org/jira/secure/attachment/12530882/NewUI_Print_Problems.pdf"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13397753",
            "date": "2012-06-20T18:43:17+0000",
            "content": "First Patch, using existing Styles only for media=\"screen\", so you have at least typical black on white for printing. \n\nCommon elements like the header, the menu & the footer are hidden in the Print-Stylesheet. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13399040",
            "date": "2012-06-22T00:51:50+0000",
            "content": "Under firefox, Safari and Opera (on MacOS) these print out without any formatting- instead it only prints the text in standard HTML header, section 1 etc. format. Very 1994  I've attached the Replication Handler menu (Replication is off). "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13399163",
            "date": "2012-06-22T06:43:10+0000",
            "content": "I know Lance - perhaps i stated this not clear enough, the first step was only meant to be a \"reset\" .. to avoid having screen-styles being printed. styling every screen for a nice print layout is very time-consuming, therefore i'll add them only in little steps. "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13400074",
            "date": "2012-06-23T23:31:16+0000",
            "content": "I understand that redoing for print would be a big project. Is it easier to allow multiple screen themes? Printing just needs the screen in black&white and maybe boldface text. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13400803",
            "date": "2012-06-25T19:20:36+0000",
            "content": "Printing just needs the screen in black&white and maybe boldface text.\nas you mentioned in the previous comment - this is not enough. it's about hiding buttons, menus and arranging things.\n\nIs it easier to allow multiple screen themes?\nTalking about SOLR-3554? Depends a bit on what you're expecting? Possibility in the UI to change between different themes? Or choosing one of them while starting?  "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13400905",
            "date": "2012-06-25T21:10:26+0000",
            "content": "Right, SOLR-3554. I'll switch to there. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539911",
            "date": "2016-10-02T07:12:02+0000",
            "content": "SOLR-3554 has been closed. For this one, I am curious which screens make sense to print at all. Especially if compared with just doing a screenshot.\n\nI could think of maybe properties screen, but it frequently overflows the content area, so requires interaction to see the individual elements.\n\nThe query result screens are easier to just open in a separate window without the clutter of UI. \n\nAnalysis screen is probably easiest with screenshot.\n\nIn short, I am not sure what the specific use-case here is to benefit from our - very limited - UI attention span. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15557429",
            "date": "2016-10-08T07:10:36+0000",
            "content": "Printing Admin UI is a very edge-case. If somebody see the specific improvements requirements and wants to work on it, the case can be reopened or more-specific individual cases can be worked on. "
        }
    ]
}