{
    "id": "SOLR-45",
    "title": "enable thresholded field compression for certain field types",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.1.0"
        ],
        "components": [
            "update"
        ],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Adds a CompressableField abstract base class from which fieldtypes may inherit.  Fields of these types may specify compressed=\"true\" in the field definition to turn on compression.  The field type takes an optional compressThreshold parameter which will only turn on compression for fields whose internal representations of greater or equal to a given size.\n\nTextField and StrField inherit from CompressableField\n\nComments? (my main issue is that it woudl be nice to be able to set compressThreshold at the field level.  Since we can't without modifying fields to accept named parameters, perhaps it would be preferrable to only allow compress=true/false to be set at the fieldtype leve)",
    "attachments": {
        "ASF.LICENSE.NOT.GRANTED--compress_patch.diff": "https://issues.apache.org/jira/secure/attachment/12340226/ASF.LICENSE.NOT.GRANTED--compress_patch.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12432925",
            "date": "2006-09-06T18:27:23+0000",
            "content": "Looks good.  I'd leave things as you have them.\nI think allowing compressTheshold at the fieldtype level is better than not allowing it at all.\n\nIf I could re-do Solr, I think I would try to eliminate fieldtype alltogether and substitute it with field inheritance.\n "
        },
        {
            "author": "Mike Klaas",
            "id": "comment-12432942",
            "date": "2006-09-06T19:18:53+0000",
            "content": "Commited slightly modified patch in r440837 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12589328",
            "date": "2008-04-15T23:56:42+0000",
            "content": "This bug was modified as part of a bulk update using the criteria...\n\n\n\tMarked (\"Resolved\" or \"Closed\") and \"Fixed\"\n\tHad no \"Fix Version\" versions\n\tWas listed in the CHANGES.txt for 1.1\n\n\n\nThe Fix Version for all 38 issues found was set to 1.1, email notification\nwas suppressed to prevent excessive email.\n\nFor a list of all the issues modified, search jira comments for this\n(hopefully) unique string: 20080415hossman3 "
        }
    ]
}