{
    "id": "SOLR-9065",
    "title": "Migrate solrj tests from AbstractDistribZkTestBase to SolrCloudTestCase",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.0,                                            6.1",
        "status": "Resolved",
        "resolution": "Implemented",
        "priority": "Major"
    },
    "description": "AbstractDistribZkTestBase sets up collections using the legacy core-based system, and does a lot of comparing things against control collections that the SolrJ tests really don't require.  We should migrate these tests to using SolrCloudTestCase instead.",
    "attachments": {
        "SOLR-9065.patch": "https://issues.apache.org/jira/secure/attachment/12802184/SOLR-9065.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-05-04T13:31:12+0000",
            "author": "Alan Woodward",
            "content": "This patch migrates the following test classes:\n\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/impl/CloudSolrClientTest.java\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/io/graph/GraphExpressionTest.java\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/io/graph/GraphTest.java\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/io/sql/JdbcTest.java\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/io/stream/JDBCStreamTest.java\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/io/stream/StreamExpressionTest.java\n\tsolr/solrj/src/test/org/apache/solr/client/solrj/io/stream/StreamingTest.java\n\n\n\nRunning 'ant test -Dtests.slow=true' in solrj goes from 5 mins before this patch to 2mins 20seconds afterwards on my machine.\n\nIt also includes a couple of small usability changes to UpdateRequest and CollectionAdminRequest. ",
            "id": "comment-15270624"
        },
        {
            "date": "2016-05-04T17:12:01+0000",
            "author": "Hoss Man",
            "content": "+1\n\nIn general, it makes sense to have some tests still do the \"comparing things against (single core) control collections\" but most tests don't need it, and starting with these tests is a great start. ",
            "id": "comment-15271010"
        },
        {
            "date": "2016-05-04T19:18:54+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 630a8c950d89064b7f2e8dbe865f964a21f9f501 in lucene-solr's branch refs/heads/master from Alan Woodward\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=630a8c9 ]\n\nSOLR-9065: Migrate SolrJ tests to SolrCloudTestCase ",
            "id": "comment-15271249"
        },
        {
            "date": "2016-05-04T19:19:20+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 7a8d4947a5f85f8eb7c6103292d2f5e9a8112ede in lucene-solr's branch refs/heads/branch_6x from Alan Woodward\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7a8d494 ]\n\nSOLR-9065: Migrate SolrJ tests to SolrCloudTestCase ",
            "id": "comment-15271251"
        },
        {
            "date": "2016-05-04T19:19:58+0000",
            "author": "Alan Woodward",
            "content": "Thanks Hoss ",
            "id": "comment-15271254"
        },
        {
            "date": "2016-05-05T16:56:24+0000",
            "author": "Joel Bernstein",
            "content": "Can we revert this ticket? I have a bunch of test cases ready to go for the 6.1 release for the new Graph traversal features. This has blindsided me completely. ",
            "id": "comment-15272623"
        },
        {
            "date": "2016-05-05T16:59:46+0000",
            "author": "Joel Bernstein",
            "content": "A large patch went up yesterday for this ticket. Then it's committed very quickly without consulting the people who are working with these test cases. ",
            "id": "comment-15272634"
        },
        {
            "date": "2016-05-05T17:09:59+0000",
            "author": "Joel Bernstein",
            "content": "I'm going to put the old version of the GraphExpressionTest back in place so I can move forward. ",
            "id": "comment-15272653"
        },
        {
            "date": "2016-05-05T17:51:57+0000",
            "author": "Erick Erickson",
            "content": "The wholesale reworking of the tests is making keeping 8467 up to date \"interesting\". Do we have a good read on when 6.1 will be coming out? If it's very far in the future I'd like to put 8467 to bed. ",
            "id": "comment-15272713"
        },
        {
            "date": "2016-05-05T17:55:49+0000",
            "author": "Joel Bernstein",
            "content": "The wholesale reworking of tests needs to be coordinated with the people who wrote the original tests and maintain those tests. ",
            "id": "comment-15272723"
        },
        {
            "date": "2016-05-05T18:10:42+0000",
            "author": "Joel Bernstein",
            "content": "The following test cases were clearly under development at the time when this ticket was committed:\n\nsolr/solrj/src/test/org/apache/solr/client/solrj/io/graph/GraphExpressionTest.java\nsolr/solrj/src/test/org/apache/solr/client/solrj/io/graph/GraphTest.java\nsolr/solrj/src/test/org/apache/solr/client/solrj/io/sql/JdbcTest.java\nsolr/solrj/src/test/org/apache/solr/client/solrj/io/stream/JDBCStreamTest.java\nsolr/solrj/src/test/org/apache/solr/client/solrj/io/stream/StreamExpressionTest.java\nsolr/solrj/src/test/org/apache/solr/client/solrj/io/stream/StreamingTest.java\n\nAll that needed to be done was to notify the committers who maintain these tests and let them know a wholesale change was coming. Then there could have been a conversation about how to move forward without stepping on peoples work. Instead a patch went up and the next day it was committed. \n ",
            "id": "comment-15272751"
        },
        {
            "date": "2016-05-05T18:10:49+0000",
            "author": "Mark Miller",
            "content": "We have a commit then review policy and generally favor forward progress.\n\nI appreciate that Alan's work here has caused some concern around other work and 6.1. So what? Alan's work was fine and had multiple eyes on it. Now there are more eyes and Alan will be open to working with them as he always is.\n\nIf one of the tests that was converted needs to be un-converted or briefly un-converted, so what? Perhaps there are other short term options as well. It's a large code base and many issues cross a lot of code. We will step on each other's toes, it's part of the game. ",
            "id": "comment-15272752"
        },
        {
            "date": "2016-05-05T18:29:12+0000",
            "author": "Joel Bernstein",
            "content": "Yeah, but this was a wholesale change, committed one day after the patch went up. \n\nIt's not hard to some have consideration for other peoples work. A simple heads up will suffice. ",
            "id": "comment-15272796"
        },
        {
            "date": "2016-05-05T18:30:30+0000",
            "author": "Mark Miller",
            "content": "There was a heads up on this issue. 9 times out of 10, this would have caused no concern. These kind of changes are made all the time. If we had to reach out to each person that might give a damn and wait a week for every change, we would slow down a little.\n\nIt's commit then review. Alan committed, now you are reviewing. That is how we do it. ",
            "id": "comment-15272797"
        },
        {
            "date": "2016-05-05T18:50:15+0000",
            "author": "Joel Bernstein",
            "content": "But this patch had 7000 lines of code and it went up yesterday. I think that's too fast.  ",
            "id": "comment-15272830"
        },
        {
            "date": "2016-05-05T19:04:43+0000",
            "author": "David Smiley",
            "content": "I agree with Joel.  And I don't think there's any hard feelings, just a \"shout out\" as Joel said would have been great.  Alan Woodward can you please send a message to the dev list to announce your refactoring plans/schedule so help us coordinate our efforts?  That would be very helpful – thanks in advance. ",
            "id": "comment-15272873"
        },
        {
            "date": "2016-05-05T19:38:42+0000",
            "author": "Joel Bernstein",
            "content": "There are no hard feelings. I think the patch looks good. I've already re-worked what i needed to in the GraphExpressionTest.  ",
            "id": "comment-15272930"
        },
        {
            "date": "2016-05-05T20:08:23+0000",
            "author": "Mark Miller",
            "content": "just a \"shout out\" \n\nFollow the mailing list. We are not a review then commit project. The result that happened is how this should work. Then 9 out of 10 times we move fast, and once we make an adjustment to the commit.\n\nEveryone just needs to relax. No one owns any area of the code, no one has to be checked with before changes. It's on anyone who cares to follow email and JIRA. This did not appear to be a controversial change, a patch went up, hossman +1'd.\n\nThis is how it's all supposed to work. ",
            "id": "comment-15272968"
        },
        {
            "date": "2016-05-05T20:21:13+0000",
            "author": "David Smiley",
            "content": "I think there may be a misunderstanding of what Joel and I mean by a \"shout out\".  We don't mean a review of a patch (yes, that would then be RTC).  We mean a helpful and courteous notice to the dev list (not a comment on an issue).  This is very much like what Hoss is doing with the whole JIRA master/6.0 versioning issue.  Both this issue and that one have the potential for a wide impact which is why we suggest a \"shout out\" first.  I'm relaxed; I hope you feel relaxed too and Alan and Joel  ",
            "id": "comment-15273001"
        },
        {
            "date": "2016-05-05T22:39:19+0000",
            "author": "Alan Woodward",
            "content": "can you please send a message to the dev list to announce your refactoring plans/schedule so help us coordinate our efforts? \n\nWill do so in the next couple of days.  Sorry for stepping on your toes, guys. ",
            "id": "comment-15273247"
        },
        {
            "date": "2016-05-05T23:26:27+0000",
            "author": "Joel Bernstein",
            "content": "No problem, and thanks for your work on the tests. It's a big improvement! ",
            "id": "comment-15273314"
        },
        {
            "date": "2016-08-29T13:34:33+0000",
            "author": "Mikhail Khludnev",
            "content": "Alan Woodward, can you consult me about distributed search testing? There is BaseDistributedSearchTestCase subclass in SOLR-5725.patch. It doesn't need Zookeeper, certainly, it's quite beneficial from _ \"comparing things against (single core) control collections\"_. Is it worth to move it to SolrCloudTestCase??  ",
            "id": "comment-15445892"
        },
        {
            "date": "2016-08-31T08:29:53+0000",
            "author": "Alan Woodward",
            "content": "Hi Mikhail, it sounds as though for that case you don't need SolrCloudTestCase - it's only for situations where you want to set up a Cloud-mode cluster, ie one where you need Zookeeper for cluster management.  If you're just testing single-core vs distributed, then BaseDistributedSearchTestCase is fine. ",
            "id": "comment-15451583"
        },
        {
            "date": "2018-02-01T17:57:01+0000",
            "author": "Jon Harper",
            "content": "This patch broke the binary compatibility of solrj's SolrInputDocument class. Before it had a noarg constructor and now it only has the String... constructor. So code compiled against 6.0.1 that does \"new SolrInputDocument()\" raises NoSuchMethodError when run with version 6.1.0. It's still source compatible so a recompilation of the same source against a newer version will generate the correct constructor call.\n\nI'm not sure if that's important to you, but adding back the no-arg constructor would help when using different dependencies that are compiled against different solrj versions.\n\nCheers,\nJon ",
            "id": "comment-16349005"
        }
    ]
}