{
    "id": "SOLR-12349",
    "title": "Update Web-site \"Features\" section",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "website"
        ],
        "type": "Task",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "The page http://lucene.apache.org/solr/features.html is a long list of features. On the top, the most prominent Solr features are highlighted in a \"sales-like\" manner with a graphical icon and short description. Below that are sections with more in-depth descriptions of various aspects of Solr:\n\nData Handling, Query, Facets, Discovery, Plugins & Extensions, Statistics & Aggregations, Spatial, Rich Content, Performance, Scaling, Admin Interface\n\nHowever, this page is lagging behind and should be reworked (not just add to the end) to capture and highlight recent features such as:\n\n\tStreaming Expressions\n\t\n\t\tSQL & JDBC\n\t\tJoins\n\t\tStatistical engine\n\t\tGraph\n\t\tML\n\t\n\t\n\tAuto scaling & Metrics\n\tCDCR and HA\n\tLTR\n\tSecurity\n\t...more\n\n\n\nI think perhaps a key to success is to dare to remove some content that perhaps was impressive at the time but not worthy a mention anymore",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2018-06-01T09:05:04+0000",
            "content": "Cassandra Targett do you know if anyone at LW have the skills to pull this off? We might need to create some new graphics in-line with the style guide and do some \"copywriting\".\n\nI also feel that our website is fairly week when it comes to highlighting new features. We have generic release announcements with a boring bullet list to highlight the changes. But we don't have anything on the landing page or features page showing what is new and cool, with supporting graphics or screenshots. Things like this take time to write, but perhaps if we had an ambition to write a new \"blog-style\" page on the Solr website when releasing a new major version (i.e. once a year), then that page i.e. \"Highlights of Solr 8\" could showcase the new features in 8.0 including worthy candidates from 7.x versions the last year. We could then prominently link to this page from the top of the landing page. WDYT? ",
            "author": "Jan Høydahl",
            "id": "comment-16497758"
        },
        {
            "date": "2018-06-02T04:44:08+0000",
            "content": "The website redesign that was done a few years ago was done by someone who is no longer with Lucidworks, and the role he had has been restructured entirely. So, there are people who work at Lucidworks who know how to make a website, but they will not be able to help us in the short term, if I'd even be able to get it into their schedule at all.\n\nI'm all for a more dynamic approach to presenting new features, and tightening up how older existing features are presented, but I don't think any of us are graphic designers. We're on our own, really, so we probably just have to dive in and do the best we can in a way we can easily maintain it in the future. ",
            "author": "Cassandra Targett",
            "id": "comment-16498865"
        }
    ]
}