{
    "id": "SOLR-10288",
    "title": "Javascript housekeeping in UI",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "6.4.2",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I noticed a couple of things about the javascript files included in Solr for the Admin UI:\n\n\n\tThere is unnecessary duplication between the \"js\" and \"libs\" directories.\n\tSome of the files are not minified, and for some of those that are, the non-minified originals are still included in the binary release.\n\n\n\nRemoving the duplicates entirely and the non-minified files from the binary release would shave a little bit of size off of the binary download.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-03-15T15:39:29+0000",
            "content": "Shawn:\n\nI only cheer from the sidelines for the GUI stuff, but wondered if any of the duplication is a result of having both the old and new admin UIs? When we eliminate the old UI would the duplicates go away? ",
            "author": "Erick Erickson",
            "id": "comment-15926381"
        },
        {
            "date": "2017-03-15T15:50:11+0000",
            "content": "I only cheer from the sidelines for the GUI stuff\n\nThat's me too. \n\nIf the duplication is because of new/old UIs, then IMHO it should not have been duplicated.  If the new UI required new locations, then the old UI could be updated with those locations, and we could have a note somewhere indicating what can be deleted when the old UI is removed.\n\nThe difference in the download from this housekeeping would probably only be a few hundred kilobytes, but if everybody feels it's OK to increase the download by a few hundred KB when they build a new feature, the download size might get up to 150MB before you know it.  Oh, wait... ",
            "author": "Shawn Heisey",
            "id": "comment-15926400"
        },
        {
            "date": "2017-03-15T16:11:47+0000",
            "content": "I think what Erick was trying to say that we have New and Old UI and they both have their own javascript (and CSS) libraries. They are not identical, so cannot be rolled together or just deleted (at least until old UI is deleted in 7.0).\n\nOn the other hand, yes, there could be significant improvements regarding minification and other issues around the new UI, but they did not get implemented yet. There are JIRAs for that somewhere I think.\n\nOne of the challenges is that New UI is implemented in Angular 1, which is already rapidly becoming a legacy due to the Google's decision to radically change direction for Angular after that. So the hope of attracting new UI developers by giving them a better framework has not been as successful as was expected. But that was even worse with legacy UI anyway. ",
            "author": "Alexandre Rafalovitch",
            "id": "comment-15926442"
        }
    ]
}