{
    "id": "SOLR-7293",
    "title": "Install script makes solr not listen on ipv6 socket",
    "details": {
        "components": [
            "Server"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.1",
            "6.0"
        ],
        "affect_versions": "5.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "When installing solr with the install script (documentation https://cwiki.apache.org/confluence/display/solr/Taking+Solr+to+Production) the process only listens on an IPv4 socket. > *8983\n\nWhen manually installing with the same software set but running the software via a tomcat startup it does listen on ipv4 and IPv6 sockets. > :::8080\n\nI do realize that I have different ports, it's about 2 servers. I intentionally did not change port of the IPv6 only server to be exact and presize and maybe running it via Tomcat affects this.\n\nvim /etc/tomcat/web.xml\n\n    <env-entry> \n       <env-entry-name>solr/home</env-entry-name> \n       <env-entry-value>/home/solr</env-entry-value> \n       <env-entry-type>java.lang.String</env-entry-type> \n    </env-entry>\n\ncp /tmp/solr-5.0.0/server/webapps/solr.war /var/lib/tomcat/webapps/\nservice tomcat start",
    "attachments": {
        "SOLR-7293.patch": "https://issues.apache.org/jira/secure/attachment/12706551/SOLR-7293.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-03-23T15:14:08+0000",
            "author": "Uwe Schindler",
            "content": "I agree this is an issue. It is caused by the \"bin/solr\" and \"bin/solr.cmd\" command, it passes: -Djava.net.preferIPv4Stack=true to the JVM (for no reason). The fix is to remove this incorrect setting. This affects borth the windows and also the linux/posix startup script.\n\nWe should simply remove this. I did not know that we have added this, otherwise I would have complained already! ",
            "id": "comment-14376030"
        },
        {
            "date": "2015-03-23T15:18:58+0000",
            "author": "Uwe Schindler",
            "content": "Attached is a patch that fixes those startup scripts.\n\nMaybe somebody from the other SOlr committers shoudl comment on this. Nowaydays this is a big issue to pass such settings by default. If somebody has problems with IPv6 one can pass this startup option as needed. ",
            "id": "comment-14376036"
        },
        {
            "date": "2015-03-23T15:19:33+0000",
            "author": "Sebastian Pesman",
            "content": "I've removed the line from /opt/solr/bin/solr and restarted it. It now works on my IPv6 only servers. Awesome. ",
            "id": "comment-14376038"
        },
        {
            "date": "2015-03-23T15:22:37+0000",
            "author": "Uwe Schindler",
            "content": "By the way, Policeman Jenkins server has IPv6 by default, so we have enough test capacity:\n\n\n;; ANSWER SECTION:\njenkins.thetaphi.de.    28800   IN      CNAME   serv1.sd-datasolutions.de.\nserv1.sd-datasolutions.de. 300  IN      AAAA    2001:4dd0:ff00:1475::2\nserv1.sd-datasolutions.de. 300  IN      A       188.138.57.78\n\n\n\nIf somebody wants to test with IPv6 and does not have it already, we can test it without problems.\n\nIn any case we should check the SolrCloud URL stuff to check if those can handle ipv6 Solr URLs! ",
            "id": "comment-14376044"
        },
        {
            "date": "2015-03-25T18:29:06+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1669197 from Uwe Schindler in branch 'dev/trunk'\n[ https://svn.apache.org/r1669197 ]\n\nSOLR-7293: Fix bug that Solr server does not listen on IPv6 interfaces by default ",
            "id": "comment-14380434"
        },
        {
            "date": "2015-03-25T18:30:02+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1669198 from Uwe Schindler in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1669198 ]\n\nMerged revision(s) 1669197 from lucene/dev/trunk:\nSOLR-7293: Fix bug that Solr server does not listen on IPv6 interfaces by default ",
            "id": "comment-14380437"
        },
        {
            "date": "2015-03-25T18:31:15+0000",
            "author": "Uwe Schindler",
            "content": "Thanks for reporting! ",
            "id": "comment-14380440"
        },
        {
            "date": "2015-03-25T18:42:27+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "Uwe, in my experience, not having that JVM flag leads to inordinately long DNS lookup times when you are only using ipv4 (it may have been an incorrectly configured DNS server). So if someone is using ipv4 only, I always recommend to have this flag on. ",
            "id": "comment-14380472"
        },
        {
            "date": "2015-03-25T18:48:19+0000",
            "author": "Uwe Schindler",
            "content": "This is not correct, only if the computer is wrongly configured! The problem only happens if you have a wrongly configured IPv6 interface (missing gateway). That's not different from a broken additional interface with a 169er IP \n\nBut we cannot prevent people with IPv6 from working correctly. So anybody can pass whatever arguments to his JVM already, but disabling IPv6 on machinbes with IPv6 is a big no-go, sorry! This was a regression introduced with Solr 5.0, before it was all fine if you started with java -jar start.jar ",
            "id": "comment-14380485"
        },
        {
            "date": "2015-03-25T18:53:12+0000",
            "author": "Uwe Schindler",
            "content": "In fact what happens when you have those slowdowns: DNS servers always return IPv6 addresses if they exist - there are no wrongly configured DNS servers (also IPv4 only DNS servers will return IPv6 addresses and they must). The problem is if you have a incomplete configured global, non link-local IPv6 address on one of your interfaces (see above). Because of that it will use it to connect and fails with timeout.\n\nPeople that have broken setups can disable IPv6 in the Linux kernel, and many do. ",
            "id": "comment-14380506"
        },
        {
            "date": "2015-03-25T18:57:57+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "I am not saying that we shouldn't support  ipv6 but ipv6 users are few and the error they get is easily found and fixed (by removing the prefer IPv4 JVM flag). But removing the JVM param can cause bad performance for many IPv4 users to whom the reason and solution may not be apparent. ",
            "id": "comment-14380514"
        },
        {
            "date": "2015-03-25T19:02:29+0000",
            "author": "Uwe Schindler",
            "content": "This is no reason to revert this. Those users will have the same problem with all other apps on their computer, too.\n\nYou may not have noticed, but in Europe we are already out of IPv4 addresses, so maaany people use IPv6 already (including me). I am changing with my laptop between many networks (some with IPv6 and some without) and never had any slowdowns. Problem like you describe only happen with very old Ubuntu distributions (I know what you mean, but this is solved since long time). ",
            "id": "comment-14380527"
        },
        {
            "date": "2015-04-15T00:30:17+0000",
            "author": "Timothy Potter",
            "content": "Bulk close after 5.1 release ",
            "id": "comment-14495255"
        }
    ]
}