{
    "id": "SOLR-6766",
    "title": "Switch o.a.s.store.blockcache.Metrics to use JMX",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "The Metrics class currently reports to hadoop metrics, but it would be better to report to JMX.",
    "attachments": {
        "SOLR-6766.patch": "https://issues.apache.org/jira/secure/attachment/12682906/SOLR-6766.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-11-20T17:29:50+0000",
            "author": "Mike Drob",
            "content": "Mark Miller - Continuing discussion from SOLR-6752...\n\n\nI fired up Solr on HDFS with JMX enabled and took a look at the exported mbeans with JConsole. I did not see anything for the block cache.\n\nI'd look at how SolrResourceLoader adds the plugins that it loads to the JmxMonitoredMap.\nBeen digging deeper into this... metrics are tracked on a per-core basis. Each core has an infoRegistry that is populated in the constructor either directly or from beans that the SolrResourceLoader had previously created. So instead of creating a new Metrics object directly, we will need to create one through the SolrResourceLoader.newInstance(), which is I think what you were suggesting.\n\nThe trick here is that we need to create the bean before the SolrCore finishes constructing, but after the HdfsDirectoryFactory (HDF) exists to make sure that it gets registered in time. So basically, in the no-arg HDF constructor is our only option. The problem is that HDF (or any implementation of DirectoryFactory) is not aware of the resource loader or even a SolrConfig to be able to acquire a reference to the resource loader. I'm hesitant to add a setResourceLoader method or similar on DirectoryFactory because that is starting to feel very intrusive, but I also don't see another way to plumb this through. ",
            "id": "comment-14219623"
        },
        {
            "date": "2014-11-21T15:08:40+0000",
            "author": "Mark Miller",
            "content": "The block cache should normally just be one now that the global block cache is enabled by default. The per directory version should be special case at best. Perhaps the HdfsDirectoryFactory could simply track all the Metrics objects and spit out the stats for the caches (normally 1) that it tracks. If everything is keyed on HdfsDirectoryFactory as the info bean, nothing else has to be changed. Just spitballing though. ",
            "id": "comment-14221011"
        },
        {
            "date": "2014-11-21T16:42:25+0000",
            "author": "Mike Drob",
            "content": "This patch depends on the one on SOLR-6752 being applied first.\n\nMake HdfsDirctoryFactory implement SolrInfoMBean and expose metrics that way. I think it works for both the global cache and local cache options because it uses the same Metrics object for everything. ",
            "id": "comment-14221101"
        },
        {
            "date": "2014-11-21T16:54:35+0000",
            "author": "Mark Miller",
            "content": "I think it works for both the global cache and local cache options because it uses the same Metrics object for everything.\n\nOh cool, well that simplifies things. I'll take a look at this shortly. ",
            "id": "comment-14221115"
        },
        {
            "date": "2014-11-21T17:01:15+0000",
            "author": "Mike Drob",
            "content": "I didn't rename any of the metrics yet because that should be a fairly easy change to make. Trying to get the structure of the changeset correct, first. ",
            "id": "comment-14221124"
        },
        {
            "date": "2014-11-24T20:50:15+0000",
            "author": "Mark Miller",
            "content": "+1 - shaping up nicely. ",
            "id": "comment-14223491"
        },
        {
            "date": "2014-11-24T23:22:02+0000",
            "author": "Mike Drob",
            "content": "Renamed some of the metrics, based on what the other caches use. Could not figure out what would be tracking \"inserts\" into the block cache.\n\nThe other caches also track cumulative metrics, should we track those here as well? ",
            "id": "comment-14223750"
        },
        {
            "date": "2014-11-24T23:24:16+0000",
            "author": "Otis Gospodnetic",
            "content": "Is this aimed at 4.10.3? ",
            "id": "comment-14223754"
        },
        {
            "date": "2014-11-24T23:52:45+0000",
            "author": "Mike Drob",
            "content": "I build the patch against trunk, but it could probably go into branch-5. I think it applies pretty cleanly to branch-4 as well, but I haven't looked at it that closely. ",
            "id": "comment-14223785"
        },
        {
            "date": "2014-12-01T14:33:37+0000",
            "author": "Mark Miller",
            "content": "Is this aimed at 4.10.3?\n\n4.10.3 is a bug fix release - the fact that the code exists but is not hooked up could allow one to try and stretch it to 4.10.3 - along with the idea that there will be no more 4.x releases. No plans on it right now though. ",
            "id": "comment-14229845"
        },
        {
            "date": "2014-12-01T14:45:56+0000",
            "author": "Mark Miller",
            "content": "Here is a patch cleaning up a couple small things. Looks good overall - I just have to do a manual check to make sure everything shows up in the jmx output as expected and do a brief check of all the key names. ",
            "id": "comment-14229857"
        },
        {
            "date": "2015-01-06T20:29:18+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1649939 from Mark Miller in branch 'dev/trunk'\n[ https://svn.apache.org/r1649939 ]\n\nSOLR-6766: Expose HdfsDirectoryFactory Block Cache statistics via JMX. ",
            "id": "comment-14266702"
        },
        {
            "date": "2015-01-06T20:32:40+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1649941 from Mark Miller in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1649941 ]\n\nSOLR-6766: Expose HdfsDirectoryFactory Block Cache statistics via JMX. ",
            "id": "comment-14266708"
        },
        {
            "date": "2015-01-06T20:33:21+0000",
            "author": "Mark Miller",
            "content": "Thanks Mike! ",
            "id": "comment-14266710"
        },
        {
            "date": "2015-02-23T05:02:39+0000",
            "author": "Anshum Gupta",
            "content": "Bulk close after 5.0 release. ",
            "id": "comment-14332928"
        }
    ]
}