{
    "id": "SOLR-1556",
    "title": "TermVectorComponents should provide good error messages when fieldtype isn't compatible with requested options",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [
            "3.1",
            "4.0-ALPHA"
        ],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As noted by grant on the email list, asking TermVectorComponent for things like termVectors, positions, and offsets can't produce meaningful results unless the field in question has the corrisponding schema option set to true – but the behavior of TVC when they not true is confusing to users. \n\nWe should make TVC return a meaningful error if it's asked to return  a certain type of info for field that it can't deal with - something making it clear what properties of hte schema need to be changed to make it work...\n\nhttp://old.nabble.com/Re%3A-TermVectorComponent-%3A-Required---Optional-Parameters-p26181454.html",
    "attachments": {
        "SOLR-1556.patch": "https://issues.apache.org/jira/secure/attachment/12448617/SOLR-1556.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12868904",
            "date": "2010-05-18T23:37:18+0000",
            "content": "updating hte issue summary/description after re-reading the email thread. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12868910",
            "date": "2010-05-18T23:47:12+0000",
            "content": "skimming the code a bit, this doesn't seem easy to be a very a clean way to do this.  \n\nTVC allows multiple fields to be specified at once, but the positions & offsets options can not be specified per field – so if the user wants termVectors for fieldA and termVectors plus position info for fieldB, there is no way for them to distinguish that they don't care about position info for fieldA – if fieldA doens't have positions enabled in the schema, making TVC error based on that request would do the user a dis-service.  Even if there is no clean way to ask for it, the scema supports what they want – so we shouldn't error.\n\nI considerd breifly what it would take to make TVC support per-field overrides for the various options – the trickiness comes from hte fact that it doesn't iterate over the list of fields itself.  It builds up a custom TermVectorMapper to pass to IndexReader.getTermFreqVector for each doc.  So we'd need to modify that TermVectorMapper impl to know about the SolrQueryRequest so it could check the options per field instead of just specifying the booleans when it's constructed.\n\nThings are also complicated by the fact that the tv.fl param defaults to the fl param – so even if users enable termVectors, positions, and offsets for all the fields they care about, and they could starting getting errors if a new field is added to the \"fl\" when they don't care about any of that info.\n\nAll told: this may be one of the situations where an actual \"error\" isn't in hte best interests of the user – adding a warning to the TVC output for each field/option combo that doesn't make sense is probably more useful. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872428",
            "date": "2010-05-27T22:05:04+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12884878",
            "date": "2010-07-03T00:53:03+0000",
            "content": "Here's a patch, with tests, that fixes all the issues raised.  See http://wiki.apache.org/solr/TermVectorComponent for more details on the new per field options and the error messages. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12884885",
            "date": "2010-07-03T01:27:15+0000",
            "content": "Ready to go.  Going to commit this weekend. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12884914",
            "date": "2010-07-03T12:01:37+0000",
            "content": "Committed revision 960204 to trunk.\n\nCommitted revision 960206. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013096",
            "date": "2011-03-30T15:45:31+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}