{
    "id": "SOLR-6557",
    "title": "bandwidth cap for large file replication",
    "details": {
        "affect_versions": "5.0,                                            6.0",
        "status": "Open",
        "fix_versions": [
            "5.0",
            "6.0"
        ],
        "components": [
            "replication (java)"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Sometimes I need to set up a slave server in the rack where a master\nserver does not exist. In this case, our rack to rack bandwidth is often\nsaturated during large file transfer, such as initial replication, large\nindex file merge and optimization. This impairs our other services. So I\nthink a bandwidth cap for large file replication is helpful for large web service providers and adds flexibility to our Solr slave server setups.\n\nCurrently I am limiting replication bandwidth by using a tc command on\nthe master servers. But to use a tc command, I need to login to an\non-service master server and add tc related settings to add a new slave\nserver because tc command only shapes outbound traffics. So the feature\nof setting up a desired replication bandwidth cap with just one line in\na new slave configuration file reduces our Solr operations and secures\nthe on-service master servers by avoiding the need to login.\n\nParsing bandwidth setting in slave solrconfig.xml in ‘bits per\nsecond' is preferable for me. This is because most of our site operators\nuse ‘bits per second' not ‘bytes per second’ in our network monitoring\nmetrics.",
    "attachments": {
        "SOLR-6557.patch": "https://issues.apache.org/jira/secure/attachment/12671404/SOLR-6557.patch",
        "SOLR-replication_bandwidth.patch": "https://issues.apache.org/jira/secure/attachment/12670938/SOLR-replication_bandwidth.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ramkumar Aiyengar",
            "id": "comment-14146131",
            "date": "2014-09-24T09:38:27+0000",
            "content": "Does SOLR-6485 do what you are looking for? "
        },
        {
            "author": "Kenji Kikuchi",
            "id": "comment-14146133",
            "date": "2014-09-24T09:40:08+0000",
            "content": "Please review the patch attached.\nIf there are any problems with it, please let me know. "
        },
        {
            "author": "Kenji Kikuchi",
            "id": "comment-14146201",
            "date": "2014-09-24T11:03:47+0000",
            "content": "Thank you for pointing to the SOLR-6485. \nI read the patch. The patch helps my operations.\n\nI think if maxWriteMBPerSec in the SOLR-6485 can be requested from slave servers it is more helpful. This is because when I add a slave server in the rack where a master server exists I can use full server to rack switch bandwidth. But when I add a slave server in the rack where a master server does not exist, I need to add a bandwidth cap. "
        },
        {
            "author": "Varun Thacker",
            "id": "comment-14146454",
            "date": "2014-09-24T15:57:24+0000",
            "content": "You can pass maxWriteMBPerSec from your slave server - So you could try out something like this after applying the patch - \n\nhttp://slave_host:port/solr/replication?command=fetchindex&maxWriteMBPerSec=100 "
        },
        {
            "author": "Kenji Kikuchi",
            "id": "comment-14147560",
            "date": "2014-09-25T09:04:47+0000",
            "content": "I think SpapPuller on a slave server needs to get the maxWriteMBPerSec to pass it to ReplicationHandler on a master server.  "
        },
        {
            "author": "Kenji Kikuchi",
            "id": "comment-14148890",
            "date": "2014-09-26T07:50:26+0000",
            "content": "The attached SOLR-6557.patch works with SOLR-6485.\nIt allows each slave server to request desired replication bandwidth. This will help our operations.\nPlease review the SOLR-6557.patch. "
        }
    ]
}