{
    "id": "SOLR-6057",
    "title": "Duplicate background-color in #content #analysis #analysis-result .match (analysis.css)",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "7.3",
            "master (8.0)"
        ],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Trivial",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Inside of solr/webapp/web/css/styles/analysis.css, you can find #content #analysis #analysis-result .match element with following content:\n\n\t#content #analysis #analysis-result .match\n \t{\n \tbackground-color: #e9eff7;\n \tbackground-color: #f2f2ff;\n \t}\n\nbackground-color listed twice.\n\nAlso, it was very hard for me to see the highlight. Recommend to change it to background-color: #FF0000;",
    "attachments": {
        "SOLR-6057.patch": "https://issues.apache.org/jira/secure/attachment/12907916/SOLR-6057.patch",
        "Analysis-UI-before.png": "https://issues.apache.org/jira/secure/attachment/12907913/Analysis-UI-before.png",
        "Analysis-UI-deuteranopia.png": "https://issues.apache.org/jira/secure/attachment/12907914/Analysis-UI-deuteranopia.png",
        "Analysis-UI-newColor.png": "https://issues.apache.org/jira/secure/attachment/12907915/Analysis-UI-newColor.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13998504",
            "date": "2014-05-15T06:50:22+0000",
            "content": "I assume that this is the background color for the analysis highlight that shows matches between the index and query. I am a reading this on my phone, so I'm not in a position to check out the page to verify.\n\nThis doesn't seem to be particularly hard to see for me, but others may disagree and it might be a good idea to change the color. I disagree with making it pure red, though.  It would be easy to tell the that there is a match with red, but black text on a red background is particularly hard to read, and red implies an error condition. If one of the well-known colors is desired, green would be a far better choice, especially if it is a lighter green rather than #00ff00. Whatever is used, it must be easy to spot, but it must also be easy to read. "
        },
        {
            "author": "Al Krinker",
            "id": "comment-13999194",
            "date": "2014-05-15T20:13:40+0000",
            "content": "I agree... red is not a good choice since in most cases it draws attention of the user to indicate some type of error. A Lighter green would be better. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13999291",
            "date": "2014-05-15T21:47:58+0000",
            "content": "In my experience, the current highlighting color does not show up well on projector screens which makes it hard to demonstrate the analysis screen in Solr workshops  "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13999766",
            "date": "2014-05-16T12:11:01+0000",
            "content": "Al Krinker in fact it's duplicate, not optimal, but still works (second overwrites first) - i guess your point is more about color, right?\n\nShalin Shekhar Mangar raised a valid point - but not's only true for the highlight of the analysis screen .. all the light grey stuff, probably combined with 1px thick lines are not really working on a projector. \n\ni'm not really good at design - so what we have right now, is what i call my \"prototype-layout\", because normally no one tries to use that in production .. for a good reason \n\nif anyone has a good idea .. might be a simple template for websites, a screenshot of a existing app that has decent color scheme .. we could use that as inspiration to come up with something for us. "
        },
        {
            "author": "Al Krinker",
            "id": "comment-13999991",
            "date": "2014-05-16T17:01:09+0000",
            "content": "Stefan Matheis (steffkes) - Yeah, the big thing was inability to see the highlights, and the duplicate was me just trying to keep the code clean  I personally like the design since it is simple. Btw is it possible to add me to the contrib group so I can remove the duplicate and see if I can pitch in by taking care of some of the bugs in Jira? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-14000032",
            "date": "2014-05-16T17:36:49+0000",
            "content": "a helping hand is always welcome! \n\ni've already added you to the Contributors Group on the Wiki (mail might be delayed because of the outage).\n\nyou can always work on patches, which could then be committed by .. well, a committer :> more detailed read is available at HowToContribute - just give me a ping (either via jira mentions or on irc) and i'll see that we get it done. "
        },
        {
            "author": "Al Krinker",
            "id": "comment-14000077",
            "date": "2014-05-16T18:11:30+0000",
            "content": "Thank you Stefan Matheis (steffkes). \n\nBtw, I dont see \"Assign to me\" capability when I view tickets (I was going to assign this ticket to myself)... I guess that's why I was under the impression that I was not a contributor yet.\n\nand yeah, that outage caused a lot of headaches already! "
        },
        {
            "author": "Al Krinker",
            "id": "comment-14000081",
            "date": "2014-05-16T18:12:47+0000",
            "content": "p.s. i could not even log into my original account 'krinker', and had to create 'al.krinker' instead... and just got my access back to krinker. It was a mess. \n\np.s. could you add al.krinker to the list of contributors? Thanks! "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-14000113",
            "date": "2014-05-16T18:40:25+0000",
            "content": "We tend to assign only Committers as Assignee, so it's obvious who did commit the code & changes for the issue. And there's a related change from INFRA-7675, which does disable this by default. should still be able to work with, no? "
        },
        {
            "author": "Al Krinker",
            "id": "comment-14000129",
            "date": "2014-05-16T18:49:30+0000",
            "content": "Gotcha. I am a contributor to Apache Accumulo, and they allow contributors to assign issues to themselves. Personally, I like it since I can view all of my jira tickets on the dashboard.\n\nNo problem. I can just post patched against a ticket and then ask one of the committers to apply it. Thanks again! "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16341486",
            "date": "2018-01-26T19:35:08+0000",
            "content": "I've attached a patch to finally fix the duplication and change the color. Instead of using green, I opted to change the color to #F0D9C3 - a tannish color (to me) - because it looks mostly the same for those with any of the various types of color blindness (see screenshots attached: Analysis-UI-deuteranopia.png is from Sim Daltonism, an app that mimics what some users may see when looking at your application). \n\nI also took the liberty of darkening the gray used for the textual elements, which I did in SOLR-11895 for the Logging screen. If there are no objections, we can finally get this one closed for 7.3. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-16366179",
            "date": "2018-02-15T19:44:22+0000",
            "content": "Commit 53640b95d8d04a723bf05cd02b282656d98cc64a in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=53640b9 ]\n\nSOLR-6057: Change highlight color in UI Analysis screen "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-16366181",
            "date": "2018-02-15T19:45:07+0000",
            "content": "Commit b897841bfe2cf5c1790b51e78db182569cbe7554 in lucene-solr's branch refs/heads/branch_7x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b897841 ]\n\nSOLR-6057: Change highlight color in UI Analysis screen "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16366184",
            "date": "2018-02-15T19:46:56+0000",
            "content": "The patch I had earlier attached included some changes for text color to make it darker, and those changes were superseded by SOLR-8090. The commit referenced in earlier comments is for removing the duplicate color definition and changing the color for those highlights as I previously mentioned. "
        }
    ]
}