{
    "id": "SOLR-3766",
    "title": "A test group and build plan for known unstable tests",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Task",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "As discussed on the mailing list and suggested by Hoss:\n\n 1) slap a special \"@UnstableTest\" annotation on them\n 2) set up a new jenkins job that *only* runs these @UnstableTest jobs\n 3) configure this new jenkins job to not send any email\n\n\n\nPoint 1 is trivial, 2 I have filed an issue for in the runner –\nhttps://github.com/carrotsearch/randomizedtesting/issues/122\nthat I will take care of shortly.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Dawid Weiss",
            "id": "comment-13457320",
            "date": "2012-09-17T21:00:59+0000",
            "content": "I've set up a build on jenkins that runs tests marked with BadApple annotation (in addition to all other tests). This build won't stop on failures and neither will it send e-mails on failures.\n\nI plan to progressively annotate tests with this annotation if they're recurring failures, as agreed during mailing list discussion (well, at least there were no clear vetos). "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13457325",
            "date": "2012-09-17T21:06:45+0000",
            "content": "Thanks Dawid! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13457344",
            "date": "2012-09-17T21:21:25+0000",
            "content": "Some concerns:\n\n\tThese tests should not be excluded from the normal non-jenkins command line \"ant test\"\n\tSome tests may only be unstable on our freebsd instance (because of undesirable configuration like blackhole).  I would not want to see such tests excluded from failing the build on all jenkins/automated tests.  This goes back to Mark's request for a dont-run-on-our-freebsd annotation (which makes more sense now that we have other jenkins servers running).\n\tSome tests may only be unstable for certain JVMs\n\n\n\nThere should also be consensus before a test gets thrown into a place where people won't notice (or care about) it's failure.  Without that, we'd need to come to consensus on an unambiguous policy about when a test may be marked such that it will no longer fail builds.\n\nMaybe an easier solution would still be to send mail on failure, and then people who were not interested could exclude it in a mail filter. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13457371",
            "date": "2012-09-17T21:39:19+0000",
            "content": "These tests should not be excluded from the normal non-jenkins command line \"ant test\"\n\nI think the point is to exclude known flaky tests from \"ant test\" runs so that people running precommit tests or something don't have to re-run their tests because a known offender failed. One can enable them on the build server (that's why I created a separate plan) where time is of no crucial importance and which can either not send e-mails or send them tagged so that people can ignore them (as I'm sure most of us already do, unfortunately).\n\nAnyway, I give up on trying to improve this situation. There is a non-intersecting set of strongly defended positions and I don't see a solution for this. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13457531",
            "date": "2012-09-18T01:41:26+0000",
            "content": "Dawid:\n\nWhat do you think of inverting the notion? That is, run the @UnstableTest tests by default and allow them to be disabled explicitly? Perhaps disable them for the precommit step?\n\n\nI think there's some value in having to make an effort to turn these off, less likely for them to get permanently lost.\n\nBut since I'm not doing the work, I can cope with whatever you decide...\n "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13457658",
            "date": "2012-09-18T07:18:02+0000",
            "content": "What do you think of inverting the notion? That is, run the @UnstableTest tests by default and allow them to be disabled explicitly? Perhaps disable them for the precommit step?\n\nIt's what it used to be, check out the diff from my latest commit. I even marked some of the tests with that annotation. But those annotations that I added have been removed, the tests still fail and I'm just tired of arguing about the whole subject. I'll probably do what Uwe said – just not run Solr tests at all. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13457833",
            "date": "2012-09-18T14:00:09+0000",
            "content": "There is a non-intersecting set of strongly defended positions and I don't see a solution for this.\n\nThis is why I originally suggested a different mailing list for those that did want to see the failures of sporadically failing tests.\nOther alternatives:\n\n\trun solr tests separately to enable those that don't want to see solr fails to filter them with their email client\n\trun \"Unstable\" tests separately to enable those that don't want to see solr fails to filter them with their email client\n\n\n "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610816",
            "date": "2013-03-22T16:37:22+0000",
            "content": "[branch_4x commit] Dawid Weiss\nhttp://svn.apache.org/viewvc?view=revision&revision=1386830\n\nSOLR-3766: made @BadApples annotation disabled by default (no tests are currently marked as @BadApples). Created a plan on Jenkins for running these called Lucene-BadApples-trunk-java7. "
        }
    ]
}