{
    "id": "SOLR-4061",
    "title": "CREATE action in Collections API should allow to upload a new configuration",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "When creating new collections with the Collection API, the only option is to point to an existing configuration in ZK. It would be nice to be able to upload a new configuration in the same command. \nFor more details see http://lucene.472066.n3.nabble.com/Error-with-SolrCloud-td4019351.html",
    "attachments": {
        "SOLR-4061.patch": "https://issues.apache.org/jira/secure/attachment/12553320/SOLR-4061.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13496243",
            "date": "2012-11-13T15:10:24+0000",
            "content": "Attached proposed solution. The configuration is uploaded from the node serving the request. Even there is a problem with the collection creation, the configuration files may have been uploaded anyway "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-13496265",
            "date": "2012-11-13T15:50:32+0000",
            "content": "Tomas,\n\nHave you given any thought to being able to select a directory of configuration on your local box and upload that directly into ZK as part of a create?  SOLR-4052 was my first cut at it, but unfortunately you can only upload files, you can't seem to select a directory and upload everything in it into ZK. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13496270",
            "date": "2012-11-13T15:53:39+0000",
            "content": "I think most tools that let you upload directories end up using flash or some other hack unfortunately - at least when its a GUI selector. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13496289",
            "date": "2012-11-13T16:10:42+0000",
            "content": "Patch looks good. "
        },
        {
            "author": "Eric Pugh",
            "id": "comment-13496338",
            "date": "2012-11-13T17:16:39+0000",
            "content": "What do we think about using Flash though to allow this to happen?  Requiring access to the filesystem that Solr is running on is can be pain.  For example, in our hack projects we put a single Solr up on Amazon EC2.  And I've used the zkcli client to upload configs to that shared Solr so I didn't need filesystem access.  \n\nMaybe though I am haring off into the weeds of a ZK admin interface, not Solr specific enough.\n\nOne thought I have is what if you can supply a URI instead?  Use commons-vfs maybe, so you can pass in a  "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13541469",
            "date": "2012-12-31T19:21:54+0000",
            "content": "Mark, do you think there is more to be done in order to get this committed? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13541473",
            "date": "2012-12-31T19:44:25+0000",
            "content": "It seems the limitation on this is that the conf set must be on the remote solr machine you are talking to and not a local dir? What if you are using the CloudSolrServer? Could be a future issue, but we should document this stuff well I think. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13542243",
            "date": "2013-01-02T17:23:56+0000",
            "content": "Yes, this is kind of limited, It works similar to bootstrap_confdir on Solr startup, It doesn't allow to upload configuration from the client side as the ZkCli.sh. I'm not sure how this could be implemented to take files from the client server without sending the files one by one, any ideas?\nIn the case of the CloudSolrServer, it could specifically have a method to upload a conf directory to zk directly, but this would be outside of the Collections API, and won't be usable if you use any other way to connect to Solr. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13554363",
            "date": "2013-01-15T21:20:55+0000",
            "content": "Mark, a couple of weeks ago you retargeted this for 4.1 - should it instead be pushed to 4.2?\n "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-13554387",
            "date": "2013-01-15T21:34:39+0000",
            "content": "FYI, I don't have more than what I uploaded in the patch. This still doesn't upload local configuration, at least from my side. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13554547",
            "date": "2013-01-16T00:04:31+0000",
            "content": "FYI, I don't have more than what I uploaded in the patch. This still doesn't upload local configuration, at least from my side.\n\nOkay, Tomás, so this isn't going to make it into 4.1 - pushing to 4.2. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717200",
            "date": "2013-07-23T18:47:27+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971038",
            "date": "2014-04-16T12:56:58+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-14485850",
            "date": "2015-04-08T19:20:29+0000",
            "content": "Now that we have bin/solr create -c mycoll which defaults to some predefined config, perhaps we should bake that functionality into CREATE instead of bolting on this upload.\n\nBtw. I think it would be a good thing to start on an Admin UI section for collection mgmt, then it would be clear what APIs is needed below. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-14485914",
            "date": "2015-04-08T20:03:35+0000",
            "content": "Jan Høydahl See: https://issues.apache.org/jira/browse/SOLR-6082, also https://issues.apache.org/jira/browse/SOLR-5507. The first is one I put in as a marker, although I won't do much/any of the work (really, you don't want to see my UI \"skills\"). The second is one that Upayavira has been working on for a time, the skeleton and many of the tabs are in place and might be an easier thing to work on.\n\nPersonally I'd like to be able to administer my cluster without ever knowing the core admin UI existed.....\n\nFWIW "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-14486084",
            "date": "2015-04-08T21:24:00+0000",
            "content": "My point was that we should perhaps resolve this JIRA as Won't fix, unless people still think upload should be bolted on top of create. I think small, dedicated commands make up a much better REST API. The Admin UI and cmdline tools will hide the multiple calls from the user. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-15043504",
            "date": "2015-12-05T20:49:31+0000",
            "content": "Mark Miller Want me to close this? I'm also working on allowing the bin/solr scrupt to upconfig and downconfig. "
        },
        {
            "author": "Tomás Fernández Löbbe",
            "id": "comment-15049626",
            "date": "2015-12-09T23:30:59+0000",
            "content": "Yes, I think we can close this as Won't Fix. There are other tools/APIs now for configsets, plus I think the idea now is that the life-cycle of the configset is not necessarily the same as the collection. Using different calls make more sense now. "
        }
    ]
}