{
    "id": "SOLR-3877",
    "title": "backup and snapshooter scripts do not work.",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.1",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When trying to run the ./backup and ./snapshooter scripts, they do not work. It seems like they are looking for differently named files.\n\nAre these deprecated or unsupported?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13461980",
            "date": "2012-09-24T18:32:19+0000",
            "content": "The wiki has noted for a while that the scripts have been superseded by the ReplicationHandler, and i thought the README file for the scripts said something similar – but aparently there is no README file, so i added one.\n\nCommitted revision 1389507.\nCommitted revision 1389508. - 4x\n\n\nAs far as your specific question about the scripts looking for differnetly named files/directories: the defaults do assume a very specific directory layout based on a single SolrCore setup, and this has never been changed because it's the most common setup for the types of legacy users who are likely to still want to use these scripts (ie: people who don't want to change much about their working setup) "
        },
        {
            "author": "Jim Musil",
            "id": "comment-13461991",
            "date": "2012-09-24T18:47:09+0000",
            "content": "Awesome, thank you.\n\nBtw, I ran into this issue by searching for \"solr backup\" in google. The first result is http://wiki.apache.org/solr/SolrOperationsTools which does not mention anything about being superseded by the ReplicationHandler.\n\nI would edit, but I'm not quite sure what the wording should be. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13461999",
            "date": "2012-09-24T18:51:19+0000",
            "content": "Ah, ok ... thanks for the heads up.  There's a note on the main page about these scripts, but you're right: nothing obvious in some of hte \"sub pages\"\n\nI'll take a stab at clarifying. "
        },
        {
            "author": "Commit Tag Bot",
            "id": "comment-13610772",
            "date": "2013-03-22T16:34:08+0000",
            "content": "[branch_4x commit] Chris M. Hostetter\nhttp://svn.apache.org/viewvc?view=revision&revision=1389508\n\nSOLR-3877: REAMDE file noting the status of the old replication scripts (merge r1389507) "
        }
    ]
}