{
    "id": "SOLR-3151",
    "title": "Replace zookeeper.jsp with a servlet",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The zookeeper info is currently generated with a jsp file – making it harder to maintain then it should be, and harder to include in other applications",
    "attachments": {
        "SOLR-3151-zookeeper-servlet.patch": "https://issues.apache.org/jira/secure/attachment/12515464/SOLR-3151-zookeeper-servlet.patch",
        "SOLR-3151-invalid-json-for-solrconfig.json": "https://issues.apache.org/jira/secure/attachment/12515568/SOLR-3151-invalid-json-for-solrconfig.json"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-13212794",
            "date": "2012-02-21T18:44:43+0000",
            "content": "This moves the .jsp to a servlet.\n\nCan someone with more zookeeper experience (and setup) make sure this is equivalent to what we currently have? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13212805",
            "date": "2012-02-21T19:06:10+0000",
            "content": "is this core-specific?   I'm not familiar yet with the ZK stuff in Solr, but the servlet patch is core-specific.  So that begs the question... why not make this a request handler instead of a servlet?   A request handler has the benefit of allowing all usual Solr capabilities especially allowing flexible response writing (JSON, XML, Velocity, etc). "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13213092",
            "date": "2012-02-21T23:04:32+0000",
            "content": "The zookeeper stuff is not core-specific, it is at the top level just like CoreAdminHandler.  I just copied the code from the jsp and have not really investigated – it only uses the core to get the ZkController: core.getCoreDescriptor().getCoreContainer().getZkController();\n\nI'm fine with it as a RequestHandler, but this would require more crazy logic in SolrDispatchFilter like we have with CoreAdminHandler.\n\nany thoughts?  I don't use the ZK stuff (yet) so i don't have any opinion, but we need to fix some issues with this to get the new admin UI up-to-snuff\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13213495",
            "date": "2012-02-22T09:58:24+0000",
            "content": "Just a quick note. Depending on which file you select, the current zookeeper.jsp renders invalid json. That will of course not work for the Javascript-Part, we can of course display a message in that case, but i guess it should be possible to ensure that we return valid json? "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13213501",
            "date": "2012-02-22T10:02:42+0000",
            "content": "Generated w/ SVN Revision 1245905, is not valid. I don't not all reasons why it's correct but one will be that it contains raw linebreaks, which doesn't fit the specs. more on http://jsonlint.com/ "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13213568",
            "date": "2012-02-22T12:32:45+0000",
            "content": "Ok, so definitely not appropriate for this to be a request handler.  And yeah, that core admin is crazy stuff - wouldn't allow for a custom (or non-default, thus not Velocity) response writing.  Carry on... "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13214204",
            "date": "2012-02-23T02:14:00+0000",
            "content": "This is now a servlet, and future improvements can be tracked in SOLR-3155 "
        }
    ]
}