{
    "id": "SOLR-2267",
    "title": "Using query function in bf parameter in the DisMaxQParser forces the use of parameter dereferencing",
    "details": {
        "affect_versions": "3.1",
        "status": "Closed",
        "fix_versions": [
            "3.1"
        ],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "The DisMaxQParser parses the bf parameter using the SolrPluginUtils.parseFieldBoosts(...) function. This function tokenizes the string based on whitespaces and then bulilds a map mapping fields to their boost values. Unfortunately, the the *\n{!...}\n* form of a query contains whitespaces and therefore the parsing of the boost function fails. \n\nThis should be considered as a bug as effectively it forces the use of parameter dereferencing which in many cases is not ideal.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12970890",
            "date": "2010-12-13T16:47:38+0000",
            "content": "I think categorizing this as a bug is a little far fetched:\n\n1) since it's creation, the \"bf\" param has been documented as splitting on white space to extract multiple function arguments (because it pre-dates support for multiple param values in a SolrParams\n2) dismax and bf predate LocalParams syntax\n3) bf is documneted as parsing functions explicitly – not queries, so the use of the LocalParams query syntax shouldn't be implied.\n\nIn my option, now that we have LocalParams the \"bf\" param should be deprecated and removed in place of just using the \"boost\" or \"bq\" param – \"bf=...\" is functionally equivalent to \"bq=\n{!func}\n...\" "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12970891",
            "date": "2010-12-13T16:49:07+0000",
            "content": "SOLR-2014 addresses the same topic and has a patch, so if there is a fix to be made let's track there "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-13013087",
            "date": "2011-03-30T15:45:30+0000",
            "content": "Bulk close for 3.1.0 release "
        }
    ]
}