{
    "id": "SOLR-3482",
    "title": "Cannot index emails, mistakes of configuration file data-config.xml solrconfig.xml, Cannot find tika",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "The mail core cannot be brought up. There are mistakes of data-config.xml solrconfig.xml. The example of mail core is not complete, miss files.There is mistake of the sor mailEnitityPorcessor tutorial.\n\nIt cannot find the tika even tough it include the dataimporter-extra jar file.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13281719",
            "date": "2012-05-23T16:48:39+0000",
            "content": "Emma, did you find something else in data-config.xml than the missing entity-name, which is already reported & fixed in SOLR-3478? "
        },
        {
            "author": "Emma Bo Liu",
            "id": "comment-13281724",
            "date": "2012-05-23T16:59:44+0000",
            "content": "on the mail core data-config.xml of example-DIH,the entity doesn't have a name and neither on the solr mailEntityProcessor tutorial. I am glad the issue with entity name solved.But there are still other mistake in mail core and tika. I will update the patch with correct mail-core configuration quickly.  "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15647308",
            "date": "2016-11-08T11:38:01+0000",
            "content": "What are the specific errors. I can get the mail core running on master though it is admittedly a bit strange. My gmail run took 4 minutes for 8 entities. But in terms for direct issues, I can see a warning that lib directive points at the directory without any jars.\n\nBut I don't see any issues about missing Tika or anything. Is there a specific suggestion of what to look for or to fix? "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-16312021",
            "date": "2018-01-04T20:57:14+0000",
            "content": "Resolving this as there really isn't enough info here for someone to reproduce it, as evidenced by the last comment. Please reopen if more information can be provided. "
        }
    ]
}