{
    "id": "SOLR-3121",
    "title": "Make new admin UI work better with big indexes",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "As reported in SOLR-2667, the admin UI gets pretty bad with big indexes.  Mostly this seems the fault of excessive calls to luke and not limiting the number of terms",
    "attachments": {
        "SOLR-3121-luke-admin-ui.patch": "https://issues.apache.org/jira/secure/attachment/12514179/SOLR-3121-luke-admin-ui.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-13205852",
            "date": "2012-02-10T23:19:01+0000",
            "content": "This cleans up the 'show' option in LukeRequestHandler adding an option to just get the index info (not the fields) for the single core stats stuff.\n\nThis is just a start to the larger issue, but an easy place to begin "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13205991",
            "date": "2012-02-11T02:46:20+0000",
            "content": "updated patch to load the terms dynamical\n\nThere is some funkyness with it, but I think it may be worth commiting and fixing in trunk "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13205997",
            "date": "2012-02-11T02:58:31+0000",
            "content": "I added this change in r1242998\n\nErick - can you test with some big instances?  For me, things seem to be better...\n\nStefan - can you take a look at how I kind of messed up the histogram/terms styles? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13206472",
            "date": "2012-02-12T18:31:08+0000",
            "content": "Ryan:\n\nThis looks great, it does what I'd hoped.\n\nI've never been all that happy with how the LukeRequestHandler was organized, so I've attached a patch that builds on yours and refactors LukeRequestHandler a bit. The old structure would go out and do the detailed information-gathering and then use it later, overloading numTerms all over the place. The patch just tries to get the detailed info when it should. It does require the fl field to get detailed info at any time though.\n\nYour patch changed the way we request fields, which made it possible to untangle the handler itself.\n\nTake a look and let me know.\n\nThis re-structuring probably does NOT play nice with the old admin UI though, we really need to decide whether to stop worrying about the old UI and just cut over to this one. I know the new UI doesn't deal with cloud leaf-node expansion yet, see SOLR-3116.\n\nAnd it seems like this handles SOLR-3094 too. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13206478",
            "date": "2012-02-12T18:43:34+0000",
            "content": "Small change that restores the old Admin UI behavior.\n\nNOTE: The old UI behavior is going to be slow for large indexes since it does the enumeration of all the fields when you click \"schema browser\". The right fix is to incorporate the new parameters in \"the right place\" in the old admin UI, but at least this doesn't change the old behavior, it just doesn't make it as nice as the new. "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13206661",
            "date": "2012-02-13T04:06:59+0000",
            "content": "I suggest we optimize for the new UI.  We should refactor/restructure the LukeRequestHandler so that it is as good/efficient as it can be – this is the advantage of a major release!\n\nI think we can even remove the old schema browser (linking to the new one) until we can get rid of the old one entirely. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13206869",
            "date": "2012-02-13T13:33:53+0000",
            "content": "bq: I think we can even remove the old schema browser (linking to the new one) until we can get rid of the old one entirely\n\nDoesn't this happen already? If I enter http://localhost:8983/ I go straight to the new UI, although it does have a link to the old UI and the old URL goes straight to the old Admin UI.\n\nBut yeah, it seems that cutting over to the new UI and letting the old one fade away (or just remove it) is what should be done. The problem is, though, that the new code is kind of intimidating if you're not fluent in js/jquery, but I suppose it's just a matter of getting used to it.\n\nAnd SOLR-3116 is a known issue. I expect that SolrCloud will get a lot of traffic when 4.0 is released, so this seems critical if we're to really cut over.\n\nAnyway, I'll commit this patch today sometime unless someone beats me to it. "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-13207438",
            "date": "2012-02-14T01:27:48+0000",
            "content": "I removed the patches I had attached yesterday, Ryan and I crossed wires. The refactoring of LukeRequestHandler is now done in SOLR-3132. This patch should be applied first! "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13213140",
            "date": "2012-02-22T00:19:15+0000",
            "content": "works well with big indexes now "
        }
    ]
}