{
    "id": "SOLR-1853",
    "title": "ReplicationHandler reports incorrect replication failures",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "replication (java)"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Incomplete"
    },
    "description": "The ReplicationHandler \"details\" command reports that replication failed when it didn't.  This occurs after a slave is restarted when it is already in sync with the master.  This makes it difficult to write production monitors that check the health of master-slave replication (no network issues, unexpected slowdowns, etc).\n\nFrom the code, it looks like \"SnapPuller.successfulInstall\" starts out false on restart.  If the slave starts out in sync with the master, then each no-op replication poll leaves \"successfulInstall\" set to false which makes SnapPuller.logReplicationTimeAndConfFiles log the poll as a failure.  SnapPuller.successfulInstall stays false until the first time replication actually has to do something, at which point it gets set to true, and then everything is OK.\n\nSteps to reproduce\n\n\tSetup Solr master and slave servers using Solr 1.4 Java replication.\n\tIndex some content on the master.  Wait for it to replicate through to the slave so the master and slave are in sync.\n\tStop the slave server.\n\tRestart the slave server.\n\tWait for the first slave replication poll.\n\tQuery the replication status using \"http://localhost:8983/solr/replication?command=details\"\n\tUntil the master index changes and there's something to replicate, all slave replication polls after the restart will be shown as failed in the XML response.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Smith",
            "id": "comment-12850707",
            "date": "2010-03-28T18:08:16+0000",
            "content": "At first glance, it looks like the fix might be as simple as initializing SnapPuller.successfulInstall to true. "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12851799",
            "date": "2010-03-31T10:09:26+0000",
            "content": "committed r929454 "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13015537",
            "date": "2011-04-04T18:35:06+0000",
            "content": "This issue is still open, but it looks like Paul fixed it 1 year ago?\n\nShawn, is this still a problem for you? "
        },
        {
            "author": "Vadim Kirilchuk",
            "id": "comment-13540025",
            "date": "2012-12-27T16:38:16+0000",
            "content": "another 1 year ago =)\n\nr929454 doesn't actually fix mentioned issue. However, seems like in 4.x there is no such issue. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15538864",
            "date": "2016-10-01T17:29:26+0000",
            "content": "This is no longer relevant to the current replication method. "
        }
    ]
}