{
    "id": "SOLR-1312",
    "title": "BufferedTokenStream should use new Lucene 2.9 TokenStream API",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "Schema and Analysis"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "Since Solr 1.4 will be using Lucene 2.9, the Solr TokenFilters should probably be updated  to use the Lucene 2.9 TokenStream API.   This issue is to put BufferedTokenStream on the list of Filters that need updating.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jason Rutherglen",
            "id": "comment-12742725",
            "date": "2009-08-13T05:47:48+0000",
            "content": "Tom, I'm going to put a patch together for this. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12742851",
            "date": "2009-08-13T14:55:27+0000",
            "content": "FYI: I can't find it at the moment, but I think Yonik is doing a bunch of work on the Analysis stuff for Lucene 2.9 uptake in Solr, so it may be taken care of. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-12852687",
            "date": "2010-04-02T03:41:00+0000",
            "content": "Hello, I recommend we cancel this issue.\n\nNo Solr tokenstreams extend this BufferedTokenStream API anymore, as it is bound to Token and does not support reuse.\nCurrently this class is marked deprecated in trunk, with a backwards compatibility layer.\n\nIf we think that an API like this is useful, we should make a new BufferedTokenStream-like API that uses AttributeSource\ninstead of Token, but this API would not support reuse and would not be very performant, as it would have to use\ncloneAttributes() and copyTo() instead of captureState() and restoreState() "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-16067381",
            "date": "2017-06-28T22:37:01+0000",
            "content": "Closing ancent issue as won't fix since it is obviously obsolete. Feel free to re-open if you feel there is work to do here... "
        }
    ]
}