{
    "id": "SOLR-6681",
    "title": "remove <lib> configurations from solrconfig.xml and eliminate per core class loading",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "As Solr moves more towards cloud ,solrconfig is stored in Zookeeper. Storing the local library information in a file stored in a remote and common location for all nodes make no sense. \nIn this new world, cores are created and managed by the solrcloud system and  there is no need to have separate classloading for each core and a lot of unnecessary classloading issues in solr can go away\n\nGoing forward, all cores in a node will have only one classpath. We may define a standard directory such as 'ext' under the HOME and let users store all their jars there",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2014-11-02T18:12:18+0000",
            "author": "Shawn Heisey",
            "content": "I think it's a good idea to get rid of <lib> configuration tags and put all jars in one place.  How to manage that in the example without having duplicates of jars already present in \"dist\" (and making the already bulky download even larger) is one of the thorny problems we face.  The bin/solr script could copy or move jars the first time it runs ... which might open a whole new set of problems, particularly when it is upgrade time.\n\nI don't think we need to use an \"ext\" directory.  Solr already has a \"default\" classpath that gets loaded without any configuration – SOLRHOME/lib.  Whether or not we rename that from lib to ext is something we could bikeshed about forever, so I'm inclined to go with inertia and leave it alone.\n\nSOLR-4852 describes some weird and irritating problems I've had related to this lib directory. ",
            "id": "comment-14193941"
        },
        {
            "date": "2014-11-02T19:31:31+0000",
            "author": "Jan Høydahl",
            "content": "+1 to the overall idea\n\nLong-term solution would be a better plugin architecture to keep dependencies for certain features in self-contained zip files, see SOLR-5103\n\nPerhaps a short-term improvement if is Solr parses $SOLRHOME/lib recursively for jars, then users could freely organize their jars in sub folders and thus keep track of what jars belong together, for what feature etc ",
            "id": "comment-14193974"
        }
    ]
}