{
    "id": "SOLR-5420",
    "title": "Solr indexing of multiple spatial fields (with polygons) produces errors",
    "details": {
        "affect_versions": "4.5",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "We got the following problem. When we try to index polygons together with their centroid in one document only a few documents are indexed, most of them return the error:\n\ncom.spatial4j.core.exception.InvalidShapeException: Ring Self-intersection at or near point (10.4592,​ 49.921,​ NaN)\n\nWhen we index only the polygons everything works fine. When we index only the centroids everything woks fine. But when we index the polygons in one SpatialRecursivePrefixTreeFieldType and the centroid in another SpatialRecursivePrefixTreeFieldType in one document we get the errors for a lot of polygons. Out of around 13000 polygons only ca. 3000 are indexed the other documents produce the error.\n\nWe are using the latest Solr 4.5 version.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "David Smiley",
            "id": "comment-13813011",
            "date": "2013-11-04T17:07:15+0000",
            "content": "You duplicated this post on http://stackoverflow.com/questions/19767488/solr-indexing-of-multiple-spatial-fields-with-polygons-produces-errors   but since this pertains to an apparent bug/error, we can deal with it here.\n\nMy response/comment:\nAs I double-check the code, it's hard to see how your error could happen. Could you please supply a simple input document in Solr UpdateXML format that demonstrates the problem? If you don't want to share publicly then send it to me directly. "
        },
        {
            "author": "David Smiley",
            "id": "comment-13816437",
            "date": "2013-11-07T21:18:21+0000",
            "content": "As indicated on his response in StackOverflow, there actually were self-intersection issues on his polygons.  There appears to be no problem in Solr with using multiple spatial fields.\n\nBy the way, if your polygons are self-intersecting, then you can use JTS to buffer(0) them, which often resolves it.  This and other techniques are on the JTS FAQ. "
        }
    ]
}