{
    "id": "SOLR-154",
    "title": "Added package tasks for creating Rails plugin and namespaced both the rails and gem packaging",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "clients - ruby - flare"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Solrb's (sol.rb's?) rake file has a package:vendor task that is not generating proper rails plugin structure. Rather than just fix this, I've added a PackageTask to package up a proper Rails plugin directory structure and also build distributable packages. Included are the README, LICENSE.txt, and init.rb generated and destroyed on the fly. Also, I've namespaced the Gem PackageTask and the Rails PackageTask, so the commands:\n\nrake rails:package (and repackage, clobber, clobber_package)\nrake gem:package (and the rest...)\n\npackage their files up and dump them into pkg/rails and pkg/gem, respectively. Their clobber tasks will only remove the sub-directory under pkg/, not pkg/ itself.\n\nrake package, rake repackage run both package tasks, while rake clobber and rake clobber_package remove the complete pkg/ directory.",
    "attachments": {
        "Rakefile_2.diff": "https://issues.apache.org/jira/secure/attachment/12350790/Rakefile_2.diff",
        "solrb_vendor_package.diff": "https://issues.apache.org/jira/secure/attachment/12350936/solrb_vendor_package.diff",
        "Rakefile.diff": "https://issues.apache.org/jira/secure/attachment/12350786/Rakefile.diff"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jamie Orchard-Hays",
            "id": "comment-12471812",
            "date": "2007-02-09T20:50:30+0000",
            "content": "Diff of current Rakefile with my changes. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12471818",
            "date": "2007-02-09T21:06:25+0000",
            "content": "I've committed this patch, but Jamie is up to a few more tweaks, so I'll close after those patches are applied. "
        },
        {
            "author": "Jamie Orchard-Hays",
            "id": "comment-12471827",
            "date": "2007-02-09T21:31:25+0000",
            "content": "I've removed the old package:vendor task and replaced it with rails:install_solrb. This task depends on rails:package and takes the environment variable PLUGINS_DIR which is the path to the vendor/plugins directory to which the user wants to install solrb. If PLUGINS_DIR is not given, an exception with a message is raised.  "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12472263",
            "date": "2007-02-12T11:37:10+0000",
            "content": "Jamie's latest patch has been applied.  Though I think there is a bit more to come on this. "
        },
        {
            "author": "Coda Hale",
            "id": "comment-12472333",
            "date": "2007-02-12T16:09:34+0000",
            "content": "Here's an updated rake task for packaging solrb for use in the vendor directory of a Rails project.\n\nI disagree with Jamie's approach in making solrb a Rails plugin. It doesn't modify or extend any of the Rails libraries, nor does it even use libraries like ActiveSupport.\n\nPlacing it in the vendor directory (and adjusting the directory structure so as to allow it to load with the same requires without messing with the load path) seems like the best option to me. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-12529943",
            "date": "2007-09-24T18:56:25+0000",
            "content": "I've been using the Rails gem packaging feature in solr-ruby's trunk for a while now with no problems.  If there are still issues with solr-ruby Rails integration feel free to reopen this issue with additional details. "
        }
    ]
}