{
    "id": "SOLR-5238",
    "title": "Update the .css for the Ref Guide",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.5"
        ],
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I put a custom .css into the Ref Guide before it was uploaded. I was going for something parallel to the Solr website, but only spent a little time with it. In terms of readibility of the text online, it's not great, which is putting it nicely. It's also very difficult to differentiate between \"normal\" text and monospaced text to indicate a command, program name, etc.\n\nI'm attaching a new .css that can simply replace what's already in the Space Admin -> Stylesheet section. I did several things with this:\n\n\n\tcleaned up the .css generally, consolidated some repetitive sections, and added more comments in case future changes are desired.\n\tchanged the font throughout to Helvetica, Arial, or sans-serif and updated the color to a slightly less strong black.\n\tchanged the monospace font to match the font used in the code boxes (Consolas) and made them the same color as the text (default is a lot lighter).\n\tadded a bit more space between lines.\n\tremoved the negative margin in the header/breadcrumbs to give it a bit more space.",
    "attachments": {
        "SolrRefGuide.css": "https://issues.apache.org/jira/secure/attachment/12602635/SolrRefGuide.css"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13766990",
            "date": "2013-09-13T21:34:59+0000",
            "content": "I've updated this in cwiki.\n\nCasandra: if you notice any glitches that need tweaked, please re-open. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13767050",
            "date": "2013-09-13T22:15:14+0000",
            "content": "I don't really understand Confluence sometimes...\n\nI don't think this was there before, but now there is a big blank space at the bottom of the pages (I checked in FF and Chrome). Playing around with the inspector tools in the browser, it goes away if I change the #footer position to relative.\n\nIf you add this to the bottom of the stylesheet I think it should go away in the live site:\n\n\n#footer {\n    position: relative !important;\n}\n\n\n\nSince it's the only #footer called in the custom css, and the custom css is the last one loaded, it should be OK at the end. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13767092",
            "date": "2013-09-13T22:40:48+0000",
            "content": "yeah... that looks much better.\n\nalso fixes weirdness with the scroll bar in the left nav that i didnt' notice until you drew my attention to the footer.\n\nthanks. "
        },
        {
            "author": "Cassandra Targett",
            "id": "comment-13769944",
            "date": "2013-09-17T20:52:37+0000",
            "content": "Sorry, need to reopen this again.\n\nI failed to notice that in some early iteration of this, I defined the h3 header size to \"15.22px\", which is about 11pt. The h4 headers aren't customized with this css, so by default are about 14pt. Thus, h3 is smaller than h4.\n\nIf you could simply remove the section that defines the h3 size, that should be fine - the default h3 is bigger than the default h4 and is perfectly acceptable.\n\nThe section to remove looks like this:\n\n/* Set H3 header size */\n.wiki-content h3 {\n   font-size: 15.22px; \n}\n\nThanks.... "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13770014",
            "date": "2013-09-17T21:35:16+0000",
            "content": "no problem: h3 size block removed. "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787077",
            "date": "2013-10-05T10:19:05+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}