{
    "id": "SOLR-6621",
    "title": "SolrZkClient does not guarantee that a watch object will only be triggered once for a given notification",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.2",
            "6.0"
        ],
        "affect_versions": "6.0",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "The SolrZkClient provides methods such as getData or exists. The problem is that the client automatically wraps the provided watcher with a new watcher (see here) which breaks the guarantee that \"a watch object, or function/context pair, will only be triggered once for a given notification\". This creates undesirable effects when we are registering the same watch is the Watcher callback method.\n\nA possible solution would be to introduce a SolrZkWatcher class, that will take care of submitting the job to the zkCallbackExecutor. Components in SolrCloud will extend this class and implement their own callback method. This will ensure that the watcher object that zookeeper receives remains the same.\n\nSee SOLR-6462 for background information.",
    "attachments": {
        "SOLR-6621": "https://issues.apache.org/jira/secure/attachment/12674767/SOLR-6621"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2014-10-13T22:34:16+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Most places do not need this ordering and I guess the current approach is simpler for that case. One alternative could be to expose wrapWatcher for use before exists or getData is called, and use a marker interface to ensure that when a wrapped watcher is passed as an argument, it is not re-wrapped. ",
            "id": "comment-14170130"
        },
        {
            "date": "2014-10-14T13:23:44+0000",
            "author": "Renaud Delbru",
            "content": "Hi,\n\nWere you thinking of something like this ? ",
            "id": "comment-14170902"
        },
        {
            "date": "2014-10-14T13:31:15+0000",
            "author": "Ramkumar Aiyengar",
            "content": "Yep..\n\nMark Miller, any comments? ",
            "id": "comment-14170914"
        },
        {
            "date": "2014-10-14T13:34:05+0000",
            "author": "Renaud Delbru",
            "content": "Ok, if it is good, I'll add some documentation on the wrapWatcher method and upload a new patch. ",
            "id": "comment-14170918"
        },
        {
            "date": "2014-10-16T14:11:16+0000",
            "author": "Renaud Delbru",
            "content": "I have added some comments, and created a pull request at:\nhttps://github.com/apache/lucene-solr/pull/100 ",
            "id": "comment-14173785"
        },
        {
            "date": "2014-11-27T03:59:06+0000",
            "author": "Mark Miller",
            "content": "Have not looked at the patch yet, but this makes sense to improve to me. ",
            "id": "comment-14227238"
        }
    ]
}