{
    "id": "SOLR-2930",
    "title": "Allow controlling an important PDF processing parameter in Tika that splits the words in text and is now suppored in version 1.0 of Tika.",
    "details": {
        "affect_versions": "3.5",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - Solr Cell (Tika extraction)"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Tika 1.0 has fixed a major issue with processing and parsing of PDF files that was splitting the words incorrectly: https://issues.apache.org/jira/browse/TIKA-724\n\nThis causes text to be indexed incorrectly in solr and it becomes specially visible when using spellcheck features etc.  \n\nThey have added a special parameter set using setEnableAutoSpace that fixes the problem but there is currently no way of setting this when using Solr.  As discussed in thread on above issue, it would be nice if we could control this (and in future other) parameter via Solr configuration.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Jan Høydahl",
            "id": "comment-13159971",
            "date": "2011-11-30T11:00:09+0000",
            "content": "Good idea to have some kind of key-value config which is passed through to Tika, if possible. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13160034",
            "date": "2011-11-30T13:19:31+0000",
            "content": "i think the most important piece is that this parameter is off by default.\n\nfor a search engine, if some bold content gets duplicated... there could really be worse things.\n\nbut if spaces get incorrectly added to words, thats going to mess up tokenization. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13160036",
            "date": "2011-11-30T13:26:15+0000",
            "content": "my bad, i confused this bug with the pdfbox 'character deletion' \none (TIKA-767), thats still unfortunately not in tika 1.0 it seems. "
        }
    ]
}