{
    "id": "SOLR-1692",
    "title": "CarrotClusteringEngine produce summary does nothing",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.1"
        ],
        "components": [
            "contrib - Clustering"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "In the CarrotClusteringEngine, the produceSummary option does nothing, as the results of doing the highlighting are just ignored.",
    "attachments": {
        "SOLR-1692.patch": "https://issues.apache.org/jira/secure/attachment/12429284/SOLR-1692.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Grant Ingersoll",
            "id": "comment-12795873",
            "date": "2010-01-02T17:22:10+0000",
            "content": "The relevant lines are:\n\nString snippet = getValue(doc, snippetField);\nif (produceSummary == true) {\n        docsHolder[0] = id.intValue();\n        DocList docAsList = new DocSlice(0, 1, docsHolder, scores, 1, 1.0f);\n        highligher.doHighlighting(docAsList, theQuery, req, snippetFieldAry);\n      }\n\n\n\nIt seems like we do the highlighting but then don't use the result.  If I recall, we should use the result to then set the snippet value. "
        },
        {
            "author": "Stanislaw Osinski",
            "id": "comment-12795914",
            "date": "2010-01-02T20:29:18+0000",
            "content": "I've had a quick look into this issue and have two questions to consider:\n\n\n\tWhere should the configuration of the highlighter we use for clustering come from? Should it be the same as for the regular Solr highlighting or should we allow a clustering-specific configuration? My intuition is that we should go with the former. Otherwise, we may lose the clear relationship between cluster labels and documents on the output, because the clusters will be generated based on a text that is different from what the user is going to see.\n\n\n\n\n\tWhat should we do if the highlighter is not able to generate a summary? One option is to use the full contents of the field. Alternatively, we could use N (configurable) first characters of the field. The answer to this really depends on the characteristics of the data we may get. If the total number of documents fed to Carrot2 doesn't exceed about a 1000, longer documents shouldn't be too much of a problem, so I'd suggest the former option (use full field text).\n\n "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12795919",
            "date": "2010-01-02T21:02:27+0000",
            "content": "Where should the configuration of the highlighter we use for clustering come from?\n\nWe have all the code hooked in for it already, we're just ignoring the output.\n\nWhat should we do if the highlighter is not able to generate a summary?\n\nI think we can default to the full contents, which is what would be used if you don't specify produceSummary.  We can handle the char thing separately, I suppose.\n\nWould be great if, Carrot2 could also just use the analysis that Lucene/Solr produces, that way it would be much easier to configure stopwords, HTML stripping, etc. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12795923",
            "date": "2010-01-02T21:52:43+0000",
            "content": "Fixes the bug, adds new parameter to specify the frag size when using the highlighter. "
        },
        {
            "author": "Stanislaw Osinski",
            "id": "comment-12795925",
            "date": "2010-01-02T22:36:57+0000",
            "content": "\nWhere should the configuration of the highlighter we use for clustering come from?\n\nWe have all the code hooked in for it already, we're just ignoring the output.\n\nTo avoid confusion and questions along the lines of \"why clusters don't match the (highlighted) documents I'm seeing\", I'd suggest a slightly more elaborate scenario for the clustering highlighter configuration:\n\n1. If main Solr highlighting is disabled, use the clustering component's highlighter settings.\n2. If main Solr highlighting is enabled, use the main highlighter's configuration as the defaults and let the clustering-specific highlighter configuration override the defaults.\n\nIf we do it this way, we'll minimize the chances of users accidentally performing clustering on documents different (differently highlighted) than those they will see.\n\nWould be great if, Carrot2 could also just use the analysis that Lucene/Solr produces, that way it would be much easier to configure stopwords, HTML stripping, etc.\n\nThis one would require some larger changes to Carrot2 internals. We do use Lucene infrastructure for preprocessing (currently for tokenization), but I can investigate if we can extend that further. A potential problem here is that very often the set of stopwords you use for document retrieval may not work equally well for clustering. I've filed a Carrot2-specific issue for it and will try to come up with something. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872583",
            "date": "2010-05-27T22:08:16+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043647",
            "date": "2011-06-03T16:46:18+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13078615",
            "date": "2011-08-03T07:18:37+0000",
            "content": "Grant, what remains to be done with this issue? Can I help? "
        },
        {
            "author": "Stanislaw Osinski",
            "id": "comment-13078632",
            "date": "2011-08-03T07:57:54+0000",
            "content": "Looking at the code, the issue is resolved, summaries (from highlighter) are used for clustering when configured. I see there's no unit test for the feature though, so I can write one and resolve the issue. "
        },
        {
            "author": "Stanislaw Osinski",
            "id": "comment-13078666",
            "date": "2011-08-03T09:25:59+0000",
            "content": "This issue was really fixed for 3.1.0 and documented in CHANGES under that release. It doesn't make sense to complicate things further as I suggested in the discussion above, so resolving. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13157890",
            "date": "2011-11-27T12:39:00+0000",
            "content": "Bulk close after release of 3.1 "
        }
    ]
}