{
    "id": "SOLR-4228",
    "title": "SolrPing - add methods for enable/disable",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [
            "4.4",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The new PingRequestHandler in Solr 4.0 takes over what actions.jsp used to do in older versions.  Create methods in the SolrPing request object to access this capability.",
    "attachments": {
        "SOLR-4228.patch": "https://issues.apache.org/jira/secure/attachment/12562244/SOLR-4228.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13538884",
            "date": "2012-12-22T19:14:59+0000",
            "content": "Patch implementing three new methods - removeAction, setActionDisable, and setActionEnable "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538885",
            "date": "2012-12-22T19:16:18+0000",
            "content": "I didn't find any tests to modify, and not sure how to go about making a new test. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538893",
            "date": "2012-12-22T20:14:39+0000",
            "content": "In my working copy, I have added a PingRequestHandler to the solrconfig.xml in the shared test files for solrj.  If someone can give me the name of an existing test for SolrJ that sets up a full Solr JVM and indexes some data, I'll be happy to copy that test and put together some tests for SolrPing. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538943",
            "date": "2012-12-23T00:00:55+0000",
            "content": "I have mostly figured out how to extend SolrJettyTestBase to do a test, but I don't know how to copy or use the solrj test-files with initCore, rather than the example config/schema.  I can get it to use the example test/schema, but that doesn't have a health-check file configured, and I don't want to screw around with the example configs, I'd rather adjust the test-files stuff and use it. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538948",
            "date": "2012-12-23T01:06:57+0000",
            "content": "New patch with a test that fails because I don't know how to start it with the right solrconfig/schema. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538949",
            "date": "2012-12-23T01:09:18+0000",
            "content": "Previous patch did not actually have the test class.  Deleted that attachment.  Did svn add and made a new patch. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13538950",
            "date": "2012-12-23T01:15:29+0000",
            "content": "One more time.  Wrong expected exception type on one of the tests. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13539043",
            "date": "2012-12-23T15:51:18+0000",
            "content": "New patch that adds setActionPing method.  Test unchanged, so it still doesn't pass. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13539050",
            "date": "2012-12-23T16:38:03+0000",
            "content": "Fulfilling the open source mandate of releasing often. \n\nImprovements in the unit tests, another failed attempt to get the custom solrconfig loaded. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13539058",
            "date": "2012-12-23T17:05:28+0000",
            "content": "New patch.  Now the test passes, but I suspect that I am not using the base class and initCore in the proper way.  Left a comment in beforeClass saying so. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13539060",
            "date": "2012-12-23T17:19:22+0000",
            "content": "Comment correction.  If my approach to initCore is acceptable, then it's ready for committing.  If it's not acceptable, please let me know the right way to do it. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636781",
            "date": "2013-04-19T19:41:41+0000",
            "content": "Is there any objection to committing this patch after some cleanup and making sure it applies to current trunk/4x? I would like peer review especially of the way that I built the tests and help fixing it if I did it wrong.\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13667882",
            "date": "2013-05-27T18:01:36+0000",
            "content": "New patch with some cleanups and CHANGES.txt that lists it as a new feature on version 4.4.  Like the previous patch versions, it doesn't change default behavior, just adds new capability.  On trunk, precommit passes and solr tests are underway.  If that works OK, I will commit soon.  Before committing to 4x, I will also give it a try in my dev environment. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13668907",
            "date": "2013-05-29T01:49:50+0000",
            "content": "Committed to trunk, r1487189.  Double-checking branch_4x before committing the backport. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13668985",
            "date": "2013-05-29T04:27:08+0000",
            "content": "For the 4x backport, I am getting an unrelated consistent test failure in solr/core.  The SolrJ tests pass, including the added test.  Precommit passes.  Committed, r1487229. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13669591",
            "date": "2013-05-29T19:18:36+0000",
            "content": "Hoss Man pointed out a maven test failure via IRC.  Steve Rowe gave me the proper way to init the test.  Will commit a fix shortly. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13669595",
            "date": "2013-05-29T19:23:51+0000",
            "content": "maven test fix committed.\n\ntrunk: r1487602\nbranch_4x: r1487603 "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716837",
            "date": "2013-07-23T18:38:44+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}