{
    "id": "SOLR-10996",
    "title": "Implement TriggerListener API",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Sub-task",
        "fix_versions": [
            "7.1"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "SOLR-10340 added API for configuring trigger listeners. This issue is about adding hooks in the framework for calling the listeners and providing a couple implementations (HTTP callback, logging).",
    "attachments": {
        "SOLR-10996.patch": "https://issues.apache.org/jira/secure/attachment/12875816/SOLR-10996.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-05T20:32:21+0000",
            "content": "Patch for review:\n\n\tsome refactoring to clarify what are the user-visible listeners as opposed to internal event processors,\n\timproved AutoScalingConfig and instantiation of listeners in ScheduledTriggers.TriggerListeners,\n\tunit tests.\n\n\n\nThis is a sizeable patch, it's probably better to review the changes using branch jira/solr-10996.\n(Edit: well, not a big patch, but confusing due to renames...) ",
            "author": "Andrzej Bialecki",
            "id": "comment-16075369"
        },
        {
            "date": "2017-07-06T08:58:46+0000",
            "content": "Thanks Andrzej. I reviewed the branch and had a few comments:\n\n\tminor nit - AutoScalingConfig.TriggerListenerConfig.stages can be an EnumSet\n\tString.format used in ScheduledTriggers is a forbidden api because it uses default locale. Use the overloaded method and pass Locale.ROOT explicitly\n\tThe format string is wrong. You need %s instead of {} for it to work correctly\n\tWe should pass the actual exception to the listener in case of failure of an action\n\tWe should also pass the ActionContext to the beforeAction and afterAction listener. The context has important information such as the computed plan etc.\n\tThe fireListeners call should always be guarded by try/catch so that an error in a listener (for stage=STARTED,BEFORE,AFTER) does not abort processing actions. Alternately, if a listener fails, should we abort processing and raise ABORT on all other listeners?\n\tShould we notify listeners about STARTED at all if the event processor isn't ready to handle this event? I see that you call listeners with WAITING stage but should we do that at all? Also, if users have to explicitly subscribe to WAITING then forgetting to do that can be quite confusing. Imagine receiving multiple STARTED notifications and no ABORTED/SUCCEEDED/FAILED stages for the events that had to wait.\n\tminor nit - ScheduledListeners.TriggerListeners.addPerStage, the conditions can be replaced with two map.computeIfAbsent calls\n\tScheduledListeners.TriggerListeners.close() should clear the listeners list or else it will leak memory.\n\tI don't like the idea of a class (TriggerListeners) closing itself. Perhaps we make it immutable and replace the TriggerListeners instance variable entirely. Alternately, we do what ScheduledTriggers does with triggers i.e. close/replace only the listeners which have actually changed. What do you think?\n\n ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16076188"
        },
        {
            "date": "2017-07-06T18:04:46+0000",
            "content": "Patch addressing issues from review, plus an implementation of HttpTriggerListener.\n\nShalin Shekhar Mangar re. issue #10 from your review... is your objection just to the Closeable.close() method there? Conceptually, the instance just resets its internal state when it gets a new configuration, I could use a separate method to indicate this if that's what you had in mind? ",
            "author": "Andrzej Bialecki",
            "id": "comment-16076993"
        },
        {
            "date": "2017-07-06T18:35:00+0000",
            "content": "is your objection just to the Closeable.close() method there?\n\nWell, yes but I also don't like the fact that we destroy and re-create listener instances which haven't been modified just because some part of autoscaling config is modified. We could keep it simple though and just create a listener instance just in time and discard after a single use and simplify the whole thing? ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16077036"
        },
        {
            "date": "2017-07-07T05:44:25+0000",
            "content": "The new patch is looking great btw. I especially like the HttpTriggerListener! ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16077632"
        },
        {
            "date": "2017-07-07T09:26:15+0000",
            "content": "I'll look into doing replacements of only the changed listeners.\n\ncreate a listener instance just in time and discard after a single use and simplify the whole thing\n\nI don't think this would work well, because the init method in some cases may have a substantial overhead (eg. creating a client, establishing connections, etc). ",
            "author": "Andrzej Bialecki",
            "id": "comment-16077858"
        },
        {
            "date": "2017-07-07T12:21:03+0000",
            "content": "I don't think this would work well, because the init method in some cases may have a substantial overhead (eg. creating a client, establishing connections, etc)\n\nOkay, I see your point. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16077999"
        },
        {
            "date": "2017-07-07T13:47:32+0000",
            "content": "Updated patch:\n\n\texisting listener instances are reused if their config is the same\n\tunit test for HttpTriggerListener\n\n\n\nI think this is ready. ",
            "author": "Andrzej Bialecki",
            "id": "comment-16078098"
        },
        {
            "date": "2017-07-10T05:06:29+0000",
            "content": "Thanks Andrzej. Looks really good! One minor nit - The TriggerListenerConfig.hashCode can use Objects.hash()\n\n+1 to commit. ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16079875"
        },
        {
            "date": "2017-07-10T17:08:00+0000",
            "content": "Committed to feature/autoscaling. Thanks Shalin for your reviews! ",
            "author": "Andrzej Bialecki",
            "id": "comment-16080661"
        },
        {
            "date": "2017-10-17T11:03:16+0000",
            "content": "Bulk close after 7.1.0 release ",
            "author": "Shalin Shekhar Mangar",
            "id": "comment-16207289"
        }
    ]
}