{
    "id": "SOLR-5676",
    "title": "SolrCloud updates rejected if talking to secure ZooKeeper",
    "details": {
        "affect_versions": "4.6.1",
        "status": "Closed",
        "fix_versions": [
            "4.7",
            "6.0"
        ],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When using secure zookeeper and a valid jaas configuration, SolrCloud will reject updates with a 503 error.\n\nThe problem is that in this case ZooKeeper sends states to the watchers like \"SaslAuthenticated\", but the ConnectionManager treats any state it doesn't know about as a disconnect.  Then, whenever a request comes in, SolrCloud will think it can't talk to ZooKeeper and reject the request.\n\nThese are the valid states that watchers can see with the current ZooKeeper version (3.4.5):\nDisconnected\nSyncConnected\nAuthFailed\nConnectedReadOnly\nSaslAuthenticated\nExpired\n\nConnectionManager currently does not handle:\nSaslAuthenticated\nConnectedReadOnly\nAuthFailed\n\nFrom my tests, it seems like the correct thing to do is just ignore these states:\n1) SaslAuthenticated - nothing has gone wrong here, so no need to disconnected\n2) ConnectedReadOnly - the client would only see this state if they specifically specified a read only client, so this is expected\n3) AuthFailed - this one is a little tricky.  If you try to authentication but fail (say you have an invalid JAAS conf), you may get AuthFailed, but depending on the ZK settings, you may still be able to communicate with ZooKeeper (i.e. see this in the log: Will continue connection to Zookeeper server \\\nwithout SASL authentication, if Zookeeper server allows it.)\n\nSo, it seems correct to ignore these states, possibly warning on AuthFailed, because that isn't expected in proper operation.",
    "attachments": {
        "SOLR-5676.patch": "https://issues.apache.org/jira/secure/attachment/12626011/SOLR-5676.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Gregory Chanan",
            "id": "comment-13885991",
            "date": "2014-01-29T23:26:16+0000",
            "content": "Here's a patch that does the above, warning if the client receives AuthFailed. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13887931",
            "date": "2014-01-31T17:39:05+0000",
            "content": "Commit 1563189 from Mark Miller in branch 'dev/trunk'\n[ https://svn.apache.org/r1563189 ]\n\nSOLR-5676: SolrCloud updates rejected if talking to secure ZooKeeper. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13887934",
            "date": "2014-01-31T17:40:22+0000",
            "content": "Commit 1563192 from Mark Miller in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1563192 ]\n\nSOLR-5676: SolrCloud updates rejected if talking to secure ZooKeeper. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13887936",
            "date": "2014-01-31T17:41:18+0000",
            "content": "Thanks Greg! Very simple fix, so I just put it in, we we should also really consider adding a test against a secure zk to ensure proper support in the future. "
        },
        {
            "author": "Gregory Chanan",
            "id": "comment-13887953",
            "date": "2014-01-31T18:08:24+0000",
            "content": "Agree on the test, I'll look into some other projects (hbase?) and see if they have unit tests for secure ZK. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13891095",
            "date": "2014-02-04T19:47:00+0000",
            "content": "Thanks Greg! I'll make a new JIRA issue for a secure test. "
        }
    ]
}