{
    "id": "SOLR-1712",
    "title": "option to supress facet constraints when count is == numFound",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "It would be handy to have an easy option to suppress (on the server side) any facet contraint values whose count is the same as numFound (ie: filtering on that constraint would not reduce the result size)\n\nthis should be a corollary to facet.mincount=1 and happen prior to facet.limit being applied.\n\nhttp://old.nabble.com/Removing-facets-which-frequency-match-the-result-count-to27026359.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12798145",
            "date": "2010-01-08T19:21:46+0000",
            "content": "one idea for extending the functionality beyond a simple boolean...\n\n\"facet.maxcount\" ... if it's a positive number, then any constraint who'se value is greater then facet.maxcount would be eliminated.\n\nif facet.maxcount is a negative number, then it is subtracted from numFound, and the result is used as the maxcount.  \n\n\n\tfacet.maxcount=0 (default) no upper limit on constraints returned\n\tfacet.maxcount=100 would only show contraints where filtering would reduce the result set to no more then 100)\n\tfacet.maxcount=-1 would only show constraints where filtering would reduce the result set by at least 1\n\tfacet.maxcount=-10 would only show constraints where filtering would reduce the result set by at least 10\n\n\n\n\n...once upon a time this would have been easy to implement in the basic faceting code, but i'm not even sure how to try and approach it with the distributed faceting code.\n\nany suggetions? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12798147",
            "date": "2010-01-08T19:29:29+0000",
            "content": "Also keep in mind that the docset used for faceting may not be the one used to return results (this is true for multi-select).\nAnd yes, if you still want the top 10 constraints after eliminating those with count>=facet.maxcount, it makes distributed search much harder (and probably makes future per-segment faceting harder too). "
        }
    ]
}