{
    "id": "SOLR-8296",
    "title": "Cannot find instructions for upgrading from one 5.x release to another",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.3.1",
        "status": "Closed",
        "resolution": "Implemented",
        "priority": "Major"
    },
    "description": "I'm trying to upgrade a Solr install on Linux from 5.2.1.  The current install was installed with the install_solr_service shell script.\n\nThis command doesn't work:\n\n\n./install_solr_service.sh /index/src/lucene_solr_5_3/solr/package/solr-5.3.2-SNAPSHOT.tgz -d /index/solr5 -s solr5 -p 8982\n\n\n\nI get this message:\n\n\nERROR: /etc/init.d/solr5 already exists! Perhaps Solr is already setup as a service on this host?\n\n\n\nWhat I was hoping for was another directory in /opt, the symlink /opt/solr5 changing to point at the new directory, and a new init script, with the installer noticing an existing solr.in.sh and other files in /index/solr5, and not touching them.\n\nWhen I installed 5.2.1, I used the same command, with the older install script and the 5.2.1 tarball.\n\nThere is an \"Upgrading Solr\" section in the reference guide, but it just talks about differences that might require config changes, not an actual procedure.\n\nI do not know whether we need a separate upgrade script or an upgrade option for the current script.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-16T17:29:11+0000",
            "author": "Shawn Heisey",
            "content": "When I asked about this on the IRC channel, Hoss recommended that I open this issue and tag Timothy Potter.\n\nI tried renaming the init script mentioned in the error message, and then it complained that the symlink in /opt already exists.\n\n\nERROR: /opt/solr5 already exists! Please move this directory / link or choose a different service name using the -s option.\n\n\n\nI renamed that symlink and then it installed.  This means I have a workaround, but novice users may not find their way through the problems.\n\nMy solr.in.sh was replaced, so I've got problems I need to correct, like the heap size. ",
            "id": "comment-15006958"
        },
        {
            "date": "2015-11-16T17:45:25+0000",
            "author": "Timothy Potter",
            "content": "Sergey Urushkin added an upgrade option to the enhancements in SOLR-8101. I think that patch is ready to be committed, but would like someone else to take a look as well.  ",
            "id": "comment-15006980"
        },
        {
            "date": "2016-09-13T21:29:01+0000",
            "author": "Jan Høydahl",
            "content": "Closing this, as it is already implemented with -f option  ",
            "id": "comment-15488489"
        }
    ]
}