{
    "id": "SOLR-2284",
    "title": "tests should not depend on indexes in example data dirs",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Several tests legitimately use \"example\" configs as a way of verifying that the configs themselves are valid and load properly.  other tests re-use the example configs to test out of lazyiness.\n\nIn either case, these tests should not be using existing indexes found in the example data directories when running the tests.  example indexes are not cleaned up at the end of test runs, and they are not deleted by \"ant clean\" a codec or other index incompatibility made on trunk can result in tests that fail because an old example index which the user has not manually cleaned up can not be open by the test.\n\ntests using example configs (for whatever reason) should always use their own private data directory cleaned up on test completion",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12970914",
            "date": "2010-12-13T17:38:30+0000",
            "content": "Here's three tests that failed for me consistently this morning until i realized it was because i had old indexes in the examples/multicore directory...\n\norg.apache.solr.client.solrj.embedded.MergeIndexesEmbeddedTest\norg.apache.solr.client.solrj.embedded.MultiCoreEmbeddedTest\norg.apache.solr.client.solrj.embedded.MultiCoreExampleJettyTest\n\n...there may be others depending on indexes in example/solr that i didn't get failures for "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13290498",
            "date": "2012-06-06T22:18:23+0000",
            "content": "This was dealt with at some point, the following steps...\n\n\necho BOGUS > multicore/core0/data/index/segments_1\necho BOGUS > multicore/core1/data/index/segments_1\nant test -Dtestcase=MergeIndexesEmbeddedTest\nant test -Dtestcase=MultiCoreEmbeddedTest\nant test -Dtestcase=MultiCoreExampleJettyTest\n\n\n\n..now result in tests passing even though the indexes on disk are corrupt "
        }
    ]
}