{
    "id": "SOLR-1212",
    "title": "TestNG Test Case",
    "details": {
        "affect_versions": "1.4",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "New Feature",
        "priority": "Major",
        "labels": "",
        "resolution": "Won't Do"
    },
    "description": "TestNG equivalent of AbstractSolrTestCase , without using JUnit altogether . \n\nNew Class created: AbstractSolrNGTest \n\nLICENSE.txt , NOTICE.txt modified as appropriate. ( TestNG under Apache License 2.0 ) \n\nTestNG 5.9-jdk15 added to lib. \n\nJustification:  In some workplaces - people are moving towards TestNG and take out JUnit altogether from the classpath. Hence useful in those cases.",
    "attachments": {
        "testng-5.9-jdk15.jar": "https://issues.apache.org/jira/secure/attachment/12410236/testng-5.9-jdk15.jar",
        "SOLR-1212.patch": "https://issues.apache.org/jira/secure/attachment/12410231/SOLR-1212.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Karthik K",
            "id": "comment-12717753",
            "date": "2009-06-09T17:12:03+0000",
            "content": "TestNG 5.9  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12790648",
            "date": "2009-12-15T10:26:31+0000",
            "content": "I'm not sure what to do with this. We don't need to ship this with our releases. Perhaps it is best to mark this as \"Won't Fix\" and link this issue to http://wiki.apache.org/solr/TestingSolr so that people who use TestNG can use this code if necessary. "
        },
        {
            "author": "Karthik K",
            "id": "comment-12795118",
            "date": "2009-12-29T19:37:11+0000",
            "content": "Keeping this out of the codebase would result in the patch being out of sync with the tree. If there were no licensing restrictions - what is the harm in having this in the tree.  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12796123",
            "date": "2010-01-04T09:27:17+0000",
            "content": "Keeping this out of the codebase would result in the patch being out of sync with the tree. If there were no licensing restrictions - what is the harm in having this in the tree.\n\nYou wrote this because you needed it at work and I appreciate that you thought about contributing it to Solr. But from Solr's perspective it is not needed and therefore I don't see why we should ship it at all. It is a class that is not used by Solr but would need to be maintained by us if we ship it. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12796953",
            "date": "2010-01-06T01:47:46+0000",
            "content": "I'm on the fence ... \n\ni agree it's (probably) useful to TestNG users and i would like to do as much as possible to make it easy for people to use the TestHarness (regardless of how they write tests) but the idea of including it in the release does \"smell fishy\" if we're not actually using it anywhere in Solr – it may not seem like much overhead to maintain it, but if it never gets used internally then it's not really clear if/when there are problems with it (even Test code needs to be tested to be sure that it's not broken).\n\nIf it's not included in the Solr repository, then it may fall out of sync with Solr – but that's true of any plugin someone writes and hosts on sourceforge, or github, or googlecode – we can advertise that it works with Solr 1.4, and if something changes in Solr 1.5, or Solr 1.6 or Solr 9.7 that breaks it then interested parties are free to update it with new version that does work.\n\n...If i knew more about TestNG i might be able to form a stronger opinion like \"this is awesome, it's super useful, we should include it\" or \"this doesn't really provide any value add to users\" but I just don't know enough either way. "
        },
        {
            "author": "Karthik K",
            "id": "comment-12797004",
            "date": "2010-01-06T06:25:42+0000",
            "content": "@Shalin , @HossMan - I understand the pain of maintaining this one separate from Junit - but was concerned mostly about this being out of date with the tree. \n\nAs regarding comparison between TestNG vs JUnit - one big advantage is to categorize the tests as different groups in testng and run them separately (especially useful as the code base of solr gets bigger + contrib ). Which is one of the primary reasons (After evaluating both ) - testng was chosen.  So  - if you guys are not comfortable with the patch - then (as shalin noted) - just make an entry in the wiki and leave this one as such. The code is definitely not big to warrant a sf project / github / google code at this point. \n\nA better patch would be to refactor existing JUnit Test case so that the testng version minimizes duplication as much as possible.  "
        },
        {
            "author": "Karthik K",
            "id": "comment-12797005",
            "date": "2010-01-06T06:27:32+0000",
            "content": "@HossMan - Interesting thread from stackoverflow - http://stackoverflow.com/questions/153427/is-there-a-junit-testrunner-for-running-groups-of-tests  . Not sure - how much of junit has kept up with TestNG recently but TestNG is definitely a notch up (IMHO, of course).  "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12872453",
            "date": "2010-05-27T22:05:37+0000",
            "content": "Bulk updating 240 Solr issues to set the Fix Version to \"next\" per the process outlined in this email...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201005.mbox/%3Calpine.DEB.1.10.1005251052040.24672@radix.cryptio.net%3E\n\nSelection criteria was \"Unresolved\" with a Fix Version of 1.5, 1.6, 3.1, or 4.0.  email notifications were suppressed.\n\nA unique token for finding these 240 issues in the future: hossversioncleanup20100527 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13043851",
            "date": "2011-06-03T16:47:23+0000",
            "content": "Bulk move 3.2 -> 3.3 "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13106457",
            "date": "2011-09-16T14:51:10+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13234727",
            "date": "2012-03-21T18:09:04+0000",
            "content": "Bulk of fixVersion=3.6 -> fixVersion=4.0 for issues that have no assignee and have not been updated recently.\n\nemail notification suppressed to prevent mass-spam\npsuedo-unique token identifying these issues: hoss20120321nofix36 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412217",
            "date": "2012-07-11T22:26:26+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429894",
            "date": "2012-08-07T03:44:04+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13451015",
            "date": "2012-09-07T21:40:21+0000",
            "content": "removing fixVersion=4.0 since there is no evidence that anyone is currently working on this issue.  (this can certianly be revisted if volunteers step forward)\n "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-16533217",
            "date": "2018-07-05T02:56:17+0000",
            "content": "JUnit seems to have won this fight after all.\n\nSafe to close? "
        },
        {
            "author": "Erick Erickson",
            "id": "comment-16533814",
            "date": "2018-07-05T15:33:50+0000",
            "content": "+1 to close. "
        }
    ]
}