{
    "id": "SOLR-10816",
    "title": "Change uniqueKey to use docValues and not stored field",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "This issue is about the performance improvements you can get by avoiding decompression during the first phase of a distributed search where only id and score is needed.\n\nThe improvements will be noticed for users if the docs are large or have lots of fields in them. \nFor users who don't have this scenario it shouldn't slow things done by any noticeable amounts?\n\nWe should default the unique key field to use docValuues='true' and stored='false' \n\nLinks to the discussion that lead to this idea:\n\n\n\thttps://issues.apache.org/jira/browse/SOLR-5478?focusedCommentId=16036951&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-16036951\n\thttp://mail-archives.apache.org/mod_mbox/lucene-dev/201706.mbox/%3C008201d2ddf9%2429435740%247bca05c0%24%40thetaphi.de%3E",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-05T17:53:03+0000",
            "content": "bq: For users who don't have this scenario it shouldn't slow things done by any noticeable amounts?\n\nI did some crude timings in SOLR-6888 and got about a 10% penalty even on very small documents. The minimum block size is 16K so.....\n ",
            "author": "Erick Erickson",
            "id": "comment-16037281"
        },
        {
            "date": "2017-06-05T18:18:40+0000",
            "content": "got about a 10% penalty\n\nErick: The penalty is with stored fields, right?  That means it is always a win! Sorry, I don't get your comment, maybe I misunderstood. ",
            "author": "Uwe Schindler",
            "id": "comment-16037312"
        },
        {
            "date": "2017-06-05T18:47:15+0000",
            "content": "Uwe:\n\nWell, I knew what I meant ...\n\nRight, I hacked in some code to pull the ID from the index on first pass rather than get it from stored (decompressed) values and saw about a 10% improvement in round-trip time. Note that this was all done locally so network overhead was minimal. ",
            "author": "Erick Erickson",
            "id": "comment-16037374"
        },
        {
            "date": "2017-06-08T09:38:21+0000",
            "content": "We have found out that there are some problems with changing the ID field to stored=false:\n\n\tIt currently prints a warning that distributed search does not work. This warning is obsolete.\n\tMoreLikeThis breaks if the ID field is not stored. I think this is a bug that should be fixed! Morelikethis should use the same mechanism to fetch vield values like the rest of solr, and not rely on stored fields. I think this is some missing part in the \"docvalues as stord fields\" refactoring.\n\n ",
            "author": "Uwe Schindler",
            "id": "comment-16042463"
        },
        {
            "date": "2018-11-07T01:13:54+0000",
            "content": "This is probably obsolete at this point in at least the following way:\n\nGiven the work on SOLR-12625, we shouldn't be paying the performance penalty for first-pass fetching of the doc ID.\n\nthat does not address Uwe's comments about not storing the uniqueKey, so it's probably best to store it and make it docValues. ",
            "author": "Erick Erickson",
            "id": "comment-16677488"
        },
        {
            "date": "2018-11-07T11:15:01+0000",
            "content": "Hi Erick,\nthanks for reminding me and thanks for fixing SOLR-12625.\nI agree, the best would be to make the ID field stored and doc values enabled. This should be done anyways, as the ID field is most ofen of type \"StrField\", which has docvalues enabled by default for recent schema versions. But Maybe we should enforce some properties for \"internal fields\" like 'id', '_version' and similar. ",
            "author": "Uwe Schindler",
            "id": "comment-16678057"
        }
    ]
}