{
    "id": "SOLR-11492",
    "title": "More Modern cloud dev script",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "SolrCloud"
        ],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "master (8.0)",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Most of the scripts in solr/cloud-dev do things like start using java -jar and other similarly ancient techniques. I recently decided I really didn't like that it was a pain to setup a cloud to test a patch/feature and that often one winds up needing to blow away existing testing so working on more than one thing at a time is irritating... so here's a script I wrote, if folks like it I'd be happy for it to be included in solr/cloud-dev",
    "attachments": {
        "cloud.sh": "https://issues.apache.org/jira/secure/attachment/12892289/cloud.sh"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-10-18T17:04:27+0000",
            "content": "This looks cool.\nI wanted to try it but failed because on Mac OS X, a BSD derivative, the \"date\" executable doesn't support date -I so I replaced it with date \"+%Y-%m-%d\" ",
            "author": "David Smiley",
            "id": "comment-16209688"
        },
        {
            "date": "2017-10-18T23:21:58+0000",
            "content": "Ah good find... that seem to also work on ubuntu linux so I'll go with that ",
            "author": "Gus Heck",
            "id": "comment-16210273"
        },
        {
            "date": "2018-11-04T02:21:07+0000",
            "content": "I completely rewrote this to be far more useful and have more standard option based interface. When I tried to move to a new repo for commit work I realized I had been relying on a bunch of commands before and after this script on the bash history line, and those lines tended to have directory names baked in that made it hard to easily do things like have a cluster for just testing one issue.\n\nIf others think they would use the new version,  I'll be happy to check it into either of /solr/cloud-dev or /dev-tools/scripts ",
            "author": "Gus Heck",
            "id": "comment-16674263"
        },
        {
            "date": "2018-11-04T04:03:17+0000",
            "content": "tweaks to make it work on osx and new now implies -r to ensure we fetch and unpack a tarball before trying to start ",
            "author": "Gus Heck",
            "id": "comment-16674285"
        },
        {
            "date": "2018-11-04T05:29:15+0000",
            "content": "One more set of tweaks to make behavior more consistent, and allow deployment of previously built tarball, plus examples in comment at top\n\n \n\n Create a brand new 4 node cluster deployed in a directory named for today\n\n./cloud.sh new\n\n\n Create a brand new 4 node cluster deployed in a directory named SOLR-1234567\n\n ./cloud.sh new SOLR-1234567\n\n\n Stop the cluster\n\n ./cloud.sh stop\n\n\n Compile and push new code to a running cluster (incl bounce the cluster)\n\n ./cloud.sh restart -r\n\n\n Dump your hoplessly fubar'd collections and start fresh with the existing tarball\n\n ./cloud.sh restart -c\n\n\nAdditional options...\n\n Usage:\n    ./cloud.sh <command> [options] [name]\n\n Options:\n  -c                clean the data directories erasing all indexed data\n  -r                recompile server with 'ant clean server create-package'\n  -n <num>          number of nodes to create/start if this doesn't match error\n  -w <path>         path to the vcs checkout\n  -z <num>          port to look for zookeeper on (2181 default)\n\n Commands:\n   new              Create a new cluster and start it\n   start            Start an existing cluster specified by [name]\n   stop             stop the cluster specified by [name]\n   restart          stop and then start\n\n\n ",
            "author": "Gus Heck",
            "id": "comment-16674304"
        },
        {
            "date": "2018-11-04T16:39:02+0000",
            "content": "updated: last version had an issue with an extra pushd command, and also didn't provide a good message for the case where the tarball doesn't exist. ",
            "author": "Gus Heck",
            "id": "comment-16674437"
        }
    ]
}