{
    "id": "SOLR-4336",
    "title": "4.1 no longer treats blank request params the same way as 4.0",
    "details": {
        "affect_versions": "4.1",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I haven't figured out where/why this changed, but IRC user trmnlr pointed out to me that a query like the following example works fine in Solr 4.0 and results in the default value for \"start\", but produces a 'NumberFormatException: For input string: \"\"' in Solr 4.1...\n\nhttp://localhost:8983/solr/select?q=*:*&start=&rows=10\n\n...the code related to parsing the \"start\" param hasn't changed between 4.0 and 4.1, suggesting that this is a more general regression in behavior in something more lower level, that probably affects all SolrParams – anywhere in the past that users might have safely specify an empty string value and still get Solr's \"default\" value will likely now behave differently.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13560361",
            "date": "2013-01-23T03:20:44+0000",
            "content": "This is probably my fault - I think I made some changes for solr.xml that may have affected this. Just did not notice because it did not trip any tests most likely. This was so that you could set properties like \n\n${property:}\n\n and get the default value by not not setting that property.\n\nThis is just a guess at the moment - the memory is still loose - but a direction to look. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13560377",
            "date": "2013-01-23T04:13:00+0000",
            "content": "Actually, i'm fairly certain this change stems from SOLR-4265...\n\nOn trunk and in 4.1, SolrRequestParsers.parseFormDataContent handles the parsing of URL encoded key=val pairs, and (from what i can tell) adds empty string values as is.\n\nBut up to and including Solr 4.0, this method didn't exist, and in most cases ServletSolrParams (which no longer exists) was used, and it contained the following logic...\n\n\n  public String get(String name) {\n    String[] arr = map.get(name);\n    if (arr==null) return null;\n    String s = arr[0];\n    if (s.length()==0) return null;  // screen out blank parameters\n    return s;\n  }\n\n\n\n...which seems to explain the change in behavior – that \"screen out blank parameters\" special handling is missing in 4.1.\n\nThat said, i'm not certain whether i think we should \"fix\" this or not, largely because of that \"most\" caveat i mentioned before.  I haven't written a test for this, but from what i can see it appears that in the case of a multipart file upload (or a raw POST, ie; any POST that was not \"application/x-www-form-urlencoded\"), the more simple logic of \"SolrRequestParsers.parseQueryString( req.getQueryString());\" was used, and that appears to have preserved empty string values.\n\nSo at least the new behavior is consistent ... but i'm not sure if that makes it \"better\" since the nature of the problem doesn't lend itself to any sort of \"config work around\" that we can suggest to anyone who might be bitten by this bug on upgrading – people have to change their client code. "
        }
    ]
}