{
    "id": "SOLR-12967",
    "title": "MOVEREPLICA converting replica to NRT",
    "details": {
        "type": "Bug",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "priority": "Minor",
        "resolution": "Unresolved",
        "affect_versions": "7.5"
    },
    "description": "When calling Collections API's MOVEREPLICA, the new replica created is always NRT type, even when the original replica is PULL or TLOG. As discussed on IRC, it should use the source replica type, or provide a parameter for the user to choose the new replica's type, similar to ADDREPLICA <type> parameter.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16677188",
            "content": "I advised Gilson to open this issue in the #solr channel.\n\nDo we need separate issues for work on other Collections API actions that don't consider the replica type, or will we just expand this issue to cover checking the whole API?\n\nI had a thought for a feature request – add a couple of new settings:  1) a default replica type, to be used instead of NRT when nothing else indicates what type to use.  2) A flag to indicate whether the default replica type should override an existing type, which would cover things like MOVEREPLICA and maybe others.  When the user's request explicitly asks for a type, that would of course take precedence over both of these settings. ",
            "author": "Shawn Heisey",
            "date": "2018-11-06T19:07:31+0000"
        },
        {
            "id": "comment-16677299",
            "content": "Shawn:\n\nI would think that the original proposal of \"use the source replica's type or an explicit override\" is best for MOVEREPLICA.\n\nFor other kinds of operations, <2> is confusing to me. ADDREPLICA already has a \"type\" you can specify that defaults to NRT. What other operations do you think need this? At any rate the general approach of \"use NRT unless there's a 'type' override\" seems like the right thing to do.\n\n \n\n  ",
            "author": "Erick Erickson",
            "date": "2018-11-06T21:04:25+0000"
        },
        {
            "id": "comment-16677352",
            "content": "In general, I completely agree that MOVEREPLICA should preserve the replica type that already exists.\n\nBut when I was thinking about the idea where somebody could specify a default replica type, I wondered if some people might want that to override what things like MOVEREPLICA do by default.  I'm not sure that such an option should be implemented, but I did think of it.\n\nGilson also noticed that UTILIZENODE created NRT replicas.  Which might really be the same problem – it would be reasonable for UTILIZENODE to be implemented internally as MOVEREPLICA. ",
            "author": "Shawn Heisey",
            "date": "2018-11-06T22:13:51+0000"
        }
    ]
}