{
    "id": "SOLR-498",
    "title": "Make it easier to debug new plugin code in an IDE",
    "details": {
        "affect_versions": "1.2",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "I'm developing components to be deployed via schema.xml. I happen to use Eclipse, but I think that comparable fates await the users of other IDEs.\n\nI tried, and failed, to find a way to incorporate my eclipse output directory into the appropriate classpath for schema.xml files.\n\nPutting it into the global jetty classpath via the jetty startup config does not work, due to webapp class loader delegation rules.\n\nIt would be really delux if there were a config file somewhere that would allow me to add directories that occur in the same class loader's classpath as the solr/lib directory. \n\nIt would be nearly as delux if solr merely supported solr/classes, so that I could point Eclipse there.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-12575857",
            "date": "2008-03-06T19:56:31+0000",
            "content": "Hymmm, so you are trying to develop by putting your generated .jar files in the lib directory in solr home?\n\nI'm missing what problem you have – i build plugins with eclipse without issue.  \n\nFor dev, I launch solr with \"run jetty run\"\nhttp://code.google.com/p/run-jetty-run/\nand use my classes directly rather then putting them in the solr.solr.home/lib directory \n\nIn the future, try this question on solr-user@lucene.apache.org first – that has a wider audience of people who can help get things set up. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-12575861",
            "date": "2008-03-06T20:14:58+0000",
            "content": "I hadn't met run-jetty-run, so I was trying to make things work better when running with start.jar with the usual remote debugging horror.\n\nIt might still be that a more flexible classpath configuration than a single lib dir for jars would be useful, but resolve me out of existence if that's not persuasive. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12576353",
            "date": "2008-03-07T19:59:43+0000",
            "content": "from a developers perspective, the overhead of running \"jar cf solr/lib/myjar.jar classes/*\" seems trival compared to the actual compilation of the java code plus the restarting of the servlet container (or at a minimum: reloading the war) so it hardly seems worthwhile for the debuging case.\n\nif someone wants to submit a patch to allow more customizable configuration of the plugin classloader, i won't object – but it seems unnecessary to me.  jars are a very clean way to package plugins, and having a single lib directory for holding them is simple and easy to understand. "
        },
        {
            "author": "Benson Margulies",
            "id": "comment-12576442",
            "date": "2008-03-07T23:36:23+0000",
            "content": "Let me try to draw a clearer picture here of what I had in mind.\n\nI'm sitting here in front of eclipse. It automatically rewrites .class files to whatever folder I tell it to as I make changes. Now, pace run-jetty-run, here's what I've been doing.\n\n1) I made a shell script to launch the example with the usual -X arguments to allow a debugger to attach.\n\n2) Every time I made a change, I used the Eclipse jar exporter to package the classes into a jar in solr/lib.\n\n3) Then cycle jetty and attach Eclipse.\n\nBy no means am I proposing that a more complex delivery mechanism is appropriate for production use. This is all about the edit-deploy-debug cycle, such as it is.\n\nI confess that even with the hints on the user list, I still haven't managed to get solr running from eclipse with run-jetty-run. I can't seem to round up the right jar files in the classpath, and I seem to have hit a bug in run-jetty-run related to using Eclipse workspace links.\n\nHaving written all this, I think we should abandon this as an issue. I will eventually sort out RJR, and when I do I'll look for a place on your Wiki to record a detailed recipe.\n\n "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12625216",
            "date": "2008-08-24T19:12:11+0000",
            "content": "Per comment from original poster, closing this issue. "
        }
    ]
}