{
    "id": "SOLR-7486",
    "title": "HttpSolrClient.shutdown() should call close() and not vice versa",
    "details": {
        "components": [],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "5.2"
        ],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Major"
    },
    "description": "HttpSolrClient.shutdown() is deprecated, however close() calls it instead of the other way around. If anyone extends HttpSolrClient, he needs to override both methods to make sure things are closed properly.",
    "attachments": {
        "SOLR-7486.patch": "https://issues.apache.org/jira/secure/attachment/12729201/SOLR-7486.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-04-29T15:45:19+0000",
            "author": "Shai Erera",
            "content": "Trivial patch. This only affects 5x as shutdown() has been removed in trunk already. ",
            "id": "comment-14519596"
        },
        {
            "date": "2015-04-29T16:42:13+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "In general, I think the way it is now is better for back compatibility when deprecating. If you have extended HttpSolrClient (before the addition of \"close()\") and overrode \"shutdown()\", then your code could stop working with your change. That said, in this specific case, you are probably also calling \"super.shutdown()\", because otherwise the httpClients are not closed, but we can only be sure about that in this case because those are private fields.\nIf anyone extends HttpSolrClient, he needs to override both methods to make sure things are closed properly.\nIf you are extending now, you should extend close(), and make sure you call super.close() at some point. That will work with 5 and trunk. ",
            "id": "comment-14519695"
        },
        {
            "date": "2015-04-29T17:41:17+0000",
            "author": "Shai Erera",
            "content": "This is the usual pattern when deprecating code - you make the deprecated code call the non-deprecated code (when possible). Also in this case users have to call super.shutdown() to close the client.\n\nIn my case I need to provide my own HttpClient which I cannot save a reference to outside HttpSolrClient. So I pass my custom HttpClient to HttpSolrClient constructor. However, that makes HttpSolrClient determine my client isn't an internalClient, and therefore it doesn't close it on shutdown/close. I need to do it myself, only I now need to override both close() and shutdown().\n\nWith this change, and in the context of HttpSolrClient, I believe this patch is OK. It follows usual deprecation practice (at least that I've seen), it ensures the HttpClient is closed if you call either shutdown or close, it doesn't impact users who only override shutdown(), since as you mentioned, they need to call super.shutdown() already and when the day comes and we remove this deprecated API, we only need to delete the method, and not worry about copying code to close().\n\nBTW, are we really going to carry this API 'till 6.0? If not, it's been deprecated in 5.0 and 5.1, and we can just remove it now ... ",
            "id": "comment-14519806"
        },
        {
            "date": "2015-04-30T02:40:29+0000",
            "author": "Shai Erera",
            "content": "Unless there are objections, I will commit this later today. ",
            "id": "comment-14520735"
        },
        {
            "date": "2015-04-30T21:00:05+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1677072 from Shai Erera in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1677072 ]\n\nSOLR-7486: HttpSolrClient.shutdown() should call close() and not vice versa ",
            "id": "comment-14522256"
        },
        {
            "date": "2015-04-30T21:00:16+0000",
            "author": "Shai Erera",
            "content": "Committed to 5x. ",
            "id": "comment-14522257"
        },
        {
            "date": "2015-06-15T21:43:52+0000",
            "author": "Anshum Gupta",
            "content": "Bulk close for 5.2.0. ",
            "id": "comment-14586880"
        }
    ]
}