{
    "id": "SOLR-11013",
    "title": "remove /v2/c alias in favour of /v2/collections only",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [
            "v2 API"
        ],
        "type": "Wish",
        "fix_versions": [],
        "affect_versions": "None",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "(Perhaps this has already been considered previously elsewhere or on the mailing list and I just missed it then and couldn't find it now, in which case happy to withdraw this ticket.)\n\nWould like propose that /v2/c be removed in favour of /v2/collections only:\n\n\tthere being two ways to do the same thing is potentially confusing\n\t/v2/c is short but c could stand not only for collections but also for cores or cluster or config or cloud etc.",
    "attachments": {
        "SOLR-11013.patch": "https://issues.apache.org/jira/secure/attachment/12875784/SOLR-11013.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-05T16:49:10+0000",
            "content": "Attaching proposed patch, tests seem to pass with these changes, not sure on how any documentation or CHANGES.txt wording would have to be given that v2/c is already out there? ",
            "author": "Christine Poerschke",
            "id": "comment-16075070"
        },
        {
            "date": "2017-07-05T17:05:28+0000",
            "content": "Since it's marked as an experimental feature we could say that /v2/c has been removed in favour of the already existing /v2/collections endpoint? ",
            "author": "Varun Thacker",
            "id": "comment-16075090"
        },
        {
            "date": "2017-07-05T22:11:33+0000",
            "content": "I think perhaps the collections endpoint is special, since it will be by far the most used, thus it warrants a shortcut in my mind. I don't want to type curl localhost:8983/v2/collections/mycoll/select?q=foo which is 10 keystrokes more than needed with v1 api... With /v2/c it will remain same length as today. Let's instead remove the /v2/collections variant? ",
            "author": "Jan Høydahl",
            "id": "comment-16075515"
        },
        {
            "date": "2017-07-08T21:09:05+0000",
            "content": " I'd put a tentative +1 in for Christine's proposal.  Conciseness is important, but I'd vote for clarity where the two are at odds.  If it was a different concept with a different (less common) first initial, things would be different.  But as is, \"c\" is pretty overloaded as an abbreviation.\n\nIf people are still unhappy with that, there is a third option: choose a less ambiguous but still concise abbreviation.  coll is one option: it's harder to confuse with other Solr \"c\"s, and saves you 6 characters over \"collection\". ",
            "author": "Jason Gerlowski",
            "id": "comment-16079318"
        },
        {
            "date": "2017-09-25T07:43:19+0000",
            "content": "there are only the following prefixes now\n\n\n\t/collections\n\t/c\n\t/cores\n\t/cluster\n\t/node\n\n\n\nSo, is there any scope for confusion?  ",
            "author": "Noble Paul",
            "id": "comment-16178676"
        }
    ]
}