{
    "id": "SOLR-3719",
    "title": "Add \"instant search\" capability to example/files /browse",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "5.3",
            "6.0"
        ],
        "components": [],
        "type": "New Feature",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Once upon a time I tinkered with this in a personal github fork https://github.com/erikhatcher/lucene-solr/commits/instant_search/",
    "attachments": {
        "SOLR-3719.patch": "https://issues.apache.org/jira/secure/attachment/12737305/SOLR-3719.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13452200",
            "date": "2012-09-10T17:41:58+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14568439",
            "date": "2015-06-02T03:02:19+0000",
            "content": "Esther Quansah is going to tackle this for example/files. "
        },
        {
            "author": "Esther Quansah",
            "id": "comment-14571282",
            "date": "2015-06-03T16:25:52+0000",
            "content": "Instant search functional with change of type and locale..now on to suggest! "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14572744",
            "date": "2015-06-04T13:29:04+0000",
            "content": "Thanks Esther Quansah for that initial patch.   I've tweaked it a bit to have a separate template that includes the facets too such that as the instant search results appear the facets (top phrases by default) adjust too.  I also added escaping of the query parameter on the instant search URL (otherwise multiword results with spaces didn't work).   The one issue with my patch is that the top phrases tag cloud loses its styling - can you fix that somehow? "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14572756",
            "date": "2015-06-04T13:36:55+0000",
            "content": "I wonder if this feature should adapt the technique, say, google.com does with its instant search feature whereby hitting return or tabbing out of the search field adjusts the URL with the hash-q trick so that the page doesn't have to fully refresh (when pressing enter) or having the old state (when tabbing out).  Food for thought. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14572764",
            "date": "2015-06-04T13:37:54+0000",
            "content": "But in general - this feature as-is works pretty nicely!   Getting the suggest in there will make it even sweeter. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14572819",
            "date": "2015-06-04T14:09:54+0000",
            "content": "Another tweak needed Esther Quansah is to add filters/sort to the instant search request.  I think adding lensNoQ to the URL should do the trick. "
        },
        {
            "author": "Esther Quansah",
            "id": "comment-14574461",
            "date": "2015-06-05T13:05:03+0000",
            "content": "Awesome idea, Erik! Definitely one we should consider after suggest is implemented. With this small patch - updated JS to fix tag cloud styling during instasearch, attached filter/sort to instasearch. Now onto suggest!! "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-14574663",
            "date": "2015-06-05T15:15:14+0000",
            "content": "Committed: oops, forgot to put JIRA tag on commit message.  trunk is r1683778, branch_5x is 1683779.\n\nI adjusted a couple of things from Esther's patch: streamlined some macros (required some moving around in the built-in VrW ones), added mincount=0 to the doc_type facet so that the type doesn't disappear on the UI in instant search, and added start (effectively page number) when switching locales so it doesn't jump back to page 1. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14713090",
            "date": "2015-08-26T13:05:43+0000",
            "content": "Bulk close for 5.3.0 release "
        }
    ]
}