{
    "id": "SOLR-7554",
    "title": "Add checks in Streams for incoming stream order",
    "details": {
        "components": [
            "SolrJ"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "5.2,                                            6.0",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "Most Streams built on top of other streams require that their incoming stream(s) be ordered in a complimentary way to how this stream is expected to output its results. \n\nFor example, if a MergeStream is merging two streams on \"fieldA asc, fieldB desc\", then both its incoming streams must be ordered in a similar way. That said, the incoming stream could be ordered more strictly, ie \"fieldA asc, fieldB desc, fieldC asc\" but as long as the the comparator used in the MergeStream can be \"derived from\" the incoming stream's comparator then we are good to go. \n\nSome comparator A can be \"derived from\" some other comparator B iff the fields and their order in A is equal to the first fields and their order in B. For example, \"fieldA asc, fieldB dec\"  can be derived from \"fieldA asc, fieldB desc, fieldC asc, fieldD asc\" but cannot be derived from \"field A asc\".\n\nThis patch is to add this validation support. It requires changes to Comparators, Equalitors, most Streams, and related tests. It adds a way to compare Comparators and Equalitors and in the end is one more required piece before we can add support for Join streams.\n\nIt is dependent on SOLR-7513 and SOLR-7528. Other dependencies it has have already been committed to trunk and the 5.2 branch.\n\nIt does not change any interfaces to code already released (5.1 and below). It does change interfaces to code in trunk and 5.2.",
    "attachments": {
        "SOLR-7554.patch": "https://issues.apache.org/jira/secure/attachment/12733344/SOLR-7554.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-05-17T12:51:38+0000",
            "author": "Yonik Seeley",
            "content": "It does not change any interfaces to code already released (5.1 and below).\n\nJust a general note that we do have more ability to change things across releases if it's marked as experimental.  I'd recommend anything with a complex API to be designated as experimental at first, to give time for improvements after more people have had a chance to look / use it. ",
            "id": "comment-14547156"
        },
        {
            "date": "2015-06-22T00:48:47+0000",
            "author": "Joel Bernstein",
            "content": "New patch built with svn diff. Streaming tests are passing. Looks like all this ticket needs is a few tests that demonstrate Streams throwing an exception when the sorts don't line up properly. I will add those tests to the patch shortly.\n\nThanks [~dgove1], this is an important patch which should eliminate hard to recognize bugs that will appear if/when sorts are incompatible. ",
            "id": "comment-14595267"
        },
        {
            "date": "2015-06-22T22:53:40+0000",
            "author": "Joel Bernstein",
            "content": "Added tests that ensure the proper exception is being thrown for the MergeStream, UniqueStream and ReducerStream.\n\nDidn't add the parallel tests yet as Exceptions are not being propagated from the workers yet. Those tests can be added in another ticket after exception propagation is put in place for parallel requests. ",
            "id": "comment-14596793"
        },
        {
            "date": "2015-06-24T13:07:10+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1687258 from Joel Bernstein in branch 'dev/trunk'\n[ https://svn.apache.org/r1687258 ]\n\nSOLR-7554: Add checks in Streams for incoming stream order ",
            "id": "comment-14599363"
        },
        {
            "date": "2015-07-22T20:48:01+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1692327 from Joel Bernstein in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1692327 ]\n\nSOLR-7554: Add checks in Streams for incoming stream order ",
            "id": "comment-14637588"
        },
        {
            "date": "2015-07-22T21:54:57+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1692329 from Joel Bernstein in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1692329 ]\n\nSOLR-7554: Reverting 5x commit ",
            "id": "comment-14637711"
        },
        {
            "date": "2015-08-09T20:51:32+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1694908 from Joel Bernstein in branch 'dev/trunk'\n[ https://svn.apache.org/r1694908 ]\n\nSOLR-7554: Updated CHANGES.txt ",
            "id": "comment-14679336"
        },
        {
            "date": "2015-08-09T20:51:51+0000",
            "author": "Joel Bernstein",
            "content": "Release with Solr 6 ",
            "id": "comment-14679337"
        }
    ]
}