{
    "id": "SOLR-3852",
    "title": "Admin UI - Cloud Tree ArrayIndexOutOfBoundsException if binary files anywhere in ZK tree",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Closed",
        "fix_versions": [
            "4.5",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Original bug description indicated that when using Solr with embedded ZK everything was fine, but with an external ZK you'd get an ArrayIndexOutOfBoundsException.\n\nCrux of the problem is some bad assumptions about any ZK node containing data – the ZookeeperInfoServlet powering the tree view of the Cloud Admin UI assumed that any data would be utf8 text.\n\nIf you are using extenral ZK, and other systems are writing data into ZK, then you are more likely to see this problem, because those other systems might be writing binary data in to ZK nodes – if you are using ZK embedded in solr, or using solr with it's own private (external) ZK instance, then you would only see this problem if you explicitly put binary files into solr configs and upconfig them into ZK.\n\n\n\nOne workarround for people encountering this problem when using Solr with a ZK instance shared by other tools is to make sure you use a \"chroot\" patch when pointing Solr at ZK, so that it won't know about any other paths in your ZK tree that might have binary data...\n\nhttps://wiki.apache.org/solr/SolrCloud#Zookeeper_chroot\n\nIf you are having this problem because you put binay files into your own config dir (ie: images for velocity or something like that) then there is no straight forward workarround.\n\nExample stack trace for this bug...\n\n\n43242 [qtp965223859-14] WARN  org.eclipse.jetty.servlet.ServletHandler /solr/zookeeper\njava.lang.ArrayIndexOutOfBoundsException: 213\n        at org.apache.lucene.util.UnicodeUtil.UTF8toUTF16(UnicodeUtil.java:620)\n        at org.apache.lucene.util.BytesRef.utf8ToString(BytesRef.java:168)\n        at org.apache.solr.servlet.ZookeeperInfoServlet$ZKPrinter.printTree(ZookeeperInfoServlet.java:303)\n        at org.apache.solr.servlet.ZookeeperInfoServlet$ZKPrinter.printTree(ZookeeperInfoServlet.java:339)\n        at org.apache.solr.servlet.ZookeeperInfoServlet$ZKPrinter.printTree(ZookeeperInfoServlet.java:339)\n...\norg.apache.solr.servlet.ZookeeperInfoServlet$ZKPrinter.print(ZookeeperInfoServlet.java:228)\n        at org.apache.solr.servlet.ZookeeperInfoServlet.doGet(ZookeeperInfoServlet.java:106)",
    "attachments": {
        "SOLR-3852.patch": "https://issues.apache.org/jira/secure/attachment/12600854/SOLR-3852.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13458775",
            "date": "2012-09-19T15:57:33+0000",
            "content": "Mark Miller would you mind having a look here? With the given response the UI is not able to display that Tree, that's pretty sure .. but no idea what causes the ArrayIndexOutOfBounds? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13458800",
            "date": "2012-09-19T16:18:18+0000",
            "content": "Woah - i got pinged in email because you mentioned my name - never saw that before. Cool.\n\nYeah, I can take a look. "
        },
        {
            "author": "Shikhar Bhushan",
            "id": "comment-13719193",
            "date": "2013-07-25T03:35:00+0000",
            "content": "We've run into this. Was an ArrayIndexOutOfBoundsException arising out of: https://github.com/apache/lucene-solr/blob/4ce168a/solr/core/src/java/org/apache/solr/servlet/ZookeeperInfoServlet.java#L303\n\nWe have some znodes storing binary data but that bit above assumes that if a znode has data, it'll be a UTF-8 encoded string.\n\nThat block doesn't actually do anything post-decode, so maybe it should just be removed. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13755126",
            "date": "2013-08-30T20:52:53+0000",
            "content": "This has popped up on the mailing list again recently, so i took a look...\n\nAs Shikhar noted, the particular exception is happening in a bit of dead code which is easy enough to remove – but that's only part of hte problem.\n\nthe dead code is part of the tree walk of every ZK node that happens anytime you load the tree view page at all – so having any non utf8 files anywhere in your ZK tree is going to cause that exception as soon as you try to look at the Solr ZK UI – to reproduce just copy favicon.ico into your collection1/conf dir for example.\n\nbut even if we purge that dead code, a similar bit of logic exists in the function for fetching the details about a node if someone clicks on it.\n\nLooking through the history of the file, it seems like this problem was introduced back in r1298010 when the code was switched to use BytesRef – the existing logic to hex escape anything that wasn't in unicode wasn't preserved  – but from what i can tell, i don't think that ever worked (catching UnsupportedEncodingException from \"new String(byte[],String)\" doesn't seem right there according to the docs) and i'm not sure what use that would be anyway.\n\nIn the attached patch, i purged the dead code, added some error handling around the remaining attempt to serialize the \"data\" of any node the user clicks on, and in the event that the data can't be converted to String add a new \"dataNote\" property explaining why \"data\" is empty (even though dataLengh is non zero)\n\nIf no one sees any problems with this, i'll commit ASAP ... if we want to revist adding teh hex encoding output of bin conent we should probably hash that out in a new issue as an improvement, since i'm not convinced it's a good idea to just blindly do that in the same \"data\" field of the response ... could confuse people. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13755141",
            "date": "2013-08-30T21:04:33+0000",
            "content": "updated description with some notes and workaround for common trigger of underlying problem.\n\n(thanks to joeo's comments on the solr mailing list for pointing out hte work arround) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13756809",
            "date": "2013-09-03T17:29:50+0000",
            "content": "Commit 1519763 from hossman@apache.org in branch 'dev/trunk'\n[ https://svn.apache.org/r1519763 ]\n\nSOLR-3852: Fixed ZookeeperInfoServlet so that the SolrCloud Admin UI pages will work even if ZK contains nodes with data which are not utf8 text "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13756855",
            "date": "2013-09-03T18:13:24+0000",
            "content": "Commit 1519779 from hossman@apache.org in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1519779 ]\n\nSOLR-3852: Fixed ZookeeperInfoServlet so that the SolrCloud Admin UI pages will work even if ZK contains nodes with data which are not utf8 text (merge r1519763) "
        },
        {
            "author": "Adrien Grand",
            "id": "comment-13787063",
            "date": "2013-10-05T10:19:01+0000",
            "content": "4.5 release -> bulk close "
        }
    ]
}