{
    "id": "SOLR-5843",
    "title": "No way to clear error state of a core that doesn't even exist any more",
    "details": {
        "affect_versions": "4.6.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Created collections with missing configs - this is known to create a problem state. Those collections have all since been deleted – but one of my nodes still insists that there are initialization errors.\n\nThere are no references to those 'failed' cores in any of the cloud tabs, or in ZK, or in the directories on the server itself. \n\nThere should be some easy way to refresh this state or to clear them out without having to restart the instance.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Furkan KAMACI",
            "id": "comment-13925316",
            "date": "2014-03-09T20:28:51+0000",
            "content": "Could you write down a scenario that I can produce it? I can work on this issue. "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13925317",
            "date": "2014-03-09T20:36:38+0000",
            "content": "Two node SolrCloud 4.6.1 deployment.\n\nDo a collection create with a config name that isn't mapped in ZK. You'll get the initialization failures.\n\nNow - this part is a bit vague - I don't remember the exact cleanup operations I did - but I think if you go and delete the invalid collection it may or may not make the errors go away. I thought that in previous cases when I issued the calls to delete the improperly created collections that it cleaned the errors up, but it doesn't appear to have in this case. It's possible that one of the nodes was in a weird state at the time, not sure. \n\nMy current situation is I have two nodes, and ONE of them still has the bogus errors on it, even though all the tabs (and zk tree view) all show no references to the invalid cores.\n\n\nbeta1_urlDebug_xxxxxxxxx_v16_shard1_replica2: org.apache.solr.common.cloud.ZooKeeperException:org.apache.solr.common.cloud.ZooKeeperException: Could not find configName for collection beta1_urlDebug_xxxxxxxxx_v16_shard1_replica2 found:[c-v17, default]\n\nIt's almost like it lost track of the fact that the collection was deleted for the purpose of the error reporting.\n\nI also can't find ANY reference to that error in the logs currently on the box, so appears to be in-memory only.  "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13925319",
            "date": "2014-03-09T20:37:11+0000",
            "content": "External 3 node zk ensemble being used. "
        },
        {
            "author": "Nathan Neulinger",
            "id": "comment-13925416",
            "date": "2014-03-10T02:57:41+0000",
            "content": "In case it helps any - interesting result - I restarted the node with the error this evening, and that bogus/broken collection spontaneously tried to recreate itself on that node. No error msg in the log though - just shows as all replicas being down.\n\nI issued a delete against it and got this error:\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response>\n<lst name=\"responseHeader\"><int name=\"status\">0</int><int name=\"QTime\">423</int></lst><lst name=\"failure\"><str name=\"10.220.16.191:8983_solr\">org.apache.solr.client.solrj.impl.HttpSolrServer$RemoteSolrException:Server Error\n\nrequest: http://10.220.16.191:8983/solr/admin/cores</str></lst>\n</response>\n\n\nbut, it did clear it out... Not sure what state it was in. If y'all think this is a goofy edge case that isn't likely to re-occur, go ahead and close this. Either way though, I do think there should be a way to tell solr \"clear your errors and retry/refresh\".  "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-14067565",
            "date": "2014-07-19T15:58:30+0000",
            "content": "I think this is taken care of by SOLR-6232 "
        }
    ]
}