{
    "id": "SOLR-2729",
    "title": "DIH status: successful zero-document delta-import missing \"\" field",
    "details": {
        "affect_versions": "3.2",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "If you have a successful delta-import that happens to process zero documents, the <str name=\"\"> field is not present in the status.  I've run into this situation when the SQL query results in an empty set.  A workaround for the problem is to instead look for the \"Time taken \" field ... but if you don't happen to notice that this field has an extraneous space in the name, that won't work either.\n\nA full-import that processes zero documents has the field present as expected:\n\n<str name=\"\">Indexing completed. Added/Updated: 0 documents. Deleted 0 documents.</str>",
    "attachments": {
        "SOLR-2729.patch": "https://issues.apache.org/jira/secure/attachment/12521366/SOLR-2729.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13106489",
            "date": "2011-09-16T14:51:18+0000",
            "content": "3.4 -> 3.5 "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13237074",
            "date": "2012-03-23T20:31:40+0000",
            "content": "Bulk changing fixVersion 3.6 to 4.0 for any open issues that are unassigned and have not been updated since March 19.\n\nEmail spam suppressed for this bulk edit; search for hoss20120323nofix36 to identify all issues edited "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13246562",
            "date": "2012-04-04T18:34:50+0000",
            "content": "Found it.  In solr/contrib/dataimporthandler/src/java/org/apache/solr/handler/dataimport/DocBuilder.java:\n\n\n// Do not commit unnecessarily if this is a delta-import and no documents were created or deleted\nif (!requestParameters.clean) {\n  if (importStatistics.docCount.get() > 0 || importStatistics.deletedDocCount.get() > 0) {\n    finish(lastIndexTimeProps);\n  }\n} else {\n  // Finished operation normally, commit now\n  finish(lastIndexTimeProps);\n}\n\n\n\nThe method named finish is where the status message gets updated with the status that says how many documents were added/updated.\n\nA fix that would take care of the immediate problem is to move the code that populates the \"\" part of statusMessages into its own method that is called by finish, then add an else clause to the inner if statement above which calls that method.  Does that sound at all reasonable? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13246569",
            "date": "2012-04-04T18:38:03+0000",
            "content": "Something that will require a separate issue, perhaps two: I really think that \"\" is not a good name for the place where this stuff goes, and that \"Time Taken \" should also be fixed so it has no trailing space.  Perhaps the entire status response needs some TLC.  Making these changes will break a lot of user code, but it specifically says in the status output that the format is experimental and may change. "
        },
        {
            "author": "James Dyer",
            "id": "comment-13246587",
            "date": "2012-04-04T18:54:50+0000",
            "content": "I agree the status messages should be better (Fix typos, no blank names, etc).  I don't think we should worry too much about breaking people's code (mine included).  Really, there should be a better way for automated schedulers to be able to check DIH status (JMX maybe?).  This is probably more of a long-term wish though.  In any case, I think the focus on the existing status page should be human-readability. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13246598",
            "date": "2012-04-04T18:59:08+0000",
            "content": "I created a method named putFinishStatus().  If this doesn't sound reasonable, or if this is not a good way to go, let me know and I'll fix it if I can.  When it's all ironed out, I'll make a patch for 3x as well.\n\nAll solr tests pass with this applied. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13396885",
            "date": "2012-06-19T16:09:13+0000",
            "content": "James: Could you please triage this for 4.0? commit if you think it's ready, otherwise remove the fix version? "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13412153",
            "date": "2012-07-11T22:26:11+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429737",
            "date": "2012-08-07T03:42:34+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13452199",
            "date": "2012-09-10T17:41:58+0000",
            "content": "moving all 4.0 issues not touched in a month to 4.1 "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636599",
            "date": "2013-04-19T17:00:45+0000",
            "content": "Closing this issue because it's a small piece of what SOLR-3319 is trying to do.  Will update notes on SOLR-3319 to indicate that a patch is available on this issue.\n\nThis is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        }
    ]
}