{
    "id": "SOLR-11129",
    "title": "Distributed facet search with localparm facet.mincount doesn't work in a multi shard cloud env.",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "fix_versions": [],
        "affect_versions": "4.10.4,                                            5.5.4,                                            6.6.1",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "Steps:-\n\n\tCreate a solr cloud setup, with 2 shards\n\tAdd some data to facet search on\n\tAdd a query where you filterquery against a field\n\tAnd then create a facet key with some localparams, including facet.mincount\n\n\n\nResults:-\n\n\tIf you set facet.mincount as a local param of the facet, it will be ignored and always return items with a count of 0\n\n\n\nExpected:-\n\n\tShould apply the localparam facet.mincount correctly in distributed facet search\n\n\n\nNotes:-\n\n\tThis is a regression from 4.9 where it worked (we have encountered this breaking change whilst trying to upgrade our current cluster)\n\tIncluded some dummy test data to illustrate and the query output\n\tIf you have the facet.mincount not as a local param it does apply",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2017-07-31T14:19:45+0000",
            "content": "I've been talking with this user on IRC.  Here's a summary:\n\nIt seems that facet parameters in localparams only apply at the shard level, rather than the whole collection.  So if \"f.workflow.assignedTo.facet.mincount\" is in the localparam, and there are enough docs with the field value in one shard, then it shows up in the output, and depending on how the mincount matches up with the count in each shard, the number of docs in the response might not be correct for the whole collection.  If \"f.workflow.assignedTo.facet.mincount\" is a URL parameter instead of part of locaparams, then it works completely as expected.\n\nThe burning question: Is this a bug, or an expected change due to new capability or some other bugfix?  It's definitely a regression for the user – everything works for them in version 4.9, but doesn't in 6.6, 5.5.3, and 4.10.4. ",
            "author": "Shawn Heisey",
            "id": "comment-16107358"
        },
        {
            "date": "2017-07-31T14:33:03+0000",
            "content": "Looking over CHANGES.txt for 4.10.x releases, I found a couple of issues that seem like they COULD be the cause: SOLR-6267 and SOLR-6314 are the numbers. ",
            "author": "Shawn Heisey",
            "id": "comment-16107369"
        }
    ]
}