{
    "id": "SOLR-3781",
    "title": "Admin UI does not work when wiring Solr into a larger web application",
    "details": {
        "affect_versions": "4.0-BETA",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "if i am wiring Solr into a larger web application which controls the web context root, you will probably want to mount Solr under a path prefix (app.war with /app/solr mounted into it, for example).\n For example:\n\nRootApp.war-------- /\nmyApp.war---------------/myApp\nprefixPath-------------------xxx\njsdir------------------------------js\njs file--------------------------------main.js\nadmin file-------------------------admin.html\n\norg.apache.solr.servlet.LoadAdminUiServlet\nline:49  InputStream in = getServletContext().getResourceAsStream(\"/admin.html\");\ncan't find admin/html because it's in the prefixPath directory\n\n\norg.apache.solr.cloud.ZkController\nline:149-150\nthis.nodeName = this.hostName + ':' + this.localHostPort + '_' + this.localHostContext;\n    this.baseURL = this.localHost + \":\" + this.localHostPort + \"/\" + this.localHostContext;\n\nit can't match this condition\nbaseURL need to be http://xx:xx/myApp/myPrefixPath \neg. http://xx:xx/myApp/xxx",
    "attachments": {
        "web.xml.chabot": "https://issues.apache.org/jira/secure/attachment/12584973/web.xml.chabot",
        "web.xml": "https://issues.apache.org/jira/secure/attachment/12580291/web.xml",
        "LoadAdminUiServlet_take2.patch": "https://issues.apache.org/jira/secure/attachment/12580299/LoadAdminUiServlet_take2.patch",
        "LoadAdminUiServlet.patch": "https://issues.apache.org/jira/secure/attachment/12579407/LoadAdminUiServlet.patch",
        "LoadAdminUiServlet.java.chabot": "https://issues.apache.org/jira/secure/attachment/12584972/LoadAdminUiServlet.java.chabot"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13455416",
            "date": "2012-09-13T23:11:17+0000",
            "content": "I agree we should try to fix these issues to make the various code paths respect the \"prefix-path\" in the web.xml, but since:\n\na) this affects a fairly small number of advanced users\nb) there is not yet any patch\n\n...i'm going to remove the 4.0 fixVersion so that this issue doesn't impeed momentum towards the (hopefully) rapidly approaching release. "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13635626",
            "date": "2013-04-18T20:16:46+0000",
            "content": "I attached a patch that seems to work for finding the admin.html inside the prefix.  Instead of explicitly using the admin.html path, it just takes whatever the servlet path in the request is and loads that.\n\nIt doesn't solve the entire problem loading the admin page, as there still seems to be a problem with the \"cores\" request not getting the prefix prepended, but it solves the explicit problem the description specifies.\n\nIs getting the admin console working with prefixes targeted for any release soon?\n\n(Also, forgive me if I didn't do this quite right-- it's my first attempt submitting a patch) "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13636225",
            "date": "2013-04-19T09:56:46+0000",
            "content": "Sam, the attached patch looks good to me - at least the UI is (still) working after applying the patch to solr's default-jetty-example.\n\nIt doesn't solve the entire problem loading the admin page, as there still seems to be a problem with the \"cores\" request not getting the prefix prepended, but it solves the explicit problem the description specifies.\n\nCould you be a bit more specific about that? the Servlet uses CoreContainer's getAdminPath() to get the correct path to /admin/cores .. which is, i guess, what you're talking about?  "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13636474",
            "date": "2013-04-19T15:15:55+0000",
            "content": "When I run things with my patch included, the admin page comes up instead of the 404, but the \"Loading...\" spinner stays up, and the browser debugger says it's getting a failure contacting <app>/admin/cores?wt=json&indexInfo=false (instead of <app>/<prefix>/admin/cores?wt=json&indexInfo=false like it should.)  Haven't tried to trace the source of that error yet. "
        },
        {
            "author": "Alin Simionoiu",
            "id": "comment-13639449",
            "date": "2013-04-23T19:23:08+0000",
            "content": "i believe the source of that error is in cores.js. i can't figure out how to fix it. admin.html defines a global var app_config and the URL's are built using app_config.solr_path + app_config.core_admin_path.\n\ninitially the solr_path is empty (don't know why yet). if i force the value to let's say \"solr\" which is my context, the cores request for some reason that i can't figure out is adding the value twice. /solr/solr/admin/cores... "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13640266",
            "date": "2013-04-24T09:09:56+0000",
            "content": "Sam, Alin .. perhaps it'd be good to compare underlying values to see if there is a common way to handle this for all situations.\n\nfor me (solr's example package with shipped jetty), i get these values placed in the initial page of the UI:\n\napp_config.solr_path = '\\/solr';\napp_config.core_admin_path = '\\/admin\\/cores';\n\n\nsolr_path is defined by HttpServletRequest.getContextPath() and core_admin_path by CoreContainer.getAdminPath()\n\nFrom Sam's Comment i'd say the latter seems to be correct, but the former is missing the prefix. I don't really know how the HttpServletRequest determines which is the right context .. !? "
        },
        {
            "author": "Alin Simionoiu",
            "id": "comment-13640484",
            "date": "2013-04-24T14:27:46+0000",
            "content": "here's my setup (and initial page values).\n\ni have solr inside a larger web application which starts in the root context (this part i believe is critical). in my web.xml i have my servlets and filters, and i copied more or less the solr web.xml context. \n\ni want solr to work from, let's say '/mysolr'. i'm changing the value here, not to be confused with the default '/solr'\nfor the SolrRequstFilter i setup: path-prefix = /mysolr and the url-pattern = /mysolr/*\n\nin the initial page of the UI, i have:\napp_config.solr_path = '';\napp_config.core_admin_path = '\\/admin\\/cores';\n\nLoadAdminUiServlet seems to set the app_config.solr_path to request.getContextPath(), and since my application works from root context it kind of makes sense for solr_path to be '' (maybe is '\\/' and it gets removed by the code later on). This will make all the calls inside the admin.html to go against, let's say /admin/cores (invalid URL for me) instead of expected /mysolr/admin/cores\n\nif i provide my own copy of LoadAdminUiServlet, which sets app_config.solr_path='\\/mysolr', than the admin.html calls will double that for some reasons, '/mysolr/mysolr/admin/cores' instead of '/mysolr/admin/cores', i can't figure this one out.\n\n(as a hack i'm also using a copy of SolrRequestFilter which removes the double prefix if found, and now admin.html kind of works. the only thing that i still have to figure out is the zookeeper part, that one still doesn't work, not sure why is going against /zookeeper instead of /mysolr/zookeeper).\n\ni'm just using '/admin/cores' as examples here, logging and all the other URL's have the same problem.\n\nDoes this makes more sense now?\n\n\n "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13640503",
            "date": "2013-04-24T14:46:11+0000",
            "content": "Based on Alin and Stefan's comment, I added the prefix to the contextPath and now everything seems to work.  The \"take2\" patch alone-- with no changes to any .js files-- seems to solve the problem.  (I now explicitly parse out the prefix before the \"/admin.html\" and add it to the context path as well as the initial get resource call.) "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13640509",
            "date": "2013-04-24T14:50:34+0000",
            "content": "For testing purposes, I'm including my web.xml file that I tested my patch with, which is a minimal modification of the one that comes with solr-4.2.1's example.  I use the \"/test\" prefix (instead of the suggested /solr prefix) to make it clearer where it's getting inserted.  As stated in the web.xml, all the css, img, js, tpl directories, plus admin.html, must be moved into a \"test\" directory under solr-webapp/webapp.\n\nNote that the changes to web.xml are NOT part of the suggested changes, just for testing the actual patch. "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13640520",
            "date": "2013-04-24T15:04:48+0000",
            "content": "Also, this bug's \"Component\" should probably be \"web gui\".  And can we rename this bug to something like \"Admin UI does not work when wiring Solr into a larger web application using a path prefix\".  And while I'm at it, target it for 4.3? "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13640597",
            "date": "2013-04-24T16:14:30+0000",
            "content": "Original posting of the \"take2\" patch contained incorrect path information on the files... fixed it. "
        },
        {
            "author": "Alin Simionoiu",
            "id": "comment-13640724",
            "date": "2013-04-24T17:55:57+0000",
            "content": "thank you very much Sam, this works perfect for me. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13640983",
            "date": "2013-04-24T21:31:26+0000",
            "content": "Since Servlet's can be mapped to multiple paths, i'm wondering if it would be cleaner and more straight forwarded just to add an optional \"path-prefix\" init-param to to LoadAdminUiServlet just like SolrDispatchFilter has, that people can configure in exactly the same way? "
        },
        {
            "author": "Alin Simionoiu",
            "id": "comment-13641157",
            "date": "2013-04-24T23:28:31+0000",
            "content": "not enough. as you can see from the sample web.xml you have to add that path all over the place, not just for LoadAdminUIServlet. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13641192",
            "date": "2013-04-24T23:46:12+0000",
            "content": "Alin: yes, if you want all those various servlets to work, then each needs to be configured with the path – i don't think anyone has questioned that.  the point is about how/where/when LoadAdminUiServlet knows about the path to use when dealing with the static resources.\n\nmy point is that instead of trying to \"guess\" where to find those resources based on the servlet path of the request, we should just make it an explicit configuration, the same way it's explicit in SolrDispatchFilter – that way people can use anything they want, even if they choose to bind LoadAdminUiServlet to multiple paths. "
        },
        {
            "author": "Sam Kass",
            "id": "comment-13641216",
            "date": "2013-04-25T00:19:09+0000",
            "content": "Hoss, that sounds like a reasonable feature request/improvement.  However, the web.xml file is already documented that the files are required to be in a sub-directory of the same name as the prefix, and this patch fixes the bug and makes the code work as already documented.  Personally, I think this fix should go in, and additional features/enhancements be requested separately. "
        },
        {
            "author": "Michael Chabot",
            "id": "comment-13667943",
            "date": "2013-05-27T20:42:11+0000",
            "content": "FWIW, I was able to resolve this by adding a variable in LoadAdminUiServlet that manually holds the value of whatever's configured as 'path-prefix' in web.xml. See attached:\n\n\tweb.xml\n\tLoadAdminUiServlet.java\n\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717467",
            "date": "2013-07-23T18:48:20+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971185",
            "date": "2014-04-16T12:57:24+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15388767",
            "date": "2016-07-22T02:27:44+0000",
            "content": "Safe to close? No longer relevant. "
        }
    ]
}