{
    "id": "SOLR-6199",
    "title": "SolrJ, using SolrInputDocument methods, requires entire document to be loaded into memory",
    "details": {
        "affect_versions": "4.7.3",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "clients - java"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "ManifoldCF has historically used Solr's extracting update handler for transmitting binary documents to Solr.  Recently, we've included Tika processing of binary documents, and wanted instead to send an (unlimited by ManifoldCF) character stream as a primary content field to Solr instead.  Unfortunately, it appears that the SolrInputDocument metaphor for receiving extracted content and metadata requires that all fields be completely converted to String objects.  This will cause ManifoldCF to certainly run out of memory at some point, when multiple ManifoldCF threads all try to convert large documents to in-memory strings at the same time.\n\nI looked into what would be needed to add streaming support to UpdateRequest and SolrInputDocument.  Basically, a legal option would be to set a field value that would be a Reader or a Reader[].  It would be straightforward to implement this, EXCEPT for the fact that SolrCloud apparently makes UpdateRequest copies, and copying a Reader isn't going to work unless there's a backing solid object somewhere.  Even then, I could have gotten this to work by using a temporary file for large streams, but there's no signal from SolrCloud when it is done with its copies of UpdateRequest, so there's no place to free any backing storage.\n\nIf anyone knows a good way to do non-extracting updates without loading entire documents into memory, please let me know.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Karl Wright",
            "id": "comment-14043162",
            "date": "2014-06-25T08:01:52+0000",
            "content": "The ManifoldCF ticket is CONNECTORS-981, FWIW. "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-14043248",
            "date": "2014-06-25T09:38:33+0000",
            "content": "Karl Wright FYI, you can link issues on JIRA over different projects "
        },
        {
            "author": "Karl Wright",
            "id": "comment-14043342",
            "date": "2014-06-25T11:23:43+0000",
            "content": "If you prefer a formal link... "
        },
        {
            "author": "Joseph Gresock",
            "id": "comment-14051509",
            "date": "2014-07-03T14:31:46+0000",
            "content": "We would also enjoy this feature, per this discussion: http://lucene.472066.n3.nabble.com/Streaming-large-updates-with-SolrJ-td4144527.html "
        },
        {
            "author": "Karl Wright",
            "id": "comment-14093930",
            "date": "2014-08-12T09:58:14+0000",
            "content": "While I've closed the CONNECTORS-981 ticket, we continue to hope for a solution to this one.  Many ManifoldCF users cannot use this Solr option and continue to use the extracting update handler instead because of the memory issue. "
        },
        {
            "author": "Karl Wright",
            "id": "comment-14093931",
            "date": "2014-08-12T10:00:35+0000",
            "content": "I am willing to develop a patch, but before I do, I need advice/encouragement from Mark Miller.  Otherwise, what I do is likely to be a waste of time. "
        }
    ]
}