{
    "id": "SOLR-3996",
    "title": "Solr 4.0.0: problems with character '/' in fields names",
    "details": {
        "affect_versions": "4.0",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "Good morning,\nwe have a document management system and we use solr for fulltext searches.\nOur documents have fields with the character '/' in their names - they come from xml documents and we use simple xpaths as fileds names.\nWe have noticed some problems in queries:\n\n1. the character '/' must be escaped also if it's not mentioned as a special character (http://lucene.apache.org/core/3_6_0/queryparsersyntax.html#Escaping%20Special%20Characters);\n\n2. that character must not be escaped if specified in sorting rules or in required fields list.\n\n3. in a fields list (parameter 'fl' in a query) a field with '/' in its name  must not be the first field if you don't want to get an error.\n\nI think there is a bug treating this character.\n\nThanks for your help.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Federico Grillini",
            "id": "comment-13484851",
            "date": "2012-10-26T10:55:23+0000",
            "content": "One note: with Solr 3.5 (Solr Specification Version: 3.5.0.2011.11.22.14.54.38 - Solr Implementation Version: 3.5.0 1204988) we didn't have these problems. "
        },
        {
            "author": "Jack Krupansky",
            "id": "comment-13485286",
            "date": "2012-10-26T23:39:48+0000",
            "content": "A couple of comments:\n\n1. Slash introduces a regex query term in 4.0.\n\n2. Escaping is not supported parameters such as \"qf\".\n\n3. Solr 4.0 supports \"pseudo fields\" in the \"fl\" parameter. The items in the list can be full function queries (and some other things, including \"glob\" names). This syntax presumes (to some degree) that field names follow the rules of java identifiers.\n\nSee:\nhttp://wiki.apache.org/solr/CommonQueryParameters#fl\nhttps://issues.apache.org/jira/browse/SOLR-2444\n\n4. Although the Solr schema technically does accept arbitray names, including white space and punctuation characters, users would be STRONGLY ADVISED to stick with Java identifiers. Strict Java-like feld names are not required in all circumstances, but as you note, there are some situations where the particular situation may either require escaping or simply prohibit field names which are not strict Java identifiers.\n\nIn short, Solr gives you a lot of rope to play with, but don't blame Solr if that rope is not universally accepted for everything everywhere - and for all time.\n\nThat said, feel free to propose specific enhancements for escaping, etc.\n "
        }
    ]
}