{
    "id": "SOLR-3414",
    "title": "web gui: Accordion vertical panes of Dashboard",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "Please allow the Dashboard to disappear one or both of the Instance and System panes. \n\nJust because I have a nice large screen does not mean I want to devote all of it to the UI",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13262542",
            "date": "2012-04-26T11:59:18+0000",
            "content": "Lance, what do like to have there? possibility to show/hide different sections? or is it more a common problem with a large browser-window (also relevant for other pages of the ui)? "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13263297",
            "date": "2012-04-27T01:48:33+0000",
            "content": "It's the large browser-window problem. I like to have a few small windows with Solr troubleshooting, a command line shell, sticky notes, etc. at once. \n\nFor a dashboard/monitoring app, a mobile design would be awesome  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13263301",
            "date": "2012-04-27T01:54:42+0000",
            "content": "I like the dashboard as is, and think it is a great place to put more information as we expose it.\n\nIf we want a mobile target design, that sounds great – but I think it should be a different view (and I'm not sure what it should show) "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13263359",
            "date": "2012-04-27T05:33:42+0000",
            "content": "I like the dashboard as is, and think it is a great place to put more information as we expose it.\n+1, it's pretty cool. A dashboard has been lacking from Solr. Something that monitors multiple shards would be amazing.\n\nWhich leads me to... please bring back the old one and purpose it as a drill-down low-level investigator's toolkit. After all, nobody puts a garbage collector monitor and a code debugger in the same program. \n\n "
        },
        {
            "author": "Stefan Matheis (steffkes)",
            "id": "comment-13276746",
            "date": "2012-05-16T14:02:31+0000",
            "content": "okay, so how should we proceed here? show more information? show less? make it configurable what should be shown? or just make it more 'flexible' on different screens?\n\nwhat you'd like to have here?  "
        },
        {
            "author": "Lance Norskog",
            "id": "comment-13279981",
            "date": "2012-05-21T06:22:50+0000",
            "content": "The most generic would be an accordion system that brings in more data. A really clean design would be a 'handle' on each side of the window that brings in one pane. This lets you have three panes, and you always see the pane in the middle. "
        }
    ]
}