{
    "id": "SOLR-10014",
    "title": "Log a warning when the number of fields in a core exceeds a configurable value",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "4.10.4",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "When the number of fields in an index gets extremely large, major performance problems can occur.  If the number of fields in a core exceeds a configurable number, with a default somewhere around 10000, a warning should be logged when the SolrCore is first created.  A decision needs to be made about whether to repeat the warning on core reload ... my instinct is that it should NOT be repeated, but I can see where a repeat might have some value.  Logging on reloads as well as startup would likely be easier.\n\nThis was discovered by a Solr user who had a 420MB index with 650K documents, but their applications were abusing dynamic fields to the point where they had about 2 million unique fields in the index.  The small size of the index should have resulted in extremely fast commit times, but commits were taking about 10 seconds because of what Lucene had to do to handle all those fields.",
    "attachments": {
        "SOLR-10014.patch": "https://issues.apache.org/jira/secure/attachment/12848628/SOLR-10014.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-01-20T20:58:42+0000",
            "content": "Patch with an idea for how to implement the warning.  I can see that the initIndex method has a \"firstTime\" boolean, but I don't think that method has  access to the objects needed to get the field count ... so for now I'm not attempting to suppress the warning on reload.  Also, the configuration option for solrconfig.xml hasn't been worked out yet, so the threshold isn't configurable yet.  I'm pretty sure that I'm using the searcher object incorrectly, but I'm not sure how to do it correctly. ",
            "author": "Shawn Heisey",
            "id": "comment-15832391"
        },
        {
            "date": "2017-01-20T21:17:58+0000",
            "content": "I think it makes sense to log the warning on reload. If you are using dynamic fields, as in your example, then we can expect the number of fields to change, right? So initially the warning would not print, and then we would never see it the second time if it's suppressed. ",
            "author": "Mike Drob",
            "id": "comment-15832411"
        }
    ]
}