{
    "id": "SOLR-8246",
    "title": "create_core command gives confusing messages if broken config is given, fixed, given again",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.4",
            "6.0"
        ],
        "affect_versions": "5.3.1",
        "status": "Closed",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "If the config used to create a core, the command complains and aborts:\n\nExample:\n\n$ bin/solr create_core -c minicore -d ../miniconf/\n\nCreating new core 'minicore' using command:\nhttp://localhost:8983/solr/admin/cores?action=CREATE&name=minicore&instanceDir=minicore\n\nERROR: Error CREATEing SolrCore 'minicore': Unable to create core [minicore] Caused by: The element type \"dynamicField\" must be terminated by the matching end-tag \"</dynamicField>\".\n\n\n\nHowever, after fixing the problem, trying to re-run the command gives the same error, causing all sorts of confusion.\n\nWhat actually happened is that config has been copied to the destination directory and then when the command is run the second time, it does not recopy fresh - and fixed - files, but just reuses the previously copied - broken - ones. \n\nThe workaround is to manually delete created destination directory and rerun the command. But it is far from obvious.\n\nThe fix would be either undoing the copy - a delete. The minimal fix would be a log statement that the directory was copied (which would help example logs too). And perhaps an extra message when the create command failed that files were copied and may need to be manually deleted.",
    "attachments": {
        "SOLR-8246.patch": "https://issues.apache.org/jira/secure/attachment/12771194/SOLR-8246.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-11-07T14:14:19+0000",
            "author": "Jason Gerlowski",
            "content": "I'll take a stab at fixing this, unless you've already started working on it Alex? ",
            "id": "comment-14995224"
        },
        {
            "date": "2015-11-07T15:51:37+0000",
            "author": "Alexandre Rafalovitch",
            "content": "I have not. Feel free to go ahead. ",
            "id": "comment-14995259"
        },
        {
            "date": "2015-11-07T18:23:06+0000",
            "author": "Jason Gerlowski",
            "content": "This patch changes SolrCLI.java to catch SolrServerException when trying (and failing) to create a core.  When the exception is caught, we delete the copy of the config (in configInstanceDir, and rethrow the error so it can be parsed and displayed elsewhere.\n\nI also massage one of the log messages to make it clear that the config is being copied, as Alex suggested. ",
            "id": "comment-14995342"
        },
        {
            "date": "2015-11-16T20:04:14+0000",
            "author": "Jason Gerlowski",
            "content": "Can someone please take a look at this patch when they get a few minutes?  If it's not wanted, or is too low priority to look at right now, that's fine with me too.  It is a pretty minor in the scheme of things.  I just wanted to make sure it doesn't get lost accidentally. ",
            "id": "comment-15007225"
        },
        {
            "date": "2015-11-16T20:08:30+0000",
            "author": "Shai Erera",
            "content": "Looks good. The only comment that I have is the addition of Throwables dependency. The method runImpl already throws Exception, so can we just catch SolrServerException and rethrow it? ",
            "id": "comment-15007234"
        },
        {
            "date": "2015-11-16T20:12:12+0000",
            "author": "Jason Gerlowski",
            "content": "Sure, Throwables doesn't add a ton.  I'll take it out. ",
            "id": "comment-15007239"
        },
        {
            "date": "2015-11-16T21:19:29+0000",
            "author": "Shai Erera",
            "content": "Since you haven't upload a new patch yet, Is there any reason not to catch Exception, instead of SolrServerException? Don't we want to delete the directory in any case? ",
            "id": "comment-15007345"
        },
        {
            "date": "2015-11-16T22:32:39+0000",
            "author": "Jason Gerlowski",
            "content": "Sure.\n\nI hadn't initially done that because I was trying to keep the effect of my change as small as possible.  But in hindsight it's probably safe to delete the copied config regardless.  (Recopying is cheap, and it never hurts to clean up after yourself.)  Will change. ",
            "id": "comment-15007501"
        },
        {
            "date": "2015-11-16T22:50:54+0000",
            "author": "Jason Gerlowski",
            "content": "Attached patch makes the changes Shai recommended in his two comments above. ",
            "id": "comment-15007554"
        },
        {
            "date": "2015-11-16T22:59:18+0000",
            "author": "Alexandre Rafalovitch",
            "content": "One common use case to keep in mind is people rerunning /bin/solr start -e examplename multiple times. We need to make sure that nothing weird happens in that case. ",
            "id": "comment-15007586"
        },
        {
            "date": "2015-11-17T03:46:09+0000",
            "author": "Jason Gerlowski",
            "content": "Just spent half an hour or so messing around with different interleavings of bin/solr start -e techproducts|cloud|etc, bin/solr stop -all, and mangling/fixing solr-config files.  I didn't find any edge cases that produced unexpected results.  Though if you had something in particular you wanted to try I'd definitely appreciate the double-check. ",
            "id": "comment-15007961"
        },
        {
            "date": "2015-11-17T11:56:53+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1714764 from Shai Erera in branch 'dev/trunk'\n[ https://svn.apache.org/r1714764 ]\n\nSOLR-8246: fix SolrCLI to delete config directory if creating a core failed ",
            "id": "comment-15008537"
        },
        {
            "date": "2015-11-17T11:58:08+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1714765 from Shai Erera in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1714765 ]\n\nSOLR-8246: fix SolrCLI to delete config directory if creating a core failed ",
            "id": "comment-15008543"
        },
        {
            "date": "2015-11-17T11:59:14+0000",
            "author": "Shai Erera",
            "content": "Committed to trunk and 5x. I also added a CHANGES entry. Thanks Jason Gerlowski! ",
            "id": "comment-15008544"
        }
    ]
}