{
    "id": "SOLR-8774",
    "title": "Store the latest available version of a blob so that some components can access it w/o version",
    "details": {
        "components": [],
        "type": "Sub-task",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "All blob store access requires the blob name and version. If we store the version and update that doc all the time it will be able to fetch the latest version using realtime get",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-05-17T13:32:19+0000",
            "author": "Jason Gerlowski",
            "content": "Af first glance, this seems like a feature that would go along way towards improving the Blob store's \"plugin/jar management\" use case, which would be great for my team.  Just wanted to ask a few clarifying questions to make sure I understand what the JIRA is really proposing though:\n\nIs the goal of this story to allow plugins to be configured without an explicit version number (as below), and that those plugins would just fetch the most recent version upon being loaded?\n\n\n  <requestHandler name=\"/hello\" class=\"SomeEntryPoint\" runtimeLib=\"true\">\n  </requestHandler>\n\n\n\nWould this JIRA involve reloading any already-loaded runtime-libs when a new jar/blob version is added?  Or is it only about determining the latest version for plugins being loaded for the first time? ",
            "id": "comment-15286621"
        },
        {
            "date": "2016-05-17T17:17:21+0000",
            "author": "Noble Paul",
            "content": "The configuration of plugins does not need the version number. the <runtimeLib /> tag requires the version number\n\nBut yes, that is the plan. You should be able to just specify the blob name w/o the version number and it would load the latest blob.   ",
            "id": "comment-15287036"
        }
    ]
}