{
    "id": "SOLR-9186",
    "title": "Logistic regression modeling for text",
    "details": {
        "components": [],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Closed",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "SOLR-8492 optimizes a logistic regression model for numeric fields. While this is interesting, I think it would be more interesting to build logistic regression models on text within an inverted index.\n\nThis ticket will use the same parallel iterative framework as SOLR-8492, but different data access patterns on the shards, to optimize a logistic regression model on text.\n\nThis will support use cases such as building models for spam detection, sentiment analysis and threat detection.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-06-07T22:45:18+0000",
            "author": "Cao Manh Dat",
            "content": "It would be interesting idea. I just have some questions:\n\n\tDo we classify based on one or many fields?\n\tTo represent doc -> vector, should we use tf-idf or just tf? So the field must have termvector stored?\n\n ",
            "id": "comment-15319613"
        },
        {
            "date": "2016-06-08T00:16:45+0000",
            "author": "Joel Bernstein",
            "content": "I think to start we would use one field. \n\nI was thinking tf. But tf-idf is an interesting thought, I suspect it would be better.\n\nI'm using tf-idf for SOLR-9193, which I think will be really nice.  ",
            "id": "comment-15319758"
        },
        {
            "date": "2016-06-08T01:58:31+0000",
            "author": "Cao Manh Dat",
            "content": "That would be fine assumption.\n\nAre you working on this ticket? I would like to submit a patch in couple days. ",
            "id": "comment-15319855"
        },
        {
            "date": "2016-06-08T13:31:37+0000",
            "author": "Joel Bernstein",
            "content": "I'm focusing on SOLR-9193 first. So feel free to submit a patch. Let me know if you'd like to discuss the design before you start. ",
            "id": "comment-15320544"
        }
    ]
}