{
    "id": "SOLR-5207",
    "title": "Admin UI - Zookeeper status graph",
    "details": {
        "affect_versions": "4.4",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Admin UI",
            "SolrCloud"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "SOLR-5169 puts forth the idea of having an API to show zookeeper status.  This issue aims to use that information to draw a graph for zookeeper similar to what we have for SolrCloud nodes.  Attached is an extremely rough image of what I'm shooting for.  It probably needs to have a black outline around one of the nodes to indicate the leader, just like the existing cloud graph does.",
    "attachments": {
        "zk-graph.png": "https://issues.apache.org/jira/secure/attachment/12601000/zk-graph.png"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13755775",
            "date": "2013-09-01T18:20:20+0000",
            "content": "It may be found that this exact graph design isn't workable, due to limitations on the d3js library, or limitations on the zookeeper client in Solr.  I haven't looked deep enough yet to know what the capabilities are. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13755776",
            "date": "2013-09-01T18:24:12+0000",
            "content": "For the attached image, color of the circle on the left side indicates the quorum status from Solr's point of view.  Color of the circle on the right side indicates quorum status from the view of the zookeeper ensemble.  Color of each circle in the middle indicates the status of each node.  Blue represents that the node is up and operational, but that Solr isn't connected to it.  I don't know whether all this information will be available using the zookeeper client. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971115",
            "date": "2014-04-16T12:57:12+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}