{
    "id": "SOLR-12801",
    "title": "Fix the tests, remove BadApples and AwaitsFix annotations, improve env for test development.",
    "details": {
        "type": "Task",
        "status": "Open",
        "labels": "",
        "fix_versions": [],
        "components": [],
        "priority": "Critical",
        "resolution": "Unresolved",
        "affect_versions": "None"
    },
    "description": "A single issue to counteract the single issue adding tons of annotations, the continued addition of new flakey tests, and the continued addition of flakiness to existing tests.\n\nLots more to come.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "id": "comment-16626075",
            "content": "The tests are getting less and less useful all the time. Devs break things and just assume any tests that might now randomly fail have nothing to do with them.  You can only meaningful run tests with BadApples off, which means test coverage is minimal and shrinking and new problems are being added, the tests are slow and often inefficient and lazily implemented.\n\nIt's time to change the tide. ",
            "author": "Mark Miller",
            "date": "2018-09-24T16:10:49+0000"
        },
        {
            "id": "comment-16628680",
            "content": "Hey Mark,\n\n100% agreed the tests are a problem.  But can you clarify what you're opening this issue for.  Just asking as someone interested in the problem.\n\nAre you proposing a new approach to solving the test flakiness?  Is this a Jira mainly intended to stoke more discussion on things, or as a place to brainstorm. Or is this an umbrella Jira to track all the smaller things you think are contributing to the larger problem?  Or something else altogether? ",
            "author": "Jason Gerlowski",
            "date": "2018-09-26T12:31:38+0000"
        },
        {
            "id": "comment-16628943",
            "content": "You can only meaningful run tests with BadApples off, which means test coverage is minimal and shrinking and new problems are being added,\nNot exactly true. BadApple=true is the default, you have to deliberately disable those tests. Of course if you do in your environment, then the above is totally true.\n\nWhat is also totally true is that the noise is such that I can break something and never see it because I haven't waded through each and every failure in BadApple'd tests to see if I introduced a legitimate failure in one of them.\n\nI would be thrilled if all the BadApple nonsense were no longer useful. As it is, what it's mainly recording is whether we're annotating more than we un-annotate as well as whether tests come and go over longer time frames. There are tests that fail for 4 weeks in a row, then succeed for 5 weeks, then fail for 6 weeks etc. That's the purpose of leaving the comments in when tests were annotated/unannotated.\n\nThe BadApple thrashing is not doing much of anything towards actually fixing the issues. About all it's doing is making the extent of the problem more visible if anyone bothers to read the weekly e-mails.\n\nI guess the net-net here is that I don't like the BadApple process much and would be glad to stop dealing with it altogether if we define a better process.\n\nSounds like a hot topic at Activate  ",
            "author": "Erick Erickson",
            "date": "2018-09-26T15:30:18+0000"
        },
        {
            "id": "comment-16660310",
            "content": "This is an umbrella issue to track a variety of things I'll be pushing.\n\n\n\tImprove system mock-ability.\n\tAdd useful out of the box mocks.\n\tSeparate unit and integrations tests logically in the src structure.\n\tAdd doc for writing good tests, using mocks, unit vs integration, beasting, etc.\n\tFix the current tests.\n\tGenerate a very regular automated beast report.\n\tetc\n\n ",
            "author": "Mark Miller",
            "date": "2018-10-23T09:03:58+0000"
        },
        {
            "id": "comment-16660312",
            "content": "My first patch includes the first 3 sub issues I've linked. It's a little more work than it's worth to break them up at this point. While working on those items, I've also done the work needed to 'usually'  get a passing ant test to work on my two primary machines without using badapples=false. That is a big improvement for me because for months I've not been able to get ant test by itself to pass. ",
            "author": "Mark Miller",
            "date": "2018-10-23T09:07:09+0000"
        },
        {
            "id": "comment-16660315",
            "content": "BadApple=true is the default, you have to deliberately disable those tests. \n\nBecause badapples=true is almost impossible to get a clean test run with, I can't imagine any dev using that recently with any success, making it a terrible default. I'm going to side step that issue by getting ant test able to pass sometimes again though. ",
            "author": "Mark Miller",
            "date": "2018-10-23T09:08:57+0000"
        },
        {
            "id": "comment-16661463",
            "content": "I'm going to start addressing tests by package (search package is first). Once I have some more tools and info and code to share, hopefully some others can join. Regardless, I may be trying to call people in for specific tests.\n\nThere is a good chance beasting test reports will be back eventually and more useful than ever as well.\n\nI'll post my first patch (mainly focused on making the Overseer queue mockable) very soon. ",
            "author": "Mark Miller",
            "date": "2018-10-23T23:29:36+0000"
        },
        {
            "id": "comment-16661473",
            "content": "I'm going to start addressing tests by package (search package is first).\nI think today a lot of tests get lumped in the search package or cloud package when it perfectly deserves it's own package. We could address that in a separate Jira as well ( SOLR-12793 is one such example ) ",
            "author": "Varun Thacker",
            "date": "2018-10-23T23:37:44+0000"
        },
        {
            "id": "comment-16661480",
            "content": "I want to start having a place for unit tests and integration tests - maybe we can work on both at once? ",
            "author": "Mark Miller",
            "date": "2018-10-23T23:46:31+0000"
        },
        {
            "id": "comment-16662860",
            "content": "I want to start having a place for unit tests and integration tests - maybe we can work on both at once?\nI didn't quite follow this. Is there anything particular that you wanted me to look into while i'm working on SOLR-12793  . Happy to help move some tests to their own packages if that would help here ",
            "author": "Varun Thacker",
            "date": "2018-10-24T21:20:12+0000"
        },
        {
            "id": "comment-16663047",
            "content": "We currently have a complete mix of integration and unit tests. People add one or the other based on ease, usually just integration tests for a lot of stuff, maybe a test is even a hybrid of both.\n\nI think it would help a lot to separate out unit tests and integration tests - you should be able to run them separately and they should live in different paths.\n\nWe should encourage developers to write both for new work, and push back for reasons when one or the other is left out.\n\nPart of making that a full reality will mean making it much easier to write unit tests, but we could start organizing. ",
            "author": "Mark Miller",
            "date": "2018-10-25T00:30:32+0000"
        },
        {
            "id": "comment-16664080",
            "content": "I've been interested in making tests easier to maintain and write – SOLR-11872 (managed SolrClient instead of TestHarness stuff)  I suppose it doesn't fit within the scope of this issue though.  One relationship however is the idea that you could run tests globally but indicate you only want to run tests that, say, can work for standalone (not SolrCloud) and/or which can use just one shard.  Many tests could be either-or – the test doesn't fundamentally care either way.  With some adjustments in that issue, they could be written that way.  I did this for a specific client but it could have been upstreamed to Solr.\n\nAnother FYI that I think is hugely important to test maintenance is SOLR-10229 concerning preventing proliferation of one-off test files.  The \"how\" is debatable but the goal is important. ",
            "author": "David Smiley",
            "date": "2018-10-25T17:50:40+0000"
        },
        {
            "id": "comment-16664300",
            "content": "I suppose it doesn't fit within the scope of this issue though.\n\nI think it's very much in scope! TestHarness would be great to lose IMO.\n\nAlso in scope is finishing moving cloud tests off the old inheritance pattern and using MiniSolrCloudCluster. ",
            "author": "Mark Miller",
            "date": "2018-10-25T21:19:06+0000"
        },
        {
            "id": "comment-16664333",
            "content": "David Smiley - I've linked both those issues.\n\nThey are probably outside the scope of what I'd focus on in my flurry of issues, because I'm going to own getting to a finish line so to speak and that is a deep well, but that is part of why I need a lot of help - there is a lot we have done and need to continue to do in terms of simplifying test development.\n\nI'm focusing more directly on the test failure rate issue here, but everything is really directly influencing that.\n\nMy plan is to kind of be the super nova in the center of addressing the flaky tests, but I'll burn out long before I address everything we would like to be in a really ideal test land situation. What everyone else has been doing around tests and is currently doing is still going to be hugely important. ",
            "author": "Mark Miller",
            "date": "2018-10-25T22:01:02+0000"
        },
        {
            "id": "comment-16666191",
            "content": "Once I get my patch in for SOLR-12804, I'll fix or help fix any test someone posts in SOLR-12932 after seeing it fail locally. ",
            "author": "Mark Miller",
            "date": "2018-10-27T18:57:54+0000"
        },
        {
            "id": "comment-16667769",
            "content": "Wow. The tests were in very rough shape. We have to execute on a plan of test defense. Things had gotten so bad that newer tests were getting even worse because obviously no one minds if ant test fails because of any change because ant test will fail practically 100% of 100 runs anyway.\n\nThis is heading towards non reversible.\n\nI just spent all weekend doing what I could for ant test sanity. I'll share later today. ",
            "author": "Mark Miller",
            "date": "2018-10-29T21:11:04+0000"
        },
        {
            "id": "comment-16668780",
            "content": "Still coming.\n\nFYI, I'm turning off most tlog replica testing until SOLR-12313 is fixed. ",
            "author": "Mark Miller",
            "date": "2018-10-30T14:24:39+0000"
        },
        {
            "id": "comment-16669299",
            "content": "Okay, here is my current work: https://github.com/apache/lucene-solr/pull/486\n\nPlease check it out and try 'ant clean test' in the solr directory. Report your fails in SOLR-12932.\n\nI'll work on those fails. If you want to help, you could do the same. ",
            "author": "Mark Miller",
            "date": "2018-10-30T20:39:14+0000"
        },
        {
            "id": "comment-16669532",
            "content": "I get a compilation error: \n\n\ncompile-core:\n [mkdir] Created dir: /Users/Erick/apache/solrJiras/master/solr/build/solr-test-framework/classes/java\n [javac] Compiling 53 source files to /Users/Erick/apache/solrJiras/master/solr/build/solr-test-framework/classes/java\n [javac] /Users/Erick/apache/solrJiras/master/solr/test-framework/src/java/org/apache/solr/cloud/AbstractFullDistribZkTestBase.java:398: error: variable numOtherReplicas is already defined in method createJettys(int)\n [javac] int numOtherReplicas = numJettys - getPullReplicaCount() * sliceCount;\n [javac] ^\n [javac] Note: /Users/Erick/apache/solrJiras/master/solr/test-framework/src/java/org/apache/solr/SolrTestCaseJ4.java uses or overrides a deprecated API.\n [javac] Note: Recompile with -Xlint:deprecation for details.\n [javac] Note: Some input files use unchecked or unsafe operations.\n [javac] Note: Recompile with -Xlint:unchecked for details.\n [javac] 1 error\n\nTrivially fixable, I'm mostly wondering if there's something in your pull request that got messed up.... Or if I didn't apply it correctly. I fetched it to a patch file and applied the patch FWIW.\n\nRunning tests now. ",
            "author": "Erick Erickson",
            "date": "2018-10-31T02:57:19+0000"
        },
        {
            "id": "comment-16670011",
            "content": "https://patch-diff.githubusercontent.com/raw/apache/lucene-solr/pull/486.patch didn't apply cleanly on a fresh checkout last night, had a bunch of hunks not applied (intellij's VCS > Apply Patch...).\n\n \n\nEdit: Issue was that I didn't notice the patch was against branch_7x ... applied without conflicts there. ",
            "author": "Gus Heck",
            "date": "2018-10-31T12:18:19+0000"
        },
        {
            "id": "comment-16673744",
            "content": "\n  [junit4] Tests with failures [seed: 9F83A474D27F5826]:\n  [junit4]   - org.apache.solr.cloud.ZkSolrClientTest.testMakeRootNode\n  [junit4]   - org.apache.solr.cloud.ZkSolrClientTest (suite) ",
            "author": "Anshum Gupta",
            "date": "2018-11-02T22:12:14+0000"
        },
        {
            "id": "comment-16674359",
            "content": "I'm finally ready to commit my first pull request for branch 7x. I have to get something working for 8x now. Going to be a sludge crawl to cherry pick I bet. ",
            "author": "Mark Miller",
            "date": "2018-11-04T10:03:16+0000"
        },
        {
            "id": "comment-16674360",
            "content": "To answer a bit of the above:\n\nSometimes you may have to reset the branch to the origin due to a force push. I'd also do an ant clean top level between runs.\n\nIt's easiest to just check the whole branch out of github vs applying a patch.\n\nAnyway, I'm pretty much wrapped up like I said. More work in future pull requests. ",
            "author": "Mark Miller",
            "date": "2018-11-04T10:07:14+0000"
        },
        {
            "id": "comment-16703607",
            "content": "Commit 75b183196798232aa6f2dcaaaab117f309119053 in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=75b1831 ]\n\nSOLR-12801: Make massive improvements to the tests.\n\nSOLR-12804: Remove static modifier from Overseer queue access.\n\nSOLR-12896: Introduce more checks for shutdown and closed to improve clean close and shutdown. (Partial)\n\nSOLR-12897: Introduce AlreadyClosedException to clean up silly close / shutdown logging. (Partial)\n\nSOLR-12898: Replace cluster state polling with ZkStateReader#waitFor. (Partial)\n\nSOLR-12923: The new AutoScaling tests are way too flaky and need special attention. (Partial)\n\nSOLR-12932: ant test (without badapples=false) should pass easily for developers. (Partial)\n\nSOLR-12933: Fix SolrCloud distributed commit. ",
            "author": "ASF subversion and git services",
            "date": "2018-11-29T18:19:13+0000"
        },
        {
            "id": "comment-16705099",
            "content": "Commit eb652b84edf441d8369f5188cdd5e3ae2b151434 in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=eb652b8 ]\n\nSOLR-12801: Make massive improvements to the tests.\n\nSOLR-12804: Remove static modifier from Overseer queue access.\n\nSOLR-12896: Introduce more checks for shutdown and closed to improve clean close and shutdown. (Partial)\n\nSOLR-12897: Introduce AlreadyClosedException to clean up silly close / shutdown logging. (Partial)\n\nSOLR-12898: Replace cluster state polling with ZkStateReader#waitFor. (Partial)\n\nSOLR-12923: The new AutoScaling tests are way too flaky and need special attention. (Partial)\n\nSOLR-12932: ant test (without badapples=false) should pass easily for developers. (Partial)\n\nSOLR-12933: Fix SolrCloud distributed commit. ",
            "author": "ASF subversion and git services",
            "date": "2018-11-30T18:10:36+0000"
        },
        {
            "id": "comment-16705669",
            "content": "Commit a3ec5b5fdfa59197fb8a36a29cc158b69835afd8 in lucene-solr's branch refs/heads/master from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a3ec5b5 ]\n\nSOLR-12801: Wait for executor to finish shutdown. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T06:32:02+0000"
        },
        {
            "id": "comment-16705670",
            "content": "Commit 7f88bfa11234a2ad4c688d131c94db574dc6e516 in lucene-solr's branch refs/heads/master from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7f88bfa ]\n\nSOLR-12801: Wait for collections properly. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T06:32:03+0000"
        },
        {
            "id": "comment-16705674",
            "content": "Commit 79d7efe811a4e9e672d1a55e8b30683a927c1f4d in lucene-solr's branch refs/heads/branch_7x from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=79d7efe ]\n\nSOLR-12801: Wait for executor to finish shutdown. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T06:34:57+0000"
        },
        {
            "id": "comment-16705675",
            "content": "Commit 0e6b29c3e19fd86d7fa4cef805c1e797935cc46a in lucene-solr's branch refs/heads/branch_7x from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=0e6b29c ]\n\nSOLR-12801: Wait for collections properly. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T06:34:58+0000"
        },
        {
            "id": "comment-16705679",
            "content": "Commit 9b0b9032e2571b3a37aef93d823161b1b934381e in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9b0b903 ]\n\nSOLR-12801: Fix thread leak in test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T06:53:21+0000"
        },
        {
            "id": "comment-16705680",
            "content": "Commit 3f8b3b20a22f95f2824f585c6742a248e85bc5f7 in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=3f8b3b2 ]\n\nSOLR-12801: Fix thread leak in test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T06:53:33+0000"
        },
        {
            "id": "comment-16705836",
            "content": "Commit 755044b58f984ecadca3096a3572ee261cd96cdf in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=755044b ]\n\nSOLR-12801: Wait for collection creation in test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T14:09:12+0000"
        },
        {
            "id": "comment-16705837",
            "content": "Commit 2454f6c2b54ee55468f5340f13dda4f638f20669 in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2454f6c ]\n\nSOLR-12801: Wait for collection creation in test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T14:09:21+0000"
        },
        {
            "id": "comment-16705861",
            "content": "Commit cbe9f82202c481a98d0f455758e6741f6c13ddcc in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cbe9f82 ]\n\nSOLR-12801: Don't possibly block forever in this test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T14:58:18+0000"
        },
        {
            "id": "comment-16705862",
            "content": "Commit aeae27ee0895bebf98083ba813554fa0e02ee967 in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=aeae27e ]\n\nSOLR-12801: Don't possibly block forever in this test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T14:58:52+0000"
        },
        {
            "id": "comment-16705923",
            "content": "Commit a3ec5b5fdfa59197fb8a36a29cc158b69835afd8 in lucene-solr's branch refs/heads/jira/http2 from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a3ec5b5 ]\n\nSOLR-12801: Wait for executor to finish shutdown. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T17:09:55+0000"
        },
        {
            "id": "comment-16705924",
            "content": "Commit 7f88bfa11234a2ad4c688d131c94db574dc6e516 in lucene-solr's branch refs/heads/jira/http2 from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7f88bfa ]\n\nSOLR-12801: Wait for collections properly. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T17:09:56+0000"
        },
        {
            "id": "comment-16705926",
            "content": "Commit 9b0b9032e2571b3a37aef93d823161b1b934381e in lucene-solr's branch refs/heads/jira/http2 from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=9b0b903 ]\n\nSOLR-12801: Fix thread leak in test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T17:09:59+0000"
        },
        {
            "id": "comment-16705927",
            "content": "Commit 755044b58f984ecadca3096a3572ee261cd96cdf in lucene-solr's branch refs/heads/jira/http2 from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=755044b ]\n\nSOLR-12801: Wait for collection creation in test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T17:10:01+0000"
        },
        {
            "id": "comment-16705928",
            "content": "Commit cbe9f82202c481a98d0f455758e6741f6c13ddcc in lucene-solr's branch refs/heads/jira/http2 from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cbe9f82 ]\n\nSOLR-12801: Don't possibly block forever in this test. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T17:10:03+0000"
        },
        {
            "id": "comment-16705954",
            "content": "Commit b5a9cca1685108655cda111c798fd99cbbc1f5d0 in lucene-solr's branch refs/heads/master from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b5a9cca ]\n\nSOLR-12801: Raise THREAD_POOL_MAX_IDLE_TIME_MS. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T18:42:56+0000"
        },
        {
            "id": "comment-16705955",
            "content": "Commit ec4aca435e35ecb15e9346088319f70c7a620a8e in lucene-solr's branch refs/heads/branch_7x from Mark Miller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ec4aca4 ]\n\nSOLR-12801: Raise THREAD_POOL_MAX_IDLE_TIME_MS. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T18:43:50+0000"
        },
        {
            "id": "comment-16705959",
            "content": "Commit b294d8460f85d53bfe5ed57a7aa44911ab851aa2 in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b294d84 ]\n\nSOLR-12801: Don't possibly block forever in this test in another spot. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T18:55:14+0000"
        },
        {
            "id": "comment-16705960",
            "content": "Commit 7e8e97b4d83006131cc27bc8ded2f8c5ae32a148 in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7e8e97b ]\n\nSOLR-12801: Don't possibly block forever in this test in another spot. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T18:55:21+0000"
        },
        {
            "id": "comment-16705962",
            "content": "Commit e5281ef3d5e36f5ad8a871818dd511fb9fbee74f in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e5281ef ]\n\nSOLR-12801: Don't possibly block forever in this test in remaining spots. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T19:03:05+0000"
        },
        {
            "id": "comment-16705963",
            "content": "Commit 76f20bfe1a30919ef4ce28a7d56bee82844a4c4f in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=76f20bf ]\n\nSOLR-12801: Don't possibly block forever in this test in remaining spots. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-01T19:03:12+0000"
        },
        {
            "id": "comment-16706446",
            "content": "Mark Miller, based on the changes you made to TimeRoutedAliasUpdateProcessorTest I believe you have broken the intended functionality with https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a3ec5b5 \n\nThe specific intention in that test is that we are verifying that the request does not wait for the executor to finish before returning. Where you changed the collection count from 3 to 4 the test was explicitly testing that a new collection was not yet visible. The test expects that it won't be visible until after we wait for it to appear, which generally safe since collection creation typically takes 1-2 seconds, and the listing of aliases is typically very fast.\n\nAlso your change creates a serious bug wherein pre-emptive collection creation will always be triggered for every doc potentially preemptively creating an indefinite number of collections, this bug masked the fact you changed later tests to higher than expected numbers and should have failed.\n\nI'm going to revert that commit to restore correct functionality, and add additional assertions that need to pass.\n\nIf this test/technique seems to be a source of instability (the assumptions about timing could be bad under high load), then we'll need to find a solution that also passes the additional assertions ",
            "author": "Gus Heck",
            "date": "2018-12-02T19:38:36+0000"
        },
        {
            "id": "comment-16706484",
            "content": "Commit cf4d7494101f48cc77a0b4fa182c789101854f6a in lucene-solr's branch refs/heads/master from Gus Heck\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=cf4d749 ]\n\nSOLR-12801 Revert breaking commit a3ec5b5fdf and improve test\nto be more complete. Also, add comments to make it easier for\nothers to understand TimeRoutedAliasUpdateProcessorTest ",
            "author": "ASF subversion and git services",
            "date": "2018-12-02T21:37:19+0000"
        },
        {
            "id": "comment-16706485",
            "content": "Commit b6b9f9554e6a30d92afd2b277554e1d1f81ede5d in lucene-solr's branch refs/heads/master from Gus Heck\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=b6b9f95 ]\n\nSOLR-12801 fix cut/paste oops in comment ",
            "author": "ASF subversion and git services",
            "date": "2018-12-02T21:42:23+0000"
        },
        {
            "id": "comment-16706671",
            "content": "Linking the issue I discovered WRT the retry logic when jetty ports clash. ",
            "author": "Gus Heck",
            "date": "2018-12-03T05:26:19+0000"
        },
        {
            "id": "comment-16707322",
            "content": "\n\nIf this test/technique seems to be a source of instability (the assumptions about timing could be bad under high load), then we'll need to find a solution that also passes the additional assertions\n\n\nYes, this feature is a problem, you cannot create executors and then not shut them down and wait for them, its a leak. I'll AwaitsFix that test. ",
            "author": "Mark Miller",
            "date": "2018-12-03T15:03:24+0000"
        },
        {
            "id": "comment-16707334",
            "content": "Commit 1408f5255fbcde6e843845375349a694f783d247 in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=1408f52 ]\n\nSOLR-12801: Disable TimeRoutedAliasUpdateProcessorTest because the feature leaks threads. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-03T15:07:35+0000"
        },
        {
            "id": "comment-16707335",
            "content": "Commit a55b9959cddf8d393ce1a8e54b31fde759b80c8c in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a55b995 ]\n\nSOLR-12801: Disable TimeRoutedAliasUpdateProcessorTest because the feature leaks threads. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-03T15:07:44+0000"
        },
        {
            "id": "comment-16707469",
            "content": "\nYes, this feature is a problem, you cannot create executors and then not shut them down and wait for them, its a leak. I'll AwaitsFix that test. (emphasis added)\n\nIf the functionality itself (not just the test) has a bug w/thread leaks, then that certainly seems like it should be it's own issue for tracking/fixing purposes ... and the AwaitsFix should cite that new jira number. ",
            "author": "Hoss Man",
            "date": "2018-12-03T16:24:09+0000"
        },
        {
            "id": "comment-16707504",
            "content": "FWIW the test passed 90 of 90 beasting 3 rounds by 30, and never showed up on over a dozen subsequent full core runs and a couple top level runs. The 2 sec wait at the end of the test, while ugly does seem to work. The feature does not leak threads any time other than if a test shuts down too quickly. The threads are shutdown, just not awaited. ",
            "author": "Gus Heck",
            "date": "2018-12-03T16:43:52+0000"
        },
        {
            "id": "comment-16707528",
            "content": "I believe such an await can be achieved with a close hook, at which point we can hold onto the executor and save some tiny amount of GC & processing too. David Smiley had convinced me that such a close hook was just added complexity (hence the large comment in the code clarifying the decision on that point).  Will you be satisfied if a close hook is added to ensure the test can't end without closing the executor?\n\nCode with Comment for reference:\n\nhttps://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;a=blob;f=solr/core/src/java/org/apache/solr/update/processor/TimeRoutedAliasUpdateProcessor.java;h=cc1ddb893b9e5dad5e0c3a22613248ef9e67dc96;hb=cf4d749#l244 ",
            "author": "Gus Heck",
            "date": "2018-12-03T17:03:50+0000"
        },
        {
            "id": "comment-16707998",
            "content": "Commit e14432efd8dda81c86cba557255652cfaa377a28 in lucene-solr's branch refs/heads/master from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=e14432e ]\n\nSOLR-12801: Wait for thread on close and add AwaitsFix annotation - most of these sim tests can fail to elect shard leaders. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-04T00:02:33+0000"
        },
        {
            "id": "comment-16707999",
            "content": "Commit 7ff6c68744ea058e290ebdd982d533da4fb49c94 in lucene-solr's branch refs/heads/branch_7x from markrmiller\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=7ff6c68 ]\n\nSOLR-12801: Wait for thread on close and add AwaitsFix annotation - most of these sim tests can fail to elect shard leaders. ",
            "author": "ASF subversion and git services",
            "date": "2018-12-04T00:02:44+0000"
        }
    ]
}