{
    "id": "SOLR-3127",
    "title": "Dismax to honor the KeywordTokenizerFactory when querying with multi word strings",
    "details": {
        "affect_versions": "3.5",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "query parsers"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "When using the KeywordTokenizerFactory with a multi word search string, the dismax query created is not very useful. Although the query analzyer doesn't tokenize the search input, each word of the input is include in the search.\n\ne.g. if searching for 'chicken stock' the dismax query created would be:\n+(DisjunctionMaxQuery((ingredient_synonyms:chicken^0.6)~0.01) DisjunctionMaxQuery((ingredient_synonyms:stock^0.6)~0.01)) DisjunctionMaxQuery((ingredient_synonyms:chicken stock^0.6)~0.01)\n\nNote that although the query analyzer does not tokenize the term 'chicken stock' into 'chicken' and 'stock', they are still included and required in the search term.\nI think the query created should be just:\nDisjunctionMaxQuery((ingredient_synonyms:chicken stock)~0.01)\n(or at least not have the individual terms as should match, not must match so you could configure with MM.\n\nExample field type:\n<fieldType name=\"keyword_test\" class=\"solr.TextField\" positionIncrementGap=\"100\" autoGeneratePhraseQueries=\"false\">\n\t<analyzer type=\"index\">\n\t\t<tokenizer class=\"solr.KeywordTokenizerFactory\" />\n\t</analyzer>\n\t<analyzer type=\"query\">\n\t\t<tokenizer class=\"solr.KeywordTokenizerFactory\" />\n\t</analyzer>\n</fieldType>",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13235940",
            "date": "2012-03-22T19:39:55+0000",
            "content": "whitespace is a significant meta character to dismax (and for that matter, the main lucene QUeryParser as well) ... it indicates the seperation betwen optional clauses.\n\nthe query parsing structure is independent of the analyzer used, so the fact that a  KeywordTokenizerFactory is used on the field in question is irrelevant, you might have another qf that doens't have KeywordTokenizerFactory so even if dismax tried to guess that it should treat the entire nput as all one string, it couldn't do that for other fields.\n\nif you wnat your entire input to be treated as a literal, without treating whitespace as a meta-character, it needs to be quoted, or consider using an alternative parser (ie: the \"field\" QParser is designed for this type of \"i want to query a single field for a specific value\" type situation. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13235942",
            "date": "2012-03-22T19:41:36+0000",
            "content": "resolving since the issue here just seems to be a missunderstanding of how dismax works.\n\nif you have questions about this, please start a thread on solr-user.  if you have specific suggestions for how to change dismax to work better in situations like yours (w/o breaking existing usecases obviously) or suggestions on improving the documentation then by all means: please open a new issue with your suggestions "
        }
    ]
}