{
    "id": "SOLR-1428",
    "title": "make ValueSourceParser and QParserPlugin implement SolrInfoMBean so people can use registry.jsp to see which ones are loaded",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "there are a lot of default QParserPlugins and ValueSourceParsers loaded by default in solr – but there is no clear way to see which ones are loaded.  if we made the abstract base classes implement SolrInfoMBean (with sane defaults for all the methods, or at the very least have them return strings like \"INFO NOT AVAILABLE\") then people could use the infoRegistry to see what's available – both by default, and when they load their own.",
    "attachments": {
        "SOLR-1428.patch": "https://issues.apache.org/jira/secure/attachment/12457203/SOLR-1428.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12921156",
            "date": "2010-10-14T22:51:34+0000",
            "content": "I thought this would be really easy to bang in the airport last week, and this patch is the initial stub of my attempt: it just adds the neccessary interface declarations and stub methods in the two parent classes – before resolving all of the actual classes should be updated with real names, descriptions, etc...)\n\nbut even with this patch i encountered a few problems...\n\n\n\tSolrInfoMBeanTest failes with this patch – the test assumes it can instantiate all classes it finds that are assignable to SolrInfoMBean, but this fails for most of the ValueSourceParsers which are anonymous inner classes.  this is a test failure, and could either be accounted for in the test, or we could make those ValueSOurceParsers real classes (the latter being my opinion as a good idea anyway)\n\tthe JSPs need to be updated to account for hte new Categories of SolrInfoMBeans (this is some brittle code anyway, definitely good to fix or rip out)\n\tthe new SolrInfoMBeans aren't getting registered in the infoRegistry.\n\n\n\nThe first two are straight forward – the last one confuses the hell out of me – the code exists in SolrResourceLoader to automaticly register any object it instantiates that implements SolrInfoMBeans, but for some reason it doesn't seem to be working.  it seems like a symptom of a bigger problem that needs to be investigated "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12921158",
            "date": "2010-10-14T23:05:57+0000",
            "content": "On a practical front, there are so many value source parsers that this would further pollute an already very polluted stats page (and startup logging).  I think we need a way to output less information. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12921166",
            "date": "2010-10-14T23:13:52+0000",
            "content": "On a practical front, there are so many value source parsers that this would further pollute an already very polluted stats page (and startup logging). I think we need a way to output less information.\n\nwhich is why i want to remove the link to admin/stats.jsp and replace it with a link(s) to admin/mbeans ... it supports category filtering so we can easily link to something like...\n\nhttp://localhost:8983/solr/admin/mbeans?cat=CORE&cat=QUERYHANDLER&stats=true\n\n...from the admin screen (and use spiffy velocity templates to let people look at other types of mbeans as they wish)\n\n...but that's a different issue. "
        }
    ]
}