{
    "id": "SOLR-1145",
    "title": "Patch to set IndexWriter.defaultInfoStream from solr.xml",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Lucene IndexWriters use an infoStream to log detailed info about indexing operations for debugging purpose. This patch is an extremely simple way to allow logging this info to a file from within Solr: After applying the patch, set the new \"defaultInfoStreamFilePath\" attribute of the solr element in solr.xml to the path of the file where you'd like to save the logging information.\n\nNote that, in a multi-core setup, all cores will end up logging to the same infoStream log file. This may not be desired. (But it does justify putting the setting in solr.xml rather than solrconfig.xml.)",
    "attachments": {
        "SOLR-1145.patch": "https://issues.apache.org/jira/secure/attachment/12407206/SOLR-1145.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Yonik Seeley",
            "id": "comment-12706201",
            "date": "2009-05-05T21:24:35+0000",
            "content": "This would be very useful to get in for 1.4 to help with indexing issues people may hit. "
        },
        {
            "author": "Chris Harris",
            "id": "comment-12711828",
            "date": "2009-05-21T21:48:05+0000",
            "content": "I found it confusing not to have any timestamp data in the infostream log. This new version prints a timestamp along with each infoStream message. You can configure the timestamp format, though there's currently no way to disable timestamping. "
        },
        {
            "author": "Chris Harris",
            "id": "comment-12711834",
            "date": "2009-05-21T21:54:31+0000",
            "content": "Oops. Infostream logging should not be enabled by default in example/multicore "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12716248",
            "date": "2009-06-04T11:54:52+0000",
            "content": "Couple thoughts:\n\nGreat idea - lets put this in for sure.\n\nI think the config actually does belong in solrconfig.xml though. I also think we should not be using the static setDefaultInfostream, but rather the per instance setting. Then you can set a debug info file per core.  "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12716417",
            "date": "2009-06-04T21:46:57+0000",
            "content": "I agree about this belonging to solrconfig.xml – I bet < 50% people use multicore. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12720153",
            "date": "2009-06-16T14:31:41+0000",
            "content": "So I think it should be more like this - per core settings.\n\nOr perhaps a mix of our two patches? "
        },
        {
            "author": "Chris Harris",
            "id": "comment-12720172",
            "date": "2009-06-16T14:55:51+0000",
            "content": "So I think it should be more like this - per core settings.\n\nThat works fine for me. I didn't actually think doing it per core would be that easy, which is part of why I started out with the process-wide approach.\n\nAny ideas about if the TimeLoggingPrintStream is going to slow things down too much? I didn't do any kind of benchmarking with that. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12721580",
            "date": "2009-06-19T00:25:54+0000",
            "content": "adding support for setInfoStream seems like a good idea, but specifying a filename in the config file and writing a new TimeLoggingPrintStream class smells like reinventing logging.\n\nIt seems like it would be simpler just to add a new boolean \"infoStream\" config option, and then leverage the existing logging framework by constructing an instance of a PrintStream that just proxies to SLF4J when the boolean property is true.  A PrintStream instance that writes to a Logger seems no harder to implement then an PrintStream that knows how to prepend messages with a timestamp – and by using the standard logging framework, solr admins can customize it however they want.\n\nIt looks like someone may have already thought this type of problem through a lot more indepth then us anyway...\nhttp://bugzilla.slf4j.org/show_bug.cgi?id=110 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12721783",
            "date": "2009-06-19T13:44:51+0000",
            "content": "I see your point Hoss.\n\nBut at the same time, this is a special debug log that I would likely want to see only when I specifically turn it on to debug (usually for a Lucene dev to look at). Likely I just want to see the log in isolation - Mike M will prob have a hard time looking through it mixed in with all of the Solr logging \n\nNow you can do that with log4j/jdk logging, but its a hassle. Youd have to setup a config that captured the right package, and setup a file for it to write to... and it would likely be a hassle for people when I said, hey just turn on the IndexWriter debug stream, and setup your logging config to isolate it to a single file, and ...\n\nAnd it just seems like you would almost never want the info dispersed with everything else in the standard log.\n\nTimeLoggingPrintStream isnt really to reinvent logging - its just to shove in a timestamp as I guess Lucene doesn't.\n\nSo, I see your point, and I'm not really arguing against yet (Likely you have good counter points), but thats the way I see it at the moment... "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12721784",
            "date": "2009-06-19T13:53:07+0000",
            "content": "Also, with lots of cores, even if you used the logging config to isolate the infostream log, it would be very difficult to isolate each core to its own file. And again, it seems like it would be difficult to deal with the log with multiple cores mixing up the IndexWriter debug logging in the same file. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12723331",
            "date": "2009-06-23T22:33:48+0000",
            "content": "Mark: all your points are valid.\n\nDo me one favor: instead of this...\n\n\n<infoStreamFile>/path/to/infostream/file</infoStreamFile>\n\n\n\nMake the config sequence something like...\n\n\n<infoStream file=\"/path/to/infostream/file\" />\n\n\n\n...so we don't paint ourselves into a corner, and we can easily add logging based infostream option later if we want. (using a new 'logger=\"...\"' xml attribute instead of 'file')\n\nOn a related note, Having an explicit true/false (ie: on/off) option seems like a good idea so it's easy to control with a system property at startup....\n\n\n<infoStream file=\"/path/to/infostream/file\">${solr.infostream:true}</infostream>\n\n\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12723578",
            "date": "2009-06-24T14:31:49+0000",
            "content": "Changes made plus some other polish/finish "
        },
        {
            "author": "Noble Paul",
            "id": "comment-12723584",
            "date": "2009-06-24T14:44:31+0000",
            "content": "I am moving all the xpath reading to solrconfig. I guess this too can go to solrconfig.  SOLR-1198 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12723586",
            "date": "2009-06-24T14:49:24+0000",
            "content": "+1 "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12727714",
            "date": "2009-07-06T19:24:32+0000",
            "content": "Thanks Chris! "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12763618",
            "date": "2009-10-08T18:40:08+0000",
            "content": "Reopening... I can't get it to work either.\nhttp://search.lucidimagination.com/search/document/9cd31d75526236f1/indexwriter_infostream_in_solrconfig_not_working "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12763633",
            "date": "2009-10-08T18:55:22+0000",
            "content": "OK, I found it... the example has infoStream in the indexDefaults section and not the mainIndex section.\n\nNot sure if intoStream should be supported as a default or not.\nPerhaps just move the example to mainIndex for now? "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12763640",
            "date": "2009-10-08T19:06:35+0000",
            "content": "committed changes to example, as well as a NPE fix for files without a parent specified. "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775730",
            "date": "2009-11-10T15:52:05+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}