{
    "id": "SOLR-3319",
    "title": "Improve DataImportHandler status response",
    "details": {
        "affect_versions": "3.5,                                            4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Won't Fix"
    },
    "description": "The DataImportHandler has some oddities and inconsistencies in its status response that make it difficult to write code that parses DIH status, especially if both full-import and delta-import are required.  See SOLR-2729.\n\nI would like to have a discussion where we come up with a well-defined and consistent format that can be used programatically as well as be human readable, and then I can implement it, or someone else can if they really want to.  I think it would be very useful if the status response included all parameters that went into the import request, like echoParams in the query interface.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13246930",
            "date": "2012-04-05T01:33:23+0000",
            "content": "I personally would like to see this included in 3x, since that's what I use.  How do the rest of you feel about that? "
        },
        {
            "author": "James Dyer",
            "id": "comment-13247242",
            "date": "2012-04-05T14:17:36+0000",
            "content": "I don't think this can be done for 3.x as the branch is in bug-fixes-only mode.  Also, this will create backwards-incompatible changes for users' scheduling programs, so this kind of thing is better suited for a new major release.  "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13247684",
            "date": "2012-04-05T21:22:14+0000",
            "content": "Here's an idea, at least for 3x, assuming it's not unilaterally killed by the bug-fix-only mode: A configuration knob to use the old response or the new response.  It would default to old.\n\nFor 4.0, that configuration knob seems like a good idea, defaulting to the new response.  In 4.1 or 5.0, the old response gets removed. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13248402",
            "date": "2012-04-06T14:56:26+0000",
            "content": "Here are some general ideas, preliminary because I have not taken a close look at the code yet.  For reference, here is a completed status response on a full-import from 3.5.0:\n\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response>\n\n<lst name=\"responseHeader\">\n  <int name=\"status\">0</int>\n  <int name=\"QTime\">0</int>\n</lst>\n<lst name=\"initArgs\">\n  <lst name=\"defaults\">\n    <str name=\"config\">dih-config.xml</str>\n  </lst>\n</lst>\n<str name=\"status\">idle</str>\n<str name=\"importResponse\"/>\n<lst name=\"statusMessages\">\n  <str name=\"Total Requests made to DataSource\">1</str>\n  <str name=\"Total Rows Fetched\">11287894</str>\n  <str name=\"Total Documents Skipped\">0</str>\n  <str name=\"Full Dump Started\">2012-04-03 17:38:01</str>\n  <str name=\"\">Indexing completed. Added/Updated: 11287894 documents. Deleted 0 documents.</str>\n  <str name=\"Committed\">2012-04-03 20:16:32</str>\n  <str name=\"Total Documents Processed\">11287894</str>\n  <str name=\"Time taken \">2:38:31.314</str>\n</lst>\n<str name=\"WARNING\">This response format is experimental.  It is likely to change in the future.</str>\n</response>\n\n\n\nI was thinking it might be a good idea to have two response sections in addition to the echoParams section already mentioned - one for a human readable response and one for a relatively terse machine readable response.  The human readable version would be fairly open to change, and could include extra verbiage so it's very understandable for a person.\n\nThe machine readable version would have more elements, each of which is very simple, probably just a numeric value or a true/false indicator.  A design decision needs to be made early - do we include all elements in every response (with the value set to zero, blank, or false), even if they don't apply to the current status?  My first instinct is to include all elements, but maybe that's wrong. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636601",
            "date": "2013-04-19T17:02:15+0000",
            "content": "I have closed older issues SOLR-2728 and SOLR-2729, any work on those issues can continue in this one.  SOLR-2729 has a patch attached.  I haven't checked to see if this issue is a duplicate, but I would not be surprised if it is.\n\nThis is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636613",
            "date": "2013-04-19T17:09:06+0000",
            "content": "I do have some interest in working on this, but it's not currently on my radar.  Implementing SOLR-4241 would illustrate the issues that need fixing ... although if this is tackled first, writing SOLR-4241 would be much easier. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717425",
            "date": "2013-07-23T18:48:12+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971132",
            "date": "2014-04-16T12:57:14+0000",
            "content": "Move issue to Solr 4.9. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15582196",
            "date": "2016-10-17T13:07:24+0000",
            "content": "I don't think there will be any DIH refactoring going forward, just bug fixes. \nDoes still make sense to keep this one open? "
        }
    ]
}