{
    "id": "SOLR-9368",
    "title": "FileDictionaryFactory does not treat lines beginning with '#' as comments",
    "details": {
        "components": [
            "Suggester"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "6.1",
        "status": "Resolved",
        "resolution": "Not A Bug",
        "priority": "Minor"
    },
    "description": "The documentation for FileDictionaryFactory states that \"Blank lines and lines that start with a '#' are ignored\". This is not the case. When loading a dictionary file with '#' prefixed lines, they just get interpreted as terms and show up in suggestion results. \n\nThis causes additional confusion when trying to use payloads. As stated in https://lucene.apache.org/core/6_1_0/suggest/org/apache/lucene/search/suggest/FileDictionary.html : \"In order to have payload enabled, the first entry has to have a payload\". However, if you happen to have a \"comment\" as the first line in a dictionary file (that doesn't happen to have two instances of the fieldDelimiter in it...), payloads are disabled.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-08-02T12:17:02+0000",
            "author": "Jan Høydahl",
            "content": "FileDictionary.java does not mention the support for comment lines and does not implement it either. So the easiest is to treat this as a documentation bug in the RefGuide: https://cwiki.apache.org/confluence/display/solr/Suggester#Suggester-FileDictionaryFactory and change that.\n\nIf not, this should be changed into a LUCENE issue for code changes, but then it must be a feature request and not a Bug, since the Lucene documentation (Javadoc) is fully in line with the code... ",
            "id": "comment-15403886"
        },
        {
            "date": "2016-08-02T13:47:50+0000",
            "author": "John Iacona",
            "content": "I think updating the documentation is a fine fix. For me it was more a case of really confusing side effects than needing comments in a dictionary file. ",
            "id": "comment-15403987"
        },
        {
            "date": "2016-08-02T14:00:28+0000",
            "author": "Jan Høydahl",
            "content": "Resolving as not a bug. I updated the text in https://cwiki.apache.org/confluence/display/solr/Suggester#Suggester-FileDictionaryFactory to be in line with the actual code, also removing the claim that blank lines are allowed. I also updated the example, replacing literal \\t with a tab character. ",
            "id": "comment-15404014"
        },
        {
            "date": "2016-08-02T14:19:00+0000",
            "author": "John Iacona",
            "content": "Great, thanks! ",
            "id": "comment-15404063"
        }
    ]
}