{
    "id": "SOLR-2614",
    "title": "stats with pivot",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Closed",
        "fix_versions": [
            "4.4"
        ],
        "components": [
            "SearchComponents - other"
        ],
        "type": "Improvement",
        "priority": "Critical",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "Is it possible to get stats (like Stats Component: min ,max, sum, count,\n\nmissing, sumOfSquares, mean and stddev) from numeric fields inside\nhierarchical facets (with more than one level, like Pivot)?\n\n I would like to query:\n...?q=:&version=2.2&start=0&rows=0&stats=true&stats.field=numeric_field1&stats.field=numeric_field2&stats.pivot=field_x,field_y,field_z\n and get min, max, sum, count, etc. from numeric_field1 and\nnumeric_field2 from all combinations of field_x, field_y and field_z\n(hierarchical values).\n\n\n Using stats.facet I get just one field at one level and using\nfacet.pivot I get just counts, but no stats.\n\n Looping in client application to do all combinations of facets values\nwill be to slow because there is a lot of combinations.\n\n\n Thanks a lot!\n\n\nthis  is  very  import,because  only counts value,it's no use for sometimes.\nplease add   stats with pivot  in solr 4.0 \n\nthanks a lot",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Ryan McKinley",
            "id": "comment-13053310",
            "date": "2011-06-22T15:33:08+0000",
            "content": "not currently.\n\npatches welcome! "
        },
        {
            "author": "pengyao",
            "id": "comment-13055396",
            "date": "2011-06-27T08:38:27+0000",
            "content": "somebody  help me \nor give me some  suggestion ?\n\nor is it  easy to patch it?\n\nthanks very much. "
        },
        {
            "author": "Marek Woroniecki",
            "id": "comment-13281478",
            "date": "2012-05-23T09:30:55+0000",
            "content": "I would also like to see this feature.\n\nIn our app we do a lot of faceting to allow users to drill down into data by selecting particular values per particular fields. We also calculate stats for these selections using stat component. However, quite often we need to group documents into chunks by their common attributes and then calculate stats as well. In classic approach using database we would probably do that with the \"group by\" phrase and use some aggregating functions. Unfortunately for some reasons this is not an easy option in our case, and we are left with either reading all the documents and calculating grouping in memory, or our users have to extract all the data to csv and do some pivots / stats in excel. \n\nI would be more than happy to implement this patch, if I only knew more about how Lucene / Solr works internally  "
        },
        {
            "author": "Terrance A. Snyder",
            "id": "comment-13293112",
            "date": "2012-06-11T21:42:28+0000",
            "content": "Starting work on this now - I'll try to combine it in a way that is similar to the facet.pivot component and work out from there. "
        },
        {
            "author": "Trey Grainger",
            "id": "comment-13293249",
            "date": "2012-06-12T01:23:30+0000",
            "content": "Hi Terrance,\n\nWe (at CareerBuilder) built a patch recently which could serve as a good starting point for this.  We built an ability to calculate Percentiles (i.e. 25th, 50th, etc.) and Averages using multi-level (distributed) Pivot Facets.  It works well enough for our use cases, and I'm sure the other stats types mentioned could be added in.\n\nIt is dependent upon the distributed pivot faceting patch (SOLR-2894), which seem to be working well but has yet to be committed.\n\nI'll see if we can get the patch posted either as part of this JIRA or separately in the next day or so, which could save you some time in implementing the other types.\n\n-Trey Grainger\nCareerBuilder "
        },
        {
            "author": "Chris Russell",
            "id": "comment-13403337",
            "date": "2012-06-28T18:31:24+0000",
            "content": "Hi everyone.  I posted the patch Trey mentioned as SOLR-3583.\nI hope you find it helpful. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13697442",
            "date": "2013-07-02T02:56:45+0000",
            "content": "I think we can call this a dupe of SOLR-3583. Won't Fix. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13716846",
            "date": "2013-07-23T18:38:45+0000",
            "content": "Bulk close resolved 4.4 issues "
        }
    ]
}