{
    "id": "SOLR-2610",
    "title": "Add an option to delete index through CoreAdmin UNLOAD action",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.3",
            "4.0-ALPHA"
        ],
        "components": [
            "multicore"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Right now, one can unload a Solr Core but the index files are left behind and consume disk space. We should have an option to delete the index when unloading a core.",
    "attachments": {
        "SOLR-2610-branch3x.patch": "https://issues.apache.org/jira/secure/attachment/12483429/SOLR-2610-branch3x.patch",
        "SOLR-2610.patch": "https://issues.apache.org/jira/secure/attachment/12483266/SOLR-2610.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-13051948",
            "date": "2011-06-20T12:31:07+0000",
            "content": "+1 "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13052479",
            "date": "2011-06-21T11:06:56+0000",
            "content": "Patch adds a boolean \"deleteIndex\" parameter to core unload action.\n\nThere is a close hook interface in SolrCore but it is called before the update handler and searcher(s) are closed so it cannot be used to delete the index.\n\nChanges:\n\n\tChanges the CloseHook interface to an abstract class with a preClose(SolrCore) and a postClose(SolrCore) method\n\tChanged the usage of CloseHook in ReplicationHandler, SolrCoreTest\n\tCoreAdminHandler adds a closehook on receiving an unload action with deleteIndex=true\n\tAdded tests for the new param\n\n\n\nSince the CloseHook is used very sparingly, I think it is fine to change it to an abstract class but if people feel strongly against it, we can find another way. "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-13052624",
            "date": "2011-06-21T15:40:39+0000",
            "content": "This is good!  I had to write the same functionality into a custom Solr build on a project. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13053176",
            "date": "2011-06-22T11:04:42+0000",
            "content": "Patch for branch 3x "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13053188",
            "date": "2011-06-22T11:29:00+0000",
            "content": "Committed revision 1138405 on trunk and 1138407 on branch_3x. "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-13053508",
            "date": "2011-06-22T22:31:00+0000",
            "content": "Just reviewed the patch, I think we need an additional option to remove all files related to the core.  This is useful for manual core movement. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13053650",
            "date": "2011-06-23T04:47:00+0000",
            "content": "Which other files do you want to remove? In order to create a core, all required configuration files must already be present on the disk. I did not want to remove files during unload which I cannot later add to a host through the admin interfaces. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13053870",
            "date": "2011-06-23T14:06:41+0000",
            "content": "But you might want to (in fact, I do this). If you are really done with a core, if you really want to remove it, what do you need the config files around for anymore? Seems like a reasonable option to me - makes no sense as the default I'd agree with.\n\nnukeEverything=true  "
        },
        {
            "author": "Jason Rutherglen",
            "id": "comment-13053992",
            "date": "2011-06-23T17:35:33+0000",
            "content": "Mark put it aptly.  The problem I think I encountered in my own version is left over file handles seemed to be preventing the deletion of all the files, many times some of them would be left over.  Also I deleted the entire core directory, which is useful for manual testing (eg, to avoid the directory exists exception). "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13054079",
            "date": "2011-06-23T20:28:35+0000",
            "content": "I can think of a corollary core action I'd like to see – the ability on a core RELOAD to entirely delete the index from a core and replace it with a fresh empty index that will start building at segment _0.  I would do this to my \"build\" core before using it, and later after swapping it with the \"live\" core and ensuring it's good, to free up disk space. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13054316",
            "date": "2011-06-24T09:12:48+0000",
            "content": "But you might want to (in fact, I do this). If you are really done with a core, if you really want to remove it, what do you need the config files around for anymore?\n\nI was approaching this particular issue more from the angle of making it useful for SolrCloud. I can see how deleting configs can be useful to some people but is it worth introducing such an inconsistency i.e. you can delete config but cannot add it back? Anyways, it is best handled via a separate issue. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13054320",
            "date": "2011-06-24T09:20:53+0000",
            "content": "\nI can think of a corollary core action I'd like to see – the ability on a core RELOAD to entirely delete the index from a core and replace it with a fresh empty index that will start building at segment _0. I would do this to my \"build\" core before using it, and later after swapping it with the \"live\" core and ensuring it's good, to free up disk space.\n\nShawn, that is not a use-case for RELOAD. The idea behind it is to reload an existing core's index with updated configuration changes and swap it with the existing core without causing downtime. It seems like your use-case is handled well with the stock CREATE, SWAP and UNLOAD+deleteIndex? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13054415",
            "date": "2011-06-24T12:47:35+0000",
            "content": "I was approaching this particular issue more from the angle of making it useful for SolrCloud. \n\nwhere do you mention how this helps with SolrCloud?\n\nI can see how deleting configs can be useful to some people but is it worth introducing such an inconsistency i.e. you can delete config but cannot add it back? Anyways, it is best handled via a separate issue.\n\nWhy are you deleting cores only to add them back again with the same config? Do you really think it's inconsistent to actually be able to delete something? Does it really seem like a weird use case to say, I want to delete a SolrCore I no longer have an interest in?\n\nLooks like a few people have an interest in this issue, so I'm not sure why you rammed it in so quickly. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13054443",
            "date": "2011-06-24T13:24:59+0000",
            "content": "where do you mention how this helps with SolrCloud?\n\nI didn't and I'm sorry about that. I was just trying to tell you my perspective. These are small pieces that need to be fixed before tackling larger problems in SolrCloud and this one seemed generally useful and simple enough by itself that I opened the issue without giving the bigger picture. Some of the other pieces are captured in SOLR-2595\n\nWhy are you deleting cores only to add them back again with the same config?\n\nHopefully SOLR-2595 will give you a better idea of what I was thinking. The use-case is to split and migrate pieces of an index and this issue will help in deleting the leftover temporary cores.\n\nDo you really think it's inconsistent to actually be able to delete something?\nThe inconsistency is to be able to delete a configuration file when there is no way to add it back but I'm not against the feature in general.\n\nDoes it really seem like a weird use case to say, I want to delete a SolrCore I no longer have an interest in?\nAbsolutely not. If you want that feature, that's fine. You don't need permissions to put up a patch and commit it \n\nLooks like a few people have an interest in this issue, so I'm not sure why you rammed it in so quickly.\n\nThe issue clearly talks about deleting index on unload and that's what it does. And I got a +1 from you and Jason on the topic of the issue (or at least, that's what I assumed). I waited a day to commit - would you like me to wait longer for future issues or leave a comment to that effect? If the patch is not what you intended, go ahead and reopen/extend the scope of the issue or open another issue. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13054450",
            "date": "2011-06-24T13:37:42+0000",
            "content": "And I got a +1 from you and Jason on the topic of the issue (or at least, that's what I assumed). I waited a day to commit - would you like me to wait longer for future issues or leave a comment to that effect? \n\nNo, I think a day is fine - just warning perhaps? Both Jason and I liked the idea, but it just seemed like we where discussing some of the details and you committed kind of without warning. I'm not that concerned about it, just mentioning it.\n\nIf the patch is not what you intended, go ahead and reopen/extend the scope of the issue or open another issue.\n\nI think the patch is fine - I've tweaked a couple little things on the changes entry, but the patch itself looks good so far. I opened SOLR-2621 to continue the other 'delete options' discussion. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13054489",
            "date": "2011-06-24T14:59:42+0000",
            "content": "Shawn, that is not a use-case for RELOAD. The idea behind it is to reload an existing core's index with updated configuration changes and swap it with the existing core without causing downtime. It seems like your use-case is handled well with the stock CREATE, SWAP and UNLOAD+deleteIndex?\n\nCREATE requires that the caller be aware of internal server filesystem structures.  For the typical use of CREATE, this is not really a problem, but if what you're trying to do is unload a core, delete its index, and then immediately recreate it with the same config, it would be very nice to not have to specify (or even know) the solr.xml configuration bits.\n\nIn this particular case, the person who writes the scripts is the same person who maintains the Solr infrastructure (me) ... but that might not always be the case.  Currently the build scripts don't know anything about the internal structure other than core names, and I'd like to keep it that way.\n\nAdding an option like deleteIndex to RELOAD seemed a logical way to handle this, since currently (1.4.1) I have to completely restart Solr when I wipe out an index directory.  If this is not a logical progression, I would argue that CoreAdmin needs an entirely new action.  Either way, if it's deemed desirable, it needs its own Jira issue.  I brought it up here because it's at least tangentially related. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13058944",
            "date": "2011-07-02T02:43:12+0000",
            "content": "Bulk close for 3.3 "
        }
    ]
}