{
    "id": "SOLR-5998",
    "title": "Is Apache Solr 1.0 vulnerable to Heartbleed",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Not A Problem"
    },
    "description": "What would to check whether if there is any documented info on whether Apache Solr 1.0 is vulnerable to Heartbleed? If so, any available fixes? thks",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13975387",
            "date": "2014-04-21T04:53:43+0000",
            "content": "Solr itself contains no SSL code.  It runs in a servlet container (a java webserver).  A stripped-down install of Jetty is included in the Solr example, but that is not set up with SSL by default.\n\nEven if the user does enable SSL on the included example, Jetty will be using the Java SSL implementation, which does not use OpenSSL at all.  It is not vulnerable to heartbleed.  If the user is not using Jetty, they would need to check the particular servlet container they are using for vulnerabilities.  I am reasonably sure that none of the available servlet containers will be using OpenSSL.\n\nSometimes proxy software or hardware is used in front of Solr and SSL is configured there.  That software and the operating system that it runs on may be vulnerable to heartbleed.\n\nOne final piece of information: We strongly recommend installing Solr someplace where it cannot be reached directly from the open Internet.  SSL is not enough to prevent security issues. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13975393",
            "date": "2014-04-21T05:05:58+0000",
            "content": "Closing as \"Not a Problem.\"  Created a wiki page:\n\nhttps://wiki.apache.org/solr/SolrVulnerabilities "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13975458",
            "date": "2014-04-21T07:24:32+0000",
            "content": "Re-opened issue to change the wiki link. "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13975495",
            "date": "2014-04-21T09:26:06+0000",
            "content": "The vulnerability of Solr to Heartbleed is out of our control. It depends on the SSL library used by the Java virtual machine used to run Solr. The official Oracle ones are not vulnerable, because they dont use OpenSSL, but I would not be sure about OpenJDK on various unpatched Linux distributions!!!\n\nWe should add this to the Wiki page, too. "
        }
    ]
}