{
    "id": "SOLR-7796",
    "title": "Implement a \"gather support info\" button",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Minor"
    },
    "description": "A \"gather support info\" button in the admin UI would be extremely helpful.  There are some basic pieces of info that we like to have for problem reports on the user list, so there should be an easy way for a user to gather that info.\n\nSome of the more basic bits of info would be easy to include in a single file that's easy to cut/paste – java version, heap info, core/collection names, directories, and stats, etc.  If available, it should include server info like memory, commandline args, ZK info, and possibly disk space.\n\nThere could be two buttons – one that gathers smaller info into an XML, JSON, or .properties structure that can be easily cut/paste into an email message, and another that gathers larger info like files for configuration and schema along with the other info (grabbing from zookeeper if running in cloud mode) and packages it into a .zip file.  Because the user list eats almost all attachments, we would need to come up with some advice for sharing the zipfile.  I hate to ask INFRA for a file sharing service, but that might not be a bad idea.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-07-15T20:29:46+0000",
            "author": "Stefan Matheis (steffkes)",
            "content": "I absolutely like the idea!\n\nWhile Shawn Heisey, Edward Ribeiro and i were throwing ideas around in #solr, the following things came up - which i'm just including here for reference:\n\n\n15.2129 <@     steffkes> elyograg: +1 on SOLR-7796, gathering support relevant information is a really nice idea!\n15.2133 <@     elyograg> yep.  It's somewhat painful to tailor each request for info to the situation, and I hate to have people spend a lot of time gathering info that might ultimately\n                         turn out to be useless ... so instead of relying on their skill level or taking up tons of their time, do it instantly.\n15.2141 <      eribeiro> elyograg: steffkes: if no one more knowledgeable contributor picks up SOLR-7796 in a day or two, I am gonna try to take a stab at it. ;-)\n15.2147 <@     steffkes> eribeiro: nice! if you need help .. feel free to ping me or Upayavira\n15.2148 <      eribeiro> okay, thanks. :)\n15.2149 <@     steffkes> implementation might differ a bit, depending on where you're going to include it - but the basic idea should be the same for both, i guess\n15.2150 <@     steffkes> eribeiro: true that. while reading i was thinking if it might be possible to solve it in one shot .. but we're indeed talking about a few things that might be\n                         interesting here ..\n15.2150 <@     steffkes> like the whole schema .. in case we stick to something text based .. that might get a loooooong document\n15.2150 <      eribeiro> yeah...\n15.2151 <      eribeiro> +1 about the zip thing then\n15.2151 <@     steffkes> which we have to do on the server, rather then the client side .. :/\n15.2151 <@     steffkes> otherwise i wouldn't bet that it's easy to implement. generate a zip in everyones browser .. i don't know :D\n15.2152 <      eribeiro> haha, let's find out. :)\n15.2152 <@     steffkes> on the other hand .. just thinking out load: if pressing that button would open a modal layer .. which contains a bunch of checkboxes .. where you could decide\n                         *what* to actually prepare for export?\n15.2153 <@     steffkes> i mean, even if someone is going to include his schema .. it's not really a problem. it's just a few lines of text. we he/she is already used to\n15.2154 <@     steffkes> pastie.org has a nice feature where you can use ## at the beginning of a line to indicate a section, like this one: http://pastie.org/10295224\n15.2154 <      eribeiro> that would be awesome. something alike tools like phpMySQLAdmin does when backing up and restoring the DB.\n15.2154 <@     steffkes> not sure if apaste.info does support something like that as well\n15.2155 <@     steffkes> and .. to go really crazy .. we could probably try to include the possibility to directly *post* this content to a paste-site. that would be reeeaaallly nifty\n15.2155 <@     steffkes> like .. hitting a button and getting back a url you can share, which includes all the things you've previously checked :o\n15.2156 <      eribeiro> wow, indeed.\n15.2156 <@     steffkes> but .. i don't want to set the bar to high :D\n15.2157 <@     steffkes> just throwing ideas around while thinking about it\n15.2158 <      eribeiro> haha, got it. I will start small and see what I get. :)\n15.2158 <@     steffkes> the last thing (posting directly) might require a change for apaste.info but only easy things like additional headers, so that a javascript client is allowed to go\n                         crossdomain, which is normally forbidden by the browsers security policy\n\n\njust to be sure that the last idea (POSTing it directly somewhere) isn't entirely out of reach, i dropped by #asinfra's hipchat and talked with Daniel Gruno about the idea:\n\n10:01 Stefan Matheis we were just throwing ideas around in #solr over at freenode. Shawn come up with an idea to include a \"gather support information\"-button in the admin ui\n10:02 Daniel Gruno (Humbedooh) ehm..\n10:02 Stefan Matheis based on the my idea was we could probably include a possibility to directly POST this information to apaste.info - which would require a rather small change on apaste.info's configuration\n10:02 Daniel Gruno (Humbedooh) ah\n10:02 Stefan Matheis ;>\n10:02 Gavin McDonald (McDuck) @Humbedooh is yoiur man\n10:02 Daniel Gruno (Humbedooh) well, we could add a token account\n10:02 Stefan Matheis like enabling CORS header\n10:02 Daniel Gruno (Humbedooh) or err\n10:02 Daniel Gruno (Humbedooh) with a token\n10:02 Daniel Gruno (Humbedooh) role account\n10:02 Daniel Gruno (Humbedooh) oh, sure, CORS should be easy enough\n10:02 Daniel Gruno (Humbedooh) that's just a matter of editing the yaml for the TLS terminator\n10:02 Daniel Gruno (Humbedooh) in fact, it's actually all something you'd do on that machine\n10:02 Daniel Gruno (Humbedooh) the backend does not need to know \n10:04 Stefan Matheis well actually, it does: http://enable-cors.org/server.html\n10:05 Daniel Gruno (Humbedooh) I think you misunderstood me, Stefan\n10:05 Daniel Gruno (Humbedooh) the TLS terminator can add that header\n10:05 Daniel Gruno (Humbedooh) the backend does not need to be involved to enable CORS\n10:06 Stefan Matheis the TLS terminator? not sure if i know what you're talking about\n10:06 Daniel Gruno (Humbedooh) SSL proxy in front\n10:06 Daniel Gruno (Humbedooh) the actual paste.a.o service isn't serving up the page you see\n10:07 Stefan Matheis got it\n10:07 Daniel Gruno (Humbedooh) it's being relayed through another machine in charge of adding the TLS/SSL layer to it\n10:07 Daniel Gruno (Humbedooh) and that machine is the one we should change settings on\n10:07 Stefan Matheis didn't intend to say it needs to be the actual backend. just the machine serving the page\n10:07 Daniel Gruno (Humbedooh) mostly because it's way easier\n10:08 Stefan Matheis but it needs to be \"on the server side\" .. can't do it only with settings on the client (:\n10:08 Daniel Gruno (Humbedooh) yep, and that's pretty much just a change in puppet\n10:08 Stefan Matheis but .. before we discuss the details .. just wanted to hop in and ask nicely first ;>\n10:08 Daniel Gruno (Humbedooh) sure, it can be done, np \n10:08 Stefan Matheis if that's okay with you guys .. something you don't like to have and things\n10:08 Stefan Matheis great to hear \n10:08 Daniel Gruno (Humbedooh) I think it's a great idea\n\nsince it went that well .. i went ahead with the other idea we had:\n\n10:10 Stefan Matheis okay then .. ahead to another question, as well regarding apaste.info\n10:10 Stefan Matheis 15.2154 <@     steffkes> pastie.org has a nice feature where you can use ## at the beginning of a line to indicate a section, like this one: http://pastie.org/10295224\n10:11 Stefan Matheis that's really something on top of everything. in case we're generated a large-ish document which includes all that stuff .. it would be nice if we could come up with separated sections\n10:11 Stefan Matheis absolutely not necessary, for sure - just curious what you might think about that @Humbedooh\n10:11 Daniel Gruno (Humbedooh) hm, actually, I thought it already had MD rendering and such - I guess I was wrong\n10:12 Stefan Matheis oh it might very well do .. didn't think of trying it out \n10:12 Stefan Matheis probably should have, before asking (:\n10:13 Gavin McDonald (McDuck) @Humbedooh paste.info != paste.a.o\n10:13 Daniel Gruno (Humbedooh) @gmcdonald same source code, pretty much \n10:13 Gavin McDonald (McDuck) figured as much, just making sure\n10:14 Daniel Gruno (Humbedooh) paste.a.o refers to apaste.info\n10:14 Stefan Matheis what's the actual syntax in markdown for a section/heading again? it's not ## Section .. tried that: http://apaste.info/3Ru\n10:14 Daniel Gruno (Humbedooh) for non-committers\n10:14 Daniel Gruno (Humbedooh) I don't see markdown as an option there right now, stefan, but I'll get it in there eventually\n10:14 Gavin McDonald (McDuck) isnt it like === or something\n10:14 Daniel Gruno (Humbedooh) and on paste.a.o also\n10:15 Stefan Matheis tried that as well Gavin: http://apaste.info/HqO doesn't work\n10:15 Stefan Matheis Daniel: MD !== markdown? just assumed so\n10:15 Daniel Gruno (Humbedooh) MD = markdown\n10:15 Daniel Gruno (Humbedooh) but there's no option to set the document to that atm\n10:16 Stefan Matheis ah, got it\n10:16 Daniel Gruno (Humbedooh) however, I do have a markdown plugin for it\n10:16 Daniel Gruno (Humbedooh) so I'll just need to add that\n10:16 Stefan Matheis no worries - the idea just started as a ticket .. probably needs some time to get in anyway\n10:16 Daniel Gruno (Humbedooh) but not tonight \n10:16 Daniel Gruno (Humbedooh) yep\n10:17 Stefan Matheis if it's okay with you guys, i'm just going to add this conversation to the ticket - so however might implement it does have a reference to our conversation, in case it's needed?\n10:18 Daniel Gruno (Humbedooh) fine by me\n10:18 Daniel Gruno (Humbedooh) and thanks for asking  ",
            "id": "comment-14628672"
        },
        {
            "date": "2015-07-15T21:53:41+0000",
            "author": "Shawn Heisey",
            "content": "Some other things discussed in IRC were potential confidentiality concerns.  One idea put forth was to give the user a list of checkboxes to choose what info they want to include.\n\nFor the first button I mentioned above (the one that generates a text structure for copy/paste), I don't like the idea of giving the user the option to exclude info.  My reasons:  That info will typically contain very little that might be confidential, and a person in a support role will be able to help more if all that info is included.  I think it's sufficient to include a warning telling the user that they should review the information for anything confidential and redact it before sending it to anyone.\n\nFor the second button, the one that includes more comprehensive info in a downloadable file, confidential info is far more likely, and in that situation it is prudent to give the user a chance to exclude anything sensitive, like their config file(s) for the dataimport handler. ",
            "id": "comment-14628819"
        },
        {
            "date": "2015-08-03T14:52:01+0000",
            "author": "Shawn Heisey",
            "content": "I saw an update on SOLR-7555, and the issue description got me thinking.\n\nIf the basic info had a list of cores with the index size, volume size, and free space for each one, that would be really nice.  Having a data point on the dashboard (and in the basic support info) for the total disk space consumed by all indexes would be really nice.  If we can separately calculate the size of inactive transient cores, that would be very nice.\n\nYou might be wondering why I would be interested in space information for every core.  There have been questions on the mailing list about how to have different cores put their index data on different filesystems, so I know that a few users out there will have that setup.  We could put information on the dashboard for volume size and free space for the solr home directory, which would be enough for the vast majority of users. ",
            "id": "comment-14651942"
        },
        {
            "date": "2015-08-03T15:52:57+0000",
            "author": "Alexandre Rafalovitch",
            "content": "Great idea.\n\nMight be also useful to include number of records in each shard. This would give overall data size as well as showing off some dis-balances in routing. ",
            "id": "comment-14652014"
        }
    ]
}