{
    "id": "SOLR-4410",
    "title": "Highlight query parameter (hl.q) does not honor QParser defType parameter",
    "details": {
        "affect_versions": "4.1",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Duplicate"
    },
    "description": "If one uses a custom QParser for parsing standard queries, that person cannot do the same with the highlight query parameter using the 'defType' parameter.\n\nThe hl.q QParser will always default to the default defType unless the local params syntax is used to specify a different QParser.\n\nThe typical expectation would be that q and hl.q would behave the same.\n\nThe following examples should highlight the document in the same way:\n\nq=field:text&hl=true&defType=custom\n\n\n\nq=id:123&hl=true&hl.q=field:text&defType=custom\n\n\n\nThis is how you have to do it now:\n\nq=field:text&hl=true&defType=custom\n\n\n\nq=id:123&hl=true&hl.q={!custom}field:text&defType=custom",
    "attachments": {
        "SOLR-4410.patch": "https://issues.apache.org/jira/secure/attachment/12568289/SOLR-4410.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Scott Smerchek",
            "id": "comment-13572779",
            "date": "2013-02-06T20:23:34+0000",
            "content": "Use the defType param to determine the default QParser for use with the hl.q query. "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13576284",
            "date": "2013-02-12T01:44:08+0000",
            "content": "-1\n\ndefType is explicitly only for defining the \"default\" value of the \"type\" local param when parsing the \"q\" param.  I don't think using it implicitly in hl.q makes any more sense then using it implicitly in fq, or facet.query, or any other context – particularly since one of the driving motivators for having the hl.q param is to let users specify simpler alternate variants of the main query bypassing the query parser used.\n\nChanging this now could have some really unfortunate (and silent) side effects for anyone already hl.q who expect the existing behavior. "
        },
        {
            "author": "Scott Smerchek",
            "id": "comment-13576289",
            "date": "2013-02-12T01:54:05+0000",
            "content": "I understand that concern. Alternately, would it make sense to have a corresponding hl.q.defType so that there so it's use is explicit? Or are you suggesting that hl.q should not have access to any such parameter? "
        },
        {
            "author": "Scott Smerchek",
            "id": "comment-13985604",
            "date": "2014-04-30T15:11:52+0000",
            "content": "No longer a need for this issue/patch. "
        }
    ]
}