{
    "id": "SOLR-5602",
    "title": "Solr DIH shows in-consistent status",
    "details": {
        "affect_versions": "4.2",
        "status": "Closed",
        "fix_versions": [],
        "components": [
            "contrib - DataImportHandler"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "I have one DIH index job which takes about 4 hr to finish.\nThe job was launched at 11:28 am and completed at 15:10 pm.\nHowever, in DIH response, although \"statusMessages\" showed correct information, \"status\" kept showing \"busy\" until 16:40 pm.\nAfter that, it became \"idle\". \n\nThis index job is one step of our data pipeline, we are using both \"status\" and statusMessages\" to decide should the job move to next step, I would like to know the reason causing the in-consistent status.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Liu Xiang",
            "id": "comment-13861092",
            "date": "2014-01-03T01:53:05+0000",
            "content": "some investigation from myself.\nThe status from DIH is decided by DataImporter.importLock which is a ReentrantLock.\nIn the log, the last record is \"Time taken = xxx\" which occurs at end of DocBuilder.execute()\nAfter that, at the end of DataImporter.runCmd(RequestInfo reqParams, SolrWriter sw), importLock is unlock in finally block.\nI don't see any reason that statement is not executed.\nCould it be ReentrantLock can not release lock immediately for some reason?\n\nHope it helps to bootstrap. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15539791",
            "date": "2016-10-02T05:30:36+0000",
            "content": "Is this still observable in the latest Solr? I suspect the issue may have been to a long commit process for a big job and not a bug. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15557437",
            "date": "2016-10-08T07:14:53+0000",
            "content": "This case can't go anywhere until it is reproduced against the latest DIH with very specific instructions. If we get that, a case can be reopened or a new one created. "
        }
    ]
}