{
    "id": "SOLR-9051",
    "title": "Read Solr 4.10 indexes from Solr 6.x",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "This is something I need to look into as part of my $day_job anyway,\nand I've heard that others are interested in this.  There are a lot of people on 4.x (esp 4.10), and providing them an index upgrade path that doesn't involve going through 5x would be nice.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-04-30T11:01:34+0000",
            "author": "Bram Van Dam",
            "content": "Yonik Seeley Are you considering rewriting the index? Or are you merely considering read-only? ",
            "id": "comment-15265289"
        },
        {
            "date": "2016-04-30T16:19:22+0000",
            "author": "Yonik Seeley",
            "content": "Read-only... Just like 6x can read a 5x index (and any new segments are written in the new format), I was investigating if we could get 6x to read 4x w/o rewriting with a 5x index upgrade tool first.  Essentially, provide the normal upgrade experience.\n\nSome thoughts:\n\n\tif the actual index format between 4.10 and 5.0 were pretty much the same, maybe we could just change some version strings or something and everything would \"just work\"... I don't know if this is the case or not.\n\tIf the index format is actually more extensive, we could add back the 4.10 codecs for the support.\n\t\n\t\tthis actually may or may not be trivial... it depends on how the codec interfaces has changed and if those older codecs would still work.\n\t\tThe format of the \"segments\" file itself has changed... not sure if that's fixable purely w/ codecs or not\n\t\n\t\n\n\n\nFor reference, the \"remove 4.x back compat\" commit is: dbe6c7ff052927be10a0a6953686771d788ebda5\nThis also obviously affects text analysis (any token filter components that acted differently depending on the version)... anyone bitten by any of those changes will just have to reindex I guess.  It's a shame we can't keep some of those types of compatibility around longer.\n\nThe 5.0 codec was added in LUCENE-5969\n\nUnfortunately, after reviewing many of the changes, I'm less confident that this is going to be a practical approach. ",
            "id": "comment-15265355"
        }
    ]
}