{
    "id": "SOLR-7858",
    "title": "Make Angular UI default",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [
            "6.0"
        ],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Fixed",
        "priority": "Minor"
    },
    "description": "Angular UI is very close to feature complete. Once SOLR-7856 is dealt with, it should function well in most cases. I propose that, as soon as 5.3 has been released, we make the Angular UI default, ready for the 5.4 release. We can then fix any more bugs as they are found, but more importantly start working on the features that were the reason for doing this work in the first place.",
    "attachments": {
        "original UI link.png": "https://issues.apache.org/jira/secure/attachment/12755694/original%20UI%20link.png",
        "new ui link.png": "https://issues.apache.org/jira/secure/attachment/12755695/new%20ui%20link.png",
        "SOLR-7858.patch": "https://issues.apache.org/jira/secure/attachment/12755697/SOLR-7858.patch",
        "SOLR-7858-fix.patch": "https://issues.apache.org/jira/secure/attachment/12768506/SOLR-7858-fix.patch",
        "SOLR-7858-3.patch": "https://issues.apache.org/jira/secure/attachment/12768478/SOLR-7858-3.patch",
        "SOLR-7858-2.patch": "https://issues.apache.org/jira/secure/attachment/12768477/SOLR-7858-2.patch",
        "SOLR-7858-4.patch": "https://issues.apache.org/jira/secure/attachment/12768482/SOLR-7858-4.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-09-14T09:46:40+0000",
            "author": "Upayavira",
            "content": "patch that adds simple links to old/new UI. ",
            "id": "comment-14743271"
        },
        {
            "date": "2015-09-14T09:50:32+0000",
            "author": "Upayavira",
            "content": "I'm pretty much ready to switch to the Angular UI for 5.4. With the attached patch, I'll add links between the old and new UIs in case people find issues in the new one. I've added an  information link that will, I'm planning, link to a wiki page (not confluence) describing the change between them, asking for people to report issues in the new one.\n\nI am also planning that SOLR-4388 be completed for 5.4, at least a first pass.\n\nI'd appreciate a few votes for this ticket - to tell me that some people have actually played with the new UI rather than just liking the idea!! ",
            "id": "comment-14743281"
        },
        {
            "date": "2015-09-18T10:28:21+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1703801 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1703801 ]\n\nSOLR-7858 Add links between old and new UI ",
            "id": "comment-14805361"
        },
        {
            "date": "2015-09-18T10:28:39+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1703802 from Upayavira in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1703802 ]\n\nSOLR-7858 Add links between old and new UI ",
            "id": "comment-14805363"
        },
        {
            "date": "2015-09-20T20:53:53+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1704193 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1704193 ]\n\nSOLR-7858 Fix info link to point to newly created wiki page ",
            "id": "comment-14900063"
        },
        {
            "date": "2015-09-20T20:54:17+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1704194 from Upayavira in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1704194 ]\n\nSOLR-7858 Fix info link to point to newly created wiki page ",
            "id": "comment-14900064"
        },
        {
            "date": "2015-09-21T09:13:49+0000",
            "author": "Upayavira",
            "content": "Chris Hostetter (Unused) I recall you had suggestions as to how we go about releasing the new UI, but I haven't been able to track them down. Are you able to repeat them here? (in terms of which URLs are used, and for what).\n\nMy proposal would be to leave the current UI as index.html, and have /solr/ point at it, and then move admin.html to original.html, such that /solr/original.html will point to the old UI. ",
            "id": "comment-14900411"
        },
        {
            "date": "2015-09-21T15:30:58+0000",
            "author": "Shawn Heisey",
            "content": "I would like to have the URL seen in the browser include something to make it obvious that it's the admin UI, so users are not tempted to grab the URL in their browser (containing the # character) and use it as a base URL for a client program.  The number of times that I've seen this on the mailing list and the IRC channel is an indication that the users are being easily confused.\n\nHaving something like \"admin#\" or \"admin/#/\" (whatever makes sense for the code) in the URL would likely eliminate that confusion for most people.  Even \"index.html\" in the URL (which the new UI has now) would be helpful, but using the word \"admin\" in some way would be better. ",
            "id": "comment-14900829"
        },
        {
            "date": "2015-09-22T01:22:54+0000",
            "author": "Hoss Man",
            "content": "\nChris Hostetter I recall you had suggestions as to how we go about releasing the new UI, but I haven't been able to track them down. ...\n\nhttp://mail-archives.apache.org/mod_mbox/lucene-dev/201504.mbox/%3Calpine.DEB.2.02.1504301121010.19000@frisbee%3E\n\n\n\nMy suggestion, along the lines of what we did with the previous UI \nchange...\n\n1) ensure that the new UI is fully functional in 5x using an alt path \n(believe this is already true?)\n\n2) add an \"Upgrading\" note to CHANGES.txt for 5.2 directing people to \nthe new \"experimental\" UI and the URL to access it, note that it \nwill likely become the default in 5.3 and users are encouraged to try it \nout and file bugs if they notice any problems.\n\n3) update trunk so that it is the default UI, and make the old UI \navailable at some alternate path (eg \"/solr/old_ui\").  Add an Upgrading \nnote pointing out that the URLs may be slightly different, and how to \naccess the old UI if they have problems\n\n\n\tbackport trunk changes (#3) to 5x for 5.3 (or later if problems/delays\npop up)\n\n\n\nAnd: http://mail-archives.apache.org/mod_mbox/lucene-dev/201504.mbox/%3Calpine.DEB.2.02.1504301414460.19000@frisbee%3E\n\n...\nWe might want to tweak those URLs slightly to be a little less confusing \n... ie \"old.html\" and \"new.html\" (at least until after 5.3) ... i mean, i \njust the paragraph you rwote above, but w/o looking at it i've already \nforgoten if \"index.html\" is hte new one or hte old one.\n\nSo imagine if a 5.2 user has in their browser...\n\n\thttp://localhost:8983/solr/admin.html#/collection1\n\n...and is trying to remember if this is the new one (that they should get \nuse to / help test) or the fuly qualified name of the old one that is \ngoing away.\n\nLikewise imagine if a 5.42 user sees the same URL, and reads a note that \nthe \"old UI\" is going to be removed in 6.0 and is trying to figure out if \nthat affects him.\n\nA few followup comments...\n\na) that \"step 3\" above (changing hte defualt on trunk first) is really important ... you want that change to sit on trunk for a good while, so that devs working on trunk and manually testing things are using the new UI anytime they run stuff on trunk, and helping to find problems – even if no users \"try\" the new UI in the released versions of Solr\n\nb) not sure why i didn't mention it before, but adding a generic header to all of the \"old\" UI pages warning people that they are using the old UI and here is a link to the new UI is something that should definitely be added once the default is changed (it could be added even before the default is changed with ome wording tweaks: \"Please try the new UI..\" vs \"You are looking at the old deprecated UI, please switch to....\") to help reduce the # of bug reports / feature requests we get about the old UI and to reduce user frustration (ie; they see in some future release notes that there is a new collection admin screen, but they can't find it when they load \"the admin UI\" bookmark they have.)\n\n\n\nHaving something like \"admin#\" or \"admin/#/\" (whatever makes sense for the code) in the URL would likely eliminate that confusion for most people. Even \"index.html\" in the URL (which the new UI has now) would be helpful, but using the word \"admin\" in some way would be better.\n\nIn the long term, I don't know if this is will actually help things or decrease novice user confusion (the URLs, when loaded in a browser, is already clearly a UI, will making the UI urls longer really help people notice \"oh hey, maybe this UI based URL isn't a URL that programtic client code should talk to\" ?)  but if this approach is taken it should be very carefully considered in terms of how it impacts \"reserved words\" for things like collection names.\n\nIt's annoying enough if we (in the short term) have reserved paths like \"/old.ui.html\" but if you try to use \"/admin\" as a prefix to indicate that it's for the UI, you'll probably break things like /admin/cores and /admin/collections – let alone the long term impacts of saying something like \"You can't have a collection named 'ui' because of the '/ui'.\" etc... ",
            "id": "comment-14901732"
        },
        {
            "date": "2015-09-22T08:51:38+0000",
            "author": "Upayavira",
            "content": "Thanks Chris Hostetter (Unused) for your rich perspective.\n\nFirstly, to answer your question: yes, the new UI has been in trunk/5x since 5.2. As to whether it has been functional, there are a lot less bugs than there were, although you are right to observe that it needs usage.\n\n= o =\nURLs:\n\nIn your comments you were concerned about how a user would be able to find out which UI they are using and what the purpose of the change is. I've added links at the top right of the old, and new UIs to switch between them, and a  link that points to a wiki page explaining further. I hope this does sufficient in terms of messaging - although your suggestion of a banner saying \"this is the old UI, go try the new one-->\" seems like a good idea.\n\nPersonally, I'd support a redirect from http://localhost:8983/ and http://localhost:8983/solr/ to http://localhost:8983/solr/admin/ and host the entire UI there. You mention the risk of URL overlap, but we already have that issue, in more dangerous ways, with files in the UI using the URL space that end-users access. At least if we switched to /admin/, we would only be in conflict with ourselves, in which case it is infinitely more manageable. And, it is already pretty much a given that 'admin' wouldn't work as a collection name.\n\nI would, however, suggest we keep this for trunk/6.0. As a code change, it is small. As a usability one, it is much bigger.\n\n= o =\n\nBased upon your suggestions, my release proposal and schedule would be:\n\n\t5x already has links between old/new UIs so users of 5.4 will be able to get to the new one easily\n\tThere is also a ? link that points to a wiki page explaining the change and asking for bug reports\n\tAdd a banner saying \"go try the new UI\" on the old one, both in trunk and 5x\n\tChange URLs in trunk straight away so that the new UI is the default (old one as /original-ui.html)\n\tAdd a note in CHANGES.txt for 5.4 stating clearly that it will become default in 5.5.\n\tAssuming no major clangers, for 5.5, change the URLs to make the new default (old one is /original-ui.html)\n\tFor trunk, change the UI to serve from /admin/. Files remain in the same location.\n\n ",
            "id": "comment-14902247"
        },
        {
            "date": "2015-09-22T17:15:13+0000",
            "author": "Noble Paul",
            "content": "As we plan to move to V2 API in 6.0 we plan to not restrict a collection name other that the well known ones (_cluster, _node etc ) . The UI is something that could live in a special dir such as /solr/_admin/index.html or /solr/_ui/index.html. All the other files also must move out of the top level . For instance, js , css and images also move under the path /solr/_admin/ or /solr/_ui/\n\nWe should make these changes in 5x itself and keep redirect rules for old-> new. In 6.0 we should get rid of the rules as well\n ",
            "id": "comment-14903015"
        },
        {
            "date": "2015-09-22T17:45:07+0000",
            "author": "Upayavira",
            "content": "@noble.paul I am unsure who the \"we\" is you are referring to. As I understand it, you and one other have had a private discussion and on the basis of that some public discussion has occurred, without a conclusion as yet. That doesn't, to me, constitute a community wide agreement that the URL structure will be changing according to your proposal, does it?\n\nYour suggestion is not that different to what I have already proposed - that everything (css/etc too) live under /admin, along with the admin APIs. The only URL we need to keep consistent is the /solr/ one, which must redirect somewhere sensible, which could be _admin/ or _ui/ or whatever. ",
            "id": "comment-14903064"
        },
        {
            "date": "2015-09-22T18:42:02+0000",
            "author": "Noble Paul",
            "content": "I am unsure who the \"we\" is you are referring to.\n\n\"we\" means Solr project. If a feature is built and committed, it is a part of the project. \n\nAs I understand it, you and one other have had a private discussion and on the basis of that some public discussion has occurred, without a conclusion as yet.\n\nAren't all features built like that? . one developer coming up with a suggestion and then the interested developers would comment/vote on the idea. \n\nThat doesn't, to me, constitute a community wide agreement that the URL structure will be changing according to your proposal, does it?\n\nThe proposal was for v2 APIs . The idea is to have fewer top level names that could conflict with collection names. \n\nWhat do you mean when you say community wide agreement? I don't think any feature gets all people to vote for it. \n\nYour suggestion is not that different to what I have already proposed - that everything (css/etc too) live under /admin, along with the admin APIs. \n\nYes, we are not suggesting very different things. The reason I prepended an underscore is to avoid conflicts with real collection names. In that aspect /_admin/ is better than admin .\n\n\n ",
            "id": "comment-14903181"
        },
        {
            "date": "2015-10-07T12:03:46+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1707269 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1707269 ]\n\nSOLR-4388 SOLR-7858 SOLR-7666 update CHANGES.txt ",
            "id": "comment-14946743"
        },
        {
            "date": "2015-10-07T12:04:02+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1707270 from Upayavira in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1707270 ]\n\nSOLR-4388 SOLR-7858 SOLR-7666 update CHANGES.txt ",
            "id": "comment-14946746"
        },
        {
            "date": "2015-10-21T03:08:23+0000",
            "author": "Upayavira",
            "content": "Today, whilst giving a private demo of the UI, I spotted some major bugs - for example, the facet/spellcheck/highlighting options on the query pane didn't work.\n\nThis is the sort of thing that needs to be tracked down and found before we switch the new UI to the default, as it will severely impact on user experience if we don't. ",
            "id": "comment-14966168"
        },
        {
            "date": "2015-10-22T03:30:31+0000",
            "author": "Mark Miller",
            "content": "Upayavira, is there a spot that talks about the param we discussed in these comments I'm missing?\n\nAny chance we can create a JIRA issue just for that task and I'll jump on it? ",
            "id": "comment-14968446"
        },
        {
            "date": "2015-10-22T10:27:58+0000",
            "author": "Upayavira",
            "content": "Mark Miller the ticket is here: SOLR-8074 ",
            "id": "comment-14968925"
        },
        {
            "date": "2015-10-24T02:23:08+0000",
            "author": "Upayavira",
            "content": "Patch that adds this \"warning\" message to the top of the new UI, so as to distinguish it more clearly from the original one:\n\n\"This is an experimental UI. Report bugs here. For the old UI click here\" ",
            "id": "comment-14972288"
        },
        {
            "date": "2015-10-24T02:25:30+0000",
            "author": "Upayavira",
            "content": "correct \"warning\" patch ",
            "id": "comment-14972291"
        },
        {
            "date": "2015-10-24T02:27:21+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1710300 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1710300 ]\n\nSOLR-7858 Add a warning message to the angular UI ",
            "id": "comment-14972294"
        },
        {
            "date": "2015-10-24T02:27:57+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1710301 from Upayavira in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1710301 ]\n\nSOLR-7858 Add a warning message to the angular UI ",
            "id": "comment-14972295"
        },
        {
            "date": "2015-10-24T02:44:50+0000",
            "author": "Upayavira",
            "content": "Patch that makes angular UI default in trunk.\n\nBefore committing, another is needed that uses LoadAdminUIServlet to load index.html in 5.x, but doesn't (yet) make it the default. ",
            "id": "comment-14972305"
        },
        {
            "date": "2015-10-24T03:05:16+0000",
            "author": "Upayavira",
            "content": "Patch to make index.html use LoadAdminUIServlet. This gets it ${version} replacement and protection against click-jacking. ",
            "id": "comment-14972321"
        },
        {
            "date": "2015-10-24T03:06:05+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1710303 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1710303 ]\n\nSOLR-7858 Make Angular UI default in trunk ",
            "id": "comment-14972323"
        },
        {
            "date": "2015-10-24T03:06:57+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1710304 from Upayavira in branch 'dev/branches/branch_5x'\n[ https://svn.apache.org/r1710304 ]\n\nSOLR-7858 Switch index.html to use LoadAdminUIServlet on 5x branch ",
            "id": "comment-14972325"
        },
        {
            "date": "2015-10-24T09:53:59+0000",
            "author": "Shalin Shekhar Mangar",
            "content": "The last commit has broken JettyWebappTest which fails 100% of the times with the following:\n\nStack Trace:\njava.lang.NullPointerException\n        at __randomizedtesting.SeedInfo.seed([BF1D2DE333F380A3:87CFCEB054981B1C]:0)\n        at org.apache.solr.client.solrj.embedded.JettyWebappTest.testAdminUI(JettyWebappTest.java:115)\n\n\n\nI believe the attached patch should fix this but I don't know enough about this piece so a review is welcome.\n\nIn future, please be more careful before committing stuff (and be around to watch jenkins for a while!) ",
            "id": "comment-14972509"
        },
        {
            "date": "2015-10-24T11:40:09+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1710333 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1710333 ]\n\nSOLR-7858 Add web.xml changes ",
            "id": "comment-14972539"
        },
        {
            "date": "2015-10-24T11:48:29+0000",
            "author": "Upayavira",
            "content": "More care needed from me.\n\nFirstly, I failed to commit changes to web.xml that were needed, which broke the build.\n\nThen, to fix it, I inadvertently committed changes that aren't ready, along with the web.xml change.\n\nAt least the build is fixed. I will revert the remaining changes soon, and commit them against the correct ticket. ",
            "id": "comment-14972550"
        },
        {
            "date": "2015-10-24T15:26:28+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1710356 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1710356 ]\n\nSOLR-7858 revert premature commit ",
            "id": "comment-14972649"
        },
        {
            "date": "2015-11-03T11:43:38+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 1712260 from Upayavira in branch 'dev/trunk'\n[ https://svn.apache.org/r1712260 ]\n\nSOLR-7858 Make default URL=/ ",
            "id": "comment-14987137"
        },
        {
            "date": "2015-11-03T12:25:59+0000",
            "author": "Upayavira",
            "content": "Notes for reference on tasks to make UI default in 5x:\n\n\n\tmove admin.html to old.html\n\tfix links in index.html to point to old.html\n\tremove \"warning\" message with a 'go to original UI' link\n\tset the ROOT_URL=\"/\" in app.js\n\tupdate web.xml (ref to admin.html, and welcome-file)\n\tprobably more...\n\n ",
            "id": "comment-14987183"
        },
        {
            "date": "2016-03-10T23:49:05+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 937a41489f78aa32efb5e65dcc4e60e9bae19431 in lucene-solr's branch refs/heads/master from Upayavira\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=937a414 ]\n\nSOLR-7858 - update links between new/old UIs for 6.x release ",
            "id": "comment-15190186"
        },
        {
            "date": "2016-03-10T23:50:43+0000",
            "author": "ASF subversion and git services",
            "content": "Commit c18d3521a47727f2c0a4a4455db3cbaf1c6570bd in lucene-solr's branch refs/heads/branch_6_0 from Upayavira\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=c18d352 ]\n\nSOLR-7858 - update links between new/old UIs for 6.x release ",
            "id": "comment-15190191"
        },
        {
            "date": "2016-03-10T23:50:44+0000",
            "author": "ASF subversion and git services",
            "content": "Commit 77d233bc01894c33f02178898dd3368b51902a11 in lucene-solr's branch refs/heads/branch_6x from Upayavira\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=77d233b ]\n\nSOLR-7858 - update links between new/old UIs for 6.x release ",
            "id": "comment-15190192"
        }
    ]
}