{
    "id": "SOLR-2978",
    "title": "Language variable expansion in field names for search results clustering",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [],
        "components": [
            "contrib - Clustering"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "This is a follow-up of SOLR-2939. \n\n\nAnother feature of language recognizer we should mirror is the expansion of the lang token in field names into the language code of the document (in case of multiple languages per document - the first Carrot2-supported language code). The feature seems easy to implement in the non-distributed setting of Solr, but the simple implementation isn't going to work in the distributed setting because the name of the specific field to be fetched depends on the content (language) of each matching document. Looking at the SearchClusteringEngine.getFieldsToLoad(SolrQueryRequest) method, a quick but costly solution would be to load the contents of all stored fields. I'm not too strong in distributed-mode Solr, but maybe this could be optimized so that only the required fields get fetched?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13412148",
            "date": "2012-07-11T22:26:09+0000",
            "content": "bulk fixing the version info for 4.0-ALPHA and 4.0 all affected issues have \"hoss20120711-bulk-40-change\" in comment "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13429755",
            "date": "2012-08-07T03:42:44+0000",
            "content": "rmuir20120906-bulk-40-change "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13445489",
            "date": "2012-08-31T00:14:05+0000",
            "content": "There is no indication that anyone is actively working on this issue, and it has no current patch, so removing 4.0 from the fixVersion. "
        }
    ]
}