{
    "id": "SOLR-4053",
    "title": "metrics - add statistics on searcher/cache warming",
    "details": {
        "affect_versions": "6.0",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "One stat that I rely on is the amount of time that it takes to warm caches and an entire searcher, but unless you turn on INFO logging and write something to parse the logs, you can only see how long the last commit took to warm.  I propose that we use the new metrics capability added in SOLR-1972 to give us visibility into historical cache/searcher warming times.\n\nIf I find some time in the near future, I will take a stab at creating a patch, but if someone else has an idea and time, don't wait around for me.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13494574",
            "date": "2012-11-10T05:59:54+0000",
            "content": "Shawn, arent' warming times already in JMX?  I think they are because I know SPM for Solr has nice pie charts and timeseries graphs with warmup timings broken down, and that must be coming from JMX.\n\nOr perhaps you want the percentiles in JMX?  If so, can't monitoring tools calculate that, shouldn't that be their job? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13494624",
            "date": "2012-11-10T11:19:04+0000",
            "content": "The only thing I've ever done with JMX is remotely connect jconsole to the Solr JVM so I can watch what's going on with heap usage.  I want the percentiles in the admin interface. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-13495895",
            "date": "2012-11-13T03:23:58+0000",
            "content": "I see.  I'm guessing you have a relatively small number of servers, so watching heap like this is OK.  As clusters grow, using tools that provide both aggregate views as well as individual server (and various metrics like the JVM heap) views become a necessity. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13495926",
            "date": "2012-11-13T04:15:51+0000",
            "content": "We have four servers.  Each distributed index is seven total shards on two servers. Our query volume is low enough that the only reason we have two copies of the index is so we can survive a hardware failure. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636746",
            "date": "2013-04-19T19:13:02+0000",
            "content": "Alan Woodward has filed SOLR-4735 to update the metrics reporting.  I am wondering whether this issue makes sense.  I use the percentile information for QTime often, and having a historical view of warming times without setting up a complete separate monitoring solution would be VERY useful. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717256",
            "date": "2013-07-23T18:47:38+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971005",
            "date": "2014-04-16T12:56:52+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}