{
    "id": "SOLR-6015",
    "title": "managed synonyms don't gracefully handle lowercasing",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I've been having bad luck testing new functionallity lately - the first thing I try never works \n\n\n/opt/code/lusolr48/solr/example/solr/collection1/conf$ curl -XPUT \"http://localhost:8983/solrsis/synonyms/english\"   -H 'Content-type:application/json'   --data-binary '{\"MB\":[\"MiB\",\"Megabyte\"]}'\n{\n  \"responseHeader\":{\n    \"status\":500,\n    \"QTime\":3},\n  \"error\":{\n    \"msg\":\"Bad Request\",\n    \"trace\":\"Bad Request (400) - Unsupported value null for mb; expected single value or a JSON array!\\n\n[...]\n\n\n\nI finally figured out that if I lowercased \"MB\" to \"mb\", then it works as expected.\nAlso, it looks like because ignoreCase is true in the initArgs, everything is stored as lower case in the managed map (losing information).  Ideally case would be preserved in the synonym file (esp if one wanted to change ignoreCase either way).  I imagine stopwords may have the same issue, but I haven't checked.",
    "attachments": {
        "SOLR-6015.patch": "https://issues.apache.org/jira/secure/attachment/12643850/SOLR-6015.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Timothy Potter",
            "id": "comment-13992248",
            "date": "2014-05-07T21:30:16+0000",
            "content": "Here's a patch that addresses the issue with MB vs. mb and handles ignoreCase setting better (I think). Would appreciate some feedback on this before committing.\n\nThe main change here is that I'm preserving case using an inner class named CasePreservingSynonymMappings regardless of the ignoreCase setting. Here's an example of how that looks at runtime:\n\n{ \n  \"mb\" : \n{\n    \"MB\":[\"Megabyte\",\"MiB\"],\n    \"mb\":[\"megabyte\"]\n  }\n}\n\nThus, the ignoreCase setting isn't applied on store, rather it is applied when the managed synonym mappings data is \"viewed\". For instance, a get request for the \"MB\" child with ignoreCase==true would yield a merged list, such as:\n\n\"MB\":[\"Megabyte\",\"MiB\",\"megabyte\"]\n\nThis brings me to my first question. Should we only return one form when mappings overlap as is the case with \"Megabyte\" and \"megabyte\"? Right now, it returns both forms but with ignoreCase==true, maybe it should return only one of those? Again this is a view and both are stored so if you switch ignoreCase, then there's no information lost.\n\nIf ignoreCase is false and you request the mappings for \"MB\", then you just get:\n\n\"MB\":[\"Megabyte\",\"MiB\"]\n\nIt follows that if ignoreCase == false and the client asks for \"Mb\", then they get a 404.\n\nThe second question is about switching the ignoreCase setting, which the API allows. The previous code used to rebuild the map, but now that's not needed since we store the data as it was added and only apply the ignoreCase setting when the data is viewed. Am I overlooking something here?\n\nLastly, you'll notice I'm applying the ignoreCase setting in the ManagedSynonymParser, which is done to match the behavior of the current SynonymMap parser/builder. I've compared the results of the text analysis performed by the existing SynonymFilterFactory and the ManagedSynonymFilterFactory and they create the same tokens.\n "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13993017",
            "date": "2014-05-08T19:00:11+0000",
            "content": "Tim,\n\nThe approach looks great - cool that all ignoreCase changes are now supported.\n\nTwo things I noticed:\n\n\n\tOne optimization you might consider in CasePreservingSynonymMappings.getMappings(): in the (very likely overwhelmingly ordinary) case of only one cased version of a key, you could just return the mappings from CasePreservingSynonymMappings rather than copying them to a new map, since no merging will be required.\n\tYou can drop the overridden ManagedSynonymFilterFactory.updateInitArgs(), since it just calls the superclass method of the same name (after validating params, which the superclass method also does).\n\n\n "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14006211",
            "date": "2014-05-22T18:03:38+0000",
            "content": "Commit 1596928 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1596928 ]\n\nSOLR-6015: improved strategy for handling managed synonyms when ignoreCase=true "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14032730",
            "date": "2014-06-16T18:25:04+0000",
            "content": "Commit 1602948 from Timothy Potter in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1602948 ]\n\nSOLR-6015: Backport fixes from trunk to branch_4x. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-14032734",
            "date": "2014-06-16T18:28:09+0000",
            "content": "Commit 1602950 from Timothy Potter in branch 'dev/trunk'\n[ https://svn.apache.org/r1602950 ]\n\nSOLR-6015: Moving change note to 4.9 bugfix section. "
        }
    ]
}