{
    "id": "SOLR-505",
    "title": "Give RequestHandlers the possiblity to suppress the generation of HTTP caching headers",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.3"
        ],
        "components": [
            "search"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "The code from SOLR-127 emits HTTP cache headers for all handlers if configured. We should not emit cache related headers for update request handlers. Partial responses (coming from the Timeout request stuff) should not be cached as well.\n\nTo solve this problem we can simply add two methods to the SolrQueryResponse class (like void setAvoidHTTPCaching(boolean) and boolean isAvoidHTTPCaching() - the default for the value would be false). The update request handlers should set this to true all the time. The partial response stuff can set this to true as well.",
    "attachments": {
        "SOLR-505.patch": "https://issues.apache.org/jira/secure/attachment/12378126/SOLR-505.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Thomas Peuss",
            "id": "comment-12579860",
            "date": "2008-03-18T14:21:06+0000",
            "content": "Draft version of a patch. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-12579867",
            "date": "2008-03-18T14:33:40+0000",
            "content": "+1 on the general approach.\nDistributed search will probably need to avoid caching as well. "
        },
        {
            "author": "Thomas Peuss",
            "id": "comment-12579918",
            "date": "2008-03-18T16:47:02+0000",
            "content": "BTW: The patch uses avoidHttpCaching=true as default as this is the safer approach. The patch only set this to false for the search handlers. "
        },
        {
            "author": "Sean Timm",
            "id": "comment-12580070",
            "date": "2008-03-18T20:42:31+0000",
            "content": "Should errors be cached?  Certainly some are transient and shouldn't be.\n\nIn the SolrDispatchFilter,\n\nif( solrRsp.getException() != null ) {\n    sendError( (HttpServletResponse)response, solrRsp.getException() );\n}\n\n\nthe Expires and Cache-Control headers could be reset as in HttpCacheHeaderUtil.checkAvoidHttpCaching(...). "
        },
        {
            "author": "Thomas Peuss",
            "id": "comment-12580718",
            "date": "2008-03-20T10:18:02+0000",
            "content": "\n\tUpdated to trunk\n\tEmits no-cache headers in case of exceptions\n\n "
        },
        {
            "author": "Thomas Peuss",
            "id": "comment-12598683",
            "date": "2008-05-21T15:22:34+0000",
            "content": "Any further comments on this? Good enough? "
        },
        {
            "author": "Sean Timm",
            "id": "comment-12598751",
            "date": "2008-05-21T19:00:21+0000",
            "content": "It worked well for me.  I'd like to see it included in 1.3. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12598884",
            "date": "2008-05-22T01:48:44+0000",
            "content": "Yes, I think we should get this in 1.3.\nI took a quick look at the patch and saw this:\n\n\nrsp.setAvoidHttpCaching(false);\n\n\nAm I the only one who has a harder time reading negative methods like this, esp. when they take false?\nWould it not be nicer to just have:\n\nrsp.setHttpCaching(true/false);\n\nor even\n\nrsp.httpCachingOn() + rsp.httpCachingOff()\n\n\nSimilarly, instead of \n\nisAvoidHttpCaching()\n\n have \n\nisHttpCachingOn()\n\n\nI know this is \"just naming\", but I think it helps with readability a bit.\n\nI notice the unit test mods are not in the patch.  Is there no need to test the modified behaviour? "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12598891",
            "date": "2008-05-22T03:14:48+0000",
            "content": "Thomas - just to make it more obvious - it looks like Sean Timm included your patch in SOLR-502, so I will look at patches provided with SOLR-502 instead of expecting code/patch changes here under SOLR-505.  I hope that's OK and that it simplifies things. "
        },
        {
            "author": "Thomas Peuss",
            "id": "comment-12598951",
            "date": "2008-05-22T09:02:54+0000",
            "content": "I don't think that is a good idea to include the patch for SOLR-505 with the patch for SOLR-502. Sean included it only because he depends on the code changes we do with SOLR-505.\n\nI would like to see the following:\n\n\tRework SOLR-505 like Otis mentioned. As we only change the \"naming\" and not the overall approach I am fine with that. I can do that tomorrow.\n\tCommit SOLR-505\n\tRework SOLR-502 to use the changed API and to be compatible with trunk\n\tCommit SOLR-505\n\n\n\nSOLR-505 and SOLR-502 have different goals. So combining them makes no big sense to me and might confuse people. "
        },
        {
            "author": "David Smiley",
            "id": "comment-12598990",
            "date": "2008-05-22T12:20:37+0000",
            "content": "Otis, I completely agree with your comment on the naming.  It's a bit odd.  I was thinking the same thing before your comment and I should of said something too; don't know why I didn't. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12599060",
            "date": "2008-05-22T15:50:59+0000",
            "content": "Thomas - very much fine with me.  I, too, was wondering why Sean incorporated your patch in his, but assumed you guys had a deal of some kind (e.g. perhaps you were colleagues working in sync).\nI'll wait for the new patch, commit, resolve this issue and then I'll move over to SOLR-502 and wait for Sean to make a new and clean patch for that timeout functionality. "
        },
        {
            "author": "Thomas Peuss",
            "id": "comment-12599449",
            "date": "2008-05-23T17:56:52+0000",
            "content": "\n\tReworked naming like Otis suggested\n\tSome other minor changes\n\tAdded tests to check the new code (this was the hardest part)\n\n "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12599510",
            "date": "2008-05-23T21:12:34+0000",
            "content": "Danke, Thomas.\n\nCommitted revision 659657. "
        }
    ]
}