{
    "id": "SOLR-7898",
    "title": "Administrative Interface Should Steam Incoming Queries and Results Per Core",
    "details": {
        "components": [
            "Admin UI"
        ],
        "type": "New Feature",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Closed",
        "resolution": "Won't Fix",
        "priority": "Minor"
    },
    "description": "It would be helpful for debugging purposes (and kind of cool) to see the queries coming into Solr and the results found for each in a tail -f style streaming interface on the administrative web site. I'm pretty sure this information is logged anyway...",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-07T08:34:57+0000",
            "author": "Jan Høydahl",
            "content": "This may be too sensitive info to put in our admin as long as it is open to everybody. And in many cases the queries coming in to Solr will be different from and less interesting than the queries entered in the User's search application. That's perhaps why most people implement search analytics logging on the application level (their web front end) instead of at solr-level. ",
            "id": "comment-14661506"
        },
        {
            "date": "2016-08-03T15:40:58+0000",
            "author": "Alexandre Rafalovitch",
            "content": "With latest Solr's default configurations, overrides, property sets, etc, the only place the real query is known is deep within the bowls of Solr after everything is resolved. And it is logged in some fashion if appropriate TRACE is enabled.\n\nAnd if that's enabled, the output goes to the log, which is displayed in the Admin UI.\n\nSo, I think there is not much for the Admin UI specifically here.\n\nWhat would be nice is to have somehow a debugging component that will log a final query in a way that shows all the layers contributing to it. But that would be a very different JIRA.\n\nThis one, I believe, can be closed. ",
            "id": "comment-15406087"
        }
    ]
}