{
    "id": "SOLR-8636",
    "title": "Incorrect distance returned for indexed polygon shapes",
    "details": {
        "components": [
            "spatial"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "5.2.1",
        "status": "Closed",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "We have a location_rpt field with multivalued=true and we are indexing multiple shapes of type LINESTRING() in a single spatial field per document. We are using JTS for spatial and polygon indexing and filtering.\n\nSolr query:\nq=\n{!geofilt sfield=geo pt=-27,153 score=distance d=50}\n&fl=*,score\n\nFor above query, we get the results perfectly fine (i.e. documents with at least one intersecting shape is returned) but the returned distance has following behavior:\n1. When only shapes (LINESTRING(), LINESTRING()) are indexed then the distance returned is 180 degrees or 20015.115 kms.\n2. When only points are indexed then the distance to nearest point is returned.\n3. When both points and shapes are indexed, distance to nearest point is returned.\n\nUsing above distance in sorting causes sorting to go haywire.\n\nDoes Solr not return the distance it used during document filtering? Is there a workaround or am I doing something wrong?",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-02-03T15:22:46+0000",
            "author": "David Smiley",
            "content": "Hello Rahul.  I will clarify this issue in the reference guide right after I comment here.  Filtering and distance sorting are quite separate; they don't know about each other and for many cases, filtering doesn't even compute the distance any way, and so there's no lost optimization opportunity here either.\n\nThe score=distance (or other distance-like options) is intended for indexing either points in RPT, or boxes (rectangles) with BBoxField.  For that it works.  If you index non-point data in RPT, the results will be erroneous.  Presently there is no point-to-nonpoint shape (e.g. polygon or linestring) distance sorting.  FWIW there's the opportunity for that with come cool stuff in Lucene's Geo3D module but there's some work to get that into place.  I'm actually working on steps to enable Geo3D in Solr on the Spatial4j side right now, and then it'd be a separate issue to add Geo3D enabled distance sorting.\n\nI decided to close this as it's a misunderstanding of the intention of what's there right now.  On the other hand, I think it would be a separate issue (feature not bug) mentioning Geo3D to implement what you're looking for. ",
            "id": "comment-15130544"
        }
    ]
}