{
    "id": "SOLR-825",
    "title": "The ConstantScore family of queries does not work with highlighting",
    "details": {
        "affect_versions": "1.3",
        "status": "Closed",
        "fix_versions": [
            "1.4"
        ],
        "components": [
            "highlighter"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Would be nice to be able to highlight range, wildcard, prefix queries again. LUCENE-1424, LUCENE-1425, updating Lucene jars, and a patch from this issue, will get us there.",
    "attachments": {
        "SOLR-825.patch": "https://issues.apache.org/jira/secure/attachment/12407096/SOLR-825.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Mark Miller",
            "id": "comment-12697945",
            "date": "2009-04-10T19:37:16+0000",
            "content": "With LUCENE-1424 and 1425 committed, I think this is now possible with Solr. It will only work with the Phrase Highlighter, but thats probably the highlighter you should be using anyway (highlighting phrases properly is nice and expected, and its not any slower for non phrase highlighting).\n\nStill need a  patch and a Lucene jar upgrade though. I will be happy to see highlightable wildcard/range queries again. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12703472",
            "date": "2009-04-28T01:24:09+0000",
            "content": "I've worked out most of this, but there is an issue that I have to fix in the Lucene highlighter first, so its this will have to wait for that (working on it) and another Lucene jar update. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12705338",
            "date": "2009-05-02T22:49:20+0000",
            "content": "Still needs some tests and a Lucene highlighter jar update, but this will do it. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-12705344",
            "date": "2009-05-02T23:27:45+0000",
            "content": "a little null pointer fix and a couple tests from Hoss in one of the related issues (with a new arg to enforce multi term expanding with the span highlighter) "
        },
        {
            "author": "Grant Ingersoll",
            "id": "comment-12775560",
            "date": "2009-11-10T15:51:49+0000",
            "content": "Bulk close for Solr 1.4 "
        }
    ]
}