{
    "id": "SOLR-8873",
    "title": "Enforce dataDir/instanceDir/ulogDir to be paths that contain only a controlled subset of characters",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Resolved",
        "resolution": "Won't Fix",
        "priority": "Major"
    },
    "description": "We currently support any valid path for dataDir/instanceDir/ulogDir. I think we should prevent special characters and restrict to a subset that is commonly used and tested.\nMy initial proposals it to allow the Java pattern: \n\n\"^[a-zA-Z0-9\\\\.\\\\ \\\\\\\\\\\\-_/\\\"':]+$\"\n\n but I'm open to suggestions. I'm not sure if there can be issues with HDFS paths (this pattern does pass the tests we currently have), or some other use case I'm not considering.\nI also think our tests should use all those characters randomly.",
    "attachments": {
        "SOLR-8873.patch": "https://issues.apache.org/jira/secure/attachment/12794548/SOLR-8873.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2016-03-21T17:34:59+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Here is an initial proposal. Again, I'm not 100% sure that this will not break valid use cases, probably the pattern needs to be expanded. \nFor example, the pattern would not accept accented characters, and since this is checking the absolute path, tests would not pass if your lucene-solr root is on an unsupported path ",
            "id": "comment-15204702"
        },
        {
            "date": "2016-03-25T21:46:39+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Any thoughts on this? I'm pretty sure someone must think this is wrong/useless or that the pattern should be changed, I'd like to hear their opinions. Otherwise I'll just go ahead with this patch.\nOne thought is that I could also leave the door open for changing the pattern if someone needs it (for example, by a system property) in case this really breaks someone's use case. ",
            "id": "comment-15212460"
        },
        {
            "date": "2016-04-04T20:31:42+0000",
            "author": "Jan Høydahl",
            "content": "Is this motivated from real life problems? What bugs do you expect as long as people use legal file names from Javas point of view? In Norway we have the special characters æøå and other countries have other characters they may want to use in a folder name. Why disallow if there is no problem? ",
            "id": "comment-15224995"
        },
        {
            "date": "2016-04-04T21:01:42+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Thanks for your comments Jan Høydahl\nWith this change I'd like to address two things: \n\n\tMake sure none of our features will break due to some unexpected character in the path by adding tests.\n\tPrevent special characters that could cause unexpected behavior either in our UI or third party software.\n\n\n\nIn Norway we have the special characters æøå...\nThat is exactly what I'm NOT trying to prevent (although my proposed regexp does), but things like C:/opt/foo=bar('1','*')\nYes, someone needs admin rights to create a collection with that path, but my rationale is: since I don't think those characters are needed in real situations, why support them? Maybe we can go the other way and just block some characters, but testing will be more difficult. ",
            "id": "comment-15225043"
        },
        {
            "date": "2016-04-04T22:19:34+0000",
            "author": "Jan Høydahl",
            "content": "If there is no examples of how an arbitrary, legal, file path can harm Solr, I see no reason to restrict our users.\nThe uploaded patch checks for validity after .toAbsolutePath().toString(), meaning it demands that the full absolute path conforms. What if someone have installed Solr in C:\\Program Files (x86)\\solr, then after an upgrade Solr won't start?\nLet us not enforce restrictions until we see evidence of actual issues, with SOLR-8725 fresh in mind.. ",
            "id": "comment-15225178"
        },
        {
            "date": "2016-04-04T23:03:46+0000",
            "author": "Shawn Heisey",
            "content": "Let us not enforce restrictions until we see evidence of actual issues, with SOLR-8725 fresh in mind..\n\n+1\n\nEnforcing collection/core/shard names will take care of this issue for most users ... and if a user really wants to have strange filenames, it shouldn't matter, as long as Java and the config files can handle the characters. ",
            "id": "comment-15225231"
        },
        {
            "date": "2016-04-04T23:23:13+0000",
            "author": "Yago Riveiro",
            "content": "Restrict choices without any evidence of issues is halfway to people start questioning (like me) why the enforcing was done.  ",
            "id": "comment-15225253"
        },
        {
            "date": "2016-04-05T23:28:44+0000",
            "author": "Jan Høydahl",
            "content": "Tomás Fernández Löbbe I understand your concern to harden Solr wrt unexpected user input in various ways.\nPerhaps this issue could be re-targeted to adding test coverage including weird file/path names for dataDir/instanceDir/ulogDir, so we validate that Solr actually handles them well, or alternatively learn where we can improve? ",
            "id": "comment-15227353"
        },
        {
            "date": "2016-04-06T17:18:09+0000",
            "author": "Mark Miller",
            "content": "Prevent special characters that could cause unexpected behavior either in our UI or third party software.\n\nI really don't think we should put any effort into this. It's really up to UI's and third party software to properly convert and escape anything that would be bad for them. We cannot try and keep all the data that Solr can expose in compicance with arbitrary external systems.\n\nAlso, you can plug in alternate directory factories - I don't think we want to do any general limiting of the paths that can be used. ",
            "id": "comment-15228677"
        },
        {
            "date": "2016-04-06T17:45:07+0000",
            "author": "Tomás Fernández Löbbe",
            "content": "Thanks for the comments. I understand the concerns, and I have the same myself, use cases may be too wide to know \"which characters\" are really necessary under different circumstances.\nRegarding testing, we could at least add some random special characters like whitespaces to our dirs to make sure we cover those cases. ",
            "id": "comment-15228724"
        }
    ]
}