{
    "id": "SOLR-10670",
    "title": "[ref-guide] Various top-bar fixes",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Improvement",
        "fix_versions": [
            "6.6",
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Closed"
    },
    "description": "A few suggestions for the new ref-guide HTML format:\n\n\n\tFavicon is not displayed, image missing in folder\n\tTopnav link to community should point to http://lucene.apache.org/solr/community.html\n\tReplace \"Solr News\" link with a \"Solr Website\" link - we should link to the website\n\tInstead of pointint the Source Code link to cryptic apache GIT, point to https://lucene.apache.org/solr/community.html#version-control where people get more context and can also find the GitHub link",
    "attachments": {
        "SOLR-10670.hoss.patch": "https://issues.apache.org/jira/secure/attachment/12867838/SOLR-10670.hoss.patch",
        "SOLR-10670.patch": "https://issues.apache.org/jira/secure/attachment/12867539/SOLR-10670.patch",
        "SOLR-10670-home.patch": "https://issues.apache.org/jira/secure/attachment/12867592/SOLR-10670-home.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-05-11T10:10:26+0000",
            "content": "Patch ",
            "author": "Jan Høydahl",
            "id": "comment-16006188"
        },
        {
            "date": "2017-05-11T10:16:34+0000",
            "content": "Also, page title is Apache Solr Reference Guide | Apache Solr Reference Guide which looks weird. This will be the default name of bookmarks, so I suggest adding Solr version number as part of title. That way you see from the title which guide it is, e.g. So, using exact same title as the title in the top-bar: Solr Ref Guide 7.0? Alternatively Apache Solr 7.0 Reference Guide\n\nedit: Ah, I see why now in the source \n\n<title>{{ page.title }} | {{ site.site_title }}</title>\n\nSo the problem is that page.title for index.adoc is \"Apache Solr Reference Guide\"...\nPerhaps we could modify BuildNavAndPDFBody.java to override \"title\" variable for this page? And also modify the variable site_title to include version, so we instead display something like Home | Solr Reference Guide 7.0 ",
            "author": "Jan Høydahl",
            "id": "comment-16006198"
        },
        {
            "date": "2017-05-11T13:44:26+0000",
            "content": "+1 to adding the favicon, I was going to get to that before release.\n\nThe other link changes are fine with me if folks think they are preferable. Go for it, as we say \n\nAs for the title...The html file is built after BuildNavandPDFBody.java is run. That script develops the data files to populate the sidenav and also the file that is used to make a single page for PDF generation. I think it would be too much \"magic\" to have a script that overwrites the title of any page. Say someday in the future we decide to change the page, who's going to remember exactly why we have a file named index.adoc that declares it's title as \"Apache Solr Reference Guide\" but appears online as \"Home\"? I'd like to minimize the # of leaps people need to make in order to figure out what's going on, where possible. And some of us don't know Java so can't just hop into Java files to figure out why certain things are happening.\n\nIf what you prefer is that it appear something like Home | Apache Solr Reference Guide 7.0, then I think it would be best just to make the page title in index.adoc \"Home\". However, that means the PDF would have a page named \"Home\" for the first page, which doesn't feel right to me. \n\nUnless we can come up with a page name that is short, descriptive for bookmarks, and works in both formats, there is a possible other option, that I have not tried yet, which is to add an ifdef statement that changes the title for the PDF. That would evaluate if the page is being generated for the PDF version, and if so, apply a different title. That would go in index.adoc so anyone looking at it will see why we are doing that (we can add a comment to explain). I will give this a try now to see if that solves it for us. ",
            "author": "Cassandra Targett",
            "id": "comment-16006443"
        },
        {
            "date": "2017-05-11T15:02:56+0000",
            "content": "I figured out a way to make it all work the way we want...\n\nFirst, index.adoc is going to have to be a \"special\" page, with some special rules. Hopefully comments in the right places will make it clear to all of us in the future what's going on.\n\nI set two new attributes to index.adoc at the top:\n\n\tI removed the = Apache Solr Reference Guide at the top and replaced it with :doctitle: Home. This sets the document title to Home but it will get treated different by the asciidoc preprocessor (see this issue for how I got the idea: https://github.com/asciidoctor/asciidoctor-pdf/issues/95). This is totally valid syntax, so doesn't cause either Jekyll or asciidoc-pdf to complain.\n\tI added a new attribute :page-displayname: Apache Solr Reference Guide\n\n\n\nNext I added a conditional statement to index.adoc as follows:\n\n\nifdef::backend-pdf[:notitle:]\nifdef::backend-pdf[]\n= {page-displaytitle}\nendif::[]\n\n\n\nThat says, if it's a PDF, don't set the document title (that :doctitle: attribute). Instead, use the page-displaytitle attribute (\"Apache Solr Reference Guide\"). In the PDF that's generated, the user doesn't see \"Home\" - only \"Apache Solr Reference Guide\" in TOC and page title. We could call this something else if desired. \n\nFor the HTML page, if we set the page title to \"Home\" with something like = Home, then the first thing the user would see at the top of the page is \"Home\", which is bad. So I added a conditional to page.html where that title is set to use the page-displaytitle instead:\n\n\n<div class=\"post-header\">\n   {% if page.title == \"Home\" %}\n   <h1 class=\"post-title-main\">{{ page.displaytitle }}</h1>\n   {% else %}\n   <h1 class=\"post-title-main\">{{ page.title }}</h1>\n   {% endif %}\n</div>\n\n\n\nNow what happens is that the HTML page is generated with metadata that defines Home | Apache Solr Reference Guide as the title, but displays \"Apache Solr Reference Guide\" on the page.\n\nThis all seems to work fine - nothing complains during build. I'll attach a patch so you can see it for yourself. ",
            "author": "Cassandra Targett",
            "id": "comment-16006593"
        },
        {
            "date": "2017-05-11T22:32:10+0000",
            "content": "That was a smart move \n\nI improved on it somewhat more by adding a conditional <head><title> too in head.html, which simplifies the header title of the home page even more:\n\n{% if page.title == \"Home\" %}\n<title>{{ site.site_title }}</title>\n{% else %}\n<title>{{ page.title }} | {{ site.site_title }}</title>\n{% endif %}\n\n\n\nI built a guide with all these changes which can be previewed at http://cominvent.com/solr-refguide/. New patch attached.\n\nBut now the text above the left-hand menu is \"Home\", which I guess is fine if it was clickable, but it is not. So then perhaps it should say something else? ",
            "author": "Jan Høydahl",
            "id": "comment-16007311"
        },
        {
            "date": "2017-05-12T09:19:12+0000",
            "content": "Another patch attached\n\n\n\tMakes \"Home\" sidebarTitle clickable\n\tModifies style of li.sidebarTitle to align with the levels below\n\tMoved solr-sunOnly-small.png into images/ folder (not tested with PDF yet OK)\n\n\n\nNow the \"Home\" on top of sidebar will be highlighted on the frontpage, and when another page is selected, the \"Home\" will remain on top with a grey background, clickable as any other sidebar element. Think it looks ok. See updated http://cominvent.com/solr-refguide/ ",
            "author": "Jan Høydahl",
            "id": "comment-16007841"
        },
        {
            "date": "2017-05-12T13:11:17+0000",
            "content": "Now the \"Home\" on top of sidebar will be highlighted on the frontpage, and when another page is selected, the \"Home\" will remain on top with a grey background, clickable as any other sidebar element. \n\nI don't think this works well - it looks like the title of the sidebar, and I wouldn't think it was supposed to be clickable if I didn't know it was from reading this ticket.\n\nIt could be like it was - \"Apache Solr Reference Guide\", which we could hard code into that spot  - but another option is to use some of what you've done to integrate it into the sidebar but change it to be a title for the sidebar that reads something like \"Topics Covered\" or similar heading. Personally I'd prefer to just make it a bit of white space - a sidebar doesn't need a title, and the action of getting home is  already accomplished by the \"Solr Ref Guide\" link in the top navigation. We really don't need another clickable avenue right below it, IMO.\n\nedit: I meant I don't think it works well - missed the \"don't\" ",
            "author": "Cassandra Targett",
            "id": "comment-16008103"
        },
        {
            "date": "2017-05-12T19:34:56+0000",
            "content": "I feel like maybe you guys are overcomplicating things \n\nPersonally, i don't see any advantage in having \"Home\" in the title tag (or anywhere else in the guide) so why not keep things simple?\n\nAttaching a patch with my own personal strawman...\n\n\n\tfix the topnav links as jan suggested\n\tfix the favicon path (although we actaully need to copy it still, not in patch)\n\tmake the template ignore the page name if the page.shortname == \"index\"\n\n\n\nso for the index.html the title is \"Apache Solr Reference Guide X.Y\" for every other page it's \"Page Name | Apache Solr Reference Guide X.Y\" and we don't have to have any special variables/title in index.adoc, we can change it's page.title anytime we want.\n\ni would suggest discussions about sidebar changes be punted to their own issue? ",
            "author": "Hoss Man",
            "id": "comment-16008605"
        },
        {
            "date": "2017-05-12T21:31:18+0000",
            "content": "Yeah, your approach is way simpler and solves all problems initially described.\n\nI'll commit this and we can work on the other changes (moving the footer icon, etc.) in another commit. ",
            "author": "Cassandra Targett",
            "id": "comment-16008714"
        },
        {
            "date": "2017-05-12T22:31:49+0000",
            "content": "Nice optimization Hoss. Let's go! ",
            "author": "Jan Høydahl",
            "id": "comment-16008834"
        },
        {
            "date": "2017-05-13T00:07:00+0000",
            "content": "Commit 4f93056ce71912848fabf3e359c5b6e8aa3953b8 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4f93056 ]\n\nSOLR-10670: fix browser bar name; add some padding for DRAFT note; add favicon ",
            "author": "ASF subversion and git services",
            "id": "comment-16008947"
        },
        {
            "date": "2017-05-13T00:08:18+0000",
            "content": "Commit ee70e1e4c15d3cc5cb0efca4b78a7575d8300ca8 in lucene-solr's branch refs/heads/branch_6x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=ee70e1e ]\n\nSOLR-10670: fix browser bar name; add some padding for DRAFT note; add favicon ",
            "author": "ASF subversion and git services",
            "id": "comment-16008948"
        },
        {
            "date": "2017-05-13T00:08:50+0000",
            "content": "Commit 4b93c62d244408902dd91492a797feadf731a3f4 in lucene-solr's branch refs/heads/branch_6_6 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=4b93c62 ]\n\nSOLR-10670: fix browser bar name; add some padding for DRAFT note; add favicon ",
            "author": "ASF subversion and git services",
            "id": "comment-16008950"
        },
        {
            "date": "2017-05-15T13:23:21+0000",
            "content": "I intend to do one more change on this issue, which is to move the icons into the images directory where they should have been to begin with. I won't attach a patch, because it's just moving a couple files and updating paths.\n\nThen I think we will have covered all the things that came up initially, besides the sidebar stuff but I think that grew out of figuring out where to put \"Home\", which since it doesn't exist isn't a problem  I'm sure there are styling things we can do to the sidebar to make it better - Hoss & I only took it as far as \"good enough\". Let's take those up in a separate issue, though. ",
            "author": "Cassandra Targett",
            "id": "comment-16010503"
        },
        {
            "date": "2017-05-15T13:39:31+0000",
            "content": "Commit a1078143eddadf40c275594e335e063eacfc6e93 in lucene-solr's branch refs/heads/master from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=a107814 ]\n\nSOLR-10670: move logo and background images & fix paths ",
            "author": "ASF subversion and git services",
            "id": "comment-16010525"
        },
        {
            "date": "2017-05-15T13:40:14+0000",
            "content": "Commit 2bb7b2734982b361af25502b83b854d1a34e0dc1 in lucene-solr's branch refs/heads/branch_6x from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=2bb7b27 ]\n\nSOLR-10670: move logo and background images & fix paths ",
            "author": "ASF subversion and git services",
            "id": "comment-16010526"
        },
        {
            "date": "2017-05-15T13:40:32+0000",
            "content": "Commit 663fd9b32dd173076824f1cd6cd575ccbaa29a22 in lucene-solr's branch refs/heads/branch_6_6 from Cassandra Targett\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=663fd9b ]\n\nSOLR-10670: move logo and background images & fix paths ",
            "author": "ASF subversion and git services",
            "id": "comment-16010528"
        }
    ]
}