{
    "id": "SOLR-9841",
    "title": "Disable expiration processor commits",
    "details": {
        "components": [
            "SolrCloud"
        ],
        "type": "Bug",
        "labels": "",
        "fix_versions": [],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "http://lucene.472066.n3.nabble.com/Adding-DocExpirationUpdateProcessorFactory-causes-quot-Overlapping-onDeckSearchers-quot-warnings-td4309155.html\n\nNeed a way to have document expiration update processor not trigger additional commits.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2016-12-09T23:51:40+0000",
            "author": "Brent Pearson",
            "content": "http://lucene.472066.n3.nabble.com/Adding-DocExpirationUpdateProcessorFactory-causes-quot-Overlapping-onDeckSearchers-quot-warnings-td4309155.html\n\nNeed to create a Jira issue, so I can submit a patch to disable commits from the doc expiration update processor. ",
            "id": "comment-15736723"
        },
        {
            "date": "2016-12-09T23:53:12+0000",
            "author": "Brent Pearson",
            "content": "hmmm... maybe this... is a Jira issue? Pretty unclear, having the menu item titled \"Create Service Desk Request\" when you're told to create a Jira issue... ",
            "id": "comment-15736728"
        },
        {
            "date": "2016-12-10T00:12:55+0000",
            "author": "Hoss Man",
            "content": "From my mailing list reply...\n\n\nThe fact that there is no option prevent any commit at all was a concious \nchoice:\n\na) the processor is basically useless unless something does a commit – \nthere's no point in doing deletes every 30 seconds if we only want to \nbother having a new searcher every 60 seconds – it just means we're doing \ntwice the work w/o any added benefit.\n\nb) a softCommit+openSeacher is a No-Op unless there is soemthing to actauly commit. (see SOLR-5783 and TestIndexSearcher.testReopen)\n\n\n...there is no value add in a new option to prevent the commit from being fired – it won't do anything unless there is something to commit.\n\nIf DocExpirationUpdateProcessorFactory users want commits to happen less frequently, then they can change the autoDeletePeriodSeconds to be less frequent, because by definition there is no utility in a low autoDeletePeriodSeconds value unless searchers are being re-opened with the same frequency.\n\n\n\nmaybe this... is a Jira issue? Pretty unclear, having the menu item titled \"Create Service Desk Request\" when you're told to create a Jira issue...\n\nsigh.  yes you did in fact create a jira issue – aparently jira was upgraded recently and the term \"Issue\" doesn't seem to exist anymore, they appear to have been renamed into \"Service Desk Request\" ... i don't know why. ",
            "id": "comment-15736765"
        },
        {
            "date": "2016-12-10T00:31:41+0000",
            "author": "Hoss Man",
            "content": "yes you did in fact create a jira issue – aparently jira was upgraded recently and the term \"Issue\" doesn't seem to exist anymore, they appear to have been renamed into \"Service Desk Request\" ... i don't know why.\n\nActually .. i take that back ... jira does appear to have been changed/upgraded in some way so the only \"Create\" option is \"Create Service Desk Request\", and the result seems like the same as creating an issue, but the look of this \"issue\" is totally diff from any other existing issue ... so i'm not sure what exactly is going on. ",
            "id": "comment-15736818"
        },
        {
            "date": "2016-12-10T01:07:30+0000",
            "author": "Erick Erickson",
            "content": "Chris Hostetter (Unused)\n\nbq: The fact that there is no option prevent any commit at all was a conscious choice:\n\nWe can quibble about this one I suppose. In many cases it's probably good enough to let the next autocommit take care of opening a new searcher and rendering the docs un-findable rather than forcing the commit from the code. This assumes that the delete-by-query starts an autocommit timer.\n\nIf the decision is that we shouldn't/won't make this configurable then we should at least change the TODOs\n\n            // TODO: should this be more configurable? \n            // TODO: in particular: should hard commit be optional?\nsince they make it seem like something that's still an open question. And yes I see the distinction between soft and hard commit implicit there.\n\nbq: there is no value add in a new option to prevent the commit from being fired – it won't do anything unless there is something to commit.\n\nWell, that's not the original issue, is it? The problem is that we're opening multiple searchers in rapid succession apparently due to autocommit expiry coupled with this commit. Hmmmm, maybe I'm jumping the gun here and the real question is whether the commit from the code resets the autocommit expiry? I admit I haven't tracked that bit down. \n\nI suppose another sequence could be:\n\n\tautocommit expires and starts warming a new searcher\n\tTTL kicks in, deletes some docs and does the commit while the searcher from <1> is still warming producing the warning.\n\n\n\nAll that said, this doesn't seem like a major problem more a tidying-up.\n\nHmmm, when I hover over the \"Create\" button the tooltip is \"create a new issue/bug/feature request\", but the drop down is, indeed, Create Service Desk Request\". Sigh.\n ",
            "id": "comment-15736889"
        },
        {
            "date": "2016-12-10T01:18:12+0000",
            "author": "Hoss Man",
            "content": "Well, that's not the original issue, is it? The problem is that we're opening multiple searchers in rapid succession apparently due to autocommit expiry coupled with this commit. ...\n\nI've seen no indication/confirmation of that – the original mail thread that spawned this issue noted only that multiple on deck searchers as the result of using the doc expiration processor with a autoDeletePeriodSeconds=30 – if warming takes more then 30 seconds AND docs are expiring at a frequency of at least 30 seconds, then that would explaining the multiple on deck searchers, even if there were no other adds/commits.\n\n... maybe I'm jumping the gun here and the real question is whether the commit from the code resets the autocommit expiry?\n\nAll commits reset the autocommit timmer, regardless of when/why it was started.\n\nWe can quibble about this one I suppose. In many cases it's probably good enough to let the next autocommit take care of opening a new searcher and rendering the docs un-findable rather than forcing the commit from the code. This assumes that the delete-by-query starts an autocommit timer.\n\nI suppose the processor could try to detect if autocommit is enabled, and only use commitWithin on the delete instead of triggering the softCommit directly? ... but i really think adding yet another config option that people might get wrong (ie: if they aren't using autoCommit) is a bad idea.\n\nthe bottom line is: if the processor is triggering on deck warming warnings when configured to run every 30 seconds, then even if it didn't trigger commits directly there would still be on deck warming warnings if the autoCommit is <= 30 seconds. ",
            "id": "comment-15736910"
        },
        {
            "date": "2016-12-10T06:16:00+0000",
            "author": "Shawn Heisey",
            "content": "Actually .. i take that back ... jira does appear to have been changed/upgraded in some way so the only \"Create\" option is \"Create Service Desk Request\"\n\nThey added a dropdown arrow on the Create button, and if you click that arrow, the only option is to create a service desk request.  If you click on the left side of the button instead, it works just like it always has.  I filed an issue with Atlassian about it, but it got closed and I don't think they'll be changing it. ",
            "id": "comment-15737326"
        },
        {
            "date": "2016-12-10T07:26:26+0000",
            "author": "Alexandre Rafalovitch",
            "content": "They added a dropdown arrow on the Create button, and if you click that arrow, the only option is to create a service desk request. If you click on the left side of the button instead, it works just like it always has. I filed an issue with Atlassian about it, but it got closed and I don't think they'll be changing it.\n\nI think Infra enabled ServiceDesk component for JIRA on the last upgrade which is why we suddenly got it. And - mea culpa - I actually enabled Service Desk for Solr to see whether the reporting abilities it had would be useful for \"dead issues\" tracking. I did not realize it would then show big red numbers everywhere as well. I've disabled that for Solr just now, but this still does not fix the 'Add Service Request' issue, which IIRC was already there before. So, if this needs to be escalated, it should probably go into Infra hands (and separate issue).  ",
            "id": "comment-15737415"
        },
        {
            "date": "2016-12-10T16:39:26+0000",
            "author": "Erick Erickson",
            "content": "I just added a note to the \"How to Contribute\" page, but since the \"Create service desk request\" version also creates a JIRA I don't think there's much to really worry about. ",
            "id": "comment-15738123"
        }
    ]
}