{
    "id": "SOLR-3946",
    "title": "Support delta import in SolrEntityProcessor",
    "details": {
        "affect_versions": "4.0",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "clients - java"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "SolrEntityProcessor is very useful to copy a part of index from central solr to another solr server based on some query.\nBut its function is quite limited, doesn't support delta import, which is a quite useful feature, for example:\n\nOne central solr server stores index of all docs, in the index we record information such as owner, last_modified and etc. Then create a local cache solr server in client side which only contains index of docs created by this user, so user can search his/her docs even when there is no internet connection. After the first full import to copy index of doc created by this user in last several weeks (or month), we want to update index in client's local solr server consistently from the central server.\n\nBut now, we can't do this, as SolrEntityProcessor doesn't support delta-import - which already supports in SqlEntityProcessor: using deltaQuery, deltaImportQuery to do delta-import, using deletedPkQuery to remove deleted index when do delta-import.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "James Dyer",
            "id": "comment-13476237",
            "date": "2012-10-15T16:10:24+0000",
            "content": "It might be difficult to make \"command=delta-import\" work with anything other than SqlEntityProcessor, as it seems to be designed around SQL and RDBMS concepts.  However, you might be able to do deltas with SolrEntityProcessor using \"command=full-import&clean=false\".  Then, parameterize SolrEntityProcessor's \"query\" and/or \"fq\" parameters to retrieve just the documents that were added or changed since the last sync.  Of course deletes are going to be a problem, and you might need to invent some multiple-step process to find a way to do these. \n\nGiven that you can do incremental updates on your index using \"command=full-import&clean=false\", and that the Delta Update is unsupported (indeed often cannot be supported) for anything other than Sql, I wonder if \"command=delta-update\" could just be removed entirely from DIH.  As DIH is slipping more and more towards death, it might someday be necessary to amputate the sickest parts to save the patient... "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717278",
            "date": "2013-07-23T18:47:43+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971155",
            "date": "2014-04-16T12:57:18+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}