{
    "id": "SOLR-3105",
    "title": "Add analysis configurations for different languages to the example",
    "details": {
        "affect_versions": "None",
        "status": "Closed",
        "fix_versions": [
            "3.6",
            "4.0-ALPHA"
        ],
        "components": [],
        "type": "Improvement",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "I think we should have good baseline configurations for our supported analyzers\nso that its easy for people to get started.",
    "attachments": {
        "SOLR-3105.patch": "https://issues.apache.org/jira/secure/attachment/12513613/SOLR-3105.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Robert Muir",
            "id": "comment-13202376",
            "date": "2012-02-07T13:46:48+0000",
            "content": "Attached is a patch.\n\nFirst you must run 'ant sync-analyzers' (I would do this before committing), which syncs resources such as stoplists from the lucene analyzers into the conf/lang folder.\n\nWhile reviewing the configurations (Testing is not done, this is just a preliminary patch), I found some issues/opportunities for improvement in some of the Lucene Analyzers too (this patch uses those same definitions), so those are folded into the patch. "
        },
        {
            "author": "Michael McCandless",
            "id": "comment-13202456",
            "date": "2012-02-07T15:17:56+0000",
            "content": "Wow, this is AWESOME: 28 added languages.  +1! "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13202509",
            "date": "2012-02-07T16:24:08+0000",
            "content": "+1, nice!\n\nQuestion: you add new contraction lists for three languages to Solr's example, but shouldn't they go into the common analyzer's resources directory and be copied over by ant sync-analyzers?\n\nOne other thing (separate issue probly): ElisionFilter is in package o.a.l.analysis.fr, but you've added example uses with Italian and Catalan - shouldn't this class move up to package o.a.l.analysis? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13202511",
            "date": "2012-02-07T16:30:53+0000",
            "content": "\nQuestion: you add new contraction lists for three languages to Solr's example, but shouldn't they go into the common analyzer's resources directory and be copied over by ant sync-analyzers?\n\nMaybe, i put a TODO in those lists for that reason (its the first line in each one).\nThe problem is, in most cases they are tiny short! so a text file is awkward. But, maybe we should just do this anyway.\n\n\nOne other thing (separate issue probly): ElisionFilter is in package o.a.l.analysis.fr, but you've added example uses with Italian and Catalan - shouldn't this class move up to package o.a.l.analysis?\n\nYeah its a little awkward: I think maybe it belongs in the .util package?\n\nAlso, we don't sync the english stopwords, (though, it does match lucene's). So thats another improvement we could do, text-file those under .en package\ninstead of being a hardwired set in StopAnalyzer.\n\nI think maybe we could open issues for all of these? I don't like it either, but i decided to go with the TODO approach because\nI'm not sure it should really block this issue (to the user, it will all be the same, this is implementation details). "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13202515",
            "date": "2012-02-07T16:36:11+0000",
            "content": "I think maybe we could open issues for all of these? I don't like it either, but i decided to go with the TODO approach because I'm not sure it should really block this issue (to the user, it will all be the same, this is implementation details).\n\n+1 "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13202524",
            "date": "2012-02-07T16:50:48+0000",
            "content": "This looks very good and makes it a whole lot easier for users to get started using the inherent language capabilities.  Great work, Robert. "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13203030",
            "date": "2012-02-08T00:32:02+0000",
            "content": "+1\n\nThis is very welcome "
        },
        {
            "author": "Jan Høydahl",
            "id": "comment-13203042",
            "date": "2012-02-08T00:43:18+0000",
            "content": "It would perhaps be cleaner to put all of these into a separate file and include via XInclude, to keep example schema.xml small(er), however it seems as XInclude for schema is broken - SOLR-3087 ? "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13203060",
            "date": "2012-02-08T00:53:47+0000",
            "content": "Jan: maybe, though I don't want the functionality to depend upon more obscure features of solr or xml.\n\nAnd of course, its useful to look at everything in context, these files are already huge: \n\n\tthe existing 'english' fieldTypes are 109 lines long, for a single language.\n\tthis is 317 lines long, for 28 languages.\n\tother config files are also huge (solrconfig.xml is 1,669 lines long)\n\n\n\nLong term I would really prefer the field types in the schema.xml, where they will work and people will find them,\nand where we can build off of them for future things: e.g. things like better language detection integration or examples. "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13203103",
            "date": "2012-02-08T01:28:31+0000",
            "content": "It would perhaps be cleaner to put all of these into a separate file and include via XInclude, to keep example schema.xml small(er)\n\nYeah, that might be nice. "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13203113",
            "date": "2012-02-08T01:37:00+0000",
            "content": "Sure, but then english fieldtypes go with it! "
        },
        {
            "author": "Hoss Man",
            "id": "comment-13203115",
            "date": "2012-02-08T01:38:00+0000",
            "content": "I'm with robert ... this issue is about coming up with good example configs for as many languages as we can.  at the moment we have one big fat kitchen-sink set of example configs, so lets use what we've got.\n\nIf people care strongly, we can track cleaning up and re-organizing the examples (to use xinclude, or add multiple more specifically targed sets of example configs, etc...) in a different issue.\n\n "
        },
        {
            "author": "Christian Moen",
            "id": "comment-13203134",
            "date": "2012-02-08T02:01:04+0000",
            "content": "Hoss, +1.\n\n\n\n\n\n "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13203140",
            "date": "2012-02-08T02:05:58+0000",
            "content": "at the moment we have one big fat kitchen-sink set of example configs\n\nThey aren't necessarily supposed to be. It's case-by-case (and in the past I've routinely tried to clean out less useful or less widely applicable stuff).\nAlthough I'm not against this issue, but we shouldn't use logic like \"if it's already bad, it doesn't matter if we make it worse\".\nWe should probably take a look at reducing some of the logging we spew at startup too (yes, in a separate issue).\n "
        },
        {
            "author": "Robert Muir",
            "id": "comment-13203158",
            "date": "2012-02-08T02:16:54+0000",
            "content": "I dont think this is really adding to a kitchen sink or 'making the example worse'.\n\nNot trying to complain about the time here, but its not like i just quickly slapped a bunch of xml on a JIRA issue to bloat the config.\n\nTake a look at the patch. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13203159",
            "date": "2012-02-08T02:17:47+0000",
            "content": "Jan: maybe, though I don't want the functionality to depend upon more obscure features of solr or xml.\n\nThe other issue is that this is not supported when loading config from zookeeper - so we would probably have to create another example set without. I'm not that familiar with XInclude, so perhaps support for zk could be added, but offhand i would assume that is not the case. "
        }
    ]
}