{
    "id": "SOLR-2994",
    "title": "Solr no longer compiles in IntelliJ",
    "details": {
        "affect_versions": "3.6",
        "status": "Closed",
        "fix_versions": [
            "3.6"
        ],
        "components": [
            "Build"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "Running the \"ant idea\" target no longer creates an IntelliJ environment that is consistent, I'm getting \"package org.apache.lucene.analysis.phonetic does not exist\". It looks like the phonetic package moved from lucene to contrib?\n\nNote that command-line ant task continues to work just fine.\n\nI'll attach a patch that fixes it for me, but I'd really like someone who understands Idea (Steve, are you listening?) system take a look to see if it's OK. It's a magnificent single line in solr.iml.\n\nI'm assuming this is also a problem for 4.x, I'll probably be in that environment later today and see.\n\nI have no idea whether Eclipse suffers from the same problem.\n\nI've assigned it to myself just for tracking, anyone who can glance at it and say \"yeah, that's right\" please feel free to just check it in for 3x and 4x if applicable.",
    "attachments": {
        "SOLR-2994.patch": "https://issues.apache.org/jira/secure/attachment/12508944/SOLR-2994.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erick Erickson",
            "id": "comment-13177702",
            "date": "2011-12-30T17:12:26+0000",
            "content": "Fixes the problem on my machine in 3x. I'll probably see about 4x later. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13177766",
            "date": "2011-12-30T21:23:39+0000",
            "content": "Thanks Erick, I've committed your patch to branch_3x in r1225922.\n\nIt looks like the phonetic package moved from lucene to contrib?\n\nSee SOLR-2982.\n\nI'm assuming this is also a problem for 4.x, I'll probably be in that environment later today and see.\n\ntrunk compiles fine for me from IntelliJ.  (The phonetic module was already there before SOLR-2982.)\n\nI have no idea whether Eclipse suffers from the same problem.\n\nThe source and test directories for the phonetic contrib were already in the Eclipse config, even though the directories themselves weren't, so the Eclipse config is fine, AFAICT. "
        }
    ]
}