{
    "id": "SOLR-4794",
    "title": "UI is broken on browsers for Android",
    "details": {
        "affect_versions": "4.3",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Implemented"
    },
    "description": "I've tried three browsers for my Android phone, an Amaze 4G by HTC.  All of them have problems.\n\nOne problem common to all of them is that the stuff on the left-hand side of the screen always stays put and will cover up the rest of the page if you zoom in and/or scroll around.\n\n1) Built-in browser: I think this is probably provided or modified by HTC.  This one is extremely broken. By clicking in what looks like incorrect places, you can select a core, but you can't get to any of the good stuff like the query or analysis UI.\n\n2) Chrome for Android: Better than the HTC/Android browser.  I can get to the query UI, but when I try to execute a query, it goes back to the dashboard.\n\n3) Firefox for Android: Works fairly well on the few things I tested, except for the left-hand stuff covering the rest of the page as mentioned above.  I don't know if everything is working, but this is the only one that let me use the query UI.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13651076",
            "date": "2013-05-07T17:15:12+0000",
            "content": "I have not tried any Apple mobile devices or Android tablets.\n\nOn the #solr irc channel, Stefan Matheis (steffkes) said that the support page for the javascript dropdown UI we're using says there are a lot of problems on mobile platforms, so it may be difficult for us to fix these problems ourselves. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13651091",
            "date": "2013-05-07T17:31:38+0000",
            "content": "How I reached this point: Someone sent an email about our Solr setup while I was on the train.  Since my commute lasts over an hour, I needed something productive to do.  I made the VPN connection on my phone and tried to run a quick query:\n\n\n*:* -field:[* TO *]\n\n\nI already had two browsers on my phone, they didn't work.  After I arrived in the office, I tried Firefox. "
        },
        {
            "author": "Raja Nagendra Kumar",
            "id": "comment-13957408",
            "date": "2014-04-02T07:01:48+0000",
            "content": "One issue found is Content overlapping due to zoom or scrolling.\n\nThis is because of CSS div format of position: fixed\nThe following lines can be removed\n\nsolr\\webapp\\web\\css\\styles\\common.css \nline 194   position: fixed;\n\nsolr\\webapp\\web\\css\\styles\\menu.css \nline 22   position: fixed;\n\nthen re-order of div element in  file solr\\admin.html\n\n <div id=\"content-wrapper\">\n            <div id=\"content\">\n                 \n            </div>\n  </div>\n\nthis should be moved below menu-wrapper div. i.e from line 80 to line 135. This way default position of static would work fine.\nhttp://www.w3schools.com/cssref/pr_class_position.asp\n\nWith this change android version on Samsung S4 default and chrome browsers work without overlap on scroll or during zoom.\n\nHowever content is appearing below the left menu i.e y position is non zero. \nSome more changes would be needed at CSS to make sure content window is positioned with y position as zero. May be CSS experts would be able to make rest of the adjustments needed for y to be zero. "
        },
        {
            "author": "Alexandre Rafalovitch",
            "id": "comment-15394874",
            "date": "2016-07-27T01:04:13+0000",
            "content": "This is an ancient bug request against old browsers with legacy UI. Safe to close, I think. The current (Angular) UI does seem to work on Android browsers (just tested). Any specific new issues should be in a new case. "
        }
    ]
}