{
    "id": "SOLR-931",
    "title": "Config file replication admin",
    "details": {
        "affect_versions": "1.4",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "Admin UI"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Have an issue where the solr replication screen does not show the right information about the configuration files replicated.  I did a reindex and the replication happened.  It also replicated like 4 configuration files.  Unfortunately, it doesn't show the replication.  Additionally, it show that the previous replication was after the most recent which is just wierd.",
    "attachments": {
        "screenshot-1.jpg": "https://issues.apache.org/jira/secure/attachment/12396437/screenshot-1.jpg"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Jeff",
            "id": "comment-12657941",
            "date": "2008-12-18T23:42:36+0000",
            "content": "As seen the Previous replication is after the config files replicated.  Both times are wrong as the config files replicated around 15:30 successfully. "
        },
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-12658752",
            "date": "2008-12-23T05:25:33+0000",
            "content": "Jeff, the time at which configuration was replicated is stored separately from the time at which index was replicated. This is why the (index) replication is after config file replication. Perhaps the message on that page needs to be modified to clearly highlight this.\n\nThe time which is shown on that page is read from the data/replication.properties file. I'm having trouble reproducing the wrong time problem. Is there something different in your setup that I need to know? You can also verify the time by looking at the last modified of the config file on the slaves. "
        },
        {
            "author": "Jeff",
            "id": "comment-12660801",
            "date": "2009-01-05T16:03:52+0000",
            "content": "I have not seen it happen since the original posting.  I will keep watching to see if/when it does happen and post all of the information. "
        },
        {
            "author": "Otis Gospodnetic",
            "id": "comment-12674992",
            "date": "2009-02-19T13:09:35+0000",
            "content": "Jeff - any luck reproducing the problem? "
        },
        {
            "author": "Jeff",
            "id": "comment-12675008",
            "date": "2009-02-19T15:00:32+0000",
            "content": "Honestly I have not seen this issue resurface and we are now fully replicating.  I appreciate the help and we can probably close it.  I will keep my eye open but obviously it is either really sporadic or it has been fixed in one of the recent builds. "
        }
    ]
}