{
    "id": "SOLR-5323",
    "title": "Solr requires -Dsolr.clustering.enabled=false when pointing at example config",
    "details": {
        "affect_versions": "4.5",
        "status": "Resolved",
        "fix_versions": [
            "4.5.1",
            "4.6",
            "6.0"
        ],
        "components": [
            "contrib - Clustering"
        ],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "my typical use of Solr is something like this: \n\n\ncd SOLR_HOME/example\ncp -r solr /myProjectDir/solr_home\njava -jar -Dsolr.solr.home=/myProjectDir/solr_home  start.jar\n\n\n\nBut in solr 4.5.0 this fails to start successfully. I get an error:\n\n\norg.apache.solr.common.SolrException: Error loading class 'solr.clustering.ClusteringComponent'\n\n\n\nThe reason is because solr.clustering.enabled defaults to true now. I don't know why this might be the case.\n\nyou can get around it with \n\n\njava -jar -Dsolr.solr.home=/myProjectDir/solr_home -Dsolr.clustering.enabled=false start.jar\n\n\n\nSOLR-4708 is when this became an issue.",
    "attachments": {
        "SOLR-5323.patch": "https://issues.apache.org/jira/secure/attachment/12608047/SOLR-5323.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Erik Hatcher",
            "id": "comment-13790362",
            "date": "2013-10-09T13:56:00+0000",
            "content": "I think we should have the <lib> elements in solrconfig.xml be something like this:\n\n\n  <lib dir=\"${solr.install.dir}/contrib/clustering/lib/\" regex=\".*\\.jar\" />\n\n\n\nwhere solr.install.dir is a property defined by Solr automatically at startup that has the root of where Solr is installed.  I've done this manually by adjusting the configuration in this exact scenario (copying the example configuration and changing all <lib>'s in this way and defining solr.install.dir on the command-line), but Solr should be able to do this better. "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13790452",
            "date": "2013-10-09T15:17:45+0000",
            "content": "This isn't specific to the clustering component, except that it gets loaded non-lazily.  See these comments: https://issues.apache.org/jira/browse/SOLR-4708?focusedCommentId=13630567&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13630567 "
        },
        {
            "author": "Yonik Seeley",
            "id": "comment-13790551",
            "date": "2013-10-09T16:03:07+0000",
            "content": "Hmmm, I agree this is a bug.\nMy comment in SOLR-4708 was \"+1, provided that everything (except clustering) still works if you copy \"example\" somewhere else.\" "
        },
        {
            "author": "Erik Hatcher",
            "id": "comment-13790568",
            "date": "2013-10-09T16:18:48+0000",
            "content": "My comment in SOLR-4708 was \"+1, provided that everything (except clustering) still works if you copy \"example\" somewhere else.\"\n\nAnd that's the reason I didn't commit it before.  I thought somehow Dawid had worked some magic to alleviate this issue when he took it on.\n\nWe should perhaps have lazy loaded SearchComponents too?  "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13790788",
            "date": "2013-10-09T20:05:59+0000",
            "content": "I can't remember but I think the problem was that it wasn't possible to define install-dir relative directories for lib element. I'll take a look. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13791363",
            "date": "2013-10-10T10:13:09+0000",
            "content": "Hmmm, I agree this is a bug.\n\nOk, I admit I don't know what is the \"right\" way to fix this. I also don't think this issue applies to the clustering contrib only.\n\nThere are several <lib/> elements in the example configuration and they all use relative paths to load additional components. So after you change the relative folder structure any \"example\" using these will fail to load, the clustering component just happens to be loaded eagerly so it triggers a failure sooner.\n\nI've had real life use cases when hard-coded relative paths proved very confusing so I'd opt for something like Erik mentioned – making <lib/> components reference JARs relative to some notion of an \"installation\" folder. Ideally, this should also be inferred automatically if it's not given on command line and if somebody runs Solr from the unpacked default structure. I can prepare a patch that will try to guess and set \"solr.install.dir\" based on the classloader URI leading to one of the core classes (SolrCore, for example). Once we locate the core JAR we can sniff for ../contrib and ../dist and if these are present set the install dir in the upper folder.\n\nThis is, obviously, a hack. If somebody runs from a WAR file or changes the default directory structure things will break. I assume if they do so they'll also be able to change the example's default paths (or override solr.install.dir explicitly).\n\nI'm also not 100% confident how the above will work in the distributed setting – soliciting feedback here.\n\nAnyway, if the above sound all right I will prepare a patch. I don't have any sensible alternatives other than turning off the clustering component by default. I would be against this, however, because like I said – this only hides the problem, not solves it (the default configuration will still  be \"unmovable\" from the default directory structure).\n "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13792824",
            "date": "2013-10-11T17:16:31+0000",
            "content": "I also think this was a mistake - I don't know that we need another solr.home type thing to address it though.\n\nThe root of the issue is that the clustering is not \"really\" lazy loading clustering - and the current policy is to lazy load the contrib modules - and that is because of the component. I think Erik is on to the right path with lazy SearchComponents. I think that if the only request handlers that refer to a search component are lazy, they should probably also init lazily. I have not looked into how hard that is to do, but it seems like the correct fix to bring clustering in line with the other contribs. I also think the whole enabled flag we had is no good. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13792834",
            "date": "2013-10-11T17:26:16+0000",
            "content": "I can revert to lazy-loading, not a problem. But this isn't solving the relative paths issue at all. Like I mentioned there were several times when I had to pass an example preconfigured solr configuration to somebody – this always required that person to put the content of the example under a specific directory in Solr distribution, otherwise things wouldn't work because of relative paths. It was a pain to explain why this step is needed and to enforce... I ended up just copying the required JARs into the example. This seems wrong somehow – if it's a solr distribution then there should be a way to reference contribs in a way that allows people to have their stuff in any folder hierarchy?\n\nWhat do you think? "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13792850",
            "date": "2013-10-11T17:34:45+0000",
            "content": "I just think anything with the relative paths is a separate issue.\n\nYou can use any hierarchy - you just have to change those paths. I'm all for that being improved somehow, but the issue here seems to be:\n\nSolr contrib modules are lazy loaded so that if you don't use them, you can delete any of them from the dist package layout and things still work. Or you can not delete them and if you try and use them, things work. Clustering now violates that. It's not really clusterings fault, it seems to more be a limitation of the search component. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13792859",
            "date": "2013-10-11T17:44:46+0000",
            "content": "Ok, I will reverting the changes from SOLR-4708. "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13792889",
            "date": "2013-10-11T18:05:58+0000",
            "content": "Patch reverting (portions) of SOLR-4708. "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13792894",
            "date": "2013-10-11T18:08:45+0000",
            "content": "Commit 1531377 from Dawid Weiss in branch 'dev/trunk'\n[ https://svn.apache.org/r1531377 ]\n\nSOLR-5323: Disable ClusteringComponent by default in collection1 example. The solr.clustering.enabled system property needs to be set to 'true' to enable the clustering contrib (reverts SOLR-4708). (Dawid Weiss) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13792897",
            "date": "2013-10-11T18:10:23+0000",
            "content": "Commit 1531378 from Dawid Weiss in branch 'dev/branches/branch_4x'\n[ https://svn.apache.org/r1531378 ]\n\nSOLR-5323: Disable ClusteringComponent by default in collection1 example. The solr.clustering.enabled system property needs to be set to 'true' to enable the clustering contrib (reverts SOLR-4708). (Dawid Weiss) "
        },
        {
            "author": "ASF subversion and git services",
            "id": "comment-13792902",
            "date": "2013-10-11T18:14:42+0000",
            "content": "Commit 1531380 from Dawid Weiss in branch 'dev/branches/lucene_solr_4_5'\n[ https://svn.apache.org/r1531380 ]\n\nSOLR-5323: Disable ClusteringComponent by default in collection1 example. The solr.clustering.enabled system property needs to be set to 'true' to enable the clustering contrib (reverts SOLR-4708). (Dawid Weiss) "
        },
        {
            "author": "Dawid Weiss",
            "id": "comment-13792906",
            "date": "2013-10-11T18:15:52+0000",
            "content": "Applied to branch_4x, lucene_solr_4_5 and trunk. "
        }
    ]
}