{
    "id": "SOLR-4937",
    "title": "SolrCloud doesn't distribute null values",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Fixed"
    },
    "description": "When trying to overwrite field values in SolrCloud using doc.setField(fieldName, null) it produces inconsistent behavior depending on the routing of the document to a specific shard. The binary format that is sent in preserves the null, but when the DistributedProcessor forwards the message to replicas it writes the message to XML using ClientUtils.writeVal(..) which drops any null value from the XML representation. This was especially problematic when a custom processor was initially placed after the distributed processor using the previously mentioned setField(null) approach but then moved ahead of the DistributedProcessor which no longer works as expected. It appears that I now need to updated the code to: doc.setField(fieldName, Collections.singletonMap(\"set\", null)) for it to properly distribute throughout the cloud due to the XML restrictions. The fact that the custom processor needs to change depending on it's location in reference to the DistributedProcessor is a drag. I believe there should be a requirement that you can take a SolrInputDocument -> toXml -> toSolrInputDocument and assert that the two SolrInputDocuments are equivalent, instead of a lossy translation to XML.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shalin Shekhar Mangar",
            "id": "comment-13709874",
            "date": "2013-07-16T16:03:30+0000",
            "content": "Steve – Support for writing null values in ClientUtils was added by SOLR-4133 in Solr 4.1. Which version of Solr were you using? "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717316",
            "date": "2013-07-23T18:47:51+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Steve Davids",
            "id": "comment-13765095",
            "date": "2013-09-12T02:20:07+0000",
            "content": "The support for null values is only available if you use the update syntax as described above. I was plainly using a null value which updated the leader's value but during the XML transformation it drops the null value when distributing to replicas (if not accompanied with the update command). If JavaBin was used to forward the message (SOLR-5223) it would work either way, setting just null or \n{set:null}\n. "
        },
        {
            "author": "Mark Miller",
            "id": "comment-13799957",
            "date": "2013-10-19T17:55:26+0000",
            "content": "SOLR-5223 is now complete for 4.6 and JavaBin is used by SolrCloud to forward around update requests. "
        },
        {
            "author": "Steve Davids",
            "id": "comment-13912499",
            "date": "2014-02-26T04:31:43+0000",
            "content": "Should be fixed by SOLR-5223 "
        }
    ]
}