{
    "id": "SOLR-10883",
    "title": "Ref guide: some replacement substitutions, e.g. => to right arrow, are rendered invisibly in the PDF",
    "details": {
        "labels": "",
        "priority": "Major",
        "components": [
            "documentation"
        ],
        "type": "Bug",
        "fix_versions": [
            "6.7",
            "7.0"
        ],
        "affect_versions": "None",
        "resolution": "Fixed",
        "status": "Resolved"
    },
    "description": "=>, <=, and <- are rendered as invisible in the PDF.  These “replacement substitutions” aka “textual symbol replacements” ( http://asciidoctor.org/docs/asciidoc-writers-guide/#replacements ) render as invisible characters in the PDF, though they are visible in the HTML format, when substitution is in effect.\n\nThis is only a problem outside of code blocks (e.g. --> close comment syntax in XML is never improperly substituted).\n\nIn the screenshot below, a table from the CharFilterFactories|solr.MappingCharFilterFactory section is shown in the HTML format on the left, and in PDF format to the right; in the PDF format the => is invisible.",
    "attachments": {
        "SOLR-10883.patch": "https://issues.apache.org/jira/secure/attachment/12872870/SOLR-10883.patch",
        "Screen Shot 2017-06-12 at 7.23.07 PM.png": "https://issues.apache.org/jira/secure/attachment/12872867/Screen%20Shot%202017-06-12%20at%207.23.07%20PM.png"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2017-06-13T13:47:44+0000",
            "content": "Patch, backslash escapes =>, <=, -> and <-.  (Even though -> renders properly in the PDF, I think it's better to be consistent.)\n\nI found that some of the other substitutions (for ..., --, ') looked fine in the PDF, and the others weren't present outside of code blocks: (C), (R), (TM).\n\nI went the individual escaping route after determining that there is no way to globally turn off this kind of substitution - there is an open feature request for this: https://github.com/asciidoctor/asciidoctor/issues/1061. ",
            "author": "Steve Rowe",
            "id": "comment-16047923"
        },
        {
            "date": "2017-06-13T20:19:15+0000",
            "content": "This iteration of the patch builds on the previous one to include .adoc file checks in the top-level ant validate build step (specifically -validate-source-patterns).  On a checkout without the .adoc file escaping in this patch, ant validate found all of the problems addressed in this patch, and on a checkout with this full patch, no problems are found.\n\nThe patch also substitutes tabs->spaces in an .adoc file, found by ant validate.\n\nI think it's ready to go. ",
            "author": "Steve Rowe",
            "id": "comment-16048358"
        },
        {
            "date": "2017-06-21T19:53:59+0000",
            "content": "I had an offline discussion with Steve about this. The changes to validate .adoc files are fine IMO, but are only a drop in the bucket as far as what can go wrong with these files.\n\nThere are already two validations that happen when the docs are built:\n\n\n\tthe Jekyll and Asciidoctor-pdf tools that we use to build the HTML and PDF versions respectively will WARN if files are malformed. The two most common I've seen are when section levels are out of order and when a section doesn't include a \"part\" (see SOLR-10297 for more discussion about these)\n\tAfter the docs are built, the check-links-and-anchors target validates that all the links between pages adhere to the proper format to be sure they work in the PDF, and makes sure there are not duplicate section headings on different pages so inter-doc links don't get confused.\n\n\n\nI don't expect there to be a lot of devs who build the docs locally before committing their changes, but it would be nice if the Ref Guide build had the additional validation of what you want to put in precommit; by the same token, it would be nice if precommit checked the links and anchors that's now only done during the build (the most recent Jenkins Ref Guide build failure was caused by that check not being run). \n\nI also have a list of stuff I'd like to add to validation, just as warnings - more along the lines of enforcing/suggesting some style consistencies where feasible.\n\nIf you go ahead and commit your changes here, I can look at adding precommit to the Ref Guide build. Then maybe we can add the check-links-and-anchors to precommit if that makes sense to others also. ",
            "author": "Cassandra Targett",
            "id": "comment-16058096"
        },
        {
            "date": "2017-06-21T22:25:49+0000",
            "content": "Commit d9d3369cd755160a1187604e353dcb915f65cf3d in lucene-solr's branch refs/heads/branch_6x from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d9d3369 ]\n\nSOLR-10883: Ref guide: Escape replacement substitutions; add .adoc file checks to the top-level validate target\n\n Conflicts:\n\tsolr/solr-ref-guide/src/the-terms-component.adoc ",
            "author": "ASF subversion and git services",
            "id": "comment-16058366"
        },
        {
            "date": "2017-06-21T22:25:51+0000",
            "content": "Commit d3f9059d2991d5f2ea3dc5687b69d60e0dd12afa in lucene-solr's branch refs/heads/master from Steve Rowe\n[ https://git-wip-us.apache.org/repos/asf?p=lucene-solr.git;h=d3f9059 ]\n\nSOLR-10883: Ref guide: Escape replacement substitutions; add .adoc file checks to the top-level validate target ",
            "author": "ASF subversion and git services",
            "id": "comment-16058367"
        },
        {
            "date": "2017-06-21T22:32:46+0000",
            "content": "Thanks for the review Cassandra Targett. ",
            "author": "Steve Rowe",
            "id": "comment-16058377"
        }
    ]
}