{
    "id": "SOLR-2639",
    "title": "default \"fl\" in solrconfig.xml does not recognize 'score' as a field",
    "details": {
        "affect_versions": "4.0-ALPHA",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "SearchComponents - other"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Cannot Reproduce"
    },
    "description": "Got the following exception when query SOLR without explicitly specifying \"&fl\". In my solrconfig.xml, I set default value of \"fl\" to some fields including 'score'.\n\n\"type Status report\nmessage undefined field score\ndescription The request sent by the client was syntactically incorrect (undefined field score).\"\n\nI didn't have such error in my march trunk build. Note that when I set \"&fl=\", all fields except 'score' are returned. In the March trunk build, \"&fl=\" still makes SOLR returns all the default fields specified in solrconfig.xml.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-13066310",
            "date": "2011-07-15T23:46:48+0000",
            "content": "Tao: I can not reproduce the problem you described, but it may be because i'm misunderstanding what you tried (w/o any specific configs or sample requests it's hard to be sure)\n\nWIth the following patch against the trunk r1147272...\n\n\nIndex: solr/example/solr/conf/solrconfig.xml\n===================================================================\n--- solr/example/solr/conf/solrconfig.xml\t(revision 1147272)\n+++ solr/example/solr/conf/solrconfig.xml\t(working copy)\n@@ -713,6 +713,7 @@\n      <lst name=\"defaults\">\n        <str name=\"echoParams\">explicit</str>\n        <int name=\"rows\">10</int>\n+       <str name=\"fl\">id,score</str>\n      </lst>\n     <!-- In addition to defaults, \"appends\" params can be specified\n          to identify values which should be appended to the list of\n\n\n\nThen a URL for the example solr data that did not specify an fl param (http://localhost:8983/solr/select/?q=memory) correctly used the default and only returned the id and score fields for each match.\n\nIf you are still seeing a problem, please re-open this issue and attach either a patch against the example configs, or a full copy of your own configs along with details on exactly what request URL will reproduce the problem you are having  (or better still: a patch including a JUnit test of the problem) "
        }
    ]
}