{
    "id": "SOLR-365",
    "title": "improper handling of user login greater than 8 characters",
    "details": {
        "affect_versions": "None",
        "status": "Resolved",
        "fix_versions": [],
        "components": [
            "replication (scripts)"
        ],
        "type": "Bug",
        "priority": "Minor",
        "labels": "",
        "resolution": "Invalid"
    },
    "description": "to reproduce, create a user account that is more than 8 characters long.  Then try to do a command like snappuller and even though the config is setup properly, it attempts to do a sudo.  The reason is that  2 different methods are used to calculate the user, one of which truncates accounts to 8 characters.\n\nWhile user logins used to be limited to 8 characters, this may not be the case on modern UNIX.  \n\nHere is a snippet I get by adding the -x debug flag to bash.  Note how oldwhoami is a truncated version (psundlin) of the full login (psundling).\n\n+ fixUser\n+ [[ -z psundling ]]\n++ whoami\n+ [[ psundling != psundling ]]\n++ who -m\n++ cut '-d ' -f1\n++ sed '-es/^.*!//'\n+ oldwhoami=psundlin\n+ [[ psundlin == '' ]]",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Hoss Man",
            "id": "comment-12530510",
            "date": "2007-09-26T18:22:00+0000",
            "content": "This is ... odd.  Solr isn't making any assumptions about the length of the user name.\n\nPaul: what does the output of \"who | grep psund \" on your system print?\n "
        },
        {
            "author": "Paul Sundling",
            "id": "comment-12530556",
            "date": "2007-09-26T21:11:30+0000",
            "content": "$ who | grep psund\npsundlin pts/2        Sep 26 02:37 (ssundling.company.com)\n\n$ whoami\npsundling\n\n$ who am i\npsundlin pts/2        Sep 26 02:37 (ssundling.company.com)\n "
        },
        {
            "author": "Paul Sundling",
            "id": "comment-12530596",
            "date": "2007-09-26T23:39:27+0000",
            "content": " It seems the fact that logins with 9 characters or longer are truncated by to 8 characters by some  unix commands was a red herring.  It wasn't actually a problem after all.  You can reclassify it as not a bug and close it.  Apologies for the false alarm. "
        },
        {
            "author": "Paul Sundling",
            "id": "comment-12530598",
            "date": "2007-09-26T23:43:23+0000",
            "content": "Actually the one place where you do have a bug of sorts is improper logging.  \n\nSince oldwhoami uses the truncated command, it improperly logs it as 'psundlin' instead of 'psundling'.  So it is a bug after all, just a trivial one.\n\ni.e. for user account psundling:\n\n2007/09/26 22:44:18 started by psundlin "
        },
        {
            "author": "Hoss Man",
            "id": "comment-12530625",
            "date": "2007-09-27T03:23:03+0000",
            "content": "as your second comment shows: it's \"who\" that's doing the truncating ... whoami can't be used in this context because the point is to get the real user in the case that sudo is being used (who -m will tell you that, whoami won't).\n\ni'm not sure that there's anything we can do about the behavior of who, but it certainly doesn't hurt ot leave this issue open in case anyone else has a similar question (or a suggested solution) "
        },
        {
            "author": "Bill Au",
            "id": "comment-12530711",
            "date": "2007-09-27T13:23:00+0000",
            "content": "Paul, what OS are you running?  The who command on Red Hat Linux does not seems to have this problem. "
        },
        {
            "author": "Paul Sundling",
            "id": "comment-12531690",
            "date": "2007-10-02T05:21:39+0000",
            "content": "$ cat /etc/redhat-release\nRed Hat Enterprise Linux ES release 4 (Nahant Update 5)\n\n$ which who\n/usr/bin/who\n\n$ rpm -qf /usr/bin/who\ncoreutils-5.2.1-31.6\n\nSo apparently at least some Red Hat versions do have this problem.  The commands above show the version of Red Hat and the rpm package this version of who comes from.  I can't get more specific than that.  "
        },
        {
            "author": "Ryan McKinley",
            "id": "comment-13214490",
            "date": "2012-02-23T09:22:17+0000",
            "content": "not a solr issue "
        }
    ]
}