{
    "id": "SOLR-7880",
    "title": "Update commons-cli to 1.3.1, fix usage of deprecated classes/methods",
    "details": {
        "components": [
            "scripts and tools"
        ],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "5.5"
        ],
        "affect_versions": "5.2.1",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "While looking at SOLR-7847, I noticed that commons-cli was an old version, and once I upgraded it in the ivy config, found that SolrCLI is using deprecated classes/methods.\n\nThis issue is to complete the upgrade and fix the deprecations.",
    "attachments": {
        "SOLR-7880.patch": "https://issues.apache.org/jira/secure/attachment/12748949/SOLR-7880.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "date": "2015-08-05T22:56:13+0000",
            "author": "Shawn Heisey",
            "content": "This is the same patch that can be found on SOLR-7847 with this filename:\n\nSOLR-7847-upgrade-commons-cli.patch ",
            "id": "comment-14659132"
        },
        {
            "date": "2015-08-05T22:58:51+0000",
            "author": "Shawn Heisey",
            "content": "As recommended by Timothy Potter, I will do more testing (especially on Windows) and make sure that I haven't missed any other usages of the commons-cli package.\n\nI don't know if it matters, but when I ran the tests that passed, I did so on Windows.  I did the precommit on Linux, though – I don't have all the prerequisites for that build target on my Windows machine. ",
            "id": "comment-14659138"
        },
        {
            "date": "2015-08-07T04:01:33+0000",
            "author": "Shawn Heisey",
            "content": "Second crack at a patch.  This time I found all places in the code where commons-cli is used and checked them for usage of deprecated bits.  They are all gone now.\n\nWhile I was there, I cleaned up some additional warnings in the source files that use commons-cli.  I'd appreciate a review to tell me if I have overstepped in any way.\n\nI'm running tests now (on Windows) and will do a precommit and nightly-smoke (on Linux) when/if that successfully completes.  I will also do some manual testing of the bin\\solr.cmd script to make sure that the arguments aren't completely broken. ",
            "id": "comment-14661270"
        },
        {
            "date": "2015-08-07T04:05:31+0000",
            "author": "Shawn Heisey",
            "content": "Added note to CHANGES.txt. ",
            "id": "comment-14661273"
        },
        {
            "date": "2015-08-07T04:18:47+0000",
            "author": "Shawn Heisey",
            "content": "For clarification, I was fixing warnings seen in Eclipse.  I'm well aware that Eclipse warns on much more than javac does, but most of the time I think that it's worth fixing the IDE warnings as well as the compiler warnings, or suppressing them in certain situations. ",
            "id": "comment-14661284"
        },
        {
            "date": "2015-08-07T07:17:15+0000",
            "author": "Shawn Heisey",
            "content": "Tests and precommit passed.  Several random bin\\solr commands also worked.\n\nAfter fixing the script to accept Ant 1.9, nightly-smoke passed too. ",
            "id": "comment-14661426"
        },
        {
            "date": "2017-05-10T20:58:32+0000",
            "author": "Mike Drob",
            "content": "Shawn Heisey - Do you want to take a look at this again? Commons-cli is up to 1.4, and we've dropped the morphlines contrib, so there patch needs a few updates, but in general I think it's a good idea. ",
            "id": "comment-16005406"
        }
    ]
}