{
    "id": "SOLR-11042",
    "title": "Sort by function query: throw exception if can't parse",
    "details": {
        "labels": "",
        "priority": "Minor",
        "components": [],
        "type": "Improvement",
        "fix_versions": [],
        "affect_versions": "7.0",
        "resolution": "Unresolved",
        "status": "Open"
    },
    "description": "I have a couple of use cases where I need to sort result list by function query values (something like sort query(..) desc or sort product(...) asc )\n\nEven if that ... could be a pretty complicated query with lots of clauses, this technique worked like a charm until I created a query in incorrect Solr's syntax , i.e. I created a string which FunctionQParser failed to parse ( I had something that in simplification could be described as sort=query($sortQuery) desc&sortQuery=type: a b c without proper df ).\n\nThis lead to unexpected behaviour (at least from my pov). See SortSpecParsing#parseSortSpecImpl :\n\n\tFunctionQParser failed to parse query, but exception wasn't thrown:\n\ncatch (Exception e) {\n            // hang onto this in case the string isn't a full field name either\n            qParserException = e;;\n            }\n\n\n\n\n\n\n\tSolr tried to handle sorting clause  as a field and made a lookup into Schema:\n\n          SchemaField sf = schema.getFieldOrNull(field);\n          if (null == sf) {\n                    ......\n\n\n\tI had a \"match all\" field type mapped on * in schema, and this type was matched by string query($sortQuery)\n\tThen there are two possibilities (and I don't like both of them):\n\t\n\t\tIf \"match all\" field type is multi valued, there would be an exception\n\n can not sort on multivalued field: query($sortQuery)\n\n\n\t\tIf \"match all\" field type is single valued, then it would try to sort by values for field query($sortQuery)  (without any exceptions)\n\t\n\t\n\n\n\nI understand (by tests running) from where this error hiding came from. \n\nBut what if we will make some basic efforts to help guys like me to detect errors in syntax as soon as possible  (see SOLR-11042.patch) ? WDYT?",
    "attachments": {
        "SOLR-11042.patch": "https://issues.apache.org/jira/secure/attachment/12876445/SOLR-11042.patch"
    },
    "issue_links": {},
    "comments": []
}