{
    "id": "SOLR-4878",
    "title": "Change default directory for infostream from CWD to dataDir",
    "details": {
        "affect_versions": "4.3",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [],
        "type": "Bug",
        "priority": "Major",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "The default directory for the infoStream file is CWD.  In a multicore system where all the cores share similar configs, the output from all cores is likely to end up in the same file.  Although this is sometimes the desired outcome, it seems less than ideal.  If you've got cores that literally share the same config file, or you're using SolrCloud where more than one core on the system uses the same config set, you won't have the option of putting different files in different configs.\n\nIf the default directory were dataDir rather than CWD, each core would get its own infostream file.  You could still get the original behavior by specifying an absolute path.",
    "attachments": {
        "SOLR-4878.patch": "https://issues.apache.org/jira/secure/attachment/12585372/SOLR-4878.patch"
    },
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13670091",
            "date": "2013-05-30T06:11:10+0000",
            "content": "One workaround is this:\n\n\n  <infoStream file=\"INFOSTREAM-${solr.core.name}.txt\">false</infoStream>\n\n\n\nI've initially filed the issue as a bug, but I'm not entirely sure that's correct. "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13670105",
            "date": "2013-05-30T06:34:52+0000",
            "content": "First try at a patch.  It also removes a couple of unnecessary warning suppression lines.  Is there a better way of doing this? "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13672152",
            "date": "2013-06-01T16:50:24+0000",
            "content": "First patch doesn't work.  The dataDir field in SolrIndexConfig is null when the infostream config is processed.  This is because the dataDir field only refers to a dataDir element in the solrconfig.xml.  That means that the patch (as written) would only be useful if dataDir is defined in solrconfig.xml, but in a multicore world, that is rare.\n\nThis new patch uses a different approach.  There's one detail that I don't like - because the only path information I found to be available was indexDir, I used \"..\" to construct the final path.  It seems like a bad idea to clutter the actual index directory with the infostream file, but that would make the code cleaner. "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717212",
            "date": "2013-07-23T18:47:29+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971183",
            "date": "2014-04-16T12:57:23+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}