{
    "id": "SOLR-4243",
    "title": "dataimporter -- option to clear/reset status screen",
    "details": {
        "affect_versions": "None",
        "status": "Open",
        "fix_versions": [
            "4.9",
            "6.0"
        ],
        "components": [
            "Admin UI",
            "contrib - DataImportHandler"
        ],
        "type": "Improvement",
        "priority": "Minor",
        "labels": "",
        "resolution": "Unresolved"
    },
    "description": "I would like to see an option to clear/reset the DIH status screen to its \"never been run\" state.  If the current status of the handler is 'busy' this should probably do nothing, and perhaps should even throw an exception that could be seen by SolrJ and visible in a browser window, in the same manner as the PingRequestHandler when the health-check file is missing.",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "author": "Shawn Heisey",
            "id": "comment-13546254",
            "date": "2013-01-07T20:53:35+0000",
            "content": "Additional note - goals and motivations:\n\nI wrote a servlet page that grabs the DIH status of all my build cores, then puts it into a pretty table format.  If I go through the following sequence of events, I end up with old information in the table:\n\n1) Run a full-import on all my shard build cores\n2) Swap those into place as the live cores.\n3) Run another full import on the build cores.\n4) Swap those into place as the live cores.\n\nThe servlet page at this point contains the information from the import run at step 1.  I thought it would be nice to have a \"/dataimport?command=reset-stats\" to insert before step 1 and step 3, which would reset the dataimport status on my live cores to what you get if an import has never been run, so that when step 4 is done, the tables on the servlet output are once again clean.\n\nIf \"reset-stats\" is not a good choice, feel free to bikeshed! "
        },
        {
            "author": "Shawn Heisey",
            "id": "comment-13636796",
            "date": "2013-04-19T19:50:18+0000",
            "content": "Implementing this would be a good learning experience for me, but I won't object if someone else wants to take over!\n\nThis comment is part of an effort to close old issues that I have reported.  Search tag: elyograg2013springclean "
        },
        {
            "author": "Steve Rowe",
            "id": "comment-13717253",
            "date": "2013-07-23T18:47:38+0000",
            "content": "Bulk move 4.4 issues to 4.5 and 5.0 "
        },
        {
            "author": "Uwe Schindler",
            "id": "comment-13971215",
            "date": "2014-04-16T12:57:29+0000",
            "content": "Move issue to Solr 4.9. "
        }
    ]
}