{
    "id": "SOLR-7105",
    "title": "Running Solr as a windows service",
    "details": {
        "components": [],
        "type": "Improvement",
        "labels": "",
        "fix_versions": [
            "7.0"
        ],
        "affect_versions": "None",
        "status": "Open",
        "resolution": "Unresolved",
        "priority": "Major"
    },
    "description": "Since we moved away from shipping a war, it's useful to have scripts to start Solr as a service.\n\nIn 5.0 we already added a script for unix systems, we should also add one for windows.\n\nThe Commons Daemon project seems like a good way to implement it - http://commons.apache.org/proper/commons-daemon/procrun.html",
    "attachments": {},
    "issue_links": {},
    "comments": [
        {
            "date": "2015-02-12T21:20:58+0000",
            "author": "Uwe Schindler",
            "content": "Yeah, we should then also use the Apache Code Signing Service to sign the daemon exe files. Tomcat is also doing this. ",
            "id": "comment-14318999"
        },
        {
            "date": "2016-01-26T19:02:43+0000",
            "author": "Peter Tyrrell",
            "content": "Until this is implemented, here is an example gist in PowerShell that shows how to run solr.cmd as a Windows Service: https://gist.github.com/peaeater/eeb9593dfe30b5ab84c9. The example requires nssm.exe (Non-Sucking Service Manager from https://nssm.cc). ",
            "id": "comment-15117759"
        },
        {
            "date": "2016-01-28T15:52:02+0000",
            "author": "Jan Høydahl",
            "content": "Anyone who know PowerShell and Windows services good enough to attempt something here? Would be awesome to have a Windows \"installer\" as well! Do we really need commons daemon, or can a Windows service simply start and monitor a cmd or ps script? ",
            "id": "comment-15121760"
        },
        {
            "date": "2016-10-31T13:37:38+0000",
            "author": "Jan Høydahl",
            "content": "Also check out SOLR-5176 for an attractive alternative for providing Windows installer support. Chocolatey is like apt-get and keeps a central registry of installer scripts, typically Powershell, and will install unattended. ",
            "id": "comment-15622172"
        },
        {
            "date": "2016-11-29T00:00:40+0000",
            "author": "Alex Crome",
            "content": "Unfortunately you can't run any old executable as a windows service - it needs to understand how to communicate with the Service Control Manager.  Thus some wrapper (nssm or commons daemon wrappers) is required.\n\nI have a script that does a basic install of solr at https://gist.github.com/afscrome/e6c4f3c8e9ca89e9882b1b77fde1e2c0 which should be a good starting point.  Specifically it:\n\n\tSets up solr as a windows service (through nssm)\n\tWork around an issue with nssm being unable to gracefully stop solr (due to windows stupidity)\n\tAvoid double logging in both nssm logs & solr logs\n\tSet up solr with least required privileges (Service specific virtual account + minimal permissions).  (Needs more work as solr.cmd doesn't support everything to provide a clean split between app files & data files, like the opt/var split supported in the bash scripts)\n\tWork around for SOLR-9760 when running with minimal permissions\n\tSome diagnostics to make troubleshooting service installation failures easier.  (Specifically determining whether to look at nssm, solr or windows event logs to troubleshoot further).\n\n\n\nWork needed\n\n\tProbably needs to allow for more configuration options (solr home, log directory etc.) Check what the linux script supports)\n\tShould probably add a NoStartService option that installs the service, but doesn't start it after.\n\tAny problems with using nssm over Commons Dameon? I'm not familiar with the latter.\n\n\n\nThis script supports Win 8 / Server 2012 +.  Win 7 and Server 2008 R2 will work, but will require powershell 3 or higher to be installed.  Might be able to support older versions of powershell, but would need more investigation.  ",
            "id": "comment-15703621"
        },
        {
            "date": "2017-02-14T11:46:06+0000",
            "author": "Jan Høydahl",
            "content": "Alex Crome, your service install script looks promising. If you would like to take the lead on integrating it into the distribution, then perhaps we could end up with committing ans shipping it as the default Windows installer? Then, in turn the Chocolatey package in SOLR-5176 could call the new installer script with correct options instead of implementing their own service install features.\n\nIf you would like to continue on this, may I suggest this approach:\n\n\n\tCreate a patch SOLR-7105.patch and attach it to this issue or a Pull Request (see http://lucene.apache.org/solr/community.html#how-to-contribute)\n\tGather feedback and implement more features. Guess the goal should be to mimic the Linux install script as closely as possible (but in PS style syntax)\n\tStart a documentation page in the Wiki, which would later be added to the RefGuide\n\n\n\nWrt NSSM vs Commons-Daemon, I guess commons daemon is a bit more feature rich than NSSM, and I kind of like the philosophy better instead of having to run the command a hundred times to update various registry settings... But any would do...\n\nQuestions:\n\n\tShould the script (optionally?) also unzip the distribution ZIP file, like the Linux installer? Problem is, there is no zip --strip-components on windows, we could document how to use jar xf though, since Java should already be installed. PS's Expand-Archive is not able to unzip one file only\n\tCheck whether Java is installed? And other prerequisites?\n\tWhere should solr.in.cmd be located by default?\n\tShould Solr by default be installed to %ProgramFiles% and SOLR_HOME to %ProgramData%?\n\n ",
            "id": "comment-15865632"
        },
        {
            "date": "2017-05-13T18:29:13+0000",
            "author": "Jan Høydahl",
            "content": "Anyone who want to pick up this issue again? Would be awesome to have Windows installer support for 7.0.  ",
            "id": "comment-16009453"
        },
        {
            "date": "2017-07-20T15:38:32+0000",
            "author": "Colvin Cowie",
            "content": "Any problems with using nssm over Commons Dameon? I'm not familiar with the latter.\n\nWithout naming names, I am aware of at least one company (which uses Solr) that prohibits the use of NSSM in its products / solutions because they don't want to be associated with something that advertises itself with the words \"nssm is a service helper which doesn't suck. srvany and other service helper programs suck...\".\n\nWhether or not other companies would have a similar issue with NSSM, I cannot say, but Commons Daemon doesn't have that issue and is widely used and fairly straightforward once you get going with it. ",
            "id": "comment-16094840"
        }
    ]
}